[
  {
    "title": "Walker Kessler injury: Jazz lose center for the season with torn labrum - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/walker-kessler-injury-utah-jazz-center-out-for-season-with-torn-labrum/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/8d867961-e651-47bc-8da9-bdc87a529a6e/thumbnail/1200x675/d7b5f996b794e30c2b36a73067950deb/walker-kessler.jpg",
    "tag": "Sports",
    "date": "2025-11-05T19:50:55.000Z",
    "description": "\n        Following an impressive win over the Boston Celtics on Monday, the Utah Jazz got some sobering news Wednesday afternoon as the team announced",
    "body": "\n        Following an impressive win over the Boston Celtics on Monday, the Utah Jazz got some sobering news Wednesday afternoon as the team announced big man Walker Kessler is expected to miss the remainder of the season after suffering a torn labrum in his left shoulder.It's an unfortunate outcome for the Jazz, who were out to a 3-4 start with wins over the Clippers, Celtics and Suns. Utah saw great success with a jumbo lineup where they started Lauri Markkanen, Kyle Filipowski and Kessler, all of whom are 7-footers. With that trio on the floor, the Jazz post an absurd net rating of +22.1 in five games.Kessler missed the last two games for the Jazz as what the team was calling shoulder bursitis. The timing couldn't be worse for Kessler as he's set to become a restricted free agent next summer after he and the Jazz couldn't come to an agreement on a contract extension in the offseason. Kessler could've been in line for a major payday next summer if his production to start the season maintained, after averaging a career high 14.4 points, 10.8 rebounds, three assists and nearly two blocks. But now, This injury will certainly impact the amount of money he'll be able to get from Utah or any other interested team.Because the Jazz didn't sign Kessler to an extension in the offseason, there was speculation that he could be a trade target this season considering Utah does have Filipowski as an insurance policy. Now, though, this injury certainly dispels any trade talk for the season.\nThere's no doubt that losing Kessler is a negative for the Jazz. The rim protection he provides and the improved offensive game he was displaying this season was a bright spot to start the season. But if Utah was searching for a silver lining in this situation, it's that losing Kessler does help the Jazz's draft odds for next season. That's probably not what the team is thinking about at this point in time, but in a competitive Western Conference this Utah team was never equipped to make any sort of real run in the playoffs if it got that far. Not with a roster that should be valuing the development of its young players like Ace Bailey and has a large collection of guys who are in the first three years of their careers.Currently, the Jazz have the 13th best odds in the lottery, and if their pick landed there it would become the Thunder's pick due to a 2021 Derrick Favors trade. The pick is top-8 protected, so if it falls outside of that the Thunder would get the pick, which is certainly not what Utah wants. If it lands inside the top 8, the Jazz would also have the ability to swap picks with either of Minnesota or Cleveland if either of those teams land higher in the draft order, which is unlikely at this point.\nSo essentially, as cruel as it is, Kessler's injury helps the Jazz keep their pick for the 2026 draft. If they continued on this winning path, then Utah would almost certainly have to hand that first-round pick to the Thunder. And in a loaded draft class in 2026, with a slew of topend talent that can transform a franchise, it's in Utah's best interest to do everything in its power to try and keep that pick. Kessler's injury is a significant blow in the short term, but from a big picture view, this positions Utah better down the line.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Walker Kessler injury: Jazz lose center for the season with torn labrum - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/8d867961-e651-47bc-8da9-bdc87a529a6e/thumbnail/1200x675/d7b5f996b794e30c2b36a73067950deb/walker-kessler.jpg"
      ],
      "datePublished": "2025-11-05T19:50:55.000Z",
      "dateModified": "2025-11-05T19:50:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warriors' Draymond Green chasing Tim Duncan, Kobe Bryant, others in elite NBA category - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/draymond-green-consumed-by-trying-to-join-five-icons-with-10-all-defensive-team-honors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/3aa15ac8-2467-4be2-954d-33f8683fff39/thumbnail/1200x675/7c6a1a8ca5840be3dbe4051db1b99d97/draymond.jpg",
    "tag": "Sports",
    "date": "2025-11-05T19:08:13.000Z",
    "description": "\n        Draymond Green is one of the best defenders of his generation. He has been the heart and soul of the Warriors defense that helped Golden Stat",
    "body": "\n        Draymond Green is one of the best defenders of his generation. He has been the heart and soul of the Warriors defense that helped Golden State capture four championships, and as the 2025-26 season begins, he has a significant personal milestone within reach. If he joins one of the NBA All-Defensive teams, it will be the 10th selection of his career, an accomplishment that only five all-time greats achieved. The list of players with 10 All-Defensive team nods is Tim Duncan (15), Kobe Bryant (12), Kevin Garnett (12), Kareem Abdul-Jabbar (11) and Scottie Pippen (10) -- Hall of Famer Bobby Jones would make it six players if you include ABA honors. Joining that illustrious group became the main individual goal for Green in his 12th season in the NBA, as he told The Athletic's Sam Amick that learning about that list late last season helped fuel his fire on the defensive end of the floor. \n\"You see a list like that, and that immediately becomes your 'why,'\" Green said. \"It's like, 'Man, I need to give all that I f---ing can to be on that thing.' When you look at a list like that and you say, 'Man, I can be on that list.' It's captivating. If I'm honest, it consumes you.\"You're always looking to add these stamps. And I think for me personally, that's one stamp that I would love to add, for no other reason than the little kid from Saginaw being able to one day look at that list and say, 'Damn, my name is on the list with those guys.' ...So that's a huge, huge, huge goal of mine.\"Green is already in special company after making his ninth All-Defensive team a season ago, as that tied him with the likes of Michael Jordan, Hakeem Olajuwon, Gary Payton and others. However, that 10th selection would truly put him in rare air, and for a player that's accomplished so much in his career, finding those kinds of pursuits can be important in finding that motivation for the regular season grind. \nThe Warriors are off to a solid 5-3 start to the season, with a top-10 defense helmed by Green helping to lead the way. The best part for the Warriors about Green having this particular individual goal is that if he accomplishes it, the team will likely be closer to their goal of competing for a championship as well. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warriors' Draymond Green chasing Tim Duncan, Kobe Bryant, others in elite NBA category - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/3aa15ac8-2467-4be2-954d-33f8683fff39/thumbnail/1200x675/7c6a1a8ca5840be3dbe4051db1b99d97/draymond.jpg"
      ],
      "datePublished": "2025-11-05T19:08:13.000Z",
      "dateModified": "2025-11-05T19:08:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL predictions: How trade for Sauce Gardner impacts the Colts' Super Bowl chances, according to proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-how-trade-for-sauce-gardner-impacts-the-colts-super-bowl-chances-according-to-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/221e830e-4f57-4c84-b37b-fc750d9672f6/thumbnail/1200x675/4eb88bac256e948a2c97fc334f78a26d/imagn-sauce-gardner-jets.jpg",
    "tag": "Sports",
    "date": "2025-11-05T19:00:09.000Z",
    "description": "\nEven though Shaquille Leonard retired from professional football last month and hasn't suited up for the Indianapolis Colts since November 2023, the ",
    "body": "\nEven though Shaquille Leonard retired from professional football last month and hasn't suited up for the Indianapolis Colts since November 2023, the former linebacker and Colts icon had a resounding reaction on Tuesday after Indianapolis traded for two-time All-Pro cornerback Sauce Gardner of the Jets.\"Yes sir!!' Colts are all in!!!\" Leonard shared on X.\nThe SportsLine Inside the Lines team and Projection Model shares Leonard's excitement over the Colts' acquisition of Gardner, arguably the best cover corner in the league. In fact, no team in the NFL improved its chances to win the Super Bowl at the trade deadline more than Indianapolis, according to the model.To recap: The Colts sent two first round picks (2026 and 2027) as well as receiver Adonai Mitchell, who was a second-round pick in 2024, to New York for the sticky 6-foot-3 corner. After being selected No. 4 overall in the 2022 NFL Draft, Gardner immediately became one of the best corners in the league, earning the Defensive Rookie of the Year Award and being selected to the All-Pro team in 2022. After another All-Pro season in '23, he became the only corner since 1970 to make the team in his first two seasons in the league. The 25-year-old Gardner goes from a Jets team that's one of the worst in the league to a Colts team that's one of the best. Only the Titans (1-8) and Saints (1-8) have a worse record than New York (1-7). Meanwhile, Indianapolis (7-2) is tied with the Broncos and Patriots for the best record in the NFL.With the success on the field this season, the front office made the decision to aim high and shore up the defense. The Colts have given up 101 passing plays of at least 10 yards this season, the most in the NFL. In addition they are giving up 244.8 passing yards per game; just six teams are allowing more.Enter Gardner, who leads all corners in WAR (2.19) since he entered the league, according to Pro Football Focus.The SportsLine Projection Model loves the acquisition. Prior to Tuesday, the model gave Indianapolis a 5.6% chance to win the Super Bowl. After the trade for Gardner, the model says the Colts have a 6.6% chance. The 1.0% differential represents 18% growth. That's the greatest increase of any team in the league on Tuesday.Projected winsMake playoffsWin divisionWin AFCWin Super BowlBefore trade11.593.7%79.9%12.6%5.6%After trade11.694.4%81.3%13.4%6.6%Difference0.10.7%1.4%0.8%1.0%** 18% growth\"He's an unbelievable player,\" Indianapolis coach Shane Steichen said Wednesday. \"To get a bona fide No. 1 corner in this league elevates everybody around us. He's got all of the elite traits you look for. He's sticky in coverage, the pass breakups, the interceptions. He's feisty. He's aggressive.\"After news of the trade broke, the bettors jumped on the Colts to win the Super Bowl, driving the price down at BetMGM from +1300 before trade deadline to +1100. As of Wednesday, the price has settled at +1200.Indianapolis is set to play on Sunday against the Atlanta Falcons in Berlin, Germany, but Gardner is uncertain to make his Colts debut. On Oct. 19, he suffered a concussion against the Panthers and then sat out the following week. The Jets had a bye week last week, so Gardner will have almost three weeks to clear the league's concussion protocol. Steichen said Wednesday that Gardner would play against the Falcons if he clears protocol.Indianapolis is a 6.5-point favorite against Atlanta.\nEven if Gardner does not play on Sunday he should have a large impact on the rest of the regular season. The Colts still have games against dangerous pass offenses and receivers, including the Chiefs' Xavier Worthy, Rashee Rice and Hollywood Brown, the Texans' Nico Collins and the Seahawks' Jaxon Smith-Njigba.\"Having the opportunity to acquire a talented player like Sauce Gardner was one we did not want to pass on,\" general manager Chris Ballard said in a statement. \"He was a player that we scouted heavily coming out of college and there's a reason he was the fourth overall pick. Sauce is a proven cornerback. His skill and competitive nature will elevate everyone's play on the defensive unit. We're thrilled he's a Colt.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL predictions: How trade for Sauce Gardner impacts the Colts' Super Bowl chances, according to proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/221e830e-4f57-4c84-b37b-fc750d9672f6/thumbnail/1200x675/4eb88bac256e948a2c97fc334f78a26d/imagn-sauce-gardner-jets.jpg"
      ],
      "datePublished": "2025-11-05T19:00:09.000Z",
      "dateModified": "2025-11-05T19:00:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 10 NFL betting guide, odds, picks predictions, props, DFS lineups and fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-10-nfl-betting-guide-props-spreads-model-expert-parlay-dfs-fantasy-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/460636d3-9c89-4e79-b3e0-fdeca69acc26/thumbnail/1200x675/d7169dcf6333a3b2717838b069254d5b/lamar-jackson.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:29:37.000Z",
    "description": "\n        The Cleveland Browns are the only team that has yet to cover away from home, as the team is 0-5 ATS outside of Cleveland this year. Does that",
    "body": "\n        The Cleveland Browns are the only team that has yet to cover away from home, as the team is 0-5 ATS outside of Cleveland this year. Does that mean you should immediately jump on the Jets with Week 10 NFL picks as they host the Browns? New York just dealt away arguably its two best players at the trade deadline, which shifted the Week 10 NFL odds from the Jets being favored by 1.5 points to Cleveland now being 2.5-point favorites. Being aware of personnel changes, injuries and even weather should be a part of your Week 10 NFL betting guide as a fully informed bettor is one that often wins.Other NFL lines of a field goal or less include Texans vs. Jaguars (+1.5), Buccaneers vs. Patriots (+2.5), Chargers vs. Steelers (+3) on Sunday night and Packers vs. Eagles (+2.5) on Monday. Those primetime games feature the likes of Justin Herbert, Aaron Rodgers, Josh Jacobs and Saquon Barkley. Should your Week 10 NFL picks include any of them as part of your NFL DFS strategy, within Fantasy football lineups or among NFL player props? If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 10, SportsLine has you covered with its proven model, Machine Learning Model and team of experts. Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 10 that pays 25-1, and one of the legs is the Bills (-8.5, 50.5) covering against the Dolphins. The model has Buffalo covering in 60% of simulations, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $300 in bonus bets + 3 months of NBA League Pass if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Dolphins' Jaylen Waddle as one of its top value picks at receiver, while Detroit's Sam LaPorta is among the best values at tight end for Sunday's main slate. Here are its complete Week 10 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Browns' Harold Fannin Jr. as a top-5 Fantasy tight end in both standard and PPR formats. Get his full Week 10 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 10 Fantasy football rankings that can be used to make start-sit decisions. The Giants' Jaxson Dart is projected to be a top-10 Fantasy quarterback this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model enters Week 10 of the 2025 NFL season up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 47-29 run on top-rated picks dating back to 2024 and has revealed picks for every Week 10 NFL game. One of its favorite picks is the Buccaneers (-2.5, 48.5) covering versus New England, which cashes well over 50% of the time. You can find the model's picks for every NFL Week 10 game here. You can also use the latest FanDuel promo code to get $150 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Jeff Hochman, who is 4-1 (+385) over his last five picks in Ravens games is backing Baltimore (-3) to cover versus Minnesota. \"John Harbaugh and Jim Harbaugh are close brothers who talk on the phone... The Chargers played the Vikings two weeks ago. You don't think John will ask his brother, Hey, what did you see here, etc? They share insights. We know Lamar Jackson is outstanding against the NFC, going 24-3. Minnesota hasn't played Baltimore since 2021, and it didn't go well. The Ravens are well-rested and still in desperation mode.\" Hochman's NFL best bets for Week 10 can be found here.Broncos vs. Raiders 'Thursday Night Football' picksNo team has a better record (7-2) or a longer win streak than Denver, which has prevailed in six straight entering TNF. However, the Raiders have defeated the Broncos in eight of their last 10 meetings as the Broncos are 9.5-point home favorites for 'Thursday Night Football.' NFL expert, Larry Hartstein, who is 19-12 (+550) over his last 31 NFL ATS picks, is backing Denver to cover, saying, \"I would lay anything less than 10.\" The SportsLine advanced model says that one team covers in over 60% of simulations in an A-rated pick. See the Raiders vs. Broncos picks from the advanced model here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 10 NFL betting guide, odds, picks predictions, props, DFS lineups and fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/460636d3-9c89-4e79-b3e0-fdeca69acc26/thumbnail/1200x675/d7169dcf6333a3b2717838b069254d5b/lamar-jackson.jpg"
      ],
      "datePublished": "2025-11-05T18:29:37.000Z",
      "dateModified": "2025-11-05T18:29:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Auburn coaching search should be simple: Follow your own creed - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/the-auburn-coaching-search-should-be-simple-follow-your-own-creed/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/856218b3-be43-4a1e-ae15-00b8cda8faeb/thumbnail/1200x675/a4f01b9cdfdffe0083212040dd09925e/auburn-fans.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:18:31.000Z",
    "description": "\n        Auburn is once again in search of a savior. For the third time in five years, the Tigers are wading into the most chaotic coaching carousel i",
    "body": "\n        Auburn is once again in search of a savior. For the third time in five years, the Tigers are wading into the most chaotic coaching carousel in memory after firing Hugh Freeze, the man they hired three years ago to fix everything and instead has the program on pace for its first fifth straight losing season since the 1940s. Before their next leap of faith, Auburn's leadership needs to stop and ask how they got here.Take it from someone who lived and breathed on The Plains for seven years, who needed time to observe the community before understanding -- and reporting -- what made Auburn so magnetic and maddening. It's a program capable of winning championships despite facing numerous obstacles in a conference dominated by more powerful and affluent programs. To fix Auburn football, you first have to understand Auburn.It's hard to pinpoint when the cracks formed, but the slide began in 2017 when the school replaced longtime president Jay Gogue with Iowa State's Steven Leath. They hired a controversial figure, who sought disruption rather than direction, and his leadership poisoned the well.\nThat's when Auburn stopped being Auburn.The university's leaders began searching for monuments when all they really needed to do was look around them.Walk across Auburn's campus and you'll see it everywhere. It's etched on plaques, framed in hallways, whispered like gospel. The Auburn Creed, a 180-word declaration of values, is the program's moral north star.To outsiders, the very name draws eye rolls and muttered cynicism. It's a punchline. To opportunists, it's a prop they wear like a cloak to conceal their true intentions. \nHow can a creed rooted in hard work, honesty and a belief in a practical world endure in an age ruled by money and hypocrisy?Well, it can -- and it has -- even if it requires creative interpretation. The problem for Auburn is that somewhere along the way, its leaders stopped believing in their own people and started trusting outsiders. It's those people who convinced the Auburn family that they embodied their program rather than embracing it.As for Freeze, he violated the first line of their creed from the very beginning.\nFreeze may have preached hard work and humility, but his golfing habits and reluctance to chase big-time quarterbacks in the transfer portal -- along with troubling personal misconduct and NCAA violations from his past -- were not worthy of an SEC job, let alone a top-15 gig. He's out after a disastrous 16-19 record in two-plus seasons despite building a roster this season that had enough NFL talent, including an under-utilized crop of receivers, to win eight or nine games.The man before him, Bryan Harsin, was more fraud than fam. Harsin seemed to embody the hard-nosed motif of an \"Auburn Man,\" but self-righteousness trumped team loyalty and understanding, and that arrogance tainted every decision he made. Multiple players voiced concerns about his coaching style. The university launched an investigation. Recruiting hit an all-time low, primarily because of Harsin's reluctance to develop relationships within the state of Alabama. Everything he touched disintegrated, and so did his tenure: 9-12 in less than two seasons.\nAuburn can't afford another mistake, and John Cohen knows it. To understand what it takes to win at Auburn, one must understand, well, Auburn. Auburn's athletics director is a grinder, a former blue-collar athlete who rose from Birmingham-Southern College to a contributor on Mississippi State's World Series team in 1990. He later coached the Bulldogs on the diamond, finishing as national runner-up in 2013.Always inquisitive, Cohen's path diverged from that of a top-tier coach to athletics director. Now he carries the burden of repairing Auburn's identity.\"I grew up in the state of Alabama. I know how special this fanbase is, and again, I wake up every morning saying, 'We've got to get this done,'\" Cohen said Monday. \"We've got to get it done for people who are at the top of that upper deck, the people who are on our streets, the people who are on the field. We've got to get this done. And again, I know fans hear that we're close, right? I'm not going to say that we're close. Close doesn't matter. Getting it done matters.\"\nThe booster culture hovering over Auburn's every remains a threat. Interference is part of the DNA Before Harsin's hire in late 2020, some boosters tried to install defensive coordinator Kevin Steele as head coach. It failed. When AD Allen Greene was thrown to the curb, Cohen was hired away from Mississippi State. He insists he'll lead the search alone. \"I am the committee,\" he said. \"Even though I will listen and I will do as good of a job as I possibly can of taking in information, I will be the committee.\"If so, Cohen's search to identify top candidates shouldn't take long, particularly if \"The Auburn Creed\" is the backbone. Industry sources believe Tulane's Jon Sumrall should and will emerge as the Tigers' top target. \nThe Huntsville, Alabama native took over a Troy program with five wins in 2021 and quickly lit the Sun Belt ablaze, going 23-4 with two conference titles in two years. He advanced to the American Conference's championship game in his first year at Tulane and is currently 6-2 heading into the final three games of the season.He's a grinder, a relationship-builder and -- to a fault -- brutally honest. Dozens of Alabama high school coaches, including ardent Tide supporters, consider him a friend.More importantly, those who know Sumrall believe he exemplifies everything Auburn stands for, and his fiery personality will enhance what has long been lost on the Plains. (It doesn't hurt that his wife, Ginny, is an Auburn alumna, too.)\nOthers to consider include ousted Penn State coach James Franklin, who has been contacted by several schools, including Arkansas and Virginia Tech, sources tell CBS Sports, but is allowing the coaching carousel to spin before considering more options. Missouri's Eli Drinkwitz is a possibility, although he may opt to stay in Columbia, even if Florida becomes involved in his candidacy, according to sources.Arizona State's Kenny Dillingham, who coordinated Auburn's offense in 2019, is an intriguing candidate; however, it's believed that a substantial financial package and increased NIL support will be required to pique any interest in leaving his alma mater.\nThe answer for Auburn seems simple: Find a man who embodies what you were and can be, not someone who sells you a bill of goods they don't care to understand.In a cynical world, old-fashioned cheesy cliches and creeds still work at Auburn. That warm blanket provides insulation from the outside world, and it's why Auburn was once so magically maddening.For all its chaos, Auburn's identity has always been its secret weapon. When Nick Saban ruled college football in the 2010s, the Tigers somehow clawed the GOAT's face three times. They won or appeared in three SEC championship games and also won a national title, advancing to the national championship game twice.\nAuburn lost its way when it stopped believing in itself and turned to outsiders for answers. All the Tigers have to do is trust themselves and look around. The answers are all around them.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Auburn coaching search should be simple: Follow your own creed - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/856218b3-be43-4a1e-ae15-00b8cda8faeb/thumbnail/1200x675/a4f01b9cdfdffe0083212040dd09925e/auburn-fans.jpg"
      ],
      "datePublished": "2025-11-05T18:18:31.000Z",
      "dateModified": "2025-11-05T18:18:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Thursday Night Football' predictions, odds: Raiders vs. Broncos picks from expert on 8-2 roll - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-raiders-dolphins-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/15/30f4b8e1-d526-4f8e-ac27-327ffe9a3dbd/thumbnail/1200x675/87a0d97e0914a862b8a4c82de2dad1a5/geno-smith-las-vegas-raiders-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:54:18.000Z",
    "description": "\n        The Denver Broncos will look to win their seventh consecutive game when they take on the AFC West-rival Las Vegas Raiders on 'Thursday Night ",
    "body": "\n        The Denver Broncos will look to win their seventh consecutive game when they take on the AFC West-rival Las Vegas Raiders on 'Thursday Night Football.' Denver is coming off an 18-15 win at Houston on Sunday, while Las Vegas dropped a 30-29 overtime decision to the Jacksonville Jaguars. The Raiders (2-6), who have lost two in a row, are 1-3 on the road this season. The Broncos (7-2), who lead the AFC West by one game over the Los Angeles Chargers, are 4-0 on their home field.Kickoff from Empower Field at Mile High in Denver is set for 8:15 p.m. ET. Las Vegas leads the all-time series 73-56-2, but Denver has won the last two meetings. The Broncos are 9.5-point favorites in the latest Raiders vs. Broncos odds, while the over/under for total points scored is 42.5 via SportsLine consensus. Before making any Broncos vs. Raiders picks, be sure to check out what SportsLine expert Zack Cimini has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A Las   Vegas handicapper who's never afraid to buck conventional wisdom, Cimini was profitable in the NFL (35-25-4, +$727) last season, and he's on an 8-2 roll (+585) on his picks involving the Raiders. Anyone following him at sportsbooks and on betting apps has seen impressive returns. Now, Cimini has zoned in on Raiders vs. Broncos. You can head to SportsLine now to see his picks. Here are several NFL betting lines and NFL odds for Broncos vs. Raiders:Raiders vs. Broncos                     spreadDenver -8.5 at DraftKings SportsbookRaiders vs. Broncos                       over/under42.5 pointsRaiders vs. Broncos                       money line Denver -493, Las Vegas +376Raiders vs. Broncos                       picksSee picks at SportsLineRaiders vs. Broncos                       streaming Amazon Why the Broncos can coverQuarterback Bo Nix powers the Denver offense. In nine games this season, he has completed 197 of 322 passes (61.2%) for 1,976 yards and 17 touchdowns with six interceptions. He has also rushed 42 times for 207 yards (4.9 average) and three touchdowns. In a 28-3 win over Cincinnati on Sept. 29, he completed 29 of 42 passes for 326 yards and two touchdowns with one interception. He also rushed for one touchdown.His top target in the passing game is veteran wide receiver Courtland Sutton. In nine games, he has 38 receptions for 566 yards (14.9 average) and four touchdowns. He has 10 explosive plays of 20 or more yards, including a long of 52, with 154 yards after the catch and 27 first-down conversions. In a 23-20 loss to the Los Angeles Chargers on Sept. 21, he caught six passes for 118 yards and one touchdown. See which team to back at SportsLine. Why the Raiders can coverLas Vegas may be a little shorthanded after trading wide receiver Jakobi Meyers to the Jacksonville Jaguars on Tuesday. Quarterback Geno Smith leads the offense, completing 164 of 243 passes (67.5%) for 1,664 yards and 11 touchdowns with 11 interceptions. He is also the Raiders' second-leading rusher, carrying 27 times for 81 yards, including one explosive play of 20 yards. In Sunday's loss to Jacksonville, he completed 29 of 39 passes for 284 yards and four touchdowns with one interception.Without Meyers, wide receiver Tre Tucker will look to step up even further in the passing game. In eight games, he has 32 receptions for a team-high 427 yards and four touchdowns. He has six explosive plays, including a long of 61, with 189 yards after the catch and 19 first-down conversions. In a 41-24 loss at Washington on Sept. 21, he caught eight passes for 145 yards and three touchdowns. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make Raiders vs. Broncos  picksFor Thursday Night Football's matchup, Cimini is leaning under the total, but he also says a critical X-factor makes one side of the spread a must-back.     See what it is at SportsLine.Who covers in Broncos vs. Raiders and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the Raiders vs. Broncos spread you need to jump, all from the expert who returned $585 to $100 players over his last 10 Las Vegas Raiders picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Thursday Night Football' predictions, odds: Raiders vs. Broncos picks from expert on 8-2 roll - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/15/30f4b8e1-d526-4f8e-ac27-327ffe9a3dbd/thumbnail/1200x675/87a0d97e0914a862b8a4c82de2dad1a5/geno-smith-las-vegas-raiders-imagn-images.jpg"
      ],
      "datePublished": "2025-11-05T18:54:18.000Z",
      "dateModified": "2025-11-05T18:54:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks for Week 10, score predictions from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-10-picks-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/17/edc96354-a16d-4293-a93d-f624fe1d86ee/thumbnail/1200x675/30b9814509d8a7d097cb423d1023da20/james-cook-buffalo-bills-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-05T17:42:12.000Z",
    "description": "\n        Two sets of division leaders clash to headline the NFL Week 10 schedule. On Sunday, the AFC East-leading New England Patriots, led by quarter",
    "body": "\n        Two sets of division leaders clash to headline the NFL Week 10 schedule. On Sunday, the AFC East-leading New England Patriots, led by quarterback Drake Maye, battle the NFC South-leading Tampa Bay Buccaneers and quarterback Baker Mayfield. On 'Monday Night Football,' Jalen Hurts leads the Philadelphia Eagles into Lambeau Field to face Jordan Love and the Green Bay Packers. Both Tampa Bay and Green Bay enter as 2.5-point favorites. Another matchup involving contenders sees the Los Angeles Rams (6-2) traveling to San Francisco to face the 49ers (6-3) in a key NFC West matchup. The Rams are 4.5-point favorites as Matthew Stafford looks to avenge a 26-23 overtime loss to San Francisco on Oct. 2. He has won three of his last four starts against the 49ers. The largest spread is 9.5 points, with Buffalo (vs. Miami) and Denver (vs. Las Vegas) both favored by that amount. The game with the most line movement has been Jets vs. Browns, with Cleveland moving from a 2.5-point underdog to 2.5-point favorite after New York unloaded Sauce Gardner and Quinnen Williams in separate trades on Tuesday.Before making any Week 10 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 10 NFL betting, the AI PickBot has evaluated the NFL odds and provided NFL betting picks for all 14 games. You can only see the AI predictions for the Week 10 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 10 NFL AI picksAfter analyzing every game in Week 10, the AI says the Buffalo Bills (-9.5) cover comfortably against the Miami Dolphins, who may be on their way to a rebuild. Josh Allen leads the Buffalo offense, completing 70.4% of his passes for 1,833 yards and 13 touchdowns with four interceptions. He has also rushed 55 times for 280 yards (5.1 average) and seven touchdowns, including two in the 28-21 Week 9 win over the Kansas City Chiefs.Miami has struggled of late, losing four of their last five games, including a 28-6 loss to the Baltimore Ravens on Thursday Night Football on Oct. 30. In the aftermath of the game, the Dolphins parted ways with longtime general manager Chris Grier. SportsLine AI rates the Bills as an A+ pick on the money line and also predicts a 36-22 win on average. See its other Week 10 football predictions and football picks at SportsLine, and bet the Bills here:How to make Week 10 NFL picksIn addition, the AI PickBot has generated well over 20 highly-coveted A+ picks for Week 10. You need to see the AI's NFL picks before making any Week 10 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 10 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 10, score predictions from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/17/edc96354-a16d-4293-a93d-f624fe1d86ee/thumbnail/1200x675/30b9814509d8a7d097cb423d1023da20/james-cook-buffalo-bills-imagn-images.jpg"
      ],
      "datePublished": "2025-11-05T17:42:12.000Z",
      "dateModified": "2025-11-05T17:42:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL predictions: Titans have close to 50% chance for second straight No. 1 overall pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-titans-have-close-to-50-chance-for-second-straight-no-1-overall-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/027d4b63-c795-4d2d-a59e-d721cc7156d3/thumbnail/1200x675/d155b2879798eb707e22a56b3e25e533/gettyimages-2241305003.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:11:26.000Z",
    "description": "\nSince the inception of the NFL Draft in 1936, a team has had the No. 1 overall pick in back-to-back years eight times, with the Tampa Bay Buccaneers ",
    "body": "\nSince the inception of the NFL Draft in 1936, a team has had the No. 1 overall pick in back-to-back years eight times, with the Tampa Bay Buccaneers and Cleveland Browns both accomplishing the feat twice. The most recent club to pick first in consecutive years was the Jacksonville Jaguars, who selected quarterback Trevor Lawrence in 2021 and defensive end Travon Walker in the following draft.The Tennessee Titans have a solid chance to join the group, as they have won just one of their first nine games this season. Tennessee owned the No. 1 pick in the 2025 NFL Draft after going 3-14 last year and selected quarterback Cam Ward, who is 18th in the league with 1,760 passing yards after nine weeks and made just five touchdown passes while throwing six interceptions.There's plenty of competition for the top pick at the moment, as the New Orleans Saints possess the same 1-8 record as the Titans, who are on a bye in Week 10. The New York Jets are 1-7 after posting their first victory of 2025 in Week 8, while the Miami Dolphins and New York Giants sit at 2-7. Meanwhile, the Las Vegas Raiders and Cleveland Browns both are 2-6, and seven other teams enter Week 10 with only three wins.Tennessee currently has the most difficult remaining schedule among the seven teams with fewer than three victories, as five of its final eight games are against opponents with a winning record. Las Vegas is next, as five of its remaining nine foes are over .500, while New Orleans only faces three clubs with a winning mark over its last eight contests.The Titans still have two meetings with the AFC South-rival Jaguars on their slate, along with contests against the Seattle Seahawks, San Francisco 49ers and Kansas City Chiefs. Meanwhile, the Raiders face the Chiefs, Los Angeles Chargers and reigning Super Bowl champion Philadelphia Eagles once and the Denver Broncos twice.Tennessee suffered its fourth consecutive loss in Week 9 as it dropped a 27-20 decision to the Chargers at home. Following this week's bye, the Titans return with three more contests at Nissan Stadium, beginning with a divisional matchup against the disappointing Houston Texans (3-5) in Week 11.The Saints, who are 0-4 on the road this season, visit the surprising Carolina Panthers (5-4) in an NFC South showdown this week before going on their bye. They come back to take on the division-rival Atlanta Falcons (3-5) and Dolphins before facing the toughest remaining stretch of their schedule, which has them battling the Tampa Bay Buccaneers (6-2) and Panthers.\nSportsLine's Inside the Lines team and its projection model don't see New Orleans losing more games than Tennessee and finishing with the No. 1 pick in the 2026 NFL Draft. The ITL team's model, which simulates every NFL game 10,000 times, feels the Titans will be hard-pressed to register more than two wins over their final eight games and secure the top overall selection.TEAMPROJECTED 2025 WIN TOTAL2026 NO. 1 PICK %2026 TOP THREE PICK %Tennessee Titans3.047.15%81.38%New Orleans Saints4.316.81%46.87%New York Jets4.514.51%42.23%Miami Dolphins5.19.18%36.50%Las Vegas Raiders4.55.02%33.01%New York Giants4.92.39%18.99%Cleveland Browns5.81.45%11.56%Cincinnati Bengals5.91.14%9.83%Washington Commanders6.51.02%7.39%Atlanta Falcons6.80.83%6.33%Dallas Cowboys6.90.33%3.33%Arizona Cardinals7.60.06%0.97%Houston Texans8.10.06%0.64%Minnesota Vikings8.20.03%0.51%Baltimore Ravens8.70.01%0.27%Kansas City Chiefs10.70.01%0.01%Carolina Panthers7.90.00%0.16%Jacksonville Jaguars9.10.00%0.02%Chicago Bears9.20.00%0.00%Los Angeles Chargers10.10.00%0.00%Green Bay Packers10.10.00%0.01%San Francisco 49ers10.20.00%0.00%Pittsburgh Steelers10.20.00%0.00%Detroit Lions10.50.00%0.00%Los Angeles Rams11.10.00%0.00%Philadelphia Eagles11.20.00%0.00%New England Patriots11.20.00%0.00%Seattle Seahawks11.40.00%0.00%Indianapolis Colts11.50.00%0.00%Tampa Bay Buccaneers11.80.00%0.00%Denver Broncos11.90.00%0.00%Buffalo Bills12.00.00%0.00%The ITL team's model says the Saints will finish with more than four victories this season, while the Titans won't reach that mark and will have the No. 1 draft pick for the second straight year and fourth time in franchise history. After selecting Ward first overall this past April, Tennessee will be looking to address other needs in the 2026 NFL Draft, such as wide receiver, edge rusher or cornerback.New Orleans are 5.5-point underdogs in its matchup against Carolina on Sunday. The Saints have lost each of their last three games by double digits, with the last two defeats being by at least 20 points. Meanwhile, the Panthers are coming off their fourth win in five contests - a stunning 16-13 triumph over the Green Bay Packers at Lambeau Field.According to the model, the Saints -- who lost by one point at Carolina last season -- will keep this meeting close, as they cover the spread in 54% of simulations. However, it is predicting a 24-20 victory by the Panthers, who are 3-1 at home this season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL predictions: Titans have close to 50% chance for second straight No. 1 overall pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/027d4b63-c795-4d2d-a59e-d721cc7156d3/thumbnail/1200x675/d155b2879798eb707e22a56b3e25e533/gettyimages-2241305003.jpg"
      ],
      "datePublished": "2025-11-05T18:11:26.000Z",
      "dateModified": "2025-11-05T18:11:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Timberwolves prediction, odds: Wednesday NBA picks from proven computer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-vs-timberwolves-odds-prediction-line-time-2025-nba-picks-for-nov-5-from-proven-model/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/e42fd12b-434e-410b-9ca2-0951ce33ee0e/thumbnail/1200x675/ec357cee7fe90ecd0fe167d115db47ed/jalen-brunson-new-york-knicks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-05T17:25:52.000Z",
    "description": "\n        NBA title contenders meet in the national spotlight when the Minnesota Timberwolves travel to take on the New York Knicks on Wednesday. Both ",
    "body": "\n        NBA title contenders meet in the national spotlight when the Minnesota Timberwolves travel to take on the New York Knicks on Wednesday. Both teams are 4-3 this season, though New York is also 4-3 against the spread, while Minnesota is just 2-5 ATS. Anthony Edwards (hamstring), originally expected to be out for longer, has been upgraded to questionable for Minnesota. Karl-Anthony Towns (illness) is questionable for New York.Tipoff from Madison Square Garden is set for 7:30 p.m. ET. New York is a 3-point favorite in the latest Knicks vs. Timberwolves odds, while the over/under is 227.5. Before making any Timberwolves vs. Knicks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight seasons. The model enters Week 3 of the 2025-26 NBA season on a sizzling 26-13 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Knicks vs. Timberwolves 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Timberwolves vs. Knicks:Knicks vs. Timberwolves spread:    Knicks -3Knicks vs. Timberwolves over/under:    227.5 pointsKnicks vs. Timberwolves money line:    Knicks -155, Timberwolves +129Knicks vs. Timberwolves picks:    See picks at SportsLineKnicks vs. Timberwolves streaming:Fubo (Try for free)  Top Knicks vs. Timberwolves prop pick:After 10,000 simulations, SportsLine's model is projecting that Mikal Bridges goes Over 14.5 points, a prop that returns -128 (risk $128 to return $100). Bridges has cleared his points total in seven of his past 10 games when the Knicks were favored and playing a team with a winning record, which is the spot they are in on Wednesday.His points prop line is down a bit after he's scored just 10 points in each of his past two games. Zooming out a bit, however, he's averaging 16.4 points per game this season, and he averaged 19 points per game during the first five games of the season.Minnesota ranks 20th in the NBA in defensive efficiency, and the model is projecting that Bridges scores 17.1 points in the simulations, making it one of the highest-rated points prop picks for this matchup. See which team to back against the spread at SportsLine, and bet that prop here:How to make Knicks vs. Timberwolves picksSportsLine's model has simulated Timberwolves vs. Knicks 10,000 times and is leaning Over the total, projecting 228 combined points. The model also says one side hits in nearly 60% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Timberwolves vs. Knicks, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Timberwolves prediction, odds: Wednesday NBA picks from proven computer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/e42fd12b-434e-410b-9ca2-0951ce33ee0e/thumbnail/1200x675/ec357cee7fe90ecd0fe167d115db47ed/jalen-brunson-new-york-knicks-imagn-images.jpg"
      ],
      "datePublished": "2025-11-05T17:25:52.000Z",
      "dateModified": "2025-11-05T17:25:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB free agency: Alex Bregman, Cody Bellinger, Shota Imanaga, more players opt out - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-free-agency-option-opt-out-bregman-bellinger-alonso-diaz/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/c75a8fcb-bac6-455e-b5df-8abd1be891cb/thumbnail/1200x675/f61921be747cf92bd95549e1fe773ec4/bregman-getty.png",
    "tag": "Sports",
    "date": "2025-11-05T18:36:29.000Z",
    "description": "\n        Thursday, Nov. 6, is an important date on Major League Baseball's offseason calendar, as decisions on contract opt-outs and options must be m",
    "body": "\n        Thursday, Nov. 6, is an important date on Major League Baseball's offseason calendar, as decisions on contract opt-outs and options must be made by then. In the case of opt-outs and player options, players in essence may choose to become free agents for the 2025-26 offseason, and most of those are obvious decisions. Obvious or not, the opt-out and player-option decisions will be tracked below as they're reported. The important takeaway is that those players who opt out of their contracts or decline their player options (or their half of mutual options) are added to this winter's pool of free agents. With that background laid out, here's an updated rundown of those notable names who have chosen free agency. \nDecision: Cubs rejected team option, which triggered a player option, which he declinedRemaining contract: Three-year, $57 million team option/one-year, $15 million player option2026 age: 32CBS Sports free agent ranking: Not initially in top 25\nDecision: Declined player optionRemaining contract: One year, $24 million2026 age: 31CBS Sports free agent ranking: No. 7\nDecision: Declined player optionRemaining contract: One-year, $25 million/$5 million buyout 2026 age: 30 CBS Sports free agent ranking: No. 6\nDecision: Exercised opt-out clauseRemaining contract: Two years, $80 million2026 age: 32CBS Sports free agent ranking: No. 2\nDecision: Declined player optionRemaining contract: Two years, $37 million2026 age: 32CBS Sports free agent ranking: Not in top 25\nDecision: Declined player optionRemaining contract: Two years, $16 million2026 age: 35CBS Sports free agent ranking: Not in top 25\nDecision: Exercised player optionRemaining contract: One year, $20 million2026 age: 30CBS Sports free agent ranking: Not in top 25\nDecision: Declined to opt out Remaining contract: Two years, $55 million2026 age: 33CBS Sports free agent ranking: Not in top 25\nDecision: Exercised player optionRemaining contract: One year, $16 million2026 age: 30CBS Sports free agent ranking: Not in top 25 \nDecision: Declined player optionRemaining contract: One year, $6 million2026 age: 32CBS Sports free agent ranking: Not in top 25\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB free agency: Alex Bregman, Cody Bellinger, Shota Imanaga, more players opt out - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/c75a8fcb-bac6-455e-b5df-8abd1be891cb/thumbnail/1200x675/f61921be747cf92bd95549e1fe773ec4/bregman-getty.png"
      ],
      "datePublished": "2025-11-05T18:36:29.000Z",
      "dateModified": "2025-11-05T18:36:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Upset alert in NFL Week 10? Why these favorites could fall, including Jordan Love and the Packers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-10-upset-picks-underdogs-to-watch-betting-lines/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/11/fc1b6556-ae91-4a74-8744-5b502628a530/thumbnail/1200x675/1c247a7e992086a0e358f6ed24a2d0f6/jordan-love-green-bay-packers.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:15:32.000Z",
    "description": "\n        Did you take our advice last week to pull your foot off the gas with betting favorites? If so, you likely made a nice chunk of change in Week",
    "body": "\n        Did you take our advice last week to pull your foot off the gas with betting favorites? If so, you likely made a nice chunk of change in Week 9 as the dogs were barking throughout the slate. And if you specifically tailed the underdogs from our upset alert column a week ago, you know we were as dialed in as we've been throughout the season. Three of our five underdogs enjoyed upset wins, and all but one club ended up covering. The two straight-up losses that spurned us from a clean moneyline sweep were Las Vegas failing to convert the two-point attempt in overtime against the Jaguars, and the Bengals allowing a game-winning touchdown to the Bears with less than 25 seconds to go in regulation. Those last-second defeats stung, but overall, we had our finger on the pulse, correctly identifying Arizona, Buffalo, and Denver as live dogs. This week, the board isn't as flush with clear-cut underdogs, but some intriguing matchups could come down to the wire with upsets firmly on the table. Without further ado, let's dive into this week's collection of favorites who could be on upset alert.  \nNFL odds courtesy of FanDuel Sportsbook. Bet NFL at FanDuel and get $300 in bonus bets with a winning $5 wager.Philadelphia Eagles at Green Bay Packers (-2.5)When: Monday, 8:15 p.m. ET | Where: Lambeau Field (Green Bay, Wisconsin)TV: ABC/ESPN | Stream: (Fubo, try for free)Eagles ML odds: +114I think the Packers were caught looking ahead to this matchup, and the Panthers were able to hand them a fat L in the process. Because they were looking around the corner toward this NFC heavyweight matchup with Philadelphia, however, doesn't mean they are a lock to come out with a victory. Green Bay lost tight end Tucker Kraft for the rest of the season, and his absence cannot be overstated. He's been one of the most consistent weapons for Jordan Love, who'll now have to lean on a collection of young receivers. Meanwhile, they catch an Eagles team that will be well-rested after being on the bye in Week 9. That has proven to be a very favorable spot for Philly as they are 4-0 post-bye under Nick Sirianni. Not only are they rested, but the Eagles are also retooled. Howie Roseman addressed key areas of his defense, adding corners Michael Carter II and Jaire Alexander to the secondary, while bringing aboard edge rusher Jaelan Phillips. That makes this championship roster even more dangerous as they head into Lambeau Field. Baltimore Ravens (-4.5) at Minnesota VikingsWhen: 1 p.m. ET | Where: U.S. Bank Stadium (Minneapolis)TV: Fox | Stream: (Fubo, try for free)Vikings ML odds: +184The Ravens looked like their old selves with Lamar Jackson back last Thursday. Baltimore demolished the Dolphins, and the defense has continued to improve over the last few weeks. While it was encouraging to see them flex against Miami, they are not a competitive outfit in 2025, and Minnesota should prove to be a different beast entirely, particularly at home. J.J. McCarthy looked good in his return to action last week and led the Vikings to an upset win over the Lions. With Justin Jefferson headlining an elite group of skill position players, the Ravens defense will be tested. Moreover, so will Jackson as he squares off against a Vikings defense that is getting healthier with linebacker Andrew Van Ginkel making his return in Week 9. With Brian Flores pulling the strings, there's the possibility that Minnesota's defense can get after Jackson and throw the Ravens offense off-kilter, which makes life even easier for McCarthy. The Vikings are also 4-0 at home against the AFC over the last two seasons. \nNew England Patriots at Tampa Bay Buccaneers (-2.5)When: 1 p.m. ET | Where: Raymond James Stadium (Tampa, Florida)TV: CBS | Stream: Paramount+Patriots ML odds: +120Arguably no team is playing better right now than the New England Patriots, who have ripped off six straight wins coming into Week 10. They face their toughest task since squaring off against the Bills in Buffalo as they head to Tampa to face an equally impressive Bucs team. While this will be a challenge, the Patriots have shown they can go on the road and win, owning a 4-0 record away from Gillette Stadium this season. While the Buccaneers are 2-1 at Raymond James Stadium so far this season, they've only covered once, so these games have proven to be tight. New England is also uniquely equipped defensively to slow down the Buccaneers, particularly as they continue to deal with injuries. Mike Evans will be sidelined, and it's no guarantee that Tampa Bay will have Chris Godwin or Bucky Irving for this contest, leaving them quite thin. If New England's No. 1-ranked run defense slows down the Bucs' 24th-ranked rushing offense, and Christian Gonzalez shadows rookie Emeka Egbuka, that could be checkmate. Pittsburgh Steelers at Los Angeles Chargers (-3)When: 8:20 p.m. ET | Where: SoFi Stadium (Inglewood, California)TV: NBC | Stream: (Fubo, try for free)Steelers ML odds: +126The levee may be about to break along the Chargers offensive line. Over the summer, they lost tackle Rashawn Slater to a torn patellar tendon, and are now moving forward without fellow star tackle Joe Alt after he suffered a season-ending ankle injury in Week 9. The Chargers are just 1-3 without Alt since 2024, with the offense averaging 18.7 points per game. With Alt, the team is posting 24.7 points per game and is 16-6, so this is a seismic shift. And now they are supposed to slow down T.J. Watt and the Steelers pass rush? Yes, Pittsburgh's defense has been streaky, but Watt and Alex Highsmith should have no problem attacking Herbert, who has seen his interceptions tick up. If the Steelers can keep the momentum from logging six turnovers against Indy last week, there's a path to a primetime upset. \nCleveland Browns (-2.5) at New York JetsWhen: 1 p.m. ET | Where: MetLife Stadium (East Rutherford, New Jersey)TV: CBS | Stream: Paramount+Jets ML odds: +116After the Jets pulled off a massive fire sale at the NFL trade deadline that saw the likes of Sauce Gardner and Quinnen Williams get shipped out of town, the natural reaction is to fade them in Week 10. I understand the logic, but I'd caution against it, particularly against the Browns. While the defense will struggle over the long term, they may not miss Gardner and Williams in this spot. Cleveland is averaging 15.8 points per game this season, and has only marginally improved (17.5) with Dillon Gabriel as the starter. Gabriel comes into this matchup with just a 78.4 passer rating and a measly 4.9 yards per attempt average, so this isn't exactly a high-flying offense coming to town. Meanwhile, New York still has offensive weapons like Breece Hall and Garrett Wilson in the fold, which will help whoever is under center, whether it's Justin Fields or Tyrod Taylor. The Browns are 0-4 on the road this season and have been outscored by 81 points in the process. Yes, the Jets are gutted, but maybe not to the point where they are giving up points as a home dog to this Browns squad. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Upset alert in NFL Week 10? Why these favorites could fall, including Jordan Love and the Packers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/11/fc1b6556-ae91-4a74-8744-5b502628a530/thumbnail/1200x675/1c247a7e992086a0e358f6ed24a2d0f6/jordan-love-green-bay-packers.jpg"
      ],
      "datePublished": "2025-11-05T18:15:32.000Z",
      "dateModified": "2025-11-05T18:15:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys pony up to address defense: How DTs Quinnen Williams, Kenny Clark and Osa Odighizuwa will be utilized - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-pony-up-to-address-defense-how-dts-quinnen-williams-kenny-clark-and-osa-odighizuwa-will-be-utilized/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/02/21/9f778d02-8e2e-417a-ad3a-1ec45288cd72/thumbnail/1200x675/d73e1d756d269e4616afd7c7b27dc995/getty-osa-odighizuwa-cowboys.jpg",
    "tag": "Sports",
    "date": "2025-11-05T16:59:37.000Z",
    "description": "\n        FRISCO, Texas -- The Dallas Cowboys' defense appeared to be doomed to struggle throughout the 2025 season after another rough outing in Dalla",
    "body": "\n        FRISCO, Texas -- The Dallas Cowboys' defense appeared to be doomed to struggle throughout the 2025 season after another rough outing in Dallas' 27-17 \"Monday Night Football\" loss against the Arizona Cardinals in Week 9. One of the many reasons why the Cowboys (3-5-1) are the NFL's second-worst scoring defense (30.8 points per game allowed) through the first half of the year is the lack of an impact All-Pro contributor along the defensive line. That's an element that had been missing since Dallas traded away 26-year-old, All-Pro edge rusher Micah Parsons to the Green Bay Packers a week before the 2025 season began in exchange for two first-round picks and Pro Bowl defensive tackle Kenny Clark. That changed ahead of Tuesday's NFL trade deadline with Dallas owner and general manager Jerry Jones being good on his word and trading for 27-year-old, All-Pro New York Jets defensive tackle Quinnen Williams. He sent the Jets a 2026 second-round pick, the better one of the Cowboys' and Packers' 2027 first-round picks and 2023 first-round pick defensive tackle Mazi Smith on Tuesday in exchange for Williams. Dallas is ready to welcome Williams with open arms just weeks after facing him at the Jets in Week 5, a 37-22 Cowboys victory. \"We've played him a couple of times, just played him a couple of weeks ago. He's just a difference maker, the ability to affect the interior part of the pocket from a pass-rush standpoint. I think 12 sacks a couple of years ago [2022], under the tutelage of, not saying [now-Cowboys defensive line coach Aaron] Whitecotton did it, but Quinnen did it, but around ADub, very disruptive. For us, there's certain calls you make, you're very aware he's in the game because he's so disruptive,\" Cowboys coach Brian Schottenheimer said Tuesday. \"We had alerting calls when he was out of the game, we had to set protections based on him. You guys see it. You see the talent. I love the play style.\"\nWilliams isn't a one-year rental either: he is under contract through the 2027 season with cap hits of $21.75 million in 2026 and $25.5 million in 2027. That makes him one of three well-compensated, high-level defensive tackles on Dallas' roster in addition to 30-year-old Clark, who has cap hits of $21.5 million in 2026 and $20 million in 2027, and 27-year-old Osa Odighizuwa, who has cap hits of $20.75 million in 2026, $24.5 million in 2027 and $24.5 million in 2028. \"I think it's just going to add more playmaking ability to the D-line,\" Odighizuwa said Tuesday. \"Another bullet in the gun. Another very strong, and talented guy, so I think we'll be able to use him. ... I've seen his tape. I respect his game a lot. He's a baller, so I'm excited to have him on the team.\"So how will it work with the trio of Williams, Clark and Odighizuwa in terms of play time? Defensive coordinator Matt Eberflus runs a 4-3 scheme, which means four defensive linemen down on the line of scrimmage with three linebackers behind them in the second level of the defense. Odighizuwa has been a Cowboy his entire career since being selected in the third round of the 2021 NFL Draft, and he has started every game for Dallas since his second season in 2022, not missing a game in the last four seasons in this span. He still wants to remain an every game starter. \n\n        \n            \n                How Cowboys' 'all-in' trade deadline moves for Quinnen Williams and Logan Wilson could set up playoff push\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \n\"Very competitive D-tackle room. Extremely competitive, but we also got guys that are all starting-caliber D-tackles. I don't look at anybody in our room whether it be Solly [Solomon Thomas], Kenny, [seventh-round rookie] Jay [Toia] and now Quinnen or myself as someone that couldn't go and start somewhere else,\" Odighizuwa said. ... Obviously I want to keep starting. I wouldn't expect anybody in our room to want anything less, so that is what it is. ... A lot more competitive now.\"What Eberflus began to do more of in Week 9 against the Cardinals was five-down fronts, meaning five defensive linemen in the game along the line of scrimmage instead of the typical four. That switch yielded solid results for Dallas' pass rush as the unit collectively tied the team's single-game high in sacks with five against Arizona quarterback Jacoby Brissett, something the Cowboys also accomplished in Week 5 against Jets quarterback Justin Fields. Those five-down packages will be the primary way for Dallas to make sure all three of Williams, Clark and Odighizuwa get the level of playtime all three have become accustomed to. \"Again, think you guys saw last night, some of the things we were able to do from the five-down stuff that we played. I thought that was very good for us. The first down efficiency was one of our best of the year, and you can never have enough depth at the interior part of the defensive line. But we'll roll those guys through. We'll stay fresh,\" Schottenheimer said. \"But again, I do think you'll see us continue to use a five-down front. We liked some of the things. Thought Osa played his best game of the year. Most disruptive game last night. That was great to see.\"\nOne of the primary drivers for five-down fronts is to dissuade opposing offensive lines from double-teaming the defense's interior players. Williams (57 quarterback pressures vs. double teams since 2022) and Odighizuwa (53 quarterback pressures vs. double teams since 2022) are No. 1 and No. 2 in the NFL in quarterback pressures vs. double teams across the last three seasons, per Next Gen Stats. Those two each seeing fewer and fewer double teams should yield dividends for Dallas' defense now that they are teammates. \"I hope so. I like it,\" Odighizuwa said when asked about playing more five-down fronts. \"A lot of double teams are created when you have four [defensive linemen] down [on the line of scrimmage. So when you have the three of us in there, it kind of creates a lot more one-on-ones and a lot more opportunity for guys up front to make plays. Having a guy like that come in and potentially be able to use more five-down stuff, that would be awesome.\"Most QB Pressures vs. Double Teams Since 2022, Per Next Gen StatsQB Pressures Vs. Double TeamsQuinnen Williams (DAL)57Osa Odighizuwa (DAL)53Kobie Turner (LAR)52Dexter Lawrence (NYG)48Jarran Reed (SEA)48While Williams occasionally lined up on the edge of the line of scrimmage in New York, Dallas sees him as exclusively an interior player even among Clark and Odighizuwa, shining in one-gap and two-gap blocking schemes. \"He's [Williams] mostly been inside. He's really been the three technique, the two technique. They've played him on the left. They've played him on the right. We weren't really sure where he was going to go last time we played them, how they were setting it. Some of it was [the] matchup. I'll be sure to ask him when I talk to him. He'll be more inside,\" Schottenheimer said. \"But can he play outside as the edge? Yeah, he can. He's most disruptive inside just because of the speed and the power and the pad level that he has. When you can push the pocket back at the quarterback or push the center/guard back into the runners, it creates a lot of chaos.\"Odighizuwa rotated a little bit to the edge of the line as a rookie in 2021 as well as a season ago in 2024 under defensive coordinator Mike Zimmer. That's something he would be open to doing more in 2025 following the addition of Williams. \"I've rushed the edge in four down packages,\" Odighizuwa said. \"I haven't done it as much, but I'd be comfortable rushing out there. I've done it. I did some last year as well, a little more than I had in the past couple years. ... I think it's going to be good to be free. Definitely been getting double-teamed a lot. You now have a chance to be able to beat them.\"  Even though the Cowboys secondary remains battered by numerous injuries at both their safety and cornerback positions, the plan in Dallas is to do what they did with Parsons once again with Williams: create so much quarterback pressure that opponents don't have enough time or options to carve them up through the air. The Cowboys led the NFL with a team quarterback pressure rate of 40.2% with Parsons on board from 2021 to 2024. \"Well, it [adding Williams] should hopefully allow for less time for the quarterback to stand back there and see what's going on. What it does is creates one-on-ones. There's no way to slide. If you're in a four-down front, we can send the center one way or the other. When you have five guys out there, you can't send the center anywhere,\" Schottenheimer said. \"So your help will have to come from somewhere. Usually, you use a back. When you use a back, it limits how freely you can use that back. It creates a lot of problems honestly.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys pony up to address defense: How DTs Quinnen Williams, Kenny Clark and Osa Odighizuwa will be utilized - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/02/21/9f778d02-8e2e-417a-ad3a-1ec45288cd72/thumbnail/1200x675/d73e1d756d269e4616afd7c7b27dc995/getty-osa-odighizuwa-cowboys.jpg"
      ],
      "datePublished": "2025-11-05T16:59:37.000Z",
      "dateModified": "2025-11-05T16:59:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft: Top 100 prospects and big board rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/2026-nfl-draft-top-prospects-big-board-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/20e7dc5d-3090-408b-93e0-0dfe4ade4e87/thumbnail/1200x675/59bc1d4b5eba5523097f4542be36bb51/caleb-downs.jpg",
    "tag": "Sports",
    "date": "2025-11-05T18:16:54.000Z",
    "description": "\n        It may not be the quarterback class we'd hoped for, but it still looks like a step up from last year. After that, though, there aren't a ton ",
    "body": "\n        It may not be the quarterback class we'd hoped for, but it still looks like a step up from last year. After that, though, there aren't a ton of position groups I'd call \"loaded\" relative to recent expectations. It's part of why we've already seen so many teams feel comfortable unloading their first-rounders.That doesn't mean there isn't talent to be had, however. It simply means scouts are going to have to work overtime to parse through a less clear-cut draft order than we've seen in recent years. If you're looking for position groups with quality depth -- even if they aren't traditionally drafted highly -- interior offensive line and linebacker are where I'd start. There are 13 interior offensive linemen and nine linebackers represented in the top 100 below, both large numbers compared to the typical yearly crop that goes in the top three rounds.With that context in mind, let's dive into how the class stacks up in early November.1. Rueben Bain Jr., EDGE, Miami (Fla.)Bain is putting together the best season for a defensive end at the collegiate level since Aidan Hutchinson. Like Hutchinson, Bain isn't a cookie-cutter edge prospect. The Hurricanes defender has a defensive tackle build with shorter arms than ideal on the edge. It's no matter -- he already has 44 pressures this season.\n2. Peter Woods, DL, ClemsonWoods has been on scouting radars since he was a true freshman. He's as powerful a true junior defensive tackle as you'll see and won't turn 21 until a month before the draft. He'll be even more disruptive in the pros than he is in Clemson's defense.3. Fernando Mendoza, QB, IndianaThe Heisman front-runner continues to play clean football with 25 touchdowns and only four interceptions. His timing, decision-making and performance under pressure are already at an NFL level. He'll be a Day 1 starter next year.4. Jordyn Tyson, WR, Arizona StateTyson is a gifted, all-around route-runner whose game fits the modern No. 1 receiver profile. He has 628 yards and eight scores this season. A lot of top-10 teams will be vying for his services.\n5. Caleb Downs, S, Ohio StateIn a relatively down class, don't be surprised if a safety ends up in the top 10 for the first time since 2017. Downs is the perfect player for the positionless-defender role that's growing in the NFL.6. Carnell Tate, WR, Ohio StateTate is one of the biggest risers in the class this fall. His combination of efficiency and explosiveness is exceedingly rare. He has caught 84.8% of his targets while averaging 18.2 yards per reception. His explosiveness and ball skills are well worth a top-10 pick.7. Jermod McCoy, CB, TennesseeMcCoy has yet to play this season while recovering from a torn ACL in January. The fact he remains a top-10 player here shows how good his sophomore tape was. He could pull an Antonio Cromartie and still go in Round 1 without playing his final year.\n8. Francis Mauigoa, OT, Miami (Fla.)Mauigoa is a brutish tackle who can punish double-teams and stonewall bull-rushes. He's been starting on the right side since his true freshman year and has only gotten better.9. Spencer Fano, IOL, UtahWhile Fano plays right tackle, he projects as a guard. He's the best zone blocker in the class and still well worth a top-10 pick even if kicked inside.10. Arvell Reese, LB, Ohio StateYet another Buckeye in the top 10. It's time to drop the linebacker tag and call him what he'll be in the NFL: a pass rusher. You don't waste someone with his size, burst and length at the second level. He has 22 pressures on 71 pass-rush snaps this season.\n11. Keldric Faulk, EDGE, AuburnI listed Faulk at edge because that's where he plays now, but athletes his size are more and more often moving inside in the NFL. He's long and twitchy with some special run-game reps already.12. Ty Simpson, QB, AlabamaAfter a rocky first start against Florida State, Simpson has passed every test since. No moment has seemed too big for him as he looks like a veteran despite being in his first year as a starter. He has solid all-around tools and always looks in command.13. Dante Moore, QB, OregonMoore has shown his inexperience a bit lately, but there's still a lot to like on his tape. The question is whether he declares with two more years of eligibility after this season.\n14. Jeremiyah Love, RB, Notre DameLove is a big play waiting to happen. His quick feet, elite acceleration and breakaway speed are exactly what NFL teams want. He's racked up 28 touchdowns on 303 carries the past two seasons.15. T.J. Parker, EDGE, ClemsonParker is a solid, if unspectacular, edge defender who has been relatively quiet compared with expectations. He was a true freshman starter in 2023 with 35 pressures, but is on pace for fewer this year with only 21 so far.16. Olaivavega Ioane, IOL, Penn StateIoane has been the lone bright spot on a reeling Penn State team. He has allowed only one pressure all season and is the top true guard in the class.\n17. Makai Lemon, WR, USCLemon is a ready-made slot receiver averaging nearly 100 yards per game. He doesn't drop passes and consistently finds space over the middle.18. Caleb Lomu, OT, UtahLomu is no sure thing to declare as a third-year player who still needs to improve his strength. If he does, a team is getting a gifted mover who uses his hands in pass protection as well as anyone in the class.19. Avieon Terrell, CB, ClemsonTerrell may not look imposing at 180 pounds, but he plays extremely physical football. He has forced six fumbles over the past two seasons and has 14 pass breakups.\n20. Chris Brazzell II, WR, TennesseeBrazzell is a unique deep threat at 6-foot-5 and 200 pounds. He has real vertical speed and the ability to \"Moss\" cornerbacks at the catch point. He may be a bit of a one-trick pony, but it's a valuable trick.21. Kadyn Proctor, IOL, AlabamaProctor has shown some limitations in pass protection this year and is most likely going to kick inside at the next level outside of a few schemes. You're still getting the single best lineman at moving people against their will in the run game.22. Emmanuel Pregnon, IOL, OregonPregnon has been lights-out all season for the Ducks after transferring from USC. He has allowed only two pressures after yielding 18 a year ago. You won't find many offensive linemen as physically put together as Pregnon.\n23. Matayo Uiagalelei, EDGE, OregonOne of the youngest players in the class, Uiagalelei won't turn 21 until next summer. The former five-star recruit has improved every year and already has 25 pressures this season.24. CJ Allen, LB, GeorgiaAllen is an enforcer at the second level. Despite relatively modest size, he consistently sends offensive linemen backward. He also rarely misses tackles, with just a 6.8% career miss rate.25. Cashius Howell, EDGE, Texas A&MHowell is the best pure pass rusher in the class with a full array of moves. The only thing holding him back from being a sure-fire first-rounder is his lack of size and length.\n26. David Bailey, EDGE, Texas TechBailey has elite juice off the edge. He's racked up more pressures and sacks than anyone in college football this season. While he's still a little too reliant on raw athleticism, he has shown real development in the run game this year.27. Max Klare, TE, Ohio StateKlare's production has suffered with so many mouths to feed in the Buckeyes' offense, but the tape still shows the best route-running tight end in the class. He has a natural feel for separating, even if he has only 210 yards this season.28. Jake Golday, LB, CincinnatiGolday has the rare combination of edge-rusher size and safety-level athleticism. He can do it all at the second level.29. Joshua Josephs, EDGE, TennesseeJosephs is a long-armed edge rusher who wins with length. He may be on the lighter side, but he can still set a firm edge. He's thriving with a career-high 26 pressures this season.30. Sonny Styles, LB, Ohio StateStyles is a former safety who kept getting bigger -- and somehow more athletic. His sideline-to-sideline speed is the best in the class.31. Trevor Goosby, OT, TexasGoosby has a more prototypical tackle build and athletic profile than either of the Longhorns' tackles drafted last spring. He moves well and can get out in space. He's still raw in his first year as a starter, but a weaker tackle class may push him to declare early.32. Eric Singleton Jr., WR, AuburnSingleton didn't land in the most favorable quarterback situation after transferring from Georgia Tech, but the tape still shows an explosive all-around athlete. His deep-threat ability has been muted with only a 5.6-yard average depth of target.\n        \n            \n                Wilson's 2026 NFL mock draft: Jets get QB and playmaker, Cowboys rebuild broken defense\n                \n                    Ryan Wilson                \n            \n                            \n    \n                \n                    \n    \n33. Emmanuel McNeil-Warren, S, ToledoMcNeil-Warren is the best box safety in the class. His consistent impact around the line of scrimmage will translate quickly. I love that he's got a knack for forcing fumbles with 11 in his career.34. Kayden McDonald, DL, Ohio StateMcDonald is the best run-stuffer in the class. Whether one-on-one or against double teams, you aren't moving him. You're not getting much as a pass rusher, but he's a sure thing vs. the run.35. Omar Cooper Jr., WR, IndianaCooper continues to create yards after the catch in Indiana's offense. He leads the FBS with 17 broken tackles on 46 catches and has a running back-like build that should translate to the NFL.36. Denzel Boston, WR, WashingtonBoston is a big-bodied outside receiver who can still get down the field. He already has seven deep receptions this season and can win at all three levels.37. Michael Trigg, TE, BaylorTrigg has been the most productive tight end in the country with 40 catches for 607 yards. His highlight reel is absurd, and his catch radius is special with a 7-foot wingspan.38. Mansoor Delane, CB, LSUDelane isn't a high-end athlete, but no one is playing the position better right now. He has allowed only eight catches on 25 targets this season.39. Anthony Hill Jr., LB, TexasHill moves incredibly well for a nearly 240-pound linebacker and has only three missed tackles on 70 attempts this season. There aren't many holes to poke in his game.40. Kade Pieper, IOL, IowaPieper is almost certain to return to school for a couple reasons. He's only in his first year as a starter, and inexperienced linemen rarely declare early. He's also playing out of position at guard -- his NFL future is at center. Still, he's the most athletic lineman in college football.41. Colton Hood, CB, TennesseeEven with Jermod McCoy out, the Volunteers have still had a shutdown outside corner. Hood has allowed 17 receptions on 37 targets for 196 yards after transferring from Colorado.42. Quincy Rhodes Jr., EDGE, ArkansasRhodes has been a breakout star for the Razorbacks. The 6-foot-6, 275-pounder has the ideal build to be a versatile NFL weapon. The question is whether he'll declare after just one season as a starter.43. Romello Height, EDGE, Texas TechHeight may be light and a bit older, but he can rush the passer. He plays such a tenacious brand of football despite being under 240 pounds that I can't help but root for him.44. Ja'Kobi Lane, WR, USCLane has a basketball-type frame and uses it well, especially in the red zone. Seventeen of his 76 career catches have gone for touchdowns.45. KC Concepcion, WR, Texas A&MConcepcion is a nimble route-runner with elite start-stop quickness. His hands are the concern -- his career drop rate sits at 9.3%.46. D'Angelo Ponds, CB, IndianaI held out waiting for Ponds to get exposed as long as I could before including him in my top-50. That's because 5-foot-9, 173-pound corners aren't supposed to be able to lock down receivers the way he does. He just keeps doing it, though, with only 14 catches allowed on 29 targets for 101 yards this season.47. Genesis Smith, S, ArizonaSmith has everything you could want athletically to be a do-it-all safety in the NFL. In his two seasons as a starter, he's been able to consistently get his hands on footballs with nine pass breakups and four picks.48. Parker Brailsford, IOL, AlabamaBrailsford isn't for every scheme. Gap-heavy teams should look elsewhere, but if you want your center on the move, he's your guy. His ability to locate in space stands out in this class.49. A'Mauri Washington, DL, OregonWashington is a freak athlete at nose tackle, capable of being a weapon on stunts and slants. His ability to get off the football is special for a 330-pounder.50. Josiah Trotter, LB, MissouriIf the last name sounds familiar, it's because he's the son of former All-Pro linebacker Jeremiah Trotter. Unlike his brother Jeremiah, who's in the NFL now, Josiah has much better size to be a highly coveted prospect. He's been outstanding coming downhill this season with a knack for getting into the backfield.51. Christen Miller, DL, GeorgiaMiller is a long defensive tackle who looks like a prototypical 3-4 defensive end. While he's a work in progress as a pass rusher, like many Georgia defensive linemen, he can play the run at a high level already.52. Kenyon Sadiq, TE, OregonSadiq is such an explosive athlete at the tight end position, but he's struggled to develop into an all-around route runner in his first season as a starter. He's still such a good YAC weapon and move blocker to be coveted highly.53. Mateen Ibirogba, DL, Wake ForestThe former Georgetown defender has been one of the breakout prospects of the college football season. He's one of the twitchier defensive tackles in the class and already has 19 pressures for the Demon Deacons.54. Iapani Laloulu, IOL, OregonWatching Laloulu clear out defensive tackles on double-teams is a thing of beauty. He's physical and built low to the earth to generate movement. It's why he's been starting since his freshman year in 2023.55. Eli Stowers, TE, VanderbiltStowers has always been a high-end athlete, but he's had to grow into the tight end position. This has been his best season so far, with 38 catches for 543 yards and four scores.56. Josh Hoover, QB, TCUHoover looks unlikely to declare at this point, but I remain impressed by the NFL-translatable skills he shows on a weekly basis. He just needs to reel himself in from trying to do too much in big situations.57. Keionte Scott, S, Miami (Fla.)Scott is easily my favorite slot cornerback in the draft class. His short-area quickness and toughness are put on full display every week. If he could just wrap up a little more consistently, he could be a top-50 pick.58. Cayden Green, IOL, MissouriGreen has been wildly impressive kicking out to left tackle this season after starting at left guard his first two years in college. Green has allowed only five pressures on 238 pass-blocking snaps. His home is at guard, though, where his natural power really shines.59. Eric Rivers, WR, Georgia TechWe got to see more of Rivers' explosiveness last year, but it's not like it's gone away. He's still arguably the most gifted all-around athlete in this receiver class. Rivers just doesn't have the size to be much more than a deep threat.60. A.J. Haulcy, S, LSUHaulcy has been another standout transfer in their secondary with two picks and three pass breakups on the season. I love his range at his size (6-foot, 222 pounds). It reminds me a bit of Colts safety Nick Cross.61. John Mateer, QB, OklahomaMateer's stock took a hit as he's tried to play through a thumb injury, but the guy we saw before that looked like a first-rounder. He'll be back with the Sooners next year and should factor into a crowded class.62. Bear Alexander, DL, OregonAlexander is a well-traveled defensive tackle who's finally showing why he was a composite top-50 recruit in 2022. He's been a terror vs. the run with the highest run-stop percentage in the country among defensive tackles.63. Caleb Tiernan, OT, NorthwesternTiernan is a four-year starter for the Wildcats and has turned into one of the best pass protectors in the FBS. He's got an odd tackle build in that he's very tall at 6-foot-7 but has relatively short arms. He has swing tackle potential at the next level.64. Dillon Thieneman, S, OregonThieneman still needs to get stronger and isn't a sure thing to declare because of that. His ability in coverage is obvious, though, and he could even be a potential corner convert in the NFL.65. Caleb Banks, DL, FloridaBanks is a specimen at 6-foot-6, 330 pounds, but we've only seen him for one game this season due to a foot injury. He has top-10 talent but inconsistent tape last year.66. Brandon Cisse, CB, South CarolinaCisse has thrived in South Carolina's defense after transferring from N.C. State. He's allowed only 12 catches on 28 targets for 176 yards this season. His ability to close to the catch point will make him in demand come April.67. R Mason Thomas, EDGE, OklahomaThomas won't be for everyone at 6-2, 249 with under 32-inch arms. That low center of gravity combined with elite bend makes him a nightmare for tackles to try to square up. He'll be an early-impact designated pass rusher.68. Alex Harkey, IOL, OregonHarkey definitely looks like a guard playing tackle at times, but he also contrasts that with some special reps as well. He's light on his feet for a bigger lineman and it shows with how well he plays in space.69. Hollywood Smothers, RB, N.C. StateSmothers has been one of the most efficient backs in the country, averaging 6.9 yards per carry this season. He's undersized but difficult to pin down in space and runs hard.70. Connor Lew, IOL, AuburnLew's ranking here is a mere formality. He's got first-round talent but tore his ACL earlier this year and looks likely to come back to school as he's only a true junior.71. Julian Neal, CB, ArkansasNeal has enjoyed a breakout season for the Razorbacks after transferring from Fresno State. He's broken up six passes and picked off two more. His real value, though, comes from blowing up screens where his 6-foot-2, 208-pound frame really shines.72. Chris Bell, WR, LouisvilleBell has taken a step forward from last season and been the Cardinals' go-to receiver this fall. He's racked up a career-high 56 catches for 743 yards and six scores. He looks like a running back and runs like a corner.\n        \n            \n                2026 NFL Draft WR tiers: How new faces and unexpected production transformed a class short on preseason hype\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \n73. Anto Saka, EDGE, NorthwesternSaka truly has everything you could want to be a high-end pass rusher in the NFL. He just doesn't have much of a well-rounded game at this point. His developmental potential, though, could see him get drafted higher than even this.74. Malik Muhammad, CB, TexasMuhammad has barely been tested this year on the outside for the Longhorns. And when he has, not much has come of it. He's allowed 14 of 25 targets for 104 yards this season with two picks and two pass breakups.75. Ethan Burke, EDGE, TexasBurke has thrived in an expanded role this fall. He's a power end who's been one of the best run defenders in the country so far this season.76. Demond Claiborne, RB, Wake ForestClaiborne is pure electricity with the ball in his hands. He's right up there with Jeremiyah Love in terms of his dynamism in space, but he doesn't have quite the prowess between the tackles.77. Lee Hunter, DL, Texas TechHunter is the best playmaking nose tackle in the class. He's been consistently able to track down ball carriers over the course of his career. He's just a little too up and down to have higher on this list.78. Antonio Williams, WR, ClemsonThe Clemson offense desperately missed Williams after he went down early in Week 1 with a hamstring injury. He's back now and fresh off a 10-catch, 149-yard performance against Duke. He's a rugged slot receiver who's willing to take hits over the middle of the field.79. Anthony Lucas, EDGE, USCLucas is another big, long defensive end who's shown high-level flashes. His down-to-down consistency has been average, though, and he may even be better suited on the inside in the NFL.80. Zakee Wheatley, S, Penn StateWheatley has an ideal safety build with long limbs that have pop behind them. He's outstanding at coming downhill and corralling ball carriers in space.81. Chris Johnson, CB, San Diego StateJohnson has been dominant so far this season. He's yielded all of 14 catches on 33 targets for 142 yards with three picks and four pass breakups. I love his hard-nosed play style and tackling ability with only one miss on 42 attempts.82. Terrance Carter Jr., TE, Texas TechThis tight end class is full of gifted athletes after the catch and Carter is right near the top of that list. Over the past two seasons, he's broken 31 tackles on 75 receptions.83. Jamel Johnson, S, TCUJohnson has looked like a completely different player this fall than he did in his first year as a starter. His missed-tackle rate has gone from 20.7% in 2024 to 4.1% this year (on 74 attempts) and he's gone from no picks last year to four this year.84. LT Overton, DL, AlabamaOverton has been one of the more disappointing prospects this fall. He returned for his senior season to hopefully become a first-rounder but has taken a step backward if anything. Still, he's extremely young for a senior (turned 21 last month) and has positional versatility.85. Akheem Mesidor, EDGE, Miami (Fla.)Mesidor keeps overpowering opposing offensive linemen this season. He's had an injury-plagued career but finally looks like an NFL-caliber difference maker with 28 pressures this season.86. Kevin Coleman Jr., WR, MissouriColeman is a jitterbug slot receiver. He may be skinny, but defenders can rarely get their hands on him for it to matter. He also has some of the best hands in the draft class with a 3.1% career drop rate.87. Hero Kanu, DL, TexasKanu is a breakout prospect with a ton of high-level reps on tape this fall in his first year as a starter. He's really shined in the run game where his ability to get off blocks has been top notch.88. Suntarine Perkins, LB, Ole MissEven if he doesn't quite play a traditional linebacker role, Perkins' ability in space as well as taking on blocks looks well suited to play the position in the NFL. You won't find too many players his size that can consistently defeat blocks the way he does.89. Jadarian Price, RB, Notre DameIf you've followed Notre Dame closely the past two seasons, you'd know that despite having RB1 in Jeremiyah Love, the Irish offense hasn't taken that big of a step back when Price comes in the game. He's averaged 6.1 yards per attempt the past two seasons with 15 scores on 206 carries.90. Jaishawn Barham, LB, MichiganI wrote linebacker here, but it's actually been Barham's tape off the edge of late that lands him on this list. He's ferocious coming downhill and already shown some innate feel for rushing the passer. He's a perfect hybrid linebacker for modern defenses.91. Chase Bisontis, IOL, Texas A&MBisontis has been starting since his true freshman year for the Aggies where he's developed into one of the best pass-protecting guards in the country. He's only allowed six pressures all season.92. Red Murdock, LB, BuffaloMurdock stuffs the stat sheet on a weekly basis and over the weekend he made history. Murdock broke Khalil Mack's FBS forced-fumbles record with his 17th against Bowling Green. His ability to consistently punch and pry balls away from running backs will be a weapon in the league.93. Dontay Corleone, DL, CincinnatiCorleone has never quite lived up to the potential he flashed early in his career, but it's still in there somewhere. He's got bowling-ball size with 3-technique explosiveness. That can still make an impact in the league.94. Keith Abney II, CB, Arizona StateAbney is yet another corner who plays the position the correct way for the modern NFL. He's an awesome tackler with no misses on 33 attempts this season and has been consistently competitive at the catch point throughout his career.95. Carter Smith, IOL, IndianaSmith has been the starting left tackle the past three seasons for the Hoosiers and seen his game improve by leaps and bounds over that time. He's been fueling one of the best ground games in America and only allowed four pressures this season.96. Jahiem Lawson, EDGE, ClemsonLawson has been a breakout star for the Tigers and is producing almost as much as his teammate 80 spots above him on this list. He has a small frame for an edge rusher, but he uses it to his advantage by shrinking his strike zone for opposing linemen.97. Trey Zuhn III, IOL, Texas A&MYet another tackle-to-guard conversion. Zuhn is already such a good pass protector at tackle that you feel confident about his ability to kick inside. He's allowed only five pressures all season at left tackle.98. AJ Harris, CB, Penn StateHarris hasn't had quite the season he was hoping for to vault him into the first-round mix, but he's still a very solid all-around corner. I love his ability in space as a tackler and could even see him as a slot or safety if he continues to bulk up.99. Devin Moore, CB, FloridaAt 6-foot-3, Moore is a uniquely tall corner who thrives at the line of scrimmage. He's only allowed 10 catches for 93 yards all season in his first year as a starter.100. Clev Lubin, EDGE, LouisvilleAll Lubin has done in his two seasons of Division I football is rush the passer. He had 46 pressures last year for Coastal Carolina and now has 40 already this season for Louisville. He's not going to be much more than a third-down guy, but he could be effective at that still.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft: Top 100 prospects and big board rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/20e7dc5d-3090-408b-93e0-0dfe4ade4e87/thumbnail/1200x675/59bc1d4b5eba5523097f4542be36bb51/caleb-downs.jpg"
      ],
      "datePublished": "2025-11-05T18:16:54.000Z",
      "dateModified": "2025-11-05T18:16:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus to target Ball State-Kent State, Celtics-Wizards, Lakers-Spurs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-betmgm-bonus-code-cbssports-get-150-bonus-ball-state-kent-state-celtics-wizards-lakers-spurs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-05T17:11:01.000Z",
    "description": "\n        Whether you're betting the NBA, NHL, college football or college basketball, it's a perfect time to use BetMGM bonus code CBSSPORTS to receiv",
    "body": "\n        Whether you're betting the NBA, NHL, college football or college basketball, it's a perfect time to use BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins. There are 11 games on the NBA schedule tonight, including Celtics vs. Wizards at 7:30 p.m. ET and Lakers vs. Spurs at 10 p.m. ET. In college football, MACtion gives us two 7 p.m. ET kickoffs, including Ball State vs. Kent State.Picks from all three of those games are among our NBA and college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The model, which simulates every NBA game 10,000 times and enters Week 3 of the 2025-26 NBA season on a sizzling 26-13 roll on top-rated NBA spread picks dating back to last season. it has also generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns.  Wednesday's college football and NBA best bets at BetMGMBall State money line vs. Kent State (-125) Celtics -11.5 vs. Wizards (-115)Lakers -3.5 vs. Spurs (-105)Combining these three picks into a Wednesday college football and NBA parlay at BetMGM would result in a payout of +557 (risk $100 to win $557). Bet it at BetMGM Sportsbook here:\nBall State money line vs. Kent State (-125)\"Kent State is better this year for sure and interim coach Mark Carney was recently given the full-time gig. But I'm not sure the Flashes are ready to win on the road. They are 0-4 away this year and have lost each by at least 35. Granted, three were at Texas Tech, Florida State and Oklahoma ... but also at Toledo,\" SportsLine handicapper Matt Severance said. \"Ball State is 3-0 at home, including an upset of MAC contender Ohio. BSU's Nathan Voorhis is second in the nation with 10 sacks. Kent State, meanwhile, has the MAC's worst scoring defense (36.5 PPG).\" Back Ball State at BetMGM Sportsbook now:Celtics -11.5 vs. Wizards (-115)\"We've seen hints of a Boston breakthrough when extending a couple of margins this season, and this would seem a perfect opportunity to do so again. Though the Celtics have been a bit streaky, they did recently put three wins together, and Jaylen Brown (26.8 ppg) continues to torment enemy defenses,\" SportsLine handicapper Bruce Marshall said. \"The absence of Jayson Tatum is going to be felt all season, but the Celtics have found some serviceable replacements including Anfernee Simons vs. Portland, not quite Tatum-like but producing at a 14 ppg clip. Still, who are we kidding, the attraction here is to go against the sad-sack Wizards, on a five-game skid and having lost four of those games by 17 points or more.\" Back Boston at BetMGM Sportsbook now:Lakers -3.5 vs. Spurs (-105)The Spurs (5-1) are second in the West behind the Thunder (8-0) and the Lakers (6-2) are third, so both franchises are off to a solid starts despite battling some early injury issues. LeBron James (back) is out for at least a few more weeks and Austin Reaves (groin) is questionable. However, the Spurs might be even more banged up with De'Aaron Fox (hamstring) and Dylan Harper (calf) both ruled out and Jeremy Sochan (wrist) listed as questionable. Luka Doncic was rested for the second game of a back-to-back on Monday and will return to the lineup tonight. That's a big reason why the model has the Lakers covering in 57% of simulations. Back the Over at BetMGM Sportsbook now:\nWant more NBA picks?You've seen some of the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every NBA game on the schedule, all from the model that's simulated every game 10,000 times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus to target Ball State-Kent State, Celtics-Wizards, Lakers-Spurs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-11-05T17:11:01.000Z",
      "dateModified": "2025-11-05T17:11:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $150 bonus bets by betting Ball State-Kent State, Lakers-Spurs, Kings-Warriors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-fanduel-promo-code-get-150-bonus-bets-betting-ball-state-kent-state-lakers-spurs-kings-warriors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg",
    "tag": "Sports",
    "date": "2025-11-05T17:01:39.000Z",
    "description": "\n        Wednesday's sports schedule has something for everyone with college football and NBA, making it the perfect time to take advantage of the lat",
    "body": "\n        Wednesday's sports schedule has something for everyone with college football and NBA, making it the perfect time to take advantage of the latest FanDuel promo code, which offers $150 in bonus bets if your first $5 wager wins. Ball State hosts Kent State in a MACtion game at 7 p.m. ET, with the Cardinals favored by 2.5 points at home. SportsLine's model has identified the Under (47.5) as an A-rated pick and has also revealed NBA picks for Lakers vs. Spurs and Kings vs. Warriors. Combining all three of those picks into a multi-sport parlay at FanDuel results in a final payout of +581.   Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model, which simulates every NBA game 10,000 times and enters Week 3 of the 2025-26 NBA season on a sizzling 26-13 roll on top-rated NBA spread picks dating back to last season. it has also generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Wednesday college football and NBA best betsUnder 47.5 in Ball State vs. Kent State (-115)Under 230.5 in Lakers vs. Spurs (-110)Warriors +3 vs. Kings (-110)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +581 (risk $100 to win $581). Bet it at FanDuel here:\nUnder 47.5 in Ball State vs. Kent State (-115)Ball State has struggled on offense throughout the season, failing to score double digits in four of its eight games. The Cardinals only had 136 passing yards in a 21-7 loss to Northern Illinois in their most recent game. Kent State has had offensive issues of its own this year, scoring 14 points or fewer in half of its eight games. The Cardinals have gone Under in 14 of their last 18 November games, and the model has the Under hitting in 65% of simulations on Wednesday. Bet on college football at FanDuel Sportsbook:Under 230.5 in Lakers vs. Spurs (-110)Los Angeles continues to play without veteran star LeBron James (back), and Austin Reaves (groin) is a game-time decision. The Lakers have had to lean heavily on Reaves and Luka Doncic early in the season due to James' absence, leaving them without a ton of offensive firepower. They are facing a Spurs team that leads the NBA in points allowed per game (108.2). The Lakers have been solid defensively so far as well, ranked 14th in points allowed (116.6), so the model has the Under hitting 57% of the time. Bet on the NBA at FanDuel Sportsbook:Warriors +3 vs. Kings (-110)Golden State will be without Stephen Curry (illness) on Wednesday night, but it still has enough firepower to stay with Sacramento. The Kings gave up 39 first-quarter points in a 130-124 loss to the Nuggets on Monday, falling to 2-5 overall this season. They are coming off a four-game road trip, leaving them potentially fatigued in this game. Golden State picked up a 118-107 win over Phoenix on Tuesday, improving to 5-3 this season. The Warriors will be shorthanded on Wednesday, but the model has accounted for that and still has Golden State covering in 64% of simulations. Bet on Warriors-Kings at FanDuel Sportsbook:\nWant more NBA picks?You've seen some of the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $150 bonus bets by betting Ball State-Kent State, Lakers-Spurs, Kings-Warriors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg"
      ],
      "datePublished": "2025-11-05T17:01:39.000Z",
      "dateModified": "2025-11-05T17:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]