[
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Mavericks-Celtics, Pistons-Nuggets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-mavericks-celtics-pistons-nuggets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-02-03T22:33:29.000Z",
    "description": "\n        The Detroit Pistons will face the Denver Nuggets in an NBA showdown on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $2",
    "body": "\n        The Detroit Pistons will face the Denver Nuggets in an NBA showdown on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more. Both teams rank in the top 10 in the NBA in scoring, and SportsLine's proven computer model has the Over (224.5) hitting in that matchup. The Pistons are favored by 5.5 points at home against Denver. It has also revealed one of its Tuesday NBA best bets for Celtics vs. Mavericks, along with an NHL bet for Devils vs. Blue Jackets. Claim the latest bet365 bonus code here:Check out our bet365 bonus code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Tuesday's top picks, best betsOver 224.5 in Pistons vs. NuggetsOver 223.5 in Celtics vs. Mavericks Under 6.5 in Devils vs. Blue JacketsCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:Over 224.5 in Pistons vs. Nuggets\nTwo of the league's top offenses are meeting on Tuesday night, as Denver ranks third in points per game (119.9) and Detroit ranks eighth (117.3). The Nuggets have not been nearly as impressive defensively, ranked 16th in the NBA in points allowed per game (115.7). They have star Nikola Jokic back from an injury, providing their offense with a massive boost. SportsLine's model has Jokic scoring 25 points on Tuesday, helping the Over cash in 60% of simulations. Back the Over at bet365 here:Over 223.5 in Celtics vs. Mavericks Boston has gone Under the total in five straight games, which has led to a low total for this matchup. The Mavericks rank No. 20 in the NBA in points allowed per game (116.6) and play at the third-fastest tempo of any team in the league, so this is the perfect opportunity for Boston to put up big numbers. Dallas has allowed at least 115 points in seven straight home games, and the model expects that trend to continue Tuesday. Ultimately, these teams combine for 231 points as the Over hits 60% of the time. Back the Over at bet365 here:Under 6.5 in Devils vs. Blue JacketsThe Blue Jackets are aiming for their sixth straight win, and they have allowed three goals or fewer in four of their last five wins. They are facing a New Jersey team that has lost three of its last four games and has been held to three goals or fewer in eight of its last nine games. The Devils have gone Under in six of those games, and they have cashed the Under in five of their last six home games. Additionally, these teams have gone Under in five of their last seven head-to-head meetings, so the model has the Under hitting in 69% of simulations. Back the Under at bet365 here:\nLooking for more betting picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Mavericks-Celtics, Pistons-Nuggets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-02-03T22:33:29.000Z",
      "dateModified": "2026-02-03T22:33:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. Mavericks prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-mavericks-odds-prediction-spread-time-2026-nba-picks-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/11/61cef590-c7a4-4dd7-b881-90f147729beb/thumbnail/1200x675/f33f4174b5ee94d8395ed4699d163b8f/imagn-cooper-flagg-mavericks.jpg",
    "tag": "Sports",
    "date": "2026-02-03T23:28:00.000Z",
    "description": "\n        Two teams going in opposite directions will meet as part of Tuesday's NBA schedule as the Boston Celtics visit the Dallas Mavericks. The Celt",
    "body": "\n        Two teams going in opposite directions will meet as part of Tuesday's NBA schedule as the Boston Celtics visit the Dallas Mavericks. The Celtics (31-18) have won three of their last four, including a Sunday victory over Milwaukee, 107-79. Meanwhile, the Mavs (19-30) have lost four straight, most recently a 111-107 defeat to Houston on Saturday. Anthony Davis (finger) and PJ Washington (concussion) are among those out for the Mavericks, while Anfernee Simons was traded earlier in the day from Boston to Chicago.Tipoff is at 8 p.m. ET from American Airlines Center in Dallas. The teams split their two matchups last season as they'll meet for the first time this year. The latest Mavericks vs. Celtics odds list Boston as the 7.5-point favorite, with the over/under at 222.5. Boston is at -267 on the money line. Before making any Celtics vs. Mavericks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Mavericks vs. Celtics 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. Mavericks: Mavericks vs. Celtics   spread                                                                     Celtics -7.5 at DraftKings SportsbookMavericks vs. Celtics   over/under:    222.5 pointsMavericks vs. Celtics   money line:    Celtics -267, Mavericks +216Mavericks vs. Celtics   picks: See picks at SportsLineMavericks vs. Celtics   streaming:PeacockNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Celtics vs. Mavericks   picksSportsLine's model has simulated Mavericks vs. Celtics   10,000 times and is going Over on the total (222.5 points). These teams have engaged in nothing but high-scoring affairs over their last four regular-season matchups, with each of them clearing having at least 229 combined points. Those four meetings have averaged 238.3 points, with each of the last three going Over the total.The Mavs have trended over recently at home, as they've eclipsed the total in five of their last seven contests in Dallas. Meanwhile, few teams are as efficient as Boston on the offensive end, as it ranks second in offensive rating, second in 3-pointers per game, and it commits the fewest turnovers per night. SportsLine's model has the total being surpassed by more than 10 points as the Over hits in 64.1% of simulations.It also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. Mavs, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Mavs vs. Celtics spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. Mavericks prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/11/61cef590-c7a4-4dd7-b881-90f147729beb/thumbnail/1200x675/f33f4174b5ee94d8395ed4699d163b8f/imagn-cooper-flagg-mavericks.jpg"
      ],
      "datePublished": "2026-02-03T23:28:00.000Z",
      "dateModified": "2026-02-03T23:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WM Phoenix Open odds, predictions, field: PGA picks, bets from proven golf model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-wm-phoenix-open-odds-predictions-golf-picks-field-projected-leaderboard-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/241f880b-801c-42ba-8e96-a948b1c7d6df/thumbnail/1200x675/88845c9657f135cee13ed09730679c34/w-m-phoenix-open-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-04T01:04:48.000Z",
    "description": "\n        One of the top events on the PGA Tour tees off on Thursday as the 2026 WM Phoenix Open unfolds at TPC Scottsdale (Stadium Course). Known for ",
    "body": "\n        One of the top events on the PGA Tour tees off on Thursday as the 2026 WM Phoenix Open unfolds at TPC Scottsdale (Stadium Course). Known for its raucous crowds, the WM Phoenix Open usually draws a great field, and this year is no exception. Scottie Scheffler, Xander Schauffele and Hideki Matsuyama are among the players teeing it up. They'll be joined by Brooks Koepka, who is playing his second event since rejoining the PGA Tour last week at the Farmers Insurance Open.The latest 2026 WM Phoenix Open odds list Scheffler as the +220 favorite (risk $100 to win $220), followed by Schauffele at +1700. Si Woo Kim, Hideki Matsuyama and Cameron Young are all at +2500, with Viktor Hovland, Sam Burns and Ben Griffin all at +3000. Brooks Koepka is +4500 in his second PGA event since returning to the tour. Before locking in any 2026 WM Phoenix Open picks, or making any PGA DFS picks on sites like FanDuel or DraftKings, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, simulated every PGA Tour event 10,000 times and reveals golf betting picks that have a history of being extremely profitable. \nThis same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 WM Phoenix Open field is locked in, the model simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. \n2026 WM Phoenix Open predictions One major surprise the model is calling for at the WM Phoenix Open 2026: Si Woo Kim, who is one of the favorites, stumbles and barely cracks the top 10. He's a golfer to fade this week. The 30-year-old is off to a fast start this season, finishing T11 at the Sony Open, T6 at The American Express and T2 at the Farmers Insurance Open. This event has been a real struggle for him, however, as he's missed three of thee past five WM Phoenix Open cuts and hasn't finished better than 50th since 2022. See who else to fade here. Another surprise: The model is extremely high on Ben Griffin this week. He has only played this event twice, but he made the cut both times and finished 36th last year and 28th in 2024. Both times he shot above 70 in the first round, but rallied over the weekend, so if he can get off to a fast start at TPC Scottsdale this week, he'll have a chance to be in the mix on Sunday. See who else to pick here. New users can also check out the latest FanDuel promo code and get $200 in bonus bets at FanDuel if your $5 bet wins:\nHow to make 2026 WM Phoenix Open picksThe model is also targeting three other longshots of +3000 or longer as top-10 contenders. You can only see the model's picks here. Who will win the 2026 WM Phoenix Open, and which longshots will stun the golfing world? Check out the 2026 WM Phoenix Open odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 WM Phoenix Open Open odds, favorites Get full 2026 WM Phoenix Open Open picks, best bets and predictions here. (odds via FanDuel and subject to change)\nScottie Scheffler +220Xander Schauffele +1700Si Woo Kim +2500Hideki Matsuyama +2500Cameron Young +2500Viktor Hovland +3000Sam Burns +3000Ben Griffin +3000J.J. Spaun +3300Maverick McNealy +3300Collin Morikawa +3500Chris Gotterup +3500Harris English +4000Matt Fitzpatrick +4000Jake Knapp +4000Rickie Fowler +4500Brooks Koepka +4500Sahith Theegala +5000Jordan Spieth +5000Michael Thorbjornsen +5000Nick Taylor +5500Rasmus Højgaard +5500Corey Conners +5500Sepp Straka +5500Daniel Berger +5500Harry Hall +6000Wyndham Clark +6000Kurt Kitayama +6000Min Woo Lee +6000J.T. Poston +7000Matt McCarty +7000Pierceson Coody +7000Davis Thompson +7500Nicolai Højgaard +7500Samuel Stevens +7500Keith Mitchell +7500Haotong Li +8000Christiaan Bezuidenhout +8000Garrick Higgo +8000Marco Penge +10000Mac Meissner +10000Max Greyserman +10000Kristoffer Reitan +10000Michael Kim +10000Andrew Novak +10000Johnny Keefer +10000Max Homa+10000Thorbjørn Olesen +10000Tony Finau +10000Max McGreevy +10000Jacob Bridgeman +10000Patrick Rodgers +10000Rasmus Neergaard-Petersen +10000Akshay Bhatia +10000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WM Phoenix Open odds, predictions, field: PGA picks, bets from proven golf model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/241f880b-801c-42ba-8e96-a948b1c7d6df/thumbnail/1200x675/88845c9657f135cee13ed09730679c34/w-m-phoenix-open-imagn-images.jpg"
      ],
      "datePublished": "2026-02-04T01:04:48.000Z",
      "dateModified": "2026-02-04T01:04:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Super Bowl picks, AI-generated score prediction for Patriots vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-seahawks-patriots-picks-score-predictions-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/2660d690-f770-4a75-aa0e-d0291b9e5dc5/thumbnail/1200x675/f444e64b679c8001fcf4ce9caf429d6a/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-04T01:09:56.000Z",
    "description": "\nFamiliar Super Bowl foes meet when the Seattle Seahawks battle the New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8. Seattle advanced wi",
    "body": "\nFamiliar Super Bowl foes meet when the Seattle Seahawks battle the New England Patriots in the 2026 Super Bowl on Sunday, Feb. 8. Seattle advanced with a 31-27 win over the Los Angeles Rams in the NFC Championship Game, while New England outlasted the Denver Broncos 10-7 in the AFC Championship Game. The Seahawks (14-3), who have won nine in a row, are making their fourth Super Bowl appearance. The Patriots (14-3), who have won six consecutive games, are making their 12th Super Bowl appearance, extending their own record as no other franchise has more than eight appearances.Kickoff is set for 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. Seattle enters Super Bowl 60 as a 4.5-point (-115) favorite, and the over/under at 45.5 at DraftKings Sportsbook. Seattle is -238 (risk $238 to win $100) on the money line. Before making any 2026 Super Bowl LX picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Super Bowl LX NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for the game. You can only see the AI predictions for the 2026 NFL Super Bowl LX game schedule here.Why the Seahawks can coverSeattle is known for its defense, allowing 16 or fewer points in six of its past eight games. The Seahawks had the sixth-best defense in the NFL, giving up 285.6 yards per game and a league-low 17.2 points per game. Seattle has been dominant in the run game, giving up just 91.9 yards rushing, which is the third-best in the league. Offensively, the Seahawks had a top-10 offense as well. During the regular season, Seattle tied with San Francisco for the seventh-best offense, averaging 351.4 yards per game. The Seahawks averaged 28.4 points, which was third-best in the NFL. Veteran quarterback Sam Darnold was a big part of the Seattle offense, which had the eighth-best passing attack, averaging 228.1 passing yards per game. See who wins Super Bowl LX predictions and game picks at SportsLine.Why the Patriots can coverLike Seattle, New England has also had a solid defense in 2025-26. The Patriots ended the regular season with the eighth-best defense, allowing 295.2 yards per game. New England allowed the fourth-least amount of points at 18.8 points per game. The Patriots were among the best against the rush, finishing sixth overall, allowing 101.7 rushing yards per game. New England has allowed 16 or fewer points in each of the last five games.Offensively, the Patriots put up the second-most points in the regular-season, averaging 28.8 points per game, behind second-year quarterback Drake Maye. They had the third-best offense at 379.4 yards per game, and were fourth in passing yards at 250.5. New England has scored 26 or more points in eight of its last 10 games. See who wins Super Bowl LX predictions and game picks at SportsLine.How to make 2026 Super Bowl LX picksAfter analyzing Super Bowl LX, SportsLine AI says the Under 45.5 (-112) will hit in a tight, low-scoring matchup. SportsLine AI has also revealed its exact score projection, and a coveted A+ pick on one side that you can see to see now. Visit SportsLine to see the AI's pick. Who wins and covers Super Bowl LX, and which A+ pick should you target now? Visit SportsLine now to see the top NFL picks against the spread, ove/-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Super Bowl picks, AI-generated score prediction for Patriots vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/2660d690-f770-4a75-aa0e-d0291b9e5dc5/thumbnail/1200x675/f444e64b679c8001fcf4ce9caf429d6a/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-04T01:09:56.000Z",
      "dateModified": "2026-02-04T01:09:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suns vs. Trail Blazers prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-trail-blazers-odds-prediction-time-2026-nba-picks-february-3-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/e388c180-9cc6-4480-97db-f26ce501e961/thumbnail/1200x675/457db82fbeee99ba9fbbf60979eb9ddc/royce-oneale-phoenix-suns-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-04T02:25:28.000Z",
    "description": "\n        A pair of Western Conference playoff hopefuls will clash on Tuesday's NBA schedule as the Phoenix Suns visit the Portland Trail Blazers. The ",
    "body": "\n        A pair of Western Conference playoff hopefuls will clash on Tuesday's NBA schedule as the Phoenix Suns visit the Portland Trail Blazers. The Suns (30-20) are seventh in the West and have won three of their last four, though they're coming off a 117-93 loss to the Clippers. The Blazers (23-27) are the 10-seed out West and have dropped five in a row, most recently a 130-111 defeat to Cleveland. Devin Booker (ankle) is out for Phoenix while Jalen Green (hamstring) is questionable. Deni Avdija (back) and Scoot Henderson (hamstring) are out for Portland, with Jrue Holiday (personal) questionable.Tipoff is at 11 p.m. ET from Moda Center at the Rose Quarter in Portland, Ore. Phoenix won the lone matchup, on the road, earlier this season. The latest Suns vs. Trail Blazers odds list Phoenix as the 2.5-point favorite, with the over/under at 218.5. Phoenix is at -155 on the money line, with Portland priced as the +130 underdog. Before making any Trail Blazers vs. Suns picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Trail Blazers vs. Suns 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Suns vs. Blazers: Trail Blazers vs. Suns   spread                                                                     Suns -2.5 at DraftKings SportsbookTrail Blazers vs. Suns   over/under:    218.5 pointsTrail Blazers vs. Suns   money line:    Suns -155, Blazers +130Trail Blazers vs. Suns   picks: See picks at SportsLineTrail Blazers vs. Suns   streaming:PeacockNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Suns vs. Trail Blazers   picksSportsLine's model has simulated Blazers vs. Suns 10,000 times and is going Over on the total (218.5 points). Each of the last three meetings have gone over, with them averaging 237.3 combined points. The last four overall to take place in Portland have gone over, while the Suns have eclipsed the total in each of their last two games this season.The Blazers went over in their last contest, and the Over has hit in three of their last four home games. The model projects both teams to showcase their depth, as each is projected to have six players reach double-figures. With that, the model is calling for 232 points to go on the scoreboard as the Over hits in 66.9% of simulations.It also says one side of the spread hits almost 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Suns vs. Blazers, and which side of the spread hits almost 70% of the time? Visit SportsLine now to see which side of the Trail Blazers vs. Suns spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns vs. Trail Blazers prediction, odds, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/e388c180-9cc6-4480-97db-f26ce501e961/thumbnail/1200x675/457db82fbeee99ba9fbbf60979eb9ddc/royce-oneale-phoenix-suns-imagn-images.jpg"
      ],
      "datePublished": "2026-02-04T02:25:28.000Z",
      "dateModified": "2026-02-04T02:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jazz vs. Pacers prediction, odds, spread, start time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jazz-pacers-odds-prediction-spread-line-time-2026-nba-picks-tuesday-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/749ffe2c-aceb-4574-af86-ffad62e06beb/thumbnail/1200x675/372544104d1024cd359538a2bae61136/pascal-siakam-indiana-pacers.jpg",
    "tag": "Sports",
    "date": "2026-02-03T21:15:35.000Z",
    "description": "\n        The Utah Jazz look to snap a six-game losing streak when they battle the Indiana Pacers in NBA action on Tuesday night. Utah is coming off a ",
    "body": "\n        The Utah Jazz look to snap a six-game losing streak when they battle the Indiana Pacers in NBA action on Tuesday night. Utah is coming off a 107-100 loss at Toronto on Sunday, while Indiana dropped a 118-114 decision to the Houston Rockets on Monday. The Jazz (15-35), who are fifth in the Northwest Division, are 5-18 on the road this season. The Pacers (13-37), who are fifth in the Central Division, are 10-17 on their home court. Utah will be without Keyonte George (ankle). Bennedict Mathurin (rest), T.J. McConnell (knee), Andrew Nembhard (back) and Aaron Nesmith (hand) are among the players ruled out for Indiana. Tipoff from Gainbridge Fieldhouse in Indianapolis is set for 7 p.m. ET. Utah is a 2-point favorite in the latest Jazz vs. Pacers odds from DraftKings Sportsbook, while the over/under for total points scored is 232.5. Before making any Jazz vs. Pacers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Jazz vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Jazz:Jazz vs. Pacers                                                                                                                                 spread:    Jazz -2Jazz vs. Pacers                                                                                                                                                 over/under:    232.5 pointsJazz vs. Pacers                                                                                                                                                 money line:    Jazz -132, Pacers +111Jazz vs. Pacers                                                                                                                                                 picks:    See picks at SportsLineJazz vs. Pacers                 streaming:Fubo (Try for free)   New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Jazz vs. Pacers picksAfter 10,000 simulations of Jazz vs. Pacers, SportsLine's model is going Under on the total (236.5). The Under has hit in two of the last four head-to-head meetings. The Under has also hit in five of the last eight Utah games, while the Under has hit in four of the last eight Indiana games. The SportsLine model is projecting Utah's Lauri Markkanen to score 24.6 points on average and be one of five Jazz players to score 10.8 or more points. Indiana's Pascal Siakam, meanwhile, is projected to have 25.2 points as four Pacers players score 14.4 points or more.It has also generated an against-the-spread pick that hits in nearly 70% in simulations. You can head to SportsLine to see the model's NBA picks. So who wins Pacers vs. Jazz, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Jazz vs. Pacers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jazz vs. Pacers prediction, odds, spread, start time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/749ffe2c-aceb-4574-af86-ffad62e06beb/thumbnail/1200x675/372544104d1024cd359538a2bae61136/pascal-siakam-indiana-pacers.jpg"
      ],
      "datePublished": "2026-02-03T21:15:35.000Z",
      "dateModified": "2026-02-03T21:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Magic-Thunder, Celtics-Mavericks on Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-300-bonus-bets-magic-thunder-celtics-mavericks-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-02-03T23:17:07.000Z",
    "description": "\n        Tuesday night is filled with NBA and college basketball options to take advantage of the current DraftKings promo code, which offers new user",
    "body": "\n        Tuesday night is filled with NBA and college basketball options to take advantage of the current DraftKings promo code, which offers new users $300 in bonus bets if their first $5 wager wins. Tuesday features a 10-game NBA slate, including Thunder vs. Magic in a potential NBA Finals preview at 8 p.m. ET. The Thunder have the best record in the NBA at 39-11, and the Magic are seemingly on their way to a third straight playoff appearance. On Tuesday, the SportsLine Projection Model is backing Oklahoma City to continue its dominant ways, picking the Thunder to cover as 6.5-point favorites as one of its NBA best bets at DraftKings. The over/under for Thunder vs. Magic is 220.5, up two points from the opening line. The model is also backing Over 222.5 total points in Celtics vs. Mavericks at 8 p.m. ET for Tuesday NBA picks. Also, one of SportsLine's top experts has locked in a college basketball pick on Saint Louis vs. Davidson at 9 p.m. ET. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Tuesday best bets at DraftKings SportsbookThunder (-6.5) vs. MagicCeltics vs. Mavericks: Over 222.5 total pointsSaint Louis vs. Davidson: Over 147.5 total pointsCombining the three picks into a Tuesday parlay at DraftKings would result in a payout of +575 (risk $100 to win $575). Bet it at DraftKings here: (Odds subject to change)\nThunder (-6.5) vs. Magic (-112)The Thunder have the best record in the league at 39-11, which is three more wins than any other team in the NBA and six more than any team in the Western Conference. They are just 4-4 over their last eight games, but that doesn't change their dominance over the league this season, and all four of those wins came by at least nine points. Shai Gilgeous-Alexander is making his case for back-to-back MVP awards, ranking second in scoring at 32 points per game and 15th in assists at 6.4 per game. Oklahoma City has the No. 1 scoring offense (120.3 ppg) and No. 1 scoring defense (108 ppg). Meanwhile, the Magic are 2-5 over their last seven games, with all five losses coming by at least nine points. The model projects the Thunder to cover in 67% of simulations. Bet the Thunder to cover at DraftKings here:Celtics vs. Mavericks: Over 222.5 total points (-115)The Celtics have gone Over this total in four of their last seven games, with the Mavericks doing so in four of their last five contests. The Over is 5-4 over the last nine Dallas games, including 5-2 over its last seven at home. Dallas hosts on Tuesday, and the Mavericks have allowed at least 111 points in five straight games. Dallas top pick Cooper Flagg has come along lately, scoring 34 and 49 points over his last two games to lift Dallas' offense. Celtics guard Jaylen Brown is fourth in the league in scoring at 29.4 ppg, as these two could put on a show against one another. The model projects the Over to hit in 64.6% of simulations. Bet the Over at DraftKings here:Saint Louis vs. Davidson: Over 147.5 total points (-110)\"The Billikens are 21-1 and rank sixth nationally, averaging more than 91 points per game,\" SportsLine expert Eric Cohen said. \"While they are only 3-2 to the over in road games, St. Louis games have exceeded this 147.5 number in four of those games. On the season, Josh Schertz's team has scored 77 or more points in 20 of 22 games. On the other side, in seven Davidson games this season with totals of 144.5 or greater, they've exceeded 147.5 total points six times. This feels like a game played in at least the 150s, so I'm rolling with the over.\" Bet the Over at DraftKings here:\nWant more NBA and college basketball on Tuesday?You've seen some of the model's Tuesday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Magic-Thunder, Celtics-Mavericks on Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-02-03T23:17:07.000Z",
      "dateModified": "2026-02-03T23:17:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuggets vs. Pistons prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nuggets-pistons-odds-prediction-spread-time-2026-nba-picks-tuesday-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/c583cbfd-d95a-4608-a394-3ef70065ce0d/thumbnail/1200x675/f44b2a44c037333af7e42cc6db47f362/cade-cunningham-detroit-pistons-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T21:00:44.000Z",
    "description": "\n        A potential NBA Finals preview is on the Tuesday NBA schedule when the Denver Nuggets travel to take on the Detroit Pistons. Detroit leads th",
    "body": "\n        A potential NBA Finals preview is on the Tuesday NBA schedule when the Denver Nuggets travel to take on the Detroit Pistons. Detroit leads the NBA Eastern Conference standings at 36-12, while Denver is 33-17 and third in the West. Detroit has won four of its last five, while Denver comes in off a loss to the Thunder on Sunday. Christian Braun (ankle) is questionable for Denver, while Caris LeVert (illness) is questionable for Detroit. Tipoff is set for 7 p.m. ET at Little Caesars Arena in Detroit. Detroit is a 5.5-point favorite in the Nuggets vs. Pistons odds, while the over/under is 228.5. Before making any Pistons vs. Nuggets picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Nuggets vs. Pistons 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pistons vs. Nuggets: Nuggets vs. Pistons spread                                                                     Pistons -4Nuggets vs. Pistons over/under:    228.5 pointsNuggets vs. Pistons money line:    Pistons -220, Nuggets +181Nuggets vs. Pistons picks: See picks at SportsLineNuggets vs. Pistons streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Pistons vs. Nuggets picksSportsLine's model has simulated Nuggets vs. Pistons 10,000 times and is going Over on the total (228.5 points). Denver has seen four straight games go Over the total, while three of Detroit's past five have cleared the total.The model projects 24.5 points for Cade Cunningham and 26 for Nikola Jokic as the teams combine for 232 points and the Over hits 55% of the time. It also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Pistons vs. Nuggets, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuggets vs. Pistons prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 3 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/c583cbfd-d95a-4608-a394-3ef70065ce0d/thumbnail/1200x675/f44b2a44c037333af7e42cc6db47f362/cade-cunningham-detroit-pistons-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T21:00:44.000Z",
      "dateModified": "2026-02-03T21:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Harden-Darius Garland trade grades: One team clearly comes out on top - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/james-harden-darius-garland-trade-grades-clippers-cavaliers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/04/cf0a093d-29db-405e-ba79-ce012127ff65/thumbnail/1200x675/6d4905c0dd36f75b5d6dd9d5abd81af7/harden-garland-getty.png",
    "tag": "Sports",
    "date": "2026-02-04T02:36:12.000Z",
    "description": "\n        Tuesday afternoon gave us our first stunner of the 2026 NBA trade deadline in the Jaren Jackson Jr. deal, and now, we have yet another blockb",
    "body": "\n        Tuesday afternoon gave us our first stunner of the 2026 NBA trade deadline in the Jaren Jackson Jr. deal, and now, we have yet another blockbuster. Darius Garland is headed for the Los Angeles Clippers along with a second-round pick. James Harden is joining the Cleveland Cavaliers. It is one of the most surprising trade the NBA has given us since, well, last February, when the Dallas Mavericks sent Luka Dončić to the Los Angeles Lakers in the dead of night for Anthony Davis in a move so controversial it eventually got their general manager fired.Just by virtue of the ages of the principle figures here, this trade will almost certainly be compared to that one. Part of what made the Dončić trade so unusual was that the Mavericks gave up a 25-year-old for a 31-year-old. Well, the age-gap here is even bigger. Harden is 36. Garland is 26.So... is this deal as bad for Cleveland as that one was for Dallas? Or did the Cavaliers have more justifiable reasons for making their point guard swap? Let's grade the deal below:\n                            \n    \n                                                \n                    \n    Cleveland Cavaliers: COn first glance, this trade makes no sense for Cleveland. Rarely does it ever make sense to trade a 26-year-old for a 36-year-old. Garland is a homegrown All-Star who was critical to Cleveland's 64-win season a year ago. The more you look at it, though, the more Cleveland's logic starts to come into focus.\nThe Cavaliers have now had Garland in the building for seven years. They've seen him play 70 games just once, last season, which was ultimately ruined by a toe injury. That same toe injury lingered into this year. Garland has not played since Jan. 14, and while he had picked things up in the weeks before then, his season overall had been a mess. It is entirely possible that Cleveland simply looked at Garland and decided he was unlikely to remain healthy moving forward.That was a significant problem for them in financial terms. They're a second-apron team as is. Jarrett Allen gets more expensive on an extension next season. Donovan Mitchell will presumably re-sign on a supermax deal in the summer of 2027, and Evan Mobley got a Rose Rule max after winning Defensive Player of the Year last season. They simply were not equipped to continue paying Garland max money. He has two years left on his original max contract after this one, and he is eligible for an extension this offseason.Cleveland could have waited things out. Maybe Garland would have stayed healthy in the playoffs. Maybe he would have been amenable to a pay cut. But we live in a world in which Trae Young just got cap dumped and Ja Morant is almost untradeable. The landscape just isn't kind for small guards right now. The Cavaliers seemingly didn't want to risk getting stuck with a max contract they didn't want. Perhaps they could have gotten draft picks for Garland elsewhere, but that probably would have meant taking back bad money. With so much invested in winning this season, that wasn't tenable.\nSo instead, they took a player who will probably make them better this season. For all of his foibles, James Harden is durable. He's been a better player than Garland this season, and he'll take a significant burden off of Donovan Mitchell's shoulders to create every shot. Big men thrive next to Harden. Jarrett Allen and Evan Mobley are about to get some of the easiest shots of their life. Harden is bigger than Garland, so while he may not be a star defender, he's easier to hide in the context of an overall scheme. And, most importantly, he's cheaper. They make roughly the same money this season, but Harden only has next year left on his deal, and it's only partially guaranteed for $13.3 million. Just given his age, he's not going to command the sort of long-term money Garland would. Cleveland can now go for it this year and next and then reset its books in the summer of 2027, when Harden expires and Mitchell's new deal begins.So, yes, in a perfect world, you really shouldn't trade a 26-year-old for a 36-year-old. Under the narrow circumstances that Cleveland found itself in, it's defensible. The Cavaliers simply couldn't score when Mitchell went to the bench. Now they can. They haven't been able to rely on Garland to stay healthy. Harden tends to stay healthy. They're holding their nose and hoping Harden doesn't have another of his playoff collapses, but all things considered, they probably made this year's team better and they got out of a contract they seemed to want no part of paying. Confusing as it looks on paper, it makes enough sense to take the plunge. \n                            \n    \n                                                \n                    \n    Los Angeles Clippers: AAll of those risks that the Cavaliers wanted to avoid with Garland apply to the Clippers. He might not be able to stay healthy. He might be overpaid on his contract. As a league, we might be moving away from small guards as centerpieces of championship teams. But this is an enormously simple calculation. The Clippers entered this week as a Play-In team with the NBA's oldest roster and no control over their next four first-round picks. Their future was hopeless. It was just a matter of when Harden and Kawhi Leonard finally broke down.\nGarland is not the salvation the other Los Angeles team got when it was handed Luka Dončić on a silver platter, but the principle is similar. The Lakers were old and going nowhere. Getting Dončić at least gave them direction, an early-prime player to build around as it figured out how to pivot from the last era into the next one. The Clippers badly needed something like that. Garland is their chance at it, and not only did they acquire him, they managed to get a draft pick in the process. That would have felt unthinkable earlier in the season. It wasn't long ago when we assumed the price for Garland might be, say, a Trey Murphy-esque wing, or a package of several first-round picks. The Clippers got him for an older player who wasn't long for their team anyway.The financial risks to the Clippers are far lighter than they were to the Cavaliers. Los Angeles doesn't have a Mobley or a Mitchell to pay. In fact, Garland is now one of only two players on the roster with a guaranteed contract in the summer of 2027 along with Ivica Zubac, their 28-year-old center. Neither player is equipped to be the best player on a contender, but both would be valuable supporting pieces for whoever that player turns out to be. Los Angeles is fertile recruiting ground. The Clippers will have all of the financial flexibility they need to rebuild their roster. And as time passes -- assuming the Aspiration investigation doesn't lead to a severe punishment -- they'll start to regain access to future draft picks to trade. Eventually, the plan will presumably be to either sign a star to play next to Garland and Zubac or use their draft picks to trade for that player. That might not have been possible without Garland. You typically need some young talent in place to convince stars to play for you.\nSo it might not be the obvious home run the Lakers got in Dončić, but it's about as straightforward a win as the Clippers could have reasonably hoped for. They have a future now, or at least a blueprint to build one. If it goes belly up, so what? The time in which Harden and Leonard could have led them to a championship had long passed. Whether they waived his partially guaranteed contract this summer or let his contract expire fully in 2027, the Clippers weren't keeping much longer anyway. Turning him into someone who might be a cornerstone is an absolute no-brainer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Harden-Darius Garland trade grades: One team clearly comes out on top - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/04/cf0a093d-29db-405e-ba79-ce012127ff65/thumbnail/1200x675/6d4905c0dd36f75b5d6dd9d5abd81af7/harden-garland-getty.png"
      ],
      "datePublished": "2026-02-04T02:36:12.000Z",
      "dateModified": "2026-02-04T02:36:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn vs. Xavier prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/uconn-xavier-odds-prediction-time-2026-college-basketball-picks-tuesday-february-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/24/3bb9964f-5c77-45e1-836d-b0fcc798500c/thumbnail/1200x675/9ffe050bef5043cc1a6d83f283421d96/alex-karaban-uconn-huskies-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T21:00:51.000Z",
    "description": "\n        The third-ranked UConn Huskies look for the season sweep against the Xavier Musketeers in a key Big East Conference matchup on Tuesday. Xavie",
    "body": "\n        The third-ranked UConn Huskies look for the season sweep against the Xavier Musketeers in a key Big East Conference matchup on Tuesday. Xavier is coming off a 68-66 win over DePaul on Saturday, while Connecticut cruised to an 85-58 win at Creighton that same day. The Musketeers (12-10, 4-7 Big East), who are tied for sixth in the league, are 1-5 on the road this season. The Huskies (21-1, 11-0 Big East), who have won 17 in a row, are 11-1 on their home court. Tipoff from PeoplesBank Arena in Hartford, Conn., is set for 7 p.m. ET. UConn leads the all-time series 8-5, including a 90-67 win at Xavier on Dec. 31. UConn is a 17.5-point favorite in the latest Xavier vs. UConn odds from DraftKings Sportsbook, while the over/under for total points scored is 147.5. Before making any UConn vs. Xavier picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 14 on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and is on an 8-1 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.    \nNow, the model has simulated Xavier vs. UConn 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for UConn vs. Xavier:Xavier vs. UConn                                                                                                                                                                                    spread:    UConn -17.5 at DraftKings SportsbookXavier vs. UConn                                                                                                                                                                   over/under:    147.5 pointsXavier vs. UConn                                             money line:    UConn -2128, Xavier +1063Xavier vs. UConn                                                                                                                                                                                                picks:    See picks at SportsLineXavier vs. UConn                                                                                                                                                                                                 streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Xavier vs. UConn picksSportsLine's model is going Over on the total (147.5 points). The Over has hit in eight of the last 10 head-to-head meetings between the schools. The Over has also hit in eight of the past 10 Xavier games and in six of the past 10 UConn games. The model projects the Musketeers to have four players register 10.2 points or more, including Tre Carroll's projected 18.1 points. The Huskies, meanwhile, are projected to have five players score 12.8 or more points, led by Alex Karaban, who is projected to score 17.4 points. The model projects a combined total of 152 points as the Over clears in over 60% of simulations.The model also says one side of the spread hits over 50% of the time. You can only see that pick at SportsLine.So who wins UConn vs. Xavier, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Xavier vs. Connecticut spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn vs. Xavier prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/24/3bb9964f-5c77-45e1-836d-b0fcc798500c/thumbnail/1200x675/9ffe050bef5043cc1a6d83f283421d96/alex-karaban-uconn-huskies-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T21:00:51.000Z",
      "dateModified": "2026-02-03T21:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "There is nothing surprising about another James Harden trade - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/james-harden-trade-clippers-surprised/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/bede6737-b679-495c-8149-fa46b4e0c671/thumbnail/1200x675/5a55af49b592ce164dc2a895bf415dfc/james-harden-getty-8.png",
    "tag": "Sports",
    "date": "2026-02-03T22:15:35.000Z",
    "description": "\n        James Harden is ready to move on. That tracks. Given his history, no one should be surprised. And yet somehow the Clippers seemed surprised.O",
    "body": "\n        James Harden is ready to move on. That tracks. Given his history, no one should be surprised. And yet somehow the Clippers seemed surprised.On Monday evening, news broke that the Clippers were talking to the Cavaliers. By Tuesday, reports had those discussions accelerating, with the idea being a Harden for Darius Garland swap in some form. Sure. There is a cycle to these things for Harden. Every few years something happens in one location that makes him want to move on to another location, and then he goes to that new place and likes it fine until he doesn't. The Clippers were evidently unfamiliar with that game.Told of Harden's pending departure, Kawhi Leonard said \"that's a surprise.\" John Collins went further.\nOh, John. John, John, John, John…JOHN. To be so innocent and unsuspecting. For the moment we'll put aside the part where Collins is shocked that Harden's well-known wandering eye has once again cast his sights elsewhere. But it's hard to blame the guy for being disappointed. As he mentioned, after a rough start, the Clippers have been considerably better of late. Since December 20, they're 17-5. That's the best mark in the NBA -- but apparently still not good enough for Harden.\nThere could be any number of reasons for Harden seeking this latest divorce, but the most likely catalyst is money. Harden has a player option for next season at $42.3 million. He's 36 years old. The man would almost certainly like to decline that and sign a deal with more years that will carry him into retirement. The Clippers are perhaps unwilling to go that route even though Harden has played quality basketball in Los Angeles and put up good numbers. The roster is ancient and the Clippers surely know this era will be over sooner than later. It's also possible that, despite the Clippers playing well over the last month and a half, Harden is reading the tea leaves on the still-pending Kawhi Leonard/Aspiration cap circumvention investigation and decided to get out while the getting is good. \n        \n            \n                If the Clippers are trading James Harden, they might as well explore Kawhi Leonard deals too\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nBut as we've learned, getting out is always good for Harden. It's standard operating procedure. Which is part of what makes John Collins being \"shocked\" about Harden wanting to leave L.A. so, well, shocking. When Harden decided his time was up in Houston, he famously showed up looking bloated. And then off he went to Brooklyn, where he reunited with Kevin Durant and he was happy -- until he wasn't. That led to him reconnecting with his good friend Daryl Morey and moving to Philly, where the Sixers general manager remained his good friend -- until he wasn't. The Philly uncoupling was an all-timer even for Harden. While in China in front of some confused children he called Morey a liar and vowed to never play for the Sixers again.\nAnd then for good measure he threw a party complete with signs that read \"Daryl Morey is a liar.\" Why opt for subtlety and diplomacy when you can get an entire club to say it with their whole chest?\nAnd so Harden left Philly, and now he is poised to leave Los Angeles and then who knows maybe he'll leave Cleveland and somewhere else before he's done. It's how his career has gone because it's how he wants it to go. That is his prerogative, though it's curious that team after team keeps opting into the James Harden For a Limited Time Only Experience. You'd expect by now that the next team would see how it worked out for all the other organizations before them and that would give them pause. As so many jokers rightly pointed out on social media, it's the Arrested Development meme where all the other people in the same situation had been deluding themselves -- but it might work for us. It's been an uneven year for the Cavs. They got off to a slow start and have only lately started to stabilize. Donovan Mitchell has been asked to do a lot of heavy lifting. There have been injuries to Evan Mobley who is dealing with a calf issue and Garland, who has played just 26 games and remains out with a right toe sprain. Garland is a decade younger than Harden but maybe the Cavs don't think they can wait for him to fully mend and once again play like the two-time All-Star he was in previous seasons. Maybe Cleveland looks at the Eastern Conference and, after a disappointing playoff exit last postseason, thinks it's worth shaking up the roster in the hopes of making a run. OK. There's a certain logic to that. It's harder to land on the answer being the itinerant, aging, high-usage guard who wants more money please and thank you and will surely be scoping out the exits as soon as he walks in the entrance. \nIf and when Harden moves on, it would be his fifth team in five years. The first four didn't win anything. But hey, Harden is talented and sometimes that can be blinding. After the Clippers lost to the Sixers on Monday -- a game that Harden did not play in for obvious reasons -- Clippers head coach Ty Lue was asked about the situation and said \"who wouldn't want James Harden?\" Considering [waives hand in the direction of the teams Harden has left in his wake], who would? \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "There is nothing surprising about another James Harden trade - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/bede6737-b679-495c-8149-fa46b4e0c671/thumbnail/1200x675/5a55af49b592ce164dc2a895bf415dfc/james-harden-getty-8.png"
      ],
      "datePublished": "2026-02-03T22:15:35.000Z",
      "dateModified": "2026-02-03T22:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions fan files $100 million defamation lawsuit against DK Metcalf, Steelers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-fan-defamation-lawsuit-dk-metcalf-racist-language/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/11c2748d-85d9-435b-984f-77f87f4a34d5/thumbnail/1200x675/a19d6d0d340952049847c556000a5a80/dk-metcalf.jpg",
    "tag": "Sports",
    "date": "2026-02-04T00:09:38.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Detroit Lions fan who had an altercation with ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Detroit Lions fan who had an altercation with Pittsburgh Steelers wide receiver DK Metcalf in Week 16 has filed a lawsuit seeking $100 million in damages, claiming he was physically harmed and was falsely accused of making racist comments towards Metcalf. The lawsuit was filed in Wayne County Circuit Court by an attorney on behalf of Ryan Kennedy and names Metcalf, the Pittsburgh Steelers, Ford Field Management LLC, Chad \"Ochocinco\" Johnson, Shay Shay Media LLC and All Time Sports LLC as defendants. Metcalf was suspended two games by the NFL for reaching into the stands and grabbing Kennedy during the altercation. Kennedy claimed the incident was sparked by him calling Metcalf by his full name. On Shannon Sharpe's \"Nightcap\" podcast, Chad Johnson claimed Kennedy used racial slurs in talking about Metcalf and his mother. \nThat report was picked up by numerous outlets, and Kennedy's attorneys claim the result was \"branding Kennedy as a racist on a national scale and subjecting him to death threats, hate mail, and severe damage to his business reputation.\" Kennedy held a press conference in December to deny those accusations and called on Metcalf to \"correct the record\" and publicly confirm he didn't use racist language. Metcalf declined to speak about the incident after his reinstatement following his suspension. \n\"Defendants have failed to issue any public retractions or corrections acknowledging that Plaintiff Kennedy never used racial slurs or hate speech,\" according to the lawsuit. \"Defendant Metcalf, despite being the alleged source of the false and reckless statements, has refused to issue any public statement clarifying that Plaintiff Kennedy did not use racial slurs, thereby perpetuating the defamatory statements.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions fan files $100 million defamation lawsuit against DK Metcalf, Steelers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/11c2748d-85d9-435b-984f-77f87f4a34d5/thumbnail/1200x675/a19d6d0d340952049847c556000a5a80/dk-metcalf.jpg"
      ],
      "datePublished": "2026-02-04T00:09:38.000Z",
      "dateModified": "2026-02-04T00:09:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arizona coach Tommy Lloyd praises Bryce James amid redshirt season for Wildcats - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/arizona-tommy-lloyd-bryce-james-redshirt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/a5992aeb-1182-40a3-84d9-9cdb4cd25e10/thumbnail/1200x675/cb30294811def3f6ea6351f697cdce60/bryce-james-arizona.jpg",
    "tag": "Sports",
    "date": "2026-02-03T22:47:12.000Z",
    "description": "\n        Bryce James -- LeBron James' younger son -- hasn't appeared in a game this season for No. 1 Arizona, but that hasn't stopped him from impress",
    "body": "\n        Bryce James -- LeBron James' younger son -- hasn't appeared in a game this season for No. 1 Arizona, but that hasn't stopped him from impressing. Speaking to Chancellor Johnson, Wildcats coach Tommy Lloyd confirmed James is redshirting this season.\n\"Bryce has made huge progress,\" Lloyd said. \"He's been with us through the summer and now. The redshirting decision was a long play to give Bryce the most options in his career as his career unfolds. I have a real strong belief that Bryce is gonna be a contributor at Arizona in the near future.\"James, the 324th-ranked player in the 2025 high school recruiting class according to the 247Sports Composite, only turned 18 in June, putting him on the younger side of the class. That played a role in the decision, Lloyd said.\"He's really shown a lot of progress, not only learning our system but just physically maturing,\" Lloyd said. \"One of the things I don't think people understand is he was kind of a year behind, age-wise, his class, and when you're a year behind your natural age class, we know some of these kids are a year other than two older. ... Part of the thinking was, 'Let's slow it down and let Bryce's physical development catch up with his peers,' and it really has.\"\nJames, a shooting guard listed at 6'5\" and 195 pounds, committed to Arizona over Ohio State and Duquesne. Early in the season, Lloyd said a redshirt year was on the table, but a final decision was yet to be made.Arizona (22-0, 9-0 Big 12) had the country's No. 2 recruiting class last year, headlined by five-star prospects Brayden Burries and Koa Peat and four-star guard Dwayne Aristode. Burries leads the team with 15.3 points per game, followed by Peat (14.8) and senior guard Jaden Bradley (13.9). Add in the return of Anthony Dell'Orso and the addition of Ivan Kharchenkov, who had played professionally in Europe, and there was a logjam ahead of James, too.Still, Lloyd has been impressed with James' attitude despite not playing.\n\"We love having Bryce around,\" Lloyd said. \"What I'll say about Bryce is he's a normal person, a normal kid. He's a great teammate. He draws no extra attention to himself. That's all from the outside. Those people do it, but on a day-to-day basis, he's a really valued member of our team, and he's a great young man.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arizona coach Tommy Lloyd praises Bryce James amid redshirt season for Wildcats - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/a5992aeb-1182-40a3-84d9-9cdb4cd25e10/thumbnail/1200x675/cb30294811def3f6ea6351f697cdce60/bryce-james-arizona.jpg"
      ],
      "datePublished": "2026-02-03T22:47:12.000Z",
      "dateModified": "2026-02-03T22:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots' Mike Vrabel calls Hall of Fame snub of Patriots owner Robert Kraft 'unfortunate' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-robert-kraft-pro-football-hall-of-fame-mike-vrabel-calls-snub-unfortunate/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/896676c5-4b71-4ea1-99eb-c6018789f087/thumbnail/1200x675/e078fcffb7517d1670be885470f38d8f/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-02-03T22:25:58.000Z",
    "description": "\n        SANTA CLARA, Calif. -- The Pro Football Hall of Fame is not knocking on Robert Kraft's door yet again. On Tuesday, a report surfaced that the",
    "body": "\n        SANTA CLARA, Calif. -- The Pro Football Hall of Fame is not knocking on Robert Kraft's door yet again. On Tuesday, a report surfaced that the New England Patriots owner will not be enshrined in Canton this year as a member of the Class of 2026. This decision comes in the backdrop of Kraft's Patriots gearing up for Super Bowl LX. Naturally, this item was Question No. 1 when Mike Vrabel -- who has both played and coached under Kraft's ownership -- stepped to the podium for his Tuesday press conference.\"I would just say that that's unfortunate,\" the head coach said in the media tent outside of the team hotel. \"I would say that in my experiences with Robert, he's more than deserving, and he'll be in the Hall of Fame. I'm not in charge of deciding when that happens. \n        \n            \n                Second Hall of Fame voter explains Bill Belichick snub: 'I voted for Robert Kraft, not against Belichick'\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \n\"So, I appreciate the relationship that I've had with him and the success as a player, and now as a coach. So, he's done everything that we've needed and provided the support that we've needed as a staff and as a team. So, I'm glad that he's back here and continuing to help us do things that will help the team win, and ultimately allow him to be recognized.\"\nKraft has been up for the Hall of Fame for quite a while, and it appeared as if this would finally be the year he broke through, particularly after being named a finalist for the first time in his pursuit. However, he did not receive the necessary votes from the 50-person selection committee. After purchasing the franchise in 1994, Kraft has boosted the Patriots to blue-blood status in the NFL hierarchy. The franchise has played in 10 Super Bowls under Kraft, and Super Bowl LX will make it 11 during his ownership. If New England can defeat the Seattle Seahawks on Sunday, the organization will have won its seventh Lombardi Trophy (all with Kraft as owner), which would be more than any other franchise has won in the history of the league. \nAlong with Kraft, former Patriots head coach Bill Belichick also did not receive enough votes to be enshrined into the Hall of Fame, according to reports, so two key pillars to the greatest dynasty of this millennium will need to wait at least one more year. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots' Mike Vrabel calls Hall of Fame snub of Patriots owner Robert Kraft 'unfortunate' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/896676c5-4b71-4ea1-99eb-c6018789f087/thumbnail/1200x675/e078fcffb7517d1670be885470f38d8f/template-pic.jpg"
      ],
      "datePublished": "2026-02-03T22:25:58.000Z",
      "dateModified": "2026-02-03T22:25:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anfernee Simons trade grades: Celtics earn 'B' for landing Bulls' Nikola Vučević - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/anfernee-simons-trade-grades-celtics-bulls-nikola-vucevic/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/abab574f-a0ca-411e-856b-b768ec380ec9/thumbnail/1200x675/fa3ed24a95ecb3791228eaf784007f78/anfernee-simons-getty.png",
    "tag": "Sports",
    "date": "2026-02-03T22:24:57.000Z",
    "description": "\n        The Boston Celtics are trading Anfernee Simons and a second-round pick to the Chicago Bulls for Nikola Vučević and a second-round pick, accor",
    "body": "\n        The Boston Celtics are trading Anfernee Simons and a second-round pick to the Chicago Bulls for Nikola Vučević and a second-round pick, according to ESPN. The deal is the latest in a string of trades the Bulls have made at this year's deadline (follow live updates here), as Chicago has not only added Mike Conley and Jaden Ivey, but taken on money for multiple teams in exchange for draft capital. Boston, meanwhile, addresses its meaningful hole at the center position with a former All-Star that fills in a stylistic gap left behind by Al Horford and Kristaps Porziņģis, and in the process, took a step towards reaching its financial goals.So, how'd these teams do in the deal? Let's grade the trade.\n                            \n    \n                                                \n                    \n    Boston Celtics: BLet's start with the obvious: the Celtics needed center depth. While Neemias Queta has thrived as the starter this season, Luka Garza was not going to cut it in the postseason. Enter, Vučević. While his defensive vulnerabilities have been problematic in the playoffs in the past, he'll likely have an easier time with the Celtics because of their defensive infrastructure and the fact that he'll likely be in a smaller role.He is, critically, a stylistic curveball from Queta. Boston has thrived with shooting centers in the past, and while Garza has been playable for them this season, he's not Al Horford or Kristaps Porziņģis. Vučević is a much more reliable option as a shooting big man, and his presence allows the Celtics to toggle their playing style pretty readily. Queta is a rim-protector, a screener and a rim-roller. While neither he nor Vučević are complete big men, they do different things well and off Boston some needed variety. The duo should complement one another very well, though they'll likely never play together.The deeper implications of this trade, however, are financial. The Celtics entered Tuesday around $12 million above the luxury-tax line. Getting below the line this year would be extremely meaningful to Boston moving forward. The Celtics are a repeater tax team. If they can duck the line this year and next, they'll reset the repeater clock entirely. Considering how punitive the repeater tax is and how pricey keeping this team together (and adding to it) will likely be, resetting that clock is going to mean a ton moving forward.\nThe Celtics didn't do that fully here. They got about halfway home. As of right now, the Celtics are $5.9 million above the tax. Using Simons to clear the first $6 million or so is a start. The next $6 million, however, is much harder. Boston doesn't have bad money to dump. More than half of their roster makes less than $3 million. They could find some savings by trading some of their minimum players and replacing them with pro-rated minimum free agents, but it's hard to imagine them saving $6 million that way. That's why Jusuf Nurkić had been a popular hypothetical Boston center target. Though he makes plenty, the gap between his salary and Vučević's is big enough that the Celtics would have had a pretty straightforward map to ducking the tax afterward. Realistically, there are two paths to doing so now: trading Sam Hauser, or re-trading Vučević.For now, we have no indication that either move is in the offing. Hauser is a beloved, homegrown reserve and Vučević actually addresses a need for them. If the Celtics don't make a follow-up trade, they've at least set themselves up to add another player. The Celtics are now below the first apron, at least. That means they are allowed to sign a free agent who was making more than the non-taxpayer mid-level exception when he was waived, or, in layman's terms, a buyout player. There isn't an obvious target out there now, but with the blockbusters flying left and right, it's entirely possible that some helpful veteran finds himself on the market, and the Celtics could use their newfound flexibility to add that player. Still, the priority should be ducking the tax.Losing Simons stings. Though he started out the year slowly, he was finding his footing in Boston after spending most of his career on Portland teams that weren't true contenders. They'll miss his scoring, but if Jayson Tatum comes back, well, that's an easy replacement. Ultimately the Celtics were unlikely to pay Simons for the long haul, so as much as it stings to lose him from this year's team, it was a price they needed to pay in order to secure a center and start the process of ducking the tax.\n                            \n    \n                                                \n                    \n    Chicago Bulls: B-The broad concept makes sense for Chicago. They're also getting a good second-round pick in the deal (Chicago will reportedly get the most favorable of the Pelicans, Blazers, Knicks and Wolves second-round picks this June). The Bulls are going nowhere this season. Sure, they'll probably earn their obligatory Play-In berth, but their ambitions, for now, don't go much further. So Chicago has wisely decided to use this deadline to act as a financial facilitator, and the team has broadly done well in that role thus far.\nThe draft capital the Bulls have accumulated is small, but it adds up. The real prize so far was their addition of Jaden Ivey in a trade with Minnesota and Detroit earlier Tuesday, but we're not grading that deal here. Overall, this is just a smart use of resources. The Bulls aren't forcing win-now moves and they're not being stingy with tier cash. They're making the most of what they have, and will likely continue to do so with a Coby White trade before the deadline. Good overall work.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anfernee Simons trade grades: Celtics earn 'B' for landing Bulls' Nikola Vučević - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/abab574f-a0ca-411e-856b-b768ec380ec9/thumbnail/1200x675/fa3ed24a95ecb3791228eaf784007f78/anfernee-simons-getty.png"
      ],
      "datePublished": "2026-02-03T22:24:57.000Z",
      "dateModified": "2026-02-03T22:24:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]