[
  {
    "title": "Orioles reportedly interested in MLB veteran Albert Pujols for open managerial position - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/orioles-reportedly-interested-in-mlb-veteran-albert-pujols-for-open-managerial-position/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/b6a25b07-89fc-4d2c-8dcf-029e623e540f/thumbnail/1200x675/5ef4770d78ed8525fdae5eccb5dd0862/pujols-getty.png",
    "tag": "Sports",
    "date": "2025-10-15T22:48:01.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Add the Orioles to the list of teams with interest",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Add the Orioles to the list of teams with interest in future Hall of Famer Albert Pujols for their open managerial position. The O's have expressed interest in Pujols but have yet to formally interview him, according to ESPN. The MLB veteran is reportedly also in talks with the Angels, his longtime team, about their opening.Orioles president of baseball operations Mike Elias was a scout with the Cardinals when Pujols starred in St. Louis as a player.  Expected to contend for the World Series this year, Baltimore instead went 75-87 and finished in last place in the AL East. Erstwhile manager Brandon Hyde was fired with the team's record sitting at 15-28 on May 17. The O's played better under interim manager Tony Mansolino (60-59), but not better enough to stop Elias from looking for a new full-time skipper.\n\n        \n            \n                MLB manager tracker: Padres' job becomes eighth opening as Mike Shildt retires\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nPujols, 45, retired following the 2022 season and last year won a championship with Leones del Escogido of  the Dominican Winter League. It was his managerial debut. Pujols is slated to manage the  Dominican Republic in next spring's World Baseball Classic. In parts of 22 seasons, Pujols batted .296/.374/.544 with 703 home runs  and 117 stolen bases. He is an 11-time All-Star who won three MVPs, two Gold Gloves, six Silver Sluggers, and two World Series titles. Pujols will be eligible for the Hall of Fame in 2028.\nThe O's and Angels are two of eight teams without a manager, joining the Braves, Giants, Nationals, Padres, Rockies, and Twins.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Orioles reportedly interested in MLB veteran Albert Pujols for open managerial position - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/b6a25b07-89fc-4d2c-8dcf-029e623e540f/thumbnail/1200x675/5ef4770d78ed8525fdae5eccb5dd0862/pujols-getty.png"
      ],
      "datePublished": "2025-10-15T22:48:01.000Z",
      "dateModified": "2025-10-15T22:48:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kaulig Racing fires spotter for Ty Dillon after playoff-altering accident involving William Byron - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nascar/news/kaulig-racing-fires-spotter-for-ty-dillon-after-playoff-altering-accident-involving-william-byron/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/96b39364-ff3b-43d9-b882-0017c55cd04f/thumbnail/1200x675/b3d5c9dfa420d9163e60f2b16c9a3f42/gettyimages-2240313689.jpg",
    "tag": "Sports",
    "date": "2025-10-16T00:06:45.000Z",
    "description": "\n        NASCAR spotter Joe White shared Wednesday that he has been fired following a major accident involving Ty Dillon, the driver for whom he spott",
    "body": "\n        NASCAR spotter Joe White shared Wednesday that he has been fired following a major accident involving Ty Dillon, the driver for whom he spotted, and Cup Series playoff contender William Byron late in Sunday's race at Las Vegas Motor Speedway. White worked for Kaulig Racing as the spotter for their No. 10 Cup Series team as well as their No. 11 Xfinity Series team.With 31 laps to go in Sunday's opening race of the Round of 8 at Las Vegas, Dillon -- who had been running laps down with a car that he had been struggling with -- was called to pit road for a green flag stop just after the leaders finished their cycle of stops. Normally, there is an expectation for a team coming to pit road to alert traffic behind them that they are slowing down to come to pit road, whether it be by the spotter alerting the spotter for the car running behind them or by the driver delivering a hand signal to traffic behind them. This is especially true in cases where a lap down car is coming to pit road in front of lead lap cars.\nDillon was called to pit road just after being put a lap down by race leader Kyle Larson, and he began to slow in Turns 3 & 4 in order to make the entry to pit road a short distance ahead of William Byron, who just lost the lead and remained second. But apparently, Byron's team had not received a message from Dillon's team that they were going to pit: Byron had only been informed to expect Dillon to run in either the second or third lane, leaving him completely unaware that the No. 10 in front of him was coming to pit road.\nThe result was a violent collision that took both Dillon and Byron out of the race, and one which has severely hampered Byron's championship hopes. Prior to the crash, Byron had possessed a 23 point advantage over the cut line to make the Championship 4, and still had a chance of earning a spot in the final round outright by winning. Instead, and despite having led 55 laps, Byron left Las Vegas with a 36th place finish that has left him 15 points below the cut line. Byron will now have to either overcome his points deficit or win at either Talladega or Martinsville to advance to the final round of the playoffs and have a chance to win the Cup Series championship in the season finale at Phoenix.\n\"I never saw him wave. I didn't see any indication that he was  pitting, and it was probably 12 to 15 laps after we had pitted, so I  thought the cycle [of green flag stops] was fully over,\" Byron told USA upon exiting the infield care center.  \"Nobody said anything to my spotter from what I know. I had zero idea.  ... I was watching him thinking 'okay, he missed the bottom a little bit  here' and then he just started slowing, and I had no idea what was  going on.\"I'm just devastated. I had no indication, so I obviously wouldn't have just driven full speed into the back of him like that.\"\nOn Wednesday afternoon, White shared that he had been fired upon arriving in Talladega for this weekend's race and that he was heading to the airport to return home. While White had not been slated to return as Dillon's spotter in 2026, it was expected that he would remain with Kaulig prior to his mid-week dismissal.\nWith White no longer with the team, Frank Deiny Jr., who had been the spotter for Kaulig's No. 16 team and A.J. Allmendinger, will move over to the No. 10 team to be Dillon's spotter for the final three races of the season. Former NASCAR driver T.J. Bell will take over as spotter for Allmendinger and the No. 16 team.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kaulig Racing fires spotter for Ty Dillon after playoff-altering accident involving William Byron - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/96b39364-ff3b-43d9-b882-0017c55cd04f/thumbnail/1200x675/b3d5c9dfa420d9163e60f2b16c9a3f42/gettyimages-2240313689.jpg"
      ],
      "datePublished": "2025-10-16T00:06:45.000Z",
      "dateModified": "2025-10-16T00:06:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, Week 7 against the spread spread, money-line, over/under predictions from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-against-spread-money-line-over-under-ai-week-7-betting-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/4c51f777-f8c4-434c-b246-2243744e7380/thumbnail/1200x675/e55ecab1f377c79940824da81df6a395/patrick-mahomes-kansas-city-chiefs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-16T06:04:12.000Z",
    "description": "\n        The AFC West race heats up in Week 7 with several key battles, including a matchup between longtime bitter rivals when the Chiefs take on the",
    "body": "\n        The AFC West race heats up in Week 7 with several key battles, including a matchup between longtime bitter rivals when the Chiefs take on the Las Vegas Raiders in Kansas City. The Chiefs (3-3), who are third in the division, are just one game out of first place. The Chiefs have won the division in each of the past nine seasons. Other AFC West teams in action include the Denver Broncos (4-2), who play the New York Giants (2-4) at Denver, and the Los Angeles Chargers (4-2), who play the AFC South-leading Indianapolis Colts (5-1) in Los Angeles. The Chiefs are 11.5-point favorites over the Raiders (2-4), the Broncos are 7-point favorites over the Giants and the Chargers are 1.5-point favorites over the Colts.  How should you handle those NFL games and optimize what to bet on NFL in Week 7? Before making any Week 7 NFL picks or Week 7 NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 7 NFL betting, the AI PickBot has evaluated the NFL odds and provided NFL betting picks for all 15 games. You can only see the AI predictions for the Week 7 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2  in select states.Top Week 7 NFL AI picksAfter analyzing every game in Week 7, the AI says the Chiefs (-11.5) cover comfortably against the Raiders. Kansas City quarterback Patrick Mahomes has been dominant completing 64.8% of his passes for 1,514 yards and 11 touchdowns with just two interceptions. In the 30-17 win over the Detroit Lions, Mahomes completed 22 of 30 passes (73.3%) for 257 yards and three touchdowns. He completed 29 of 41 passes (70.7%) for 318 yards and one touchdown with one interception in a 31-28 loss to the Jacksonville Jaguars on Oct. 6.Mahomes is well on his way to a Hall of Fame career. He is in his ninth season with Kansas City after being drafted in the first round of the 2017 NFL Draft. In 118 career games, he has completed 66.5% of his passes for 33,866 yards and 256 touchdowns with 76 interceptions for a rating of 101.9. He has led Kansas City to five Super Bowls, winning three championships.AI PickBot rates a Chiefs cover as an B pick and also predicts a 31-17 win on average. See its other Week 7 football predictions and football picks at SportsLine.How to make Week 7 NFL picksIn addition, the AI PickBot has generated well over 30 highly-coveted A+ picks for Week 7. You need to see the AI's NFL picks before making any Week 7 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 7 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, Week 7 against the spread spread, money-line, over/under predictions from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/01/4c51f777-f8c4-434c-b246-2243744e7380/thumbnail/1200x675/e55ecab1f377c79940824da81df6a395/patrick-mahomes-kansas-city-chiefs-imagn-images.jpg"
      ],
      "datePublished": "2025-10-16T06:04:12.000Z",
      "dateModified": "2025-10-16T06:04:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keegan Murray contract: Kings forward agrees to five-year, $140 million rookie extension, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/keegan-murray-contract-kings-forward-agrees-to-five-year-140-million-rookie-extension-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/eb6250b2-8452-4e80-864a-d5e286c221ba/thumbnail/1200x675/04daf9991b0c4f3be1c8fbc105e3f402/keegan-murray.jpg",
    "tag": "Sports",
    "date": "2025-10-16T00:21:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Sacramento Kings have reportedly signed forwar",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Sacramento Kings have reportedly signed forward Keegan Murray to a five-year, $140 million rookie extension, per ESPN's Shams Charania. The fourth overall pick in the 2022 NBA Draft was set to become a restricted free agent next summer, but this new deal locks him in with Sacramento through the 2030-31 season.The hope is that Murray can return to the version of himself that averaged 15.2 points on 35.8% from 3-point range in his sophomore season. He looked like a solid 3-and-D threat that season, but his numbers took a dive last season (12.4 points, 34.3% from deep), in part due to all of the changes around him on the roster with the additions of DeMar DeRozan and Zach LaVine, and the departure of De'Aaron Fox. There was also the firing of Mike Brown and promoting Doug Christie to the lead position, which certainly contributed to Murray's third-year slump. But with a full offseason with this roster and coaching staff, Murray could certainly return to form. Unfortunately, though, he'll be starting the season on the injured list after suffering a torn ligament in his thumb which will keep him sidelined for 4-6 weeks. That's a massive loss out the gate for the Kings. But in the long-term, locking Murray into an extension is a win for a franchise that has seemed directionless over recent years.\n        \n            \n                Kings remain directionless with Russell Westbrook signing: How Sacramento can escape pit of mediocrity\n                \n                    Cameron Salerno                \n            \n                            \n    \n                \n                    \n    \nMurray's extension comes on the heels of the team signing veteran guard Russell Westbrook to a deal on Wednesday, adding him to an already overcrowded backcourt. It's unclear how Westbrook will fit on this roster, or what minutes he'll get given the team already employs Dennis Schröder, Malik Monk and Keon Ellis. But that's small potatoes when you consider all the bad moves the Kings have made over the years (like trading Tyrese Haliburton).\nSigning Murray to an extension was the smart move. Either the Kings can see how Murray continues to develop, or he becomes a valuable trade chip for a contending team looking for size on the perimeter who is a career 37.2% 3-point shooter. Murray holds the Kings record for most 3s made in a single game (12), according CBS Sports research. He also broke the NBA rookie record for most 3-pointers in a season (206) and is one of just three players to post at least 500 3-pointers, 150 blocks and 150 steals over the last three seasons. The other two players in that category are Anthony Edwards and Derrick White, pretty good company to be in for the fourth-year forward. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keegan Murray contract: Kings forward agrees to five-year, $140 million rookie extension, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/eb6250b2-8452-4e80-864a-d5e286c221ba/thumbnail/1200x675/04daf9991b0c4f3be1c8fbc105e3f402/keegan-murray.jpg"
      ],
      "datePublished": "2025-10-16T00:21:28.000Z",
      "dateModified": "2025-10-16T00:21:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James injury update: Timeline emerges for Lakers star's season debut, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lebron-james-injury-update-timeline-emerges-for-lakers-stars-season-debut-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/e9c1ee93-5344-463c-8040-d47ea986eae6/thumbnail/1200x675/a7df37f8cfc672685f4c8fa57f53fc19/untitled-design-54.png",
    "tag": "Sports",
    "date": "2025-10-16T03:18:41.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Los Angeles Lakers star LeBron James is targeting ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Los Angeles Lakers star LeBron James is targeting a mid-November return to the floor after being sidelined with sciatica, ESPN's Shams Charania reported Wednesday. The Lakers announced Oct. 9 that James would be out 3-4 weeks, but Charania noted that James, 40, will take a \"patient approach\" with his rehabilitation process. Reports surfaced earlier this month that James was dealing with nerve irritation in his glute and would likely miss the entire NBA preseason. It was reported that James was ramping up his workload to prepare for the Lakers' season opener against the Golden State Warriors on Oct. 21. However, his timeline to return has been pushed back, meaning he will miss his team's first game of the season for the first time in his 23-year career.\n        \n            \n                LeBron James injury ripple effects: Luka Dončić's MVP case gets stronger, Bronny in Lakers' rotation?\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nIf James is indeed out until mid-November, it's possible he would miss the first 10-15 games of the season. The Lakers have a five-game road trip starting in Atlanta against the Hawks on Nov. 8 and don't play back in Los Angeles until Nov. 18 against the Utah Jazz. That game against the Hawks will be L.A.'s 10th game of the season.\nNotably, NBA awards such as MVP, Defensive Player of the Year and All-NBA require players to play in at least 65 games. James averaged 24.4 points, 7.8 rebounds and 8.2 assists in 70 games played during the 2024-25 season, en route to earning Second-Team All-NBA honors.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James injury update: Timeline emerges for Lakers star's season debut, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/e9c1ee93-5344-463c-8040-d47ea986eae6/thumbnail/1200x675/a7df37f8cfc672685f4c8fa57f53fc19/untitled-design-54.png"
      ],
      "datePublished": "2025-10-16T03:18:41.000Z",
      "dateModified": "2025-10-16T03:18:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "J.J. McCarthy injury: Vikings QB 'getting there' with hopes to return soon, Kevin O'Connell explains plan - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/j-j-mccarthy-injury-vikings-qb-getting-there-with-hopes-to-return-soon-kevin-oconnell-explains-plan/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/981cde03-c206-49cb-aa4f-7d7c68e341fb/thumbnail/1200x675/fb2e06747d1083067962715c2d116176/j-j-mccarthy.jpg",
    "tag": "Sports",
    "date": "2025-10-15T22:48:43.000Z",
    "description": "\n        Minnesota Vikings quarterback J.J. McCarthy missed his entire rookie season due to a knee injury. He already missed three games this season d",
    "body": "\n        Minnesota Vikings quarterback J.J. McCarthy missed his entire rookie season due to a knee injury. He already missed three games this season due to an ankle injury.\"It's getting there. I wouldn't say it's 100 percent,\" McCarthy said.If it was up to McCarthy, who returned to practice on Monday and was a limited participant Wednesday, he would play when the Vikings (3-2) host the Philadelphia Eagles (4-2) on Sunday.\"We've got to be smart and understand there's a lot of things that go on. I'm just going to do what I'm told and try to get better,\" McCarthy said.\nThe Eagles, who are on a two-game losing streak, would go up against Carson Wentz if McCarthy can't play. Wentz, who the Eagles picked No. 2 overall in the 2016 draft, started in place of McCarthy the last three weeks. Both McCarthy and Wentz, who was a full participant practice while nursing a sore shoulder, can expect plenty of work in practice. \"I'm having a blast coaching [McCarthy],\" coach Kevin O'Connell said. \"It started last week, when he was able to really start ramping up a little bit. That 1-on-1 work, and then obviously the work he does with [quarterback coaches Josh McCown and Jordan Traylor] is going to be critical.\"O'Connell previously said McCarthy would need to practice for a full week before he gets clearance to play. In three games, Wentz leads Minnesota in passing with a 69% completion rate, 759 yards, five touchdowns and two interceptions. McCarthy's two appearances feature a 58.5% passing clip, 301 yards, two touchdowns and three interceptions.\n\"I think the big thing is just getting him back on the grass, in uniform, practicing, getting real live reps of a pass rush and taking drops and applying some of the things that he's worked really hard on as of late, as he's kind of gotten to that phase of his rehab,\" O'Connell said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "J.J. McCarthy injury: Vikings QB 'getting there' with hopes to return soon, Kevin O'Connell explains plan - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/981cde03-c206-49cb-aa4f-7d7c68e341fb/thumbnail/1200x675/fb2e06747d1083067962715c2d116176/j-j-mccarthy.jpg"
      ],
      "datePublished": "2025-10-15T22:48:43.000Z",
      "dateModified": "2025-10-15T22:48:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions safety Brian Branch loses appeal of one-game suspension, will miss Week 7 after post-game fight - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-safety-brian-branch-loses-appeal-of-one-game-suspension-will-miss-week-7-after-post-game-fight/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/a783c884-860c-45fc-bdbb-1dcae5618867/thumbnail/1200x675/554a9440107a8c9cd0274e24fb610a06/gettyimages-2240354615.jpg",
    "tag": "Sports",
    "date": "2025-10-16T01:02:33.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Detroit Lions safety Brian Branch's appeal of his ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Detroit Lions safety Brian Branch's appeal of his one-game suspension for fighting after his team's loss to the Kansas City Chiefs has been heard and upheld upon appeal, meaning Branch will officially miss his team's Week 7 game against the Tampa Bay Buccaneers and forfeit his game check. Per the NFL, Branch's appeal was heard by Jordy Nelson, the longtime receiver who now works as an appeals officer for the leagur.Branch initiated a fight after the Lions' 30-17 loss to the Chiefs, as he punched receiver JuJu Smith-Schuster following the game-ending kneeldown, triggering a larger skirmish between the two teams. Branch was publicly admonished for his actions by Lions coach Dan Campbell, and he himself expressed remorse despite saying that he had been frustrated with Smith-Schuster's actions during the game.\"I did a real childish thing,\"  Branch said. \"I'm tired of people doing stuff in between plays and refs  don't catch it. They be trying to bully me out there. I shouldn't have  did it, it was childish.\"  \n        \n            \n                NFL suspends Brian Branch without pay for initiating postgame brawl between Lions, Chiefs\n                \n                    Bryan DeArdo                \n            \n                            \n    \n                \n                    \n    \nBranch's suspension marks the latest disciplinary action taken toward him by the NFL league office. Branch has already been fined 14 times in his NFL career including four times this season. Prior to Sunday night, Branch had been fined a combined $34,784 for one unsportsmanlike conduct infraction and two unnecessary roughness penalties. \nBranch's suspension deprives the Lions defense of one of their best players entering another tough matchup, as they will play in primetime on Monday night against the 5-1 Tampa Bay Buccaneers.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions safety Brian Branch loses appeal of one-game suspension, will miss Week 7 after post-game fight - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/a783c884-860c-45fc-bdbb-1dcae5618867/thumbnail/1200x675/554a9440107a8c9cd0274e24fb610a06/gettyimages-2240354615.jpg"
      ],
      "datePublished": "2025-10-16T01:02:33.000Z",
      "dateModified": "2025-10-16T01:02:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 7 NFL score predictions, best bets today: Betting expert reveals exact picks for all 15 games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-score-predictions-week-7-best-bets-odds-expert-picks-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/3e8fa6c4-48b6-494e-a516-551c57e79bd4/thumbnail/1200x675/2dde3eb6eea9b104a8ff1d389d3b0bc6/justin-jefferson-minnesota-vikings-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T21:12:18.000Z",
    "description": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been ravin",
    "body": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been raving about the undefeated Eagles and Bills. Now both teams have lost two straight games. How about Lamar Jackson and the Ravens, one of the preseason favorites? With Jackson having been out each of the last two weeks, Baltimore enters its bye week 1-5 and is in serious danger of missing the postseason. Even the three-time defending AFC champion Chiefs aren't immune. They sit 3-3 heading into a Week 7 home date with AFC rival Las Vegas, though Kansas City is the largest favorite of the week at -11.5.Which teams would you take today to make the Super Bowl? Before the contenders start to separate from the pretenders, unpredictability in the NFL will continue to reign supreme. Week 7's 15 game slate should tell us plenty. Before making any Week 7 NFL picks, be sure to see the exact NFL score predictions from SportsLine expert Eric Cohen.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A SportsLine expert and host, Cohen is evaluating the entire Week 7 NFL slate and delivers score predictions and logic for each matchup. He finished the 2024-25 season with a 190-95 record on straight-up NFL betting picks (69%) and was profitable for bettors. He's 60-32-1 (65%) on straight-up picks so far this season. Anyone who followed Cohen's NFL predictions has been profitable at their favorite sports betting sites and betting apps. You can only see Cohen's Week 7 NFL exact score predictions at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 7 NFL picksAfter diving into all 15 games on the NFL Week 7 schedule, Cohen likes the Vikings (+1.5, 43.5) to send the defending champion Eagles to their third straight loss. The Eagles struggled mightily on defense last week, and it's uncertain if cornerback Quinyon Mitchell (hamstring) will be back this week. \"I think it's fair to call this game a must win for Philadelphia coming off two straight losses. We've already seen one Eastern Pennsylvania team fire a successful head coach (Penn State, James Franklin), and while I don't think Nick Sirianni's job is in imminent danger considering he most recently won the Super Bowl, a third straight loss will turn up the heat a bit. Coming off a bye week and with a brutal stretch ahead, this game might be a must win for Minnesota as well. This is the type of game where I would bet both sides +7.5 at something like -125 odds and prepare for a close game no matter who wins. My coin flip says Philly's misery continues for another week. Vikings 23, Eagles 21\". See his other Week 7 football score predictions at SportsLine.How to make Week 7 NFL score predictionsIn addition, Cohen is picking one game to fly over the projected total. You can see who it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for just $1.Who wins every Week 7 NFL game, and which game is a must bet for the over? Visit SportsLine now to get Eric Cohen's NFL Week 7 score predictions, all from the NFL expert who has nailed 65% of his NFL straight-up picks this season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 7 NFL score predictions, best bets today: Betting expert reveals exact picks for all 15 games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/04/3e8fa6c4-48b6-494e-a516-551c57e79bd4/thumbnail/1200x675/2dde3eb6eea9b104a8ff1d389d3b0bc6/justin-jefferson-minnesota-vikings-imagn-images.jpg"
      ],
      "datePublished": "2025-10-15T21:12:18.000Z",
      "dateModified": "2025-10-15T21:12:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jonathan Gannon explains when he learned to take emotion out of coaching: 'When our quarterback went to jail' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jonathan-gannon-explains-when-he-learned-to-take-emotion-out-of-coaching-when-our-quarterback-went-to-jail/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/ad41cf59-443a-47bb-9b79-c9ea7d958085/thumbnail/1200x675/a1d5595e49bdf1db7df9853f99d47ee8/jonathan-gannon.jpg",
    "tag": "Sports",
    "date": "2025-10-15T22:49:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Arizona Cardinals are having a tough 2025 seas",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Arizona Cardinals are having a tough 2025 season. They suffered the most embarrassing loss of any team in the league two weeks ago when they melted down against the then-winless Titans to hand Tennessee a victory. At 2-4 and in danger of falling fully out of the playoff race, they are dealing with another injury absence from quarterback Kyler Murray. Murray missed last week's game with a foot sprain, and his status still unsure for this week against Green Bay. Cardinals coach Jonathan Gannon received a question Wednesday about dealing with injuries and when he learned to put emotion aside as a coach. He offered up an extremely blunt answer about his time on the Atlanta Falcons coaching staff. \"2007. When our quarterback went to jail,\" Gannon said, succinctly.\nIt's highly doubtful that was the answer which the reporter expected, but that was Gannon's first year in the NFL (and only year in Atlanta) as a quality control coach. That situation would certainly impact you as a young coach in the NFL and provide a harsh lesson about how quickly things can change. Gannon is navigating a very different situation in Arizona, but one that has him on the hot seat nonetheless. It's been pretty clear that Gannon feels the frustration of another losing season in Arizona, as he's now 14-26 as an NFL head coach, and that's surfaced in a variety of ways.\nMost notably, Gannon got tagged with a $100,000 fine for hitting Emari Demarcado on the sidelines during the Titans loss after he dropped the ball before reaching the goal line. He's also apparently not particularly interested in offering up flowery anecdotes about lessons he's learned as a coach, as evidenced by his answer that left those in his press conference without a follow-up on Wednesday. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jonathan Gannon explains when he learned to take emotion out of coaching: 'When our quarterback went to jail' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/ad41cf59-443a-47bb-9b79-c9ea7d958085/thumbnail/1200x675/a1d5595e49bdf1db7df9853f99d47ee8/jonathan-gannon.jpg"
      ],
      "datePublished": "2025-10-15T22:49:27.000Z",
      "dateModified": "2025-10-15T22:49:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Rookie of the Year, Sixth Man Malcolm Brogdon announces retirement one week before Knicks season opener - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/former-rookie-of-the-year-sixth-man-malcolm-brogdon-announces-retirement-one-week-before-knicks-season-opener/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/f30ca9fc-5465-4f00-9f43-778e13e7f9bd/thumbnail/1200x675/5e394dd731c84abc7198ed3119f94aea/malcolm-brogdon-knicks.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:22:38.000Z",
    "description": "\n        New York Knicks guard Malcolm Brogdon is retiring at 32 years old, he told ESPN Wednesday. The nine-season veteran's decision comes exactly o",
    "body": "\n        New York Knicks guard Malcolm Brogdon is retiring at 32 years old, he told ESPN Wednesday. The nine-season veteran's decision comes exactly one week ahead of the Knicks' season opener against the Cleveland Cavaliers.\"Today, I officially begin my transition out of my basketball career,\" he said in a statement. \"I have proudly given my mind, body, and spirit to the game over the last few decades. With the many sacrifices it took to get here, I have received many rewards. I am deeply grateful to have arrived to this point on my own terms and now to be able to reap the benefits of my career with my family and friends. Thank you, from the bottom of my heart, to all who have had a place in my journey.\"Brogdon signed a one-year deal with the Knicks last month. He appeared in line to be a part of the team's backcourt depth plans behind Jalen Brunson and Josh Hart and had played in all four of the team's preseason games. New York also has Miles McBride and Jordan Clarkson, among others, though Brogdon's ability to play both guard spots could have proven helpful.The Knicks, in their first season under coach Mike Brown, are +410 to win the Eastern Conference (via FanDuel), with only the Cleveland Cavaliers (+200) having shorter odds.\nThe Milwaukee Bucks selected Brogdon 36th overall in the 2016 NBA Draft out of Virginia, and he won Rookie of the Year thanks to a stellar debut. After three seasons in Milwaukee, he was traded to the Indiana Pacers for several picks. Following three years in Indiana -- including the 2020-21 season in which he averaged a career-high 21.2 points per game -- he was traded to the Boston Celtics.In Boston, he became a full-time bench player for the first time in his career, and it worked out very well, as he won Sixth Man of the Year in 2023. He is one of just two players in NBA history to win both Rookie of the Year and Sixth Man of the Year.Brogdon then headed to the Portland Trail Blazers in the deal that netted the Celtics Jrue Holiday before being traded to the Washington Wizards as part of the Deni Avdija deal after just one year in the Pacific Northwest.\nInjuries hampered Brogdon throughout his career and he appeared in just 63 games over the past two seasons, but he was productive when he was able to play. He averaged double-digit points in all nine of his NBA seasons and finishes his career with career averages of 15.3 points, 4.7 assists and 4.1 rebounds per game as well as a 38.8% mark from 3-point range.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Rookie of the Year, Sixth Man Malcolm Brogdon announces retirement one week before Knicks season opener - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/f30ca9fc-5465-4f00-9f43-778e13e7f9bd/thumbnail/1200x675/5e394dd731c84abc7198ed3119f94aea/malcolm-brogdon-knicks.jpg"
      ],
      "datePublished": "2025-10-15T20:22:38.000Z",
      "dateModified": "2025-10-15T20:22:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Player prop picks for Steelers vs. Bengals on 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-bengals-nfl-player-props-thursday-night-football-jamarr-chase/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/74071c63-80b8-46e6-bff5-1edc71b488b7/thumbnail/1200x675/2bc702cfb609b83f318ad1213a587d71/jamarr-chase-cincinnati-bengals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T23:44:58.000Z",
    "description": "\n        Aaron Rodgers will get his induction into the Steelers vs. Bengals rivalry on 'Thursday Night Football' to kick off NFL Week 7. Several NFL p",
    "body": "\n        Aaron Rodgers will get his induction into the Steelers vs. Bengals rivalry on 'Thursday Night Football' to kick off NFL Week 7. Several NFL prop picks will center on Rodgers, Jaylen Warren, DK Metcalf and other Steelers considering Cincy's poor defense, but Pittsburgh hasn't been a Steel Curtain on that side of the ball either. It ranks 27th in passing defense, so Joe Flacco, Ja'Marr Chase and Tee Higgins will also be popular with NFL player props and Thursday Night Football betting.Rodgers has an NFL prop bar of 216.5 passing yards, after he threw for 235 yards in Week 6 and hit the Over. However, he went under this NFL prop total in three straight games prior to Sunday, and with Cincy possessing the No. 28 run defense, Pittsburgh may lean more on the ground game. With the same prop odds of -114 for the Over and Under, this may be one TNF prop to simply avoid altogether. Before betting any Bengals vs. Steelers props for Thursday Night Football, you need to see the Steelers vs. Bengals prop predictions powered by SportsLine's Machine Learning AI.You can make NFL prop picks at DraftKings, where you can get $300 in bonus bets if your initial $5 wager wins + 3 months of NBA League Pass. Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Bengals vs. Steelers NFL betting on Thursday Night Football, the Machine Learning Model  has evaluated the NFL player prop odds and provided Steelers vs. Bengals prop picks. You can only see the Machine Learning Model player prop predictions for Cincinnati vs. Pittsburgh here.Top NFL player prop bets for Bengals vs. SteelersAfter analyzing the Steelers vs. Bengals props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Bengals WR Chase goes Over 69.5 receiving yards (-114 at FanDuel). The Steelers have always struggled to contain Chase, who has at least 81 receiving yards in four straight versus Pittsburgh. He's averaged 98 receiving yards over this stretch, and many of those defenses were much better than this year's unit in Pittsburgh. The Steelers are giving up 178.8 receiving yards to opposing wideouts, which is the third-most in the NFL.Chase is also coming off 94-plus receiving yards in each of the last two weeks, and he showed great rapport with Flacco on Sunday, posting a stat line of 10-94-1. It's also important to note that Thursday's game will take place in Cincinnati, where Chase has gone over his receiving yardage prop in each of his last five home games, which includes a Week 13 contest versus the Steelers last season. The AI model projects Chase to have 86.8 receiving yards, giving this NFL prop bet a 4.5-star rating. See more NFL props here.New users can also target the FanDuel promo code, which offers new users $300 in bonus bets if their first $5 bet wins:How to make NFL player prop bets for Bengals vs. SteelersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has six additional NFL props that are rated four stars or better. You need to see the Machine Learning Model analysis before making any Steelers vs. Bengals prop bets for Thursday Night Football.Which Bengals vs. Steelers prop bets should you target for Thursday Night Football? Visit SportsLine now to see the top Steelers vs. Bengals props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Player prop picks for Steelers vs. Bengals on 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/74071c63-80b8-46e6-bff5-1edc71b488b7/thumbnail/1200x675/2bc702cfb609b83f318ad1213a587d71/jamarr-chase-cincinnati-bengals-imagn-images.jpg"
      ],
      "datePublished": "2025-10-15T23:44:58.000Z",
      "dateModified": "2025-10-15T23:44:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/c86c3b3d-53b1-4ffd-bfb8-b58b0218887e/thumbnail/1200x675/2ab193cebefa6f0053d9da8c835400d5/mlb-bracket-lcs.jpg",
    "tag": "Sports",
    "date": "2025-10-16T03:39:54.000Z",
    "description": "\n        The Los Angeles Dodgers and Seattle Mariners are both two wins away from reaching the 2025 World Series. Both teams pulled off two consecutiv",
    "body": "\n        The Los Angeles Dodgers and Seattle Mariners are both two wins away from reaching the 2025 World Series. Both teams pulled off two consecutive road wins to open the LCS round of the 2025 MLB playoffs.In the ALCS, the Toronto Blue Jays hitters finally showed some life as the offense powered the team to a 13-4 blowout Game 3 win Wednesday night as the series moved to Seattle. They'll look to continue that momentum into Game 4.The Dodgers are up 2-0 against the Milwaukee Brewers after Yoshinobu Yamamoto threw a complete game gem in Tuesday's Game 2 win. The Dodgers, now 7-1 in the playoffs, allowed just two runs to the Brewers in the first two games of the NLCS.The Mariners punched their ticket to their first ALCS since 2001 last week by eliminating the Tigers in 15 innings in a winner-take-all ALDS Game 5. The Blue Jays knocked out the Yankees in the ALDS. The Dodgers, meanwhile, took out the Phillies in four games in the NLDS, and the Brewers got past the Cubs in five games.\nThe LCS round could wrap up as early as this weekend, and the 2025 World Series begins on Oct. 24. Below is a look at the full 2025 MLB playoff bracket.   2025 MLB playoff bracket   \n                                                                    Keytron Jordan, CBS Sports\n                                                               2025 MLB playoff schedule, TV channel   All games on ESPN, ABC, Fox and FS1 are streaming on fubo (Try for free). All times Eastern.   * = if needed      Championship Series   Sunday, Oct. 12   ALCS Game 1: Mariners 3, Blue Jays 1 Monday, Oct. 13   ALCS Game 2: Mariners 10, Blue Jays 3   NLCS Game 1: Dodgers 2, Brewers 1 \nTuesday, Oct. 14   NLCS Game 2: Dodgers 5, Brewers 1 (Los Angeles leads 2-0)Wednesday, Oct. 15   ALCS Game 3: Blue Jays 13, Mariners 4 (Seattle leads series 2-1)Thursday, Oct. 16   NLCS Game 3: Dodgers vs. Brewers, 6:08 p.m. | TBS   ALCS Game 4: Mariners vs. Blue Jays, 8:33 p.m. | FS1/fuboFriday, Oct. 17   ALCS Game 5: Mariners vs. Blue Jays, 6:08 p.m. | FS1/fuboNLCS Game 4: Dodgers vs. Brewers, 8:38 p.m. | TBS\nSaturday, Oct. 18   NLCS Game 5*: Dodgers vs. Brewers, 8:08 p.m. | TBSSunday, Oct. 19   ALCS Game 6*: Blue Jays vs. Mariners, 8:03 p.m. | FS1/fuboMonday, Oct. 20   NLCS Game 6*: Brewers vs. Dodgers, 5:08 p.m. | TBS   ALCS Game 7*: Blue Jays vs. Mariners, 8:08 p.m. | Fox/fuboTuesday, Oct. 21   NLCS Game 7*: Brewers vs. Dodgers, 8:08 p.m. | TBS   World Series      Friday, Oct. 24   World Series Game 1   Saturday, Oct. 25   World Series Game 2   Monday, Oct. 27   World Series Game 3   Tuesday, Oct. 28   World Series Game 4   Wednesday, Oct. 29   World Series Game 5*   Friday, Oct. 31   World Series Game 6*   Saturday, Nov. 1   World Series Game 7*      Division Series results      Saturday, Oct. 4   NLDS Game 1: Brewers 9, Cubs 3    ALDS Game 1: Blue Jays 10, Yankees 1    NLDS Game 1: Dodgers 5, Phillies 3    ALDS Game 1: Tigers 3, Mariners 2 (11)    Sunday, Oct. 5   ALDS Game 2: Blue Jays 13, Yankees 7    ALDS Game 2: Mariners 3, Tigers 2    \nMonday, Oct. 6   NLDS Game 2: Dodgers 4, Phillies 3    NLDS Game 2: Brewers 7, Cubs 3    Tuesday, Oct. 7   ALDS Game 3: Mariners 8, Tigers 4    ALDS Game 3: Yankees 9, Blue Jays 6   Wednesday, Oct. 8   ALDS Game 4: Tigers 9, Mariners 3   NLDS Game 3: Cubs 4, Brewers 3    ALDS Game 4: Blue Jays 5, Yankees 2 (Toronto wins series 3-1)   NLDS Game 3: Phillies 8, Dodgers 2   \nThursday, Oct. 9   NLDS Game 4: Dodgers 2, Phillies 1 (11) (Los Angeles wins series 3-1)    NLDS Game 4: Cubs 6, Brewers 0 (Series tied 2-2)   Friday, Oct. 10   ALDS Game 5: Mariners 3, Tigers 2 (15) (Seattle wins series 3-2)   Saturday, Oct. 11   NLDS Game 5: Brewers 3, Cubs 1 (Milwaukee wins series, 3-2)   \n   Wild Card Series scores   Tuesday, Sept. 30   AL Wild Card Series Game 1: Tigers 2, Guardians 1   NL Wild Card Series Game 1: Cubs 3, Padres 1    AL Wild Card Series Game 1: Red Sox 3, Yankees 1    NL Wild Card Series Game 1: Dodgers 10, Reds 5   Wednesday, Oct. 1   AL Wild Card Series Game 2: Guardians 6, Tigers   NL Wild Card Series Game 2: Padres 3, Cubs 0   AL Wild Card Series Game 2: Yankees 4, Red Sox 3   NL Wild Card Series Game 2: Dodgers 8, Reds 4 (Los Angeles wins 2-0)   Thursday, Oct. 2   AL Wild Card Series Game 3: Tigers 6, Guardians 3 (Detroit wins 2-1)   NL Wild Card Series Game 3: Cubs 3, Padres 1 (Chicago wins 2-1)   AL Wild Card Series Game 3: Yankees 4, Red Sox 0 (New York wins 2-1)   \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/c86c3b3d-53b1-4ffd-bfb8-b58b0218887e/thumbnail/1200x675/2ab193cebefa6f0053d9da8c835400d5/mlb-bracket-lcs.jpg"
      ],
      "datePublished": "2025-10-16T03:39:54.000Z",
      "dateModified": "2025-10-16T03:39:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thursday Night Football predictions, odds, line: Steelers vs. Bengals picks from expert on 36-18 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-spread-line-steelers-bengals-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-16T06:05:01.000Z",
    "description": "\n        Teams trending in opposite directions clash when the Pittsburgh Steelers take on the Cincinnati Bengals in a key AFC North matchup on 'Thursd",
    "body": "\n        Teams trending in opposite directions clash when the Pittsburgh Steelers take on the Cincinnati Bengals in a key AFC North matchup on 'Thursday Night Football.' Pittsburgh is coming off a 23-9 win over the Cleveland Browns on Sunday, while Cincinnati dropped a 27-18 decision at Green Bay. The Steelers (4-1), who have won three in a row, are 2-0 on the road this season. The Bengals (2-4), second in the division, have lost four consecutive games since losing quarterback Joe Burrow (toe) to injury.Kickoff from Paycor Stadium in Cincinnati is set for 8:15 p.m. ET. Pittsburgh leads the all-time series 71-40, including wins in four of the past six games. The Steelers are 5.5-point favorites in the latest Steelers vs. Bengals odds, while the over/under for total points scored is 44.5. Before you make any Steelers vs. Bengals picks, make sure to check out the Thursday Night Football predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks and has gone 718-623-37 on his ATS picks from 2017-24, which returned more than $3,200 to $100 players. White also has a strong read on the Steelers. He is an outstanding 36-18-1 (+1585) on his last 55 picks in games involving the Pittsburgh Steelers. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Steelers vs. Bengals and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Steelers vs. Bengals:Steelers vs. Bengals         spreadPittsburgh -5.5 at DraftKings SportsbookSteelers vs. Bengals             over/under44.5 pointsSteelers vs. Bengals             money line Pittsburgh -254, Cincinnati +206Steelers vs. Bengals         picksSee picks at SportsLineSteelers vs. Bengals             streaming Fubo (Try for free)Why the Steelers can winQuarterback Aaron Rodgers helps lead the Pittsburgh offense. In five games, he has completed 95 of 138 passes (68.8%) for 1,021 yards and 10 touchdowns with three interceptions and a 105.4 rating. In Sunday's win over the Browns, he completed 21 of 30 passes (70%) for 235 yards and two touchdowns. In a 34-32 win against the New York Jets on Sept. 7, he completed 22 of 30 passes (73.3%) for 244 yards and four touchdowns.His top target has been seventh-year veteran DK Metcalf. The 2019 second-round draft pick of the Seattle Seahawks leads the Steelers in receiving with 19 receptions for 356 yards (18.7 average) and four touchdowns. He has seven explosive plays of 20 yards or more, including a long of 80. He also has 223 yards after the catch and 16 first-down conversions. He has a touchdown reception in each of the last four games. See which team to back at SportsLine. Why the Bengals can winVeteran quarterback Joe Flacco, who is in his 18th year in the NFL, has taken over for the Bengals after being acquired last week from the rival Cleveland Browns. In the loss to the Packers on Sunday, he completed 29 of 45 passes (64.4%) for 219 yards and two touchdowns. In five games this season, he has completed 122 of 205 passes (59.5%) for 1,034 yards and four touchdowns and six interceptions. For his career, he has thrown for 46,731 yards and 261 touchdowns with 168 interceptions.Flacco's top weapon on offense is wide receiver Ja'Marr Chase. In six games played, he has 42 receptions for 468 yards (11.1 average) and four touchdowns. He has five explosive plays of 20 or more yards, including a long of 64, with 190 yards after the catch and 21 first-down conversions. Against the Packers on Sunday, he caught 10 passes for 94 yards and one touchdown. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Steelers vs. Bengals  picksWhite has analyzed Steelers vs. Bengals from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Steelers vs. Bengals, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Steelers vs. Bengals spread you need to jump on, all from the expert that is 36-18-1 on his last 55 Pittsburgh Steelers picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thursday Night Football predictions, odds, line: Steelers vs. Bengals picks from expert on 36-18 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/4032148e-8531-4176-ba1a-a19d2add41fa/thumbnail/1200x675/01a756ca54ab3b7e30c0e5e7ba23cfb8/d-k-metcalf-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2025-10-16T06:05:01.000Z",
      "dateModified": "2025-10-16T06:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Breece Hall landing spots: Where talented Jets RB could be dealt before NFL trade deadline - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/breece-hall-landing-spots-where-talented-jets-rb-could-be-dealt-before-nfl-trade-deadline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/03/8ce2607b-8c04-437a-b735-04e1d73ef3ea/thumbnail/1200x675/63063490e2f4cc1d4152c345a551a13e/breece-hall-jets-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-15T20:04:52.000Z",
    "description": "\n        The New York Jets are in free fall, off to an 0-6 under first-year coach Aaron Glenn.New York's 2025 0-6 start is just the third such winless",
    "body": "\n        The New York Jets are in free fall, off to an 0-6 under first-year coach Aaron Glenn.New York's 2025 0-6 start is just the third such winless beginning to a season in team history along with the 1996 season (0-7) and the 2020 season (0-13). The Jets will certainly be in the midst of a rebuild next offseason or two, which puts the future of talented, 24-year-old running back Breece Hall up in the air. The 2022 second-round pick is set to become a free agent next offseason, and the team drafted promising Wisconsin running back Braelon Allen in the fourth round of the 2024 NFL Draft a year ago. New York is projected to have the seventh-most effective cap space ($58.2 million) in the NFL next offseason, according to OverTheCap.com, but there's a decent chance the franchise won't prioritize that money on a running back next year with plenty of other holes to address. That's why it would make sense for the Jets to at least shop Hall around to see what they could get for the talented, well-rounded back. Which teams would make the most sense for Hall? Here is a look at five possible landing spots for the young running back ahead of the NFL's Nov. 4 trade deadline.\n\n        \n            \n                Alvin Kamara to Chiefs? New WR for Giants' Jaxson Dart? 10 NFL trades that should happen before 2025 deadline\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    Kansas City ChiefsThe Chiefs could use more juice on offense, including an upgrade at running back since quarterback Patrick Mahomes is currently Kansas City's leading rusher with 222 yards this season. Isiah Pacheco has rushed for under 55 yards in every game this season, and he's gone 12 consecutive games without a rushing touchdown. He's second on the team in rushing with 214 yards this season. New York would certainly be happy to absorb as many draft picks as it can get amid a rebuild, and the Chiefs are obviously in win-now mode. Following an encouraging 30-17 victory over the Detroit Lions on \"Sunday Night Football\" in Week 6, this is a deal that Kansas City should look to make.\n                            \n    \n                                                \n                    \n    Los Angeles ChargersThe Chargers offense is as beaten down with injuries as it gets with offensive tackle Rashawn Slater (torn patellar tendon, out for the season), offensive tackle Joe Alt (ankle), running back Omarion Hampton (ankle, on injured reserve) and wide receiver Derius Davis (knee) all wounded. Quarterback Justin Herbert could use some assistance, especially a reliable checkdown release valve out of the backfield given his ragged offensive line.\nHall could aid Herbert and the Chargers both in the ground game and through the air. Hall's 150 catches and 1,224 yards receiving since 2023 are both the second most in the entire NFL among running backs in that span while his seven receiving touchdowns in that time are tied for the fifth most at the position with Saquon Barkley. Los Angeles needs to inquire about Hall, especially since Hampton is on a rookie deal. Plus, he could be a nice mentor for their first-round rookie back.\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersThe Pittsburgh Steelers are all in on the 2025 season after signing 41-year-old quarterback Aaron Rodgers, signing 34-year-old cornerback Darius Slay, trading for soon-to-be 31-year-old cornerback Jalen Ramsey and trading for 30-year-old tight end Jonnu Smith. This is a team in win-now mode, and that approach is working for Pittsburgh thus far with the Steelers out to a 4-1 start and in first place in the AFC North. \nHowever, the Steelers currently have the fourth-worst run game in football, averaging just 84.0 yards rushing per game through six weeks. That's surprising considering Pittsburgh offensive coordinator Arthur Smith can typically scheme up a capable run game no matter who is in the backfield. Perhaps he and the Steelers are missing the between-the-tackles consistency Najee Harris provided them the prior four seasons when he went for over 1,000 yards each year from 2021 to 2024. Hall could complement the speedier Jaylen Warren to beef up the Pittsburgh rushing attack. Plus, the Steelers also have an extra third-round pick for 2026 thanks to trading wide receiver George Pickens to the Dallas Cowboys in the offseason. Not necessarily saying a third-round pick is the right price for a rental running back, but the Jets would likely be interested in that offer.\n                            \n    \n                                                \n                    \n    Arizona CardinalsThe Arizona Cardinals are off to a tough 2-4 start to the 2025 season, but their record is somewhat deceiving. All six of their games have been decided by seven points or fewer this season: they won their first two and are currently on a four-game losing streak. Pro Bowl starting running back James Conner suffered a season-ending ankle injury and 2024 third-round pick Trey Benson is now on injured reserve with a knee injury. \nThe Cardinals don't have much time to right the ship. If they want to get their run game back on track and potentially give Hall an extended tryout to be a part of their future plans, the trade makes sense given he is only 24 years old. \n                            \n    \n                                                \n                    \n    Houston TexansThe Houston Texans are 2-3 this season, but it's not their defense's fault. Coach DeMeco Ryans' unit is the NFL's No. 1 scoring defense, allowing just 12.2 points per game. That's the fewest points per game allowed by a team with a losing record through five games in the Super Bowl era (since 1966), per CBS Sports Research. On the other hand, Houston's offense is averaging just 21.6 points per game, 22nd in the league this season. They've been league average on the ground, averaging 116.2 rushing yards per game this year. Their offense sorely lacks juice with just 31 explosive plays this season, tied for the fifth-fewest in the NFL, per TruMedia. The Texans' nine explosive runs are tied for the seventh-fewest in the league in 2025. Quarterback C.J. Stroud is still on his rookie deal, and with Joe Mixon out and Nick Chubb not looking the same after multiple, serious knee injuries throughout his career, Houston should pursue Hall in an attempt to salvage its season. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Breece Hall landing spots: Where talented Jets RB could be dealt before NFL trade deadline - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/03/8ce2607b-8c04-437a-b735-04e1d73ef3ea/thumbnail/1200x675/63063490e2f4cc1d4152c345a551a13e/breece-hall-jets-cbs.jpg"
      ],
      "datePublished": "2025-10-15T20:04:52.000Z",
      "dateModified": "2025-10-15T20:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's starting XI and depth chart if the 2026 FIFA World Cup started today: Cristian Roldan making his case - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/usmnts-starting-xi-and-depth-chart-if-the-2026-fifa-world-cup-started-today-cristian-roldan-making-his-case/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/03e4353b-6d43-4bd1-b93e-305ad4ca9309/thumbnail/1200x675/6e51ff2ae3e1f07ca4aac7bf2e110eaf/roldan.jpg",
    "tag": "Sports",
    "date": "2025-10-16T00:48:08.000Z",
    "description": "\n        The October international break has come to a close for the United States men's national team on a positive note, defeating Australia 2-1. Sl",
    "body": "\n        The October international break has come to a close for the United States men's national team on a positive note, defeating Australia 2-1. Slowly, Mauricio Pochettino is restoring faith that this team can topple top opposition around the world as they're now on a three-match unbeaten run, and we're learning more about his roster by the day. The shift to a back three has been a positive one, and while questions may still remain around the team, panic is beginning to lessen.But with the World Cup drawing closer, it brings up an important question -- if the tournament started today, what would the starting XI look like? I took a stab at answering that, and here's how things shook out.2026 roster projection Goalkeepers (3): Matt Freese (New York City FC), Matt Turner (New England Revolution), Patrick Schulte (Columbus Crew)Defenders (8): Sergino Dest (PSV), Antonee Robinson (Fulham), Miles Robinson (FC Cincinnati), Chris Richards (Crystal Palace), Tim Ream (Fulham), Alex Freeman (Orlando City SC), Max Arfsten (Columbus Crew), Mark McKenzie (Toulouse)\nMidfielders (7): Weston McKennie (Juventus), Tyler Adams (Bournemouth), Diego Luna (Real Salt Lake), Luca De La Torre (San Diego FC), Cristian Roldan (Seattle Sounders), Malik Tillman (Bayer Leverkusen), Tanner Tessemann (Lyon)Forwards (6): Christian Pulisic (Milan), Folarin Balogun (Monaco), Ricardo Pepi (PSV), Tim Weah (Marseille), Patrick Agyemang (Derby County), Haji Wright (Coventry City), Alex Zendejas (Club America)GoalkeeperStarter: Matt FreeseBackups: Matt Turner, Patrick Schulte The year of Matt Freese continues with the keeper now starting 11 consecutive games for the USMNT between the Gold Cup and friendlies. Showing what he can do in penalty shootouts, even the return of Matt Turner wasn't enough to see Freese miss out on minutes between the sticks. Pochettino hasn't outright awarded the New York City FC man the starting job, but unless there's an injury or a major dip in performance, keeper is one of the few set positions for the USMNT as the World Cup approaches.\nRight wing backStarter: Sergino DestBackups: Alex Freeman, Tim WeahAnd just like that, we get to chaos. Tim Weah could easily continue in a fake wing back role where he helps overwhelm opposing attackers, especially since Sergino Dest hasn't been healthy enough to play a full 90 minutes for the USMNT this year. Dest's verisitlity could also work against him as he's one of the primary backups for Antonee Robinosn on the right, so if Pochettino needs to cut a wing back, it could make sense to have Dest as the primary backup on both sides. Alex Freeman has been one of the biggest risers in the entire squad during this year, and I'd find it tough to cut him from any potential World Cup squad.Center backStarters: Chris Richards, Tim Ream, Miles RobinsonBackups: Mark McKenzieThis is probably too light in central defense, but coming by defenders who have impressed enough to get the call to the World Cup has been tough. One of Tristan Blackmon or Cameron Carter-Vickers will likely be needed if the back three is hear to stay, but the starting trio feels locked in at this stage. Miles Robinson has been a strong performer under Pochettino, and alongside Richards, his anticipation helps make up for Tim Ream's lack of pace. While it'd be great to find a contingency plan for Ream if anything were to happen, that is something that could be easier said than done for this squad, so I wouldn't hold my breath there.Left wing backStarter: Antonee RobinsonBackup: Max Arfsten, Sergino DestAnother position where it's clear who the starter is, Antonee Robinson is one of the first names on the entire USMNT team sheet. Max Arfsten has had great showings as a wing back due to what he can bring going forward, but Robinson's consistency is what could cause issues in relation to the Columbus Crew man sticking on the roster. With Dest being able to back up both positions and the need for another center back, this is where Pochettino will have some decisions to make.\nCentral midfieldStarters: Tyler Adams, Weston McKennie Backups: Tanner Tessmann, Cristian Roldan, Luca De La Torre The defensive mistakes during the October international window, which Tyler Adams missed due to the birth of his child, showed yet again that no one can replace what he brings to the midfield. Adams captained the USMNT at the 2022 World Cup and is still one of the leaders on the pitch when healthy. Now, next to him is where things get interesting. Weston McKennie made his return to camp and would still seem to be the favorite to start, but with Cristian Roldan putting in good shifts and assisting Haji Wright twice, things could get interesting. There is a world where Roldan is the starting USMNT midfielder in a double pivot when the World Cup kicks off, especially as Pochettino called him a \"perfect player\" following the victory over Australia. Tanner Tessmann is trending in the right direction, but if only two deeper midfielders are starting, it will be tough to break into the starting XI.Attacking midfieldStarter: Malik TillmanBackups: Diego LunaWithout Gio Reyna in the squad, Malik Tillman becomes the x-factor for the USMNT. Able to play centrally and float out onto the wing, he brings versatility to how the attack can set up. Growing into his role at a bigger club at Bayer Leverkusen, Tillman is also developing more confidence as a player, which will help lead the USMNT attack when the lights are at their brightest. If a change of pace is needed, Diego Luna isn't afraid to take anyone on and will be ready for the moment. This is one of the few positions that doesn't change much in a back three or a back four.\nForwardsStarters: Folarin Balogun, Christian PulisicBackups: Tim Weah, Haji Wright, Ricardo Pepi, Patrick Agyemang, Alex ZendejasSitting Weah here is hard, as even when he's not at his best, the USMNT are better with him on the pitch. Weah very well may be played in defense, but he'll still be expected to contribute to the attack. Folarin Balogun has come into his own and brings a different class to the nine for the USMNT, raising the bar of what they can accomplish as a squad when he's on the pitch. It's similar to what Christian Pulisic brings which is why along with Robinson, they're locked in no matter what. Haji Wright has shown what he can bring coming off the bench or starting, and who knows, after being the last player to score a World Cup goal for the USMNT, he just may be the first player to score a goal in 2026 on home soil for the USMNT. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's starting XI and depth chart if the 2026 FIFA World Cup started today: Cristian Roldan making his case - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/03e4353b-6d43-4bd1-b93e-305ad4ca9309/thumbnail/1200x675/6e51ff2ae3e1f07ca4aac7bf2e110eaf/roldan.jpg"
      ],
      "datePublished": "2025-10-16T00:48:08.000Z",
      "dateModified": "2025-10-16T00:48:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]