[
  {
    "title": "Cavaliers vs. Timberwolves prediction, odds, time: 2026 NBA picks for Saturday, Jan. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/cavaliers-timberwolves-odds-prediction-time-2026-nba-picks-saturday-january-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-10T02:11:47.000Z",
    "description": "\n        The Saturday NBA schedule tips early with a cross-conference matinee matchup as the Minnesota Timberwolves travel to take on the Cleveland Ca",
    "body": "\n        The Saturday NBA schedule tips early with a cross-conference matinee matchup as the Minnesota Timberwolves travel to take on the Cleveland Cavaliers. Minnesota rides a four-game win streak into this matchup and is 25-13 on the season, while Cleveland is 21-18. Anthony Edwards (foot) and Julius Randle (thumb) are both questionable for Minnesota. Mike Conley (rest) is out. These teams met on Thursday, and it was Minnesota that came out on top, 131-122.Tipoff from the Rocket Center in Cleveland is set for 1 p.m. ET. Cleveland is a 3.5-point home favorite in the latest Cavaliers vs. Timberwolves odds, while the over/under is 239.5. Before making any Timberwolves vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    \nNow, the model has simulated Cavaliers vs. Timberwolves 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Timberwolves vs. Cavs:Cavaliers vs. Timberwolves spread:    Cavaliers -3.5  Cavaliers vs. Timberwolves over/under:    239.5 pointsCavaliers vs. Timberwolves money line:    Cavaliers -158, Timberwolves +134Cavaliers vs. Timberwolves picks:    See picks at SportsLineCavaliers vs. Timberwolves streaming:Fubo (Try for free) New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Cavaliers vs. Timberwolves picksAfter 10,000 simulations, SportsLine's model is going Over on the total (239.5 points). The Thursday matchup between these teams went Over the total, which was also 239.5 that evening. The teams combined to score 253 points in that game, clearing the total with plenty of room to spare.This time around, SportsLine's model is projecting 241 combined points as the Over clears in more than 50% of simulations. It has also generated an against-the-spread pick that hits in nearly 60% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Timberwolves vs. Cavs, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. Timberwolves prediction, odds, time: 2026 NBA picks for Saturday, Jan. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-10T02:11:47.000Z",
      "dateModified": "2026-01-10T02:11:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Wild Card Weekend picks, AI-generated exact score predictions, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-wild-card-weekend-2026-playoff-picks-ai-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/72d869f5-a938-4132-8b32-ead14c317864/thumbnail/1200x675/756ea6d0f61778e836b29d43e8c88035/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T22:36:38.000Z",
    "description": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston T",
    "body": "\nThe 2026 NFL Wild Card Weekend schedule features two games on Saturday, three on Sunday and one 'Monday Night Football' matchup between the Houston Texans and Pittsburgh Steelers. Monday's matchup will pit quarterback C.J. Stroud and the Houston Texans against 21-year veteran Aaron Rodgers and the Pittsburgh Steelers. The Texans are favored by 3 points at DraftKings Sportsbook, with the over/under at 38.5, as the two teams will meet in the postseason for the first time ever.Sunday's other largest spreads include Rams (-10.5) vs. Panthers, 49ers vs. Eagles (-6) and Chargers vs. Patriots (-3.5). The smallest spreads in Wild Card Weekend include Packers (-1.5) vs. Bears and Bills (+1.5) vs. Jaguars. Before making any 2026 Wild Card Weekend NFL picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Wild Card Weekend NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all six games. You can only see the AI predictions for the 2026 Wild Card Weekend NFL schedule here.Top 2026 Wild Card Weekend NFL AI picksAfter analyzing every game in Wild Card Weekend, the AI says the Steelers (+3, 38.5), who outlasted Baltimore in Week 18 to win the AFC North, cover in a tight loss. \nThe Texans have gone over in three of their last four games, while the over has hit in four of the last five Steelers games. Pittsburgh has won four of the last six meetings with Houston and is expected to cover in a close game. The Steelers, who will get receiver DK Metcalf back from suspension, are looking to win their first playoff game since reaching the AFC Championship Game in 2016. Houston won the last meeting, 30-6, on Oct. 1, 2023. SportsLine AI rates the Steelers as a B money line pick and also predicts a 22-21 Texans win on average. See its other 2026 Wild Card Weekend football predictions and football picks at SportsLine, and bet the Steelers at DraftKings here:\nHow to make 2026 Wild Card Weekend NFL picksIn addition, the AI PickBot has generated three highly-coveted A picks for 2026 Wild Card Weekend. You need to see the AI's NFL picks before making any 2026 Wild Card Weekend NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 Wild Card Weekend NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Wild Card Weekend picks, AI-generated exact score predictions, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/72d869f5-a938-4132-8b32-ead14c317864/thumbnail/1200x675/756ea6d0f61778e836b29d43e8c88035/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T22:36:38.000Z",
      "dateModified": "2026-01-09T22:36:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 College Football Playoff semifinal odds, best bets: Indiana vs. Oregon picks from expert on 6-1 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-playoff-odds-start-time-peach-bowl-prediction-indiana-oregon-expert-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/06/b4040854-2fa9-45ce-ba0b-576cd5a2d5d9/thumbnail/1200x675/935b944abc9ddb3d257e0d2d1a4fb2f3/fernando-mendoza-indiana-hoosiers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T22:52:52.000Z",
    "description": "\n        The 2026 College Football Playoff semifinals conclude on Friday when the top-seeded Indiana Hoosiers take on the fifth-seeded Oregon Ducks. I",
    "body": "\n        The 2026 College Football Playoff semifinals conclude on Friday when the top-seeded Indiana Hoosiers take on the fifth-seeded Oregon Ducks. It's a rematch of the Oct. 11 meeting that Indiana won 30-20 at Oregon despite being a 7-point underdog entering that game. The Ducks beat James Madison and Texas Tech to advance to the CFP semifinals. Indiana had a bye and then stomped Alabama 38-3 in the quarterfinals. The winner of this matchup advances to face Miami in the national title game on January 19. Oregon running back Jordon Davison has been ruled out, while running back Noah Whittington is listed as questionable. Kickoff is at 7:30 p.m. ET from Mercedes-Benz Stadium in Atlanta. The Hoosiers are 3-point favorites in the latest Oregon vs. Indiana odds from SportsLine consensus, while the over/under for total points scored is 49.5. Before making any Indiana vs. Oregon picks, make sure to see the College Football Playoff semifinal predictions from SportsLine's Micah Roberts. New users can target the DraftKings promo code, which offers $300 in bonus bets if your initial bet wins:Roberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. He's been especially dialed in on Curt Cignetti and Indiana, going 6-1 on his past seven picks involving the Hoosiers. Anyone following could have seen huge returns.Now, Roberts has set his sights on Indiana vs. Oregon and just locked in his picks and CFP semifinal predictions. You can head to SportsLine now to see Roberts' picks. Here are the FBS college football odds and trends for Oregon vs. Indiana:\nIndiana vs. Oregon spreadIndiana -3Indiana vs. Oregon over/under49.5 pointsIndiana vs. Oregon money line Indiana -171, Oregon +143Indiana vs. Oregon picksSee picks at SportsLineIndiana vs. Oregon streaming Fubo (Try for free)  \nWhy Indiana can coverThe Hoosiers are emerging as the top program in college football at the moment, and their 38-3 rout of Alabama -- arguably college football's greatest power in the playoff era -- proved just how dominant Indiana has become under Cignetti. Indiana also knocked off Ohio State in the Big Ten Championship Game despite entering that matchup as a 3.5-point underdog. Both sides of the ball are performing at a high level, but the defense has been particularly dominant in the past two games, holding Alabama and Ohio State to a combined 13 points. Quarterback Fernando Mendoza, the Heisman winner and likely top overall pick in the 2026 NFL Draft, leads a balanced offense that features two 800-yard backs and two 700-yard receivers. The Hoosiers have already knocked off Oregon once by double digits, and that was on the road, so they should be extremely confident entering this one. See which team to back at SportsLine.Why Oregon can cover It's tough to beat a great team twice, and that's what Indiana will be attempting to do. This is the sixth rematch of a regular season game in College Football Playoff history, and four of the previous five have been won by the team that lost in the regular season. If Indiana was the most dominant team in the quarterfinals, the Ducks weren't too far behind. Oregon stifled Texas Tech's offense, forcing four turnovers and giving up just 215 total yards of offense. Offensively, the Ducks can boast many of the same qualities that Indiana can, including a likely first-round pick at quarterback in Dante Moore. Tight end Kenyon Sadiq, another possible first-round pick, leads the Ducks with 46 receptions and eight touchdown catches. See which team to back at SportsLine.How to make Indiana vs. Oregon picksRoberts has analyzied Oregon vs. Indiana and is leaning Over on the total. He's also found a critical x-factor that has him jumping on one side of the spread. You can see what it is at SportsLine.\nWho wins Oregon vs. Indiana, and what critical x-factor makes one side of the spread hit hard? Visit SportsLine now to find out which side of the spread to back, all from the expert who is on a 6-1 roll on Indiana picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football Playoff semifinal odds, best bets: Indiana vs. Oregon picks from expert on 6-1 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/06/b4040854-2fa9-45ce-ba0b-576cd5a2d5d9/thumbnail/1200x675/935b944abc9ddb3d257e0d2d1a4fb2f3/fernando-mendoza-indiana-hoosiers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T22:52:52.000Z",
      "dateModified": "2026-01-09T22:52:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon vs. Indiana prediction, odds, line, start time: 2026 CFP semifinal picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oregon-indiana-prediction-picks-odds-time-line-spread-2026-college-football-playoff-peach-bowl-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/92eb363f-5c80-42b2-ad09-b693499b7bb1/thumbnail/1200x675/1d6b12faab11cae7437c53b073b13dd8/dante-moore-oregon-ducks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T22:32:19.000Z",
    "description": "\n        The 2026 Peach Bowl will see Big Ten teams squaring off on Friday as the No. 1 Indiana Hoosiers face the No. 5 Oregon Ducks. This 2026 Colleg",
    "body": "\n        The 2026 Peach Bowl will see Big Ten teams squaring off on Friday as the No. 1 Indiana Hoosiers face the No. 5 Oregon Ducks. This 2026 College Football Playoff semifinal contest is a rematch of a mid-October game in which the Hoosiers prevailed on the road, 30-20. That remains the only loss for the 13-1 Ducks, who are coming off a dominant 23-0 shutout win over Texas Tech. As for the 14-0 Hoosiers, they are coming off a 38-3 blowout of Alabama and have aspirations of becoming the first 16-0 team in college football history. The winner of this matchup advances to take on Miami in the national title game on Jan. 19Kickoff is at 7:30 p.m. ET from Mercedes-Benz Stadium in Atlanta. The Hoosiers are 3-point favorites in the latest Oregon vs. Indiana odds per SportsLine consensus. The over/under for total points is 49.5, up 3 points from the opening Peach Bowl line. Before making any Indiana vs. Oregon picks, check out the college football predictions from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. \nNow, the model has set its sights on Oregon vs. Indiana. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Indiana vs. Oregon:Oregon vs. Indiana     spreadIndiana -3 at DraftKings SportsbookOregon vs. Indiana      over/under49.5 pointsOregon vs. Indiana      money line Indiana -169, Oregon +141Oregon vs. Indiana       picksSee picks at SportsLineOregon vs. Indiana      streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Oregon can coverWhile Indiana won the regular season matchup, in terms of CFP rematches, the team that lost the first contest is 4-1 ATS in the rematch. The Ducks have also covered at at 75% clip as an underdog since 2023, while IU is just 5-4 ATS over its last nine versus Big Ten teams. On the field, Oregon possesses the better offense both on the ground and through the air. The Ducks average more passing yards than Indiana, with a higher completion percentage, in addition to averaging more rushing yards, as well as more yards per carry. On the other side of the ball, Oregon is coming off a season-high of four takeaways in the win over Texas Tech, and the Ducks had a pick-six of Fernando Mendoza in the first contest. Mendoza has also been under pressure as of late as he's been sacked three-plus times in four of his last five games. See which team to back at SportsLine.Why Indiana can coverNo one can match Indiana's production on both sides of the ball, as it has the No. 2 scoring defense and No. 3 scoring offense, and no other FBS team ranks in the top five of both. The Hoosiers have allowed two touchdowns, total, over their last four games, and they've given up a rushing touchdown in just one of their last nine games. Mendoza leads the nation with both 36 passing touchdowns and with a 184.7 passer rating, and Indiana isn't the type of team that hurts itself. Just one team in all of college football commits fewer penalty yards per game, while just two teams in the country commit fewer turnovers per game. Indiana appears to be the healthier team as well with Oregon running back Jordon Davison among the dozen players ruled out for the Ducks, while running back Noah Whittington is listed as questionable. See which team to back at SportsLine.How to make Indiana vs. Oregon picksSportsLine's model has simulated Oregon vs. Indiana 10,000 times and is going Under on the total, projecting 46 combined points. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.So who wins Indiana vs. Oregon, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Oregon vs. Indiana spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon vs. Indiana prediction, odds, line, start time: 2026 CFP semifinal picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/92eb363f-5c80-42b2-ad09-b693499b7bb1/thumbnail/1200x675/1d6b12faab11cae7437c53b073b13dd8/dante-moore-oregon-ducks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T22:32:19.000Z",
      "dateModified": "2026-01-09T22:32:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WNBA players union blasts league for 'running out the clock' as CBA expires - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/wnba-players-union-cba-negotiations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/10/d6f13029-49c4-4878-b363-4562a1984e65/thumbnail/1200x675/498a78f539ea92310f8b5fa30626f77f/wnba-union.png",
    "tag": "Sports",
    "date": "2026-01-10T04:46:08.000Z",
    "description": "\n        On Friday night, 30 minutes before the deadline for a new collective bargaining agreement between the WNBA and its players union was set to p",
    "body": "\n        On Friday night, 30 minutes before the deadline for a new collective bargaining agreement between the WNBA and its players union was set to pass, the WNBA Players Association released a statement blasting the league for its negotiating tactics and accusing it of trying to run out the clock.\"At midnight, the 2020 WNBA-WNBPA Collective Bargaining Agreement will expire. Despite demonstrating our willingness to compromise in order to get a deal done, the WNBA and its teams have failed to meet us at the table with the same spirit and seriousness. Instead, they have remained committed to undervaluing player contributions, dismissing player concerns, and running out the clock,\" the statement read.The WNBPA still has not received a counter offer to a proposal it sent the WNBA more than two weeks ago, sources familiar with the situation confirmed to CBS Sports.\n        \n            \n                Breanna Stewart says WNBA, WNBPA won't reach a CBA deal by Friday deadline, will enter 'status quo' period\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nThe 2020 WNBA CBA was originally set to expire on Oct. 31, 2025, but the two sides extended the deadline twice -- first to Nov. 30, and later to Jan. 9. This time, an extension is not expected. Without an official extension, the league and players will enter into a \"status quo\" period, meaning that while WNBA and its players will continue to operate under the rules of the 2020 CBA, either side could announce a work stoppage at any time. \nLast month, the players voted to authorize a strike \"if necessary,\" but a lockout is not currently expected and both sides have expressed their desire to continue to negotiate in good faith. Breanna Stewart, the vice president of the WNBPA, told Sarah Spain on the \"Good Game with Sarah Spain\" podcast this week that she's hopeful a deal will be reached by Feb. 1.Still, the WNBPA is trying to turn up the pressure on the league, both privately and publicly. On Friday, Scabby the Rat, the large, inflatable rat used by unions to draw attention to labor fights, was on display outside of the NBA store in New York City.\"Today's display of an inflatable rat, a universal symbol of labor protest, outside of the NBA Store, calls attention to how the league and its teams have handled these negotiations. By delaying and clinging to the status quo, they are jeopardizing the livelihoods of players and the trust and investment of fans, all in the name of preserving regressive provisions that no longer belong in women's basketball,\" the statement read.\n\"Players care deeply about their fans and take pride in honoring that loyalty every time they take the court. The league's tactics harm current and future players and marginalize the very people who show up for the game in communities across the country.\"This misguided approach will not work. In the face of the league and teams' actions, the players remain undeterred, unafraid, and unwavering in their commitment to doing what is necessary to secure a transformational new CBA. This agreement must include a salary system tied to a meaningful share of the revenue that would not exist without player labor, mandate professional working conditions, and require protections that honor the players who built this league and set the next generation up for success.\"The WNBA's most recent proposal would raise the salary cap to $5 million and the max salary above $1 million, a significant increase from the $1.5 million salary cap and $250,000 max salary in 2025. The players' recent proposal has a salary cap of around $10.5 million with a $2.5 million max salary. The biggest chasm between the two parties is the revenue-sharing component. The players are looking for 30% of gross revenue, while the league is offering 70% of net revenue, or the revenue left over after league-specified operating expenses are taken off of the top. \nPlayers believe that they deserve a bigger cut of the revenue their labor has generated, and they are not done fighting for what they feel they are owed. \"Make no mistake. Pay equity is not optional and progress is long overdue. We urge the league and its teams to meet this moment. The players already have and will continue to do so.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WNBA players union blasts league for 'running out the clock' as CBA expires - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/10/d6f13029-49c4-4878-b363-4562a1984e65/thumbnail/1200x675/498a78f539ea92310f8b5fa30626f77f/wnba-union.png"
      ],
      "datePublished": "2026-01-10T04:46:08.000Z",
      "dateModified": "2026-01-10T04:46:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wild Card Weekend NFL odds, lines, spreads, predictions: Playoff picks from 10,000 computer sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-wild-card-weekend-odds-betting-lines-spreads-picks-predictions-playoffs-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/36e6dd49-9057-47dd-a407-abe4e9ea7f0d/thumbnail/1200x675/5d2a876926f7268adf3faa1a9999e870/t-j-watt-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-09T22:47:28.000Z",
    "description": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be high",
    "body": "\nThe 2026 NFL playoffs are set, and teams like the Texans and Jaguars enter in on win streaks of nine and eight games, respectively, and could be highly sought after with NFL picks. Meanwhile, Green Bay is riding a four-game losing streak and is a 1.5-point favorite against the Bears on Saturday night, per the latest Wild Card Weekend NFL odds. Those two split their regular season matchups as they'll tangle in the postseason for just the third time ever. The NFL line for that game matches Bills vs. Jaguars (-1.5) as the slimmest of the Wild Card Weekend NFL spreads, while the largest has the Rams favored by 10.5 points over the Panthers as Los Angeles is getting receiver Davante Adams (hamstring) back.Other spreads include 49ers vs. Eagles (-6), Chargers vs. Patriots (-3.5) and Steelers vs. Texans (-3). The Jaguars opened as underdogs, but have flipped to slight favorites, joining the Eagles and Patriots as the home favorites of the opening round of the 2026 NFL playoffs. All of the updated Wild Card Weekend NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Wild Card Weekend NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Wild Card Weekend NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Wild Card Weekend NFL predictionsOne of the model's strongest Wild Card Weekend NFL picks is the Steelers (+3, 38.5) covering at Houston on Monday night at 8 p.m. ET. These teams have the same 9-8 spread record, but Pittsburgh is 4-1 ATS over its last five, while Houston has failed to cover in two of its last three. While Houston has an elite defense, it allowed its most points (30) all year in Week 18 to a Colts team with a fourth-string rookie quarterback, which is no comparison to an Aaron Rodgers-led unit getting back a rested DK Metcalf. As for C.J. Stroud, he is 0-2 on the road in his playoffs career, failing to account for a touchdown in either loss. The Steelers are forecasted to cover over 50% of the time, with the Over hitting in well over 50% of simulations. See which other teams to pick here, and bet the Steelers using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make Wild Card NFL picksThe model has also made the call on who wins and covers in every other game on the Wild Card Weekend NFL schedule and just revealed three teams projected to outright win over 60% of the time, potentially giving you a huge payday. You can only get every pick for every game at SportsLine, and for a limited time, get your first month at SportsLine for just $1 using promo code CHAMPIONSHIP.So what Wild Card NFL picks can you make with confidence, and which three picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Wild Card Weekend NFL betting odds, lines, live spreads, scoresGet Wild Card NFL picks at SportsLineGameSpreadTotalPicksRams at Panthers (Saturday)LAR -10.545.5SEE  PICKS HEREPackers at Bears (Saturday)GB -1.544.5SEE  PICKS HEREBills at JaguarsJAX -1.551.5SEE  PICKS HERE49ers at EaglesPHI -644.5SEE  PICKS HEREChargers at PatriotsNE -3.545.5SEE  PICKS HERETexans at Steelers (Monday)HOU -338.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild Card Weekend NFL odds, lines, spreads, predictions: Playoff picks from 10,000 computer sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/36e6dd49-9057-47dd-a407-abe4e9ea7f0d/thumbnail/1200x675/5d2a876926f7268adf3faa1a9999e870/t-j-watt-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-09T22:47:28.000Z",
      "dateModified": "2026-01-09T22:47:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana's Fernando Mendoza seeking rare Heisman Trophy, CFP title sweep - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-qb-fernando-mendoza-heisman-winner-cfp-national-champion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/10/e71836fa-0a09-4355-bad3-344354e95310/thumbnail/1200x675/1b0649ef90fbde9c00278ae9f9506e3c/mendoza-cfp-title.jpg",
    "tag": "Sports",
    "date": "2026-01-10T04:53:13.000Z",
    "description": "\n        Indiana quarterback Fernando Mendoza will try to become the fourth Heisman winner win a national championship in College Football Playoff his",
    "body": "\n        Indiana quarterback Fernando Mendoza will try to become the fourth Heisman winner win a national championship in College Football Playoff history -- and just the third to go unbeaten -- after Friday night's 56-22 victory over Oregon in the Peach Bowl semifinals.Top-ranked Indiana will face No 10 Miami on Jan. 19 at Hard Rock Stadium in Miami Gardens, a matchup of two emerging powers battling for college football's ultimate crown.\"With a strong culture, you can accomplish anything,\" Mendoza said on the broadcast after the game. \"We have a strong culture in the locker room, our coaching staff, our administration. We're a bunch of misfits. There are zero five-stars on our team. We're just guys, glued together, trying to reach a common goal -- to win every single game.\"Indiana's latest dismantling of an elite opponent was effectively decided by Mendoza's third touchdown pass of the first half, which opened a 28-point lead at intermission against Oregon. A week after nearly flawless work in the Hoosiers' quarterfinal blowout of Alabama, Mendoza finished 17 of 20 for 177 yards and five touchdowns against the Ducks.\nThrough two playoff wins, Mendoza has thrown more touchdown passes (eight) than incompletions (five). His five-touchdown dissection of Oregon's defense came one week after the Ducks shut out Big 12 champion Texas Tech. It ranks among the most dominant performances by a Heisman Trophy winner in playoff history, rivaling LSU quarterback Joe Burrow's seven-touchdown half against Oklahoma in 2019 and Alabama wide receiver DeVonta Smith's first-half explosion against Ohio State in 2020.Burrow and Smith are the only Heisman winners to lead their programs to perfect seasons in the CFP era. The odds-on favorite to be selected No. 1 overall in April's NFL Draft, Mendoza helped Indiana secure the first No. 1 ranking in program history following its Big Ten Championship win over Ohio State and now stands poised to lead college football's first 16-0 national champion in his final start.Indiana's 56 points against Oregon were the second-most in Peach Bowl history. Only Burrow and LSU scored more, posting 63 against Oklahoma.\nHeisman winners in CFP title gameFernando Mendoza, Indiana QB, 2025 Bryce Young, Alabama QB, 2021 (lost national championship)Devonta Smith, Alabama WR, 2020 (won national championship)Joe Burrow, LSU QB, 2019 (won national championship)Derrick Henry, Alabama RB, 2015 (won national championship)Marcus Mariota, Oregon QB, 2014  (lost national championship)The most notable addition in Indiana's 23-player transfer haul during the 2025 cycle, Mendoza spent two seasons at California before finding his star-potential landing spot with coach Curt Cignetti and the Hoosiers.An Indiana win over Miami -- which is seeking to become the first team to win a national title on its home field since the Hurricanes did it in 1991 -- would complete what could be considered one of the greatest coaching feats in the sport's history. Mendoza's rise has been central to Cignetti's success.\"I was very excited that we got him. When he went into the portal, it didn't take me long — in terms of plays,\" Cignetti said this week in an interview with CBS Sports' Jenny Dell. \"When we got him, he was a little behind in the pocket relative to where I thought he would be in terms of footwork, timing, rhythm and processing. That took a little bit of time. We also had a new quarterbacks coach.\n\"But the development he's made -- I can't say enough great things about him. He competes like a lion. He plays his best when the game is on the line. His legs have been invaluable. He can make all the throws, he's extremely intelligent and I've never seen a guy prepare like him. That's why he's put together the kind of year he's had.\"Up next for the Hoosiers is a matchup with a Hurricanes team that ranked No. 1 in the ACC in both total defense and scoring defense this season. The Hurricanes have been especially stingy in the CFP, holding Texas A&M to three points, limiting Ohio State to 14 and cooling off a red-hot Ole Miss offense in the Fiesta Bowl semifinals.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana's Fernando Mendoza seeking rare Heisman Trophy, CFP title sweep - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/10/e71836fa-0a09-4355-bad3-344354e95310/thumbnail/1200x675/1b0649ef90fbde9c00278ae9f9506e3c/mendoza-cfp-title.jpg"
      ],
      "datePublished": "2026-01-10T04:53:13.000Z",
      "dateModified": "2026-01-10T04:53:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dolphins hire Packers executive Jon-Eric Sullivan as next general manager - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dolphins-general-manager-jon-eric-sullivan-mike-mcdaniel-tua-tagovailoa/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/09/d8249531-6551-4812-9148-dfbdcdfbed8c/thumbnail/1200x675/25538c0301288e4730a67ea4ca760cf5/gettyimages-2189702335-2.jpg",
    "tag": "Sports",
    "date": "2026-01-10T00:31:57.000Z",
    "description": "\n        The Miami Dolphins have hired Jon-Eric Sullivan as their next general manager, the team announced on Friday evening. Sullivan is a long-time ",
    "body": "\n        The Miami Dolphins have hired Jon-Eric Sullivan as their next general manager, the team announced on Friday evening. Sullivan is a long-time Green Bay Packers executive who started with the team in 2003 and has worked as the vice president of player personnel since 2022.\"What an incredible honor it is to serve as general manager of the Miami Dolphins, an organization of history, tradition and great pride,\" said Sullivan in a statement. \"I want to express my gratitude to Stephen Ross and his family for this exceptional opportunity and the belief they've placed in me to lead this storied franchise forward. I also want to thank the entire Packers organization, especially Brian Gutekunst and the late Ted Thompson, for their leadership and allowing me to be entrenched in a process that has brought more than 30 years of sustained success to Green Bay.\"Now, as we forge ahead, we will build a football team that is resilient, physical and tough. We will compete no matter the circumstances, with the ultimate goal of competing for division championships and Super Bowls. Our team building process will be intentional, disciplined and sound. And we will do it together, with collaboration and hard work. It has always been and always will be a team sport. I can't wait to get started.\"\nSullivan was a scout with the Packers when they won Super Bowl XLV to cap off the 2010 season and has worked closely with Packers GM Brian Gutekunst to build a perennial playoff contender in Green Bay. Sullivan is the son of long-time college and NFL coach Jerry Sullivan, who spent 40 years on various sidelines and worked for the Dolphins as a wide receivers coach in 2004.In Miami, Sullivan replaces Chris Grier, who was fired by the Dolphins in October after serving as the team's GM since 2016, when he was promoted from director of college scouting. During Grier's tenure as general manager, the Dolphins experienced seven losing seasons and reached the postseason only three times. Miami has not won a playoff game since 2000.\n        \n            \n                Dolphins fire Mike McDaniel: Offensive guru out after second straight losing season, benching Tua Tagovailoa\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nSullivan's first task in Miami will be hiring a new coach to replace Mike McDaniel, who was fired Thursday after the team's 7-10 finish to the 2025 season, his fourth as coach. The Dolphins started the year 2-7 but rallied by winning five of their final eight. Ultimately, it was not enough to save McDaniel's job as owner Stephen Ross said the team is in need of \"comprehensive change.\"\n\"I could not be more excited to welcome Jon-Eric Sullivan as our next general manager. Jon-Eric brings a clear vision for how to build and run a football team, founded upon his own experience at a winning organization,\" Dolphins wner Stephen Ross said in a statement. \"As we went through our search process, it became undeniable the respect Jon-Eric has across the league as a talent evaluator, leader and man of integrity.\"Miami's season included the benching of former No. 5 overall pick Tua Tagovailoa one year after the Dolphins signed him to a four-year, $212.4 million contract extension. Tagovailoa said Monday he would \"be good with\" a new opportunity elsewhere. After hiring a new coach, figuring out what to with Tagovailoa, who has a $56.4 million cap hit in 2026, will surely be one of Sullivan's top priorities. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dolphins hire Packers executive Jon-Eric Sullivan as next general manager - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/09/d8249531-6551-4812-9148-dfbdcdfbed8c/thumbnail/1200x675/25538c0301288e4730a67ea4ca760cf5/gettyimages-2189702335-2.jpg"
      ],
      "datePublished": "2026-01-10T00:31:57.000Z",
      "dateModified": "2026-01-10T00:31:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, streaming for every round from wild card to Super Bowl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg",
    "tag": "Sports",
    "date": "2026-01-10T11:00:45.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                    ",
    "body": "\n\n\n    \n                                    Here's the full schedule for all 13 NFL playoff games being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 10, 2026\n                            \n                    at\n    6:00 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports Design\n            \n            \n    \n        After one of the wildest seasons in NFL history, the playoffs are finally here. This year's postseason won't have Patrick Mahomes and the Chiefs or Lamar Jackson and the Ravens, but there will still be plenty of familiar faces. The Eagles are in the playoffs for the fifth straight season and they'll be looking to become the first NFC team in 31 years to repeat as Super Bowl champion. Jalen Hurts is one of just two quarterbacks in the playoffs this year who has won a Super Bowl along with Matthew Stafford and Aaron Rodgers. The Steelers quarterback actually has more career playoff wins than every other QB in the AFC playoff field combined. There are also plenty of new faces in the postseason this year, including six teams that didn't make the playoffs last year with the Seahawks, 49ers, Panthers, Bears, Patriots and Jaguars all getting in. The final five teams in that group all lost at least 11 games last year before rebounding to make the postseason this year. The Panthers are in playoffs for the first time since 2017 and they'll be kicking off the postseason this year by hosting the Saturday afternoon game. With that in mind, let's get to the full playoff schedule. \n        \n            \n                2026 NFL playoff bracket picks: Expert predictions for who will win Super Bowl LX\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nWild Card WeekendSaturday, Jan. 10(5) Rams at (4) Panthers, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Packers at (2) Bears, 8 p.m. ET (Amazon Prime)Sunday, Jan. 11(6) Bills at (3) Jaguars, 1 p.m. ET (CBS) (Stream on Paramount+)(6) 49ers at (3) Eagles, 4:30 p.m. ET (Fox) (Stream: Fubo -- try for free)(7) Chargers at (2) Patriots, 8 p.m. ET (NBC)Monday, Jan. 12(5) Texans at (4) Steelers, 8 p.m. ET (ESPN/ABC) (Stream: Fubo -- try for free)Divisional RoundSaturday, Jan. 17AFC or NFC divisional matchup, 4:30 p.m. ET AFC or NFC divisional matchup, 8 p.m. ETSunday, Jan. 18AFC or NFC divisional matchup, 3 p.m. ETAFC or NFC divisional matchup, 6:30 p.m. ETNote: The winner of the Monday night game in the wild card round will play on Sunday in the divisional round. The Broncos and Seahawks will both host a game in the divisional round after getting a bye in the wild card round. Championship SundaySunday, Jan. 25\nAFC Championship, 3 p.m. ET (CBS)NFC Championship, 6:30 p.m. ET (Fox)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, streaming for every round from wild card to Super Bowl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/ad4b18fe-432c-4a26-be3e-1e47fd3a748b/thumbnail/1200x675/220cfab6d87b93d45e70e0bb7bb6d639/2025-26-nflbracket-weditorial-editorial-1920x1080.jpg"
      ],
      "datePublished": "2026-01-10T11:00:45.000Z",
      "dateModified": "2026-01-10T11:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lopsided loss to Indiana continues troubling rematch trend for Oregon's Dan Lanning - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/cfp-semifinal-loss-indiana-oregons-dan-lanning-rematch-problem/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/10/4363d438-cc94-45dc-815b-1ae77e1180de/thumbnail/1200x675/354deffe1f1a6d1065a1f5473127c11d/dan-lanning-mad-1.jpg",
    "tag": "Sports",
    "date": "2026-01-10T05:59:33.000Z",
    "description": "\n        Dan Lanning has a rematch problem.Following Indiana's 38-3 win over Alabama in the Rose Bowl on New Year's Day, coach Curt Cignetti made sure",
    "body": "\n        Dan Lanning has a rematch problem.Following Indiana's 38-3 win over Alabama in the Rose Bowl on New Year's Day, coach Curt Cignetti made sure to say that it's tough to beat a good team twice in the postgame. It was a point he hammered for the next eight days through multiple interactions with the media ahead of his team's rematch against Oregon in the Peach Bowl.After watching Cignetti's Hoosiers crush Oregon 56-22 in Atlanta, one begins to question whether Cignetti really believed it, or if he even should've. It's long been a cliche that it's hard to beat a good team once, and even more difficult to beat one twice, but that doesn't seem to be the case with Lanning's Oregon Ducks.Indiana started with a pick-six of Dante Moore on the first snap of the game. D'Angelo Ponds, who intercepted the pass, seemed to have a better idea of where the ball was going than Moore or its intended target, Malik Benson. Things only got worse from there. The Hoosiers were up 35-7 at halftime, and it was 56-15 in the fourth quarter before Oregon scored a touchdown in the final seconds to finish 56-22.If it felt familiar, it's because it was.\n                                                                    CBS Sports HQ\n                                                            Last year, Oregon beat Ohio State 32-31 in mid-October at Autzen Stadium. It was one of the best college football games of the 2024 regular season, if not the best. Everybody was excited to see the rematch between the two in the Rose Bowl quarterfinal. The excitement didn't last long for anybody not rooting for Ohio State. The Buckeyes were up 14-0 halfway through the first quarter and would extend that lead to 34-0 before Oregon scored a touchdown on the final play of the first half to cut the deficit to 34-8.\nCombine last year's Rose Bowl with this year's Peach Bowl, and Oregon has trailed 69-15 at halftime of its last two rematches. The difference was that Ohio State mostly called off the dogs in the second half of the Rose Bowl, and Curt Cignetti lost the dogs' phone number years ago, if he ever had it at all.Now, in Oregon's defense, that Ohio State went on to win the whole damn thing last year. The Indiana team that beat it this year crushed Alabama last week and has dismantled highly-ranked teams all season long. If it blows the doors off Miami to win a national title next week, nobody will be all that surprised.But Oregon is a program that considers itself a title contender, too. Even if Ohio State and Indiana are both national champions, the Ducks should trail the two by 26 and 28 points, respectively, at halftime. \nAlso, let's not forget what happened in 2023. Oregon, still in the Pac-12, lost to rival Washington 36-33 in Seattle in mid-October. It then faced the Huskies again, at a neutral site, for the Pac-12 Championship. It lost that rematch, too. It was much closer than either of its playoff rematches -- but horseshoes and hand grenades, right?Lanning has been at Oregon for four seasons, and he's done a tremendous job. Including this Peach Bowl loss, he is 48-8 with the Ducks, but three of those eight losses have come in rematches, and he's yet to win one.If all three were close, I'd happily dismiss it as a small sample size and possible bad luck. But the blowout fashion of the last two is concerning. It seems to me Oregon's opponents are learning more from the first game -- and making better adjustments. It's either that or Oregon isn't adjusting at all, which makes the rematch far easier for its opponent.\nI don't know what it is, but I don't have to. Lanning should probably figure it out soon, though.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lopsided loss to Indiana continues troubling rematch trend for Oregon's Dan Lanning - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/10/4363d438-cc94-45dc-815b-1ae77e1180de/thumbnail/1200x675/354deffe1f1a6d1065a1f5473127c11d/dan-lanning-mad-1.jpg"
      ],
      "datePublished": "2026-01-10T05:59:33.000Z",
      "dateModified": "2026-01-10T05:59:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Antonio Conte and Cristian Chivu became rivals: Where to watch Inter vs. Napoli, Serie A schedule, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/antonio-conte-cristian-chivu-rivals-where-to-watch-inter-napoli-serie-a-schedule-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/10/37df6c1b-049f-4454-86ff-af7ee50d9204/thumbnail/1200x675/c673bf542851a9ca7f39f6e9f07d5754/untitled-design-2026-01-10t114547-305.png",
    "tag": "Sports",
    "date": "2026-01-10T10:50:13.000Z",
    "description": "\n        The 2025-26 Serie A season is in full swing in Italy. Napoli started the campaign as defending champions after winning the 2024-25 title, the",
    "body": "\n        The 2025-26 Serie A season is in full swing in Italy. Napoli started the campaign as defending champions after winning the 2024-25 title, their fourth Scudetto ever on the last matchday of the season. Inter and AC Milan will compete with the team coached by Antonio Conte to win the Serie A title, while other teams such as AS Roma, Atalanta, Juventus, Bologna and Como are all in contention for a spot in next season's European tournaments.This week's Serie A slate features some interesting matchups, such as the game between Inter and Napoli on Sunday. Here's how to watch:How Conte and Chivu became rivalsThe huge Serie A game taking place this Sunday between Inter and Napoli is also a matchup between two managers with a buddying rivalry in Antonio Conte and Cristian Chivu. The two have had some off-the-pitch verbal exchanges this season, something that often happens when teams are battling for the title. However, the tension dates back to last season, when Chivu was in charge of Parma and Conte was on his way to winning his first Scudetto with Napoli. In the penultimate game of the 2024-25 season Napoli were fighting to win the Serie A title while Parma were in the mix of the relegation battle. Before the final whistle of the 0-0 draw, Conte began showing his frustration at Parma's players and at Chivu's assistant, Antonio Gagliardi, who had previously worked under the Italian manager. The situation escalated and Conte was shown a red card. Chivu, who was not initially involved in the altercation, was also sent off as he tried to calm things down. This season, Chivu was appointed to become the new Inter coach, a club that was also coached by Conte from 2019 to 2021, winning one Serie A. After the 3–1 win at the Stadio Diego Armando Maradona in October, Inter president Giuseppe Marotta spoke live on television, expressing the club's frustration over the penalty awarded to Napoli in the first half, which was converted by Kevin De Bruyne before he got injured. Conte once again showed his displeasure also after a cinematic verbal fight with Inter captain Lautaro Martinez on the pitch, saying, \"If I were the Inter manager, I would not allow my president to speak like that.\" Chivu, however, consistently has cooled down any provocation from the Napoli coach over the season so far. Sunday's game will be a key turning point of the season for both sides: If Inter win, they are clearly Serie A's favorite to win the Scudetto, but if Napoli will win they will be back in contention  and also allow AC Milan back into the race. Despite a positive first year at the club, Chivu's side have shown some struggles against top teams in both Serie A and Champions League, suffering defeats to Juventus, Napoli, and AC Milan in the first part of the season. Now it's time for them to show the rest of the league that they are the team to beat.\nHow to watch Inter vs. Napoli, oddsDate: Sunday, Jan. 11 | Time: 2:45 p.m. ETLocation: San Siro -- Milan Live stream: Paramount+Odds: Inter -270; Draw +340; Napoli +700How to watch Serie A Matchday 20All times U.S./Eastern. Saturday, Jan. 10Como vs. Bologna, 9 a.m. (Paramount+)Udinese vs. Pisa, 9 a.m. (Paramount+)AS Roma vs. Sassuolo, 12 p.m. (Paramount+)Atalanta vs. Torino, 2:45 p.m. (Paramount+)Sunday, Jan. 11Lecce vs. Parma, 6:30 a.m. (Paramount+)Fiorentina vs. AC Milan, 9 a.m. (Paramount+)Hellas Verona vs. Lazio, 12 p.m. (Paramount+)Inter vs. Napoli, 2:45 p.m. (Paramount+)\nMonday, Jan. 12Genoa vs. Cagliari, 12:30 p.m. (Paramount+)Juventus vs. Cremonese, 2:45 p.m. (Paramount+)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Antonio Conte and Cristian Chivu became rivals: Where to watch Inter vs. Napoli, Serie A schedule, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/10/37df6c1b-049f-4454-86ff-af7ee50d9204/thumbnail/1200x675/c673bf542851a9ca7f39f6e9f07d5754/untitled-design-2026-01-10t114547-305.png"
      ],
      "datePublished": "2026-01-10T10:50:13.000Z",
      "dateModified": "2026-01-10T10:50:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Commanders promote David Blough to OC after just two years of coaching experience - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-david-blough-offensive-coordinator/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/10/71778a92-ffd2-4948-9c50-0375185df4e3/thumbnail/1200x675/3acd13e01c7d20c0e1669b60829daa48/usatsi-27577328-2.jpg",
    "tag": "Sports",
    "date": "2026-01-10T00:26:09.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Washington Commanders have promoted quarterbac",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Washington Commanders have promoted quarterbacks coach David Blough to offensive coordinator, sources tell CBS Sports' Jonathan Jones. Since ending his playing career in 2023, Blough, 30, has quickly risen up the coaching ladder, and he will now be tasked with getting Jayden Daniels and the Washington offense back on track.After going undrafted out of Purdue in 2019, Blough spent a few seasons as a backup quarterback with the Detroit Lions before playing his final full season with the Arizona Cardinals in 2022. Blough signed to the Lions' practice squad in 2023 but did not play in any games.In 2024, Commanders coach Dan Quinn hired Blough to be the assistant quarterbacks coach. Blough remained in that role for much of the last two seasons, until quarterbacks coach Tavita Pritchard was hired to be the next coach at Stanford in November. After that, Blough was promoted to quarterbacks coach for the remainder of the season.The Commanders' 2025 season was derailed by injuries to star players like Daniels and receiver Terry McLaurin, and the offense took a clear step back after reaching the NFC Championship Game the year prior. Washington ranked 22nd in points per game (20.9), 22nd in yards per game (318.8) and 24th in passing yards per game (184.1). In the wake of that disappointment, Quinn fired offensive coordinator Kliff Kingsbury.\nWith Washington in need of a replacement for Kingsbury, the team simply promoted Blough, who had received interest from other teams around the league. Dating back to his time with the Atlanta Falcons, Quinn has a history with letting talented assistants like Matt LaFleur and Mike McDaniel go to other teams. This time, he keeps Blough, who seems to be a rising star in the coaching world.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Commanders promote David Blough to OC after just two years of coaching experience - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/10/71778a92-ffd2-4948-9c50-0375185df4e3/thumbnail/1200x675/3acd13e01c7d20c0e1669b60829daa48/usatsi-27577328-2.jpg"
      ],
      "datePublished": "2026-01-10T00:26:09.000Z",
      "dateModified": "2026-01-10T00:26:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff schedule: Semifinal matchups and results - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-schedule-semifinal-results-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/12/08/bb73d4e7-169e-4278-a547-8dd97510f95f/thumbnail/1200x675/3382cbc4fc76a1bb1ad1ad08079faa48/cfp-logo.png",
    "tag": "Sports",
    "date": "2026-01-10T04:22:49.000Z",
    "description": "\n\n\n    \n                                    Breaking down the schedule as the 2025-26 College Football Playoff comes to a close\n        \n             ",
    "body": "\n\n\n    \n                                    Breaking down the schedule as the 2025-26 College Football Playoff comes to a close\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 9, 2026\n                            \n                    at\n    11:22 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2025 College Football Playoff has reached its final stage, with No. 1 Indiana and No. 10 Miami set to play for the national championship on Jan. 19 in Miami.What began as a 12-team field has been whittled down to two programs that took wildly different paths to the title game. Miami has embraced its role as the Cardiac Canes this postseason, winning three games in three distinct ways — a late road touchdown to edge Texas A&M in a 10-3 defensive struggle, a physical 24-14 upset of No. 2 Ohio State in the quarterfinals and a dramatic, last-minute comeback to beat No. 6 Ole Miss 31-27 in the semifinals.Awaiting the Hurricanes is an Indiana team that has been historically dominant. The Hoosiers are the first team in CFP history to win two playoff games by 28-plus points -- and both victories came by more than 35. Indiana throttled No. 9 Alabama 38-3 in the Rose Bowl quarterfinals and dismantled No. 5 Oregon 56-22 in the Peach Bowl semifinals.All that stands between Indiana and a perfect 15-0 season -- and the first national championship in program history -- is a Miami team riding an improbable playoff run. The Hurricanes have already dethroned two top-three seeds and will be unusually comfortable playing the sport's biggest game inside their home stadium.Both teams arrive with electric defenses. Miami's dominant front and aggressive secondary have driven its postseason surge, while Indiana has controlled the line of scrimmage and smothered opposing offenses with relentless pursuit and execution.Offensively, both units face stiff tests but enter with confidence following strong semifinal performances. Heisman Trophy winner Fernando Mendoza has shredded Alabama and Oregon, aided by an Indiana offensive line that has provided time and a deep receiving corps capable of winning downfield. Miami's offense did just enough in its first two games before opening things up against Ole Miss, as Carson Beck caught fire and freshman standout Malachi Toney continued to show why he's one of the sport's rising stars.\nThe championship will ultimately come down to which team can solve the other's defensive puzzle. Either way, Jan. 19 will crown a fresh champion: Indiana is seeking its first national title, while Miami is chasing its first in 24 years.Below, you can stay updated with the College Football Playoff schedule as we move on to the national championship game. 2025-26 College Football Playoff scheduleAll times EasternCollege Football Playoff National ChampionshipMonday, Jan. 207:30 p.m. | ESPNHard Rock Stadium -- Miami Gardens, Fla. 2025-26 College Football Playoff scores, results\n                                                                    CBS Sports graphic\n                                                            First roundFriday, Dec. 19\n(9) Alabama 34, (8) Oklahoma 24 | RecapGaylord Family Oklahoma Memorial Stadium -- Norman, Oklahoma Saturday, Dec. 20(10) Miami 10, (7) Texas A&M 3: | RecapKyle Field -- College Station, Texas(6) Ole Miss 41, (11) Tulane 10 | RecapVaught-Hemingway Stadium -- Oxford, Mississippi (5) Oregon 51, (12) James Madison 34 | RecapAutzen Stadium -- Eugene, Oregon QuarterfinalsCotton Bowl -- (10) Miami 24, (2) Ohio State 14 | RecapAT&T Stadium -- Arlington, TexasOrange Bowl -- (5) Oregon 23, (4) Texas Tech 0 | RecapHard Rock Stadium -- Miami Gardens, Fla. Rose Bowl -- (1) Indiana 38, (9) Alabama 3 | RecapRose Bowl -- Pasadena, Calif.Sugar Bowl (6) Ole Miss 39, (3) Georgia 34 | RecapCaesars Superdome -- New OrleansSemifinals Fiesta Bowl: (10) Miami 31, (6) Ole Miss 27 | RecapState Farm Stadium -- Glendale, Ariz. Peach Bowl: (1) Indiana 56, (5) Oregon 22 | RecapMercedes-Benz Stadium -- Atlanta\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff schedule: Semifinal matchups and results - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/12/08/bb73d4e7-169e-4278-a547-8dd97510f95f/thumbnail/1200x675/3382cbc4fc76a1bb1ad1ad08079faa48/cfp-logo.png"
      ],
      "datePublished": "2026-01-10T04:22:49.000Z",
      "dateModified": "2026-01-10T04:22:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 in bonus bets by targeting Oregon-Indiana in College Football Playoff - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-to-get-300-bonus-bets-oregon-indiana-college-football-playoff/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-01-09T22:10:47.000Z",
    "description": "\n        Last night featured a college football classic, and with top-seeded Indiana set to take on No. 5 Oregon in the second College Football Playof",
    "body": "\n        Last night featured a college football classic, and with top-seeded Indiana set to take on No. 5 Oregon in the second College Football Playoff semifinal Friday night, this matchup could play out similarly and create an elite contest to use the latest DraftKings promo code, which gives new users $300 in bonus bets if your first $5 bet wins. These two teams met in October, resulting in a 30-20 victory for Indiana, but given the stakes of this CFP semifinal, the SportsLine advanced computer model doesn't project quite as high-scoring an affair for this Peach Bowl matchup at 7:30 p.m. ET from Mercedes-Benz Stadium in Atlanta, Georgia. The model is backing Under 50.5 points scored for Friday best bets at DraftKings Sportsbook in a pairing of two elite defenses.One of SportsLine's top experts has also backed a side in Indiana vs. Oregon, with SportsLine's Emory Hunt picking Indiana to cover as 3-point favorites. Additionally, the model has locked in its top NBA pick for Friday night, taking Over 214.5 points for Clippers vs. Nets to complete its Friday best bets at DraftKings. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 12 of the 2025-26 NBA season on a sizzling 33-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookIndiana vs. Oregon: Under 50.5 total points (-112)Indiana (-3) vs. Oregon (-115)Clippers vs. Nets: Over 214.5 total points (-110)Combining the three picks into a Friday parlay at DraftKings would result in a payout of +625 (risk $100 to win $625, odds subject to change). Bet it at DraftKings here:\nIndiana vs. Oregon: Under 50.5 total points (-112)Yes, this matchup features two of the best offenses in college football, orchestrated by quarterbacks who could be the top two picks in the 2026 NFL Draft in Fernando Mendoza and Dante Moore. However, both teams' defenses actually rank even higher than their offenses in total scoring, with Indiana having the No. 2 scoring defense at 11.1 points per game allowed, and Oregon sixth at 15.3 ppg. Neither team allowed a touchdown in its quarterfinal games despite challenging matchups, with Indiana playing Alabama and Oregon going against Texas A&M. These two teams combined for 50 points in their regular-season matchup, but with this being the second time they meet, plus the increased attention to detail in preparing for a semifinal, the model projects a lower-scoring matchup tonight. The model projects the Under to hit in 59% of simulations. Back the Under at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Indiana (-3) vs. Oregon (-115)\"When you look at rematch games, it always comes down to what little adjustments teams make over the previous matchup,\" SportsLine expert Emory Hunt said. \"When facing Indiana, it really is about discipline and execution, which is tough to game plan for and adjust to. The Hoosiers simply do not make mistakes, and this spread is close enough to definitely reflect that notion.\" Back Indiana at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Clippers vs. Nets: Over 214.5 total points (-110)The Clippers have gone Over this number in four of their last five games, and they are coming off a 123-111 loss to the Knicks on Wednesday, which went Over this total. Los Angeles is allowing 123.7 ppg over its last three contests. Brooklyn has also gone Over this number in six of its last seven games. These two teams rank in the bottom four in the league in scoring, which is why this total is lower than most over/unders, but the model views it being this low as an overreaction to that statistic. The model projects the Over to hit in 69% of simulations. Back the Over at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:\nWant more College Football Playoff, NBA picks for Friday?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 in bonus bets by targeting Oregon-Indiana in College Football Playoff - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-01-09T22:10:47.000Z",
      "dateModified": "2026-01-09T22:10:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff bracket: Semifinals field, scores and schedule - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-bracket-semifinals-scores-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/2bfcc0a2-87ff-4298-bb4f-a00202d849a6/thumbnail/1200x675/45c03a5a5d1073f9377c33947ea5b54e/cfp-pylon-logo.png",
    "tag": "Sports",
    "date": "2026-01-10T04:51:48.000Z",
    "description": "\n\n\n    \n                                    How the 12-team College Football Playoff field shapes the national championship race\n        \n            ",
    "body": "\n\n\n    \n                                    How the 12-team College Football Playoff field shapes the national championship race\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                            \n                            \n    Jan 9, 2026\n                            \n                    at\n    11:19 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The College Football Playoff National Championship is set. No. 1 Indiana will face No. 10 Miami on Jan. 19 at Hard Rock Stadium in South Florida for college football's biggest prize. Miami is seeking its first national title since 2001, while Indiana is chasing the first championship in program history.Indiana, fresh off its first bowl win since 1991 after defeating Alabama in the CFP quarterfinals at the Rose Bowl, made another statement Friday. The Hoosiers defeated No. 5 Oregon 56-22 behind a dominant effort on both sides of the ball. In Year 2 of the Curt Cignetti era, Indiana now stands one win away from completing one of the most remarkable turnarounds in the sport's history.The matchup will mark the third all-time meeting between Indiana and Miami -- and the first since 1966. The Hoosiers earned a 28-14 victory in 1964 before the Hurricanes evened the series with a 14-7 win two years later.Miami earned its spot in the title game with a Fiesta Bowl semifinal that will be remembered as an instant classic. The Hurricanes controlled the line of scrimmage for much of the night, but Ole Miss appeared poised to steal the game after quarterback Trinidad Chambliss engineered a late touchdown drive to take a 27-24 lead with just over three minutes remaining.That proved to be too much time for Miami quarterback Carson Beck. The sixth-year senior answered with a poised, downfield march, capping the drive with a 3-yard touchdown run with 18 seconds left -- a play destined to live in Miami lore.Ole Miss still had one final chance, driving to the Hurricanes' 31-yard line for a last-gasp heave into the end zone. Chambliss' pass fell incomplete -- not without controversy -- sending Miami into celebration and back to the national championship game for the first time since 2002.Below, you'll find all the viewing information for every game all the way through to the CFP National Championship. \n                                                                    CBS Sports graphic\n                                                            2025-26 College Football Playoff bracketAll times Eastern\nFirst roundFriday, Dec. 19(9) Alabama 34, (8) Oklahoma 24 | RecapGaylord Family Oklahoma Memorial Stadium -- Norman, Oklahoma Saturday, Dec. 20(10) Miami 10, (7) Texas A&M 3 | RecapKyle Field -- College Station, Texas(6) Ole Miss 41, (11) Tulane 10 | RecapVaught-Hemingway Stadium -- Oxford, Mississippi (5) Oregon 51, (12) James Madison 34 | RecapAutzen Stadium -- Eugene, Oregon QuarterfinalsWednesday, Dec. 31Cotton Bowl -- (10) Miami 24, (2) Ohio State 14 | RecapAT&T Stadium -- Arlington, TexasThursday, Jan. 1Orange Bowl -- (5) Oregon 23, (4) Texas Tech 0 | RecapHard Rock Stadium -- Miami Gardens, Fla. Rose Bowl -- (1) Indiana 38, (9) Alabama 3 | RecapRose Bowl -- Pasadena, Calif.Sugar Bowl -- (6) Ole Miss 39, (3) Georgia 34 | RecapCaesars Superdome -- New OrleansSemifinalsThursday, Jan. 8Fiesta Bowl: (10) Miami 31, (6) Ole Miss 27 | RecapState Farm Stadium -- Glendale, Ariz. Friday, Jan. 9\nPeach Bowl: (1) Indiana 56, (5) Oregon 22 | RecapMercedes-Benz Stadium -- AtlantaCollege Football Playoff National ChampionshipMonday, Jan. 207:30 p.m. | ESPNHard Rock Stadium -- Miami Gardens, Fla. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff bracket: Semifinals field, scores and schedule - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/2bfcc0a2-87ff-4298-bb4f-a00202d849a6/thumbnail/1200x675/45c03a5a5d1073f9377c33947ea5b54e/cfp-pylon-logo.png"
      ],
      "datePublished": "2026-01-10T04:51:48.000Z",
      "dateModified": "2026-01-10T04:51:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]