[
  {
    "title": "Where to watch Yankees vs. Red Sox: TV channel, live stream, odds, pick - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/yankees-vs-red-sox-2025-wild-card-series-schedule-scores-where-to-watch-mlb-playoff-games-tv-coverage/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/1cb53d35-1a45-432b-9fe1-9907680f032e/thumbnail/1200x675/15c009e1d9fdb74e2e9e5168965a907c/wells-getty.png",
    "tag": "Sports",
    "date": "2025-10-02T01:21:35.000Z",
    "description": "Getty Images                                    Two of Major League Baseball's biggest blood rivals -- the New York Yankees and Boston Red Sox -- opened their best-of-three American League Wild Card...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"wells-getty.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/02/1cb53d35-1a45-432b-9fe1-9907680f032e/thumbnail/770x433/74497d1d60487a731241581094816ebc/wells-getty.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>Two of Major League Baseball's biggest blood rivals -- the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/NYY/new-york-yankees/\">New York Yankees</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/BOS/boston-red-sox/\">Boston Red Sox</a> -- opened their best-of-three American League Wild Card Series on Tuesday. The 94-68 Yankees, by virtue of finishing ahead of the Red Sox in the standings, will have home-field advantage throughout the series. The 89-73 Red Sox, meantime, occupy the second wild card spot in the AL and are the No. 5 seed in that half of the postseason bracket.</p><p>In Game 1, Red Sox ace Garrett Crochet dominated the Yankees and Boston got just enough offense, including a two-run single by Masataka Yoshida, to beat the Bombers.</p><p>The winner of this series will advance to the Divisional Round, where they'll play against the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/TOR/toronto-blue-jays/\">Blue Jays</a>, the No. 1 seed in the AL and their other division rival. </p><p>Here's the Wild Card Series schedule for the Yankees vs. Red Sox:</p>\n<table><tbody><tr><th><br />  </th><th>Date</th><th>Start time/score</th><th>TV</th><th>Live stream</th></tr><tr><td><p><strong>Game 1</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Tues., Sept. 30</p></td><td><p>BOS 3, NYY 1</p></td><td><p>ESPN</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr><tr><td><p><strong>Game 2</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Weds., Oct. 1</p></td><td><p>NYY 4, BOS 3</p></td><td><p>ESPN</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr><tr><td><p><strong>Game 3</strong> \t\t\t\t</p></td><td><p>Thurs., Oct. 2</p></td><td><p>6:08 p.m. ET</p></td><td><p>ESPN</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr></tbody></table><h2> Where to watch Game 3<br />  </h2><p><strong>Date:</strong> Wednesday, Oct. 1 | <strong>Time:</strong> 6:08 p.m. ET<br /> <strong>Location:</strong> Yankee Stadium (Bronx, N.Y.)<br /><strong>TV channel: </strong>ESPN | <strong>Live stream</strong>: <a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a> (Try for free)<br /> <strong>Probable pitchers:</strong> RHP Cam Schlittler (NYY) vs. LHP Connelly Early (BOS) <br /><strong>Odds:</strong> NYY -141 | BOS +116 (via <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings</a>)</p>\n            </div>\n    </div>"
  },
  {
    "title": "UFC 320: Merab Dvalishvili has chance to become the true bantamweight GOAT as he runs roughshod over division - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-merab-dvalishvili-has-chance-to-become-the-true-bantamweight-goat-as-he-runs-roughshod-over-division/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/347ed38b-f678-42b4-aa7a-a1ea9e64a4d9/thumbnail/1200x675/0d0c31fafaab5140846ffbf545cbdf7e/merab-dvalishvili-ufc-320-mma-news-today-cbs-sports.jpg",
    "tag": "Sports",
    "date": "2025-10-01T22:55:27.000Z",
    "description": "The UFC bantamweight championship has produced flashes of brilliance but never the enduring grandeur of other divisions. Anderson Silva nor Georges St-Pierre anchor its history. Reigning champion Merab...",
    "body": "<div>\n        <p>The UFC bantamweight championship has produced flashes of brilliance but never the enduring grandeur of other divisions. Anderson Silva nor Georges St-Pierre anchor its history. Reigning champion Merab Dvalishvili is on the verge of changing that.</p><p>Dvalishvili defends the UFC bantamweight title against Cory Sandhagen <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-fight-card-date-odds-rumors-location-complete-guide/\" target=\"_blank\">at UFC 320</a></span>. He enters as a heavy four-to-one favorite against the challenger. He also eyes a rematch against Petr Yan before the year's end, which would mark an astonishing fourth title defense in a calendar year. If Dvalishvili beats Sandhagen and Yan again, as he did in a lopsided decision two years ago, it would cement what many already call the best bantamweight run ever.  </p><p>\"I want to be busy. I'm healthy, and I want to set a record with four UFC title fights in one year,\" Dvalishvili told CBS Sports. \"That would be great on my resume.\"</p><p>Dvalishvili's push for four title fights in 12 months underscores his drive. The native of Georgia opened 2025 with a win over Umar Nurmagomedov where he entered the fight as a betting underdog to the cousin of legendary lightweight champion Khabib Nurmagomedov. He passed that test with flying colors before being booked for a rematch with Sean O'Malley in June, where he scored a brutal submission of the former titleholder.</p>\n<p>Instead of giving himself an extra month or so to heal from Saturday's fight to may be get booked on the upcoming December PPV to close out 2025, Merab wants to fight at Madison Square Garden on Nov. 15 for UFC 322 -- just six weeks later.</p><a href=\"https://www.cbssports.com/mma/news/ufc-320-alex-pereira-gets-his-chance-at-redemption-after-rare-humbling-loss-against-magomed-ankalaev/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>UFC 320: Alex Pereira gets his chance at redemption after rare humbling loss against Magomed Ankalaev</p>\n                <p>\n                    Brian Campbell                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"UFC 320: Alex Pereira gets his chance at redemption after rare humbling loss against Magomed Ankalaev\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/708592ee-b8e1-443c-ae13-300a57f2abc9/thumbnail/270x152/54e07dd73f63a36081fb6cd613ed5c3c/pereira-yell-ufc-313.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>It sounds reckless, but Dvalishvili isn't one for empty promises.</p><p>Dvalishvili already owns the longest win streak in bantamweight history (12). He's two victories shy of tying Aljamain Sterling's divisional wins record and Dillashaw's five title defenses. Looking at the current contenders, it's believable he'll get there. He's beaten everyone in the UFC's bantamweight top five except Sandhagen.</p><p>Zoom out, and the records keep piling up. He recently passed St-Pierre for most UFC takedowns (97) and is poised to be the first to hit triple digits. His 13-fight winning streak -- including a catchweight bout -- ties him with GSP, Jon Jones, Demetrious Johnson, Khabib Nurmagomedov and Max Holloway. Three more wins would match Silva's 16-fight streak, untouched for 13 years. </p>\n<p>\"Hard work got me here. I don't think I'm special...\" Dvalishvili previously told CBS Sports. \"I still have the same motivation as before. I'm still trying to be a   better version of myself. Yes, I'm a champion. I have this status and   respect. But I'm a regular guy. </p><p>\"I tell people, 'You have to work hard.'   Sometimes hard work beats talent. I think that's who I am. I'm still   trying to improve. I'm still trying to work harder and get better. I  want to keep this belt, make new records and inspire more people.\" </p><p><strong><em>Check out the full interview with Merab Dvalishvili below.</em></strong>  </p>\n<p>Still, to say bantamweight never had a great champion would overlook those who laid the groundwork for what Dvalishvili is chasing.</p>\n<p>Dominick Cruz set the standard from the beginning. As reigning WEC champion, he was awarded the inaugural UFC bantamweight title at the promotion's final event before its merger. Cruz beat \"Mighty Mouse\" in his first defense before vacating due to injuries. Four years later, he made a thunderous return, dethroning TJ Dillashaw to become a two-time champ. But a one-sided loss to Cody Garbrandt and recurring health issues stalled his UFC legacy, even if his WEC reign is untouchable.  </p><p>Dillashaw has the next best claim. A two-time champion, he revolutionized the division with elusive movement and finishing instincts. His bitter feud with ex-teammate Garbrandt remains the best rivalry in the division's history. But losses to Cruz and Henry Cejudo, and a career-ending shoulder injury, kept him from closing the case as the bantamweight G.O.A.T.</p><p>Dvalishvili is primed to be the storied champion bantamweight lacks -- one who can enter pound-for-pound, all-time conversations without being immediately laughed out of the room. Some, <span><a href=\"https://www.cbssports.com/mma/news/ufc-316-sean-omalley-calls-merab-dvalishvili-the-greatest-bantamweight-of-all-time-after-second-loss/\" target=\"_blank\">including rival Sean O'Malley</a></span>, already call him the best. Fittingly, it's not a label the Georgian-born, American immigrant -- whose self-belief stems from humility and hard work -- is willing to claim. </p>\n<p>\"I will never call myself the best bantamweight,\" Dvalishvili said. \"I am still an active fighter... Maybe when I finish my career, I'll call myself what I was. But right now, I'm active and my goal is to continue step-by-step moving forward.\"</p>\n            </div>"
  },
  {
    "title": "Big Ten contemplating $2 billion private equity deal, grant of rights extension with decision on horizon - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/big-ten-contemplating-2-billion-private-equity-deal-grant-of-rights-extension-with-decision-on-horizon/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/fb430102-512f-43a5-8934-0b70ba553ebf/thumbnail/1200x675/68655b614ce6bf9db65898a609f249a1/big-confetti-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-01T23:43:31.000Z",
    "description": "Getty Images                                    The Big Ten is contemplating an enormous equity deal, upwards of $2 billion, CBS Sports' John Talty confirms. The deal would also extend the Big Ten's grant...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"2024 Big Ten Football Championship - Penn State v Oregon\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/fb430102-512f-43a5-8934-0b70ba553ebf/thumbnail/770x433/234ae1e99539ff71accd69b648e6c0f6/big-confetti-getty.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The Big Ten is contemplating an enormous equity deal, upwards of $2 billion, <a href=\"https://x.com/JTalty/status/1973513989964570888\" target=\"_blank\">CBS Sports' John Talty confirms</a>. The deal would also extend the Big Ten's grant of rights until 2046, but it may take come convincing to get <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/MICH/michigan-wolverines/\">Michigan</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/OHIOST/ohio-state-buckeyes/\">Ohio State</a> on board. Discussions have been going on for months now, going back as far as May when conference leaders hosted firms at spring meetings, <a href=\"https://www.espn.com/college-sports/story/_/id/46452188/sources-big-ten-discussing-2-billion-private-capital-deal\" target=\"_blank\">according to ESPN</a>, but a decision on private equity investment is still weeks away. </p><p>If a deal does come to fruition, the extension of the grant of rights would be a setback for those hoping to form super leagues in college sports. The issue is that Michigan and Ohio State may not be as open to the private equity deal as other member institutions. The league would like to have unanimous support on any deal involving private capital, per ESPN. </p><p>Some insight into Michigan's opposition to the private equity proposal was provided by Jordan Acker, a member of the university's Board of Regents. On social media, Acker expressed concerns about a public university getting so deeply involved with private capital.</p>\n<p>According to ESPN, the deal would be based around the formation of a private commercial entity within the conference called Big Ten Enterprises. The league's commercial interests would then be divided up into 20 parts, with each of the 18 member schools, the league itself, and the private equity firm each getting a share.</p>\n<p>\"Think of it this way -- the conference is not selling a piece of the conference,\" a source told ESPN. \"Traditional conference functions would remain 100 percent with the conference office -- scheduling, officiating and championships. The new entity being created would focus on business development, and it would include an outside investor with a small financial stake.\"</p>\n            </div>\n    </div>"
  },
  {
    "title": "Heat, Nikola Jović reportedly agree to four-year contract extension with franchise sitting at crossroads - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nba/news/heat-nikola-jovic-reportedly-agree-to-four-year-contract-extension-with-franchise-sitting-at-crossroads/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/a80e613a-fc94-4137-b9f6-4f1f989a2e36/thumbnail/1200x675/f7240202472b3b9c95aeedde8ae9ada1/100125-nikolajovic.jpg",
    "tag": "Sports",
    "date": "2025-10-02T01:20:47.000Z",
    "description": "The Miami Heat have agreed to a four-year, $62.4 million contract extension with third-year forward Nikola Jović, per ESPN's Shams Charania. Jović is coming off his best season with the Heat after being...",
    "body": "<div>\n        <p>The <a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/MIA/miami-heat/\">Miami Heat</a> have agreed to a four-year, $62.4 million contract extension with third-year forward Nikola Jović, <a href=\"https://www.espn.com/nba/story/_/id/46454596/nikola-jovic-heat-strike-4-year-624m-rookie-extension\" target=\"_blank\">per ESPN's Shams Charania</a>. Jović is coming off his best season with the Heat after being selected 27th overall in the 2022 <a target=\"_blank\" href=\"https://cbssports.com/nba/draft/\">NBA Draft</a>.</p><p>He finished last season averaging a career-high 10.7 points on 37% from 3-point range, though for the third consecutive year he struggled to stay healthy and was limited to just 46 games. He's yet to play at least 50 games in a season during his career, but when healthy he's shown promise of being a quality role player next to <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/2844706/bam-adebayo/\">Bam Adebayo</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/3042352/tyler-herro/\">Tyler Herro</a>. While he missed the last month of the regular season, Jović was able to return for the playoffs, where he put up 24 points in Miami's Game 4 loss to the <a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/CLE/cleveland-cavaliers/\">Cavaliers</a>. Though it didn't result in a win, it was an encouraging way for Jović to end the season.</p><p>This contract shows a commitment from the Heat in Jović's development, and could mean an even bigger role on a Miami team that will experience its first full season without <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/1646703/jimmy-butler/\">Jimmy Butler</a> in the 2020s after he was traded to the <a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/GS/golden-state-warriors/\">Golden State Warriors</a> last season.</p><p>While the Eastern Conference will be as wide-open as ever due to significant injuries to the last two conference winners in <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/2268018/jayson-tatum/\">Jayson Tatum</a> (<a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/BOS/boston-celtics/\">Celtics</a>) and <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/3041074/tyrese-haliburton/\">Tyrese Haliburton</a> (<a target=\"_blank\" href=\"https://www.cbssports.com/nba/teams/IND/indiana-pacers/\">Pacers</a>), it's still difficult to pin down exactly where the Heat stand entering a new season. They'll already start the season with a bad break as Herro will be recovering from foot surgery that is expected to keep him sidelined until at least November. His return could actually be later than that, as the All-Star guard said at Media Day that <a href=\"https://www.sun-sentinel.com/2025/09/29/spoelstra-on-heat-questions-im-embracing-the-unknown-addresses-herro-surgery/\" target=\"_blank\">he'll be back in 8-12 weeks</a>, which at the latest would put him at a January return.</p>\n<a href=\"https://www.cbssports.com/nba/news/tyler-herro-injury-heat-star-out-until-at-least-november-after-undergoing-foot-surgery/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Tyler Herro injury: Heat star out until at least November after undergoing foot surgery</p>\n                <p>\n                    Chris Bengel                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Tyler Herro injury: Heat star out until at least November after undergoing foot surgery\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/19/d8ae9037-5fea-4af0-a603-1b8b1660183d/thumbnail/270x152/6c6b806ad238eb211dde12065766b37c/herro-getty.png\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Despite Herro's extended absence, Adebayo seems incredibly confident in Miami's chances of making another surprise run come playoff time, <a href=\"https://andscape.com/features/norman-powell-joins-miami-heat-with-chip-on-his-shoulder/\" target=\"_blank\">telling Andscape's Marc Spears</a> that \"People [are] going to call us crazy, but I think we're a contender.\" <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/1905196/norman-powell/\">Norman Powell</a> also thinks the Heat could surprise some folks this season, saying other teams should \"fear\" Miami.</p><p>\"We can be really good,\" Powell said. \"One thing that people don't understand or see is that you don't need a generational superstar or talent to be good to go and win a championship and have a deep playoff run,\" Powell said. \"[You can have a deep playoff run] Having a well-rounded team with experience with star players, which we have in Bam and Tyler -- and I see myself as well as a budding star even though I'm 32 now. But [it helps] having that experience with Wiggins, guys that have won championships and know what it takes to be successful.\"</p>\n<p>When healthy, the Heat can field a starting lineup of Herro, Powell, Adebayo, <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/2135571/andrew-wiggins/\">Andrew Wiggins</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/28955234/kelel-ware/\">Kel'el Ware</a>. That's a pretty solid unit, and bringing in Jović's shooting off the bench, as well as <a target=\"_blank\" href=\"https://www.cbssports.com/nba/players/2104417/terry-rozier/\">Terry Rozier</a>'s scoring gives the Heat a quality seven-man rotation that can certainly challenge for a top-six seed in a weakened Eastern Conference.</p>\n            </div>"
  },
  {
    "title": "Where to watch Cubs vs. Padres: TV channel, live stream Wild Card Series Game 2 - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/cubs-vs-padres-2025-wild-card-series-schedule-scores-where-to-watch-mlb-playoff-games-tv-coverage/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/40d9a474-7a3b-47d6-b9b4-3a99e9e9e152/thumbnail/1200x675/6846b40acfc6d7dcd5d2c38cde5c7c43/machado-getty-1.png",
    "tag": "Sports",
    "date": "2025-10-01T22:30:54.000Z",
    "description": "Getty Images                                    The best-of-three Wild Card Series began Tuesday night at Wrigley Field with a 3-1 Chicago Cubs win (box score) over the San Diego Padres at Wrigley Field....",
    "body": "<div>\n    <div>\n    <figure><img alt=\"machado-getty-1.png\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/40d9a474-7a3b-47d6-b9b4-3a99e9e9e152/thumbnail/770x433/190b89d11bea046cfadfc032a004b08a/machado-getty-1.png\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>The best-of-three Wild Card Series began Tuesday night at Wrigley Field with a 3-1 <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/CHC/chicago-cubs/\">Chicago Cubs</a> win (<a href=\"https://www.cbssports.com/mlb/gametracker/live/MLB_20250930_SD@CHC/\" target=\"_blank\">box score</a>) over the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/SD/san-diego-padres/\">San Diego Padres</a> at Wrigley Field. The Padres got even on Wednesday, which forces a do-or-die Game 3.</p><p>Both the Cubs and Padres were the second-place finishers in their divisions (NL Central and NL West, respectively), hence their wild card positions. The winner of this Wild Card Series will advance to take on the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIL/milwaukee-brewers/\">Milwaukee Brewers</a>, the National League's No. 1 seed. </p><p>You can check out the complete 2025 <a target=\"_blank\" href=\"https://cbssports.com/mlb/\">MLB</a> playoff schedule and bracket. Below is the Wild Card Series schedule for the Cubs vs. Padres:</p>\n<table><tbody><tr><th><br />  </th><th>Date</th><th>Start time/score</th><th>TV</th><th>Live stream</th></tr><tr><td><p><strong>Game 1</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Tues., Sept. 30</p></td><td><p>CHC 3, SD 1</p></td><td><p>ABC</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr><tr><td><p><strong>Game 2</strong> \t\t\t\t \t\t\t\t</p></td><td><p>Weds., Oct. 1</p></td><td><p>SD 3, CHC 0</p></td><td><p>ABC</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr><tr><td><p><strong>Game 3</strong> \t\t\t\t</p></td><td><p>Thurs., Oct. 2</p></td><td><p>3:08 p.m. ET</p></td><td><p>ABC</p></td><td><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></td></tr></tbody></table><h2> Where to watch Game 3<br />  </h2><p><strong>Date:</strong> Thursday, Oct. 2 | <strong>Time:</strong> 3:08 p.m. ET<br /> <strong>Location:</strong> Wrigley Field (Chicago)<br /><strong>TV channel: </strong>ABC | <strong>Live stream</strong>: <a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a> (Try for free)<br /> <strong>Probable pitchers:</strong> RHP Yu Darvish (SDP) vs. RHP Jameson Taillon (CHC)<br /><strong>Odds:</strong> CHI -121 | SDP +100 (via <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/draftkings-promo-code/\">DraftKings</a>)</p>\n            </div>\n    </div>"
  },
  {
    "title": "Champions League Power Rankings: Real Madrid bounce back; PSG make statement with win at Barcelona - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-power-rankings-real-madrid-bounce-back-psg-make-statement-with-win-at-barcelona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/c4c44956-a7b0-4482-809a-c1801c08463d/thumbnail/1200x675/f2758d0f50ff1ff6d4f8860b70788fad/power-rankings-soccer-ucl-template-1-2.jpg",
    "tag": "Sports",
    "date": "2025-10-02T00:22:24.000Z",
    "description": "Here's how all the teams in the league phase stack up after Matchday...",
    "body": "<div>\n<div>\n<article>\n    <div>\n                                    <h2>Here's how all the teams in the league phase stack up after Matchday 2</h2>\n        <div>\n                                                <div>\n                        <a target=\"_blank\" href=\"https://www.cbssports.com/writers/chuck-booth/\">\n                        <div>\n    <figure><img alt=\"            Chuck Booth\n    \" src=\"https://sportshub.cbsistatic.com/i/r/2025/03/14/2168bf81-e871-4c82-95ec-cf0edd68069e/thumbnail/80x80/46f419f267babba18f6d5a83925dc648/booth500.png\" /></figure>\n                                            </div>\n                    </a>\n                    </div>\n                                            <div>\n                            <p>\n    Oct 1, 2025\n                            <span>\n                    at\n    8:22 pm ET</span>\n                        <span>\n                •\n            </span>\n            <span>7 min read\n            </span>\n        </p>\n    </div>\n</div>\n            </div>\n    <div>\n    <div>\n    <figure><img alt=\"power-rankings-soccer-ucl-template-1-2.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/c4c44956-a7b0-4482-809a-c1801c08463d/thumbnail/770x433/526722a1c169f5a7269191dc38894c0d/power-rankings-soccer-ucl-template-1-2.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>Two matchdays into Champions League play, only six teams remain on a perfect six points from two matches the usual suspects of <span>Bayern Munich</span>, <span>Real Madrid</span>, <span>Paris</span> Saint-Germain, <span>Inter</span> Mila, <span>Arsenal</span>, and... <span>Qarabag</span>. That's right the champions of Azerbaijan went from picking up the first Champions League victory in their history to now being on the path to passage to the top 24. Meanwhile, <span>Eric Dier</span> converted a penalty for <span>Monaco</span> to take points off of Manchester City, while <span>Luis Enrique</span> marched into <span>Barcelona</span> with a front three who had an average age of 19 and left with a win.</p>\n<p>There's a long way to go in the league phase, but some of the top teams are beginning to <span>show</span> why they're so high in the Champions League power rankings. Let's take a look at how the action shook things up.</p><table><tbody><tr><th>Rank</th><th>Team</th><th>Change</th><th>Analysis</th></tr><tr><td>1</td><td>Paris Saint-Germain</td><td>--</td><td>Luis Enrique has every tool in the book at his disposal. Not having his stars in attack wouldn't slow the Parisians down as <span>Nuno Mendes</span> and <span>Achraf Hakimi</span> kept Barcelona's attack quiet. </td></tr><tr><td>2</td><td>Real Madrid</td><td>--</td><td>Taking a long trip away from home, <span>Kylian Mbappe</span> returned with a hat trick and Madrid returned with all three points. This isn't a match where you'll learn much about Madrid but that doesn't mean that it's not a job well done.</td></tr><tr><td>3</td><td>Arsenal</td><td>--</td><td>So effective it's almost boring. There was a scare during which it seemed like Olympiacos would score but Arsenal responded by getting an insurance goal for an eventual 2-0 victory. </td></tr><tr><td>4</td><td>Bayern Munich</td><td>+2</td><td><span>Harry Kane</span> continues his torrid scoring streak as he's now up to 20 goals in only 14 appearances in all competitions. It may not be sustainable but he's a man on a mission and it's pulling Bayern to strong results.</td></tr><tr><td>5</td><td>Inter</td><td>+3</td><td>Don't let Lautaro Martinez get hot. WIth a brace and an Inter clean sheet, there may be a new manager in town in <span>Cristian</span> Chivu, but it's clear that Inter are Champions League contenders.</td></tr><tr><td>6</td><td>Barcelona</td><td>-1</td><td>Live by the high line and die by the high line. Without <span>Raphinha</span>, the attack lacked it's normal dynamism and Barcelona struggled to create chances. <span>Lamine Yamal</span> doesn't seem to be at 100% fitness which is concerning. </td></tr><tr><td>7</td><td><span>Liverpool</span></td><td>-2</td><td>It's tough to figure out what Liverpool's best XI is and that imbalance reared its head in Turkiye. This is a team that will advance with ease from the league phase but there are concerns looming when they face tougher challenges.</td></tr><tr><td>8</td><td><span>Napoli</span></td><td>+2</td><td>The Manchester connection is strong in the side with <span>Kevin De Bruyne</span> assisting <span>Rasmus Hojlund</span> twice to defeat <span>Sporting CP</span>. Antonio Conte has done it again in getting the best out of a former <span>Manchester United</span> player. </td></tr><tr><td>9</td><td><span>Chelsea</span></td><td>--</td><td>Another match, another red card, but this time the Blues were able to hold on for a victory facing <span>Benfica</span>. Without <span>Joao Pedro</span> and Liam Delap for their next match, Enzo Maresca will have questions on how he will manage his XI moving forward.</td></tr><tr><td>10</td><td>Manchester City</td><td>-3</td><td>Blips happen. Manchester City controlled things for the entire match but conceding a late penalty to Monaco, they were unable to hold on for a victory, but at least it wasn't a loss. </td></tr><tr><td>11</td><td>Marseille</td><td>+1</td><td>It was clear that this team are a threat after they went toe to to with Real Madrid and they further displayed that fact by running circles around Ajax. Roberto De Zerbi has a strong side on his hands.</td></tr><tr><td>12</td><td><span>Borussia Dortmund</span></td><td>+1</td><td>It was a very un-Dortmund like performance in a good way as they took care of business.</td></tr><tr><td>13</td><td><span>Atletico Madrid</span></td><td>+3</td><td>The momentum from the Madrid derby may have kick started Atletico's season with the club scoring five goals in back-to-back matches. <span>Antoine Griezmann</span> also scored his 200th goal for the club in what is a monumental moment.</td></tr><tr><td>14</td><td><span>Galatasaray</span></td><td>+10</td><td>Massive, massive result at Rams Park. Knocking off Liverpool is always something to hang your hat on even if it took a penalty to get there. It's hard to know what you'll get from Galatasaray from match to match but they'll be a tough out in this competition.</td></tr><tr><td>15</td><td>Juventus</td><td>-1</td><td>Juventus are a good team but Juventus are also their worst enemy. If they can't figure out how to change that sooner than later, it'll be a long season.</td></tr><tr><td>16</td><td>Tottenham</td><td>-5</td><td>Thomas Frank's men are getting results that they don't deserve which is a credit to them, but this is a second Champions League match where they were second best. With four points through two games, things are fine, but if they don't turn around quickly, Tottenham will drop down the table when their opposition gets tougher in coming matches.</td></tr><tr><td>17</td><td>Newcastle United</td><td>+9</td><td>A trip to <span>Belgium</span> is what the doctor ordered. A team won't concede two penalties every match but if they do, it's good to take them. Newcastle's defense has been solid this season, so it's good for something to go their way in the attack when they needed it most.</td></tr><tr><td>18</td><td>Qarabag</td><td>+3</td><td>If you said this club would have six points through their first three matches, I wouldn't have believed you but that's why soccer is amazing. There's more work to do but what a start.</td></tr><tr><td>19</td><td><span>Atalanta</span></td><td>+6</td><td>Taking care of business at home is all that matters, even if Atalanta left it late. To make it out, they have to defeat teams like Brugge in this competition, so job well done.</td></tr><tr><td>20</td><td><span>Club Brugge</span></td><td>-5</td><td>Losing away from home won't be the end of the world for Brugge but dropping leads late is never something that's easy to stomach. A lot of teams will be jostling for a position in the top 24 and losses like this one sting in that journey.</td></tr><tr><td>21</td><td><span>Eintracht Frankfurt</span></td><td>-3</td><td>Following up a strong opening day with an absolute humbling away to Atletico Madrid, it will be important to have a short memory because things won't get any easier.</td></tr><tr><td>22</td><td>Sporting Club <span>Portugal</span></td><td>-3</td><td>There was a lot to like about Sporting hanging around to push Napoli but it shows how much this club have lost over the years. They're figuring it out though and it'll lead to competitive performances facing everyone.</td></tr><tr><td>23</td><td><span>Athletic Club</span></td><td>-6</td><td>Now failing to win in five matches in all competitions this season, Athletic Club may have preferred to not be in Champions League play. Their season seems just about over before it can get started.</td></tr><tr><td>24</td><td><span>Union Saint-Gilloise</span></td><td>-4</td><td>You can't allow four goals to Newcastle United as an underdog who wants to compete at this level. They had a chance to give themselves wiggle room to advance and were unable to take it.  </td></tr><tr><td>25</td><td><span>Villarreal</span></td><td>+3</td><td>Did well to stay in the match against Juventus. Getting Georges Mikautadze going will be critical to anything that they do, so it's good to get the first goal out of the way.</td></tr><tr><td>26</td><td>Monaco</td><td>+4</td><td>It pays to be close enough that a penalty can give Monaco a point facing Manchester City, but it wasn't a particularly strong performance.</td></tr><tr><td>27</td><td>Benfica</td><td>--</td><td>Jose Mourinho may be back but it wasn't enough to push Benfica to their first points in the league phase upon his return to Stamford Bridge. Benfica will need to collect points sooner than later.</td></tr><tr><td>28</td><td><span>Bayer Leverkusen</span></td><td>-6</td><td>Still trying to figure things out, Leverkusen can't drop matches like this at home. This is a club in transition and it shows.</td></tr><tr><td>29</td><td>Copenhagen</td><td>-6</td><td>This was there for the taking. Injuries hurt things early but Copenhagen have a tough draw and could slip further down the table quickly.</td></tr><tr><td>30</td><td>Bodo/Glimt</td><td>-1</td><td>Can this team put together two halves of soccer? In their opening match, it was the first half that got Bodo/Glimt. Here, it was the second half where they allowed Tottenham to take a point from a two-goal deficit.</td></tr><tr><td>31</td><td>PSV</td><td>+2</td><td>Picking up a point away to Bayer Leverkusen is a step in the right direction but that needs to become a full three points quickly.</td></tr><tr><td>32</td><td><span>Slavia Praha</span></td><td>-1</td><td>Facing Inter at home is a tough go for anyone. On to the next match.</td></tr><tr><td>33</td><td>Ajax</td><td>-2</td><td>It has been quite a fall from Ajax. Marseille are a strong side but being behind by three goals at half is a moment to forget in what is already looking like a swift trip out of UCL play for the Dutch side.</td></tr><tr><td>34</td><td>Olympiacos</td><td>+1</td><td>They had chances against Arsenal but the Greek side should've conceded more goals but they'll get a point off of someone eventually.</td></tr><tr><td>35</td><td><span>Pafos</span></td><td>-1</td><td>Scoring your first Champions League goal in history will go a long way to getting over Bayern Munich scoring for fun in your home stadium.</td></tr><tr><td>36</td><td><span>Kairat</span></td><td>--</td><td>It was a valiant first half only holding Real Madrid to one goal, then the wheels fell off.</td></tr></tbody></table>\n            </div>\n    </div>\n</article>\n        </div>\n                        </div>"
  },
  {
    "title": "West Virginia QB Nicco Marchiol not expected to play for Mountaineers again this season - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/college-football/news/west-virginia-qb-nicco-marchiol-not-expected-to-play-for-mountaineers-again-this-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/cbc189e2-2446-4761-bb5f-c55e15c166a5/thumbnail/1200x675/87d1e491918d1a48dfe41ea33665d379/roccowvu.jpg",
    "tag": "Sports",
    "date": "2025-10-01T22:38:19.000Z",
    "description": "Nicco Marchiol's 2025 season has likely come to an end. The West Virginia quarterback is not expected to suit up again for the Mountaineers this season, according to CBS Sports' Richard Johnson. Marchiol...",
    "body": "<div>\n        <p><a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/28874315/nicco-marchiol/\">Nicco Marchiol's</a> 2025 season has likely come to an end. The <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/WVU/west-virginia-mountaineers/\">West Virginia</a> quarterback is not expected to suit up again for the Mountaineers this season, according to CBS Sports' Richard Johnson. Marchiol started the first four games of the season but missed last Saturday's loss to Utah with a foot injury. He is already listed as out for Friday night's road matchup with No. 23 <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BYU/byu-cougars/\">BYU</a>. </p><p>Marchiol is expected to pursue a medical redshirt and enter the transfer portal after the season, <a href=\"https://www.on3.com/news/west-virginia-mountaineers-qb-nicco-marchiol-expected-to-medically-redshirt/\" target=\"_blank\">according to On3</a>.</p><p>A former four-star recruit who has spent his entire college career at West Virginia, Marchiol helped lead West Virginia to a 2-1 start that included a comeback win over rival <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/PITT/pittsburgh-panthers/\">Pittsburgh</a> in the Backyard Brawl. But following a loss the following week against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/KANSAS/kansas-jayhawks/\">Kansas</a>, Marchiol informed coach Rich Rodriguez that he has been dealing with a lingering mid-foot injury. </p><p>Marchiol, a redshirt junior, missed the following week's game against <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/UTAH/utah-utes/\">Utah</a> while seeing a specialist in <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/COLO/colorado-buffaloes/\">Colorado</a>. Rodriguez said Monday on his radio show that Marchiol was with family in <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/ARIZ/arizona-wildcats/\">Arizona</a> getting more opinions regarding his injury and would miss \"a couple weeks.\"</p>\n<p>\"What I told him is we've got great doctors and trainers, so I want our doctors and trainers to communicate with his doctors so they get on the same page and know exactly what it is,\" <a href=\"https://247sports.com/college/west-virginia/article/rich-rodriguez-gives-a-key-update-on-nicco-marchiol-254834228/\" target=\"_blank\">Rodriguez said</a>. \"He's definitely out in the short-term, and then once their doctors talk to our doctors and trainers, we can figure out how long it's going to be, I guess.\"</p><a href=\"https://www.cbssports.com/college-football/news/college-football-qb-power-rankings-ole-miss-trinidad-chambliss-vanderbilts-diego-pavia-on-the-rise/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>College Football QB Power Rankings: Ole Miss' Trinidad Chambliss, Vanderbilt's Diego Pavia on the rise</p>\n                <p>\n                    David Cobb                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"College Football QB Power Rankings: Ole Miss' Trinidad Chambliss, Vanderbilt's Diego Pavia on the rise\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/30/0bfacf0b-d7ba-462c-8dd5-cdefb2161729/thumbnail/270x152/58ffa11a89044069745967c96c1a8628/pavia-qb-power-rankings-copy.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Marchiol redshirted his first year at West Virginia and then spent the past two seasons as the primary backup to Garrett Greene. He opted to stick with the program when Neal <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/BRO/brown-bears/\">Brown</a> was fired and Rodriguez was brought back to Morgantown. If he is granted a medical redshirt for this season, Marchiol will have two years of eligibility remaining. </p><p>In 23 games (seven starts), Marchiol has thrown for 1,462 yards, 10 touchdowns and four interceptions while completing 62.3% of his attempts. He's also rushed for 341 yards and four scores. </p>\n<h2>What's next for West Virginia at quarterback?</h2><p>With Marchiol out of the picture, the Mountaineers will have to find a new solution at quarterback. <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/26694793/jaylen-henderson/\">Jaylen Henderson</a>, who previously played at <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/FRESNO/fresno-state-bulldogs/\">Fresno State</a> and <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/teams/TXAM/texas-am-aggies/\">Texas A&M</a>, started against Utah before being removed for redshirt freshman <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29422157/khalil-wilkins/\">Khalil Wilkins</a>. Wilkins led West Virginia on two scoring drives that included his 39-yard touchdown pass to <a target=\"_blank\" href=\"https://www.cbssports.com/college-football/players/29130040/cam-vaughn/\">Cam Vaughn</a> that got the Mountaineers on the board in the 48-14 home loss to the Utes. </p><p>\"We're looking and searching for everything we can to help us,\" <a href=\"https://www.heraldextra.com/sports/byu/2025/oct/01/west-virginia-quarterback-carousel-spinning-before-trip-to-byu/\" target=\"_blank\">Rodriguez said</a> while alluding to his quarterback situation. \"Khalil has got some big, explosive type of ability. I think his upside and his future looks really good.\"</p><p>The loss to Utah dropped West Virginia to 2-3 on the season. The Mountaineers have been outscored 89-24 in their two Big 12 losses. After the BYU game, WVU has a bye week before continuing conference play.</p>\n            </div>"
  },
  {
    "title": "Thierry Henry calls on FIFA, UEFA to have 'educational discussion' with players about fixture congestion - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/soccer/news/thierry-henry-calls-on-fifa-uefa-to-have-educational-discussion-with-players-about-fixture-congestion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/d2514dc4-5ac5-409c-806a-147fbfe05beb/thumbnail/1200x675/c31a492cb73bf9f2365c92408c1ded4a/untitled-design-2025-10-01t225838-315.png",
    "tag": "Sports",
    "date": "2025-10-01T20:59:59.000Z",
    "description": "Thierry Henry has called upon FIFA and UEFA to have a serious conversation with current players to find a solution on fixture congestion, which continues to cause concerns about player welfare.The increased...",
    "body": "<div>\n        <p>Thierry Henry has called upon FIFA and UEFA to have a serious conversation with current players to find a solution on fixture congestion, which continues to cause concerns about player welfare.</p><p>The increased number of competitive games in recent years means some players take part in as many as 60 or 70 games a season, which not only hampers players' ability to compete during the club season but can impact their performances with their national teams during major competitions. Henry said he did not play as many games as players do now but even he dealt with the wear and tear of a long season during his playing career.</p><p>\"I've been in that situation, maybe not the number [of games] that those guys are reaching right now. I used to arrive in tournaments dead – mentally, physically,\" Henry said said during the UEFA Champions League Today pre-match show on Wednesday. \"2002 [World Cup], I arrived injured. [Euro] 2004, I arrived injured. [Euro] 2008, I arrived injured. I just arrived there to play. I couldn't prepare. You don't prepare [for] a competition. Normally, you should prepare [for] a competition like that to be able to perform at the highest level – not only me, a lot of players.\"</p>\n<p>The CBS Sports analyst argued that the modern realities of the game, though, mean that retired players can only offer so much help in finding a solution.</p>\n<p>\"For me, it's pretty simple,\" he said. \"It's not about complaining and it's not about saying players earn too much money or debating. It's about having an educational discussion with the players' union – a proper one, not with the ex-players. Don't call me, UEFA. Do not call me, FIFA. I'm not playing anymore. I don't know how it feels anymore. I know how it felt, I don't know how it feels anymore so speak to [Virgil] van Dijk, speak to Mo Salah. … Sit with <em>them</em>. Have a discussion with <em>them</em>. They are the actors right now.\"</p><p>Fellow analyst Jamie Carragher agreed with Henry, especially since governing bodies continue to tease adding more games to the calendar. <a target=\"_blank\" href=\"https://www.cbssports.com/soccer/news/world-cup-with-64-teams-fifa-not-considering-expanding-2030-event-further-despite-proposal-per-report/\">CONMEBOL formally pitched a 64 team World Cup in 2030</a> to FIFA last week, though FIFA is not considering the idea. The idea of a World Cup or a Club World Cup every two years has also been proposed, though those pitches have never been formalized.</p><p>\"This is not getting scaled back no matter what we say and Thierry's right and it maybe would have to come to a situation where the greatest players in the world come together and say enough is enough and to refuse to play,\" Carragher said.</p>\n<p>Both Henry and Carragher singled out the UEFA Nations League, the first iteration of which began in September 2018, and FIFA's new-look Club World Cup, which took place in the U.S. last summer, as competitions that only accentuate the problem.</p><p>\"UEFA adding the Nations League – it wasn't needed,\" Carrager said. \"FIFA adding the Club World Cup was not needed. Nobody is out there asking for those competitions. They're just providing them to make more money and that's it. We know why there is more games.\"</p><p>Henry added that he barely watched the Club World Cup.</p><p>\"As a fan, I'm tired,\" he said. \"I did not watch the Club World Cup. I had to do something in the final. I left [at] halftime. … It's too much. I love my family and at [some] point, I need a break or so. I love football but who watched it? Come on. Too much is too much, and I love it but let's all be honest – too much is too much.\"</p>\n<p>Henry also argued that the growing number of official competitions comes at a financial cost to fans.</p><p>\"How deep is your pocket now as a fan?,\" he said. \"How deep is your pocket now if you go to the Nations League, to go to the Champions League, to go to the two cup [competitions] you have in England and to buy the shirts?\"</p><p>The World Cup winner also called upon the current group of players \" to be strong and to be vocal about it\" in the hopes of fostering meaningful change.</p>\n<p>\"We don't have the power to change it as ex-players and we're not sitting in the position to take decisions so we can be talking here for the whole day bringing great solutions – great – and have great ideas,\" Henry said. \"The only people that can change their destiny is the players themselves.\"</p>\n            </div>"
  },
  {
    "title": "Thursday Night Football prop picks for Rams vs. 49ers - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-49ers-nfl-player-prop-picks-thursday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/01/14/df801423-99b1-43d9-8b05-01e26b407689/thumbnail/1200x675/203ce18409f767d137ccc6920ea031ae/matthew-stafford-rams-vs-eagles-cbs-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-10-01T21:10:25.000Z",
    "description": "A pair of 3-1 NFC West rivals will kick off Week 5 as the Los Angeles Rams host the San Francisco 49ers on 'Thursday Night Football.' NFL player props figure to center on big names like Matthew Stafford,...",
    "body": "<div>\n        <p>A pair of 3-1 NFC West rivals will kick off Week 5 as the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAR/los-angeles-rams/\">Los Angeles Rams</a> host the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SF/san-francisco-49ers/\">San Francisco 49ers</a> on 'Thursday Night Football.' NFL player props figure to center on big names like Matthew Stafford, Christian McCaffrey, Kyren Williams and Puka Nacua, but you may be able to find value with NFL prop lines for under-the-radar players. Brian Robinson Jr. has had a consistent role as McCaffrey's backup with at least 20 rushing yards in each game. His Thursday Night Football props for rushing have a bar of just 16.5, with NFL prop odds of -114 for the Over.</p><p>With the Rams' defense second in the league with 14 sacks -- and with San Fran ruling out Brock Purdy (toe) and some key receivers -- the Niners may lean more on the run on TNF. McCaffrey leads the NFL in touches (100), and given the short week, San Francisco may call upon Robinson more than usual, making his NFL prop bet one to consider. Before betting any 49ers vs. Rams props for Thursday Night Football, <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251002_SF@LAR/prop-picks/#ttag=09302025_agg_cbssports_picks_football_nfl_AImodel_Rams49ersAIprops\" target=\"_blank\">you need to see the Rams vs. 49ers prop predictions powered by SportsLine's Machine Learning AI</a>.</p><p><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=draftkings&c=sport\" target=\"_blank\"><em>You can make NFL prop picks at DraftKings, where you can get $200 in bonus bets if your initial $5 wager wins</em></a><em>. </em></p><p>Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. </p><p>For 49ers vs. Rams <span><a href=\"https://www.cbssports.com/betting/news/nfl/\" target=\"_blank\">NFL betting</a></span> on Thursday Night Football, the Machine Learning Model  has evaluated the NFL player prop odds and provided Rams vs. 49ers prop picks. <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251002_SF@LAR/prop-picks/#ttag=09302025_agg_cbssports_picks_football_nfl_AImodel_Rams49ersAIprops\" target=\"_blank\">You can only see the Machine Learning Model player prop predictions for San Francisco vs. Los Angeles here</a>.</p><h2>Top NFL player prop bets for 49ers vs. Rams</h2><p>After analyzing the Rams vs. 49ers props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Rams QB Stafford goes Over 232.5 passing yards (-114 at <a target=\"_blank\" href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\">FanDuel</a>). Stafford is averaging 278.5 passing yards on the season as he ranks second in passing yards entering Week 5. He's had at least 245 yards in three of four starts, in addition to having at least 243 passing yards in six of his last seven home starts dating back to last year's regular season.</p><p>Stafford should have little deterrence from San Fran's defense, as the Niners' current 11-game streak without an interception is tied for the longest by any NFL team since 1940. With Nick Bosa (knee) out for the year, the 49ers had zero sacks last week, and a lack of pass rush will allow wideouts like Nacua and Davante Adams to run free in the secondary. The model projects Stafford to have 279 passing yards, giving this prop bet a 4.5-star rating. <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251002_SF@LAR/prop-picks/#ttag=09302025_agg_cbssports_picks_football_nfl_AImodel_Rams49ersAIprops\" target=\"_blank\">See more NFL props here</a>.</p><p><em>New users can also target the </em><span><a href=\"https://www.cbssports.com/betting/news/fanduel-promo-code/\" target=\"_blank\"><em>FanDuel promo code</em></a></span><em>, which offers </em><a href=\"https://martech.cbssports.com/bt/redirect/prod?b=fanduel&c=sport\" target=\"_blank\"><em>new users $300 in bonus bets if their first $5 bet wins</em></a><em>:</em></p><h2>How to make NFL player prop bets for Rams vs. 49ers</h2><p>In addition, the SportsLine Machine Learning Model   says another star sails past his total and has nine additional NFL props that are rated four stars or better. <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251002_SF@LAR/prop-picks/#ttag=09302025_agg_cbssports_picks_football_nfl_AImodel_Rams49ersAIprops\" target=\"_blank\">You need to see the Machine Learning Model analysis before making any 49ers vs. Rams prop bets for Thursday Night Football</a>.</p><p><strong>Which Rams vs. 49ers prop bets should you target for Thursday Night Football? <a href=\"https://www.sportsline.com/nfl/game-forecast/NFL_20251002_SF@LAR/prop-picks/#ttag=09302025_agg_cbssports_picks_football_nfl_AImodel_Rams49ersAIprops\" target=\"_blank\">Visit SportsLine now to see the top 49ers vs. Rams props, all from the SportsLine Machine Learning Model</a>.</strong></p>\n            </div>"
  },
  {
    "title": "UFC 320: Alex Pereira gets his chance at redemption after rare humbling loss against Magomed Ankalaev - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-320-alex-pereira-gets-his-chance-at-redemption-after-rare-humbling-loss-against-magomed-ankalaev/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/708592ee-b8e1-443c-ae13-300a57f2abc9/thumbnail/1200x675/5df12010b11f51ba718a1ce703cc453b/pereira-yell-ufc-313.jpg",
    "tag": "Sports",
    "date": "2025-10-01T22:34:21.000Z",
    "description": "In a span of less than four years, Alex Pereira has authored one of the most unique and impressive UFC runs in the 32-year history of the promotion after he transitioned to MMA following a Hall-of-Fame career...",
    "body": "<div>\n        <p>In a span of less than four years, Alex Pereira has authored one of the most unique and impressive UFC runs in the 32-year history of the promotion after he transitioned to MMA following a Hall-of-Fame career as a two-division GLORY kickboxing champion. </p><p>While many of his predecessors struggled with the time it takes to adapt to a new sport or the painstaking hours necessary to evolve one's skillset to elite level, Pereira has made it seem like nothing is impossible and all of the limitations that apply to others have nothing at all to do with him. </p><p>The Brazilian slugger is 9-2 in the Octagon with seven victories via knockout. Pereira has won titles in two divisions, has fought in title bouts for nine of his 11 UFC appearances and holds a promotional record with three title defenses in just a 175-day span in 2024, which saw him claim fighter of the year. </p><p>Despite that meteoric run to global stardom, however, for the fighter who, only seven months ago was considered the face of the UFC despite not speaking English, Pereira (12-3) was noticeably humbled by a lackluster performance in March at UFC 313 (in a particularly lackluster headlining bout) when \"Poatan\" <a href=\"https://www.cbssports.com/mma/news/ufc-313-results-highlights-magomed-ankalaev-upsets-alex-pereira-to-claim-light-heavyweight-title/live/\" target=\"_blank\">lost his light heavyweight title via unanimous decision</a> to Magomed Ankalaev (20-1-1, 1 NC).</p>\n<p>While Pereira deserved credit for bucking the pre-fight narrative that Ankalaev, a native of Dagestan, Russia, was going to dominantly wrestle him for five rounds by stuffing all 12 takedown attempts, he was outgunned on the feet by his more technical foe in a performance that took a good deal of air out of his legendary balloon. </p><p>As the top two 205-pound fighters in the world prepare for an immediate rematch on Saturday, in the main event of a <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-fight-card-date-odds-rumors-location-complete-guide/\" target=\"_blank\">UFC 320 pay-per-view card</a></span> from T-Mobile Arena in Las Vegas, the question suddenly becomes whether Pereira can right the wrong of his first defeat at light heavyweight by taking back his title or whether the 38-year-old has truly begun his descent from his prior pound-for-pound elite status.</p><p>One of the interesting fight-week narratives to evolve happened when Pereira admitted to CBS Sports that <span><a href=\"https://www.cbssports.com/mma/news/alex-pereira-reveals-he-was-at-just-40-in-title-loss-to-magomed-anakalev-surprised-i-was-able-to-fight/\" target=\"_blank\">he was only 40% of his normal self</a></span> in the first Ankalaev fight. It's a narrative that makes sense considering Pereira's history of accepting fights on short notice and fighting hurt, which is a gamble that eventually catch up with anyone.</p>\n<a href=\"https://www.cbssports.com/mma/news/ufc-320-fight-card-jiri-prochazka-vs-khalil-rountree-jr-among-best-undercard-fights-to-watch/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>UFC 320 fight card: Jiri Prochazka vs. Khalil Rountree Jr. among best undercard fights to watch</p>\n                <p>\n                    Shakiel Mahjouri                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"UFC 320 fight card: Jiri Prochazka vs. Khalil Rountree Jr. among best undercard fights to watch\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/26/9c2e6920-8bc1-49f7-926d-517ab877bc12/thumbnail/270x152/be7cd786c9a2824940c44c89c3ad3862/jiri-prochazka-ufc-mma.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>The proud Pereria wouldn't go as far as confirming the report after UFC 313 that he battled both norovirus and a broken hand entering the first Ankalaev fight, but it's an excuse that loses some fuel when one finds out that Ankalaev, a devout Muslim, also went through training camp fully compromised while observing Ramadan. </p><p>\"[Dealing with the loss] is not cool but, then again, if I put together everything that was going on with me -- and I'm not going to say it right now -- it made me happy I was even able to fight,\" Pereira said. \"I'm not going to talk about anything like that. Of course, I'm not happy that I lost but knowing my potential and the way that I fought, I'm actually even surprised I was able to fight.\"</p><p>It's also possible that Pereira's star turn caught up with him, as well, considering the amount of UFC promotional travel he undertook during training camp alone ahead of the first fight, which was something noted by Pereira's lead trainer, former 205-pound champion Glover Teixeira, during the fliming of \"UFC Countdown\" when the Brazilian legend noted just how much they devoted this camp to cardio and keeping Pereira in one place at their Connecticut gym. </p>\n<p>If one is looking even further for evidence as to just how serious Pereira is taking his pursuit of recapturing his title, the normally mild-mannered and stoic fighter (who is known for his catchphrase \"Chama\") looked visibly irriated during multiple run-ins with Ankalaev at the UFC Performance Institute in Las Vegas last week. Pereira accused Ankalaev of hiding from him, to which the new champion called him a liar as their multiple interactions were caught on camera.</p><p>\"For me, it makes no difference [having beef with an opponent],\" Pereira said. \"I'm always cool, I'm normal. [Ankalaev] is the one that seemed nervous and scared. He is the one that seemed to be affected more by it.\"</p><p>Another topic of contention between the fighters has surrounded Ankalaev's inability to take Pereira down in the first meeting. Ankalaev claims that was due to him not having the energy to do so after training during Ramadan (not to mention his accusation that Pereira was extra \"greasy\" during the fight) while Pereira came up with a different theory. </p>\n<p>\"For me, [the grease accusations] are no problem. I'm cool,\" Pereira said. \"I think [Ankalaev] doesn't like it because I was able to prove that he's not that good. I'm a striker and he's a grappler. He's supposed to be taking me down but I was showing that he's not that great.\"</p><p>Entering the rematch there remains some speculation as to whether Pereira can continue to make 205 pounds, which could mean Saturday ends up being his final bout at light heavyweight regardless of whether he wins or loses. That theory matches up with Pereira's previously stated goals of one day moving up to heavyweight in an attempt to become the first UFC fighter to claim titles in three different divisions. </p>\n<p>Pereira, however, wouldn't quite confirm that a move above 205 pounds was imminent. </p>\n<p>\"When I joined the UFC in the middleweight division, my focus was to be a champion,\" Pereira said. \"Then, my body [changed] and I realized that I had to go up. When I went to light heavyweight, my focus was to be a champion. If my body tells me that I have to go up to heavyweight or to fight a heavyweight, my focus is also to be a champion.\" </p><p>With Pereira vowing the rematch against Ankalaev will be different, one has to wonder whether that means he takes the lead in terms of striking after spending most of the first fight on his backfoot fighting off the steady pressure of Ankalaev. </p><p>Either way, it's clear just how much Pereira is aware of the importance in winning this rematch to his overall resume as one of the shortest (he didn't make his Octagon debut until age 34) and successful runs that any UFC fighter has ever authored.</p>\n<p>\"For sure, it's going to be great for my story and for everything that I have built,\" Pereira said. \"I have had this fast career in the UFC and I have been able to achieve a lot, like the [2022 middleweight title knockout] of [Israel] Adesanya. Against him I won the belt and then I lost the belt. Then [I moved up] and I won the [light heavyweight] belt so winning the belt again is going to be great for my story.</p><p>\"Sometimes yes, [I'm able to think about everything I've accomplished] and sometimes no. I know that I accomplished something that is really hard for other people to achieve. Some people don't. It's kind of hard to understand sometimes.\"</p>\n            </div>"
  },
  {
    "title": "MLB playoffs 2025: Postseason bracket, schedule and results - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/0a75924d-9bff-4f20-9e88-ec56cd27bc33/thumbnail/1200x675/db2f9e042a3ad2d351a1f450d49509f0/2025-mlb-bracket-final.jpg",
    "tag": "Sports",
    "date": "2025-10-02T01:08:41.000Z",
    "description": "October is here, and the 2025 MLB playoffs are underway. The 12-team bracket is set, and the postseason got started on Tuesday with four Wild Card Series Games: Guardians vs. Tigers, Cubs vs. Padres, Yankees...",
    "body": "<div>\n        <p>October is here, and the 2025 MLB playoffs are underway. The 12-team bracket is set, and the postseason got started on Tuesday with <span><a href=\"https://www.cbssports.com/mlb/news/2025-mlb-playoffs-predictions-picks-wild-card-series-yankees-red-sox-cubs-padres/\" target=\"_blank\">four Wild Card Series Games</a></span>: Guardians vs. Tigers, Cubs vs. Padres, Yankees vs. Red Sox and Dodgers vs. Padres. <a href=\"https://www.cbssports.com/mlb/news/mlb-playoffs-2025-wild-card-game-1-live-updates-scores-results/live/\" target=\"_blank\">The Tigers, Cubs, Red Sox and Dodgers were all Game 1 winners</a>, meaning the Guardians, Padres, Yankees and Reds were <a href=\"https://www.cbssports.com/mlb/news/mlb-playoffs-2025-wild-card-game-2-live-updates-scores-results/live/\" target=\"_blank\">facing elimination on Wednesday</a>. The Blue Jays, Mariners, Brewers and Phillies all earned byes and will start their postseasons on Saturday in the League Division Series.</p><p>For the first time under the current playoff format, we'll see at least three Game 3s on Thursday. Cleveland beat Detroit 6-1 on Wednesday to force a do-or-die game between the AL Central rivals. The Padres then did the same against the Cubs, while the Yankees outdueled the Red Sox and sent their AL East matchup to Game 3 as well.</p><p>On Tuesday, The Tigers began the day with a low-scoring win over the Guardians as Tarik Skubal struck out 14 batters in 7 ⅔ innings. The Cubs got back-to-back homers from Seiya Suzuki and Carson Kelly and 4 ⅔ perfect innings from their bullpen to pull away from the Padres. The Red Sox got a dominant outing from Garrett Crochet and Aroldis Chapman worked out of a bases-loaded ninth-inning jam to push their rival Yankees to the brink of elimination. The Dodgers-Reds game saw the most offense of the day but even a bullpen meltdown wasn't enough to keep Los Angeles from winning.</p><p>The best-of-three Wild Card Series are being held from Tuesday to Thursday, and the LDS round will kick off on Saturday.</p>\n<p>Below is a look at the full 2025 <a target=\"_blank\" href=\"https://cbssports.com/mlb/\">MLB</a> playoff bracket.</p><h2>2025 MLB playoff bracket</h2><figure><p><img alt=\"2025-mlb-bracket-final.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/c8ba0b66-3f1d-44c7-aab9-c4637d9bd23e/resize/670x377/8e7cd4ea4be8232f74f9a61ed5b972e6/2025-mlb-bracket-final.jpg\" /></p><figcaption><span>\n                                                                    Keytron Jordan, CBS Sports\n                                                            </span></figcaption></figure><h2>2025 MLB playoff schedule, TV channel</h2><p><em>All games on ESPN, ABC, Fox and FS1 are streaming on </em><a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\"><em>fubo</em></a><em> (Try for free). All times Eastern.<br />* = if needed</em></p><h3>Wild Card Series</h3><p><strong>Tuesday, Sept. 30</strong><br />AL Wild Card Series Game 1: Tigers 2, Guardians 1 (Detroit leads 1-0)<br />NL Wild Card Series Game 1: Cubs 3, Padres 1 (Chicago leads 1-0)<br />AL Wild Card Series Game 1: Red Sox 3, Yankees 1 (Boston leads 1-0)<br />NL Wild Card Series Game 1: Dodgers 10, Reds 5 (L.A. leads 1-0)</p><p><strong>Wednesday, Oct. 1</strong><br />AL Wild Card Series Game 2: Guardians 6, Tigers 1 (Series tied 1-1)<br />NL Wild Card Series Game 2: Padres 3, Cubs 0 (Series tied 1-1)<br />AL Wild Card Series Game 2: Yankees 4, Red Sox 3 (Series tied 1-1)<br />NL Wild Card Series Game 2: Dodgers vs. Reds, 9:08 p.m. | ESPN/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></p>\n<p><strong>Thursday, Oct. 2</strong><br />AL Wild Card Series Game 3: Guardians vs. Tigers, 1:08 p.m. | ESPN/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a><br />NL Wild Card Series Game 3: Cubs vs. Padres, 3:08 p.m. | ABC/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a><br />AL Wild Card Series Game 3: Yankees vs. Red Sox, 6:07 p.m. | ESPN/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a><br />NL Wild Card Series Game 3*</p><h3>Division Series<br /></h3><p><strong>Saturday, Oct. 4<br /></strong>ALDS Game 1: Blue Jays vs. Yankees/Red Sox, 1:08 or 4:08 p.m. | Fox or FS1/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a><br />NLDS Game 1: Brewers vs. Cubs/Padres, 2:08 or 9:08 p.m. | TBS<br />NLDS Game 1: Phillies vs. Dodgers/Reds, 6:08 or 6:38 p.m. | TBS<br />ALDS Game 1: Mariners vs. Guardians/Tigers, 4:08 or 8:38 p.m. | FS1 or Fox/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></p><p><strong>Sunday, Oct. 5</strong><br />ALDS Game 2: Blue Jays vs. Yankees/Red Sox, 4:08 p.m. | FS1/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a><br />ALDS Game 2: Mariners vs. Guardians/Tigers, 8:03 p.m. | FS1/<a href=\"https://www.fubo.tv/welcome/leagues/191273?irad=377812&irmp=416484&sharedid=HTW\" target=\"_blank\">fubo</a></p>\n<p><strong>Monday, Oct. 6</strong><br />NLDS Game 2: Phillies vs. Dodgers/Reds, TBD<br />NLDS Game 2: Brewers vs. Cubs/Padres, TBD</p><p><strong>Tuesday, Oct. 7</strong><br />ALDS Game 3: TBD vs. Blue Jays, TBD<br />ALDS Game 3: TBD vs. Mariners, TBD</p><p><strong>Wednesday, Oct. 8</strong><br />NLDS Game 3: TBD vs. Brewers, TBD<br />NLDS Game 3: TBD vs. Phillies, TBD<br />ALDS Game 4*: TBD vs. Blue Jays, TBD<br />ALDS Game 4*: TBD vs. Mariners, TBD</p>\n<p><strong>Thursday, Oct. 9</strong><br />NLDS Game 4*: TBD vs. Brewers, TBD<br />NLDS Game 4*: TBD vs. Phillies, TBD</p><p><strong>Friday, Oct. 10</strong><br />ALDS Game 5*: Blue Jays vs. TBD, TBD<br />ALDS Game 5*: Mariners vs. TBD, TBD</p><p><strong>Saturday, Oct. 11</strong><br />NLDS Game 5*: Phillies vs. TBD, TBD<br />NLDS Game 5*: Brewers vs. TBD, TBD</p>\n<h3>Championship Series</h3><p><strong>Sunday, Oct. 12</strong><br />ALCS Game 1</p><p><strong>Monday, Oct. 13</strong><br />NLCS Game 1<br />ALCS Game 2</p><p><strong>Tuesday, Oct. 14</strong><br />NLCS Game 2</p><p><strong>Wednesday, Oct. 15</strong><br />ALCS Game 3</p><p><strong>Thursday, Oct. 16</strong><br />NLCS Game 3<br />ALCS Game 4</p><p><strong>Friday, Oct. 17</strong><br />NLCS Game 4<br />ALCS Game 5*</p><p><strong>Saturday, Oct. 18</strong><br />NLCS Game 5*</p><p><strong>Sunday, Oct. 19</strong><br />ALCS Game 6*</p><p><strong>Monday, Oct. 20</strong><br />NLCS Game 6*<br />ALCS Game 7*</p><p><strong>Tuesday, Oct. 21</strong><br />NLCS Game 7*</p><h3>World Series<br /></h3><p><strong>Friday, Oct. 24</strong><br />World Series Game 1</p><p><strong>Saturday, Oct. 25</strong><br />World Series Game 2</p><p><strong>Monday, Oct. 27</strong><br />World Series Game 3</p><p><strong>Tuesday, Oct. 28</strong><br />World Series Game 4</p><p><strong>Wednesday, Oct. 29</strong><br />World Series Game 5*</p><p><strong>Friday, Oct. 31</strong><br />World Series Game 6*</p><p><strong>Saturday, Nov. 1</strong><br />World Series Game 7*</p>\n            </div>"
  },
  {
    "title": "UFC 320 fight card -- Magomed Ankalaev vs. Alex Pereira 2: Five biggest storylines to watch in Las Vegas - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/boxing/news/ufc-320-fight-card-magomed-ankalaev-vs-alex-pereira-2-five-biggest-storylines-to-watch-in-las-vegas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/30/24782568-7d35-41bd-94f7-557d8882e95e/thumbnail/1200x675/f148e57ddd0bca21d4865e14cfe0e397/pereira-ankalaev-313-weighins.jpg",
    "tag": "Sports",
    "date": "2025-10-02T01:30:38.000Z",
    "description": "A must-see light heavyweight title rematch tops the marquee on Saturday in a UFC 320 pay-per-view event from T-Mobile Arena in Las Vegas.Magomed Ankalaev makes the first defense of his 205-pound title in the...",
    "body": "<div>\n        <p>A must-see light heavyweight title rematch tops the marquee on Saturday in a <span><a href=\"https://www.cbssports.com/mma/news/ufc-320-magomed-ankalaev-vs-alex-pereira-2-fight-card-date-odds-rumors-location-complete-guide/\" target=\"_blank\">UFC 320 pay-per-view event</a></span> from T-Mobile Arena in Las Vegas.</p><p>Magomed Ankalaev makes the first defense of his 205-pound title in the main event as he welcomes Alex Pereira in an immediate rematch just six months after Ankalaev scored a <a href=\"https://www.cbssports.com/mma/news/ufc-313-results-highlights-magomed-ankalaev-upsets-alex-pereira-to-claim-light-heavyweight-title/live/\" target=\"_blank\">unanimous decision to take the belt</a>. </p><p>UFC 320's co-main event is a fight fans have wanted for a long time. UFC bantamweight champion Merab Dvalishvili is on a dominant run after beating Sean O'Malley (twice) and Umar Nurmagomedov. Dvalishvili can extend his record for the longest bantamweight win streak by fending off his next challenger. Cory Sandhagen has long been tabbed as a future champion. After repeatedly falling just short of a breakout, \"The Sandman\" finally gets his shot at undisputed gold.</p><p>As we draw closer to the fights this weekend, let's take a closer look at the biggest storylines. </p>\n<h2>1. A refocused and healthy Alex Pereira is a very, very dangerous man</h2><p>Despite the shock of seeing him stuff all 12 takedown attempts by Ankalaev in their UFC 313 title bout, Pereira's decision loss was a decidedly underwhelming performance. Gone was the constant threat of the knockout from the stalking Brazilian slugger as the more technical Ankalaev kept him on the back foot throughout thanks to steady pressure. After the fight, UFC analyst Joe Rogan publicly shared that Pereira had battled both a broken hand and a bout with norovirus, to which the proud Pereira never confirmed nor made excuses about. Fighting hurt and taking big risks with his matchmaking has become Pereira's calling card, including an insane 175-day stretch in 2024 in which he made three title defenses despite battling a number of physical ailments. But when Pereira told CBS Sports last week that <span><a href=\"https://www.cbssports.com/mma/news/alex-pereira-reveals-he-was-at-just-40-in-title-loss-to-magomed-anakalev-surprised-i-was-able-to-fight/\" target=\"_blank\">he was just 40% of himself in the Ankalaev fight</a></span> and was shocked he even made it to the Octagon given everything he endured during training camp, it might be worth taking his word on it. </p><p>Pereira's trainer, former UFC champion Glover Teixeira, <a href=\"https://www.youtube.com/watch?v=G77b3GmlMCI\" target=\"_blank\">mentioned on \"UFC Countdown\"</a> that the training camp for UFC 320 was much different than prior bouts, when Pereira often traveled throughout the build to his title fights to make public appearances. This time, they focused exclusively on rebuilding Pereira's gas tank at age 38 and the always stoic \"Poatan\" has appeared uncharacteristically agitated this time whenever Ankalaev is mentioned, including during a run-in the two had at the UFC Performance Institute last week where Pereira accused his opponent of hiding from him out of fear. An injured and ill Pereira might have been neutralized in their first meeting but the fight was still close on the scorecards as Pereira rallied in Round 5 to narrowly lose by a score of 48-47 on two of three judges' scorecards. Expect a hungry Pereira to be much more aggressive in their rematch, which is a scary thought to consider. </p>\n<h2>2. Pereira isn't the only one who can improve upon his performance in March</h2><p>Despite winning the title in a smart performance that saw the 20-1-1 Ankalaev extend his unbeaten streak to 14 fights since he lost his UFC debut in 2018, the native of Dagestan, Russia, wasn't overly exciting or commanding in doing so. It's probably the biggest reason why UFC matchmakers chose to go the way of an immediate rematch. The good news for Ankalaev is that he acknowledged his shortcomings during a sitdown on \"UFC Countdown,\" where the 33-year-old admitted he should've followed through with more offense when he had Pereira visibly hurt and/or backing up. Passivity against elite competition has sometimes been an issue for Ankalaev, who has predicted he will finish Pereira in the rematch. Given the intensity in Pereira's eyes this week, he may have to in order to win. </p>\n<h2>3. Merab Dvalishvili enters the most difficult style challenge of his title reign</h2><p>Ranked in the top five pound-for-pound and riding an insane 13-fight winning streak since losing both of his first two fights in the UFC, the 34-year-old Dvalishvili continues to be a nearly unstoppable force at 135 pounds. A victory on Saturday would make the native of Georgia just the eighth UFC champion in any division to make three title defenses in the same calendar year (and he's already stated his hope of adding a record fourth in December). Yet, even with his recent dominance and incredible displays of relentless cardio, Dvalishvili is expected to have his hands full with the lengthy and awkward Sandhagen. There isn't an MMA skill that the well-rounded Sandhagen doesn't possess and both his constant movement and creative striking attacks have the potential to be problematic for the champion. Sandhagen also has a strong gas tank of his own and has weathered the storm of disappointment in recent years after losing multiple close fights against top contenders that would've lifted him into a title shot. At 33, this could be Sandhagen's final shot at glory and the experience he brings will be key as he looks to slow Dvalishvili down and turn the fight into a chess match.  </p>\n<h2>4. A slugfest is expected as top five light heavyweights look for title return</h2><p>Buckle your seatbelts! Nothing short of fireworks are expected when former 205-pound champion Jiri Prochazka welcomes former title challenger Khalil Rountree Jr. in a battle of exciting sluggers with legit title implications at play. Yes, it's true that the winner might ultimately take a backseat to Carlos Ulberg, the New Zealand contender who <span><a href=\"https://www.cbssports.com/mma/news/ufc-fight-night-results-highlights-carlos-ulberg-blasts-dominick-reyes-for-first-round-ko-wants-title-shot/\" target=\"_blank\">improved his win streak to nine last Saturday</a></span> when he knocked former two-time title challenger Dominick Reyes out in Round 1. Ulberg is even more likely to get the call should Pereira regain the title, mostly because he knocked out both Prochazka and Rountree in his last two victories in 2024. But with the combination of a shallow contender pool and rampant parity at light heavyweight, the winner of Prochazka-Rountree will be in the driver's seat for a huge fight, especially considering both have momentum after each scored stoppage wins over former champion Jamahal Hill earlier this year. At 35, Rountree's resurgence into a legit title threat has been fun to watch. But no one brings the fun quite like Prochazka, who, outside of two knockout title losses to Pereira, has finished all five of his UFC wins and hasn't gone the distance in a pro fight since 2016. </p><h2>5. Patchy Mix quietly returns on the early prelims after demoralizing debut</h2><p>It was only three months ago when Mix, a 32-year-old free agent and former Bellator MMA champion brought his 20-1 record into the UFC for a debut fight against Mario Bautista that possibly would've lifted him to an immediate title shot had he won. Unfortunately for Mix, he was brutally battered in a one-sided decision loss that saw his stock take an insane hit. Despite having entered UFC fresh off of consecutive wins over James Gallagher, Kyoji Horiguchi, Magomed Magomedov (twice), Raufeon Stots and Sergio Pettis, Mix suddenly finds himself buried on the early prelims on Saturday against a debuting Jakub Wiklacz, who is fresh off of a run as KSW bantamweight champion. Oddly enough, the same thing recently happened to Mix's significant other, Tatiana Suarez, who went from a brutal strawweight title loss to Zhang Weili in the co-main event of UFC 312 in February to returning far off the radar on the prelims of Noche UFC in September. While it's likely premature to say Mix's job is on the line, he undoubtedly is in need of a huge bounce-back performance more in line with the capabilities he has shown in his pre-UFC run.  </p>\n            </div>"
  },
  {
    "title": "UFC Qatar: Arman Tsarukyan vs. Dan Hooker, Belal Muhammad vs. Ian Machado Garry headline November event - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mma/news/ufc-qatar-arman-tsarukyan-vs-dan-hooker-belal-muhammad-vs-ian-machado-garry-headline-november-event/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/eed7a09c-7128-416d-af65-895cc8b72222/thumbnail/1200x675/8b2ea354b284aa622b24584e5adbb8fb/arman-tsarukyan-getty.jpg",
    "tag": "Sports",
    "date": "2025-10-01T21:25:34.000Z",
    "description": "Getty Images                                    Lightweights Arman Tsarukyan and Dan Hooker will headline UFC's trip to Qatar on Nov. 22, UFC CEO Dana White announced Wednesday. In addition to Tsarukyan...",
    "body": "<div>\n    <div>\n    <figure><img alt=\"arman-tsarukyan-getty.jpg\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/eed7a09c-7128-416d-af65-895cc8b72222/thumbnail/770x433/9be019c989e2e49b053302fe08a75fdb/arman-tsarukyan-getty.jpg\" /></figure>\n                    <figcaption>\n                <span>Getty Images</span>\n            </figcaption>\n            </div>\n    <div>\n        <p>Lightweights Arman Tsarukyan and Dan Hooker will headline UFC's trip to Qatar on Nov. 22, UFC CEO Dana White announced Wednesday. In addition to Tsarukyan vs. Hooker, White confirmed a co-main event battle between former UFC welterweight champion Belal Muhammad and rising contender Ian Machado Garry.</p><p>Tsarukyan is currently the No. 2-ranked lightweight in the official UFC rankings. Since dropping a decision to Mateusz Gamrot in June 2022, Tsarukyan has rattled off four consecutive wins, including notable victories over Beneil Dariush and Charles Oliveira.</p><p>The win over Oliveira had earned Tsarukyan a title shot against Islam Makhachev, who spoiled Tsarukyan's Octagon debut in 2019, at UFC 311 this past January. Less than two days before the planned bout with Makhachev, Tsarukyan was forced out of the fight due to a back injury. Due to withdrawing from that fight, Tsarukyan has not competed in MMA since April 2024.</p><a href=\"https://www.cbssports.com/boxing/news/ufc-320-fight-card-magomed-ankalaev-vs-alex-pereira-2-five-biggest-storylines-to-watch-in-las-vegas/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>UFC 320 fight card -- Magomed Ankalaev vs. Alex Pereira 2: Five biggest storylines to watch in Las Vegas</p>\n                <p>\n                    Brian Campbell                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"UFC 320 fight card -- Magomed Ankalaev vs. Alex Pereira 2: Five biggest storylines to watch in Las Vegas\" src=\"https://sportshub.cbsistatic.com/i/r/2025/09/30/24782568-7d35-41bd-94f7-557d8882e95e/thumbnail/270x152/60b1e33c02dda8e78edce84389a6f62e/pereira-ankalaev-313-weighins.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Hooker, ranked No. 6, is coming off a similar layoff, having been out of action due to hand injuries since an August 2024 win over Mateusz Gamrot. The win over Gamrot was Hooker's third in a row as he rebounded from a rough 1-4 stretch against elite competition.</p>\n<p>Muhammad will be fighting for the first time since he lost the welterweight title to Jack Della Maddalena in May. The loss snapped a 10-fight winning streak for Muhammad, who had captured the championship with a UFC 304 win over Leon Edwards.</p><p>In April, Garry defeated Carlos Prates to rebound from the first loss of his career, which came against Shavkat Rakhmonov in December.</p>\n<p>The winner of Muhammad vs. Garry will have an argument for a title shot against the winner of the UFC 322 fight between Maddalena and Makhachev, who vacated his lightweight championship to move up in weight and challenge for the 170-pound title. That fight takes place one week prior to UFC Qatar.</p>\n            </div>\n    </div>"
  },
  {
    "title": "Brian Schottenheimer's Jets return: Can the Cowboys' head coach steal a win in New York? - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brian-schottenheimers-jets-return-can-the-cowboys-head-coach-steal-a-win-in-new-york/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/616c10cc-a07e-43db-a4cd-94d8a7fdbe03/thumbnail/1200x675/6c45526b2963a2834fb93dcf4831a8c3/brian-schottenheimer.jpg",
    "tag": "Sports",
    "date": "2025-10-02T00:25:28.000Z",
    "description": "FRISCO, Texas -- In Week 4, All-Pro edge rusher Micah Parsons' return to AT&T Stadium with the Green Bay Packers to face the Dallas Cowboys, his former team, was an unavoidable storyline. This week,...",
    "body": "<div>\n        <p>FRISCO, Texas -- In Week 4, All-Pro edge rusher <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/2967590/micah-parsons/\">Micah Parsons</a>' return to AT&T Stadium with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/GB/green-bay-packers/\">Green Bay Packers</a> to face the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/DAL/dallas-cowboys/\">Dallas Cowboys</a>, his former team, was an unavoidable storyline. </p><p>This week, there's another return game storyline surrounding Dallas' Week 5 matchup at the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/NYJ/new-york-jets/\">New York Jets</a>: head coach Brian Schottenheimer's return to New York. The Jets gave Schottenheimer his first offensive coordinator job at 32 years old under then-head coach Eric Mangini. </p><p>Schottenheimer stayed on through then-head coach Rex Ryan's first three seasons in charge from 2009-11. His tenure included calling plays for Pro Football Hall of Famer Brett Favre at 39 years old in 2008, a campaign that began with a lot of promise thanks to an 8-3 start but then went downhill after Favre suffered a biceps injury, and the team finished 9-7. Schottenheimer built a punishing rushing offense that accentuated 2009 first-round quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/559373/mark-sanchezs/\">Mark Sanchez's</a> skill set. The result was consecutive AFC title game appearances in 2009 and 2010. When he was let go following the 2011 season, Schottenheimer departed as the longest-tenured offensive coordinator in Jets history, as confirmed by CBS Sports Research.</p><p>\"A little different. It wasn't as big of a story when I left the Jets,\" Schottenheimer said Wednesday after a big laugh when asked about his return this week in comparison to Parsons' last week. \"But it'll be good. There's still some people in the organization that I'm really close with. I like to think this way, I spent six years as the OC in New York, and I think that's the longest-tenured coordinator there since the early 70s. It can feel like dog years at times because they have such great fans, and it'll be fun to be back there. So I guess I was the coordinator there for 42 years. But, nah, we had great success. We won a lot of games. Proud of the fact that we went to back-to-back AFC Championship Games and things like that. But it's about people for me.\"</p>\n<p>Schottenheimer, whose Dallas offense leads the <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> in total yards per game (404.3) and ranks fifth in scoring offense (28.5), credited his opportunity with the Jets for having a major impact in molding the kind of football coach he is today. Schottenheimer spent much of the offseason <span><a href=\"https://www.cbssports.com/nfl/news/cowboys-head-coach-brian-schottenheimer-changing-the-culture-creating-camaraderie-in-locker-room/\" target=\"_blank\">reshaping the Cowboys' team culture</a></span>, which has paid dividends on his side of the ball -- the offense -- early on. </p><p>\"More than anything, maybe it was just my first time being a coordinator. When you first sit in that chair -- whether it's a head coach, coordinator, quarterbacks coach, position coach, whatever -- you think you have all the answers,\" Schottenheimer said. \"I remember sitting in San Diego and Cam Cameron was our [offensive] coordinator, thinking 'I would do it this way, or I'd do it that way.' Then, you get in that seat, and you're sitting there and something comes across your desk. You're like, 'Damn, I don't know what I'm supposed to do right now.' You're literally learning on the job. I think we had some growing pains. We struggled through some times there, but we ended up figuring it out and doing a great job with it.\" </p><p>All of Schottenheimer's professional development in New York helped pave the way for him helping guide Cowboys quarterback <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/players/1824864/dak-prescott/\">Dak Prescott</a> <span><a href=\"https://www.cbssports.com/nfl/news/dak-prescott-has-been-money-this-season-for-cowboys-earning-indispensable-pay-check-from-jerry-jones/\" target=\"_blank\">to a strong start to 2025</a></span>. Prescott leads the <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> in passing yards (1,119) and ranks inside the top 10 in both completion percentage (72.9%, third) and expected points added (EPA) per dropback (0.17, seventh).</p>\n<p>\"I think that's my exposure to leading people. Coaching Brett Favre when you're [34 years old], and he's [39 years old], you better be good at what you do and be able to connect with people,\" Schottenheimer said. \"Because it's a unique age difference, and we had a lot of success together.\"</p><a href=\"https://www.cbssports.com/nfl/news/week-5-nfl-qb-power-rankings-how-far-did-cowboys-dak-prescott-leap-after-ot-thriller-jordan-love-also-rises/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>Week 5 NFL QB Power Rankings: How far did Cowboys' Dak Prescott leap after OT thriller? Jordan Love also rises</p>\n                <p>\n                    Cody Benjamin                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"Week 5 NFL QB Power Rankings: How far did Cowboys' Dak Prescott leap after OT thriller? Jordan Love also rises\" src=\"https://sportshub.cbsistatic.com/i/r/2022/11/22/601a9077-0e24-49fb-a017-e11fcec35688/thumbnail/270x152/ac57ad71448af12e5b73b8014f06c78e/qbrankings-editorial-dk-v1.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>Looking back on his Jets' journey, the Cowboys' head coach acknowledged that receiving multiple head-coaching interviews in his early thirties after success in New York inflated his ego. That was before receiving a humbling end to his Jets' tenure after an 8-8 season in 2011. That's helped mold his more steady approach with the Cowboys. </p><p>\"I learned a lot back then thinking that I had all the answers. Here I was a hotshot, 32-year-old coordinator that after one year is getting head-coaching opportunities. This is a very humbling business,\" Schottenheimer said. \"You guys know me, I talk about being authentic and being humble and all that stuff. I think as I look back, those were some great memories and some great experiences, but I never stopped learning. I think the minute you take yourself too seriously in this business, you're asking for problems. Because there's too many talented coaches and players and people in this league that when you take yourself too seriously, which I'm sure I did at times looking back, you're asking for problems.\"</p>\n<p>The head-coaching interviews that came early in his New York tenure dried up in his subsequent offensive coordinator stops with the <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/LAR/los-angeles-rams/\">Rams</a> (2012-2014) and <a target=\"_blank\" href=\"https://www.cbssports.com/nfl/teams/SEA/seattle-seahawks/\">Seahawks</a> (2018-2020). Schottenheimer spent 25 seasons as an <a target=\"_blank\" href=\"https://cbssports.com/nfl/\">NFL</a> assistant coach before Cowboys owner/general manager Jerry Jones hired him to succeed Mike McCarthy as Dallas' head coach this year. While it would have been nice to have been an NFL head coach in his thirties, he wouldn't go back and wish to have gone straight from the Jets to the NFL head-coaching ranks because of the accumulated coaching experience he now has at the age of 51. </p><p>\"I am more prepared now. I thought I missed my window. I thought my window had passed me by. Winning divisions in Seattle, and you are not getting interviews,\" Schottenheimer said. \"The phone is not ringing when you are having success. I was coordinator of what was one of the best offenses in the league (in Seattle). Not calling plays (under Mike McCarthy in Dallas) was certainly a factor. I did think my window of opportunity might have passed me by.\"</p><p>Now, he'll look to guide Prescott and Co. in a critical opportunity to steal a victory on the road in Week 5 against his former employer. New York is 0-2 at home this season, and it is just the sixth team in the <a target=\"_blank\" href=\"https://cbssports.com/nfl/superbowl/\">Super Bowl</a> era to have its defense not create a takeaway in the first four games of a season. Schottenheimer's Cowboys will look to keep that dubious streak alive and crank up the intensity on first-year Jets head coach Aaron Glenn's early New York \"dog years.\"</p>\n            </div>"
  },
  {
    "title": "Mason Miller makes history, but Wild Card Series Game 3 may put Padres flamethrower to the test vs. Cubs - CBSSports.com",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mason-miller-makes-history-but-wild-card-series-game-3-may-put-padres-flamethrower-to-the-test-vs-cubs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/01/9a6ad93f-8538-495f-ae8d-d403490c2135/thumbnail/1200x675/e5cb1741ce53be016370cfb024b05060/miller-getty.png",
    "tag": "Sports",
    "date": "2025-10-01T23:58:12.000Z",
    "description": "CHICAGO – We've become a bit habituated to all the triple-digit fastballs and sharp, unhittable late movement populating Major League Baseball these days. Relievers especially have been bred and fed to max...",
    "body": "<div>\n        <p><span>CHICAGO –</span> We've become a bit habituated to all the triple-digit fastballs and sharp, unhittable late movement populating Major League Baseball these days. Relievers especially have been bred and fed to max out velocity, and so many of them regularly clock readings that would've been unthinkable less than a generation ago. And there's <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/26911802/mason-miller/\">Mason Miller</a>, the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/SD/san-diego-padres/\">San Diego Padres</a>' fire-breathing high-leverage reliever and the club's flagship trade-deadline addition. </p><p>However routine \"pitch nastiness\" has become for the regular observer of this sport, a pitcher like Miller still redefines what we think a ball leaving a human hand should be able to do. Miller loudly reminded us of this during the later innings of the San Diego Padres' 3-0 win over the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/CHC/chicago-cubs/\">Chicago Cubs</a> (<a href=\"https://www.cbssports.com/mlb/gametracker/recap/MLB_20251001_SD@CHC/\" target=\"_blank\">box score</a>) in Wednesday's Game 2 of the National League Wild Card Series. </p><a href=\"https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\" target=\"_blank\">\n        <div>\n            <div>\n                <p>2025 MLB playoff bracket: Schedule, scores for Yankees vs. Red Sox, Cubs vs. Padres, more as postseason begins</p>\n                <p>\n                    Kate Feldman                </p>\n            </div>\n                            <div>\n    <figure><img alt=\"2025 MLB playoff bracket: Schedule, scores for Yankees vs. Red Sox, Cubs vs. Padres, more as postseason begins\" src=\"https://sportshub.cbsistatic.com/i/r/2025/10/01/0a75924d-9bff-4f20-9e88-ec56cd27bc33/thumbnail/270x152/e86de4e2809b214c9a70053d74f1acd8/2025-mlb-bracket-final.jpg\" /></figure>\n                </div>\n                    </div>\n    </a>\n<p>With the Padres down 0-1 in the best-of-three set and thus facing elimination, Miller got the call from manager Mike Shildt after starter <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2211754/dylan-cease/\">Dylan Cease</a> and All-Star lefty setup man Adrián Morejón combined for six scoreless. Staked to a 3-0 lead that he would maintain, Miller struck out <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/27023012/seiya-suzuki/\">Seiya Suzuki</a>, <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2044542/carson-kelly/\">Carson Kelly</a>, and <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/26615365/pete-crow-armstrong/\">Pete Crow-Armstrong</a> in the seventh. Then in the eighth, Miller struck out <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/2184343/dansby-swanson/\">Dansby Swanson</a> and Moisés Ballesteros before just nicking the pant leg of <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/3117931/michael-busch/\">Michael Busch</a> with a 1-0 backfoot slider that back-footed just a bit too much. At that point, Shildt went to closer <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/players/26861461/robert-suarez/\">Robert Suarez</a> for what would be a four-out save. The relevant moving pictures: </p><p>Through the magic of color television sports programming, let's revisit strike three to Kelly because in some ways it's \"The Mason Miller Experience\" distilled down to a single pitch with which the batter can do nothing but genuflect before it: </p>\n<p>Yes, as claimed, that's that 104.5 mph four-seamer is the fastest postseason pitch on record. Given that probably no one was throwing 104.5 mph before we had reliable means to measure such things, yes, it's probably the fastest pitch anyone has ever thrown in the playoffs. </p><p>\"104, we like that,\" Shildt said after Game 2 while complimenting Miller's \"pretty impressive\" outing. </p><p>Miller in Game 2 threw 11 fastballs, and those were the 11 fastest pitches thrown by anyone in Game 2. He averaged 103 mph with it. Miller on Wednesday got six whiffs on 10 swings and, looping in his Game 1 performance on Tuesday, he's now struck out eight of the nine batters he's faced in this series. That's against a Cubs offense that during the regular season was one of the toughest in <a target=\"_blank\" href=\"https://cbssports.com/mlb/\">MLB</a> to strike out. </p>\n<p>All of this raises the necessary matter of whether Miller will be available for Thursday's game, which will decide whether the Padres or Cubs advance to face the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/MIL/milwaukee-brewers/\">Milwaukee Brewers</a> in the Division Series. Shildt after Game 2 addressed that pressing matter: </p><blockquote><p>\"Yeah, I mean, listen. I mean, Morejon and Miller have gone back-to-back days. Both got extended today. Morejon is still efficient, but 33 pitches. Miller in the 30s for two games combined. I would have an expectation that all hands are on deck tomorrow, but we're also going to take their temperature and be smart. We've got to value their careers as well. But we've also been -- we've only had two guys go three days in a row all year, and we've done it and saved it for these circumstances. Obviously in an elimination game, there's special circumstances.\"</p></blockquote><p>Miller threw 13 pitches in Game 1 on Tuesday and then 27 in Game 2. Only once this season has Miller worked three straight days, and that was back in May, before the Padres acquired him from the A's. Here's how he fared while pitching in every game of that three-game set against the <a target=\"_blank\" href=\"https://www.cbssports.com/mlb/teams/PHI/philadelphia-phillies/\">Phillies</a>: </p><ul><li>May 23: ⅔ IP, 3 R, 1 SO, 27 pitches</li><li>May 24: 1 IP, 1 R, 3 SO, 21 pitches</li><li>May 25: 1 IP, 0 R, 1 SO, 12 pitches</li></ul><p>At the time, he was coming off a combined 48 pitches before being called upon for the third leg of a back-to-back-to-back. In the here and now, he's coming off 40 pitches. Obviously, we shouldn't read too much into a one-off more than four months ago and compare it to the effort level and intensity of playoff baseball, but Shildt will be operating from precedent if he leans on Miller in Game 3. As for the \"value their careers\" part, Shildt is no doubt invoking ethical principles, and adding to it is the fact that the 27-year-old Miller is under team control through the 2029 season and thus a valuable part of the Padres' future. </p><p>For now, though, the focus is on the Padres' present and their designs on the first World Series title in franchise history, and that's why you may indeed see Miller make another crucial appearance on Thursday. If what he did in Game 2 is any guide, he'll miss bats and drop jaws once again.</p>\n            </div>"
  }
]