[
  {
    "title": "Spurs vs. Lakers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/spurs-lakers-odds-prediction-spread-injuries-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/04/e34a3b0d-732b-4044-86d5-5bac65c0df1f/thumbnail/1200x675/766f43e4c4519eac28c4a604f061cff4/victor-wembanyama-san-antonio-spurs-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:20:08.000Z",
    "description": "\n        Division leaders clash when the Pacific-leading Los Angeles Lakers battle the Southwest Division-leading San Antonio Spurs in a key NBA Weste",
    "body": "\n        Division leaders clash when the Pacific-leading Los Angeles Lakers battle the Southwest Division-leading San Antonio Spurs in a key NBA Western Conference matchup on Tuesday. San Antonio is coming off a 138-125 win over the Dallas Mavericks on Saturday, while Los Angeles dropped a 119-110 decision to Oklahoma   City on Monday. The Spurs (36-16), who have won four in a row, are 16-10 on the road this season. The Lakers (32-20), who had a three-game winning streak stopped, are 14-9 on their home court. Luka Doncic (hamstring), LeBron James (foot) and Austin Reaves (calf) are all out for Los Angeles. Deandre Ayton (knee) is questionable. Tipoff from Crypto.com Arena in Los Angeles is set for 10:30 p.m. ET. San   Antonio is a 13.5-point favorite in the latest Spurs vs. Lakers odds from DraftKings Sportsbook, while the over/under for total points scored is 224.5. Before making any Lakers vs. Spurs picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 16 of the 2025-26 NBA season on a sizzling 38-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Spurs vs. Lakers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Lakers vs. Spurs:Spurs vs. Lakers                                                                                                                                                                 spread:    San Antonio -13.5 at DraftKings    Spurs vs. Lakers                                                                                                                                                                                 over/under:    224.5 pointsSpurs vs. Lakers                                                                                                                                                                                 money line:    San Antonio -614, Los Angeles +464Spurs vs. Lakers                     picks:    See picks at SportsLineSpurs vs. Lakers                                                 streaming:Fubo (Try for free)   New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Spurs vs. Lakers picksAfter 10,000 simulations of Spurs vs. Lakers, SportsLine's model is going Over on the total (224.5). The Under hit in its last head-to-head meeting. The Under has also hit in seven of the last 10 San Antonio games, and in six of the last 10 Los Angeles games. The SportsLine model is projecting San   Antonio's Victor Wembanyama to score 21.9 points on average and be one of six Spurs players to score 10.8 or more points as the model projects that the teams will combine to score 232 points.It has also generated an against-the-spread pick that hits in nearly 70% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Spurs vs. Lakers, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Spurs vs. Lakers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spurs vs. Lakers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/04/e34a3b0d-732b-4044-86d5-5bac65c0df1f/thumbnail/1200x675/766f43e4c4519eac28c4a604f061cff4/victor-wembanyama-san-antonio-spurs-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:20:08.000Z",
      "dateModified": "2026-02-11T01:20:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Team USA women's hockey dominates Canada: Schedule, scores at 2026 Winter Olympics - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-us-womens-hockey-schedule-results-standings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/bd85f8d2-1571-48fe-8dae-5f75e76a9658/thumbnail/1200x675/89bf740e3bb39bc942f9fadfc3539711/gettyimages-2260947627-2.jpg",
    "tag": "Sports",
    "date": "2026-02-10T22:15:35.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After suffering a devastating loss to Canada in th",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After suffering a devastating loss to Canada in the gold medal game four years ago, the U.S. women's hockey team is out for some revenge at the 2026 Winter Olympics, and it got a taste of that on Tuesday. In their final preliminary game, the Americans completely dismantled the Canadians, their heated rivals, 5-0.Taking on a Canadian team that was without superstar Marie-Philip Poulin due to an injury, Team USA controlled the game from start to finish. The Americans' speed simply overwhelmed the Canadians on the forecheck, and these matchups are rarely this lopsided.Driving the bus en route to a statement win -- once again -- was defender Caroline Harvey. She registered her second consecutive three-point game with a goal and two assists, but Harvey wasn't alone in her heroics. Linemates Abbey Murphy and Hannah Bilka gave Canada headaches for three periods, and they combined for two goals.Their first tally was a beauty with Murphy showing off her blazing speed to reach a loose puck before sliding a no-look pass to Bilka in the slot. Bilka finished with two goals, and Murphy totaled three assists.\nTeam USA capped off a perfect 4-0-0-0 run in the preliminary round, and it's now in the driver's seat to win the gold medal. Even with Canada down Poulin, this was a thoroughly impressive victory for the Americans, who want to reclaim their spot atop women's hockey.Canada and United States are the only two countries that have won gold in women's ice hockey since the event was added to the Olympics in 1998. The Americans won that inaugural year in Nagano, then endured four straight Canadian victories until 2018, when Team USA struck back with a dramatic overtime win to capture gold in Pyeongchang.\nU.S. women's hockey scheduleAll times EasternPreliminary roundThursday, Feb. 5: USA 5, Czechia 1 Saturday, Feb. 7: USA 5, Finland 0Monday, Feb. 9: USA 5, Switzerland 0Tuesday, Feb. 10: USA 5, Canada 0QuarterfinalTBD vs. TBD | Friday, Feb. 13 | 3:10 p.m. | TBDSemifinalTBD vs. TBD | Monday, Feb. 16 | 10:40 a.m. | TBDBronze medal game\nTBD vs. TBD | Thursday, Feb. 19 | 8:40 a.m. | TBDGold medal gameTBD vs. TBD | Thursday, Feb. 19 | 1:10 p.m. | TBD\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Team USA women's hockey dominates Canada: Schedule, scores at 2026 Winter Olympics - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/bd85f8d2-1571-48fe-8dae-5f75e76a9658/thumbnail/1200x675/89bf740e3bb39bc942f9fadfc3539711/gettyimages-2260947627-2.jpg"
      ],
      "datePublished": "2026-02-10T22:15:35.000Z",
      "dateModified": "2026-02-10T22:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-pacers-odds-prediction-spread-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:24:41.000Z",
    "description": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The P",
    "body": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The Pacers are at the bottom of the East with a 13-40 mark overall, while New York is second in the conference at 35-19. The Knicks have won nine of their last 10. Indiana has dropped four straight as it has primarily set its focus on the future. Tipoff is set for 7:30 p.m. ET at Madison Square Garden. New York is an 11.5-point favorite in the latest Knicks vs. Pacers odds, while the over/under is 225.5. Before making any Pacers vs. Knicks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Knicks vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Knicks: Knicks vs. Pacers spread                                                                     Knicks -11.5Knicks vs. Pacers over/under:    225.5 pointsKnicks vs. Pacers money line:    Knicks -588, Pacers +428Knicks vs. Pacers picks: See picks at SportsLineKnicks vs. Pacers streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Pacers vs. Knicks picksSportsLine's model has simulated Knicks vs. Pacers 10,000 times and is going Over on the total (225.5 points). New York won 114-113 when these teams met in December, and the Over hit in that matchup.This time around, the model is projecting Pascal Siakam to lead the Pacers with 21.6 points, while Jalen Brunson paces New York with 26.7 points in the simulations. The teams combine for 229 points as the Over hits 51% of the time. The model also says one side of the spread hits nearly 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Pacers, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:24:41.000Z",
      "dateModified": "2026-02-10T21:24:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AT&T Pebble Beach Pro-Am 2026 parlay, props: PGA longshot picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/a-t-t-pebble-beach-pro-am-2026-parlay-props-picks-predictions-golf-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/1e2def9c-4334-4811-8219-391841ae7439/thumbnail/1200x675/af84d489da05d7a110ef91d2ef42c074/rory-mcilroy-pebble-beach-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:20:59.000Z",
    "description": "\n        The 2026 AT&T Pebble Beach Pro-Am marks the first Signature Event of the season, with several of the world's best competing at Pebble Beach G",
    "body": "\n        The 2026 AT&T Pebble Beach Pro-Am marks the first Signature Event of the season, with several of the world's best competing at Pebble Beach Golf Links in Northern California. Scottie Scheffler is the +300 favorite, per the latest PGA odds, while other contenders include defending champion Rory McIlroy (+1300), Xander Schauffele (+2500), Justin Rose (+2500) and Hideki Matsuyama (+3000). Outside of making PGA bets on the outright winner, you could create a 2026 Pebble Beach parlay featuring finishing positions, head-to-head outcomes and many other golf props.Ryan Gerard may not be the first name you think of when constructing a PGA longshot parlay, but the UNC alum has three runners-up over his last four starts. He's at +1000 to simply notch a top-5 at the AT&T Pebble Beach Pro-Am 2026 and at +7600 to win his second PGA event. That could be a standalone golf bet or part of a lucrative golf parlay for Pebble Beach 2026. Before making any 2026 Pebble Beach   picks or golf parlays, you need to see this PGA Tour parlay from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its best bets since the restart, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 Pebble Beach   field is locked in, SportsLine simulated the tournament 10,000 times. It has locked in betting picks to form a 5-leg golf parlay that pays out over $40,000 for a $10 bettor. See the picks and full parlay by heading to SportsLine.Top 2026 Pebble Beach parlay, PGA Tour picksFor the AT&T Pebble Beach Pro-Am   2026, one of the picks featured in the model's 5-leg PGA Tour parlay is McIlroy finishing as the Top European at +370. The defending event winner, McIlroy won at Pebble Beach with a score of 21-under-par last year, and that score to par is the lowest ever in the history of this tournament at this specific course. He broke par in all four rounds as that was his first of three victories in 2025. The Irishman is teeing off at his first PGA Tour event of this year, but he did place third in a European Tour event last month.\nThat event had many of the fellow Europeans he will be competing against at Pebble Beach, and McIlroy's game is well-suited for what's the second-shortest course in use for the 2026 PGA Tour season. McIlroy was second in driving distance last season as his length off the tee will well position him for easier chips. Then once he gets on the green, McIlroy is coming off a year in which he ranked in the top 10 in putting average and strokes gained: putting. Thus, his strengths are magnified at a short course like Pebble Beach, making this +370 golf prop one that's worth investing in. See the rest of the PGA Tour parlay legs here.New users can also check out the latest FanDuel promo code and get $100 in bonus bets at FanDuel if your $5 bet wins:How to make PGA Tour parlay picks The model has also picked an outright winner, plus a prop that returns nearly +1000 among its five PGA Tour picks for the 2026 AT&T Pebble Beach Pro-Am     parlay that pays over $40,000 on just a $10 bet. You can only see the picks and the full parlay at SportsLine.\nSo, who will win Pebble Beach 2026, and what combination of PGA Tour props could unlock a $40,000 payday on just a $10 bet? Visit SportsLine now to get the PGA Tour parlay and picks for the AT&T Pebble Beach Pro-Am, all from the golf model that's nailed a whopping 16 majors entering the weekend, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AT&T Pebble Beach Pro-Am 2026 parlay, props: PGA longshot picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/1e2def9c-4334-4811-8219-391841ae7439/thumbnail/1200x675/af84d489da05d7a110ef91d2ef42c074/rory-mcilroy-pebble-beach-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:20:59.000Z",
      "dateModified": "2026-02-11T01:20:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 AT&T Pebble Beach Pro-Am odds, predictions, field: Golf picks from proven PGA model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-a-t-t-pebble-beach-pro-am-odds-field-picks-predictions-projected-leaderboard-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/24931eb4-e8b1-4eb2-80e4-26bcb3b3859a/thumbnail/1200x675/e15f786144ea5664c9414ef7de472f55/scottie-scheffler-pga-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:05:02.000Z",
    "description": "\n        The first PGA Signature Event of the season arrives this week as the 2026 AT&T Pebble Beach Pro-Am unfolds at the iconic Pebble Beach Golf Li",
    "body": "\n        The first PGA Signature Event of the season arrives this week as the 2026 AT&T Pebble Beach Pro-Am unfolds at the iconic Pebble Beach Golf Links in Pebble Beach, Calif. Rory McIlroy won this event in 2025, and he's set to make his season debut this week after skipping the first four tournaments. McIlroy is +1300 in the 2026 AT&T Pebble Beach Pro-Am odds from FanDuel Sportsbook, trailing only favorite Scottie Scheffler (+300) in a loaded 2026 Pebble Beach field. Other Pebble Beach contenders include Tommy Fleetwood, Justin Rose, Si Woo Kim and Xander Schauffele all at +2500. The players who went to a playoff at the WM Phoenix Open -- Hideki Matsuyama and Chris Gotterup -- are among the golfers at +3000. Before locking in any 2026 AT&T Pebble Beach Pro-Am picks, or making any PGA DFS picks on sites like FanDuel or DraftKings, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, simulated every PGA Tour event 10,000 times and reveals golf betting picks that have a history of being extremely profitable. This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 AT&T Pebble Beach Pro-Am field is locked in, the model simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. 2026 AT&T Pebble Beach Pro-Am predictions One major surprise the model is calling for at the WM Phoenix Open 2026: Gotterup, who has won two of the three events he's played in this year, including the WM Phoenix Open last week, doesn't even finish in the top 10 this week. He's a golfer to avoid in Pebble Beach bets. Gotteup has never played in this event before, so the model is not ready to treat him like a top-10 contender despite the fact that he's getting +3000 odds -- the same as Maysuyama and Xander Schuaffele. See who else to fade here. \nAnother surprise: The model is extremely high on Kim (+2700). Kim has been one of the hottest golfers on Tour so far this year, finishing no worse than T11 in his four events. He's been T6 or better in his last three events, and is coming off a T3 at the WM Phoenix Open and a T2 the prior week at the Farmers Insurance Open. He's also finished in the top 15 in this event in two straight seasons. See who else to pick here. New users can also check out the latest FanDuel promo code and get $100 in bonus bets at FanDuel if your $5 bet wins:How to make 2026 AT&T Pebble Beach Pro-Am picksThe model is also targeting a massive +5000 sleeper who brings huge value in outright bets. You can only see the model's picks here. \nWho will win the 2026 AT&T Pebble Beach Pro-Am, and which massive longshot will stun the golfing world? Check out the 2026 AT&T Pebble Beach Pro-Am odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 AT&T Pebble Beach Pro-Am odds, favorites Get full 2026 AT&T Pebble Beach Pro-Am picks, best bets and predictions here. (odds via FanDuel and subject to change)Scottie Scheffler +300Rory McIlroy +1300Si Woo Kim +2500Xander Schauffele +2500Tommy Fleetwood +2500Justin Rose +2500Viktor Hovland +2700Hideki Matsuyama +3000Cameron Young +3000Chris Gotterup +3000Matt Fitzpatrick +3000Maverick McNealy +3000Russell Henley +3000Jake Knapp +3300Michael Thorbjornsen +3300Ben Griffin +3300Patrick Cantlay +3300Robert MacIntyre +3500Jason Day +4000Ludvig Åberg +4000J.J. Spaun +4500Shane Lowry +4500Daniel Berger +5000Harris English +5000Min Woo Lee +5500Collin Morikawa +5500Sepp Straka +5500Pierceson Coody +5500Akshay Bhatia +6000Ryan Gerard +6000Kurt Kitayama +7000Sam Burns +7000Rickie Fowler +7000Taylor Pendrith +7500Harry Hall +7500Wyndham Clark +7500Jordan Spieth +7500Jacob Bridgeman +8000Keith Mitchell +8000Alex Noren +8000Samuel Stevens +8000Matt McCarty +8000J.T. Poston +8000Nick Taylor +8000Sahith Theegala +8000Keegan Bradley +8000Corey Conners +8000Patrick Rodgers +10000Max Greyserman +10000Ryo Hisatsune +10000Garrick Higgo +10000Max McGreevy +10000Aaron Rai +10000Stephan Jaeger +10000Denny McCarthy +10000Michael Kim +10000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 AT&T Pebble Beach Pro-Am odds, predictions, field: Golf picks from proven PGA model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/24931eb4-e8b1-4eb2-80e4-26bcb3b3859a/thumbnail/1200x675/e15f786144ea5664c9414ef7de472f55/scottie-scheffler-pga-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:05:02.000Z",
      "dateModified": "2026-02-11T01:05:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man United don't cut it at West Ham, draw puts viral fan's haircut dream on hold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/manchester-united-vs-west-ham-score-ucl-chances-fan-haircut/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/66daaec5-094d-4add-9c9a-6ae0a2b8eb82/thumbnail/1200x675/825cb7e36af2acd932b9aa7b1be85ce0/man-united-1.jpg",
    "tag": "Sports",
    "date": "2026-02-11T00:00:41.000Z",
    "description": "\n        Michael Carrick's win streak as Manchester United's coach came to an end on Wednesday with a surprise 1-1 draw at West Ham United, one in whi",
    "body": "\n        Michael Carrick's win streak as Manchester United's coach came to an end on Wednesday with a surprise 1-1 draw at West Ham United, one in which they had to come from behind to pick up a point and avoid their first defeat in five.United were the heavy favorites in this matchup, in part because of their strong attacking record this season, but their offense was ineffective at the London Stadium. There were just five combined shots between the two teams in the first half, while neither side managed more than a single shot on target. Their combined expected goals tally was 0.28, the quality of their shots just as unremarkable as the quantity. (Expected goals measures how likely an individual shot is to land in the back of the net, which means 0.28 xG for a total of five shots is a low conversion rate – and yes, makes for a banal game.)Things were only slightly better in the second half, though they tilted in West Ham's favor quickly when Tomas Soucek scored for the hosts in the 50th minute. Jarrod Bowen received the ball on the right flank and made a long pass towards goal, where a handful of teammates were waiting. Soucek was the first to gain a hold of it while standing at the near post, finishing the shot from close range and ensuring relegation-threatened West Ham had a much-needed advantage.The strange thing about the second half, though, was that United's productive attack never got their act together. They managed to outshoot West Ham the rest of the way, taking six shots after Soucek's goal while West Ham took just four, their reward finally coming in the sixth minute of stoppage time. Bryan Mbeumo whipped a cross into the box and Benjamin Sesko was there to receive, casually flicking the ball into the back of the net to ensure the Red Devils would extend their unbeaten run to five games.\nAgain, though, shot quantity was not matched by shot quality. United may have had more shots than West Ham after Soucek's strike but somehow, they never managed to outdo the hosts' xG tally – West Ham not only generated 0.49 xG from their final four shots of the game, slightly better than United's 0.4 xG from six shots, their overall xG count after 90 minutes was 1.03, better than United's paltry 0.62 showing at the final whistle.The sputtering attack is the latest in a growing trend for Carrick's United. Five games into his tenure as the head coach, the Red Devils average 2.2 goals per game, higher than the 1.7 goals per game tally they had this season under ex-coach Ruben Amorim. It may just be beginner's luck for Carrick, though – his version of the team takes an average of roughly three fewer shots per match and generates 0.5 fewer expected goals along the way.Though a sample size of five matches is small, the draw at West Ham paints a peculiar picture for Carrick's tenure in charge of United so far. Though four wins preceded Wednesday's tie, each of those games was fairly distinct; United outplayed an out-of-form Manchester City and Tottenham Hotspur during this stretch, overperformed against a frantic Arsenal, played an even game against Fulham and now underperformed against a West Ham side that currently sits in the drop zone.\nIt makes Carrick's impact on United hard to read in some ways, though he appears to have shifted the vibe since taking the helm last month. Amorim, his predecessor, was known for a rigid tactical approach while captain Bruno Fernandes said after Saturday's 2-0 win over Spurs that Carrick has afforded the players more flexibility – and responsibility.\"I think Michael came in with the right ideas of giving the players the responsibility, but also some freedom to take the responsibility on the pitch during the decisions that are needed,\" Fernandes told TNT Sport. \"He's very good with the words and I think he still remembers when I told him last time he was our manager, for our last game [during his four-game spell as a caretaker in 2021], and I was sure Michael could be a great manager and now he is showing it. We hope we can help him even more so everyone can see, not just us as the players, that we are good players and that is why we are at Manchester United, but also the staff is very good.\"The good news for Carrick and company is that it has not put that much of a dent in their hopes of qualifying for next season's edition of the UEFA Champions League – Chelsea's 2-2 draw with Leeds United means the Blues still sit a point behind them, though Liverpool can close the gap to three points with a win at Sunderland and Brentford can do the same against Arsenal.\nNo haircut for viral Manchester United fanWhile United are still on course for a finish inside the Champions League places, there is someone who has to start his streak from scratch – viral fan Frank Ilett, who has not cut his hair in over 500 days as he awaits a five-game winning streak from the team. After Saturday's victory over Spurs, the Red Devils got as close as they have since Ilett began his challenge, but the fan will now have to wait until mid-March at the earliest to get a haircut.\nCarrick said he was aware of Ilett and his growing mane but admitted on Monday that it would not provide added motivation for his side, who were instead focused on the task at hand on the pitch.\"My kids have made me aware of it,\" he said. \"I can understand what's going on with it and it does make me smile, but it certainly won't go into the team talk from a professional level.\"\nUnited's next five matches are against Everton, Crystal Palace, Newcastle United, Aston Villa and Bournemouth. Ilett said he intends to donate his strands to charity when – or if – he is finally able to cut his hair.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man United don't cut it at West Ham, draw puts viral fan's haircut dream on hold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/66daaec5-094d-4add-9c9a-6ae0a2b8eb82/thumbnail/1200x675/825cb7e36af2acd932b9aa7b1be85ce0/man-united-1.jpg"
      ],
      "datePublished": "2026-02-11T00:00:41.000Z",
      "dateModified": "2026-02-11T00:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Men's Olympic Hockey power ratings: Canada the favorite to win gold - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/2026-mens-olympic-hockey-power-ratings-canada-the-favorite-for-its-10th-gold-medal/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/05/999cbe40-dd55-4c29-9b89-d7b6ff1db2dc/thumbnail/1200x675/d8581fe8629c7f654203baf9c5438b59/usatsi-28152065z.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:45:37.000Z",
    "description": "\n        With NHL players back in the Winter Games and Russia not participating due to IOC sanctions, Canada is ready to reclaim its distinction as th",
    "body": "\n        With NHL players back in the Winter Games and Russia not participating due to IOC sanctions, Canada is ready to reclaim its distinction as the world's top nation in men's hockey. And most sportsbooks believe it will do just that at the 2026 Winter Olympics in Milan, Italy.The NHL hasn't sent its players to the Winter Games since 2014, when Canada won its ninth overall gold medal and third in four Olympics. The Canadians took home the bronze in 2018 but failed to medal four years ago for the first time since losing to Russia in the quarterfinals and placing seventh in the final rankings in 2006.Canada can snap a tie for most Olympic golds with the Russian team, which won seven as the Soviet Union and one each as the Unified Team (1992) and Olympic Athletes from Russia (2018). With a roster that includes the likes of Connor McDavid, Nathan MacKinnon and Macklin Celebrini, the chances of that happening are extremely good.The United States hopes to have a say in that matter as it seeks its first gold since the \"Miracle on Ice\" team in 1980. Team USA has won only two medals in 11 Winter Olympics since then, with both being silver.Canada and the U.S. are considered the top two contenders for the gold medal by a large margin, with the Canadians priced between +100 and +130 at the major sportsbooks and Team USA between +175 and +190. Ranking third across the board is Sweden (between +470 and +750), which hasn't won gold since 2006 and hasn't medaled since taking silver in 2014.Other nations expected to be in the running for a spot on the podium are Switzerland, Finland and Czechia. The NHL is well represented by all three teams, as well as Sweden, while the league also has players on the rosters of Germany, Latvia, Denmark, Slovakia and France.The preliminary round of the Olympic tournament begins Wednesday, Feb. 11, as each of the 12 teams face the other three in their group once. The nations are then ranked, with the top four advancing straight to the quarterfinals and the rest participating in the playoff round. The bronze medal game takes place on Feb. 21, while the winner of the gold medal will be decided the following day.Let's dive into the power ratings entering the preliminary round of the 2026 Winter Olympics men's hockey tournament, which will include the top five teams with the best chance to win gold, as well as their current odds to win gold at DraftKings Sportsbook. For more Winter Olympics betting tips and advice, check out our Winter Olympics betting guide.Bet on hockey at the Winter Olympics and get $300 in bonus bets if your first bet wins:Olympic men's hockey power ratings 1. Canada (+115)Team Canada has almost the exact same roster that won the 4 Nations Face-Off tournament a year ago, when it defeated Team USA in overtime in the final. It includes three of the top four scorers in the NHL this season in McDavid (96 points), MacKinnon (93) and Celebrini (81). The Canadians also have Sam Reinhart, Sam Bennett and Brad Marchand, who won the Stanley Cup with the Florida Panthers last campaign. There are only two players with previous Olympic experience, but Sidney Crosby and defenseman Drew Doughty both helped the nation win gold in 2010 and 2014. Colorado Avalanche teammates Cale Makar and Devon Toews anchor the blue line, while Mark Stone and Mitch Marner of the Vegas Golden Knights provide additional offensive punch. One can say Canada's only question mark is its goaltending, but Jordan Binnington has performed well on the big stage over his career as he backstopped the St. Louis Blues to their lone Stanley Cup championship in 2019 and was in the crease for Canada in last year's 4 Nations tournament.2. United States (+175)Team USA also has only two players with Olympic experience, as defensemen Brock Faber of the Minnesota Wild and Jake Sanderson of the Ottawa Senators both were on the 2022 squad as collegiate players when it finished fifth in Beijing. The Americans' roster also has a close-knit feel to it as it possesses two pairs of brothers. Ottawa's Brady Tkachuk and Florida's Matthew Tkachuk both were on the U.S. team at the 4 Nations tourney along with New Jersey Devils star Jack Hughes, who will be joined in Milan by Minnesota's Quinn Hughes -- the NHL leader among defensemen with 52 assists. Auston Matthews of the Toronto Maple Leafs, Vegas' Jack Eichel and Matt Boldy of the Wild are major offensive threats while three-time Vezina Trophy recipient Connor Hellebuyck, who also is the reigning Hart Trophy winner, figures to see the majority of the action in the crease. There isn't much of a drop off at all in goal as Jake Oettinger of the Dallas Stars and Boston Bruins netminder Jeremy Swayman also are on the roster.3. Sweden (+650)By no means should the Swedes be overlooked in this tournament. Their roster is chock-full of NHL players, including Filip Forsberg of the Nashville Predators, Toronto's William Nylander and Elias Pettersson of the Vancouver Canucks, and has six previous Olympians. Defensemen Oliver Ekman-Larsson of the Maple Leafs and Erik Karlsson of the Penguins helped Sweden to the silver medal in 2014, as did Colorado captain Gabriel Landeskog and Minnesota's Marcus Johansson. Victor Hedman of the Tampa Bay Lightning, who won the Norris Trophy in 2018 and the Conn Smythe in 2020, will be a stable force on the blue line while the trio of New Jersey's Jacob Markstrom and Minnesota teammates Filip Gustavsson and Jesper Wallstedt will occupy the crease. Wallstedt (four) and Gustavsson have posted a total of seven shutouts for the Wild this season.4. Finland (+1000)The Finns are hoping to successfully defend their first gold medal in men's hockey but have only one returning player from the 2022 roster -- defenseman Mikko Lehtonen, who also was on their 2018 team that finished sixth and played in 26 NHL games in 2020-21 with Toronto and the Columbus Blue Jackets. Dallas defenseman Miro Heiskanen and Eeli Tolvanen of the Seattle Kraken also were on Finland's 2018 club, while Utah Mammoth blue-liner Olli Maatta and Mikael Granlund of the Anaheim Ducks helped the nation capture bronze in 2014. Sebastian Aho of the Carolina Hurricanes and Dallas teammates Mikko Rantanen and Roope Hintz figure to provide offense in Milan while Nashville's Juuse Saros is likely to be Finland's No. 1 goaltender.Get $200 in bonus bets at FanDuel Sportsbook for Winter Olympics betting:5. Czechia (+2500)While Switzerland has more returning Olympians (10) than Czechia (seven), I give the latter the nod for the fifth spot due to their dynamic offensive duo of David Pastrnak and Martin Necas. Pastrnak leads Boston and is sixth in the NHL with 71 points while Necas ranks second on the Avalanche with 62 and is seven goals away from eclipsing the career high of 28 he set in 2022-23 with Carolina. Tomas Hertl of the Golden Knights (22 goals this season) also is a scoring threat and Anaheim's Lukas Dostal is a solid option in net for the Czechs, who haven't medaled since winning the bronze in 2006. Roman Cervenka, who had a 39-game stint with the Calgary Flames in 2012-13, will be appearing in his fifth Winter Games while defenseman Tomas Kundratek will be a three-time Olympian. Defenseman Radko Gudas of the Ducks and New York Islanders forward Ondrej Palat both represented their nation in 2014.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Men's Olympic Hockey power ratings: Canada the favorite to win gold - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/05/999cbe40-dd55-4c29-9b89-d7b6ff1db2dc/thumbnail/1200x675/d8581fe8629c7f654203baf9c5438b59/usatsi-28152065z.jpg"
      ],
      "datePublished": "2026-02-10T21:45:37.000Z",
      "dateModified": "2026-02-10T21:45:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Thomas injury update: Cleared to resume golf activity while eyeing return - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/justin-thomas-injury-update-back-pga-tour-return/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/15/00feb83c-91ed-48a0-ac4a-919640d396c6/thumbnail/1200x675/8f296f147d23e7730d0ad74aa6c3d97a/justin-thomas-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-10T23:57:32.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Justin Thomas has been cleared to resume all golf ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Justin Thomas has been cleared to resume all golf activity, the two-time major champion announced on Tuesday via social media. Thomas is eying the Florida Swing as possible timing for a PGA Tour return after undergoing a microdiscectomy in the middle of November 2025, just a few weeks after competing for the U.S. Ryder Cup team at Bethpage Black.\"After some follow-up imaging and meeting with my Dr and team, I'm officially cleared for all golf activity,\" Thomas wrote on Instagram. \"It feels great to be swinging freely again and getting some reps in on the course. I'm working hard to build up my strength and stamina to get back into golf shape before competing on the PGA Tour. Can't wait to get out there with the guys!\"Thomas' last PGA Tour start came at the 2025 Procore Championship, a FedEx Cup Fall event utilized by Ryder Cup captain Keegan Bradley to sharpen up his team before it competed against the Europeans.\nThe 16-time PGA Tour winner is coming off a 2025 season in which he broke a winless drought that stretched back to the 2022 PGA Championship. Thomas defeated Andrew Novak in a playoff at the RBC Heritage to claim the signature event one week after the Masters. He is currently ranked No. 12 in the Official World Golf Rankings.\"Recovery has gone well,\" Thomas shared on X in January. \"I'm slowly building back my strength and conditioning in the gym, and also hitting wedges/short irons. Little victories and patience have been the biggest part of the process. Taking it slow and listening to how I'm feeling each day!\n\"I'm looking to come back competitively at some point during the Florida swing. I know how important it is to get this injury behind me so that I'm only looking forward over the course of the season.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Thomas injury update: Cleared to resume golf activity while eyeing return - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/07/15/00feb83c-91ed-48a0-ac4a-919640d396c6/thumbnail/1200x675/8f296f147d23e7730d0ad74aa6c3d97a/justin-thomas-imagn.jpg"
      ],
      "datePublished": "2026-02-10T23:57:32.000Z",
      "dateModified": "2026-02-10T23:57:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jai Opetaia next fight: Aussie to face Brandon Glanton at Zuffa Boxing 04 for championship - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jai-opetaia-next-fight-brandon-glanton-zuffa-boxing-04-main-event/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/6eedb193-b50e-405a-b5bd-72147eea27c4/thumbnail/1200x675/7c30368560b43e5715b923ca2c6377ac/jai-opetaia-weighin.jpg",
    "tag": "Sports",
    "date": "2026-02-10T22:52:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jai Opetaia has been the biggest signing for Zuffa",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jai Opetaia has been the biggest signing for Zuffa Boxing, and now he has his first opponent set. Opetaia will face Brandon Glanton in the main event of Zuffa Boxing 04 on March 8 at the Meta APEX in Las Vegas, Dana White announced on Tuesday. The fight will crown the first Zuffa world champion with the Zuffa Boxing world cruiserweight title on the line. Opetaia (29-0, 23 KO) is the reigning IBF cruiserweight champion, having won the title with a 2022 decision over Mairis Briedis in a hard-fought battle that saw Opetaia break his jaw in two places. After a TKO of Jordan Thompson, Opetaia vacated the belt when the IBF ordered him to face Briedis in a rematch and the champ decided to face Ellis Zorro in a stay-busy fight while Briedis recovered from injury.Opetaia would regain the title in his next fight, defeating Briedis by decision in their rematch. He has since made four successful title defenses, all by knockout. His knockout of Huseyin Cinkara was a runner-up in the 2025 CBS Sports Knockout of the Year.\nThe goal for Opetaia has been to unify the four world championships in the division, but he has been unable to make any unification bouts happen, instead being forced to face a string of middling competition, with an April 2025 win over Chris Billam-Smith as the standout title defense in that stretch.In Glanton (21-3, 18 KO), Opetaia faces a fighter who has gone just 4-3 in his seven most recent fights. While that recent run may not look impressive on paper, Glanton lost to David Light by split decision, Soslan Asbarov by majority decision (Asbarov received a six-year suspension for a failed drug test after his next fight) and lost to Billam-Smith by a narrow unanimous decision, showing he can be competitive even in defeat.\nGlanton has also shown big power against lower-tier opposition and will be able to make Opetaia pay if the Aussie is not careful.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jai Opetaia next fight: Aussie to face Brandon Glanton at Zuffa Boxing 04 for championship - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/6eedb193-b50e-405a-b5bd-72147eea27c4/thumbnail/1200x675/7c30368560b43e5715b923ca2c6377ac/jai-opetaia-weighin.jpg"
      ],
      "datePublished": "2026-02-10T22:52:14.000Z",
      "dateModified": "2026-02-10T22:52:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rob Havenstein retires: Rams OL ending career after 11 years in NFL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rob-havenstein-retires-rams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/eac43a57-5f30-4e89-a84c-7be2f31d4d4e/thumbnail/1200x675/328058f4073984ce2eacd73d786b181f/gettyimages-2194943278-1.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:46:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Rams starting offensive lineman Rob Ha",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Rams starting offensive lineman Rob Havenstein announced his retirement after 11 seasons in the NFL. Havenstein, who missed several games in 2025 due to injury, spent his entire career with the Rams, who selected him in the second round of the 2015 NFL Draft. \"Thank you to all my teammates, coaches, and fans who have supported me and helped me over these past 11 years,\" Havenstein wrote on social media. \"I have had the time of my life with the Los Angeles Rams (formerly known as the St. Louis Rams) and can't thank the whole organization enough for giving me a shot back in 2015... As this chapter ends, I couldn't be more grateful, hopeful and excited to see what comes next!\" Havenstein, a product of Wisconsin, started 13 games at right tackle as a rookie -- while the Rams were still located in St. Louis -- and held that spot for the majority of his career. He was a member of the PFWA All-Rookie Team while blocking for former Rams running back Todd Gurley, who earned 2015 NFL Offensive Rookie of the Year honors. \nHavenstein maintained his spot at right tackle in 2017 when the Rams hired coach Sean McVay, who took Los Angeles to its first of two consecutive NFL playoff appearances in his first season with the franchise. With McVay leading the charge, Havenstein was a starter for the Los Angeles teams that won four NFC West titles, two NFC Championships, and one Super Bowl. He was in the lineup for Los Angeles' first seven games in 2025 but was placed on injured reserve in November due to knee and ankle bursitis. Havenstein was on the last year of a three-year, $34.5 million contract extension during the 2025 season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rob Havenstein retires: Rams OL ending career after 11 years in NFL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/eac43a57-5f30-4e89-a84c-7be2f31d4d4e/thumbnail/1200x675/328058f4073984ce2eacd73d786b181f/gettyimages-2194943278-1.jpg"
      ],
      "datePublished": "2026-02-10T21:46:46.000Z",
      "dateModified": "2026-02-10T21:46:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LIV Golf may face dilemma aiming to keep Bryson DeChambeau, Jon Rahm happy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/liv-golf-dilemma-bryson-dechambeau-jon-rahm/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/04/b7a52cbe-1272-485d-b72b-999f3a1081e8/thumbnail/1200x675/b870309161c0d618c4b14e3d7008b886/bryson-rahm.jpg",
    "tag": "Sports",
    "date": "2026-02-10T23:09:59.000Z",
    "description": "\n        LIV Golf may be facing its biggest challenge to date entering Year 5. Convincing stars to sign lucrative contracts to launch the league was o",
    "body": "\n        LIV Golf may be facing its biggest challenge to date entering Year 5. Convincing stars to sign lucrative contracts to launch the league was one task, but after failing to live up to the lofty goals and promises it made about changing the golf landscape forever, LIV Golf now must figure out how to get its top players to sign second contracts.Brooks Koepka and Patrick Reed have already departed with the former returning to the PGA Tour this season and the latter set to do the same in 2027. While they put a dent in LIV's star power, the two players most important to the league remaining relevant are still on board -- for now.Bryson DeChambeau and Jon Rahm are easily the two most competitive players that carry the LIV flag into golf's majors each year, but DeChambeau is in a contract year, and Rahm will have his deal run out in 2027. Retaining both DeChambeau and Rahm must be LIV Golf's top priority over the next two years. They are the two stars in their primes, and their presence legitimizes the entire operation. The problem is that those stars have divergent priorities, making it extremely difficult to keep both of them happy. \nLIV Golf's decision to move from 54-hole events to 72-hole events is the best recent illustration of the differing opinions of DeChambeau and Rahm on how the league should operate. As a result of the move, LIV Golf finally got the Official World Golf Ranking to begin awarding points it long coveted -- albeit limited to top 10 finishers under the \"Small Field Tournaments\" categorization. Gaining OWGR points was incredibly important to Rahm, who championed the move to 72-hole events, wanting to bring LIV Golf tournaments more in line with the rest of the sport. \"This is a win for the league and the players,\" Rahm said in a statement. \"LIV Golf is a player's league. We are competitors to the core, and we want every opportunity to compete at the highest level and to perfect our craft. Moving to 72 holes is the logical next step that strengthens the competition, tests us more fully, and if the growing galleries from last season are any indication, delivers more of what the fans want.\"\nDeChambeau likewise toed the party line in the initial release, but he changed his tune with comments he recently made to Today's Golfer questioning the move. \"It's definitely changed away from what we had initially been told it was going to be,\" DeChambeau says. \"So there is some movement that we've all been, I would say, interested in, and going, 'why that movement?' Because we were told it was going to be this. So that's definitely made us have some different thoughts about it.\"I've got a contract for this year, and we'll go through it there and see what happens after that. Look, it's 72 holes, it's changed, but we're still excited to play professionally and play for what we're doing and go across the world. I think it's going to be great for our [Crushers GC] team. Is it what we ultimately signed up for? No. So I think we're supposed to be different, so I'm a little indifferent to it right now.\"Hopefully it weighs positively on me over the course of time, but you never know. I'm not sure. We didn't sign up to play for 72.\"DeChambeau's take stands in stark contrast to Rahm, who later called the move \"absolutely massive.\" Given they are the two stars LIV Golf desperately needs to keep on the roster, their lack of alignment on what's most important for the league represents a serious dilemma for CEO Scott O'Neil. Ever since Rahm joined, many have wondered whether he had regrets about jumping ship from the PGA Tour. Rahm signed with LIV Golf in December 2023 when the framework agreement between Saudi Arabia's Public Investment Fund (which owns LIV) and the PGA Tour was still in play. Many believed that would bring the stars of the two tours back together sooner rather than later.However, nearly three years after the announcement of that agreement, which stunned and angered some players on the PGA Tour, it has not yielded anything beyond an awkward TV segment and some meetings that have apparently gone nowhere.The PGA Tour recently rejected a $1.5 billion investment offer from the PIF, offering the clearest indication yet that the Tour has decided to move in another direction. That's left Rahm to play out his deal and try to use his sizable influence to steer the league toward his vision. Rahm's competitive nature has always seemed a bit at odds with LIV Golf's more laid-back, party atmosphere, bristling at times on the course about the extracurriculars going on around him. Moving to 72-hole events provides, as Rahm stated, a fuller test -- and also makes it more likely the best players win more often, as the longer the format, the more likely the cream rises to the top.\nDeChambeau, meanwhile, embraces his role as golf's biggest entertainer. That's evident in his emergence as a YouTube star, where his wildly popular channel has further cemented his place as the golfer of the people. One of the perks of LIV Golf for DeChambeau is the opportunity to pursue additional opportunities on the content creation side, as fewer and shorter events lead to more free time. Adding another day of tournament play to each event takes away from that flexibility, and for DeChambeau, time is money. As DeChambeau notes, perhaps the 72-hole move will grow on him, but after offering his initial support of the move, it's clear that the more he's thought about it, the less he likes it. Some of that is undoubtedly a negotiation tactic. DeChambeau will be well aware of the leverage he has in contract talks with LIV Golf, as his departure would be the surest sign of impending doom for the league. If they want him to play more, he's signaling clearly that they'll need to pay more. \nHowever, with reports swirling about LIV Golf potentially tightening its purse strings and not offering long-term guaranteed deals, it's fair to wonder just how high an offer might reach simply to keep DeChambeau in the fold. If it's not only a matter of throwing an unfathomable amount of money at DeChambeau, LIV Golf must ensure DeChambeau buys into their vision.This is where one of LIV Golf's initial strengths -- being untethered to history and tradition -- becomes a significant challenge. The lack of a strong foundation allows the league's two stars the opportunity to pull it in different directions, trying to shape this still-fledgling circuit in their preferred image. That's never been more evident than in LIV's restructuring to 72 holes. DeChambeau signed up for the disruptive tour, the one that promised to break the mold. The 54-hole element was the foundation of that -- it's literally in the name, \"LIV\" -- but in their quest to bring in more star power, they had to open their base to those who are not only intrigued by the idea of doing something different.\nRahm's more traditional vision has pulled LIV Golf back towards the rest of the sport, perhaps at the expense of DeChambeau's desire to zig where others zag. Somehow, LIV Golf must bridge that gap. Perhaps the money will ultimately be too good for either man to pass up, but they've already achieved generational wealth with their first deals. Now, they'll want more influence, and it's hard to see how LIV Golf can sell a vision for the future upon which both will agree.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LIV Golf may face dilemma aiming to keep Bryson DeChambeau, Jon Rahm happy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/04/b7a52cbe-1272-485d-b72b-999f3a1081e8/thumbnail/1200x675/b870309161c0d618c4b14e3d7008b886/bryson-rahm.jpg"
      ],
      "datePublished": "2026-02-10T23:09:59.000Z",
      "dateModified": "2026-02-10T23:09:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Santander injury update: Blue Jays slugger out 5-6 months - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/anthony-santander-injury-blue-jays-shoulder-surgery/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/f3e2bdd5-ed66-476c-808b-dc687ad477e0/thumbnail/1200x675/b17ba1d98cfd5500ab93b245a135f1e5/santander-getty.png",
    "tag": "Sports",
    "date": "2026-02-10T22:28:58.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Toronto Blue Jays enter the 2026 season as the",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Toronto Blue Jays enter the 2026 season as the defending AL East and American League champions. The goal this time around would be to erase the sting of losing Games 6 and 7 of the World Series at home, especially after going to the ninth inning with a lead in Game 7. They lost Bo Bichette in free agency, but otherwise return a strong team for this season.And then bad news struck right at the start of spring training. Oufielder/designated hitter Anthony Santander needs left labral (shoulder) surgery and will miss five to six months, Blue Jays manager John Schneider announced Tuesday.Santander, 31, signed a five-year, $92.5 million deal with the Jays last offseason and didn't provide much in his first year. He hit .175/.271/.294 (57 OPS+) with -1.0 WAR in 54 games. He missed significant time, requiring two different stints on the injured list with left shoulder inflammation. Just because the Jays didn't get anything from Santander last season doesn't mean they weren't counting on him this time around, though. The offense lost one of its top contributors in Bichette to free agency. In looking to pick up that slack, Santander was one of the most obvious places. Now that is off the table until past the halfway point of the season. \nThird baseman Kazuma Okamoto was signed out of Japan and that's one place where the Blue Jays will look to alleviate some of the Bichette loss. Nathan Lukas and Davis Schneider are also options to see increased playing time. Santander is a switch-hitting outfielder while Lukas (left) and Schneider (right) could platoon in that now-open lineup spot. Also remember that injuries held center fielder Daulton Varsho to just 71 regular-season games last year. This is to say that while Santander was being counted on to beef up the offense, the Blue Jays have options to replace him and areas where they can still pick up the lost production from Bichette's signing with the Mets and Santander's surgery.\nThe Blue Jays won the AL East over the Yankees last season via tiebreaker, as both finished 94-68, tied for the best American League record. Baseball Prospectus released its PECOTA projections on Tuesday and essentially have the two teams in a dead heat atop the AL East again.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Santander injury update: Blue Jays slugger out 5-6 months - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/f3e2bdd5-ed66-476c-808b-dc687ad477e0/thumbnail/1200x675/b17ba1d98cfd5500ab93b245a135f1e5/santander-getty.png"
      ],
      "datePublished": "2026-02-10T22:28:58.000Z",
      "dateModified": "2026-02-10T22:28:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rockets vs. Clippers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/rockets-clippers-odds-prediction-spread-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/39cf4f94-8758-4734-b648-0a8ec934fc76/thumbnail/1200x675/e5d6e136926abc318068c6c9528fa591/kevin-durant-alperen-sengun-houston-rockets-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:58:26.000Z",
    "description": "\n        Two streaking Western Conference teams will square off on Tuesday's NBA schedule as the Los Angeles Clippers visit the Houston Rockets. L.A. ",
    "body": "\n        Two streaking Western Conference teams will square off on Tuesday's NBA schedule as the Los Angeles Clippers visit the Houston Rockets. L.A. (25-27) has won six of its last nine and is coming off a 115-96 Sunday victory over Minnesota. Houston (32-19) is also 6-3 over its last nine, with its last contest being a Saturday win over Oklahoma City, 112-106. Darius Garland (toe) remains out and won't make his Clippers debut.Tipoff is at 8 p.m. ET from the Toyota Center in Houston. The teams split their two matchups earlier this season, with the home team winning each. The latest Clippers vs. Rockets odds list Houston as the 8.5-point favorite, with the over/under at 213.5. Before making any Rockets vs. Clippers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Clippers vs. Rockets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Rockets vs. Clippers:Clippers vs. Rockets   spread                                                                     Rockets -8.5 at DraftKings SportsbookClippers vs. Rockets   over/under:    213.5 pointsClippers vs. Rockets   money line:    Rockets -315, Clippers +251Clippers vs. Rockets   picks: See picks at SportsLineClippers vs. Rockets   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Rockets vs. Clippers picksSportsLine's model has simulated Clippers vs. Rockets 10,000 times and is going Over on the total (213.5 points). The model takes into account prior matchups, and each of the last five meetings between these two have eclipsed the total. It's worth noting that all five of those had a higher O/U than 210.5, as the five averaged 233.4 combined points. Three of the last four Clippers road games have gone over, and with the team trading away All-Defensive member, Ivica Zubac, Los Angeles is nowhere near as stout defensively.Two players are projected to top 20 points in scoring, while another eight players score more than 9 points. Given that, and the spread trends with these squads, SportsLine's model has the total being eclipsed by double-digits. The model has the Over in 62% of simulations.It also says one side of the spread hits well over 50% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Rockets vs. Clippers, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Clippers vs. Rockets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rockets vs. Clippers prediction, odds, spread, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/39cf4f94-8758-4734-b648-0a8ec934fc76/thumbnail/1200x675/e5d6e136926abc318068c6c9528fa591/kevin-durant-alperen-sengun-houston-rockets-cbs-imagn.jpg"
      ],
      "datePublished": "2026-02-10T21:58:26.000Z",
      "dateModified": "2026-02-10T21:58:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-150-bonus-bets-clippers-rockets-nebraska-purdue-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:59:07.000Z",
    "description": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bet",
    "body": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bets after placing a first wager of $5 or more. The Cornhuskers and Boilermakers rely on their perimeter shooting, so SportsLine's proven computer model is taking the Over (147.5) in that game. According to the latest college basketball odds, Nebraska is favored by 1.5 points at home. It also likes Iowa State (-6.5) to cover against TCU, along with the Over (209.5) in Rockets vs. Clippers in its NBA best bets. Claim the latest bet365 bonus code CBSSPORTS here:Check out our bet365 bonus code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Tuesday's top picks, best betsNebraska vs. Purdue: Over 147.5 (-119)Iowa State (-6.5) vs. TCURockets vs. Clippers: Over 209.5 Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +712 (risk $100 to win $712). Bet it at bet365 here:Over 147.5 in Nebraska vs. Purdue\nPurdue avoided an upset loss against Oregon on Saturday when Fletcher Loyer hit a clutch 3-pointer with less than one minute remaining, and he is 10 of 14 from 3-point range over his last two games. The Boilermakers are shooting nearly 40% from downtown this season, while Nebraska takes more than half of its shots from the perimeter. Nebraska junior Pryce Sandfort leads the Big Ten with 80 3-pointers, shooting 40.6% from distance. The model has these teams combining for 156 points, as the Over hits in 74% of simulations. Back the Over at bet365 here:Iowa State -6.5 vs. TCUTCU has struggled against the top teams on its schedule this season, going just 3-6 against Quad 1 opponents. The Horned Frogs recently lost to then-No. 10 Houston by nine points at home before getting crushed by unranked Colorado in an 87-61 final on Feb. 1. Iowa State is riding a five-game winning streak, with four of those wins coming by 13-plus points. The Cyclones have won and covered the spread in six straight head-to-head meetings between these teams, and the model has them covering 66% of the time on Tuesday night. Back Iowa State at bet365 here:Over 209.5 in Rockets vs. ClippersThe Rockets and Clippers have gone Over the total in five straight meetings, and the over/under was 219.5 when they met on Dec. 23. They combined for 236 points in that contest, shooting a combined 29 of 67 from 3-point range. The Clippers have gone Over in four of their last six games, and their last four games have featured totals of 219 or higher. The model thinks this total is too low, as it projects 222 points to help the Over cash 68% of the time. Back the Over at bet365 here:\nLooking for more NBA and college basketball picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg"
      ],
      "datePublished": "2026-02-10T21:59:07.000Z",
      "dateModified": "2026-02-10T21:59:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-mavericks-odds-prediction-time-spread-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:12:03.000Z",
    "description": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in th",
    "body": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in the conference and coming off back-to-back losses, including a 109-103 defeat to Philadelphia on Saturday. The Mavs (19-33) are the No. 11 seed and have lost each of their last seven games, most recently falling, 138-125, to San Antonio on Feb. 7. Klay Thompson (rest) is listed as questionable for Dallas.Tipoff is at 9 p.m. ET from Mortgage Matchup Center in Phoenix. The Suns have won four of the last five matchups, including the lone meeting earlier this season. The latest Mavericks vs. Suns odds list Phoenix as the 8.5-point favorite, with the over/under at 227.5. Before making any Suns vs. Mavericks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Mavericks vs. Suns 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Suns vs. Mavs:Mavericks vs. Suns   spread                                                                     Suns -8.5 at DraftKingsMavericks vs. Suns   over/under:    227.5 pointsMavericks vs. Suns  money line:    Suns -309, Mavericks +246Mavericks vs. Suns   picks: See picks at SportsLineMavericks vs. Suns   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Suns vs. Mavericks picksSportsLine's model has simulated Mavs vs. Suns 10,000 times and is going Over on the total (227.5 points). These teams have met twice since the start of 2025, with both contests eclipsing the total. Each of the last two Mavs games have also gone over, and the team is coming off allowing 138 points in its last contest, which is the most Dallas has given up in a non-overtime game all season.With those defensive struggles for Dallas, the Suns are projected to score 7 points more than their season average. Even with that, the Mavericks are forecasted to have more double-digit scorers (six) than Phoenix (five). The model calls for the total to be surpassed with points to spare, with the Over hitting in 51% of simulations.It also says one side of the spread hits over 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Suns vs. Mavs, and which side of the spread hits over 60% of the time? Visit SportsLine now to see which side of the Mavericks vs. Suns spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:12:03.000Z",
      "dateModified": "2026-02-11T01:12:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]