[
  {
    "title": "Wake Forest vs. Pittsburgh prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/wake-forest-pittsburgh-odds-prediction-time-2026-college-basketball-picks-tuesday-january-27/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/d17d2b5a-5eb1-4db0-95ea-7401a6a50751/thumbnail/1200x675/749c4884e750f1fbdac9f3450cdb1ee2/cameron-corhen-pitt-pantherscbs.jpg",
    "tag": "Sports",
    "date": "2026-01-27T20:00:52.000Z",
    "description": "\n        Teams looking to get back on track clash when the Wake Forest Demon Deacons take on the Pittsburgh Panthers in an ACC matchup on Tuesday nigh",
    "body": "\n        Teams looking to get back on track clash when the Wake Forest Demon Deacons take on the Pittsburgh Panthers in an ACC matchup on Tuesday night. Wake Forest is coming off a 90-69 loss at Duke on Saturday, while Pitt dropped an 81-72 decision to North Carolina State that same day. The Demon Deacons (11-9, 2-5 ACC), who are tied for 13th in the conference, have lost two consecutive games. They are 1-3 on the road this season. The Panthers (8-12, 1-6 ACC), who are tied for 17th in the ACC, have lost three in a row and are 6-7 on their home court.Tipoff from Petersen Events Center in Pittsburgh is set for 6 p.m. ET. Pitt is a 1.5-point favorite in the latest Wake Forest vs. Pittsburgh odds from DraftKings Sportsbook, while the over/under for total points scored is 148.5. Before making any Wake Forest vs. Pittsburgh picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 13 on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and it is on a 6-0 roll on college basketball side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Wake Forest vs. Pitt 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Pitt vs. Wake Forest:Wake Forest vs. Pittsburgh                                                                                                                                            spread:    Pittsburgh -1.5 at DraftKings SportsbookWake Forest vs. Pittsburgh                                                                                                                           over/under:    148.5 pointsWake Forest vs. Pittsburgh     money line:    Pittsburgh -114, Wake Forest -106Wake Forest vs. Pittsburgh                                                                                                                                                         picks:    See picks at SportsLineWake Forest vs. Pittsburgh                                                                                                                                                         streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Wake Forest vs. Pittsburgh picksSportsLine's model is going Over on the total (148.5 points). The Over has hit in nine of the last 10 meetings between the teams, including each of the last six. The Over has also hit in five of the last six Demon Deacons games, and seven of the last 10 Panthers games. The model projects the Demon Deacons to have four players register 11.3 points or more, including Juke Harris' projected 17.4 points. The Panthers, meanwhile, are projected to have five players score 10.5 or more points, led by Cameron Corhen, who is projected to score 16.1 points. The model projects a combined total of 150 points as the Over clears 55% of the time.The model also says one side of the spread hits nearly 70% of the time. You can only see that pick at SportsLine.So who wins Wake Forest vs. Pittsburgh, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Wake Forest vs. Pittsburgh spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wake Forest vs. Pittsburgh prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/d17d2b5a-5eb1-4db0-95ea-7401a6a50751/thumbnail/1200x675/749c4884e750f1fbdac9f3450cdb1ee2/cameron-corhen-pitt-pantherscbs.jpg"
      ],
      "datePublished": "2026-01-27T20:00:52.000Z",
      "dateModified": "2026-01-27T20:00:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Freeman transfer: Villarreal move a smart risk for USMNT right back - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/alex-freeman-villarreal-21-year-old-usmnt-right-back-mls-orlando-city-sc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/a25e13d4-d20a-45ee-8d51-4071d50e801f/thumbnail/1200x675/0f2962ca461d549e625f59d4cdfcb6d4/untitled-design-2026-01-27t205353-130.png",
    "tag": "Sports",
    "date": "2026-01-27T20:08:05.000Z",
    "description": "\n        Ahead of the World Cup, transfers take on a much greater importance. If you're already a starter at a club, leaving with six months to go unt",
    "body": "\n        Ahead of the World Cup, transfers take on a much greater importance. If you're already a starter at a club, leaving with six months to go until the tournament takes place has heightened risks and rewards. The possibility a move goes wrong and a player falls out of contention at his new club always looms, but if all goes well, and a player excels, the right move could elevate a squad player on his national team to a starting role. That's the position right back Alex Freeman hopes to find himself in. After breaking onto the United States men's national team scene, Freeman could be set to continue his meteoric rise with a move to Spanish club Villarreal, according to the Athletic. For a player who just made their first start for Orlando City SC in March of 2025 before winning the league's Young Player of the Year award in October, it's wild to consider what a difference a year makes, but Freeman has met every test in his career so far, and a move to Spain could see him compete with Sergino Dest for the starting right back role on the USMNT. With Villarreal needing to replace starting right back Juan Foyth, after the team confirmed he injured in Achilles tendon over the weekend, there's very much a chance that Freeman could end up as a starter with the club. The Yellow Sumbarine are also very familiar with MLS, as Tajon Buchanan and Tami Oluwaseyi are currently contributing to the squad.But it's far from a sure thing. Freeman will have a learning curve making the jump to Spain. While he's used to operating in attacking areas as a modern fullback, Freeman has largely been able to get by on his physical tools. As a multi-sport athlete growing up, he's been able to use that and size to his advantage in MLS, but moving abroad, work on defensive positioning and passing will need to be done. Spain is a good place to do that due to it being quite a technical league, but Freeman's physical skills will also help with that.As you can see in the chart below, which compares Freeman to other wing backs and fullbacks, his attacking production has been elite for Orlando, but his passing and defending still leave a lot of room for growth, to put it gently.\n\n                                                                    CBS Sports\n                                                            His first start for the USMNT was facing Turkiye in a friendly in June, where Freeman had the unenviable task of tracking Kenan Yildiz in the match. While he was beaten at the start of the match, it was something that he recovered from to now be on the cusp of making the World Cup\"It was my first U.S. game, my first start, and I look up, and I have to go against the guy who has played for Juventus and has been a key player. So I feel like going into that kind of game, it was a moment where I'm like, dang, I really have to be at my best,\" Freeman said about that experience, speaking to CBS Sports in October. \"That first pass I got beaten behind, and after that I was like, 'Oh my god, it's going to be a long game,' me trying to get comfortable and find confidence in myself in that kind of game.\"For a young player, being able to go into the deep end and come out swimming is an intangible that can't always be accounted for. Some players have the tools, but when they're faced with a challenge, aren't able to rise to the occasion; that hasn't been the case for Freeman so far. Even when it comes to leaving Orlando for a move to Spain, when he left home at 16 to join the Weston FC academy, the 21-year-old is better adjusted for this move than the average young player leaving MLS.\nOf course, a move doesn't come without risk, but given Villarreal's work with MLS exports and Freeman's ability to adapt, it's a match that could work on paper if he's able to improve his game to thrive in Spain. And that's where things could get interesting because with how rapid Freeman's improvement has been, the World Cup on home soil could be a fascinating time. USMNT outlook During 2025, only two players, Diego Luna and Max Arfsten, earned more caps for the UMSNT than Freeman's 13, despite the right back making his debut for the team. He was even able to open his USMNT scoring account in a big way with a brace against Uruguay in one of the team's best performances of the year under Mauricio Pochettino. With the right back position very much unsettled heading into a critical March where the USMNT will face Belgium and Portugal, Freeman will have time to work with the squad in Villarreal and see if he can push for a starting role.With Tim Weah and Dest both playing right back or right wing back at a Champions League level for Marseille and PSV, respectively, there will be a lot for Freeman to do, especially since sitting on the bench in Spain could hurt his chances of making the World Cup squad. It's an ultimate situation of betting on yourself as a player, and for Villarreal, with the move only costing a reported $4 million up front, it's a worthwhile flier for them. With other prominent moves like Fulham chasing Ricardo Pepi, and Toronto FC after Josh Sargent, Freeman may not be the only American on the move, but he could be the one to end up in the best position to hit the ground running in Spain. This is something that could leave Pochettino with tough decisions to make moving forward, but with the USMNT looking to better their round of 16 finish at the 2022 World Cup, that's only a good thing.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Freeman transfer: Villarreal move a smart risk for USMNT right back - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/a25e13d4-d20a-45ee-8d51-4071d50e801f/thumbnail/1200x675/0f2962ca461d549e625f59d4cdfcb6d4/untitled-design-2026-01-27t205353-130.png"
      ],
      "datePublished": "2026-01-27T20:08:05.000Z",
      "dateModified": "2026-01-27T20:08:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Farmers Insurance Open odds, predictions, field: PGA picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/2026-farmers-insurance-open-odds-field-picks-predictions-projected-leaderboard-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/de78eaa1-501f-4fbf-9cc5-786b24a3121c/thumbnail/1200x675/c304fd22da221affc7cbf50dd452c418/patrick-cantlay-pga-golf-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-27T20:00:07.000Z",
    "description": "\n        The 2026 Farmers Insurance Open begins on Thursday with a strong field headed to the Torrey Pines South Course in San Diego. Scottie Scheffle",
    "body": "\n        The 2026 Farmers Insurance Open begins on Thursday with a strong field headed to the Torrey Pines South Course in San Diego. Scottie Scheffler, who won his 2026 season debut at The American Express, isn't playing this week, opening up the field a bit for big names such as Xander Schueffele, Ludvig Aberg and Patrick Cantlay. Schauffele is the +1300 favorite in the latest 2026 Farmers Insurance Open odds from FanDuel Sportsbook. Aberg is close behind at +1700 with Cantlay at +2000. Defending champion Harris English is +3300, while Brooks Koepka is +5500 as he makes his PGA Tour return after recently leaving LIV Golf. Before locking in any 2026 Farmers Insurance Open 2026 picks, or making any PGA DFS picks on sites like FanDuel or DraftKings, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.SportsLine's proprietary model, built by DFS pro Mike McClure, has been red-hot since the PGA Tour resumed in June 2020. In fact, the model is up over $8,000 on its golf betting picks since that point, nailing tournament after tournament.This same model has also nailed a whopping 16 majors entering the weekend, including the 2025 Masters -- its fourth Masters in a row -- as well as this year's PGA Championship and Open Championship. Anyone who has followed its sports betting picks could have seen massive returns on betting sites. \nNew users can also target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:Now that the 2026 Farmers Insurance Open field is locked in, the model simulated the tournament 10,000 times, and the results were surprising. Head to SportsLine now to see the projected leaderboard. 2026 Farmers Insurance Open predictions One major surprise the model is calling for at the Farmers Insurance Open 2026: Si Woo Kim, who is +2700, stumbles and falls well out of the top 5. He's a golfer to fade this week. Kim is off to a hot start this season with a T11 at the Sony Open and a T6 at The American Express last week. He was in the final group on Sunday before before a fourth-round 72. This event has been a struggle for Kim, however, as he has no top-10 finishes in eight tries and has missed the cut twice in his last appearances at this tournament. See who else to fade here. \nAnother surprise: The model calls Cantlay one of the best betting values this week. He's a golfer to target if you're looking for a big return. He finished T13 at The American Express with four sub-70 rounds. The California native doesn't have a great track record at this event, but he did shoot a first-round 65 last year at Torrey Pines before struggling over the weekend. The model is projecting a more consistent effort for him this year and has him as one of its top 2026 Farmers Insurance Open contenders. See who else to pick here. New users can also check out the latest FanDuel promo code and get $200 in bonus bets at FanDuel if your $5 bet wins:How to make 2026 Farmers Insurance Open picksThe model is targeting five longshots with odds of +2500 or higher in its list of the top-10 contenders. You can only see the model's picks here. \nWho will win the 2026 Farmers Insurance Open, and which longshots will stun the golfing world? Check out the 2026 Farmers Insurance Open odds below and then visit SportsLine to see the projected leaderboard, all from the model that's nailed 16 golf majors, including three in 2025.2026 Farmers Insurance Open odds, favorites Get full 2026 Farmers Insurance Open picks, best bets and predictions here. (odds via FanDuel and subject to change)Xander Schauffele +1300Ludvig Åberg +1700Patrick Cantlay +2000Cameron Young +2200Hideki Matsuyama +2500Maverick McNealy +2700Si Woo Kim +2700Jason Day +2700Chris Gotterup +2700J.J. Spaun +2700Ryan Gerard +3000Harris English +3300Taylor Pendrith +3300Will Zalatoris +3500Samuel Stevens +4000Michael Thorbjornsen +4000Matt McCarty +4000Jake Knapp +4000Nicolai Højgaard +4000Keegan Bradley +4000Wyndham Clark +4000Adam Scott +4000Rasmus Højgaard +4500Patrick Rodgers +5000Justin Rose +5000Akshay Bhatia +5000Pierceson Coody +5000Max Homa +5000Garrick Higgo +5000Alex Noren +5000Sahith Theegala +5000Marco Penge +5500Brooks Koepka +5500Max Greyserman +5500Davis Thompson +6000Rasmus Neergaard-Petersen +7000Johnny Keefer +7000Andrew Novak +7500Aaron Rai +7500Alex Smalley +7500Denny McCarthy +7500Haotong Li +7500Thorbjørn Olesen +7500Michael Brennan +8000Kevin Yu +8000Christiaan Bezuidenhout +8000Mac Meissner +8000Keith Mitchell +8000Doug Ghim +10000Tony Finau +10000Adrien Dumont de Chassart +10000Vince Whaley +10000Lee Hodges +10000Keita Nakajima +10000Eric Cole +10000Jordan Smith +10000Ricky Castillo +10000Richard Hoey +10000Aldrich Potgieter +10000Max McGreevy +10000Jesper Svensson +10000Tom Kim +10000Matt Wallace +10000S.H. Kim +10000Kristoffer Reitan +10000Billy Horschel +10000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Farmers Insurance Open odds, predictions, field: PGA picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/de78eaa1-501f-4fbf-9cc5-786b24a3121c/thumbnail/1200x675/c304fd22da221affc7cbf50dd452c418/patrick-cantlay-pga-golf-imagn-images.jpg"
      ],
      "datePublished": "2026-01-27T20:00:07.000Z",
      "dateModified": "2026-01-27T20:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Burrow 'not going anywhere,' says Bengals teammate Chase Brown - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-rb-chase-brown-joe-burrow-rumors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/1533d5eb-bd66-4819-9064-110ffb3acc26/thumbnail/1200x675/e9dc19f56c6fa814cc610bf3a74be155/burrowbrown.png",
    "tag": "Sports",
    "date": "2026-01-27T19:48:44.000Z",
    "description": "\n        While Christmas was just over a month ago, Cincinnati Bengals running back Chase Brown has delivered a late gift to Bengals fans in the form ",
    "body": "\n        While Christmas was just over a month ago, Cincinnati Bengals running back Chase Brown has delivered a late gift to Bengals fans in the form of a message regarding quarterback Joe Burrow and his future with the franchise. Some of Burrow's comments near the end of the regular season has led to speculation about his desire to remain in Cincinnati, who is coming off a third consecutive non-playoff season. Burrow is signed through the 2029 season, but that hasn't stopped unfounded rumblings about whether or not he will seek a trade or even retire before his contract expires. Brown, however, has made it clear that Bengals fans have nothing to worry about. \"Joe's not going anywhere,\" Brown told CBS Sports. \"I think that was totally blown out of proportion. It was definitely a good talking point for people. ... It gave the media a lot to talk about and probably made [Burrow's] Twitter notifications go off, but Joe's not going anywhere.\" \n\"You heard it from my wing man right there,\" added Bengals wideout Tee Higgins. Speaking of wing man, Higgins and Brown are part of Bounty's Wingman program in the run up to the Super Bowl, a game that Higgins, Burrow and the rest of the Bengals nearly won four years ago. Against the Rams in Super Bowl LVI, Higgins caught a pair of touchdown passes that included a 75-yard score on a throw from Burrow that gave the Bengals a second half lead. Cincinnati ultimately came up short in the game, however, before losing another close game to the Kansas City Chiefs in the following year's AFC title game.\nInjuries to Burrow have largely contributed to the Bengals' recent struggles. He missed the final seven games of the 2023 season after suffering a wrist injury that required surgery. This past season, Burrow missed nine games after injuring his toe in Week 2. The Bengals, who were 2-0 at the time of Burrow's injury, went just 1-8 during his absence. Burrow returned to the lineup in Week 13 and led Cincinnati to an upset win over Baltimore that kept their flickering playoff hopes alive. That hope was quickly extinguished, however, after the Bengals lost their next two games that included a 24-0 loss to the Ravens in what was arguably the worst game of Burrow's career. While their playoff hopes were dashed, Cincinnati still put together two of their most impressive performances of the season in wins over the Dolphins and Cardinals. And while their season ended with a loss to the Browns, the Bengals were nonetheless a much better team upon Burrow's return, especially on offense. \n\"We picked up some momentum at the end of the season that we can carry into this coming season,\" said Brown, who rushed for a career-high 1,019 yards this season. \"There's a lot that we went through this year. We lost our quarterback. We had multiple different quarterbacks, and that's hard on everybody on offense and definitely hard on receivers. \"When you look at the season as a whole, we went through a lot. So I look forward to having a full season with everybody. Not that that's promised, but that's what I look forward to.\"Adding insult to injury was the fact that the AFC North -- a division that had all four teams finish with a winning record in 2023 -- had an extremely down year. The Steelers (the only team the Bengals won during Burrow's absence) were the only team to post a winning record. Had Burrow stayed healthy, it's quite possible that the Bengals would have won the North going away. \n\"I think the main thing is we always want to be in control of our playoff hopes,\" Brown said. \"The position that we were in, we didn't have any control the last part of the season, so there were a lot of things that had to happen to go our way. It is hard to see it play out that way, though, because we know what we would have been capable of if we had made it into the playoffs.\"In addition to having Burrow and one of the NFL's best group of skill players, the Bengals also have the division's longest-tenured head coach in Zac Taylor, who was given a public vote of confidence from team owner Mike Brown this offseason. Will that stability give the Bengals an edge this season?\"I don't know if it can give us one,\" Higgins said, \"but I hope so.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Burrow 'not going anywhere,' says Bengals teammate Chase Brown - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/1533d5eb-bd66-4819-9064-110ffb3acc26/thumbnail/1200x675/e9dc19f56c6fa814cc610bf3a74be155/burrowbrown.png"
      ],
      "datePublished": "2026-01-27T19:48:44.000Z",
      "dateModified": "2026-01-27T19:48:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trotter's Trends: Charles Bediako makes Alabama SEC's most dangerous team - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/trotters-trends-alabama-charles-bediako-all-defense-team-mid-majors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/9f7489a9-0a90-4acf-a6f8-d1dbcb24caaa/thumbnail/1200x675/0dab6a358157e18325bfd351284ebce6/usatsi-28082156-1.jpg",
    "tag": "Sports",
    "date": "2026-01-27T19:53:37.000Z",
    "description": "\n        Alabama's lightning-rod decision to play Charles Bediako has made it a punching bag, and Nate Oats' crew felt the full brunt of the self-indu",
    "body": "\n        Alabama's lightning-rod decision to play Charles Bediako has made it a punching bag, and Nate Oats' crew felt the full brunt of the self-induced wrath after falling to unranked Tennessee 79-73 in front of its hard-hat-wearing, home faithful.The jeers came from everywhere, but no one was pettier than Tennessee basketball's official account, which dropped an A+ diss track.\nThis is what Oats signed up for when he ushered in a pro in Bediako, who is getting a controversial redo after he had the opportunity to stay in college in 2023 and chose to leave.\n        \n            \n                Were Alabama fans cheering Charles Bediako -- or the erosion of the NCAA?\n                \n                    John Talty                \n            \n                            \n    \n                \n                    \n    \nTuesday was the original date for Bediako's preliminary injunction, but weather concerns have pushed it back (it hasn't been rescheduled yet), allowing Bediako to obtain another 10-day temporary restraining order. He will play against Missouri on Tuesday. And again in Friday's road clash against Florida. Oh, and at least one more time next Wednesday against Texas A&M. Alabama has no choice but to take the sneers and digs.\nIt will also get its revenge if Bediako is allowed to play the rest of the year.This Alabama team, if healthy, has a chance to be really, really dangerous. A year after producing two Final Four squads and the national champion, SEC does not have an elite team this season, but Alabama will have the personnel to rise above the morass of good, but flawed, programs that sit in the upper zip code of SEC basketball.It didn't show it against the Vols -- injured starting guard Aden Holloway and emerging freshman wing Amari Allen were sorely missed -- but Oats' vision with Bediako in the fold is clear. Allen and Holloway do not have significant injuries, so Alabama's rotation is not far away from looking deep and deadly.Guards: Labaron Philon, Aden Holloway, Latrell Wrightsell Jr.Wings: Amari Allen, Houston Mallette, Jalil BetheaForwards: Taylor Bol Bowen, London JemisonBigs: Aiden Sherrell, Charles Bediako, Noah WilliamsonWe already knew Alabama had elite guard play. Philon can go band-for-band with anybody in America, period, and Holloway has been better than Mark Sears with half the fanfare. We already knew Alabama had a flock of shooters. But Bediako unlocks a new lever for this club. Tennessee shot just 50% at the rim during the 25 minutes that Bediako was on the floor. It's just one game, but that's not nothing. Bediako instantly gave Alabama's offense more vertical spacing, more speed and a bit more unpredictability. \nIf Bediako gets the nod to play the rest of the year, Oats will have every tool in the holster. Alabama can play a double-big lineup of Sherrell and Bediako to confront Florida's big fellas. It can get extremely fast, extremely quickly with Philon, Holloway, Wrightsell, Allen and Bediako on the floor together to counteract a team like Texas A&M, who will press and press and press and press some more. When Alabama tangles with Arkansas next month, it could trot out Bol Bowen at the 4 next to Bediako to match up with the hyper-athletic Trevon Brazile and the silky-smooth Malique Ewin.Oats likes math, so how does this formula sound? Pro guard in Philon + pro wing in Allen + pro center in Bediako? That's a recipe that Alabama can cook with. The SEC's most dangerous team is hiding in plain sight. The imminent courtroom decision looms large. \nAll-Defense picks!Let's give some love to the best defenders at each position in college basketball. There are so many you could pick from, but I settled on these five brilliant weapons.\n                            \n    \n                                                \n                    \n    G Killyan Toure, Iowa State: Toure has cooled off a smidge in conference play, but the Iowa State freshman is a pest on the ball who plays with relentless effort and will pick you up for all 94 feet. He's not perfect -- some of the off-ball defense can be an adventure -- but he's truly one of the best freshman on-ball defenders that we've seen in college basketball in recent memory. \n                            \n    \n                                                \n                    \n    G Jeremy Fears Jr., Michigan State: Fears brings the clamps every night. Michigan State's sophomore point guard understands the scouting report better than almost everybody. He's seemingly always in the right place at the right time. He clearly studies his playbook and knows his opposition's sets and frequencies like the back of his hand. Michigan State's team defense is terrific (they load up the gaps better than anybody), but Fears is the unquestioned head of the snake. \n\n                            \n    \n                                                \n                    \n    Wing Miles Byrd, San Diego State: Byrd does some freaky things defensively that you just can't teach. His ability to track the ball in the air is so unique. Byrd has posted a 4.9% block rate and a 4.4% steal rate. Only five players in America are currently in that threshold. He appears out of nowhere for timely traps to rip the ball away. \nHe's an excellent secondary rim protector. No one is safe from getting their shot swatted in transition when Byrd is in the vicinity. He absolutely got hosed of a game-winning block in last week's crushing last-second loss to Grand Canyon. \n                            \n    \n                                                \n                    \n    F JoJo Tugler, Houston: Only one player in college basketball has a steal rate north of 5.0 and a block rate north of 9.0: Tugler. When he defends without fouling, Tugler is a takeaway machine who can single-handedly wreck gameplans. His ability to blow up ball screens 30 feet from the rim and then sprint back and help protect the basket is utterly absurd.\n\n                            \n    \n                                                \n                    \n    C Aday Mara, Michigan: Michigan has the No. 1 defense in the country when Mara is on the floor, holding opponents to just 0.91 points per possession. Opposing guards start to dip into the paint and then swerve back out to the perimeter when they see Mara down there because of his elite rim protection. When he can loom in the paint, Michigan's defense is a total headache. Opponents are shooting just 44% at the rim against Michigan when Mara is on the floor. He ranks sixth nationally in block percentage. Bracket-buster or pretender: Mid-major editionUnfortunately, there is no magic formula to determine which mid-majors will win or lose in March Madness. Matchups are everything, especially as the gap between the haves and have-nots continues to widen in college basketball. 2025's Final Four featured four No. 1 seeds. The 2026 Final Four likely won't have that -- the No. 1 seeds aren't quite as terrifying this year -- but it's shaping up to be similarly top-heavy because teams in the top-10 are putting up historic numbers and separating from the pack. Per Basket Under Review's brilliant Will Warren, the average net rating margin between 2026's best 10 teams and the rest of the sport is the widest it's ever been.Imagine earning a No. 14 seed and getting to play ... Houston in the first round. The Cougars are tracking to be a No. 3 seed per CBS Sports Bracketology. Houston currently has a +30.72 net rating on KenPom, putting it right on par with the 2022-23 UConn team that won the National Championship.\nThat giant is a No. 3 seed? Good luck and best wishes.We're hurtling towards a second straight year where teams in that Nos. 14, 15 and 16 seed range just get obliterated again and it's going to be a tall task for some of mid-majors to break through this iron-clad top shelf of squads and make a real run.So, who is real and who is fake? A fortunate draw is the obvious skeleton key for any mid-major, but understanding personnel is vital. These mid-majors need dudes now more than ever. Plus, some of these teams at the top are uber physical. The \"height, weight, speed\" gap is primed to make-or-break many outlooks for potential bracket-busters.Let's dive into five notable mid-majors who are tracking to make the Big Dance. We'll do an expansive mid-major check-in in February, but consider this an appetizer of sorts.\nThe Outlier: A mid-major with a high-major profile\n                            \n    \n                                                \n                    \n    Saint Louis (19-1): Saint Louis ranks No. 1 in the country in effective field goal percentage on offense and No. 1 in the country in effective field-goal percentage on defense. That's rare air. The Billikens are a problem. Saint Louis has a legit nine-man rotation with rangy wings, speedy guards and improved interior thump. Saint Louis' combination of size, skill, defensive versatility and a boatload of shooting is terrifying. The Billikens are tracking for a No. 5 seed, so this is clearly not a typical mid-major outfit. The personnel is also different. Robbie Avila is one of the top stretch 5s in the country, and there are four former high-major players in this rotation. Coach Josh Schertz can tap a ton of different buttons to generate advantages, and there won't be a giant athleticism gap when Saint Louis plays anyone. It is different.Real deals: Not a comfy first-round opponent\n                            \n    \n                                                \n                    \n    Belmont (18-3): A frequent dancer during the 2000s and 2010s, we have not seen Belmont play in an NCAA Tournament game since 2019 (it qualified for the canceled 2020 tourney). It will come down to the conference championship as always, but coach Casey Alexander has some serious pieces at his disposal in Nashville. \nBig man Drew Scharnowski is an absolute load, especially in the open floor when he gets a head of steam. He can jackhammer dunks on anybody. Forward Sam Orme and Eoin Dillon are scary floor-spacers, and trustworthy backup center Brigham Rogers rounds out one of Alexander's best-ever frontcourts. That interior two-way pop gives Belmont real staying power. It has a top-10 two-point defense supercharged with serious rim protection. That has proven to be a perfect complement to Alexander's beautifully engineered offense that generates high-quality looks at a sky-high rate year after year. Belmont needs to get senior point guard Nic McClain healthy, but there's size and shooting everywhere, especially with Tyler Lundblade, who is a born and bred net-shredder. \n                            \n    \n                                                \n                    \n    Tulsa (17-3): These Tulsa guards are terrifying. Miles Barnstable needs about a quarter inch of space to fire, and Ade Popoola is a big, off-ball spacer whom defenses have to respect. Point guard Tylen Riley has been an utter revelation as a set-the-table, paint-touch machine who gets to the foul line at will and can hit an open trey. Forward David Green has a brilliant all-around game, and Tulsa can bring ace defender Myles Rigsby off the bench to sic on just about anybody. \nTulsa doesn't have an elite interior fortress. I worry about it against a heavy post-up team that can obliterate you on the glass, like a date with Florida in a No. 5-12 clash would be rough. But these guards are awesome, and it's an old, battle-tested team. If they can make it, look out.Not buying it (yet)\n                            \n    \n                                                \n                    \n    Miami (Ohio) (20-0): The Redhawks have terrific continuity, excellent ball movement, tons of shooting, ideal spacing and a fantastic pick-and-roll offense. I'm just hesitant about the interior defense. Top-200 opponents are shooting 63% at the rim against the Redhawks, and that's without facing a truly excellent front-line. Former Rutgers big man Antwone Woolfolk has been a revelation for the Redhawks, but if he got into foul trouble in the Big Dance, it could be a layup line. Miami (Ohio) is good, but a draw against an awesome front-line would be less than ideal.\n                            \n    \n                                                \n                    \n    Hawaii (15-4): The last time Hawaii made the NCAA Tournament, it knocked off No. 4 seed Cal (who had Jaylen Brown) to advance to the 2016 second round. This is the best Rainbow Warrior club in a decade, thanks to an elite interior defense. Seven-foot center Isaac Johnson — a former Oregon signee back in the day — is an intimidating shot-blocker and rim deterrent. Hawaii is able to blanket the 3-point stripe, funnel everyone towards a massive frontline and reap the rewards. Hawaii just has so much size with five guys 6-foot-8 or taller in the rotation.I just do not trust the guard play. Hawaii's top guards (Aaron Hunkin-Claytor and Hunter Erickson) both have sky-high turnover rates in pick-and-rolls. This is an old, big team that held up totally fine physically against Oregon and Arizona State, but I don't think it can win a shootout against a good high-major club.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trotter's Trends: Charles Bediako makes Alabama SEC's most dangerous team - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/9f7489a9-0a90-4acf-a6f8-d1dbcb24caaa/thumbnail/1200x675/0dab6a358157e18325bfd351284ebce6/usatsi-28082156-1.jpg"
      ],
      "datePublished": "2026-01-27T19:53:37.000Z",
      "dateModified": "2026-01-27T19:53:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Seahawks prediction, odds, date: 2026 Super Bowl picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-seahawks-prediction-odds-date-2026-super-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/5e8a16a8-c3ad-4897-838a-b1f4b254977d/thumbnail/1200x675/2e9654435cef96d5bb3c6dfd0859195d/jaxon-smith-njigba-seattle-seahawks.jpg",
    "tag": "Sports",
    "date": "2026-01-27T18:51:50.000Z",
    "description": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks. Each team ranks in the top four in both scoring o",
    "body": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks. Each team ranks in the top four in both scoring offense and scoring defense, providing a balanced Super Bowl 60 matchup. New England (14-3) went on the road to defeat Denver, 10-7, in the AFC Championship Game, while Seattle (14-3) held off the Rams, 31-27, to claim the NFC Title Game. The 2026 Super Bowl is a rematch from 11 years ago when the Pats prevailed 28-24 to win Super Bowl XLIX.Kickoff is at 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. Seattle has won each of the three matchups since that Super Bowl XLIX loss to New England. Seattle is the 4.5-point favorite in the latest Seahawks vs. Patriots   odds from DraftKings Sportsbook, while the over/under for total points is 45.5. Before making any Patriots vs. Seahawks picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Seahawks vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Patriots vs. Seahawks:\nSeahawks vs. Patriots spreadSeattle -4.5 at DraftKings SportsbookSeahawks vs. Patriots                 over/under45.5 pointsSeahawks vs. Patriots                                                                                                                                                                                  money line Seahawks -238, Patriots +195Seahawks vs. Patriots                                                                                                                                                                         picksSee picks at SportsLineSeahawks vs. Patriots                                                                                                                                                                            streaming Fubo (try for free)Why the Patriots can coverThe Pats shook off talk about their weak strength of schedule by defeating three playoff teams that had 11-plus wins in the regular season. They enter Super Bowl LX with a 16-1 record over their last 17 games, which is not a record that even Seattle can measure up to. New England has incredible balance, ranking second in points scored and fourth in points allowed, with the offense specifically standing out. Drake Maye combines both efficiency with a big-play ability as he leads the league in both completion percentage and yards per pass attempt. Meanwhile, the defense is playing its best entering Super Bowl Sunday as New England has given up one or fewer touchdowns in each of its last five games. See which team to back at SportsLine. Why the Seahawks can coverIt's hard to find any holes with Seattle, including in regard to the spread, as it has both the most covers and the best cover percentage of the regular plus postseason. The Seahawks are the only NFL team to rank in the top three in both scoring offense and scoring defense, and just five teams had more takeaways in the regular season. Mike Macdonald's crew also boasts top-10 rankings on both the ground and thru the air, but the defense is the star of this team. Seattle leads the NFL in points allowed, third-down defense, yards per rush allowed and yards per pass attempt allowed while ranking second in yards per play given up and rushing touchdowns allowed. See which team to back at SportsLine.How to make Seahawks vs. Patriots picksSportsLine's model has simulated Patriots vs. Seahawks 10,000 times and is going Under on the total, projecting 44 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Seahawks vs. Patriots, and which side of the Super Bowl spread is the better value? Visit SportsLine now to see which side of the Patriots vs. Seahawks spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks prediction, odds, date: 2026 Super Bowl picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/5e8a16a8-c3ad-4897-838a-b1f4b254977d/thumbnail/1200x675/2e9654435cef96d5bb3c6dfd0859195d/jaxon-smith-njigba-seattle-seahawks.jpg"
      ],
      "datePublished": "2026-01-27T18:51:50.000Z",
      "dateModified": "2026-01-27T18:51:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mike Vrabel addresses Drake Maye injury rumors ahead of Super Bowl: 'Nobody's 100%' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-mike-vrabel-drake-maye-injury-rumors-super-bowl-lx/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/bb0a40db-0805-4f07-acbd-3d940798b8c5/thumbnail/1200x675/3e49494d4ed479fe1fa50c2ed38ccf3f/drake-maye-afccg.jpg",
    "tag": "Sports",
    "date": "2026-01-27T19:22:21.000Z",
    "description": "\n        The New England Patriots are heading to their 10th Super Bowl this century after defeating the Broncos 10-7 in a snowy, defense-heavy game in",
    "body": "\n        The New England Patriots are heading to their 10th Super Bowl this century after defeating the Broncos 10-7 in a snowy, defense-heavy game in Denver. Patriots Nation went from celebrating a historically quick rebuild to worrying about the status of their starting quarterback as the team heads into Super Bowl LX against the Seattle Seahawks.A social media account called \"Pro Football Doc,\" run by David J. Chao, who provides insight on many injuries after serving a an NFL team doctor for 17-plus years, made a claim that quarterback Drake Maye injured his shoulder in the AFC Championship Game.\"There is no question in my mind that Drake Maye injured his right throwing shoulder against the Denver Broncos,\" Chao said. \"Of course, how bad is the injury remains to be seen. What type of injury -- I'm still gathering data, but let me give you the evidence.\"Coach Mike Vrabel was asked about his quarterback's status during his appearance on WEEI on Tuesday.\n\"There's not a player on our team that's 100% healthy,\" Vrabel said. \"I would imagine we'll go through the injury report, and whenever we have to turn that in, we'll turn it in. But nobody's 100%. This will be our 21st game.\"During his media availability shortly after his radio spot, Vrabel said the situation was \"probably\" blown out of proportion.\"I wouldn't say anybody hurt anything,\" Vrabel said, when asked if Maye hurt his shoulder. \"This is a sport where there's gonna be things that come up. We'll talk about whatever status each player has for the game once we're required to. We understand that. We were able to function offensively, throw the football, run the football so that's kinda where everybody's at.\"\nMaye was sacked five times and took numerous other hits, including one that some are pointing as the cause of the apparent injury. In the third quarter, Maye slid at the end of a 13-yard run and was tackled by Broncos safety Talanoa Hufanga. Maye landed on his throwing shoulder and at the end of the play was seen holding that shoulder.\nAfter Sunday's win, Maye admitted that he was dealing with \"bumps and bruises.\"\"I think a lot of those guys in that locker room are battling through things,\" Maye said. \"At the same time, the best thing about it is we have another chance at it. Another chance at it to get healthy. Two weeks -- a chance to go win the Super Bowl. That's what it is, and that's pretty cool.\"Some have theorized that the Patriots were more conservative on offense because he injured his shoulder. Others point out that the lack of a pass game was due to inclement weather, wanting to eat up more of the clock and the confidence in their defense against a Broncos offense that wasn't productive for most of the game.\nJust two plays after the alleged injury occurred, Maye completed a 31-yard pass to Mack Hollins, a play that is also being used by some to say Maye's throwing shoulder is fine.\nTo seal the win, Maye called his own number, running on a naked bootleg rather than the seemingly original plan to hand the ball to running back Rhamondre Stevenson. The second-year QB's risk paid off when he gained seven yards on third-and-5, with a slight stiff arm using his throwing hand.\nThe Patriots will release an injury report on Wednesday and what it says about Maye will be a main topic of conversation throughout Super Bowl week.\nThe Seahawks are currently 4.5-point favorites in the Super Bowl.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mike Vrabel addresses Drake Maye injury rumors ahead of Super Bowl: 'Nobody's 100%' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/bb0a40db-0805-4f07-acbd-3d940798b8c5/thumbnail/1200x675/3e49494d4ed479fe1fa50c2ed38ccf3f/drake-maye-afccg.jpg"
      ],
      "datePublished": "2026-01-27T19:22:21.000Z",
      "dateModified": "2026-01-27T19:22:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Michigan-Nebraska, Purdue-Indiana - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/use-bet365-bonus-code-cbsbet365-to-get-200-bonus-bets-michigan-nebraska-purdue-indiana/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-27T16:48:30.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be used to bet",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be used to bet on a loaded college basketball slate on Tuesday. No. 3 Michigan hosts No. 5 Nebraska in one of the biggest games of the season, as the Cornhuskers try to remain unbeaten. They are 10.5-point road underdogs in the Tuesday college basketball odds, but SportsLine's proven computer model is backing Nebraska to cover in this showdown. The model has also revealed picks for No. 12 Purdue at Indiana and No. 24 Miami (OH) vs. UMass. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. It also enters Week 13 of college basketball on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and it is on a 6-0 roll on college basketball side picks. Anybody following its college basketball betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here. Tuesday's top picks, best betsNebraska +10.5 vs. Michigan (-110)Over 151.5 in Indiana vs. Purdue (-110)Miami OH -8.5 vs. UMass (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:Nebraska +10.5 vs. Michigan (-110)Nebraska is a perfect 20-0 this season and holds the nation's longest active winning streak at 24 games, dating back to last season, yet the Cornhuskers are double-digit underdogs on Tuesday night. Michigan suffered its lone loss at home against Wisconsin on Jan. 10, and Nebraska is allowing just 64.9 points per game during conference play. The Cornhuskers are aiming for the longest win streak by a Big Ten team since Illinois (2005), and SportsLine's model has them covering the spread in 64% of simulations. Back Nebraska at bet365 here:\nOver 151.5 in Indiana vs. Purdue (-110)Indiana is coming off its best offensive performance in several weeks, scoring 82 points against Rutgers on Friday. The Hoosiers have gone over 80 points in four straight victories, and Purdue gave up 88 points to Illinois on Saturday. The Boilermakers scored 82 points of their own in that loss, so the Over is cashing in 65% of simulations on Tuesday. Back the Over at bet365 here:Miami OH -8.5 vs. UMass (-110)Miami has been pushed to overtime in its last two games, but it won both of those games to remain unbeaten this season. The RedHawks are off to the best start to a season in school history and have the longest winning streak for any MAC program. They have scored at least 100 points in three straight games and seven times this season, which is one reason why the model has Miami covering 68% of the time. Back Miami OH at bet365 here:\nLooking for NBA and college basketball picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting Michigan-Nebraska, Purdue-Indiana - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-27T16:48:30.000Z",
      "dateModified": "2026-01-27T16:48:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travis Kelce retirement: Chiefs owner hopeful star TE returns for 2026 season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-owner-clark-hunt-travis-kelce-retirement-decision/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/ebbdecc5-0a3e-472c-8d7c-bb47f7b48bdf/thumbnail/1200x675/eb0d95c8ce25f38ea0b0ab9f34e48e6b/kelce.png",
    "tag": "Sports",
    "date": "2026-01-27T18:21:22.000Z",
    "description": "\n        Kansas City Chiefs owner Clark Hunt was crystal clear this week on his assessment of veteran tight end Travis Kelce, who has a decision to ma",
    "body": "\n        Kansas City Chiefs owner Clark Hunt was crystal clear this week on his assessment of veteran tight end Travis Kelce, who has a decision to make ahead of the 2026 season. Mulling retirement or returning for a 14th NFL campaign, Kelce is taking time this offseason before informing the Chiefs of his plans.\"As an organization, we certainly hope that he will come back,\" Hunt said Tuesday on Good Morning Football. \"He had another great year, maybe not on par with where he was four or five years ago, but still had over 800 yards, and was really one of the leaders on the offensive side of the ball for us. So there's no doubt in my mind that he can still play. We're trying to be respectful and let him have the time that he needs to make a decision.\"He has sort of a busy offseason coming up with his engagement and marriage, so we want to be respectful and give him the time he needs to make a decision. But we certainly hope that he'll be back.Over 17 starts in 2025, Kelce recorded 76 catches for 851 yards and five touchdowns. His reception total was the fewest since the 2015 season, his second in the NFL. Kelce got engaged to pop icon Taylor Swift last summer and the two plan to wed in 2026.From the ownership's side, it's clear the Chiefs want Kelce back in the fold. With the 2026 NFL Draft approaching in April, it would be advantageous for Hunt to get a decision from the 11-time Pro Bowler early this spring.\nKelce recently said on his New Heights podcast he's anxious to work again with Eric Bieniemy as the Chiefs' new offensive coordinator, suggesting he could be back. Bieniemy and Kelce spent a decade together prior to the play-caller's move to the Washington Commanders' vacant OC position in 2023.\"I can't wait to see him back in the building,\" Kelce said. \"He's one of my favorite coaches of all-time, one of my favorite people of all time. I've had so many unbelievable growing moments under him as a player, as a person, and I just love the guy and it's going to be awesome to see him back in the building and see him back wearing the Chiefs logo, baby.\"Kelce said in January after the Chiefs failed to make the playoffs that he needed to see how his body responded this offseason, Kansas City finished 6-11 this season and may be without quarterback Patrick Mahomes for the start of the 2026 campaign following an ACL injury.\nKelce first mentioned retirement in 2023, acknowledged the toll playing for a decade-plus has taken on his body.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travis Kelce retirement: Chiefs owner hopeful star TE returns for 2026 season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/ebbdecc5-0a3e-472c-8d7c-bb47f7b48bdf/thumbnail/1200x675/eb0d95c8ce25f38ea0b0ab9f34e48e6b/kelce.png"
      ],
      "datePublished": "2026-01-27T18:21:22.000Z",
      "dateModified": "2026-01-27T18:21:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football rules: NCAA to discuss targeting changes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-rules-ncaa-targeting/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/a7a6c80b-9da8-4f6f-9d41-d80f7a82bf04/thumbnail/1200x675/6dfbfb51052ead4451c2e96f9803634d/gettyimages-1190706206-1.jpg",
    "tag": "Sports",
    "date": "2026-01-27T17:46:52.000Z",
    "description": "\n        Changes to the college football targeting rule could be on the horizon. Flags for targeting are on the decline over recent seasons, but they ",
    "body": "\n        Changes to the college football targeting rule could be on the horizon. Flags for targeting are on the decline over recent seasons, but they remain heavily scrutinized and often controversial when thrown. The NCAA will take a closer look this offseason.National coordinator of officials Steve Shaw, who also serves as the NCAA's secretary-rules editor, said to Yahoo Sports that decision-makers will analyze the targeting rule and potentially make penalties \"less punitive.\"\"We're going to be having a discussion on targeting,\" Shaw said. \"That needs to be an annual discussion. It will be a focus discussion.\"The NCAA introduced the targeting rule in 2008 as a player safety measure, and it became stricter throughout the years. While the rule always resulted in a 15-yard penalty, it was changed in 2013 to also carry an automatic ejection for the guilty party. If the player called for targeting is ejected in the second half of a game, the penalty also stipulates they must sit out the first half of the ensuing contest.\nThe ejection and suspension elements of the targeting rule could be the first to receive adjustments as part of the NCAA's discussion.\"What targeting has driven in terms of player behavior change has been really good and the numbers reflect that,\" Shaw said. \"But how can we continue this trend of taking out more of these hits we don't want in the game while being less punitive?\"Those aspects of the rule are highly contested. Opponents of the targeting penalty often argue that forcing a player to sit the remainder of a game and potentially part of the next is too strict of punishment. Miami coach Mario Cristobal took exception with the rule when an untimely call forced one of his top defenders to miss the first half of the College Football Playoff National Championship.\nWhen cornerback Xavier Lucas launched himself into Ole Miss wide receiver Cayden Lee and made forceful contact with Lee's helmet on a tackle in the CFP semifinals, he drew a flag and was forced to sit the first 30 minutes of the Hurricanes' biggest game of the year. Cristobal argued that the rule needs to be revisited.\"We feel it was unjustly administered, and now it impacts the last game of the season,\" Cristobal said. \"We do have the ability, again, as an officiating crew and the powers that be to revisit that to give every team due process and their best ability to compete in this game.\"Among the ideas that targeting opponents have presented is the creation of different penalty classifications. Less severe infractions could fall under a Level I categorization and carry just a 15-yard penalty while more egregious offenses may warrant a Level II call with a yardage penalty and ejection. Lucas' penalty would be an example of a lower-tier offense.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football rules: NCAA to discuss targeting changes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/a7a6c80b-9da8-4f6f-9d41-d80f7a82bf04/thumbnail/1200x675/6dfbfb51052ead4451c2e96f9803634d/gettyimages-1190706206-1.jpg"
      ],
      "datePublished": "2026-01-27T17:46:52.000Z",
      "dateModified": "2026-01-27T17:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill promote Joe Brady: Offensive coordinator takes over as head coach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-joe-brady-head-coach-sean-mcdermott/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/f38822f7-e078-4cc2-9793-2c68a7bd0034/thumbnail/1200x675/2012f0cb32ab30f77ac40abfc4800a69/joebrady.png",
    "tag": "Sports",
    "date": "2026-01-27T17:43:05.000Z",
    "description": "\n        Just over one week after firing Sean McDermott, the Buffalo Bills have their man. The Bills are promoting offensive coordinator Joe Brady to ",
    "body": "\n        Just over one week after firing Sean McDermott, the Buffalo Bills have their man. The Bills are promoting offensive coordinator Joe Brady to coach on a five-year deal, the team announced on Tuesday.While they considered several outside candidates, Bills general manager Brandon Beane tabbed Brady, who has never been a head coach at any level. He does, however, bring considerable experience having spent the previous four years on McDermott's coaching staff. The 36-year-old Brady became the Bills' quarterbacks coach in 2022 before becoming the team's interim offensive coordinator in 2023 after Buffalo fired Ken Dorsey. He assumed that role on a full-time basis the following year and remained in that role through the 2025 season. Buffalo ranked second in scoring during Brady's first full season as offensive coordinator. In 2025, the Bills ranked fourth in the league in scoring and in rushing. The unit was also fourth in third down efficiency and third in red zone efficiency. Prior to coming to Buffalo, Brady led a memorable, albeit short, run at LSU, where he helped the Tigers capture the 2019 national title as the school's passing game coordinator and wide receivers coach. He worked closely that season with future NFL stars Ja'Marr Chase, Justin Jefferson and Joe Burrow. \nBrady did not earn a head coaching opportunity until now after spending two years as the Carolina Panthers' offensive coordinator prior to coming to Buffalo. Brady, like McDermott, is a William & Mary graduate who broke into coaching at his alma mater in 2013 as a linebackers coach. He spent two years there before spending two years at Penn State as a graduate student. Brady then spent two years with the New Orleans Saints as an offensive assistant. In New Orleans, Brady witnessed one of the most successful coach-quarterback partnerships in NFL history in Sean Payton and Drew Brees. Brady will now be tasked with helping the Bills maximize the rest of quarterback Josh Allen's prime. The Bills haven't been to a Super Bowl since January 1994, and they're now putting their faith in Brady to help them end that drought. \nNow that the Bills' position has been filled, the Cleveland Browns, Arizona Cardinals and Las Vegas Raiders are the three remaining teams that are still in search of a new head coach. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill promote Joe Brady: Offensive coordinator takes over as head coach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/f38822f7-e078-4cc2-9793-2c68a7bd0034/thumbnail/1200x675/2012f0cb32ab30f77ac40abfc4800a69/joebrady.png"
      ],
      "datePublished": "2026-01-27T17:43:05.000Z",
      "dateModified": "2026-01-27T17:43:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here's the biggest problem MLB has right now when it comes to Dodgers' spending - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-biggest-problem-dodgers-spending-perception-snyder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/04600ce4-73b4-4bfd-81b9-70681f882f71/thumbnail/1200x675/5d66b0676142ac6bfdbbd8d16a9da251/kyle-tucker-dodgers-getty.png",
    "tag": "Sports",
    "date": "2026-01-27T17:42:59.000Z",
    "description": "\n        Welcome to Snyder's Soapbox! Here, I pontificate about matters related to Major League Baseball on a weekly basis. Some of the topics will be",
    "body": "\n        Welcome to Snyder's Soapbox! Here, I pontificate about matters related to Major League Baseball on a weekly basis. Some of the topics will be pressing matters, some might seem insignificant in the grand scheme of things, and most will be somewhere in between. The good thing about this website is that it's free, and you are allowed to click away. If you stay, you'll get smarter, though. That's a money-back guarantee. Let's get to it.When it comes to the two-time defending World Series champion Dodgers and their payroll, Major League Baseball definitely has a problem. It's been growing for years and, sure, the massive payroll is one component. The main problem, though, is public perception. Perception is reality, as so many of us know all too well. Major League Baseball is a business that is built solely on fan interest. If fan interest wanes, that's a problem. The massive number of people complaining about how unfair baseball is and how it needs a salary cap and how the league is a joke because the Dodgers are automatically just going to win the World Series again in 2026 -- because they bought it -- is a problem. \nI don't think it's as big of a problem as others do. I don't think the Dodgers are definitely going to win the World Series. Hell, the Dodgers didn't even have the biggest payroll among the 30 MLB teams in 2024. There remain others in their stratosphere of spending (as opposed to, say, the 2009 Yankees) But I also don't get to dictate how sports fans at large feel about the state of Major League Baseball when it comes to finances. I heard it loud and clear last week. I wrote about how the Brewers trade of All-Star starting pitcher Freddy Peralta one year away from free agency feels bad for baseball to me. I got crushed online. Just obliterated. I don't mind the ill words in my direction, otherwise I'd stop writing soapboxes. Something struck me, though. What boggled my mind was the number of people who felt the need to walk me through the move as follows: \nThe Brewers can definitely afford to pay Peralta $8 million in 2026 (I know this). The reason they traded him is that he's going to walk in free agency after 2026, so they are getting something for him rather than nothing (I understand this). None of them mentioned that they thought the Brewers got better for 2026. This is a problem. I just can't wrap my head around \"just go for the title in 2026\" not being an option for the team that had the best record in baseball in 2025 along with the best run differential. They were a great team. I even replied to a few people with this sentiment and one acted like I was suggesting the Rockies or White Sox could topple the Dodgers. It was just laughable that I would suggest the Brewers try to beat the Dodgers and win the World Series in 2026. Again, this is a problem. A big one. We're talking about a team that just went to the NLCS after winning 97 games and masses and masses of fans believe the best move is to get ahead of \"he's going to walk in free agency after 2026,\" instead of trying to beat the mighty Dodgers and their gargantuan payroll. And, again, if you truly believe this move made the Brewers better in 2026 because Peralta is a five-inning pitcher (and \"not prime Clayton Kershaw,\" as I heard), talk about that. It's not like they've never let a star player get to free agency and walk. It just happened with Willy Adames.But there was none of that. It was a bunch of people either calling me names or explaining that Peralta was going to walk in free agency after 2026 so he absolutely had to be traded before 2026 (I guess the Blue Jays should have traded Bo Bichette before last season, huh?).\nIt might seem like I'm mocking those who disagree with me and, sure, there's a little of that. There's just far too much defeatism here, given what we're talking about.The Dodgers won 93 regular-season games last year. They might have lost to the Phillies in the NLDS if Orion Kerkering made a quicker decision in Game 4 of that series. The Blue Jays had them on the ropes in the World Series multiple times and if closer Jeff Hoffman just doesn't allow a fluky home run to Miguel Rojas, the Dodgers wouldn't be champs. That Game 7 truly could have gone either way multiple times.The Dodgers are, of course, champs. It was a well-deserved title. I'm not saying they didn't deserve it. They were amazing in the playoffs. I'm just not understanding this cloak of invincibility so many are giving them. I know that when fans get tired of teams winning titles, the drama gets ratcheted up, but the 2025 Dodgers weren't the 1998 Yankees with 114 wins and an 11-2 record in the playoffs, including a sweep in the World Series. They weren't the 2018 Red Sox with 108 wins and an 11-3 playoff record, either. \nBoth Caesars Sportsbook and DraftKings currently list the Dodgers with +230 odds to win the 2026 World Series. Those are implied odds of roughly 30%. That means the oddsmakers think it's a 70% chance that they won't. And I can't believe the number of people acting like it's a foregone conclusion that the Dodgers will win a third consecutive title. The feeling I got in all the feedback last week was that most people believe they have a better than 50% chance to win it all. That's just lunacy. We've all been baseball fans for decades, right? We've seen how much can go wrong for any given team and how much has to go right for a team to win the World Series. The Dodgers are the only repeat champ since 1998-2000 and they got there last season by the skin of their teeth. Again, though, it doesn't much matter to nail down to the specifics, does it? Far too many people perceive that the Dodgers now are just going to show up and win a World Series. That the league is a joke and there's no reason to even play games. That's just as big a problem as the salary thing. \nEvery single argument you see that loops in other sports makes sure to point out how much more parity there is in the NFL (a lot of the times the person calls it \"parody,\" which is always fun), ignoring that NFL has had fewer champions in whatever stretch of years we want for the past several decades and that either the Patriots or Chiefs are in the AFC title game every single year. But, sure, it's baseball where it's \"just the same teams every year.\"Again, it's a perception problem. So many sports fans have been trained to believe that a salary cap will cure all ills that it is a legitimate problem for Major League Baseball. I'm as sincere as I've ever been right now when I say that I do firmly believe this has reached the point where MLB can't solve the problem of fan perception with anything short of a cap. The Dodgers with their winning and spending have broken the minds of fans in the collective. I think there is so, so much more to it than simply \"throw money at players and win,\" but there's only so much those of us in the minority here can do. Public perception is that MLB has a problem that is an unfair financial game tilted toward the Dodgers. It won't be an easy problem to solve.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here's the biggest problem MLB has right now when it comes to Dodgers' spending - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/04600ce4-73b4-4bfd-81b9-70681f882f71/thumbnail/1200x675/5d66b0676142ac6bfdbbd8d16a9da251/kyle-tucker-dodgers-getty.png"
      ],
      "datePublished": "2026-01-27T17:42:59.000Z",
      "dateModified": "2026-01-27T17:42:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Diego Pavia's height under scrutiny ahead of Senior Bowl, 2026 NFL Draft - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/diego-pavia-height-2026-nfl-draft-vanderbilt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/f6a18662-56b7-49de-aabd-d632fb7cc1cf/thumbnail/1200x675/8e4c6c6302aadc29abaa0eb3efe048e4/diego.png",
    "tag": "Sports",
    "date": "2026-01-27T15:49:16.000Z",
    "description": "\n        Stacked odds against Diego Pavia are nothing new for the departing Vanderbilt quarterback. His national rise to prominence culminated with a ",
    "body": "\n        Stacked odds against Diego Pavia are nothing new for the departing Vanderbilt quarterback. His national rise to prominence culminated with a Heisman runner-up finish behind projected No. 1 overall draft pick Fernando Mendoza.Pavia must buck historical norms once again to make it at the next level after the dual-threat star measured at 5-9 7/8 inches at the Senior Bowl. Vanderbilt listed Pavia at 6-foot. Short quarterbacks are commodities in the NFL with Carolina's Bryce Young and Arizona's Kyler Murray being the smallest draft picks in the modern era at 5-10 1/8 inches.The only sub 5-foot-9 quarterbacks selected NFL Draft in history are Davey O'Brien (5-foot-7) in 1939 and Eddie LeBaron (5-foot-7) in 1952. Doug Flutie, at 5-10, was an 11th-rounder in 1985 at No. 285 overall.Pavia made more than $2 million at Vanderbilt last season after being granted a temporary injunction for a sixth year of college football. However, Pavia would make history if selected. Pavia is not listed amongst the draftable options at the position via CBS Sports' updated player rankings. Weighing in at 198 pounds, he would be the lightest quarterback in history, too.\nPavia was Vanderbilt's first All-America quarterback since Bill Wade in 1951 and the program's first Heisman finalist. Pavia threw for 3,539 passing yards, galloped his way to 862 rushing yards and accounted for 39 total touchdowns. Pavia led the Power Four in total offense and accounted for more than 70% of Vanderbilt's total yards. By comparison, no other Heisman finalist topped 50% this season. Pavia, a CBS Sports All-America First Teamer and National Player of the Year, must impress NFL scouts at the Senior Bowl and, potentially, the NFL Combine.\"I'm so excited for him to be able to shoot his shot in the NFL, and I'm never betting against that guy,\" Vanderbilt coach Clark Lea said after the Reliaquest Bowl. \"This guy is going to make it. He's not only going to make it, he's going to find a way to play at the level he's found a way to play at for us. I believe that with all my heart.\"\nPavia will be 24 years old by April's draft, the same age as Caleb Wiliams and C.J. Stroud, who have five seasons worth of combined NFL starts under their belts.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Diego Pavia's height under scrutiny ahead of Senior Bowl, 2026 NFL Draft - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/f6a18662-56b7-49de-aabd-d632fb7cc1cf/thumbnail/1200x675/8e4c6c6302aadc29abaa0eb3efe048e4/diego.png"
      ],
      "datePublished": "2026-01-27T15:49:16.000Z",
      "dateModified": "2026-01-27T15:49:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Astros still trying to fill need, Japanese veteran wants to remain in majors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-astros-tomoyuki-sugano/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/de046d49-b412-4c58-9b11-7ff8a0012f3d/thumbnail/1200x675/14b9b86087348b48f1b4f289d916e82f/sugano-reference.png",
    "tag": "Sports",
    "date": "2026-01-27T15:30:56.000Z",
    "description": "\n        In exactly two weeks, the first spring training camps will open across Arizona and Florida. The first spring training games will be played th",
    "body": "\n        In exactly two weeks, the first spring training camps will open across Arizona and Florida. The first spring training games will be played three weeks from Friday. Then, before you know it, the World Baseball Classic will get underway. Real live baseball is fast approaching. Until then, here are Tuesday's hot stove rumors.   \n                            \n    \n                                                \n                    \n      Astros seeking a lefty bat  The Astros would like to add a lefty bat to balance out their righty heavy lineup, GM Dana Brown said at the team's FanFest event this past weekend (via The Athletic). \"If we have an opportunity where we can add a left-handed bat, I think  that would be more of interest as opposed to just saying, 'Hey, we want  to get an outfielder,'\" Brown said.    At the moment Houston's only lefty bats are the great Yordan Alvarez, platoon outfielders Zach Cole and Jesús Sánchez, and backup catcher César Salazar. The Astros have been trying to unload first baseman Christian Walker since the trade deadline. Ideally they would move him and bring in a lefty hitter who can play first base, though dealing Walker seems very unlikely at this point.  \n  Sugano intends to remain in MLB  \nVeteran right-hander Tomoyuki Sugano intends to stay in the MLB and not return to Japan, he told Sports Hochi. \"I'm waiting for an offer. I'm not even thinking about returning to Japanese baseball,\" he said. The 36-year-old had a home run filled rookie year with the Orioles last season. He played 12 seasons with the Yomiuri Giants in Japan prior to 2025. We did not rank Sugano among the offseason's top 50 free agents. A team that needs a back-end starter who can reliably take the ball every fifth day and help get them to the finish line of the 162-game regular season makes the most sense for Sugano. The Athletics, Nationals and Padres fit the bill. If Sugano is willing to pitch in Coors Field, the Rockies could work as well.  \n  Red Sox interested in Moore  \nThe Red Sox have interest in utility man Dylan Moore, according to MassLive.com. Moore, 33, has a career 110 OPS+ against lefties and he's played every position in the big leagues except catcher. Boston lost lefty masher Rob Refsnyder to free agency earlier this offseason. Moore could serve as a more proven alternative to current bench guys Nate Eaton and Nick Sogard.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Astros still trying to fill need, Japanese veteran wants to remain in majors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/de046d49-b412-4c58-9b11-7ff8a0012f3d/thumbnail/1200x675/14b9b86087348b48f1b4f289d916e82f/sugano-reference.png"
      ],
      "datePublished": "2026-01-27T15:30:56.000Z",
      "dateModified": "2026-01-27T15:30:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1: Duke is clear frontrunner in ACC after easy win vs. Louisville - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-top-25-and-1-duke-louisville/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/76a03b5c-b3b1-48a1-9229-a1d58eff23d4/thumbnail/1200x675/b5deae5dab2fee3f2995a7041949bdb8/duke-top-25.jpg",
    "tag": "Sports",
    "date": "2026-01-27T19:04:13.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Monday's most-notable result was obviously A",
    "body": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        Monday's most-notable result was obviously Arizona's 86-83 win at BYU that pushed the Wildcats to 21-0 and gave them their national-best ninth Quadrant-1 victory. Needless to say, they remain No. 1 in Tuesday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings.Wanna read about that game?Matt Norlander was inside the Marriott Center late Monday and watched Brayden Burries and Jaden Bradley combine for 55 points in the road win. His piece from that event can be found here.I'll spend my words on Duke.The Blue Devils improved to 19-1 on Monday with an 83-52 beatdown of Louisville that suggested they have no real challenger in the ACC. Barring a surprise, they'll win the league for a second straight season, this time by multiple games. Cameron Boozer is the biggest reason why. He got 19 points, 10 rebounds and four assists against the Cardinals and remains the leading candidate to eventually be the CBS Sports National Player of the Year.\n        \n            \n                Arizona is 21-0. The scary part? It can still get better\n                \n                    Matt Norlander                \n            \n                            \n    \n                \n                    \n    \nBoozer is now averaging 23.5 points, 9.9 rebounds, 4.1 assists and 1.8 steals in 32.2 minutes per contest. He leads Duke in each of those statistical categories.\nDuke remains No. 4 in Tuesday morning's Top 25 And 1 -- behind only undefeated Arizona, undefeated Nebraska and one-loss UConn.The Blue Devils will not play another currently ranked team until they meet North Carolina on Feb. 7. Next up is Saturday's game at Virginia Tech. Top 25 And 1 rankings \n        Biggest Movers\n    \n                1\n            \n                Iowa State\n            \n                4\n            \n                BYU\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Arizona\n                                \n                            Brayden Burries finished with 29 points and five rebounds in Monday's 86-83 win at BYU. The Wildcats' next game is Saturday at Arizona State.\n                        \n                            --\n                        \n                            21-0\n                        \n                                2\n                            \n                                    Nebraska\n                                \n                            Pryce Sandfort finished with 22 points and 10 rebounds in Saturday's 76-57 win at Minnesota. The Cornhuskers' next game is Tuesday at Michigan.\n                        \n                            --\n                        \n                            20-0\n                        \n                                3\n                            \n                                    UConn\n                                \n                            Solo Ball finished with 24 points and five rebounds in Saturday's 75-67 overtime win over Villanova. The Huskies' next game is Tuesday against Providence.\n                        \n                            --\n                        \n                            19-1\n                        \n                                4\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 19 points and 10 rebounds in Monday's 83-52 win over Louisville. The Blue Devils' next game is Saturday at Virginia Tech.\n                        \n                            --\n                        \n                            19-1\n                        \n                                5\n                            \n                                    Michigan\n                                \n                            Yaxel Lendeborg finished with 18 points and nine rebounds in Friday's 74-62 win over Ohio State. The Wolverines' next game is Tuesday against Nebraska.\n                        \n                            --\n                        \n                            18-1\n                        \n                                6\n                            \n                                    Gonzaga\n                                \n                            Jalen Warley finished with 19 points and four rebounds in Saturday's 68-66 win over San Francisco. The Zags' next game is Saturday against Saint Mary's.\n                        \n                            --\n                        \n                            21-1\n                        \n                                7\n                            \n                                    Michigan St.\n                                \n                            Jeremy Fears Jr. finished with 17 points and 17 assists in Saturday's 91-48 win over Maryland. The Spartans' next game is Tuesday at Rutgers.\n                        \n                            --\n                        \n                            18-2\n                        \n                                8\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic finished with 29 points and seven rebounds in Saturday's 84-71 win at Oklahoma State. The Cyclones' next game is Thursday against Colorado.\n                        \n                            1\n                        \n                            18-2\n                        \n                                9\n                            \n                                    Illinois\n                                \n                            Keaton Wagler finished with 46 points and four assists in Saturday's 88-82 win at Purdue. The Illini's next game is Thursday against Washington.\n                        \n                            1\n                        \n                            17-3\n                        \n                                10\n                            \n                                    Houston\n                                \n                            Emanuel Sharp missed 10 of the 16 shots he attempted in Saturday's 90-86 loss at Texas Tech. The Cougars' next game is Wednesday at TCU.\n                        \n                            1\n                        \n                            17-2\n                        \n                                11\n                            \n                                    Texas Tech\n                                \n                            JT Toppin finished with 31 points and 12 rebounds in Saturday's 90-86 win over Houston. The Red Raiders' next game is Saturday at UCF.\n                        \n                            1\n                        \n                            16-4\n                        \n                                12\n                            \n                                    BYU\n                                \n                            AJ Dybantsa missed 18 of the 24 shots he attempted in Monday's 86-83 loss to Arizona. The Cougars' next game is Saturday at Kansas.\n                        \n                            4\n                        \n                            17-3\n                        \n                                13\n                            \n                                    Purdue\n                                \n                            Fletcher Loyer missed four of the five shots he attempted in Saturday's 88-82 loss to Illinois. The Boilermakers' next game is Tuesday at Indiana.\n                        \n                            --\n                        \n                            17-3\n                        \n                                14\n                            \n                                    Kansas\n                                \n                            Flory Bidunga finished with 21 points and 10 rebounds in Saturday's 86-62 win at Kansas State. The Jayhawks' next game is Saturday against BYU.\n                        \n                            --\n                        \n                            15-5\n                        \n                                15\n                            \n                                    Vanderbilt\n                                \n                            Tyler Tanner finished with 24 points and five assists in Saturday's 88-56 win at Mississippi State. The Commodores' next game is Tuesday against Kentucky.\n                        \n                            --\n                        \n                            17-3\n                        \n                                16\n                            \n                                    Arkansas\n                                \n                            Darius Acuff Jr. finished with 31 points and six assists in Saturday's 85-81 win over LSU. The Razorbacks' next game is Tuesday at Oklahoma.\n                        \n                            --\n                        \n                            15-5\n                        \n                                17\n                            \n                                    Florida\n                                \n                            Boogie Fland missed eight of the 12 shots he attempted in Saturday's 76-67 loss to Florida. The Gators' next game is Wednesday at South Carolina.\n                        \n                            --\n                        \n                            14-6\n                        \n                                18\n                            \n                                    Virginia\n                                \n                            Malik Thomas missed nine of the 12 shots he attempted in Saturday's 85-80 loss to North Carolina. The Cavaliers' next game is Tuesday at Notre Dame.\n                        \n                            --\n                        \n                            16-3\n                        \n                                19\n                            \n                                    Clemson\n                                \n                            Nick Davidson finished with 13 points and six rebounds in Saturday's 77-63 win at Georgia Tech. The Tigers' next game is Saturday against Pitt.\n                        \n                            --\n                        \n                            17-4\n                        \n                                20\n                            \n                                    Saint Louis\n                                \n                            Trey Green finished with 15 points and three rebounds in Friday's 97-62 win at St. Bonaventure.  The Billikens' next game is Tuesday against George Washington.\n                        \n                            1\n                        \n                            19-1\n                        \n                                21\n                            \n                                    Louisville\n                                \n                            Mikel Brown Jr. missed 12 of the 13 shots he attempted in Monday's 83-52 loss at Duke. The Cardinals' next game is Saturday against SMU.\n                        \n                            1\n                        \n                            14-6\n                        \n                                22\n                            \n                                    Alabama\n                                \n                            Labaron Philon missed 13 of the 20 shots he attempted in Saturday's 79-73 loss to Tennessee. The Crimson Tide's next game is Tuesday against Missouri.\n                        \n                            --\n                        \n                            13-6\n                        \n                                23\n                            \n                                    St. John's\n                                \n                            Bryce Hopkins finished with 18 points and eight rebounds in Saturday's 88-83 win at Xavier. The Red Storm's next game is Wednesday against Butler.\n                        \n                            --\n                        \n                            15-5\n                        \n                                24\n                            \n                                    SMU\n                                \n                            Jaron Pierre Jr. finished with 28 points and five rebounds in Saturday's 83-80 win over Florida State. The Mustangs' next game is Saturday at Louisville.\n                        \n                            --\n                        \n                            15-5\n                        \n                                25\n                            \n                                    Miami (Ohio)\n                                \n                            Peter Suder finished with 27 points and 10 rebounds in Tuesday's 107-101 overtime win at Kent State. The Redhawks' next game is Tuesday against UMass.\n                        \n                            --\n                        \n                            20-0\n                        \n                                26\n                            \n                                    N. Carolina\n                                \n                            Caleb Wilson finished with  20 points and four rebounds in Saturday's 85-80 win at Virginia. The Tar Heels' next game is Saturday at Georgia Tech.\n                        \n                            --\n                        \n                            16-4\n                        \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1: Duke is clear frontrunner in ACC after easy win vs. Louisville - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/76a03b5c-b3b1-48a1-9229-a1d58eff23d4/thumbnail/1200x675/b5deae5dab2fee3f2995a7041949bdb8/duke-top-25.jpg"
      ],
      "datePublished": "2026-01-27T19:04:13.000Z",
      "dateModified": "2026-01-27T19:04:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]