[
  {
    "title": "Michael Jordan discusses last time shooting a ball, why he wishes he could still play in broadcast debut - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/michael-jordan-discusses-last-time-shooting-a-ball-why-he-wishes-he-could-still-play-in-broadcast-debut/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/54b52869-c075-444a-bc58-f4c5266a7dee/thumbnail/1200x675/7d4a905c9570d5ad5386f7f38fa45453/mj-getty.png",
    "tag": "Sports",
    "date": "2025-10-22T03:22:57.000Z",
    "description": "\n        Michael Jordan made his debut as a broadcast contributor for NBC at halftime of the NBA season opener between the Oklahoma City Thunder and H",
    "body": "\n        Michael Jordan made his debut as a broadcast contributor for NBC at halftime of the NBA season opener between the Oklahoma City Thunder and Houston Rockets, writing a new stanza in his legacy as a basketball figurehead. In an effort to \"pay it forward\" and further the game, Jordan will appear on select broadcasts throughout the 2025-26 season and offer his perspective on basketball, although his official role and the nature of his appearances is still unclear.The first segment was a pre-recorded interview at Jordan's house in which he peeled the curtain back on his relationship with the sport and how and why he aims to be involved moving forward.Jordan's post-retirement life has included a diminishing amount of basketball as he places an emphasis on spending time with family. In fact, he said he has not \"picked up a ball in years.\" The last time the Chicago Bulls legend took a shot was, in true Jordan fashion, at a golf tournament.\n\"I was at the Ryder Cup, and I rented a house from the owner,\" Jordan said. \"He came over to do pictures. He had grandkids. I was doing the meet-and-greet, thanked him for allowing me to stay at the house. He had a basketball court. He said, 'I want you to shoot one free throw.' I said, 'Really?' I already paid for the house; it's not like he had to see me.\"So when I stepped up to shoot the free throw, it's the most nervous I'd been in years. The reason being is those kids heard the stories from their parents about what I did 30 years ago. So their expectation is 30 years prior, and I haven't touched a basketball.\"\nHe made the shot.\"That made my whole week,\" Jordan said, \"that I was able to please that kid not knowing if I could.\"It has been 22 years since Jordan last suited up in an NBA uniform, and while his playing days are far in the past and it has been years since he last picked up a ball, the five-time MVP said he misses the game dearly.\"Love it like you wouldn't believe,\" Jordan said. \"In all honesty, I wish I could take a magic pill, put on shorts and go out and play the game of basketball today. Because that's who I am. That type of competition, that type of competitiveness is what I live for. I miss it. I miss that aspect of playing the game of basketball. Being able to challenge myself against what people see as great basketball. But it's better for me to be sitting here talking to you as opposed to popping my Achilles and I'm in a wheelchair for a while.\"\nWith playing out of the equation, Jordan embraced a different method to return to the game. He said that professional athletes have an obligation to pay it forward to future generations. Jordan is far from the only big-name athlete to take on a prominent role in broadcasting in recent years, but his status as arguably the greatest to ever dribble a ball gives his position immense gravity.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael Jordan discusses last time shooting a ball, why he wishes he could still play in broadcast debut - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/54b52869-c075-444a-bc58-f4c5266a7dee/thumbnail/1200x675/7d4a905c9570d5ad5386f7f38fa45453/mj-getty.png"
      ],
      "datePublished": "2025-10-22T03:22:57.000Z",
      "dateModified": "2025-10-22T03:22:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, NBA League Pass by backing Thunder, Warriors-Lakers Under - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-get-300-bonus-bets-nba-league-pass-backing-thunder-warriors-lakers-under/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:20:06.000Z",
    "description": "\n        With the 2025-26 NBA season tipping off on Tuesday, now is the perfect time to take full advantage of the latest DraftKings promo code to max",
    "body": "\n        With the 2025-26 NBA season tipping off on Tuesday, now is the perfect time to take full advantage of the latest DraftKings promo code to maximize your NBA viewing experience. With the newest DraftKings promo code, new users can receive $300 in bonus bets and three free months of NBA League Pass while online sports betting on Tuesday.The 2025-26 NBA Opening Night features a doubleheader with the defending champion Oklahoma City Thunder hosting the Houston Rockets at 7:30 p.m. ET, followed by the Los Angeles Lakers hosting the Golden State Warriors at 10 p.m. ET. One of the model's Tuesday best bets at DraftKings is the Thunder covering as 6.5-point favorites in the latest NBA odds at DraftKings Sportsbook. The model also projects Under 226.5 points in Lakers vs. Warriors. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. It is also a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anyone following its NBA betting advice or college football betting picks at sportsbooks and on betting apps could have seen huge returns.Tuesday best bets at DraftKings SportsbookThunder (-6.5) vs. Rockets (-112)Lakers vs. Warriors: Under 227.5 points (-115)Western Kentucky (+3) vs. Louisiana Tech (-105)Combining the model's three picks into a Tuesday parlay at DraftKings would result in a payout of +575 (risk $100 to win $575). Bet it at DraftKings here:\nThunder (-6.5) vs. Rockets (-112)The Thunder had the best overall record and the best record against the spread last season, going 53-25-4 to cover in 68% of their contests. No other team even covered in 60% of its games, showcasing how dominant Oklahoma City was both against its opponents and against sportsbooks' expectations. They went 37-15-2 ATS as a home favorite, including the playoffs, to cover in 71.2% of those scenarios as one of the most dominant betting teams in history. The Thunder return their entire starting lineup, and although the Rockets acquired Kevin Durant in the offseason, it could take some time for Houston's chemistry to form. The model projects the Thunder to cover in 71% of simulations. Back the Thunder at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Lakers vs. Warriors: Under 227.5 points (-115)Both the Lakers and Warriors ranked in the bottom third in the NBA in Overs hitting last season, with the Over cashing in 50.5% of Warriors games and 49.4% of Lakers games. The Warriors will likely put Jimmy Butler on Luka Doncic for the majority of the game, which could frustrate the elite scorer with one of the league's top defenders trying to slow him down. Doncic won't have LeBron James (sciatica) to lean on for offensive support either. Opening Night often brings a more postseason-like atmosphere compared to a typical regular-season game, which could bring a sharper defensive focus on both ends, as the model projects the Under to hit in 61.2% of simulations. Back the Under at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Western Kentucky (+3) vs. Louisiana TechFor college football fans, this Conference USA matchup on CBS Sports Network is just one of two options on Tuesday, and the model is predicting an upset. Western Kentucky is 5-2 this season, including 2-1 on the road and 2-0 away in Conference USA matchups entering this conference game. The Hilltoppers lost to FIU, 25-6, last week, but they had three straight wins before then, led by senior quarterback Maverick McIvor averaging 266.1 passing yards per game. Meanwhile, Louisiana Tech is coming off a 35-7 loss to Kennesaw State. Western Kentucky defeated Louisiana Tech, 31-14, last season, and the model projects the Hilltoppers to cover the spread in 61% of simulations. Back Western Kentucky at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:\nWant more NBA picks and college football picks?You've seen the model's Tuesday best bets. Now, get against the spread, total and money-line picks for all games on Tuesday, including NBA, college football, NFL and NHL, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, NBA League Pass by backing Thunder, Warriors-Lakers Under - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-10-21T21:20:06.000Z",
      "dateModified": "2025-10-21T21:20:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by backing Thunder-Rockets, Warriors-Lakers, WKU-Louisiana Tech - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-fanduel-promo-code-get-300-bonus-bets-thunder-rockets-warriors-lakers-western-kentucky-louisiana-tech/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:34:48.000Z",
    "description": "\n        Matchups in the NBA and college football provide bettors an opportunity to take advantage of the latest FanDuel promo code, which offers new ",
    "body": "\n        Matchups in the NBA and college football provide bettors an opportunity to take advantage of the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. NBA Opening Night has the Oklahoma City Thunder hosting the Houston Rockets at 7:30 p.m. ET. That game is followed by the Los Angeles Lakers vs. Golden State Warriors at 10 p.m. ET. In college football, the Western Kentucky Hilltoppers (5-2) and the Louisiana Tech Bulldogs (4-2) suit up at 7:30 p.m. ET. SportsLine's model has the Thunder covering the spread (-6.5) against the Houston Rockets in 70% of simulations of the NBA odds. The model's best bets also include the Lakers (+2.5) covering the spread, which is cashing in 58% of the simulations. Meanwhile, SportsLine's model is backing the over on total points (49.5) in Western Kentucky vs. Louisiana Tech, which is cashing in 50% of the simulations. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best Tuesday picksRockets vs. Thunder (-6.5) (-110)Warriors vs. Lakers (+2.5) (-106)Western Kentucky vs. Louisiana Tech: Over 49.5 total points (-110)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +608 (risk $100 to win $608). Bet it at FanDuel here:\nRockets vs. Thunder (-6.5) (-110)The Thunder had an NBA-best 35-6 home record last season. Oklahoma City was 37-15-2 ATS as the home team and 53-25-4 ATS during the 2024-25 season. The Rockets acquired Kevin Durant this offseason, but it will take time to gel on that side for Houston. Meanwhile, the Thunder have the same core returning, led by Shai Gilgeous-Alexander, who averaged 32.7 points last season. SportsLine's model has the Thunder covering the spread in 70% of simulations. Bet Thunder to cover at FanDuel Sportsbook:Warriors vs. Lakers (+2.5) (-106)Los Angeles will be without LeBron James (sciatica), but it has Luka Doncic running the show. Doncic averaged 28.2 points, 8.2 rebounds, and 7.7 assists per game last season. The Lakers went 13-3 ATS in division games last year and 28-16 ATS as the home team. Los Angeles also won three of the four games played against the Warriors last season, including two victories by eight-plus points. Meanwhile, Golden State was 5-11 ATS in division games last campaign. SportsLine's model thinks the Lakers cover the spread in 58% of simulations. Bet Lakers to cover at FanDuel Sportsbook now:Western Kentucky vs. Louisiana Tech: Over 49.5 total points (-110)Western Kentucky's offense averages 29.7 points per game, along with 416.9 total yards of offense. Senior quarterback Maverick McIvor ranks first in the Conference USA in passing yards (1,863) and passing touchdowns (12). The over has cashed in three games for the Hilltoppers in 2025. Louisiana Tech logs 24.8 points per game and has scored 30-plus points in three of its last four outings. SportsLine's model has these teams combining for 52 total points, with the over hitting in 50% of simulations. Bet Western Kentucky vs. Louisiana Tech over at FanDuel here:\nWant more NBA picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by backing Thunder-Rockets, Warriors-Lakers, WKU-Louisiana Tech - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-21T21:34:48.000Z",
      "dateModified": "2025-10-21T21:34:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting Thunder-Rockets, Warriors-Lakers on Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-thunder-rockets-warriors-lakers-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:48:03.000Z",
    "description": "\n        The 2025-26 NBA regular season begins on Tuesday night with a doubleheader, as the Thunder face the Rockets and Lakers host the Warriors. The",
    "body": "\n        The 2025-26 NBA regular season begins on Tuesday night with a doubleheader, as the Thunder face the Rockets and Lakers host the Warriors. The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and it can be unlocked by wagering on Tuesday's NBA and college football action. There are two Conference USA matchups, including Louisiana Tech vs. Western Kentucky.SportsLine's proven computer model is backing Western Kentucky as a 3-point underdog, and it has also revealed picks for both NBA games. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every NBA game 10,000 times, is up well over $10,000 for $100 players on top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It has also generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its NBA betting picks and college football betting picks at sportsbooks and on betting sites could have seen strong returns.Tuesday's top picks, best betsWestern Kentucky +3 vs. Louisiana TechThunder -6.5 vs. RocketsUnder 226.5 in Lakers vs. WarriorsCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +595 (risk $100 to win $595). Bet it at bet365 here:\nWestern Kentucky +3 vs. Louisiana TechWestern Kentucky had its three-game winning streak snapped in a 25-6 loss to FIU last week, but it is still off to a strong 5-2 start this season. The Hilltoppers have scored at least 27 points in all five of their wins, so last week's offensive output was an outlier. Louisiana Tech is not coming off a strong showing of its own, falling to Kennesaw State in a 35-7 final. SportsLine's model has Western Kentucky covering in 61% of simulations and even winning outright 54% of the time. Bet it at bet365 here:Thunder -6.5 vs. RocketsThe model has its first A-rated NBA pick of the season in the first game of the day, as the Thunder are covering in 70% of simulations. They won 68 games in the regular season and posted the best scoring margin in league history last year, ultimately beating Indiana in seven games in the NBA Finals. They return almost their entire roster, so they should have no problem getting off to a strong start. Meanwhile, the Rockets are trying to work Kevin Durant into the mix, which could take some time. Bet it at bet365 now:Under 226.5 in Lakers vs. WarriorsLos Angeles will not have LeBron James on the court for its season opener, leaving the Lakers without his scoring punch and elite passing. Gabe Vincent is expected to start in place of James, which is a significant downgrade. The Lakers also brought in veteran Marcus Smart and center Deandre Ayton, so their defense should be better than last year. Golden State has three key players who are 35 or older, and Draymond Green is a defensive-oriented player. The model has these teams combining for 218 points, with the Under cashing 60% of the time. Bet it at bet365 here:\nLooking for Week 8 NFL picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by targeting Thunder-Rockets, Warriors-Lakers on Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-21T21:48:03.000Z",
      "dateModified": "2025-10-21T21:48:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos' Dre Greenlaw suspended one game for verbally threatening referee - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dre-greenlaw-suspended-one-game-referee-incident-broncos-giants/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/6802c814-3bdb-465e-8914-747d1912dcdb/thumbnail/1200x675/d1a3a5d08a634d229593737306675fb2/greenlaw.jpg",
    "tag": "Sports",
    "date": "2025-10-21T23:30:59.000Z",
    "description": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        Dre Greenlaw has been suspended by the NFL for one game ",
    "body": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        Dre Greenlaw has been suspended by the NFL for one game without pay for his actions immediately following the Denver Broncos' Week 7 win over the New York Giants, the league announced Monday night.The veteran linebacker confronted referee Brad Allen moments after Denver's shocking come-from-behind victory. The NFL determined Greenlaw's actions toward Allen warranted a suspension. Greenlaw appealed the suspension, but it was upheld by the NFL on Tuesday.\nGreenlaw made his season debut Sunday after being placed on injured reserve ahead of Week 3. He missed the start of the season while dealing with multiple lower-body injuries prior to Week 1. \nIn 2024, Greenlaw played in just two games while recovering from an Achilles injury he sustained during the San Francisco 49ers' loss to the Kansas City Chiefs in Super Bowl LVIII. He spent his first six NFL seasons in San Francisco before inking a three-year deal with Denver this past offseason. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos' Dre Greenlaw suspended one game for verbally threatening referee - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/6802c814-3bdb-465e-8914-747d1912dcdb/thumbnail/1200x675/d1a3a5d08a634d229593737306675fb2/greenlaw.jpg"
      ],
      "datePublished": "2025-10-21T23:30:59.000Z",
      "dateModified": "2025-10-21T23:30:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL executive pushes back against MetLife Stadium turf injury concerns: 'It's playing really well' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-executive-pushes-back-against-metlife-stadium-turf-injury-concerns-its-playing-really-well/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/7ba725cc-53c9-4c89-92bc-20aa30e67777/thumbnail/1200x675/38635dcbee4ad4fcf1ab4a1cea57e759/metlife-stadium.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:39:26.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The field surface at MetLife Stadium, home of the ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The field surface at MetLife Stadium, home of the New York Giants and New York Jets, has long been criticized, but NFL Executive Vice President Jeff Miller said Tuesday that the artificial turf is not causing an influx of injuries. Miller said despite the conversation around MetLife, it actually had \"one of the lowest injury rates across the league\" in 2024.\"It's playing really well and it has for a while,\" Miller said.\nThe NFL's injury data in 2024 showed that MetLife is ninth-best in terms of lower-extremity injuries and is first for visiting players. In 2023, MetLife turned to an updated version of FieldTurf, FieldTurf Core system, that is aimed at decreasing injuries. The conversation surrounding the safety level of the MetLife turf was re-ignited after Giants wide receiver Malik Nabers suffered a season-ending knee injury last month. Other recent and notable injuries occurring at MetLife include Aaron Rodgers and Jaelan Phillips suffering Achilles injuries in 2023.\n        \n            \n                MetLife Stadium playing surface under the microscope again following Malik Nabers' knee injury\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nESPN reported earlier this month that one executive from an opposing team playing at the stadium said players are \"petrified\" to play there and some may be more likely to sit out if they are dealing with a lingering injury already. The report states that 90% of players prefer to play on grass than artificial turf. The Jets say since 2023, grass fields saw more knee ligament or Achilles tears.\nFormer Giants wide receiver Odell Beckham Jr. made his thoughts known about the field following Nabers' injury. Beckham, who suffered an ankle fracture at MetLife in 2017, asked the NFL to \"get rid of the turf.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL executive pushes back against MetLife Stadium turf injury concerns: 'It's playing really well' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/7ba725cc-53c9-4c89-92bc-20aa30e67777/thumbnail/1200x675/38635dcbee4ad4fcf1ab4a1cea57e759/metlife-stadium.jpg"
      ],
      "datePublished": "2025-10-21T21:39:26.000Z",
      "dateModified": "2025-10-21T21:39:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks injury update: Josh Hart, Mitchell Robinson to miss season opener vs. Cavaliers, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-injury-update-josh-hart-mitchell-robinson-to-miss-season-opener-vs-cavaliers-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/d4854c90-6d5e-42c6-bb06-ed4da21c3c41/thumbnail/1200x675/4f0a0608f6266ee7b60893ab72324d47/josh-hart-mitchell-robinson-knicks-g.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:52:11.000Z",
    "description": "\n        The New York Knicks will be without both Josh Hart and Mitchell Robinson when they open the 2025-26 season Wednesday night against the Cavali",
    "body": "\n        The New York Knicks will be without both Josh Hart and Mitchell Robinson when they open the 2025-26 season Wednesday night against the Cavaliers, per ESPN's Shams Charania. It's a significant blow to the Knicks as they embark on a season that comes with incredibly high expectations after a run to the Eastern Conference finals a year ago.The status of Hart, though, doesn't come as a surprise. Hart has been dealing with a back injury ever since he took a rough fall during New York's preseason game against the 76ers. He hasn't suited up since that game and is being listed out with \"lumbar spasms.\" Knicks coach Mike Brown spoke of Hart's status moving forward after practice Tuesday.\"We're trying to figure out his back, which is a tricky situation,\" Brown said. \"We have to be careful with it, we don't want to rush him. We'll be patient and figure it out as we go along. [Knicks head trainer Casey Smith] does a great job, and we believe in them so we're going to follow their plan.\"\n        \n            \n                NBA commissioner Adam Silver isn't worried about losing talent to European league, but maybe he should be\n                \n                    Jasmyn Wimbish                \n            \n                            \n    \n                \n                    \n    \nWith Robinson, he's being sidelined with left ankle injury management, per the New York Post's Stefan Bondy. Mitchell missing the season opener is more for a load management perspective, as he did play in three of the Knicks' five preseason matchups. Neither of Hart or Robinson practiced Tuesday.\n\"Really it's load management, which means that if we deemed it necessary, could he possibly go, yeah,\" Brown said of Robinson's status. \"But it's a decision that myself, led by [Casey Smith] whose in charge of performance on a daily basis. It will be like this the whole year.\"So from the sounds of it, the Knicks' plan with Robinson is to be cautious with his workload all season in hopes of having him healthy for the playoffs. It's a smart strategy, given he's played in just 107 games over the last three seasons due to various injuries. The left ankle \"injury management\" he's dealing with right now is the same one he had surgically repaired two years ago which limited him to just 31 games.While it's a smart plan to load manage Robinson, it is still a bit concerning that he's still dealing with ankle issues two years removed from the surgery. His injury history has always prevented him from establishing any sort of consistency with the Knicks. When he's healthy, he's a solid rim protector and pick-and-roll partner for the likes of Jalen Brunson, but his health has never been something the Knicks could count on. It's why Robinson's pending free agency next summer will be tricky to predict, and now that he'll be load managed all season long, it will surely question how much the Knicks want to invest in him moving forward if injuries will always be a concern for him.\nIn regard to Hart, he's also dealing with a finger injury that he'll need to wear a splint for the entire season after having surgery on it this summer. His production will be sorely missed on the defensive end as a do-it-all hustle player for the Knicks. Depending on how much time both players miss, this certainly isn't how the Knicks wanted to start the season. They could be playing it cautious with both guys, but if Robinson's injury is something more serious, that's a massive red flag for New York. If he misses significant time, they'll once again be shorthanded in the frontcourt without a quality rim protector and interior defender to help Karl-Anthony Towns.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks injury update: Josh Hart, Mitchell Robinson to miss season opener vs. Cavaliers, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/d4854c90-6d5e-42c6-bb06-ed4da21c3c41/thumbnail/1200x675/4f0a0608f6266ee7b60893ab72324d47/josh-hart-mitchell-robinson-knicks-g.jpg"
      ],
      "datePublished": "2025-10-21T21:52:11.000Z",
      "dateModified": "2025-10-21T21:52:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marcus Rashford's redemption arc at Barcelona continues with another Champions League brace - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/marcus-rashfords-redemption-arc-at-barcelona-continues-with-another-champions-league-brace/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/62e7d4af-e6ef-49e0-8488-ad2a4b66772f/thumbnail/1200x675/32c522d22b232c6e26a38ccc7acc9b8f/fcb-1.jpg",
    "tag": "Sports",
    "date": "2025-10-21T23:03:12.000Z",
    "description": "\n        When Marcus Rashford moved on loan from Manchester United to Barcelona over the summer, the deal felt more like an exercise in convenience mo",
    "body": "\n        When Marcus Rashford moved on loan from Manchester United to Barcelona over the summer, the deal felt more like an exercise in convenience more than anything else. The Red Devils needed to rid themselves of Rashford, both in pursuit of a new rebuild in their never-ending series of them, and because Rashford's career at his boyhood club was essentially dead and buried after receiving the ire of fans and club legends alike. Barcelona was a glamorous but practical landing spot – the cash-strapped club did not have a transfer fee to worry about, while their pre-existing attacking talent meant there was only so much pressure on Rashford. After years of being the next big thing and then the poster child for wasted talent, the player would finally have a chance to slide into normalcy.So much for that.Rashford may not be Barcelona's most important player, but two months into his spell at the club, he is charting an unlikely redemption arc as one of the team's most effective attackers. He now has five goals and four assists in 13 games, adding a brace to his tally with a 6-1 win over Olympiacos in UEFA Champions League action on Tuesday and now leads the competition for goal contributions with five. His second Champions League brace of the season offered the latest glimpse of the revitalized player, especially his second goal in the 79th minute – he tucked himself just behind a defender and as soon as Pedri received the ball in a crowded midfield, he threw his hand forward to call his teammate's attention. Pedri obliged with a perfectly placed pass and Rashford wasted little time following up with an equally excellent finish on the edge of the penalty area.\nHe offers more in terms of end product these days than he did during his last full season at United during the 2023-24 campaign, his goals per game average up from 0.2 to 0.4 and his assist numbers up from 0.1 to 0.3. His shot-taking is also up from an average of two per game to 3.3 this season, but the most dramatic differences in his game are saved for the underlying statistics. He is much more involved in play, averaging 44 touches and 26.4 passes per game these days, more than the 36.8 touches and 22.8 passes he had per game during the 2023-24 season at United.\nRashford is emerging as a more well-rounded player than he once was, with manager Hansi Flick describing his brace at Newcastle United on Matchday 1 as the \"first step\" in his Barcelona evolution. \"Our style, how we want to play, is focused on high intensity and this is what I want to see also from him,\" Flick said at the time.As he learns to play the Barcelona way, though, he is more than just a useful player for the team at a crucial point in the season. Rashford has been able to put goals in the back of the net while both Robert Lewandowski and Raphinha deal with injury, allowing Flick to rely on others to ensure Barcelona's attack remains their greatest strength. The team is averaging 2.7 goals per game in LaLiga this campaign, the exact same average from last season, with a different cast of characters pitching in – Rashford has played a part, as has this season's leading goalscorer Fermin Lopez, whose hat trick against Olympiacos brings him up to eight goals across all competitions.The team's overall success in attack provides some optimism ahead of Sunday's Clasico at Real Madrid, where they will still be without Raphinha and Lewandowski as they look to overtake their rivals for top spot in LaLiga. Barcelona's depth is definitely strong enough to get the job done on most days, Flick's side the favorites to win in more games than not, though the question facing last season's domestic double winners is if they can handle their stiffest test of the season so far without two of their most talented players. Rashford may earn a start in El Clasico because of Raphinha and Lewandowski's absence, which may be a litmus test of his true potential as the 27-year-old enters his peak years, especially in the midst of an impressive run of form.\nEven if Barcelona come out of El Clasico with a defeat, there is a version of events on Sunday that will not necessarily reflect poorly on Rashford. It would be no insult to admit that Lewandowski is a better choice to lead Barcelona's front line than Rashford but in a new setting, the England international has already reset expectations for what his career should be, not could be. He may not be the star on one of Europe's top teams but to play a sizable role on one of them is no small feat and as the oldest starter in Barcelona's youth-focused lineup against Olympiacos, there's a growing sense of professionalism that makes up Rashford's profile. It may be early in the season but as long as Rashford trends in this direction, his stint at Barcelona feels like enough to recalibrate his reputation, even if he cannot extend his stay at the end of his loan.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marcus Rashford's redemption arc at Barcelona continues with another Champions League brace - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/62e7d4af-e6ef-49e0-8488-ad2a4b66772f/thumbnail/1200x675/32c522d22b232c6e26a38ccc7acc9b8f/fcb-1.jpg"
      ],
      "datePublished": "2025-10-21T23:03:12.000Z",
      "dateModified": "2025-10-21T23:03:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHL power ratings: Golden Knights, Avalanche stellar after Week 2 of 2025-26 season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/nhl-power-ratings-golden-knights-avalanche-stellar-after-week-2-of-2025-26-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/07/be9c3537-7ba3-4f90-83e4-cd6a7e6e9d88/thumbnail/1200x675/d4d7b4b7eaa8d8c6278ac0c27bfdb8b9/getty-jack-eichel-golden-knights-avalanche.jpg",
    "tag": "Sports",
    "date": "2025-10-22T02:03:38.000Z",
    "description": "\nAs we prepare to begin Week 3 of the 2025-26 NHL season, a pair of teams still have not come away from a game without at least one point. Both clubs ",
    "body": "\nAs we prepare to begin Week 3 of the 2025-26 NHL season, a pair of teams still have not come away from a game without at least one point. Both clubs reside in the Western Conference, and both have registered at least five victories, which is two more than the Tampa Bay Lightning, Los Angeles Kings, Calgary Flames and San Jose Sharks combined.The Vegas Golden Knights (5-0-2) sit atop the NHL standings with 12 points after having won all four of their contests in Week 2. They are one point ahead of the Colorado Avalanche (5-0-1), who went 2-0-0 last week after posting three wins and a shootout loss in the opening week of the campaign.Each week during the season, I'll rank the league's top 10 teams based on both the previous week's performances and their overall bodies of work in 2025-26. I'll also give brief synopsis for each club that explains why they're ranked where they are.Let's dive into the power ratings after Week 2 of the 2025-26 NHL season and highlight a few of the teams' notable accomplishments.NHL Week 2 power ratings 1. Vegas Golden Knights (4-0-0 in Week 2; 5-0-2 overall)The Golden Knights began Week 2 with a 4-2 triumph at Calgary and returned home to defeat the Boston Bruins, Flames and Carolina Hurricanes. Vegas scored at least four goals in each victory and has done so in six of its first seven games this season. Jack Eichel leads the NHL with 16 points and has landed on the scoresheet in every contest thus far as he notched four goals and five assists last week. Meanwhile, Pavel Dorofeyev is tied for first in the league with seven goals after recording a career-high 35 in 2024-25. Vegas' offensive mettle will be tested, however, as captain Mark Stone - who tops the NHL with 11 assists and ranks second with 13 points - suffered a wrist injury during his four-point performance against Calgary last Saturday and is considered week-to-week.2. Colorado Avalanche (2-0-0; 5-0-1)The Avalanche, whom I ranked first after Week 1, slipped a spot due to having played just twice last week. But they won both contests, defeating the Columbus Blue Jackets and Bruins by identical 4-1 scores. Valeri Nichushkin scored twice against Columbus and Nathan MacKinnon netted a pair of tallies versus Boston while Artturi Lehkonen registered a total of four assists in the wins. Cale Makar was kept off the scoresheet by the Bruins but recorded a goal and an assist against the Blue Jackets and is tied with Carolina's Shayne Gostisbehere for the points lead (seven) among NHL defensemen.3. Winnipeg Jets (3-0-0; 5-1-0)The Jets opened the season with a loss to the Dallas Stars but ended Week 1 with a pair of victories and proceeded to win all three of their games last week. The reigning Presidents' Trophy winners outscored their opponents 11-4 in those contests and have allowed fewer than three goals in every outing during their five-game winning streak. Mark Scheifele has scored in every game during the run and shares the league lead of seven goals with Vegas' Dorofeyev and Shane Pinto of the Ottawa Senators. The 32-year-old Scheifele also enters Week 3 with a six-game point streak as he notched three assists in the opener against Dallas.4. Detroit Red Wings (3-0-0; 5-1-0)The Red Wings have followed the exact same path as the Jets, losing their season opener before reeling off five consecutive victories. Like Winnipeg, Detroit also was perfect in Week 2, defeating the defending Stanley Cup champion Florida Panthers, Tampa Bay Lightning and Edmonton Oilers by a combined 10-4 score. Captain Dylan Larkin has begun 2025-26 with a six-game point streak of his own, collecting five goals and six assists during the surge. Patrick Kane, who recorded five points over the Red Wings' first five contests, is sidelined with an upper-body injury, but 20-year-old rookie Emmitt Finnie picked up the offensive slack in Sunday's 4-2 triumph over Edmonton by notching two goals and an assist.5. Carolina Hurricanes (3-1-0; 5-1-0)The Hurricanes would have owned the No. 1 spot on this list had they not suffered a 4-1 loss at Vegas on Monday. The setback ended the season-opening five-game winning streak for Carolina, which scored four or more goals in each contest. It also put a blemish on the Hurricanes' current six-game road trip after they cruised through California with victories over San Jose, the Anaheim Ducks and Los Angeles. Seth Jarvis recorded two goals and an assist in the 4-1 triumph over the Ducks last Thursday and scored the overtime winner against the Kings two days later. Gostisbehere, who began the campaign with a four-game point streak sat out Monday's setback with a lower-body injury and will miss the rest of Carolina's trek, which consists of contests at Colorado and Dallas.6. Montreal Canadiens (3-1-0; 5-2-0)If not for a three-goal outburst by the New York Rangers in span of less than 5 1/2 minutes of the third period last Saturday, the Canadiens would be entering Week 3 with a six-game winning streak. Montreal lost that contest 4-3, ending its four-game run, but bounced back to double up the Buffalo Sabres 4-2 on Monday. Nick Suzuki notched a pair of assists in that victory, extending his point streak to six games. The 26-year-old center has amassed a goal and nine assists during the run.7. Utah Mammoth (3-0-0; 4-2-0)After losing two of three games on the road during Week 1, the Mammoth began a four-game homestand with victories against Calgary, San Jose and Boston last week. Utah scored a total of 12 goals in the wins, with Nick Schmaltz registering his second career hat trick in a 6-3 triumph over the Sharks last Friday. The 29-year-old center also notched an assist in that win, while captain Clayton Keller netted a tally and set up three others. Keller followed with a goal and an assist as the Mammoth edged the Bruins 3-2 on Sunday and Schmaltz had a pair of assists, giving him points in five of Utah's first six contests of the season.8. Vancouver Canucks (3-0-0; 4-2-0)The Canucks also won all three of their games last week after losing two of three in Week 1. Vancouver kicked off its five-game road trip with a 5-3 triumph at Dallas last Thursday and edged the Blackhawks 3-2 in a shootout the following day before holding on for a 4-3 victory against the Washington Capitals on Sunday in which it scored the first four goals of the contest. Conor Garland landed on the scoresheet in every game during the Canucks' winning streak, collecting a goal and four assists during the stretch. 9. New Jersey Devils (2-0-0; 4-1-0)The Devils weren't very active in Week 2 but were successful, winning both of their contests to extend their winning streak to four games following a season-opening loss at Carolina. They also posted the two victories without Jacob Markstrom, who hasn't played since Oct. 13 due to a lower-body injury that head coach Sheldon Keefe said would keep him sidelined for \"a couple of weeks.\" Jake Allen turned aside 48-of-52 shots in New Jersey's triumphs over Florida and Edmonton, while Jack Hughes registered a three goals and an assist. 10. Seattle Kraken (1-1-2; 3-1-2)The Kraken opened a season with back-to-back wins for the first time in their brief history, but they dropped three of four in Week 2 to fall three spots in these rankings. However, they earned a point in two of the defeats and could've won those contests, as they squandered one-goal leads late in the third period and lost in overtime to Montreal last Tuesday and in a shootout versus Ottawa two days later. Finnish rookie right wing Jani Nyman scored three goals last week, Chandler Stephenson netted a pair of tallies and set up three others and Shane Wright recorded two goals and two assists.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHL power ratings: Golden Knights, Avalanche stellar after Week 2 of 2025-26 season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/07/be9c3537-7ba3-4f90-83e4-cd6a7e6e9d88/thumbnail/1200x675/d4d7b4b7eaa8d8c6278ac0c27bfdb8b9/getty-jack-eichel-golden-knights-avalanche.jpg"
      ],
      "datePublished": "2025-10-22T02:03:38.000Z",
      "dateModified": "2025-10-22T02:03:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Monaco vs. Tottenham Hotspur live stream, odds: How to watch UEFA Champions League, predicted lineups, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/monaco-vs-tottenham-hotspur-live-stream-odds-how-to-watch-uefa-champions-league-predicted-lineups-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/b02a532a-3fff-49ef-ba03-dacc9c65e72a/thumbnail/1200x675/ccce721d51f93befa320cd92d77d7f60/spurs-1.jpg",
    "tag": "Sports",
    "date": "2025-10-22T02:19:54.000Z",
    "description": "\nTottenham Hotspur aim to extend their unbeaten run in the UEFA Champions League on Wednesday as they face Monaco, a match that offers a chance to cor",
    "body": "\nTottenham Hotspur aim to extend their unbeaten run in the UEFA Champions League on Wednesday as they face Monaco, a match that offers a chance to correct course after some inconsistency in recent weeks.Spurs were unlucky to concede twice against Aston Villa in a 2-1 defeat in Premier League action on Sunday, the opponents notching two goals despite posting just 0.32 expected goals, but have their own attacking issues to sort out against Monaco. Thomas Frank's side currently rank 14th in England's top flight on expected goals with just 8.36 through eight games despite scoring 14 times, at times making up the difference off set pieces and own goals. How sustainable a strategy that is in Frank's first season in charge remains to be seen, though. Only two of their forwards – Richarlison and Brennan Johnson – have three goals this season but Richarlison has not scored in five and Johnson has not notched a goal in the team's last four games.Monaco have not been the picture of consistency, either, though and are winless in their last four games across all competitions. The Ligue 1 side are also searching for their first win of the Champions League season, though they managed to take a point off Manchester City in a 2-2 draw on Matchday 2.Here's what you need to know before tuning in.How to watch Monaco vs. Tottenham Hotspur, oddsDate: Wednesday, Oct. 22 | Time: 3 p.m. ETLocation: Stade Louis II -- MonacoLive stream: Paramount+Odds: Monaco +195; Draw +250; Tottenham Hotspur +135Projected lineupsMonaco: Philipp Kohn, Krepin Diatta, Thilo Kehrer, Mohammed Salisu, Kassoum Ouattara, Jordan Teze, Mamadou Coulibaly, Maghnes Akliouche, Ansu Fati, Caio Henrique, Mika BierethTottenham Hotspur: Guglielmo Vicario, Pedro Porro, Kevin Danso, Micky van de Ven, Djed Spence, Joao Palhinha, Lucas Bergvall, Mohammed Kudus, Xavi Simons, Wilson Odobert, RicharlisonPredictionA game between a middling side in Monaco and a team that finds goals somewhat hard to come by in Spurs may not be terribly riveting, so expect a modest scoreline on Wednesday. Even as the visitors have plenty of attacking issues to work out, though, the set piece tricks will always come in handy and may be just enough to take all three points home on Matchday 3 and keep themselves in good standing in the league phase. Pick: Monaco 0, Tottenham Hotspur 1\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Monaco vs. Tottenham Hotspur live stream, odds: How to watch UEFA Champions League, predicted lineups, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/b02a532a-3fff-49ef-ba03-dacc9c65e72a/thumbnail/1200x675/ccce721d51f93befa320cd92d77d7f60/spurs-1.jpg"
      ],
      "datePublished": "2025-10-22T02:19:54.000Z",
      "dateModified": "2025-10-22T02:19:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Raiders WR Jakobi Meyers doubles down on trade request, says he 'for sure' wants to be dealt - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/raiders-wr-jakobi-meyers-doubles-down-on-trade-request-says-he-for-sure-wants-to-be-dealt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/46f3789a-2990-4cfb-bd27-1bfa53e8e18d/thumbnail/1200x675/eaf46688ab29575f141b451109b9fdf2/gettyimages-2240874920-1.jpg",
    "tag": "Sports",
    "date": "2025-10-22T00:04:06.000Z",
    "description": "\n        Las Vegas Raiders wide receiver Jakobi Meyers requested a trade in the offseason, and while the team did not move him before the season start",
    "body": "\n        Las Vegas Raiders wide receiver Jakobi Meyers requested a trade in the offseason, and while the team did not move him before the season started, nothing has changed with regard to his desire to play elsewhere. Meyers said ahead of Week 8 that he \"for sure\" still wants to be traded, even though the Raiders reportedly had no interest in shipping him off at the start of the year.The NFL trade deadline is just over two weeks away, and there is still seemingly no momentum in a potential Meyers deal. A number of teams could benefit from adding the veteran receiver if he becomes available ahead of the Nov. 4 deadline, though. Wideout-needy teams like the New York Giants and Pittsburgh Steelers could be buyers, and the New England Patriots are familiar with Meyers and could potentially use another weapon for breakout quarterback Drake Maye.\"I'm a professional at the end of the day,\" Meyers said Tuesday. \"I'm just trying to play good football. If I'm here, like I said, I'll play good football. If I'm not here, I'll go out there and play wherever I'm supposed to be.\"\n        \n            \n                Jakobi Meyers landing spots: Where could veteran WR wind up if Raiders trade him before deadline?\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nMeyers' August trade request came after his search for a new contract came up short. He is in the final season of a three-year deal he signed with the Raiders in 2023, and his stock could not have been higher in the offseason as he was fresh off a career year in which he racked up 87 catches for 1,027 yards and four touchdowns.\nThe sides did not reach an agreement on an extension before the season began, halting the discussions.\"That window kind of closed when the offseason ended,\" Meyers said. \"I'm just focused on being where my feet are. If it gets done, I don't care, for real. I just want to be in a good spot for me, for my family, and like I said, really just play good football.\"The Raiders, who are 2-5 and in last place in the AFC West, will have to determine how expendable Meyers is before making a decision on whether to trade him at the deadline, to re-sign him before or during free agency or to let him walk at the end of the year. With the offense struggling under first-year coach Pete Carroll, Meyers has not been quite the leader of the wideouts that he was last year when he finished second only to tight end Brock Bowers in receiving, but he still ranks in a tie for first place on the team with 29 catches.\nFellow receiver Tre Tucker emerged as the Raiders' most productive pass-catcher from both a yardage and touchdown standpoint with Bowers missing time this season due to injury.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Raiders WR Jakobi Meyers doubles down on trade request, says he 'for sure' wants to be dealt - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/46f3789a-2990-4cfb-bd27-1bfa53e8e18d/thumbnail/1200x675/eaf46688ab29575f141b451109b9fdf2/gettyimages-2240874920-1.jpg"
      ],
      "datePublished": "2025-10-22T00:04:06.000Z",
      "dateModified": "2025-10-22T00:04:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bayern Munich vs. Club Brugge live stream, odds: How to watch Champions League, predicted lineups, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/bayern-munich-vs-club-brugge-live-stream-odds-how-to-watch-champions-league-predicted-lineups-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/51ff0c9e-d832-4d19-95bc-f5f612c64552/thumbnail/1200x675/21d5dcae58d63e81f95f54667402c45a/bayern.jpg",
    "tag": "Sports",
    "date": "2025-10-22T02:20:02.000Z",
    "description": "\n\n\n    \n                                    The German giants will face Club Brugge on Wednesday at the Allianz Arena\n        \n                       ",
    "body": "\n\n\n    \n                                    The German giants will face Club Brugge on Wednesday at the Allianz Arena\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 21, 2025\n                            \n                    at\n    10:20 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \nBayern Munich will host Club Brugge on Wednesday for their third match of their Champions League season. The German side, coached by Vincent Kompany, had a perfect start of the 2025-26 spell, with seven wins in the opening seven games of the Bundesliga season, including the last home win against Borussia Dortmund over the weekend, and they also started off their Champions League campaign with two wins in two matches against Chelsea and Pafos. Club Brugge, on the other hand, won 4-1 in the opening clash against AS Monaco before losing away to Atalanta in the second matchday of the 2025-26 season. Here's all you need to know ahead of Wednesday's game: Viewing informationDate: Wednesday, Oct. 22 | Time: 3 p.m. ETLocation: Allianz Arena -- MunichLive stream: Paramount+Odds: Bayern Munich -550; Draw +380; Club Brugge +600Possible lineupsBayern Munich XI: Manuel Neuer; Sacha Boey, Dayot Upamecano, Jonathan Tah, Konrad Laimer; Joshua Kimmich, Aleksandar Pavlovic; Michael Olise, Harry Kane, Luis Diaz; Nicolas Jackson.Club Brugge XI: Nordin Jackers; Kyriani Sabbe, Joel Ordonez, Brandon Mechele, Joaquin Seys; Aleksandar Stankovic, Cisse Sandra; Carlos Forbs, Hans Vanaken, Christos Tzolis; Nicolo Tresoldi.PredictionThe German side are expected to win again after winning the first two matches of the Champions League season so far against Chelsea and Pafos, while they are dominating the Bundesliga with seven wins in seven games. Pick: Bayern Munich 3, Club Brugge 0. How to watchAll of the action on Matchday 3 of the UEFA Champions League can be caught on Paramount+, while CBS Sports Network and CBS Sports Golazo Network will have select simultaneous coverage. Each day's coverage begins with Champions League Matchday, streaming on Paramount+ and CBS Sports Golazo Network ahead of the early games before the UEFA Champions League Today pre-match show begins on Paramount+ and CBS Sports Network. The Golazo Show on Paramount+ also returns for the late slate of matches, while the UEFA Champions League Today post-match show on Paramount+ and CBS Sports Network picks things up at the end of the day. The day's coverage concludes on CBS Sports Golazo Network with The Champions Club (also streamed live on YouTube) and Scoreline.Matchday 3 TV scheduleAll times U.S./EasternWEDNESDAY, OCT. 22TIMEHOW TO WATCHChampions League Matchday12 p.m.Paramount+, CBS Sports Golazo NetworkAthletic Club vs. Qarabag12:45 p.m.Paramount+Galatasaray vs. Bodo/Glimt12:45 p.m.Paramount+, CBS Sports Golazo NetworkUEFA Champions League Today pre-match2 p.m.Paramount+, CBS Sports NetworkChampions League Matchday2:45 p.m.CBS Sports Golazo NetworkThe Golazo Show3 p.m.Paramount+Chelsea vs. Ajax3 p.m.Paramount+Real Madrid vs. Juventus3 p.m.Paramount+Sporting Lisbon vs. Marseille3 p.m.Paramount+, CBS Sports Golazo NetworkMonaco vs. Tottenham Hotspur3 p.m.Paramount+Atalanta vs. Slavia Praha3 p.m.Paramount+Eintracht Frankfurt vs. Liverpool3 p.m.Paramount+Bayern Munich vs. Club Brugge3 p.m.Paramount+, CBS Sports NetworkUEFA Champions League Today post-match5 p.m.Paramount+, CBS Sports NetworkThe Champions Club5 p.m.CBS Sports Golazo Network, YouTubeScoreline7 p.m.\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bayern Munich vs. Club Brugge live stream, odds: How to watch Champions League, predicted lineups, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/51ff0c9e-d832-4d19-95bc-f5f612c64552/thumbnail/1200x675/21d5dcae58d63e81f95f54667402c45a/bayern.jpg"
      ],
      "datePublished": "2025-10-22T02:20:02.000Z",
      "dateModified": "2025-10-22T02:20:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants waive kicker Jude McAtamney after multiple missed extra points in meltdown loss to Broncos - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-waive-kicker-jude-mcatamney-after-multiple-missed-extra-points-in-meltdown-loss-to-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/0fe14cba-d174-4f76-8908-824dac54e674/thumbnail/1200x675/2aeaf406e4832dfbbb4ff074ee08fefb/gettyimages-2242120010.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:53:26.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants waived kicker Jude McAtamney o",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants waived kicker Jude McAtamney on Tuesday, two days after he contributed to the team's all-time collapse against the Denver Broncos by missing multiple extra points. McAtamney missed three extra points in a two-week period, with the third and final miss helping seal the Giants' doom after blowing a 25-8 lead in the final minutes of Sunday's loss in Denver.McAtamney, a second-year pro from Northern Ireland who was an undrafted free agent out of Rutgers, joined the Giants via the NFL's International Pathway program and was thrust into kicking duties in Week 4 after veteran Graham Gano injured his groin pre-game against the Kansas City Chiefs. McAtamney made two short field goals in his first action against the Chargers and made two extra points a week later. He missed an extra point in Week 6 against the Philadelphia Eagles before completely falling apart against the Broncos.\n        \n            \n                Broncos set two NFL records in stunning comeback win over Giants: How Denver rewrote the record book\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nAfter missing an extra point early in the game, McAtamney missed again after quarterback Jaxson Dart scored a go-ahead touchdown with 37 seconds left, leaving the score 32-30 and giving the Broncos the opportunity to kick a game-winning field goal instead of having to settle for tying the game. McAtamney's kicks also influenced the loss in other ways, as his lack of range prompted the Giants to pass up on field goal attempts, and his extra point miss prompted the Giants to try a failed two-point conversion when going up 19-0 late in the third quarter.\nMcAtamney's release comes as Gano is now eligible to come off Injured Reserve, with the New York Post reporting that Gano will kick on Tuesday to determine if he is ready to return to playing. The Giants also have Younghoe Koo, who was cut by the Atlanta Falcons after missing kicks early in the season, on their practice squad.Gano, a former Pro Bowl kicker who was among the best in the league in his first several years with the Giants, has struggled with injuries since the 2023 season and has missed 20 of a possible 41 games in that stretch.\nThe Giants fell to 2-5 with the loss to the Broncos and will look to rebound on the road against the Eagles on Sunday. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants waive kicker Jude McAtamney after multiple missed extra points in meltdown loss to Broncos - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/0fe14cba-d174-4f76-8908-824dac54e674/thumbnail/1200x675/2aeaf406e4832dfbbb4ff074ee08fefb/gettyimages-2242120010.jpg"
      ],
      "datePublished": "2025-10-21T21:53:26.000Z",
      "dateModified": "2025-10-21T21:53:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch NBA opening night: TV channel, stream Lakers-Warriors, OKC-Rockets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-opening-night-best-bets-luka-doncic-lebron-lakers-thunder-kevin-durant-rockets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/08498b7e-4c20-46b5-8c17-60dee0b568c5/thumbnail/1200x675/a33f3aeaa675182eeb011fd3a35908b4/luka-doncic-lakers-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-10-21T21:39:50.000Z",
    "description": "\n        The 2025-26 NBA season is officially at hand, and it's missing a key character. For the first time since the 2018-19 season, LeBron James is ",
    "body": "\n        The 2025-26 NBA season is officially at hand, and it's missing a key character. For the first time since the 2018-19 season, LeBron James is absent from the festivities. This is the first season opener he's ever missed, and his Lakers have been a fixture on opening night ever since their 2019 acquisition of Anthony Davis. He's not the only significant name we won't see on Tuesday. Obviously, the Houston Rockets will be without Fred VanVleet as he'll likely miss the season recovering from a torn ACL, and the Oklahoma City Thunder are missing key forward Jalen Williams. The season hasn't even begun and we're already missing several important players. Alas, we soldier on without them, as their teams now must. The Rockets, Thunder, Lakers and Warriors will tip off the 2025-26 season on Tuesday, even if they have to do so at least at full strength.   Where to watch NBA opening night Game times: Thunder vs. Rockets, 7:30 p.m. ET | Lakers vs. Warriors, 10 p.m. ETTV channel: NBC | Live stream: fubo (Try for free), PeacockOdds (via DraftKings): OKC -258, HOU +210, O/U: 227.5 | GSW -142, LAL +120, O/U: 226.5So, with the season set to tip off, let's pick some best bets for Tuesday's slate with odds provided by DraftKings Sportsbook.  Houston Rockets at Oklahoma City Thunder We're kicking off the season with last year's No. 1 and No. 5 ranked defenses, so there's going to be a temptation to lean under here. That's especially true with Houston starting a jumbo lineup with Kevin Durant at shooting guard, and the inevitable emotions of ring night pouring over into the game. Keep in mind, though, these teams played five games last season. The lowest-scoring of them came in at 207. The other four came in at 233, 235, 236 and 265. For whatever reason, these defenses can stop everyone but one another. The absence of Williams will be felt fairly acutely for the Thunder defensively, as he was the obvious Durant matchup. They have a ton of other viable perimeter defenders, but their one weakness is height. That's a problem against one of the tallest wing scorers in league history, and both teams will generate easy points off turnovers, which tend to be plentiful early in seasons when offenses are sloppier. The Pick: Over 227.5. \nI'll admit I'm tempted to pick Houston to cover the seven-point spread. The Rockets beat the Thunder twice last season and it's opening night -- we want drama. But I just can't get over the danger of starting Amen Thompson as a point guard in his first game without Fred VanVleet around as a security blanket against this, specific Thunder team. I have all the faith in the world in Thompson eventually being a point guard-level handler and creator. It should even happen this season. But right away, against the best turnover-generating defense ever on the road with a raucous Oklahoma City crowd? I just think that's the difference here. Thompson will get there. I don't think he's quite ready for the role he'll have to play right away. The Pick: Thunder -7 Big news, NBA fans. The all-new DraftKings promo code gives new users three free months of NBA League Pass and $300 in bonus bets with a winning $5 wager. Get started here. NBA League Pass lets you watch out-of-market NBA games, live and on demand. NBA League Pass users can also use multi-view features to stream multiple games at the same time, making it even easier to watch your favorite players,  teams, NBA bets, or Fantasy basketball lineups. Claim your offer now: It wouldn't be a Rockets game without a rebounding prop. I'm operating under the assumption that Alperen Sengun, for offense's sake, with Houston playing this jumbo lineup, just isn't going to be able to leave the floor much. Steven Adams and Clint Capela will come and go, but the Rockets are playing big, which probably means their shooting is going to be suboptimal. This is the best offensive rebounding team in the NBA, and I'm expecting them to reaffirm that on opening night. The Pick: Alperen Sengun Over 8.5 Rebounds \n \tGolden State Warriors at Los Angeles Lakers An opening night home underdog that has the best player in the game? Yes please. Luka Dončić has had a reasonably successful regular-season record against the Warriors at 14-8. Their defense, imposing as it is against the right opponents, struggles most with heliocentric offensive stars because they lack a single, elite perimeter defender. If you're a Deandre Ayton optimist, you'd figure that this would be a game for him. He has meaningful size and athletic advantages over Golden State's older, smaller front court of Al Horford and Draymond Green. Ironically, missing LeBron may not be the worst thing for the Lakers in this one. He's 1-6 in season openers as a Laker. The Pick: Lakers +2 Well, if you expect a big Dončić game, you almost have to pick the over. Even if a big Dončić game is a relatively slow one, the Lakers have a long way to go defensively, and the Warriors are exactly the sort of team you don't want to play on opening night in that regard because of how crisp their passing and movement are. Stopping them means having good habits and communication, which the Lakers likely don't yet have with all of their new faces. The Pick: Over 225.5 \nI'm not overthinking the props here. This is skinny Luka against a defense without a perimeter stopper. He's going to have the ball basically all night with James out. I can't promise the most efficient game out of Dončić, but I have to imagine he brute forces his way to 31 points. The Pick: Dončić Over 30.5 Points \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch NBA opening night: TV channel, stream Lakers-Warriors, OKC-Rockets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/08498b7e-4c20-46b5-8c17-60dee0b568c5/thumbnail/1200x675/a33f3aeaa675182eeb011fd3a35908b4/luka-doncic-lakers-usatsi.jpg"
      ],
      "datePublished": "2025-10-21T21:39:50.000Z",
      "dateModified": "2025-10-21T21:39:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thunder vs. Rockets odds, picks, best bets, predictions for 2025 NBA Opening Night from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/thunder-rockets-prediction-odds-2025-nba-opening-night-october-21-bets-kevin-durant-debut/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/da177103-6725-40ed-a35a-1a1f9866422b/thumbnail/1200x675/844bf01cd0c5da37b6c75717a10fc52f/shai-gilgeous-alexander-oklahoma-city-thunder.jpg",
    "tag": "Sports",
    "date": "2025-10-21T22:38:20.000Z",
    "description": "\n        The 2025-26 NBA season gets underway on Tuesday with the reigning champion Oklahoma City Thunder hosting the Houston Rockets. OKC will raise ",
    "body": "\n        The 2025-26 NBA season gets underway on Tuesday with the reigning champion Oklahoma City Thunder hosting the Houston Rockets. OKC will raise its championship banner on 2025 NBA Opening Night as the Thunder went a franchise-best 68-14 en route to the first title in team history last season. Meanwhile, Houston is coming off a 52-30 season and earned the No. 2 seed in the West before being eliminated in the first round of the playoffs. The team then added four-time scoring champ, Kevin Durant, in the offseason as he'll debut versus his former team. Small forward Jalen Williams (wrist) is out for OKC, while Dorian Finney-Smith (ankle) is out for Houston.Tipoff is at 7:30 p.m. ET from the Paycom Center in Oklahoma City, Okla. The Thunder won the season series, 3-2, last year. OKC is a 6.5-point favorite in the latest Rockets vs. Thunder odds, while the over/under for total points scored is 226.5. Before locking in any Thunder vs. Rockets picks, make sure to check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Rockets vs. Thunder 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Thunder vs. Rockets:Rockets vs. Thunder spreadOklahoma City -6.5 at DraftKings SportsbookRockets vs. Thunder   over/under226.5 pointsRockets vs. Thunder   money lineOklahoma City -245,   Houston +200Rockets vs. Thunder   picksSee picks at SportsLineRockets vs. Thunder   streamingFubo (Try for free)Why the Rockets can coverWhile OKC took three of five games last year outright, Houston went 3-2 against the spread (ATS) in those games, including covers in each of the last two. Then, Houston went out and made the biggest transaction of the offseason in trading for Durant, the NBA's eighth all-time leading scorer who averaged 26.6 points a year ago on 52.7% shooting from the field and 43% from beyond the arc. Durant solves the one weakness from Houston last year in outside shooting, as his trade didn't cost the Rockets to lose anyone that made up the core of their fourth-ranked defense.Houston led the NBA in rebounds last year and allowed the second-fewest made 3-pointers. Amen Thompson made All-Defensive First Team, despite just starting half of the season, and he is poised for a bigger role this year. Also returning is Alperen Sengun, who is coming off his first All-Star appearance and averaged 19.1 points, 10.3 rebounds and 4.9 assists in 2024-25. See which team to back at SportsLine.Why the Thunder can coverNot only did Oklahoma City have the best NBA record last season, but it also had the best spread record at 53-25-4. The team went 35-6 outright at home in the regular season, defeating Houston by nine-plus points both times it hosted the Rockets. OKC's point differential over the span of the regular plus postseason was the best in NBA history, and there was no attrition this offseason. Every Thunder player to play in the 2025 NBA Playoffs is under contract for this season.That includes MVP Shai Gilgeous-Alexander, who won the scoring title and whose 32.7 ppg is the most in NBA history for a player on a championship-winning team. Even Houston's staunch defense was no match for Gilgeous-Alexander as he dropped 51 on the Rockets last year, in addition to having a pair of 32-point, 8-rebound outings versus Houston. His offensive exploits, somewhat, overshadowed the fact that the Thunder led the NBA in defensive rating, steals, field goal percentage allowed and 3-point percentage allowed in 2024-25. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Rockets vs. Thunder picksSportsLine's model has simulated Thunder vs. Rockets and is leaning Under the total, projecting 220 combined points. The model also says one side of the spread hits in 70% of simulations in an A-rated pick. You can head to SportsLine to see the model's NBA picks. So who wins Rockets vs. Thunder, and which side of the spread hits in 70% of simulations in an A-rated pick? Visit SportsLine now to see which side of the Thunder vs. Rockets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thunder vs. Rockets odds, picks, best bets, predictions for 2025 NBA Opening Night from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/da177103-6725-40ed-a35a-1a1f9866422b/thumbnail/1200x675/844bf01cd0c5da37b6c75717a10fc52f/shai-gilgeous-alexander-oklahoma-city-thunder.jpg"
      ],
      "datePublished": "2025-10-21T22:38:20.000Z",
      "dateModified": "2025-10-21T22:38:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]