[
  {
    "title": "Why Sean Payton is giving up Broncos play-calling duties to Davis Webb - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-sean-payton-play-calling-davis-webb/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/6c03fb18-2428-41a6-8dc0-98ba13aa4f60/thumbnail/1200x675/5027932033fb7796209166ba93110cc0/bronocs.jpg",
    "tag": "Sports",
    "date": "2026-02-24T23:47:32.000Z",
    "description": "\n        The Denver Broncos are coming off one of the best seasons in franchise history. They went 14-3, surging past the Kansas City Chiefs to win th",
    "body": "\n        The Denver Broncos are coming off one of the best seasons in franchise history. They went 14-3, surging past the Kansas City Chiefs to win the AFC West and earn the No. 1 seed in the conference before falling a game short of a Super Bowl appearance. Still, coach Sean Payton is making a major change for 2026 in hopes of sparking the offense. Payton revealed Tuesday at the NFL Scouting Combine that he is giving up play-calling duties to new offensive coordinator Davis Webb. Payton called Webb \"extremely talented,\" and said this decision is best for the team. \"It was something I kind of knew during the year. He and I visited on a handful of occasions. He's extremely talented. With regards to play-calling, I think he'll be really good at it,\" Payton said. In 2025, Denver's offense ranked 14th in scoring (23.6 points per game) and 10th in total offense (342.6 yards per game), while second-year signal-caller Bo Nix completed 63.4% of his passes for 3,931 yards, 25 touchdowns and 11 interceptions. At face value, those numbers are pretty solid, but there was a reason why Denver fired offensive coordinator Joe Lombardi last month. The Broncos made a habit of putting pressure on themselves with slow starts. In fact, Denver registered 12 comeback wins this past season -- an NFL record.\nIt was evident all year. The Broncos played with their food in the season opener against the lowly Tennessee Titans in a 20-12 victory, and then lost their next two games. In Week 5, the Broncos had to score 18 unanswered points in the fourth quarter to defeat the Philadelphia Eagles, 21-17. Two weeks later, the Broncos came back from down 19-0 in the fourth quarter to defeat the New York Giants, 33-32. According to CBS Sports Research, those 33 points were the most scored in a game in NFL history by a team that was being shut out entering the fourth quarter. Broncos fans were left wondering why their offense waited until the final 15 minutes to start playing.Payton struggled to get Nix and his offense into a rhythm. It's easy to criticize the quarterback whenever the offense can't stay on the field, but some of Payton's third-down play calls were questionable, including in critical situations. Look no further than Denver's controversial decision to go for it on fourth-and-1 in the first half of the AFC Championship game instead of kicking a chip-shot field goal in an eventual three-point loss. Payton called a bootleg or play-action pass that was doomed from the start. He said afterwards that he regretted the play call more than the decision to go for it. The other facet of this decision is the promotion of Webb, who clearly has already earned the trust of Payton and Nix. \nWho is Davis Webb?The 31-year-old Webb spent the past three years as the Broncos' quarterbacks coach. He served as the team's pass game coordinator in 2025 as well. A former NFL quarterback himself, Webb was selected in the third round in 2017 by the Giants. However, he played in just two NFL games before turning his attention to coaching. Webb has experienced a meteoric rise in the coaching world. He received head-coaching interest from the Las Vegas Raiders, Buffalo Bills and Baltimore Ravens this offseason. Webb could have found a job as an offensive coordinator for another team, but the Broncos promoted him following Lombardi's firing and are now giving him play-calling duties.Longtime NFL backup quarterback Chase Daniel, who played for Payton in 2017 with the New Orleans Saints, had high praise for Webb.\n\"I can't fathom Sean Payton ever giving up play calling knowing how he operates,\" Daniel wrote. \"And that should tell you everything you need to know about Davis Webb.\"Payton said just as much. \"I would only do that [give up calling plays] if I felt like it would help our team,\" Payton said. \"I'll still be involved with what we do offensively, just like what we do defensively. But I do think [Webb] has a gift. He's real sharp. I'm glad he's on our staff. I'm looking forward to it.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Sean Payton is giving up Broncos play-calling duties to Davis Webb - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/6c03fb18-2428-41a6-8dc0-98ba13aa4f60/thumbnail/1200x675/5027932033fb7796209166ba93110cc0/bronocs.jpg"
      ],
      "datePublished": "2026-02-24T23:47:32.000Z",
      "dateModified": "2026-02-24T23:47:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will Inter's shock Champions League loss secure them the Serie A title? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/bodo-glimt-inter-title-ambitions-cristian-chivu-future/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/6bcd127b-8c8e-4ba0-947e-4763621ad636/thumbnail/1200x675/35aee30aaa367381ac329b460968fe7e/untitled-design-2026-02-25t002857-939.png",
    "tag": "Sports",
    "date": "2026-02-24T23:33:25.000Z",
    "description": "\n        Inter are out of the UEFA Champions League after losing 5-2 on aggregate against Bodo/Glimt in the playoffs ahead of the knockout stages. The",
    "body": "\n        Inter are out of the UEFA Champions League after losing 5-2 on aggregate against Bodo/Glimt in the playoffs ahead of the knockout stages. The Norwegian team are playing in the elite European tournament for the first time in their history, but the Nerazzurri's elimination isn't a big surprise as it might look today. Cristian Chivu's team lost 3-1 away in the first leg, but many thought the defeat had to do with the challenging pitch and the hostile Norwegian weather. That was not the case. Bodo/Glimt showed again on Tuesday that they are an organized team, and demonstrated why they have already won against Manchester City and Atletico Madrid earlier in the league phase. \nInter showed a different attitude this season in the European tournament, especially as compared to last season when the Nerazzurri reached the Champions League final under Simone Inzaghi, after winning one of the most incredible Champions League semifinals against Barcelona over two legs. Last season's disappointments left a mark on this squad, not just for the humiliating 5-0 defeat in the final against PSG, but also for the Serie A title lost to Napoli in the last weeks of the season. The mentality of the players seemed much more similar to the ones that started the 2023-24 season after losing another Champions League final to Manchester City. Inter decided to rebound by focusing on the domestic league, and this season is no different. The Nerazzurri are at the top of the Serie A standings with a ten-point margin on their rivals, and will face AC Milan next week at San Siro for a crucial Derby della Madonnina that might put an end to the title race before it is too late. \nIronically, the shocking elimination against Bodo/Glimt might give them an extra boost of motivation for the final stretch of the Serie A season, knowing that reaching another Champions League final looked more complicated this season. Inter, and the other Italian teams, are not at the level of the English teams or the top European giants for multiple reasons. It's not just talent but also the financial wherewithal to secure that talent. Unlike them, they are kind of forced to think about one tournament at a time, and the ineffectiveness of last season proved it even more. \nInter will also need some of their top stars back at the top of their game. Players such as Nicolo Barella or Marcus Thuram looked lost, while Lautaro Martinez is recovering from a muscular injury suffered in the first leg in Norway. His comeback, alongside that of Denzel Dumfries, will be vital for their Serie A title ambitions. Meanwhile, there were some rumors coming from Spain about a possible pre-agreement between Inter and current Atletico Madrid manager Diego Simeone for the summer of 2026. Inter president Beppe Marotta spoke to Sky Italy and denied the rumours as \"fake news,\" but Chivu knows perfectly this is a strange world and winning the Serie A title will be the only way to cool the rumors down.\nBodo/Glimt have written their names into the books of history and now await a clash in the Round of 16 against either Sporting CP or Manchester City. It has been a month to remember for Norway in Italy: from Johannes Høsflot Klæbo's extraordinary six gold medals at the Milano Cortina 2026 Winter Olympics to Bodo/Glimt becoming the first Norwegian side since 1987 to win a knockout tie in Europe's premier club competition. Norway will celebrate, and it's not over yet. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will Inter's shock Champions League loss secure them the Serie A title? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/6bcd127b-8c8e-4ba0-947e-4763621ad636/thumbnail/1200x675/35aee30aaa367381ac329b460968fe7e/untitled-design-2026-02-25t002857-939.png"
      ],
      "datePublished": "2026-02-24T23:33:25.000Z",
      "dateModified": "2026-02-24T23:33:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Could 49ers' Trent Williams hit free agency? Sides working through contract situation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/trent-williams-49ers-tackle-contract-free-agency/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/25eaa15f-fe79-4ab7-b985-d64dcd7c13ec/thumbnail/1200x675/972d7100c41797a4cbd3447a92971c36/gettyimages-2252910541-1.jpg",
    "tag": "Sports",
    "date": "2026-02-24T23:25:11.000Z",
    "description": "\n        An outstanding six-year run for left tackle Trent Williams with the San Francisco 49ers could be in danger of coming to an end. With Williams",
    "body": "\n        An outstanding six-year run for left tackle Trent Williams with the San Francisco 49ers could be in danger of coming to an end. With Williams set to carry a $39 million cap number in 2026, he and the 49ers are engaged in talks but are struggling to find a contractual solution to the sizable impact he will have on the team's payroll next season, according to ESPN. If the sides cannot find a middle ground, Williams could become a free agent this offseason.The 49ers want to keep their star tackle in town despite the reported stalemate, according to CBS Sports' Jonathan Jones. John Lynch, the team's general manager, effectively said as much Tuesday at the NFL Combine.\"In recent weeks, I've met with both Trent and with his agent, Vincent Taylor, and had really good, productive and substantive meetings,\" Lynch said. \"Here's what I know. Trent loves being a Niner. We love having Trent as a Niner. It's up to us to figure that out and to thread that needle.\"There's some unique circumstances in that we all know what Trent is as a player and how great of a player he's been. He's gonna be 38 years old, so there's some things that go into that. But I think we're all on the same page and feel very positively about where that's going.\"\n        \n            \n                Trent Williams landing spots: 49ers star would have plenty of suitors from Super Bowl contenders\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nA release before June 1 would save the 49ers $4.7 million in cap space. If they were to release him after that date, they would save $15.5 million this year -- though that would require them to split his dead cap hit across the 2026 and 2027 seasons.\nWilliams, a five-time All-Pro honoree and 12-time Pro Bowler, would be among the most highly sought-after players of the 2026 free agent class. Even entering his age-38 season, the veteran tackle remains a premier blind-side protector with potentially multiple more years left in the tank. He said last offseason that he would \"love to play until I'm 40.\"The 49ers and Williams agreed in September 2024 to a restructured three-year deal that made him the NFL's highest-paid offensive lineman that season.One of the few accolades that Williams has left to add to his résumé is Super Bowl champion. Remaining with the 49ers should allow him to achieve that goal, but his significant cap hit could also limit San Francisco's ability to surround him with enough talent to contend in a loaded NFC West. The 49ers secured a wild-card berth in 2025 despite finishing third in the division at 12-5. With two Super Bowl appearances and a pair of conference championship game berths since 2019, the 49ers are knocking on the door of a title. Losing one of the NFL's best tackles without getting anything in return would be a significant blow in that quest.\nWilliams joined the 49ers in 2020 via a trade with the Washington Commanders. The former No. 4 overall pick spent the first decade of his career in Washington and was a perennial Pro Bowler. He took his game to the next level upon arriving on the West Coast, securing three consecutive first-team All-Pro honors and a second-team selection in 2025.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Could 49ers' Trent Williams hit free agency? Sides working through contract situation - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/25eaa15f-fe79-4ab7-b985-d64dcd7c13ec/thumbnail/1200x675/972d7100c41797a4cbd3447a92971c36/gettyimages-2252910541-1.jpg"
      ],
      "datePublished": "2026-02-24T23:25:11.000Z",
      "dateModified": "2026-02-24T23:25:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Trent Williams could turn NFL free agency upside down, possible landing spots if released - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/trent-williams-landing-spots-49ers-star/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2021/03/10/72016284-278e-4206-978c-1db4fc4bf273/thumbnail/1200x675/3404d47be919cd496067fc928abb2b47/usatsi-trent-williams.jpg",
    "tag": "Sports",
    "date": "2026-02-24T23:23:28.000Z",
    "description": "\n        The week of the NFL combine is when news starts to pick up again. It proves the NFL has no real offseason, and the closest thing to it is the",
    "body": "\n        The week of the NFL combine is when news starts to pick up again. It proves the NFL has no real offseason, and the closest thing to it is the two weeks between the Super Bowl and combine week.One of the biggest pieces of news was Tuesday's report from ESPN's Adam Schefter that Trent Williams and the 49ers are attempting to resolve their contract differences. Williams is set to count nearly $39 million against the cap in 2026, the 16th-highest figure in the NFL and the fourth-highest among non-quarterbacks, only behind Chiefs defensive lineman Chris Jones, 49ers defensive end Nick Bosa and Vikings wide receiver Justin Jefferson.The 49ers want Williams to return, and the player's representation and the team remain in contact. GM John Lynch said Tuesday, \"I think we're on the right track.\" Still, it's no guarantee.Williams is 37 and entering the final year of a three-year, $82.6 million deal he renegotiated ahead of the 2024 season. He remains one of the NFL's premier offensive linemen, making his 12th Pro Bowl and fifth All-Pro team last year. Pro Football Focus graded him as the No. 3 tackle in the NFL. He is integral to everything the 49ers do.\nIf he were to leave, he'd have ample suitors eagerly awaiting. Williams would have his pick, too. He'd be a free agent, and at this stage in his career, all that's missing among his many accolades is a Super Bowl ring. With that in mind, here are five spots he could land if he does indeed leave San Francisco.\n                            \n    \n                                                \n                    \n    Green Bay PackersThe Packers are set to let starting left Rasheed Walker leave in free agency. A former seventh-round pick, Walker has risen to become a solid if unspectacular left tackle, and he has not missed a game the last three seasons. He's in for a significant payday in a few weeks' time.Williams would represent a tremendous win-now upgrade for a win-now operation. The Packers have been among the league's youngest teams for multiple years, and while that core has emerged to form a contender, it's still missing a few true stars. Williams would be one. Last year, Walker was PFF's No. 53 tackle, and he committed nine penalties; Williams, again, was the No. 3 tackle, and he committed just four penalties.\n\n                            \n    \n                                                \n                    \n    Chicago BearsGoing from one NFC North team to another, the Bears have already shown a willingness to take big swings on their offensive line. Last offseason -- their first under Ben Johnson -- Chicago traded for guards Joe Thuney and Jonah Jackson and signed center Drew Dalman. Right tackle Darnell Wright has continued to improve.That leaves left tackle, where Braxton Jones entered the season as the starter but got hurt and was then benched and appeared in only six games. Ozzy Trapilo ruptured his patellar tendon in the playoffs and will likely miss most of the year. Johnson showed last year he isn't afraid to make bold moves to upgrade Caleb Williams' surroundings.\n                            \n    \n                                                \n                    \n    Dallas CowboysYes, the Cowboys being on this list is almost a given considering their propensity for being in the news, and, yes, they have massive financial hurdles to overcome. But with plenty of restructuring opportunities ahead -- most notably Dak Prescott and CeeDee Lamb -- they will work their way out of the financial hole they're currently in.\nNow for the fit. Left tackle Tyler Guyton, a 2024 first-round pick, struggled mightily in 2025 and has not inspired a ton of confidence through two seasons. Right tackle Terence Steele is a cut candidate. Add in that Williams is from Texas and, again, that the Cowboys are the Cowboys, and Dallas has to at least be on the radar, no matter how unlikely it may seem.\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersThe Steelers show no signs of entering a rebuild, even though Mike Tomlin resigned this offseason and the team's starting quarterback if the season started today would be Mason Rudolph or Will Howard. Should Aaron Rodgers return and reunite with Mike McCarthy, Pittsburgh would again look like a reasonably high-floor, low-ceiling outfit.Williams could elevate that ceiling. He's still a very good mover in space, something that would serve Pittsburgh well given Rodgers' propensity to get the ball out quickly to running backs and tight ends. Pittsburgh's current left tackle, 2023 first-round pick Broderick Jones, missed six games last year and has been inconsistent when on the field.\n\n                            \n    \n                                                \n                    \n    Wild card: New England Patriots\"He's 22 years old. He's our left tackle,\" Mike Vrabel said of Will Campbell in the aftermath of the rookie's difficult postseason. \"He'll get better and get stronger. Moments where he played well ... there's plays he'd like to have back, but we're not moving Will to center or guard or tight end or anywhere else.\"Indeed, Campbell's struggles were on full display, especially in the Super Bowl. But he was also playing at less than 100% after midseason knee surgery. The No. 4 overall pick less than a year ago, Campbell played at a very solid level prior to the injury. One bad postseason -- as a rookie coming off an injury, no less -- doesn't mean he's doomed.On the other hand, Vrabel's comments came before a player like Williams was potentially available. New England has plenty to do to ensure it's not a one-and-done Super Bowl contender, and upgrading other parts of the offense is high up on that list. But New England has the budget to go big-game hunting, and Williams is a massive talent at a crucial position.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Trent Williams could turn NFL free agency upside down, possible landing spots if released - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2021/03/10/72016284-278e-4206-978c-1db4fc4bf273/thumbnail/1200x675/3404d47be919cd496067fc928abb2b47/usatsi-trent-williams.jpg"
      ],
      "datePublished": "2026-02-24T23:23:28.000Z",
      "dateModified": "2026-02-24T23:23:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Virginia QB Chandler Morris sues NCAA for seventh year of eligibility - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/chandler-morris-lawsuit-ncaa-virginia-qb-seventh-year/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/3cc34965-293d-4541-90f7-941eadd83180/thumbnail/1200x675/3f7417135191e9e75ba0fc9c24ff234c/chandler-morris.jpg",
    "tag": "Sports",
    "date": "2026-02-24T22:11:02.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Virginia quarterback Chandler Morris filed a lawsu",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Virginia quarterback Chandler Morris filed a lawsuit against the NCAA in search of a seventh year of eligibility, his agent tells CBS Sports' Chris Hummer. Morris filed the suit in a Virginia state court after the NCAA denied his request for an eligibility waiver in January.The basis of Morris' waiver request was that he sustained injuries at TCU in 2022 and 2023, and he argued that he should have qualified for medical redshirts in both campaigns. Morris played four games in 2022 and seven games in 2023 after utilizing a redshirt in 2021. His 2020 season at Oklahoma did not count toward his eligibility clock because of a one-time waiver granted to all athletes due to the COVID-19 pandemic.Morris stayed healthy each of the last two seasons and played full campaigns at North Texas and Virginia. He led the American conference in passing yards (3,774) and touchdowns (31) in 2024 and transitioned nicely to the ACC, where he guided Virginia to the first 11-win season in program history and a berth in the conference championship game.If the court grants Morris relief against the NCAA's eligibility rules, he could return to Virginia in search of College Football Playoff contention. The Cavaliers climbed as high as No. 14 in last season's CFP Top 25 rankings and would have secured an automatic berth into the bracket had they defeated Duke in the ACC title game.\nMorris's suit against the NCAA is the latest example of an athlete attempting to use the court system to gain additional eligibility. These cases have largely defined the early portion of the college football offseason, and athletes found mixed results.A Mississippi judge granted Ole Miss quarterback Trinidad Chambliss a temporary injunction that will allow him to spend another season with the Rebels on the heels of a stellar debut campaign as one of the SEC's top signal-callers. Chambliss made a similar petition to Morris, stating that he was physically unable to compete in 2022 due to a respiratory condition.\nTennessee quarterback Joey Aguilar, meanwhile, was denied injunctive relief in a ruling that served as a major victory for the NCAA. Aguilar's case was different from the others, as he argued that his years spent in junior college should not count against his NCAA eligibility clock. That was the argument former Vanderbilt quarterback Diego Pavia used to gain an additional year in a landmark case last offseason.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Virginia QB Chandler Morris sues NCAA for seventh year of eligibility - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/3cc34965-293d-4541-90f7-941eadd83180/thumbnail/1200x675/3f7417135191e9e75ba0fc9c24ff234c/chandler-morris.jpg"
      ],
      "datePublished": "2026-02-24T22:11:02.000Z",
      "dateModified": "2026-02-24T22:11:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons place franchise tag on star tight end Kyle Pitts - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-kyle-pitts-franchise-tag/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/9801a114-2970-47a5-bde2-febe153e792e/thumbnail/1200x675/c4d3f083d6bae273b31a5ed14cc2aa69/pitts.jpg",
    "tag": "Sports",
    "date": "2026-02-24T21:27:21.000Z",
    "description": "\n        The Atlanta Falcons will not allow former No. 4 overall pick Kyle Pitts to hit free agency, placing the franchise tag on their star tight end",
    "body": "\n        The Atlanta Falcons will not allow former No. 4 overall pick Kyle Pitts to hit free agency, placing the franchise tag on their star tight end.  Atlanta made Pitts the first NFL player to receive the tag this offseason shortly after new Falcons coach Kevin Stefanski was asked about the former Pro Bowler during the NFL Combine. While he didn't specifically discuss Pitts, Stefanski stressed how much he values his position. \"I love the position. I coached it. It was my first position to coach on the offensive staff, was tight ends there with the Vikings under coach (Mike) Zimmer,\" Stefanski told the assembled media. \"I love the position because of the versatility that it provides an offense. And you've seen it around the league. This is nothing new or earth-shattering, but tight ends that can line up all over make life hard on a defense. Whether you can line them up outside, in the backfield, in line, you name it, we love versatility at that position.\"Obviously, Kyle's somebody that we'll talk at length more about when it comes to those types of roster conversations, but the position itself is something that we feel really very strongly about.\"\nIt was expected Atlanta would place the franchise tag on Pitts as it works towards a new deal. The Falcons have until July 15 to sign Pitts to a contract. If he were to play on the tag in 2026, Pitts would make a fully-guaranteed $16,007,000, according to Spotrac. The Falcons are expected to have $26,462,519 in cap space, which ranks No. 15 in the NFL per Over The Cap. Jones also mentioned the possibility of Pitts being tagged and traded if there was a suitor that offered enticing-enough compensation. Atlanta's first selection in this upcoming draft comes at No. 48 overall.\nPitts was considered to be one of the top tight ends set to hit free agency, headlining a list that includes Travis Kelce, David Njoku, Isaiah Likely, Dallas Goedert, Cade Otton and Chig Okonkwo. Pitts is coming off a career year in which he caught 88 passes for 928 yards and five touchdowns. He delivered what was the best outing of his NFL career during a Week 15 prime-time victory against the Tampa Bay Buccaneers, in which he caught 11 of 12 targets from Kirk Cousins for 166 yards and three touchdowns. The Florida product made the Pro Bowl in 2021 after becoming the first rookie tight end to cross 1,000 yards receiving since Mike Ditka in 1961, and was named a Second Team All-Pro this past season. In 78 career games played, Pitts has caught 284 passes for 3,579 yards and 15 touchdowns. \nPitts was recently the second reported player to be in line to receive the franchise tag, joining Dallas Cowboys wide receiver George Pickens. Running back Breece Hall of the New York Jets is another player to watch with intentions to use a franchise or transition tag if a deal cannot be reached by March 3. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons place franchise tag on star tight end Kyle Pitts - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/9801a114-2970-47a5-bde2-febe153e792e/thumbnail/1200x675/c4d3f083d6bae273b31a5ed14cc2aa69/pitts.jpg"
      ],
      "datePublished": "2026-02-24T21:27:21.000Z",
      "dateModified": "2026-02-24T21:27:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Cognizant Classic predictions, odds, picks as Florida Swing gets underway - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/cognizant-classic-2026-predictions-odds-picks-field-rankings-pga-tour-preview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/71d91ff8-68b2-449f-a180-262c96979cfa/thumbnail/1200x675/d4f501a2466f5165690cf4b34621a5f4/brooks-koepka-phoenix-g.jpg",
    "tag": "Sports",
    "date": "2026-02-24T22:47:21.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    The PGA Tour kicks off its Florida Swing at the Bear Trap\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 24, 2026\n                            \n                    at\n    5:39 pm ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Through six events of the 2026 PGA Tour season, storylines are bountiful. A multi-time winner, Chris Gotterup has jumped into a new echelon of golf. World No. 1 Scottie Scheffler has kept up his torrid pace, while Justin Rose has continued to defy conventional wisdom at age 45. Collin Morikawa broke his winless drought, and Jacob Bridgeman became the year's initial first-time winner at the Genesis Invitational by holding off Rory McIlroy. But that was the West Coast Swing, and now, the PGA Tour transitions to Florida with the 2026 Cognizant Classic representing the start of four weeks of golf in the Sunshine State. While the names that were supposed to headline the field -- Bridgeman, Ben Griffin and Adam Scott -- bowed out earlier in the week, opportunity still comes knocking at PGA National.A life-changing moment could be in a young player's future as a wide-open field battles the Bear Trap, which has lost some of its teeth in recent times. With tournament officials choosing to overseed the golf course to provide lush fairways and green scenery, the bite that the venue was once known for has been taken away. Last season, for example, Jake Knapp fired a 59 on the par 71 while Joe Highsmith won the tournament at 19 under after making the cut on the number. The year prior, Austin Eckroat won on a Monday finish at 17 under, marking the first time since the tournament moved to PGA National that a winner eclipsed 15 under.\nThis season, good scores should be available once again as Shane Lowry leads a group of veteran players like Keith Mitchell and Brooks Koepka into the field. Meanwhile, young players like Rasmus Højgaard and his twin brother Nicolai look for their first wins on the PGA Tour alongside Michael Thorbjornsen, Rasmus Neergaard-Petersen and Haotong Li, who are also in the mix.2026 Cognizant Classic scheduleDates: Feb. 26 - Mar. 1Location: PGA National Resort (The Champion Course) — Palm Beach Gardens, FloridaPar: 71 | Yardage: 7,223 | Architect: Tom FazioPurse: $9,600,0002026 Cognizant Classic field, oddsOdds via FanDuel Sportsbook\nShane Lowry (14-1): Despite contending regularly on the PGA Tour, Lowry is without an individual victory on U.S. soil since the WGC Bridgestone Invitational in 2015 -- a tournament that no longer exists ...  heck, an event series that no longer exists! He had a great opportunity to get off the schneid in 2022 when he fell just short to Sepp Straka at this tournament, which kicked off a run of four straight top 11 finishes at PGA National. The Irishman has tasted contention in recent weeks, and he lost in Dubai last month due to untimely mistakes on the 72nd hole.Ryan Gerard (16-1)Nicolai Højgaard (22-1)Rasmus Højgaard (22-1)Michael Thorbjornsen (22-1): After nearly beating everyone at the WM Phoenix Open, Thorbjornsen got beaten by everyone at the AT&T Pebble Beach Pro-Am. The young New Englander grabbed the solo lead late at TPC Scottsdale thanks to an eagle, but he then learned the hard way how difficult it is to close out a tournament on the PGA Tour and instead settled for a podium finish. He acquitted himself nicely at PGA National in his debut last season, where he was unable to find his groove on the greens.Keith Mitchell (27-1)Brooks Koepka (30-1): The Florida kid gets to play in his backyard once again. Nearly a winner at this event the year Mitchell holed a putt on the 72nd hole to hold off both Koepka and Rickie Fowler, Koepka returns this week to make his first start in the tournament since 2022, when he finished T16. The five-time major champion's return to the PGA Tour produced a couple of lackluster starts, but the bones of the operation were solid. Koepka kept up with his peers from tee to green only to be undone by his woeful performance on the greens. With the switch to Bermuda grass out in front of him and the rest of the PGA Tour, he should benefit.Christiaan Bezuidenhout (30-1)Rasmus Neergaard-Petersen (30-1): American golf fans, get used to hearing this name as the Rasmanian Devil continues to get his feet underneath him in his first PGA Tour season. The young Dane has only played twice on the PGA Tour in 2026 and made both cuts, but he should be frisky in a field of this caliber. Neergaard-Petersen won the Australian Open at Royal Melbourne to end 2025 and has continued to strike the ball beautifully in 2026.Aaron Rai (33-1): Was a surprise addition to the proceedings at the Genesis Invitational as Rai got off to a rocky start to his 2026 at venues that should fit his skillset (Waialae Country Club and Pebble Beach). Among the leaders early in the week, the Englishman unfortunately backtracked on Sunday at Riviera outside the top 25, but he showed enough promise to be feeling good heading into this week.2026 Cognizant Classic picks\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Ryan Gerard\n                    \n            \n            \n        \nWinner (16-1): He was the breakout candidate in the preseason predictions, and while Gotterup and Bridgeman may have the inside track on that award early, Gerard should give them a good push across the Florida events. Despite the lacking results to this point, the 26-year-old continued to strike the cover off the golf ball at Pebble Beach and Riviera, only to be undone on the greens. Local to these parts, Gerard will find his touch with the putter at PGA National where he has two finishes inside the top 25 in two appearances.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                HaoTong Li\n                    \n            \n            \n        \nContender (45-1): One of the easier guys to root for on the PGA Tour, Li looked super comfortable in the early stretch of the season. He claimed a top 10 finish at the American Express before a T11 at the Farmers Insurance Open. Unfortunately, he missed the cut at the WM Phoenix Open to end his chances at qualifying for the next two signature events, but his game remains in a solid spot. Li is driving it great and has a winning pedigree with four DP World Tour wins to his credit.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Michael Brennan\n                    \n            \n            \n        \nSleeper (70-1): For as easy as the Bank of Utah Championship victory looked, Brennan's rookie season on the PGA Tour has been met with some speed bumps. A missed cut at the Sony Open was followed by being disqualified from the Farmers Insurance Open for using improper green-reading material. Still, he turned the corner at TPC Scottsdale, where his play was much better than what the result indicated. His speed has speed, and he can take it deep on easy setups. Who will win the 2026 Cognizant Classic, and which longshots will stun the golfing world? Visit SportsLine now to see the projected leaderboard, all from the model that's nailed 16 golf majors heading into the weekend, and find out. \n            \n\n\n        \n    \n                                            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Cognizant Classic predictions, odds, picks as Florida Swing gets underway - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/71d91ff8-68b2-449f-a180-262c96979cfa/thumbnail/1200x675/d4f501a2466f5165690cf4b34621a5f4/brooks-koepka-phoenix-g.jpg"
      ],
      "datePublished": "2026-02-24T22:47:21.000Z",
      "dateModified": "2026-02-24T22:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount+ and CBS Sports lock up Concacaf women's rights - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/paramount-cbs-sports-concacaf-womens-soccer-rights-2029-2030/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/da1148c0-a35d-4689-abc6-f83b9aa67d16/thumbnail/1200x675/c029c8d8c5afdefcda05c2dedadaee63/untitled-design-2026-02-24t213408-813.png",
    "tag": "Sports",
    "date": "2026-02-24T20:37:24.000Z",
    "description": "\n        CBS Sports continues to bolster its lineup of women's soccer broadcast rights. Paramount+ is the official home of Concacaf Women's competitio",
    "body": "\n        CBS Sports continues to bolster its lineup of women's soccer broadcast rights. Paramount+ is the official home of Concacaf Women's competitions through 2030. All matches across Concacaf W Gold Cup, Concacaf W Nations League, Concacaf W Champions Cup, and Concacaf W Championship will stream live on Paramount+ beginning Feb. 27.In a multi-year agreement with Concacaf, CBS Sports will be the exclusive English-language U.S. rights holder for all Concacaf Women's competitions through the 2029-2030 season. The partnership will feature over 250 matches across four tournaments with club and national team fixtures. All matches will stream live on Paramount+ with select matches across CBS Sports Network and CBS Sports Golazo Network.The addition of Concacaf matches adds to CBS Sports' already strong women's soccer portfolio. CBS Sports is the official home of the NWSL Championship and select NWSL regular season matches through 2027, and the UEFA Women's Champions League through 2030. Women's soccer fans recently had access to the 2025 UEFA Nations League semifinal matches and the Championship final on the CBS Sports Golazo Network.\"We are thrilled to extend our partnership with CBS Sports, which will continue to serve as the English-language home of Concacaf Women's Football in the United States,\" said Concacaf General Secretary Philippe Moggio. \n\"With the launch of a revamped Concacaf W ecosystem in 2024—now featuring three major centralized senior national team competitions as well as an annual elite club tournament—our Member Associations and their teams have unprecedented opportunities to compete at the highest level, while their fans can closely follow and enjoy every step of the journey,\" concluded Moggio.CBS Sports will deliver comprehensive highlights and editorial coverage across all competitions on CBS Sports Golazo Network, CBS Sports Network, and CBSSports.com. Studio coverage details will be announced at a later date.Concacaf W tournaments on CBS SportsConcacaf W Gold Cup 2029: The second edition of the Confederation's premier senior women's national team competition, crowning the regional champion, is scheduled for summer 2029. CBS Sports aired the inaugural tournament, and the tournament winners, the USWNT, celebrated a thrilling 1-0 win over Brazil on Paramount+.\nConcacaf W Nations League 2028: The inaugural edition will feature a Group Stage in February and April, followed by the Finals in November.Concacaf W Champions Cup (2026-27 through 2029-2030): The annual club competition crowns a regional champion and determines qualification for the FIFA Women's Champions Cup in 2027 and 2029, as well as the inaugural FIFA Women's Club World Cup in 2028. 2026 Concacaf W Championship: During the eight-team competition scheduled for November and December 2026. The championship tournament will determine which nations officially qualify for the 2027 FIFA Women's World Cup and the 2028 Summer Olympics.\n2026 Concacaf W Qualifiers: Qualifiers will be played in November 2025 and February–April 2026, with 29 nations divided into six groups. The six group winners will advance and join the United States and Canada (the region's highest-ranked teams) in the Concacaf W Championship. Coverage kicks off Friday, February 27, with Concacaf W Championship Qualifiers matches streaming live on Paramount+.Concacaf W Championship Qualifying ScheduleTake a look at the upcoming schedule through March on Paramount+:(All Times Eastern)Friday, Feb. 277 PMPuerto Rico vs. St. Vincent & the GrenadinesParamount+Friday, Feb. 277 PMGuyana vs. DominicaParamount+Saturday, Feb. 286 PMDominican Republic vs. BelizeParamount+Saturday, Feb. 288 PMGuatemala vs. GrenadaParamount+ & CBS Sports Golazo NetworkSunday, March 13 PMCuba vs. CuraçaoParamount+ & CBS Sports Golazo NetworkSunday, March 16:30 PMEl Salvador vs. BarbadosParamount+ & CBS Sports Golazo NetworkMonday, March 24 PMSt. Lucia vs. MexicoParamount+Monday, March 29 PMNicaragua vs. JamaicaParamount+ & CBS Sports Golazo NetworkTuesday, March 35 PMSuriname vs. HaitiParamount+Tuesday, March 36 PMBermuda vs. Costa RicaParamount+Wednesday, March 46 PMSt. Kitts & Nevis vs. PanamaParamount+Wednesday, March 48 PMHonduras vs. Trinidad & TobagoParamount+ & CBS Sports Golazo NetworkThursday, March 52:30 PMUS Virgin Islands vs. Puerto RicoParamount+ & CBS Sports Golazo NetworkThursday, March 54 PMAntigua & Barbuda vs. GuyanaParamount+Friday, March 62 PMAnguilla vs. Dominican RepublicParamount+Friday, March 67 PMCayman Islands vs. GuatemalaParamount+Saturday, March 77 PMAruba vs. CubaParamount+\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount+ and CBS Sports lock up Concacaf women's rights - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/da1148c0-a35d-4689-abc6-f83b9aa67d16/thumbnail/1200x675/c029c8d8c5afdefcda05c2dedadaee63/untitled-design-2026-02-24t213408-813.png"
      ],
      "datePublished": "2026-02-24T20:37:24.000Z",
      "dateModified": "2026-02-24T20:37:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to run your 2026 March Madness pool: Play for prizes, create your own NCAA Tournament game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/how-to-run-your-2026-march-madness-pool-play-for-prizes-create-your-own-ncaa-tournament-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/64ffea50-df77-484d-b99a-8f3dae5b275f/thumbnail/1200x675/2c4c0bcd9c367f37162268f9d73ef6fe/flory-bidunga-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-24T22:54:10.000Z",
    "description": "\n        March is rapidly approaching with Selection Sunday coming on March 15, so it's already time to start thinking about how to make your 2026 NCA",
    "body": "\n        March is rapidly approaching with Selection Sunday coming on March 15, so it's already time to start thinking about how to make your 2026 NCAA Tournament picks. Last year, the NCAA Tournament bracket went relatively chalk, but we're just a few years removed from jaw-dropping upsets, so anything can happen as the 2026 NCAA Tournament bracket unfolds.Michigan, Duke, Arizona and Iowa State are currently trending towards No. 1 overall seeds on the men's side. Programs like UConn, Houston and Florida, however, are all lurking after recent runs deep into the NCAA brackets. March Madness pool picks aren't complete without factoring in the women's side, where UConn, Texas, UCLA and USC are looking strong. With the action so close, now is the time to set up your 2026 Men's March Madness pools and 2026 Women's March Madness pools. If you're looking for a NCAA Tournament bracket game home, CBS Sports is the perfect place. You can play Bracket Games free on the CBS Sports App in pools with your friends and join free Men's and Women's Bracket Challenges to potentially win big prizes.* Get started right here.How to create a 2026 NCAA Tournament pool with friends and familyRun your own free 2026 March Madness pool on CBSSports.com and the CBS Sports app and invite all of your friends, family, and co-workers to play against you during this year's tournament. \nTo start a bracket pool for Men's March Madness, go to the Create Men's Bracket Pool page, name your group and choose if you want a locked pool where you control the invites or an open pool that everybody can share. After that, just confirm your rules and then you can copy and share your personal pool link with friends or have CBS Sports send them emails.For a Women's March Madness pool, you can follow the exact same process but start at the Create Women's Bracket Pool page in order to start your pool for the Women's NCAA Tournament.How to play 2026 March Madness Brackets for prizesThere are CBS Sports NCAA Bracket Challenges for the men's and women's tournaments and a trip to each 2027 Final Four on the line in both challenges. It's easy to compete for those epic trips. \nFor the Men's Challenge, simply click this link, click the \"Join Now\" button and enter.* Fill out your men's bracket after it is revealed on Sunday, March 15, and the winner of the trip to the 2027 Final Four will be chosen from among the entrants. If you've already created brackets in pools with friends, you can quickly enter the Challenge by importing an already-created bracket.You can also enter the Women's CBS Sports Bracket Challenge later that night after the Selection Show at 8 p.m. ET. Importing your brackets from your women's pools is a convenient option for filling your Women's Challenge brackets as well. The men's bracket deadline is March 19 when first round action tips off, while the women's bracket deadline is March 20. To be eligible, follow the steps above to join the Men's Challenge and then join the Women's Challenge here before each tournament begins.\n2026 NCAA Tournament Men's teams to watchNow that you know where to play 2026 NCAA Men's Bracket Games, here are some teams to watch as the Tournament approaches: Kansas Jayhawks: The Jayhawks might be one of the more volatile teams in the NCAA Tournament. Freshman Darryn Peterson can take over any game, but staying in those games has been a challenge as he's dealt with a series of minor injuries and cramping issues. The Jayhawks entered the weekend having won nine of their last 10, but were stunned at home by Cincinnati, a double-digit underdog, on Saturday. That showed their downside, but recent wins against Iowa State, BYU, Arizona and Texas Tech also prove that they'll be a dangerous team in March.Duke Blue Devils: Jon Scheyer's squad made the Final Four last season, but he had to replace his entire starting five after they all left for the NBA. Enter superstar freshman Cameron Boozer, who is averaging 22.8 points, 10.0 rebounds and 3.9 assists per game. Duke is off to a 24-2 start and in the hunt for a No. 1 seed during March Madness with one of the most talented rosters in college basketball. Join the CBS Sports 2026 NCAA Men's Bracket Game here.\n2026 NCAA Tournament Women's teams to watchNow that you know where to play 2026 NCAA Women's Bracket Games, here are some teams to watch as the 2026 NCAA Tournament approaches: UCLA Bruins: Cori Chase's squad made the Final Four for the first time in program history last season and are cementing their status as a contender in 2026. The Bruins are off to a 26-1 start with a perfect 16-0 mark in the Big Ten and Lauren Betts continues to dominate after an All-American season in 2024-25. The center is averaging 16.7 points, 8.4 rebounds, 3.0 assists and 2.3 blocks per game and leads an experienced UCLA roster whose top six scorers are all seniors.Vanderbilt Commodores: Vanderbilt has used NIL to reshape its athletic department as has found success in football and men's basketball. However, the women's squad might be the university's best shot at a national championship this season, as the Commodores are 24-3 overall and 10-3 in the SEC. Sophomore guard Mikayla Blakes is averaging 25.9 points per game this season and Vanderbilt checks in at No. 5 in the latest AP poll. Join the 2026 Women's Bracket Game here.\nHow to enter 2026 NCAA Men's & Women's Bracket GamesReady to set up your 2026 NCAA Tournament pools? Get started from the bracket lobby to play 2026 NCAA Men's and Women's Bracket Games with friends and for a chance to win trips to the 2027 Final Four.*No purchase necessary. See rules for details.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to run your 2026 March Madness pool: Play for prizes, create your own NCAA Tournament game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/64ffea50-df77-484d-b99a-8f3dae5b275f/thumbnail/1200x675/2c4c0bcd9c367f37162268f9d73ef6fe/flory-bidunga-imagn.jpg"
      ],
      "datePublished": "2026-02-24T22:54:10.000Z",
      "dateModified": "2026-02-24T22:54:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA MVP Rankings: Victor Wembanyama jumps into top three, Cade Cunningham could win by default - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-mvp-rankings-victor-wembanyama-cade-cunningham-default/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/46cb54b4-e992-4fee-b54d-1ac7f1f43114/thumbnail/1200x675/8a4fb1654d95018bedc3c597fed25964/wemby-getty-5.png",
    "tag": "Sports",
    "date": "2026-02-24T19:40:20.000Z",
    "description": "\n        As Tom Haberstroh recently noted, Cade Cunningham and Shai Gilgeous-Alexander are the only current NBA MVP candidates on track to make the 65",
    "body": "\n        As Tom Haberstroh recently noted, Cade Cunningham and Shai Gilgeous-Alexander are the only current NBA MVP candidates on track to make the 65-game mark, which serves as the minimum threshold for eligibility. SGA is cutting it close. He's missed OKC's last seven games and nine overall, and is expected to miss at least three more. That would put him at 12 games missed, with 17 being the cutoff. Cunningham has only missed six. This may make him the favorite by default. Meanwhile, Nikola Jokić can only miss one more game before he becomes ineligible. Victor Wembanyama can only miss four more. Luka Dončić can miss five more, but for me, he's not even a top-five candidate at present (I know there will be some pushback on this, and I get it, we're splitting hairs here on a bunch of unbelievable players). At any rate, as long as you're mathematically eligible to win the award, you're eligible to make our rankings. So here they are, the top five MVP candidates as I see them standing (not necessarily how they rank in terms of winning odds) entering play on Tuesday, Feb. 24. 1. Shai Gilgeous-Alexander, ThunderMVP odds (via FanDuel): -145SGA was expected to return to the lineup following the All-Star break but that hasn't happened. He's missed nine games so far and is expected to miss at least three more before he returns from this abdominal strain -- which includes head-to-heads with his two closest MVP competitors in Nikola Jokić and Cade Cunningham. Bummer for us. Those games could've had an honest impact on voting if they swung one way considerably. \nAt any rate, when SGA returns he'll be at 12 games missed, at least. That would mean he can miss five more the rest of the season to make the 65-game threshold. Doable, of course. But it does put him in some danger of falling out with one more even marginally extended absence, particularly as Mark Daigneault has said he's not going to prioritize MVP eligibility over SGA's health and OKC's championship goal, as he shouldn't. All of that said, SGA remains the favorite to win his second straight MVP until further notice. If he gets it, he will enter rare air as just the 16th player in history to win multiple MVPs. His case is pretty iron clad. He was the MVP last season and he's been even better this season. He's shooting better from every spot on the floor, particularly from 3. He's the best mid-range shooter in the league. His FG%, 2-PT%, 3PT%, eFG% and TS% are all career highs. His 135.2 points per 100 possessions is seven points better than last season (per Cleaning the Glass), when he led the league in scoring. \nThis year he's second to Luka Dončić by exactly one point per game, but the efficiency isn't even close. The Thunder outscore opponents by 11.2 PPG when he's on the floor, and they're 9.3 points per 100 possessions worse when he's off the floor, per CTG. 2. Cade Cunningham, PistonsMVP odds: +600Cunningham was all but erased from Monday's marquee matchup against Spurs. From point to paint, the combination of Stephon Castle and Victor Wembanyama straight-jacketed him into a 5-for-26 dud that left Detroit without any source of offense whatsoever. And that's the MVP case right there: The Pistons have no repeatable way to put the ball in the basket other than Cunningham. When he goes to the bench, the offense goes from top-five to bottom-five, per CTG. \nEven with that defense (which he's also a big part of), and even in the Eastern Conference, the Pistons would be a play-in team, at best, without Cunningham. But with him, they are, and have been, going head to head with OKC for the best record in the league. Cunningham, Luka Doncic and Nikola Jokic are the only players averaging at least 25 points and eight assists this season (Cunningham leads the league in points generated via assists, per PBP Stats). To me, the case for Cunningham over Doncic is clear. Cunningham plays both sides. The Pistons are a better team. If it's even an honest debate, that breaks the tie. It's a much tougher call against SGA, Jokic and Victor Wembanyama, all of whom are decidedly more efficient shooters and overall scorers that Cade, and they are leading arguably better teams. All three of those guys are better players than Cade, bottom line, but Cade has closed the gap in that regard to a point that circumstance can, and should, put him right in line with their MVP narratives. \nThree years ago, Detroit was the worst team in the league with just 17 wins. Two years they dropped to 14 and endured an NBA record 28-game losing streak. Then Cunningham leveled up. Last season, Detroit became the first team in history to triple its win total from the previous non-shortened season, and this year they have been the class of their conference basically from the jump. That is all disproportionately due to Cunningham, who on top of that has only missed six games this season. If the best ability is availability, Cunningham has been in the nightly grind more than any of these other guys, and even if a couple of them squeak past the 65-game threshold, he's on pace to play 73. That should be another in what is becoming a field of feathers in Cunningham's MVP-case cap. 3. Victor Wembanyama, SpursMVP odds: +2500I don't think a lot of people want to accept the Spurs as a true title contender this season. It still feels too early in the process. They were supposed to be one of those teams that would hopefully earn a playoff spot just for the experience. But they've blown past that projection. They're the West's No. 2 seed and they've beaten the No. 1 seed and defending champion Thunder four times. They're a top-tier contender, traditional timelines be damned, and it's because of Victor Wembanyama. \nDon't get me wrong, the Spurs are an excellent team on both ends independent of Wemby, but he's the one that changes the game to a degree that all traditional analysis has to be basically disregarded. It reminds me of the expedited emergence of the 2014-15 Warriors. That happened too quickly for a lot of people to accept, too, but then you looked up and they had won the whole damn thing. They had a great young team, just like the Spurs, but the start of that dynasty can be tracked directly to Stephen Curry, who geometrically warped the offensive end of the court to such a degree that nobody was equipped to defend it. Wemby does the same thing defensively, effectively shrinking the court to the same effect that Curry expands it. What has always been enough space to drive through or put up a shot in is no longer adequate as Wemby can erase 10 feet of separation like its five and spike what you thought was, and against any other opponent would be, a clean shot. That changes an entire offense. Causes more \"never mind\" retreats than we've ever seen. The paint is Cunnningham's office and he missed 13 of his 16 shots in there on Monday. A lot of it was the sheer presence of Wemby (not to mention Stephon Castle all over him, to the point that Detroit had to take Cade off the ball at the start of possessions to allow him to breathe) messing with his typical rhythms. That sixth sense guys like Cunningham have for their scoring spots gets jumbled to hell when Wemby is around, because you know he's always lurking to do this to you. \nAnd this, of course, is to say nothing of Wemby's offense. Over San Antonio's current nine-game winning streak he's averaging 24.9 points, 12 rebounds, 3.4 assists, 3.4 blocks and 1.3 steals a night. For the season, he's currently on track to become the only player in NBA history to average over 24 points, 11 rebounds and two blocks in less than 30 minutes per game. When this guy is playing potentially closer to 40 minutes in playoff games, yes, the Spurs have enough to win it all. I'm not saying they will. But they have enough. Wemby makes that big a difference -- 12.6 points per 100 possessions, per CTG, to be exact, even on a team with a bunch of other studs. It probably won't be enough to win him the MVP. For starters he's missed 13 games (the NBA Cup title game vs. the Knicks counts toward games played but not toward statistics, believe it or not), meaning he can only miss four more to even be eligible. \nBut I'll tell you what, if the Spurs jump the Thunder for the No. 1 seed (this is more than feasible with just two losses separating them and San Antonio owning the tiebreaker), given the impact Wemby is having, his case is going to have to be seriously considered. At any rate, for the time being at least, Wemby's impact is great enough to slot him higher than Jokić on my board due to the fact that he's far more likely to make the 65-game mark and his Spurs have been a better team. 4. Nikola Jokić, NuggetsMVP odds: +300Chances are he's not going to qualify. He can only miss one more game the rest of the season and Denver has four back-to-backs remaining, to say nothing of any little tweak. But until further notice, Jokić remains a top candidate for a Nuggets team declines by a whopping 16.5 points per 100 possessions when he isn't on the floor, per Cleaning the Glass. \nThat's the biggest on-off impact among any of the MVP candidates. The Nuggets literally go from an offensive rating that would rank, by an appreciable margin, as the best in NBA history with Jokic on the floor to right on the edge of a bottom-10 unit this season without him. He has a better No. 2 than Cunningham in Jamal Murray, but Denver and Detroit share a disproportionate dependence on their superstar, and in the end, Jokić is the best player in the world. His case, as it is every season, is airtight. He's averaging a triple-double and you've hardly noticed its so routine --  28.8 PPG on the best true-shooting percentage in the league. He's the league leader in assists and rebounds per game. He remains an advanced-metric god. But we're splitting hairs here, and he's missed a lot of time. If he cowboys up and doesn't miss a game the rest of the way, he's going to get a lot of votes. But right now, Cunningham has done enough for a top-seed team, and Wemby likewise for a higher-seeded team, to deserve an edge in my non-voter opinion. \n5. Jaylen Brown, CelticsMVP odds: +5000LeBron James said it after the Celtics -- led by Brown's 32 points, eight rebounds, seven assists and three steals -- dismantled the Lakers on Sunday: \"JB is playing great basketball, man. This whole MVP thing, I don't understand why his name is not getting talked about some, as well. Nobody gave them a shot to start the season. He's averaging, what, 30? Just under 30. It's a popularity contest sometimes.\"LeBron is spot on here. Brown is averaging 29.2 PPG, fourth-best in the league, and the Celtics that were supposed to be in a gap year are instead the East's No. 2 seed and a legitimate conference threat despite losing Jayson Tatum, Jrue Holiday, Al Horford and Kristaps Porziņģis from last year's squad. No other MVP candidate has endured that kind of roster depletion and still managed to keep his team in the title conversation. Brown has been an absolute killer. His efficiency doesn't jump off the page (for a while his midrange numbers were insane, but they've declined more into the still really freaking good category largely thanks to a 48% clip from the dreaded 15-19 foot rang, per NBA.com), but he's having to attempt so many tough, self created shots while also clocking a career high assist percentage that volume has to be noted positively for his case. Brown has never taken anything close to the 22 shots per game he's taking this season. That's by necessity. Long has the perception existed that Brown occupied the tier of star players below the super level, but that's been put to bed. Jaylen Brown is a superstar. No go-to guy has had more responsibility on his plate this year, perhaps other than Cunningham, and he has exceeded the responsibility in every way. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA MVP Rankings: Victor Wembanyama jumps into top three, Cade Cunningham could win by default - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/46cb54b4-e992-4fee-b54d-1ac7f1f43114/thumbnail/1200x675/8a4fb1654d95018bedc3c597fed25964/wemby-getty-5.png"
      ],
      "datePublished": "2026-02-24T19:40:20.000Z",
      "dateModified": "2026-02-24T19:40:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rick Carlisle rips NBA over Pacers being fined for alleged tanking - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/rick-carlisle-pacers-tanking-fine-nba-aaron-nesmith/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/32793259-8b58-422e-b520-67b473596f60/thumbnail/1200x675/9243d1625a4d613588079d88116276fa/rick-carlisle.jpg",
    "tag": "Sports",
    "date": "2026-02-24T20:46:56.000Z",
    "description": "\n        The Indiana Pacers and Utah Jazz were recently hit with significant fines from the NBA for tanking, which has become one of the hot topics of",
    "body": "\n        The Indiana Pacers and Utah Jazz were recently hit with significant fines from the NBA for tanking, which has become one of the hot topics of debate this season with so many teams racing to the bottom ahead of a loaded 2026 NBA Draft class. The Jazz were fined $500,000 for \"conduct detrimental to the league\" for benching star players regularly for the fourth quarter in an effort to lose, while the Pacers were fined $100,000 for \"violating the Player Participation Policy\" when they rested Pascal Siakam and two other starters for a game against the Jazz -- including Aaron Nesmith. Unsurprisingly, Pacers coach Rick Carlisle didn't agree with the NBA's decision and went into detail on why during a radio appearance in Indianapolis on Tuesday. He told 107.5 The Fan about the league's call with the Pacers and how the NBA insisted Nesmith could have played without speaking to Nesmith or the Pacers' team doctors. \"Yeah, I put out a statement about it. I didn't agree with it,\" Carlisle said. \"There was a league lawyer that was doing the interview that kind of unilaterally decided that Aaron Nesmith, who had been injured the night before and couldn't hold the ball, should have played in the game, which just seems ridiculous. And during the interview process, I was not on it, but I heard details. We asked them if they wanted to talk to the doctors, our doctors about it, because it's something that was documented by our doctors and trainers. They said no, they didn't need to. They talked to their doctors who did not examine Aaron Nesmith, and we asked them if they wanted to talk to the kid, and they said no, they didn't need to. So this was shocking. This was shocking to me. And during the interview they also asked if we considered medicating him to play in a game when we were 30 games under .500. So I was very surprised. You know, obviously didn't agree with it. This is really the first time I've gone into any detail about it. But that was the deal. And so yeah, that was it.\" If the league did suggest Nesmith should play without consulting the doctors who examined him and insisted he should've been medicated to play in a game, that does seem like a significant overreach on the part of the NBA. \nIt does need to be noted that Carlisle wasn't on this call and heard these details secondhand -- surely from someone frustrated within the Pacers organization about the outcome of the call -- but if that is indeed how the conversation went, that feels like a problem with the NBA's process that they need to address. The NBA issued a statement on Tuesday denying Carlisle's claims. \"Coach Carlisle's description of the process that went into the decision to fine the Indiana Pacers is inaccurate,\" the league said in a statement. \"An independent physician led the medical review. In addition, the Pacers' General Manager and the team's Senior Vice President, Sports Medicine and Performance were interviewed as part of the process. The Pacers confirmed that it had provided all of the information requested by the league and the team reported that an interview with Coach Carlisle or a team physician wasn't necessary.\"The Nesmith injury being legitimate is certainly Indiana's most salient argument against the fine, but that seems like it was a more secondary concern to Siakam's absence for the NBA. Mostly, the Pacers ran into the issue of the league feeling significant pressure from the outside, including its media partners, to address tanking that feels more widespread and aggressive than we've seen in some time. \nWhile Indiana is understandably not happy with being singled out and hit with a $100,000 fine, that game with the Jazz -- which they lost -- was critical to the lottery race and if you gave the Pacers some truth serum, I bet they'd tell you it was worth the 100 grand. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rick Carlisle rips NBA over Pacers being fined for alleged tanking - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/32793259-8b58-422e-b520-67b473596f60/thumbnail/1200x675/9243d1625a4d613588079d88116276fa/rick-carlisle.jpg"
      ],
      "datePublished": "2026-02-24T20:46:56.000Z",
      "dateModified": "2026-02-24T20:46:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA parlay, odds, props: Longshot picks could result in a $1.1 million payday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nba-longshot-parlay-picks-bets-props-for-tuesday-february-24-this-nba-parlay-could-return-1-1-million/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/49f4ac17-b91c-4603-9028-e5dbad5d1262/thumbnail/1200x675/36c6969bc879f73a291edf283fec0f0d/payton-pritchard-boston-celtics-cbs.jpg",
    "tag": "Sports",
    "date": "2026-02-24T23:02:13.000Z",
    "description": "\n        With Tuesday's NBA schedule consisting of 11 games, there's a surplus of options for NBA parlay picks. However, you shouldn't limit your bets",
    "body": "\n        With Tuesday's NBA schedule consisting of 11 games, there's a surplus of options for NBA parlay picks. However, you shouldn't limit your bets to just NBA picks against the spread or over/under predictions, since you can also seek out NBA props and wagers with plus-money NBA odds. The likes of NBA alternate lines, NBA winning margins, NBA fist scorer bets, and other NBA picks can be wagered on individually or combined into an NBA longshot parlay for a potentially massive return.Jarrett Allen of Cleveland is averaging 21.8 points in eight February games, but has a points over-under of just 13.5 in Cavaliers vs. Knicks (+4.5). Making NBA bets on Allen to score 20-plus points could return +492, and there are numerous other intriguing NBA prop bets for the day's other top games, including Thunder vs. Raptors (-2.5), Celtics vs. Suns (+5.5) and Lakers vs. Magic (+5). Before locking in any Tuesday NBA picks or forming a longshot parlay, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.Bet the NBA with the latest DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model entered Week 19 on a sizzling 38-18 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.  Now, the model has scoured the latest NBA odds and locked in six NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of $1.1 million. You can only see the model's NBA picks at SportsLine.Bet NBA games with the latest FanDuel promo code and get $100 in bonus bets instantly if your first $5+ bet wins:Top NBA picks for Tuesday, Feb. 24After simulating every game 10,000 times, the model is backing the Over in the alternate total (218.5) in Celtics vs. Suns at 9 p.m. ET, which returns +238. The standard O/U is 206.5 but the model projects that line to be eclipsed in nearly 70% of simulations, as the teams are forecasted to combine for 220 points. These teams have engaged in nothing but high-scoring affairs recently, with each of their last four contests seeing at least 224 total points, as the four have averaged 230.1 combined points.This is a road game for Boston, and Celtics games average 3 more total points on the road (224.8) than at home (221.8). As for Phoenix, its defense has fallen apart as of late as it is allowing 7.5 more points in February than it did in January, while the Celtics have the league's No. 2 offensive rating. A total of 11 players will score more than 9 points, per the model, which allows the standard total to be eclipsed by over a dozen points. With 220 points projected, betting over the alternate total of 218.5 is the safe NBA prop to make. See which other NBA parlay picks to make on Tuesday here.How to make NBA parlay picks for Tuesday, Feb. 24The model also has locked in five more picks, including a pair of 1st scorer props that return over +800 in a longshot parlay that pays $1.1 million on just a $10 bet. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Tuesday that could unlock a $1.1 million payday on just a $10 bet? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA parlay, odds, props: Longshot picks could result in a $1.1 million payday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/49f4ac17-b91c-4603-9028-e5dbad5d1262/thumbnail/1200x675/36c6969bc879f73a291edf283fec0f0d/payton-pritchard-boston-celtics-cbs.jpg"
      ],
      "datePublished": "2026-02-24T23:02:13.000Z",
      "dateModified": "2026-02-24T23:02:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas, Ohio State among college football's 10 most explosive offenses in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-footballs-offenses-2026-texas-miami-portal-hauls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/2cb151e4-ba45-4122-b12f-dc25b2d3e925/thumbnail/1200x675/a30b3e891534d7be91ffbd6c02bab4b4/arch.png",
    "tag": "Sports",
    "date": "2026-02-24T21:47:06.000Z",
    "description": "\n        There are lots of ways to score points, but usually quarterback play, offensive line strength and dynamic playmakers are essential to buildin",
    "body": "\n        There are lots of ways to score points, but usually quarterback play, offensive line strength and dynamic playmakers are essential to building an explosive offense in college football. Indiana featured all three last year, riding the nation's No. 3 scoring offense all the way to a historic College Football Playoff National Championship. They weren't alone, though, with seven CFP teams ranking No. 32 or better in points per game in 2025. So while it's not a guarantee of success, fielding an offense that can score points at will provides a definitive advantage and a leg up in a landscape growing more competitive by the day. Coming out of the 2026 recruiting and transfer portal cycle, some teams appear better equipped than others to light up the scoreboard next season.Here's a projection of which college football teams could field the most explosive offenses in 2026:\n\n                            \n    \n                                                \n                    \n    1. TexasTexas added Auburn wide receiver Cam Coleman along with running backs Hollywood Smothers (NC State) and Raleek Brown (Arizona State) to help reshape the offense for 2026. The Longhorns won bidding battles for Coleman and Smothers, who combined for 12 touchdowns at their previous stops last season.Arch Manning is coming off the best outing of his career after outdueling Michigan's Bryce Underwood in the Citrus Bowl, a postseason showing that mirrored the second-half surge that accelerated his development. If Manning takes another step, this Texas offense could rival the best of the Sarkisian era on the Forty Acres -- a stretch that already includes consecutive CFP semifinal appearances.Like other elite programs that are a grenade-pin pull away from another level in 2026, everything starts up front for Texas. The Longhorns have reloaded with a bevy of highly rated portal additions who will flourish only if Manning has time to operate. If Texas controls the line of scrimmage, the pieces are in place for this SEC power to stress opposing defenses behind elite play-caller Steve Sarkisian and a rising star at quarterback.\n\n                            \n    \n                                                \n                    \n    2. MiamiAssuming the Hurricanes overcome the loss of four impact starters along the offensive line, Miami should continue generating explosive plays and scoring at a rapid pace next fall. The arrival of Duke transfer quarterback Darian Mensah -- along with his top target Cooper Barkate and former South Carolina slot receiver Vandrevius Jacobs -- gives Shannon Dawson flexibility and eases the burden on Malachi Toney.Targeted heavily down the stretch of his freshman season, Toney set a single-season program record with 109 receptions.Veteran running backs Mark Fletcher Jr. and Jordan Lyle also return. Three of Fletcher's six 100-yard performances came over the final four games, when Lyle was limited by injury.\nProjecting ahead, Mario Cristobal's likely starting offensive line could include Matthew McCoy, Samson Okunlola, SJ Alofaituli, Jamal Meriweather and five-star freshman tackle Jackson Cantwell -- the No. 2 overall prospect in the 2026 class. If that group controls the line of scrimmage the way Miami did in 2025, the Hurricanes could be borderline unstoppable offensively.\n                            \n    \n                                                \n                    \n    3. IndianaAfter leading the Big Ten in scoring offense each of the past two seasons, expectations may be bordering on unrealistic entering Curt Cignetti's third year. Fresh off a national championship, Indiana must replace a Heisman Trophy-winning quarterback, its top two running backs, leading receivers Elijah Sarratt and Omar Cooper Jr., and three offensive line starters.Few programs, however, are better positioned to absorb that level of change. Indiana's recent success has been driven by player development and precise scheme execution.\nCignetti has tabbed TCU transfer Josh Hoover as the replacement for Fernando Mendoza. Boston College transfer Turbo Richard adds explosiveness to the run game, while Michigan State's Nick Marsh and Tulane's Shazz Preston join Charlie Becker to reshape the receiving corps.The mentality up front is not expected to change. Whether the Hoosiers maintain their edge -- and the offensive efficiency that has defined this run -- will be determined quickly at the line of scrimmage.\n                            \n    \n                                                \n                    \n    4. Ohio StateRyan Day's decision to hire former NFL coach Arthur Smith as offensive coordinator has drawn mixed reviews, much of which is tied to Smith's results at the professional level. The college game presents a different equation, however, particularly when elite programs can overwhelm opponents with superior talent. That setting could allow Smith to thrive.\nAt Ohio State, Smith is expected to employ a streamlined, run-oriented approach while creating calculated downfield opportunities for Jeremiah Smith and others. Quarterback Julian Sayin ranked among the nation's most efficient passers as a redshirt freshman, and a significant leap is anticipated from the Heisman hopeful.Despite transfer portal losses at wide receiver, the Buckeyes remain loaded at the position, highlighted by the additions of five-star prospects Chris Henry Jr. and Jerquaden Guilford. Smith, Devin McCuin and Brandon Innis are projected starters, with Bo Jackson back at tailback.Solidifying the offensive line rotation looms as a key offseason priority. Day has emphasized the need to play at least eight linemen with positional versatility, underscoring the importance of depth and flexibility up front.\n\n                            \n    \n                                                \n                    \n    5. OregonNo program in the country owns a better quarterback situation than the Ducks after Dante Moore's decision to skip the 2026 NFL Draft and return to school. Nebraska transfer Dylan Raiola is behind him, along with a couple of guys the coaching staff feels great about in Akili Smith Jr. and Brock Thomas. As freshmen last season, Jordon Davison and Dierre Hill Jr. showed out in the backfield and are anxious to take on featured roles. The biggest loss on offense is tight end Kenyon Sadiq -- a projected first-rounder. Jamari Johnson will get the first crack at matching his production at the position. Dakorien Moore, Jeremiah McClellan and Evan Stewart return as featured options at wideout. There might be slight statistical drop off with elite offensive coordinator Will Stein taking over at Kentucky, but Oregon has proved annually under Dan Lanning that this offense is a tough one to contain.\n                            \n    \n                                                \n                    \n    6. Notre DameThere will be no Jeremiyah Love or Jadarian Price to rescue the offense when needed next season, but Fighting Irish offensive coordinator Mike Denbrock has little reason to panic. After losing the first two starts of his career, C.J. Carr responded with 10 consecutive wins, finishing with 2,741 yards and 24 touchdowns. He was tied for No. 2 in the country in yards per attempt (9.4) and fifth in passer rating (168.06).\nAneyas Williams is expected to receive the first reps at running back, though Notre Dame could opt for a committee approach in 2026.Ohio State transfers Mylan Graham and Quincy Porter join a talented group of pass-catchers that includes Jaden Greathouse and Jordan Faison, who led the team in receptions and receiving yards as a junior.And if there is one position group Notre Dame rarely worries about, it is the offensive line. The Fighting Irish are consistently well-coached up front and typically set the tone in the trenches. With a favorable schedule ahead, this offense should post significant numbers throughout 2026.\n\n                            \n    \n                                                \n                    \n    7. LSUWhen you assemble the nation's top-ranked transfer portal class and commit every available resource to making Year 1 under Lane Kiffin a success, the expectation is immediate production.In addition to landing former Arizona State quarterback Sam Leavitt, Kiffin added USC signal-caller Husan Longstreet and overhauled LSU's wide receiver room with 12 newcomers. The offensive line also projects as a major strength, anchored by five-star Colorado transfer Jordan Seaton. That unit must improve after uneven play last fall, when the Tigers struggled at times to protect Garrett Nussmeier and failed to meet lofty preseason expectations.Tight end Trey'Dez Green returns as a proven playmaker, and Harlem Berry -- the No. 1 running back in the 2025 recruiting cycle -- opted to remain with the program to see what Kiffin and his staff can build.\nKiffin engineered a rapid offensive turnaround at Ole Miss with tempo and efficiency. He will attempt to replicate that formula in Baton Rouge after bringing offensive coordinator Charlie Weis Jr. and several assistants with him.\n                            \n    \n                                                \n                    \n    8. Texas TechTexas Tech's CFP shutout loss to Oregon left a bitter taste inside the program, a stark offensive failure that set the offseason narrative. Coach Joey McGuire quickly identified and addressed his offensive needs needs during this transfer portal cycle, adding Cincinnati quarterback Brendan Sorsby and four wide receivers, including two from Power Four programs. Another strong portal class positions Texas Tech to compete for a Big 12 championship and a playoff berth -- provided the offense performs at a high level, especially given personnel losses on defense. In 2025, the Red Raiders often leaned on their defense to make plays, a luxury they may not have next fall.Optimism rests partly on a talented backfield anchored by returning contributors Cameron Dickey, J'Koby Williams and Quinten Joyner, who will be counted on to lift the offense next season.\n                            \n    \n                                                \n                    \n    9. Ole MissWith quarterback Trinidad Chambliss receiving an injunction to play a sixth season, the Rebels look like a juggernaut in 2026. Auburn transfer Deuce Knight was once an insurance policy, set to take over under center if Chambliss' court challenge fell through. Now he'll be a luxury. Retaining college football's most potent running back also helps after Kewan Lacy stiff-armed the pursuit from LSU and Kiffin to stay with the Rebels. He's a 1,400-yard rusher who scored an SEC-leading 23 touchdowns last fall.\n                            \n    \n                                                \n                    \n    10. Oklahoma StateEric Morris fielded the nation's top total offense (512 yards per game) and scoring average (45.1 points) at North Texas last year. Transitioning from the Group of Six to the Power Four presents a new challenge, but Morris's system is proven -- and he persuaded his two best North Texas players to follow him.Oklahoma State could emerge as college football's most-improved team thanks to Morris and a top-10 transfer class, highlighted by quarterback Drew Mestemaker and tailback Caleb Hawkins. The Cowboys are poised for multiple high-scoring Big 12 shootouts, with plenty of fireworks and eye-popping numbers expected from their all-conference-caliber offensive talent.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas, Ohio State among college football's 10 most explosive offenses in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/2cb151e4-ba45-4122-b12f-dc25b2d3e925/thumbnail/1200x675/a30b3e891534d7be91ffbd6c02bab4b4/arch.png"
      ],
      "datePublished": "2026-02-24T21:47:06.000Z",
      "dateModified": "2026-02-24T21:47:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandon Moreno hopes UFC Fight Night can 'bring joy' to Mexico amid unrest - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/brandon-moreno-ufc-fight-night-unrest-in-mexico/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/0923ae0e-5abf-4199-a3af-c07eb757734d/thumbnail/1200x675/b6b57fd7c26bdb6ccf03912103b8431f/brandon-moreno-weighins-flag.jpg",
    "tag": "Sports",
    "date": "2026-02-24T20:00:17.000Z",
    "description": "\n        For the eighth time in promotional history, the UFC will present a fight card on Saturday from Mexico City. And, for the fifth time since tha",
    "body": "\n        For the eighth time in promotional history, the UFC will present a fight card on Saturday from Mexico City. And, for the fifth time since that relationship began, former two-time flyweight champion Brandon Moreno will be featured prominently on the card. Moreno (23-9-2), a native of Tijuana who now lives and trains out of Las Vegas, became the first Mexican-born champion in UFC history when he captured the promotion's 125-pound title by submitting Deiveson Figueiredo in 2021, which was their second of four title bouts against one another in the history of their exciting rivalry. The 32-year-old Moreno will look to return to title contention and bounce back from a December TKO loss to Tatsuro Taira when he headlines UFC Fight Night inside Arena CDMX in the proud nation's capitol city. Moreno, who will face late replacement Lone'er Kavanagh (9-1) will also be fighting with the plight of his people in mind following days of unrest throughout the country. On Sunday, the Mexican government announced the capturing and death of powerful cartel leader Nemesio Ruben Oseguera Cervantes, commonly known as \"El Mencho,\" which set off a wave of retaliatory violence in major cities. \n\"I was walking yesterday in the streets and I stopped to watch my cellphone at all the bad news around the country,\" Moreno told CBS Sports HQ on Monday. \"Right now, in Mexico City, things here are super calm. All of the disaster is more to the north like Guadalajara and Puerto Vallarta. Actually, my [home] city has reports of some destruction on the streets in Tijuana, that's the northwest. Thank life and thank God, my family is fine and the people all around me are fine. \"It has been really hard hours for my Mexican people. It's weird, man. It's crazy because, right now, I'm super focused on my fight but, at the same time, I know that a lot of Mexican people are focused on this bad moment. Maybe [the UFC Fight Night event] can be a nice moment for the people to try to forget the bad moment and get some joy.\"\nThe site of Saturday's card, in central Mexico, is located more than a six-hour drive away from the center of the unrest in the Mexican state of Jalisco, where citizens and tourists have been told to shelter in place. The U.S. State Department declared Tuesday that the majority of areas outside of Jalisco have \"returned to normal\" and UFC Fight Night will go on as scheduled. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandon Moreno hopes UFC Fight Night can 'bring joy' to Mexico amid unrest - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/0923ae0e-5abf-4199-a3af-c07eb757734d/thumbnail/1200x675/b6b57fd7c26bdb6ccf03912103b8431f/brandon-moreno-weighins-flag.jpg"
      ],
      "datePublished": "2026-02-24T20:00:17.000Z",
      "dateModified": "2026-02-24T20:00:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's best bets, odds for Knicks at Cavaliers, NC State at No. 11 Virginia and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-knicks-at-cavaliers-nc-state-at-no-11-virginia-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/14/781bacf1-2811-4a52-bda7-409a80b5006d/thumbnail/1200x675/836c410ecbbd7ac50e06da47995157dc/donovan.jpg",
    "tag": "Sports",
    "date": "2026-02-24T20:30:41.000Z",
    "description": "\nPicking the team that will win the Eastern Conference and reach the NBA Finals is a head-scratching, hair-pulling exercise.Very little separates the ",
    "body": "\nPicking the team that will win the Eastern Conference and reach the NBA Finals is a head-scratching, hair-pulling exercise.Very little separates the top four teams: the Detroit Pistons, Boston Celtics, New York Knicks and Cleveland Cavaliers. According to DraftKings Sportsbook, the Cavaliers are lukewarm favorites to win the East, at +300. But the Celtics (+310), Pistons (+350) and Knicks (+380) make this a four-team photo.The Eastern race even has Charles Barkley confounded. On Friday the Inside the NBA analyst and Naismith Hall of Famer switched his pick to win the conference from New York to Cleveland. On Tuesday, Barkley's pick to win the East faces the team that he had picked to win the East when the Cavaliers and Knicks square off at Rocket Arena.Cleveland (36-22) is 19-6 over its last 25 games and sits in fourth place in the East, one game behind New York (37-21). The Cavaliers are 5-1 since acquiring James Harden at the trade deadline. Meanwhile, the Knicks are 12-3 over their last 15 games, but 12-1 against teams not named Detroit. Cleveland is a 4.5-point favorite over New York.While Cavaliers-Knicks is the marquee attraction on Tuesday, there are other options on a sporting landscape that includes 10 other NBA games and a full college basketball schedule. Below is a snapshot of what to watch and bet on Tuesday, Feb. 24. All times Eastern.NBA best bets, where to watchKnicks at CavaliersTime: 7:30 p.m. | Location: Cleveland | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 232.5\nDonovan Mitchell and the Cavaliers were elite offensively even before adding Harden. Since Dec. 29, they are averaging 119.1 points per 100 possessions, which ranks third in the league over that time. Since acquiring Harden, that number has jumped to 123.0 points per 100. Meanwhile, the Knicks have been elite offensively all season. They are averaging 118.5 points per 100 over the entire year, which is third in the association. So Tuesday's game could be a shootout. The SportsLine Projection Model, which simulates every game 10,000 times, says there's a 55.5% chance the teams combine for 233 points or more and assigns a B grade to Over 232.5. Timberwolves at Trail BlazersTime: 10 p.m. | Location: Portland | TV: Peacock | Stream: Fubo (Try for free)SportsLine picks -- Model: Timberwolves -6.5\nThe Minnesota Timberwolves may be the most maddening team in the league. Despite being loaded with talent, led by superstar Anthony Edwards, the Wolves (35-23) sit in sixth place in the Western Conference and continue to lose games they shouldn't. The latest example: On Sunday, despite playing a 76ers team without Joel Embiid and Paul George and despite having the rest advantage over Philadelphia, Minnesota was blown out, 135-108 at home. On Tuesday, the Timberwolves face another team they should beat: the Trail Blazers (28-30), who are ninth in the West. The SportsLine Projection Model says Minnesota has a 59.0% chance to cover and gives a C grade to Timberwolves -6.5.College basketball best bets, where to watchNC State at No. 11 VirginiaTime: 7 p.m. | Location: Charlottesville, Va. | TV: ACC Network | Stream: Fubo (Try for free)SportsLine picks -- Model: Virginia -6.5\nTwo of the top teams in the ACC collide when the Virginia Cavaliers host the NC State Wolfpack at John Paul Jones Arena. The Cavaliers (24-3, 12-2 in ACC) have won eight in a row and sit in second place in the conference. Meanwhile, the Wolfpack (19-8, 10-4) are tied for third in the ACC and are coming off a 24-point blowout win over North Carolina, which ended a two-game losing streak. Tuesday's game is a rematch of one that was played on Jan. 3 in Raleigh, N.C., which Virginia won, 76-61. The Cavaliers are 13-1 at home this season. The SportsLine Projection Model says Virginia has a 51.0% chance to cover and assigns a C grade to Virginia -6.5.  No. 22 Tennessee at MissouriTime: 9 p.m. | Location: Columbia, Mo. | TV: SEC Network | Stream: Fubo (Try for free)SportsLine picks -- Model: Missouri +2.5 | Expert: Over 143.5 (Chip Patterson)\nThe Missouri Tigers can improve their case to make the NCAA Tournament when they host the Tennessee Volunteers at Mizzou Arena. The Tigers (18-9, 8-6 in SEC) are squarely on the Tournament bubble, sitting among the Last Four In in CBS Sports' Bracketology. They have picked things up offensively, averaging 80.6 points per game over their last six contests. That has led to the Over cashing in four of Missouri's last five games. \"Missouri has one of the starkest home-road splits for three-point shooting in SEC play, connecting on 37.1% from deep at home while that number plummets to 31.2% on the road,\" Patterson says. Meanwhile, the SportsLine Projection Model says there's a 61.0% chance the Tigers cover and gives a B grade to Missouri +2.5.UCF at BYUTime: 11 p.m. | Location: Provo, Utah | TV: ESPN2 | Stream: Fubo (Try for free)SportsLine picks -- Model: BYU -12.5\nThe season-ending injury to Richie Saunders (18.0 points, 5.8 rebounds, 2.1 rebounds per game) on Feb. 14 was supposed to be devastating to the already thin BYU Cougars. And it still might be. But so far the Cougars have played well without him, losing by just seven points at No. 4 Arizona before beating No. 6 Iowa State, 79-69. On Tuesday, BYU will play a UCF team with one of the worst defenses in the country. The Knights allow 77.2 points per game, which ranks 269th in the nation. The SportsLine Projection Model says there's a 50.0% chance the Cougars cover and assigns a C grade to BYU -12.5.USC at UCLATime: 11 p.m. | Location: Los Angeles | TV: FS1 | Stream: Fubo (Try for free)SportsLine picks -- Model: UCLA -7.5 | Expert: USC +7.5 (Larry Hartstein)\nTwo crosstown rivals on the NCAA Tournament bubble collide with much at stake when the UCLA Bruins face the USC Trojans at Pauley Pavilion. The Bruins (18-9, 10-6 in Big Ten) are currently a No. 10 seed in CBS Sports' Bracketology. Meanwhile, the Trojans (18-9, 7-9) are among the First Four Out and badly need a win to improve their Tournament résumé. Hartstein notes that USC has covered four straight as a road dog, including two outright wins, a one-point loss and a seven-point loss. But the SportsLine Projection Model disagrees. It says UCLA has a 61.0% chance to cover and gives a B grade to Bruins -7.5.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's best bets, odds for Knicks at Cavaliers, NC State at No. 11 Virginia and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/14/781bacf1-2811-4a52-bda7-409a80b5006d/thumbnail/1200x675/836c410ecbbd7ac50e06da47995157dc/donovan.jpg"
      ],
      "datePublished": "2026-02-24T20:30:41.000Z",
      "dateModified": "2026-02-24T20:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]