[
  {
    "title": "John Cena's last match in WWE: The Last Time is Now Tournament results, bracket - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/john-cena-last-match-wwe-last-time-is-now-tournament-bracket-results-schedule/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/661211a5-7479-4d30-b7fe-9279a5d28b3b/thumbnail/1200x675/f2233f25eae6b74e350343a50055763d/john-cena-wwe-last-time-now-tournament-results-preview-update-schedule-cbs-sports-pro-wrestling-nov-12-2025-retirement-match-farewell-tour.jpg",
    "tag": "Sports",
    "date": "2025-11-29T03:06:36.000Z",
    "description": "\n\n\n    \n                                    Updated results and complete schedule for the tournament that will determine the opponent for Cena's retir",
    "body": "\n\n\n    \n                                    Updated results and complete schedule for the tournament that will determine the opponent for Cena's retirement match\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 28, 2025\n                            \n                    at\n    10:06 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                WWE\n            \n            \n    \n        John Cena will wrestle his last match at WWE Saturday Night's Main Event on Dec. 13. But the honor to see who gets to face the star before his retirement must be earned, and so WWE superstars are currently battling in The Last Time is Now Tournament, with the winner ultimately becoming Cena's final opponent in Washington, D.C.The Last Time is Now Tournament competition began on the Nov. 10 episode of Monday Night Raw and will continue on the two weekly main roster shows, leading into the fifth and final Saturday Night's Main Event of 2025.Sixteen superstars from Raw, SmackDown, and NXT competed for the unique opportunity to show Cena the door. Four superstars remain in contention, including two former world champions. Repeat rivals GUNTHER and Jey Uso find themselves on opposite sides of the bracket, each of them one win away from the finals.The tournament featured several twists and turns along the way. Two surprise entrants from Cena's past competed in the tournament. Zack Ryder returned for a one-off match on SmackDown, and Dolph Ziggler received a warm ovation for his match on Raw. The Miz lost his opening round match against Uso, but snuck back into the tournament after Sheamus pulled out with an injury.\nTake a look below at the tournament schedule, results, and upcoming match dates. Check back periodically for updates ahead of Cena's last farewell stop on Dec. 13.The Last Time is Now Tournament bracket\n                                                                    WWE\n                                                            The Last Time is Now Tournament matchesFirst roundRusev def. Damian Priest (Raw, Nov. 10)Sheamus def. Shinsuke Nakamura (Raw, Nov. 10)Jey Uso def. The Miz (SmackDown, Nov. 14)LA Knight def. Zack Ryder (SmackDown, Nov. 14)GUNTHER def. Je'Von Evans (Raw, Nov. 17)Solo Sikoa def. Nic Nemeth (Raw, Nov. 17)Carmelo Hayes def. Bronson Reed (SmackDown, Nov. 21)Penta def. Finn Balor (SmackDown, Nov. 21)QuarterfinalsGUNTHER def. Carmelo Hayes (Raw, Nov. 24)Solo Sikoa def. Penta (Raw, Nov. 24)Jey Uso def. Rusev (SmackDown, Nov. 28)LA Knight def. The Miz (SmackDown, Nov. 28)SemifinalsSolo Sikoa vs. GUNTHER (Raw, Dec. 1)Jey Uso vs. LA Knight (SmackDown, Dec. 5)FinalsTBA vs. TBA (Raw, Dec. 8)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Cena's last match in WWE: The Last Time is Now Tournament results, bracket - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/661211a5-7479-4d30-b7fe-9279a5d28b3b/thumbnail/1200x675/f2233f25eae6b74e350343a50055763d/john-cena-wwe-last-time-now-tournament-results-preview-update-schedule-cbs-sports-pro-wrestling-nov-12-2025-retirement-match-farewell-tour.jpg"
      ],
      "datePublished": "2025-11-29T03:06:36.000Z",
      "dateModified": "2025-11-29T03:06:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Eagles-Bears, Texas A&M-Texas today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-free-nba-league-pass-eagles-bears-texas-a-m-texas-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-28T18:22:08.000Z",
    "description": "\n        Retail sites aren't the only places where you'll find top offers on Black Friday, as new users can capitalize on the latest DraftKings promo ",
    "body": "\n        Retail sites aren't the only places where you'll find top offers on Black Friday, as new users can capitalize on the latest DraftKings promo code to receive $200 in bonus bets and three free months of NBA League Pass for Friday online sports betting. Friday features a packed slate with Eagles vs. Bears in a pair of divisional leaders, Texas A&M looking to secure its spot in the SEC Championship Game and College Football Playoff in a contest against Texas, and NBA Cup betting in the final week of group play. The SportsLine Projection Model has found value in the action, including backing Over 43.5 total points in Eagles vs. Cowboys and the Lakers to cover as 9.5-point favorites against the Mavericks in its Friday best bets at DraftKings Sportsbook.One of SportsLine's top experts also has a pick on Texas vs. Texas A&M. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returnsFriday best bets at DraftKings SportsbookEagles vs. Bears: Over 43.5 total pointsTexas (+3) vs. Texas A&MLakers (-9.5) vs. MavericksCombining the model's three picks into a Friday parlay at DraftKings would result in a payout of +644 (risk $100 to win $644). Bet it at DraftKings here:\nEagles vs. Bears: Over 43.5 total points (-115)The Bears have climbed up the top-scoring offense rankings over recent weeks during their four-game winning streak, as Chicago currently has the No. 8 scoring offense at 26.3 points per game this season. The Bears are coming off a 31-28 win over the Steelers, and Chicago is averaging 30.3 ppg over its last four contests. Meanwhile, the Eagles have a star-studded offense that's always capable of big-time plays, led by Jalen Hurts, Saquon Barkley, A.J. Brown and DeVonta Smith. The model projects the Over to hit in 55% of simulations. Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Texas (+3) vs. Texas A&M (-102)\"Whew! The Ags are still unbeaten but have cut it close more than once, especially two weeks ago vs. South Carolina, and earlier escapes at Notre Dame and Arkansas. Flying so close to the flame, A&M could eventually get burned, and cannot again afford QB Marcel Reed to make mistakes as his two picks vs. the Gamecocks on November 15 nearly proved very costly,\" SportsLine legendary expert Bruce Marshall said. \"Texas salvages its season with a win and keeps its remote playoff chances alive (there will need to be lots of dominoes falling the Longhorns' way, but not impossible). The defense will need to prevent too many big plays by Reed, but Arch Manning has played his best games in November, and the Horns offense is starting to click. Play Texas\" Back Texas at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Lakers (-9.5) vs. MavericksLuka Doncic goes up against his former team again on Friday, and although it's not the first time since being traded away, you'd have to imagine there are still personal feelings on Doncic's end against Dallas. Although the Mavericks fired general manager Nico Harrison, it's still the same ownership that approved the trade. Doncic had a triple-double with 19 points, 15 rebounds and 12 assists in his first meeting, and then scored 45 points in his final meeting against Dallas last year. The Lakers won both of those contests by an average of 11.5 points. The Lakers are 13-4 and have won five straight games, while the Mavericks are 5-14 and tied for the second-worst record in the Western Conference. The model projects the Lakers to cover in 65% of simulations. Back the Lakers at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:\nWant more Friday NFL, NBA and college football picks?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Eagles-Bears, Texas A&M-Texas today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg"
      ],
      "datePublished": "2025-11-28T18:22:08.000Z",
      "dateModified": "2025-11-28T18:22:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USWNT vs. Italy: Defense shuts out Europeans as Moultrie and Macario score - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uswnt-italy-score-recap-olivia-moultrie-catarina-macario/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/29/89113f63-71cf-42fd-ad45-e045ad403d26/thumbnail/1200x675/8573abcde4697eacf6265819010218db/usa-women.jpg",
    "tag": "Sports",
    "date": "2025-11-29T02:13:18.000Z",
    "description": "\n        The United States women's national team had a post-Thanksgiving feast when they defeated Italy on Friday, 3-0, with goals by Olivia Moultrie ",
    "body": "\n        The United States women's national team had a post-Thanksgiving feast when they defeated Italy on Friday, 3-0, with goals by Olivia Moultrie and Catarina Macario. Moultrie's goal came just two minutes in, while Macario scored in the 64th and 76th minute to cement the lopsided scoreline.The Stars and Stripes got off to a quick start to their two-game series with Moultrie putting this effort away with a well-placed, one-time shot into the right side of the goal:\n\"Honestly, we just talked about starting fast and starting strong, and I think, like, the energy and momentum just carried out. We had a really good weekend training, so I feel like it just kind of flowed into the first minutes of the game,\" Moultrie told the broadcast about her goal at halftime. The 20-year-old Moultrie has been in top form for club and country recently. She played 28 games for Portland Thorns FC and had a surge in the second half of the year, scoring seven goals in her final 15 club games. Her goal against Italy was her third goal in six appearances with the USWNT this year, and her fifth international goal. Still, the USWNT were unable to capitalize on the early momentum from Moultrie's goal. \nBy halftime, the Italians narrowed the shot total, taking five attempts to the USA's seven, and had a dangerous look on goal by Chiara Beccari. The European side took advantage of some set-piece defending and quick thinking, and very nearly had a breakaway, but defender Naomi Girma came up with massive defensive play.\nIn true Emma Hayes tradition, the manager wanted her team to sort things out before making any additional changes. The tactics paid off when the insurance goal came by way of a combination between midfielder Sam Coffey and forward Macario. \nMacario put the game away in the 76th minute to make the lead 3-0. It was the second game the forward scored a brace for the USWNT. Her sixth goal in seven games, the attacker is capping off her 2025 in familiar form. \nThe U.S. national team will close out 2025 with a final game on Monday, also against Italy.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USWNT vs. Italy: Defense shuts out Europeans as Moultrie and Macario score - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/29/89113f63-71cf-42fd-ad45-e045ad403d26/thumbnail/1200x675/8573abcde4697eacf6265819010218db/usa-women.jpg"
      ],
      "datePublished": "2025-11-29T02:13:18.000Z",
      "dateModified": "2025-11-29T02:13:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 NBA Cup bracket: Clinch scenarios, standings with six spots up for grabs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/2025-nba-cup-bracket-clinch-scenarios-standings-schedule-knockout-stage/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/eedff7ff-a0a6-437e-a971-3e6e1ede4dce/thumbnail/1200x675/c4a11099253ddd2dcdb5c23ad1d1539d/kat-knicks-getty-4.png",
    "tag": "Sports",
    "date": "2025-11-28T20:08:47.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Six of the eight spots in the 2025 NBA Cup knockou",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Six of the eight spots in the 2025 NBA Cup knockout stage will be determined Friday night as group play wraps up in the league's third annual in-season tournament. The Lakers and Raptors are the only two teams to have clinched their groups so far, and 12 teams are still alive for the remaining spots in the eight-team knockout bracket.Friday's 11-game schedule brings three win-and-in games: Magic vs. Pistons, Suns vs. Thunder and Nuggets vs. Spurs. Each of those winners will clinch their respective group and move on to the knockout stage. The Knicks also play a win-and-in game as they host the Bucks at Madison Square Garden. If New York loses, however, the team is eliminated from Cup contention.There are three groups in each conference. Each group winner moves on and both conferences each get one wild-card team. The wild-card team will be each conference's the top second-place team. Point differential is the deciding tiebreaker among wild-card teams with the same record.The 18-1 Thunder are currently the favorites to win the 2025 NBA Cup (-105 at FanDuel). The Bucks won the compeittion last year, and the Lakers won the initial version in 2023.Below are the NBA Cup clinch scenarios and standings entering Friday.NBA Cup clinch scenarios for FridayThe winners of Magic vs. Pistons, Suns vs. Thunder and Nuggets vs. Spurs will all clinch their groups and a knockout stage spot.The Knicks win their group with a victory over the Bucks. The Heat clinch the group if the Knicks lose.The Cavs, Bucks, Knicks, Heat, Grizzlies and Clippers -- in addition to losers of Magic vs. Pistons, Suns vs. Thunder and Nuggets vs. Spurs -- are all alive for wild-card spots. Complete wild-card clinch scenarios are explained here.2025 NBA Cup bracketBracket to be determined after Friday's games.\nNBA Cup standingsStandings entering Friday's action.\n                                                                    NBA\n                                                            2025 NBA Cup knockout stage scheduleQuarterfinals: Tuesday, Dec. 9 and Wednesday, Dec. 10Semifinals: Saturday, Dec. 13Finals: Tuesday, Dec. 16\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 NBA Cup bracket: Clinch scenarios, standings with six spots up for grabs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/eedff7ff-a0a6-437e-a971-3e6e1ede4dce/thumbnail/1200x675/c4a11099253ddd2dcdb5c23ad1d1539d/kat-knicks-getty-4.png"
      ],
      "datePublished": "2025-11-28T20:08:47.000Z",
      "dateModified": "2025-11-28T20:08:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-sunday-lineup-advice-optimizer-week-13-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/176c3002-1447-4995-8256-ca1791a5c0c5/thumbnail/1200x675/5ea4ae7d273fe34e7d6a91c19aee4054/devon-achane-miami-dolphins-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T21:24:02.000Z",
    "description": "\n        Four games over the course of Thanksgiving Day and Black Friday will limit the NFL DFS main slate on FanDuel and DraftKings, but there are st",
    "body": "\n        Four games over the course of Thanksgiving Day and Black Friday will limit the NFL DFS main slate on FanDuel and DraftKings, but there are still plenty of big names to consider on Sunday. Josh Allen, Christian McCaffrey, Puka Nacua and Trey McBride are some of the high-scoring options for NFL DFS lineups. Points, however, could still be at a bit of a premium with week with weather potentially impacting a few games and six games with an over/under of 41.5 scheduled for Sunday afternoon.How should all that factor into your NFL DFS picks this week, and who are the sleepers in the NFL DFS player pool that can help differentiate your lineups? Before making any NFL DFS picks for Sunday or locking in NFL DFS lineups on sites like DraftKings and FanDuel, be sure to check out SportsLine's advanced NFL DFS lineup optimizer.New users can also target the latest Underdog promo code, where they can pick at Underdog and get $100 in site credits after making a $5 wager:The DFS Optimizer uses info from the SportsLine Advanced-Data Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on betting apps like DraftKings and FanDuel. It simulates every game 10,000 times to help DFS players optimize and build winning DraftKings and FanDuel lineups. Optimize, export, and enter lineups confidently with injury updates, floor and ceiling player projections, and Vegas lines and picks all with one winning tool.Now, SportsLine's NFL DFS Optimizer has turned its attention to Sunday's 2025 NFL Week 13 schedule and just locked in its top daily Fantasy football lineups. You can only see its optimal lineups at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5.Top NFL Week 13 DFS picks for SundayOne of the optimizer's top DFS value picks for Sunday is Dolphins running back De'Von Achane ($8,700 on FanDuel, $8,300 on DraftKings), who takes on the New Orleans Saints. He's been one of the hottest players in the league recently, pilling up a whopping 390 scrimmage yards over the past two weeks. His 21 carries in Week 12 and 22 carries 11 were his two highest totals of the season, and he has remained a frequent target in the passing game as well. The Saints have given up the ninth-most rushing yards to opposing backs this season, making Achane a high-value play on Sunday. See who else to pick here.The optimizer's NFL DFS strategy also includes building around Texans receiver Nico Collins at $6,700 on DraftKings and $8,100 on FanDuel. He had a quieter 3-55 receiving line last week on just three targets. That appears to be an anomaly, however, since he was targeted a total of 36 times over the prior three games and put up a 23-303-1 combined receiving line during that span. DFS players can confidently add him on Sunday against a Colts secondary that ranks 23rd in Fantasy points given up to opposing receivers. You can see the rest of the optimizer's NFL DFS picks here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to build Sunday Week 13 NFL DFS lineupsThe NFL DFS Optimizer is also targeting multiple undervalued players who could explode for huge numbers on Sunday. Those players could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who they are, and the rest of the optimizer's NFL DFS picks, at SportsLine. So what is the optimal NFL DFS lineup for Sunday, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice and stacks, all from an NFL DFS optimizer that simulates every game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineup advice for Sunday from daily Fantasy football optimizer - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/176c3002-1447-4995-8256-ca1791a5c0c5/thumbnail/1200x675/5ea4ae7d273fe34e7d6a91c19aee4054/devon-achane-miami-dolphins-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T21:24:02.000Z",
      "dateModified": "2025-11-28T21:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baker Mayfield injury: Buccaneers QB (shoulder) trending toward starting vs. Cardinals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/baker-mayfield-injury-updates-buccaneers-qb-mri-shoulder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/1691c8ab-3afc-4e32-aafd-734c2eba0eb2/thumbnail/1200x675/bd9d86fd1186e18a446e4c6c28173bb3/baker-mayfield-injury-getty.png",
    "tag": "Sports",
    "date": "2025-11-28T18:35:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tampa Bay Buccaneers quarterback Baker Mayfield is",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tampa Bay Buccaneers quarterback Baker Mayfield is trending toward starting his team's Week 13 matchup against the Arizona Cardinals, coach Todd Bowles told reporters on Friday. Mayfield injured his non-throwing shoulder on a first-half hit during last week's 34-7 loss to the Los Angeles Rams. Bowles told reporters Wednesday that backup quarterback Teddy Bridgewater would get the majority of starting reps ahead of Sunday's matchup as Mayfield was held out of practice. Mayfield, who reportedly sustained a low-grade strain to his shoulder, was a limited participant Thursday but was back in practice Friday, leading to a more positive outlook for Sunday's game. \"He was very limited on Wednesday, he did a little more yesterday and he moved around perfectly today, so he's fine,\" Bowles said Friday.After Mayfield's initial injury in the first quarter of the Week 12 game, Mayfield re-aggravated his shoulder on a Hail Mary attempt in the second quarter. Mayfield did not play the rest of the game and spent the second half in a sling as Tampa Bay lost its third straight game. On Wednesday, Bowles said Mayfield was \"sore\" and his availability would come down to how he felt at the end of the week.\nThe Buccaneers (6-5) started the season 6-2, but this rough patch in recent weeks squandered their lead in the NFC South. Now tied with the Carolina Panthers at the top of the division, the Buccaneers are the No. 4 seed in the NFC with six games to play. Tampa Bay is gunning for its sixth straight divisional crown, but Mayfield's availability is paramount to reaching the postseason.Mayfield threw a touchdown pass and two interceptions in the first half of Sunday's loss in Los Angeles before exiting the game. He was among the league's leading MVP candidates through the first six games before the schedule stiffened.The Buccaneers host the Cardinals, New Orleans Saints and Atlanta Falcons over the next three weeks. Now in his third season with the Buccaneers, Mayfield made 45 consecutive starts and has not missed a game since 2022, when a high ankle sprain with the Panthers caused him to miss time. \nMayfield has thrown for 2,406 yards and 18 touchdowns this season with a 60.8 QBR, the second-highest rating of his career.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baker Mayfield injury: Buccaneers QB (shoulder) trending toward starting vs. Cardinals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/1691c8ab-3afc-4e32-aafd-734c2eba0eb2/thumbnail/1200x675/bd9d86fd1186e18a446e4c6c28173bb3/baker-mayfield-injury-getty.png"
      ],
      "datePublished": "2025-11-28T18:35:46.000Z",
      "dateModified": "2025-11-28T18:35:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Footy Fix: USWNT in action Friday night and MLS Conference finals headline Thanksgiving weekend action - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-uswnt-in-action-friday-night-and-mls-conferences-finals-headline-thanksgiving-weekend-action/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/d6146026-5d2f-4b14-922e-f0c78118ede4/thumbnail/1200x675/0525ce14d1272e62140d3b5c1deb63c8/untitled-design-2025-11-28t163623-197.png",
    "tag": "Sports",
    "date": "2025-11-28T18:41:47.000Z",
    "description": "\n        Welcome to the weekend! Thanksgiving is over and we all hope you had a nice time with the ones you love. Let's shift back to the action now, ",
    "body": "\n        Welcome to the weekend! Thanksgiving is over and we all hope you had a nice time with the ones you love. Let's shift back to the action now, as another exciting weekend leads us into the MLS conference finals coming up on Sunday. I'm Francesco Porzio with the latest.📺 Footy fixAll times U.S./EasternFriday, Nov. 28🇺🇸 Friendly: USWNT vs. Italy, 7 p.m. ➡️ TNTSaturday, Nov. 29🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Manchester City vs. Leeds United, 10 a.m. ➡️ Peacock🇪🇸 LaLiga: Barcelona vs. Alaves, 10 a.m. ➡️ ESPN+🇮🇹 Serie A: Juventus vs. Cagliari, 12 p.m. ➡️ Paramount+🇮🇹 Serie A: AC Milan vs. Lazio, 2:45 p.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Tottenham vs. Fulham, 3 p.m. ➡️USA NetworkSunday, Nov. 30🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Crystal Palace vs. Manchester United, 7 a.m. ➡️ USA Network🇮🇹 Serie A: Pisa vs. Inter, 9 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Chelsea vs. Arsenal, 11:30 a.m. ➡️ USA Network🇮🇹 Serie A: Atalanta vs. Fiorentina, 12 p.m. ➡️ Paramount+🇮🇹 Serie A: AS Roma vs. Napoli, 2:45 p.m. ➡️ Paramount+🇪🇸 LaLiga: Girona vs. Real Madrid, 3 p.m. ➡️ ABC🇺🇸 MLS: Inter Miami vs. NYCFC, 6 p.m. ➡️ AppleTV🇺🇸 MLS: San Diego FC vs. Vancouver Whitecaps, 9 p.m. ➡️ AppleTVYour Food Coma PlansWhat's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Footy Fix: USWNT in action Friday night and MLS Conference finals headline Thanksgiving weekend action - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/d6146026-5d2f-4b14-922e-f0c78118ede4/thumbnail/1200x675/0525ce14d1272e62140d3b5c1deb63c8/untitled-design-2025-11-28t163623-197.png"
      ],
      "datePublished": "2025-11-28T18:41:47.000Z",
      "dateModified": "2025-11-28T18:41:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Butler has been a star in his role, but 'sad' Warriors need him to be an actual star - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jimmy-butler-warriors-role-sad-stephen-curry-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/cfabaf93-dd51-4b41-9ac4-d04731b66d8b/thumbnail/1200x675/789b182fcc7ca1e9926befea8d6a7306/jimmy-buter-getty.png",
    "tag": "Sports",
    "date": "2025-11-28T22:53:02.000Z",
    "description": "\n        Jimmy Butler sounds like he's losing his joy again. That didn't take long. Butler has played 60 games with the Warriors, including last year'",
    "body": "\n        Jimmy Butler sounds like he's losing his joy again. That didn't take long. Butler has played 60 games with the Warriors, including last year's postseason, and already he's at his wits' end with a .500 team that leans almost entirely on Stephen Curry turning into Superman to win games. \"We're gonna have to be damn near perfect,\" Butler said of Golden State's chances of surviving without Curry, who is going to be out at least a week with a quad contusion. \"We're not going to have the ultimate bail-out on our team.\"\"But even when [Curry] is on the floor, we're going to have to do our job because we make the game real difficult,\" Butler continued. \"As great of a basketball player as he is, he has a really hard job. Every single day he's gotta be the Batman of all Batmans and save us every night. That ain't what he's here to do.\"Butler was then asked to elaborate on what the Warriors do, in his estimation, to make \"make the game hard\" for themselves, and he rattled off a list of ills that have clearly been getting on his nerves for a while. \n\"We don't box out. We don't go with the scouting report. We let anybody do whatever they want. Open shots. Get into the paint. Free throws. It's just sad.\"You be the judge for yourself, but this does not sound like a happy Jimmy Butler, whose, shall we say, enthusiasm for his current NBA situation has always had an expiration date. \nSo here's the thing: Butler isn't wrong. Curry righting all of Golden State's wrongs with nuclear scoring explosions is not a formula for sustained success. It's nice to have that ace up your sleeve, but no, you cannot be reaching for it every night. The Warriors are 10-10 and at least three of those wins are a direct result of Curry saving the day. \nFirst he went for 42, including 35 after halftime, in an overtime victory vs. the Nuggets in the first week of the season. The Warriors had no business winning that game. Curry scored 16 straight points over a six-minute surge spanning the end of the fourth quarter and the start of overtime. All told, he outscored the Nuggets by himself, 18-15, from the 2:42 mark of the fourth forward. He had to sink this shot to get the game to overtime in the first place. \nA couple of weeks ago, Curry basically single-handedly lifted the Warriors over Victor Wembanyama and the Spurs twice in three nights by rattling off 95 points and 15 3-pointers. Again, this is a great option to have. Any good team, let alone one aspiring to be a contender, has a superstar who needs to save the day once in a while. But the Warriors are supposed to have two superstars. You see what I'm getting at here? \nButler is quick to call out all these things the Warriors aren't doing well, which, again, he's not wrong about, but conveniently, we're not hearing anything about Golden State's 110.3 offensive rating when Butler is on the floor without Curry, which would rank as the fifth-worst mark in the league. I know the rebuttal to this point. The Warriors are still a net positive when Butler is on the floor without Curry because of a 90th percentile defensive rating, per Cleaning the Glass, and it's true that Curry's defense isn't what it once was in terms of staying in front of people, so as much as Curry saves the day offensively, he's at the point now where he's the one getting bailed out a lot of the time defensively. Still, that's not the larger point. Curry going nuclear is still the only hope this team has, and it shouldn't be that way. Prior to the season, I picked the Warriors to go to the Finals, and even though that's not looking like a very good call barring a trade (which is probably going to happen for Jonathan Kuminga once he's eligible to be moved on Jan. 15), the larger point is that optimism was rooted in the idea that Butler, after acclimating himself over the last half of last season, would be willing to stretch his scoring comfort zone. \nMaybe he will in the playoffs, assuming the Warriors actually qualify (he's known to coast, relatively, during the regular season). But the problem is the Warriors don't have the leeway for him to be just another player basking in the Steph space until the last leg of the season when, as it looks now, the Warriors will again be fighting for their lives. Butler's numbers look great, admittedly: 20 PPG on 53/46/87 shooting splits. The Warriors are 12.8 points better per 100 possessions when he's on the floor, per CTG. None of this is meant to suggest that Butler is not a positive player. He clearly is. And then some. But look at the defensive numbers when Draymond Green isn't with him. It's the same story as the offense when Curry isn't with him. Rock-bottom stuff. If Butler doesn't want things to be so hard on Curry, perhaps stepping out of his comfort zone and actually pursuing, consistently and forcefully, his own offense instead of being happy to only take super efficient shots created by Curry running himself ragged and taking entire defenses with him would be a good place to start. \nSee, that's the hollow part of directing this thinly veiled criticism at the Brandin Podziemskis and Moses Moodys of the world. They're role players for a reason. They're already up against the threshold of their abilities. To suggest the Warriors are a bottom-10 defense because they don't pay attention to the scouting report isn't genuine. From a personnel standpoint, they don't have great on-ball defenders and they're incredibly small on the back end, which is also why they aren't a good rebounding team. Yes, boxing out can help. Sticking to the scouting report is important. But basketball doesn't happen on paper. There are gaps that happen in real time that have to be covered by players capable of doing so. Curry does it offensively. Green does it defensively. But that's only enough to keep the Warriors treading water. \nTo actually start making some progress toward the tier of contenders in which the Warriors believe they belong, Butler has to do more. And to do more, he has to be willing to go outside his comfort zone. The simple truth is he operates offensively like every other role player on the Warriors, seizing opportunities created by someone else as opposed to creating them for himself. The only difference is that he's better at playing this way than the actual role players. It's become a Butler schtick to say \"just get 30 the ball\" as if that's all there is to playing for the Warriors. That's how life ends up being so hard on Curry, and ultimately, that's how you end up with a bottom-10 offense. Butler isn't getting paid $57 million this season to \"get 30 the ball.\" He's not supposed to be the so-called \"star in his role.\" He's supposed to be an actual star. Klay Thompson understood Curry was Batman, but he was still hunting his offense. Different player, yes. But Butler's mentality could be the same. Thompson was a true No. 2. -- a guy who could, would, and oftentimes did assume the alpha role in the biggest moments. \nButler is too happy to stay in his lane. The Warriors need him to drive, so to speak, more aggressively, even at the risk of crashing here and there. Take some tough shots. Force some plays that maybe aren't there. It sounds strange to encourage a less measured and careful approach on team that already turns the ball over like crazy, but when the alternative is giving equal opportunity to players who aren't of equal ability, you're going to end up levying blame onto the wrong shoulders. Kuminga, for instance, catches all kinds of hell for all these little things he maybe doesn't do so well -- and again, it's not to suggest there isn't merit in these critiques (although I won't listen to anyone who suggests he hasn't been overall very good when he's played this season). But when Curry went down in the second round of the playoffs, and the Warriors couldn't create consistent shots to save their life, who was the one asserting himself as a scorer? I'll give you a hint. It wasn't Butler. There was a built-in excuse that Butler wasn't healthy himself, but that would pretend he hadn't become a much more passive scorer in the latter Miami years, too. He wants to get in the paint and kick out and draw fouls and take easy shots when they present themselves. This is great when Curry's cooking, but Butler is the one saying, correctly, that the Warriors can't keep relying on that. \nSo what can the Warriors start doing differently? Pay attention to all the details Butler suggests, sure. But in the end, they're going to be a small team that struggles to defend at the point of attack and only has Curry to lean on offensively. Butler himself says that isn't enough. So you can either ask more of guys who aren't equipped to give more, or you can ask the guy making superstar money to do more than simply take what the defense and Curry give him. Maybe he's not capable of being that player anymore. But he has to try. Especially if he's going to be the one holding everyone else accountable.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Butler has been a star in his role, but 'sad' Warriors need him to be an actual star - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/cfabaf93-dd51-4b41-9ac4-d04731b66d8b/thumbnail/1200x675/789b182fcc7ca1e9926befea8d6a7306/jimmy-buter-getty.png"
      ],
      "datePublished": "2025-11-28T22:53:02.000Z",
      "dateModified": "2025-11-28T22:53:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vikings turning to undrafted rookie Max Brosmer vs. Seahawks with J.J. McCarthy out - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jj-mccarthy-concussion-minnesota-vikings-qb-week-13-status/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/afefc59c-15e2-4972-92a9-56a228299804/thumbnail/1200x675/038a6039710e6302d77633e2dd62f8a3/borsmer.jpg",
    "tag": "Sports",
    "date": "2025-11-28T21:07:10.000Z",
    "description": "\n        The Minnesota Vikings will start their third different quarterback of the season on Sunday against the Seattle Seahawks, as the team announce",
    "body": "\n        The Minnesota Vikings will start their third different quarterback of the season on Sunday against the Seattle Seahawks, as the team announced that undrafted rookie Max Brosmer will lead the offense in Week 13. J.J. McCarthy will miss his sixth start of the season after he suffered a concussion last week in the 23-6 loss to the Green Bay Packers. McCarthy was injured during Minnesota's loss to Green Bay. He was on the field for the Vikings' final drive late in the fourth quarter and threw an interception to Packers defensive back Evan Williams that allowed Green Bay to run the clock out. It marked McCarthy's second interception of the game and 10th of the season. The 2024 first-round pick also threw for a season-low 87 yards and posted a passer rating of 34.2, the worst of his career. McCarthy has thrown more interceptions than touchdowns in four of his six starts this season. He entered the 2025 season as Minnesota's starter after the Vikings let Sam Darnold walk in free agency. \n        \n            \n                NFL Week 13 odds, predictions, expert picks: Can Bills bounce back vs. Steelers? Will Shedeur Sanders cover?\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nMcCarthy had three interceptions to two touchdowns in Minnesota's first two games before suffering a high ankle sprain that kept him sidelined for over a month. McCarthy returned on Nov. 2 and led the Vikings to a win against the Detroit Lions. The Vikings are 0-3 in their last three games with McCarthy leading the offense. McCarthy, who joined Minnesota as the 10th overall pick in the 2024 NFL Draft, also missed all of his rookie season after tearing his meniscus in his first preseason game with the Vikings. \nWho is Max Brosmer?Brosmer, 24, found his way to the Vikings this offseason after going undrafted out of the University of Minnesota. In his lone season at Minnesota, Brosmer threw for 2,617 yards, 17 touchdowns and five interceptions while completing 66.8% of his attempts. Brosmer arrived at Minnesota after emerging as an FCS All-American at New Hampshire, where he started 34 games across four seasons. In his final season at New Hampshire, Brosmer threw for 3,464 yards and 29 touchdowns before using his final year of eligibility to transfer up to the FBS level. Despite a strong season at Minnesota, Brosmer went undrafted but caught on with the Vikings and made the team as the third-string quarterback behind McCarthy and Carson Wentz (who is also injured). In the preseason, Brosmer completed 60.3% of his passes for 364 yards, two touchdowns and one interception. Brosmer has actually seen time in three games this season, completing 5 of 8 passes for 42 yards.\nAnd with McCarthy and Wentz now sidelined, Brosmer will make his first career NFL start on Sunday in Seattle. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vikings turning to undrafted rookie Max Brosmer vs. Seahawks with J.J. McCarthy out - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/afefc59c-15e2-4972-92a9-56a228299804/thumbnail/1200x675/038a6039710e6302d77633e2dd62f8a3/borsmer.jpg"
      ],
      "datePublished": "2025-11-28T21:07:10.000Z",
      "dateModified": "2025-11-28T21:07:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stanford hires Tavita Pritchard: Commanders assistant, ex-Cardinal QB returning to alma mater - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/stanford-hires-tavita-pritchard-coach-andrew-luck-frank-reich/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/50eb9311-104b-4f33-8dbe-349e2abede9d/thumbnail/1200x675/cf1530315f6dc6b0d25e415a92ae3aa7/tavita-pritchard-imagn.png",
    "tag": "Sports",
    "date": "2025-11-28T23:00:47.000Z",
    "description": "\n        Stanford has hired Tavita Pritchard as its next football coach, the school announced Friday. Pritchard, who played quarterback for the Cardin",
    "body": "\n        Stanford has hired Tavita Pritchard as its next football coach, the school announced Friday. Pritchard, who played quarterback for the Cardinal from 2006-09, is in his third season as the quarterbacks coach for the Washington Commanders after a long run at Stanford as an assistant. Pritchard will start in his role at Stanford immediately following the Commanders' game against the Denver Broncos on Sunday.Pritchard will be replacing interim coach Frank Reich, who took over the program earlier this spring after Stanford fired coach Troy Taylor amid an off-field controversy. Reich, the former head coach of the Indianapolis Colts and Carolina Panthers, has guided Stanford to a 4-7 record. The Cardinal closes out the 2025 season against No. 9 Notre Dame on Saturday.Pritchard started seven games in 2007 and all 12 games in 2008 before being replaced by Andrew Luck -- the current general manager of the football program who led the hiring process. \"Winning in college football today requires a leader of men who can build and motivate teams, recruit future stars, and develop and connect with talent,\" Luck said in a statement. \"Tavita Pritchard is exactly the right head coach at the right time to help us build on the foundation of this season and lead Stanford football to its next great era. Coach Pritchard is a culture builder, a teacher of football of the highest caliber, and a humble yet determined servant leader who is committed to the success of Stanford's student-athletes. I could not be more excited to welcome Tavita, Caroline and their family back to campus.\"\n\n        \n            \n                Wild coaching carousel enters final weekend: Where do Florida, Ole Miss stand? What's up with Auburn?\n                \n                    Richard Johnson                \n            \n                            \n    \n                \n                    \n    \nPritchard began his coaching career with his alma mater in 2010 and stayed on in a variety of roles until 2022. He started as a graduate assistant and also worked as a defensive assistant before working his way up to several positions on the offensive staff -- running backs coach, quarterback and wide receivers coach and offensive coordinator/quarterback coach. Pritchard then joined the Commanders' staff in 2023 as the quarterbacks coach and oversaw the development of Jayden Daniels. Daniels, one of the league's brightest young quarterbacks, won NFL Offensive Rookie of the Year after helping guide his team to the NFC Championship game in 2024.\"Stanford is a place like no other and my family and I are full of gratitude to be returning home in every sense of the word,\" Pritchard said. \"I have a clear vision of the hard work, brotherhood and tenacity it will take to build a championship Stanford football program. I cannot wait to partner with Andrew and begin working with the best student-athletes in the world to achieve excellence on and off the field.\"\nHow did Stanford get here?Stanford hasn't had a winning season since 2020, when it went 4-2, and last played in a bowl game in 2018. Under Jim Harbaugh and David Shaw, Stanford had plenty of success during the 2010s, including 10 consecutive bowl appearances and three Pac-12 titles. Stanford won the Rose Bowl twice under Shaw (2012 and 2015) and won the Orange Bowl (2010) in Harbaugh's final season with the program before he left to coach the San Francisco 49ers.Stanford won at least eight games in Shaw's first seasons leading the program, but a downturn began thereafter. The Cardinal had a combined 14-28 record over Shaw's final four seasons and went just 3-15 in Pac-12 play across the 2021 and 2022 seasons. Under Taylor, Stanford went 6-18 -- 3-9 in both 2023 and 2024. Taylor's first year at the school was Stanford's final season as a member of the Pac-12. After the Pac-12 dissolved, the Cardinal moved to the ACC and have continued to struggle. Stanford went 2-6 against ACC competition in 2024 and is 3-5 this season under Reich. Since 2022, Stanford has had just one win over a ranked opponent. That came in 2024 against No. 19 Louisville.\nAnother reason for the recent decline is the use -- or lack thereof -- of the transfer portal. In large part due to Stanford's rigorous academic requirements, the Cardinal brought in just four transfers (per 247Sports) ahead of the 2024 season. However, that number went up to 18 this past offseason as the roster experienced significant turnover after Taylor's dismissal.Pritchard faces an uphill climb to bring his alma mater back to relevance and its glory days.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stanford hires Tavita Pritchard: Commanders assistant, ex-Cardinal QB returning to alma mater - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/50eb9311-104b-4f33-8dbe-349e2abede9d/thumbnail/1200x675/cf1530315f6dc6b0d25e415a92ae3aa7/tavita-pritchard-imagn.png"
      ],
      "datePublished": "2025-11-28T23:00:47.000Z",
      "dateModified": "2025-11-28T23:00:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Everything Lane Kiffin said about his upcoming decision after the Egg Bowl - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-coaching-future-ole-miss-egg-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/411122e9-a66e-4530-9771-ca32a15f1d23/thumbnail/1200x675/b7e30df9e8aa2b06887a777635eff0b3/adobe-express-file-2025-11-28t175055-477.jpg",
    "tag": "Sports",
    "date": "2025-11-28T23:19:26.000Z",
    "description": "\n        No. 7 Ole Miss likely secured its spot in the College Football Playoff with Saturday's 38-19 win against Mississippi State. The Rebels also s",
    "body": "\n        No. 7 Ole Miss likely secured its spot in the College Football Playoff with Saturday's 38-19 win against Mississippi State. The Rebels also secured their first 11-win regular season in program history and claimed their third Egg Bowl in a row for the first time since 2002-04. But those accomplishments weren't the focus during ABC's broadcast of the Egg Bowl. They weren't the focus as Ole Miss coach Lane Kiffin took the podium to address reporters following his team's victory. Everything that happened on the field was overshadowed by Kiffin's murky future with the Rebels. Almost every spectator had at least one eye turned towards Saturday, when Kiffin is expected to decide whether or not he will remain at Ole Miss or fill the coaching vacancy at LSU. As of Friday evening, Kiffin hasn't made a final call. \"I haven't,\" Kiffin said. \"Maybe that surprises you. I got to do some praying and figure this thing out. I can get to that tomorrow. I live life about one day at a time. Maybe that doesn't help you, but I've learned to live that way for about six years now, five years. That helps me. Today is all about these players performing really well and keeping this Egg Bowl trophy where it belongs.\"     \nWord should come soon and, if he leaves Ole Miss, it would almost certainly have to be before the Rebels embark on their first playoff run in program history. \n        \n            \n                How the College Football Playoff Selection Committee would view Ole Miss if Lane Kiffin leaves Rebels\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nBelow is everything Kiffin said about the pending decision and his future at Ole Miss Saturday:    Opening statement \"Just to watch our players at the end -- I told them last night, as you get older, you get joy from others, especially your children, which players a lot of times are similar. I just wanted them to get to 1-0 today. Just like every time we've been in this stadium, to watch them go over there to the fans with the Egg Bowl trophy and be able to celebrate that alone, just winning the Egg Bowl. And then on top of that, for them to win 11 regular season games. We talk a lot about, coach (Pete) Carroll used to say, 'Do things better than you've ever done before.' They just did that. I guess no one in the entire state has ever had an 11-win regular season, so that's pretty cool, especially since the SEC has never been harder or deeper than it is now. So that's an amazing accomplishment by them.\n\"I know the storyline about distractions all week and stuff. I would just say, and I was going to say during the week, we build our teams differently. So what you may think is distracting, as I understand our fanbase or media, I don't think it is. We train our guys from the beginning when we get them and build our teams to focus on what they can control and block out noise… I wasn't concerned this week and they've been doing it for a month. I would say we teach our players and our staff a lot of times that what you think might be really bad might be good. Maybe you should think the other way, that all that distraction and all the noise outside bonds them together because they know their team, their coach, their coaches. And everybody says, 'Well, they're going to be distracted. They're not going to play well or they should want a different coach.' I think that bonds them together to stay focused and to play really well.\" On if he plans to still make his decision Saturday \"I feel like I've got to. Probably not as enjoyable as people probably think it is. Like Kirby (Smart) says when he wants to complain about being in the national championship and missing the portal window, there's no crying from the yacht. So I'm not trying to get pity. But it's not as enjoyable as maybe some people would think.\"  On if winning the Egg Bowl and making the playoff makes his decision more difficult \"I think it's difficult no matter what. I think that there is a relief that we played like I thought they would today. I did think they would play like this. But you never know. I am relieved for that, cause if we didn't play well today, we all know what the storyline would be. It would be my fault for having them distracted and stuff. I'm really glad that we proved that narrative, which is a fair narrative for people to write and I think a lot of our fans felt that way this week. Understandable. But they don't know our room and they don't know how we train them and how they think.\" \nOn what was going through his mind watching the Ole Miss crowd after the game \"Just really cool. That's, what, the third time we've been here? Third time emptying out their stadium and then watching that crowd do it and that game, and then Jaxson Dart and watching Trinidad (Chambliss) carry that trophy. I said to them, this just gives me so much joy to see them be able to do something like this. To watch these guys come together -- like, they came from everywhere. I should probably know this, but I bet you on offense we don't have any players that play from the state of Mississippi. Think about that. Maybe I'm wrong but I don't think we have any… So they came from all over the place to come together to do this, to win and then bring joy to all the fans which are from Mississippi, mostly I assume.\" On his postgame interaction with a reporter \"I understand your guys' job and I think things are fair. Like I say, when questions come, those are fair questions. Maybe I can't answer them, maybe I don't see them the same. But when you call someone a hoe, that's a different level of stuff. Can't make hoes into housewives, or something like that. That's about as bush league as stealing Trinidad's jersey like Mississippi State did last night. I ain't got any respect for that.\"             \nOn the most difficult part of the decision \"There's a lot into it. It's a hard decision. You guys have them all the time. You've got to make decisions about jobs you take and where you move and all those things. Again, we get paid a lot, so I understand ours is under a different spotlight and scrutiny. A lot of people that are critical of it are the same people that do it all the time. They make decisions. They've got to figure out the best things to do. In other professions, it's a little easier cause you get to go to places and they bring you there and you go for a weekend, you see all the schools and neighborhoods and all the stuff and then you make the decision. Our jobs are more difficult that way but I'm not complaining about it.\" \nOn who he can rely on to help with the decision \"I miss my dad on this. I really missed him this week. My two calls would be the closest to that from advice that my dad would say to do on these things and that will be coach Carroll and coach (Nick) Saban. Kind of wish, when you had things to do in life, that your dad was there. But it is what it is.\" On his specific timeframe \"Very fair question. I don't know. Maybe I should. I don't. I know it may be crazy with all the attention on it. I'm happy for our players. I'm going to go watch my son play.\" On if he would be allowed to coach Ole Miss in the CFP if he takes another job \"That's not my call. I wouldn't know that.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Everything Lane Kiffin said about his upcoming decision after the Egg Bowl - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/411122e9-a66e-4530-9771-ca32a15f1d23/thumbnail/1200x675/b7e30df9e8aa2b06887a777635eff0b3/adobe-express-file-2025-11-28t175055-477.jpg"
      ],
      "datePublished": "2025-11-28T23:19:26.000Z",
      "dateModified": "2025-11-28T23:19:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Egg Bowl brawl: Ole Miss, Mississippi State players throw punches, benches clear - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/egg-bowl-brawl-fight-ole-miss-mississippi-state-lane-kiffin/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/61f5c1be-ae0c-4f31-ae19-dae07fcbbdf9/thumbnail/1200x675/b2002e61d5ebd9e451eaa3e520e5273c/egg-bowl-fight-getty.png",
    "tag": "Sports",
    "date": "2025-11-28T19:11:09.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Sidelines cleared during a brief melee in the seco",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Sidelines cleared during a brief melee in the second quarter of Friday's Egg Bowl between No. 7 Ole Miss and rival Mississippi State. Multiple players were whistled for offsetting unsportsmanlike conduct penalties after the Rebels and Bulldogs had to be separated following a sack and strip of Ole Miss quarterback Trinidad Chambliss.After video review of the play, the fumble was ruled an incomplete pass and penalties were assessed. Bulldogs defensive tackle Jaray Bledsoe appeared to throw a punch, but was not penalized after the melee, which began when Ole Miss tight end Dae'Quan Wright began jawing with Tyler Lockhart, leading to him pulling on the Mississippi State player's facemask.\nOle Miss wideout Deuce Alexander and offensive lineman Delano Townsend were called for unsportsmanlike conduct penalties, along with Mississippi State linebacker Malick Sylla.Rebels coach Lane Kiffin told ESPN as he went into the halftime locker room that the officials let the game get out of hand with extra-curricular activities. He also made sure to call out the Mississippi State side, including athletic director Zac Selmon. \n\"We just try to play clean football, for a whole sideline to try to fight and leave the [sideline], including their athletic director, I've never seen anything like it,\" Kiffin said. \"I'm just reminding the [officials], we're just trying to play clean football here. We're not trying to start a fight here. Our guys stayed on the sideline like they're supposed to.\"Before kickoff in Starkville, Mississippi State students reportedly broke into the Ole Miss locker room and stole the jersey of Chambliss, per Kiffin. The competitive on-field battle may be overshadowed by Kiffin's murky future with the Rebels. In spite of Ole Miss' success over the past few seasons, Kiffin is mulling a move to fill the head-coaching vacancy at either LSU or Florida. \nThe buzz grew so loud that Ole Miss athletic director Keith Carter had to release a statement revealing that Kiffin will make his final decision on Saturday after the Egg Bowl. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Egg Bowl brawl: Ole Miss, Mississippi State players throw punches, benches clear - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/61f5c1be-ae0c-4f31-ae19-dae07fcbbdf9/thumbnail/1200x675/b2002e61d5ebd9e451eaa3e520e5273c/egg-bowl-fight-getty.png"
      ],
      "datePublished": "2025-11-28T19:11:09.000Z",
      "dateModified": "2025-11-28T19:11:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas A&M vs. Texas, Mavericks vs. Lakers among top games, best bets for Nov. 29 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-texas-a-m-at-texas-luka-doncic-faces-the-mavericks-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/bc02da3d-aad6-4d71-9ea3-e47185fe8581/thumbnail/1200x675/b44d403ef7a39dd5a5cc60ec6db156ed/imagn-arch-manning-texas.jpg",
    "tag": "Sports",
    "date": "2025-11-28T20:30:42.000Z",
    "description": "\nGet your Black Friday shopping done early, sports fans. Friday's schedule is loaded with bitter rivals colliding and old friends reuniting.There is n",
    "body": "\nGet your Black Friday shopping done early, sports fans. Friday's schedule is loaded with bitter rivals colliding and old friends reuniting.There is no bigger matchup on Friday than No. 3 Texas A&M at No. 17 Texas, who will renew one of the best rivalries in college football with much on the line. The Texas A&M Aggies (11-0, 7-0 in SEC) are looking to complete the program's first undefeated regular season since 1992 while also reaching the SEC Championship Game for the first time. Meanwhile, the Texas Longhorns (8-3, 5-2) can spoil all of that while also giving the College Football Playoff selection committee a lot to think about when it finalizes the 12-team playoff bracket on Dec. 7.The Aggies have a big-play offense led by dual-threat quarterback and Heisman Trophy contender Marcel Reed. Behind Reed, they average 38.1 points per game, which ranks 10th in the country. On defense, Cashius Howell has been an edge-rushing demon for A&M, ranking second in the country in sacks per game (1.05). Meanwhile, quarterback Arch Manning and the Longhorns, who struggled on offense for much of the season, have taken steps forward in that area recently, averaging 35.3 points per game over the last four games. But at the same time, the defense, which was one of the best in the country to start the year, has regressed, allowing the same 35.3 points per game over that same period of time.While Longhorns vs. Aggies is the marquee attraction on Black Friday, there are other options on a sporting landscape that includes 13 college football games, 11 NBA games, a full college basketball schedule and a partridge in a pear tree. Below is a snapshot of what to watch and bet for Black Friday, Nov. 28. All times Eastern.College football best bets, where to watchNo. 3 Texas A&M at No. 17 TexasTime: 7:30 p.m. | Location: Austin, Texas | TV: ABC | Stream: Fubo (Try for free)SportsLine picks -- Model: Texas +118 | Expert: Texas +2.5 (Bruce Marshall)\nEach of A&M's seven SEC opponents this season ranks in the bottom eight of the conference standings, and none has a winning SEC record; they are a combined 11-40 in conference play. But the Aggies already are proven on the road this season against a quality foe, having won at No. 8 Notre Dame in September. Meanwhile, the Longhorns have been marginally better at pass protection since moving Cole Hutson from center to left guard midway through the season and have averaged 332.0 passing yards per game over the last four games. SportsLine expert Bruce Marshall notes that A&M has had close calls this year at Notre Dame and against lowly South Carolina at home. \"The [Texas] defense will need to prevent too many big plays by Reed, but Arch Manning has played his best games in November, and the Horns' offense is starting to click,\" Marshall says. Meanwhile, the SportsLine Projection Model, which simulates every game 10,000 times, says Texas has a 54.0% chance to win and assigns a 'B' grade to the Longhorns money line (+118).\nNo. 25 Arizona at No. 20 Arizona StateTime: 9 p.m. | Location: Tempe, Ariz. | TV: FOX | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 47.5 | Expert: Arizona -1.5 (Bruce Marshall)\nMore than state bragging rights will be on the line when the Arizona State Sun Devils and Arizona Wildcats collide at Mountain America Stadium. The Sun Devils (8-3, 6-2) can reach the Big 12 Championship Game with a victory over Arizona (8-3, 5-3) and a BYU loss, or a win and losses by both Texas Tech and Utah. Arizona State backup quarterback Jeff Sims has played better recently in place of injured starter Sam Leavitt, but the Wildcats hold the quarterback edge. Noah Fifita ranks second in the conference and eighth in the country in passing touchdowns (25) while throwing just five interceptions. Marshall also notes that the road team has won the last two Territorial Cups. \"Full respect for ASU's Kenny Dillingham and turning journeyman Jeff Sims (at his fourth school) into a competent pilot in the wake of Sam Leavitt's injury, but the Fifita-led Cats seem to be playing with a sharper edge,\" he says. The SportsLine Projection Model says there's a 66.0% chance the teams combine for 48 or more points and gives a strong 'A' grade to Over 47.5.NBA best bets, where to watchBucks at KnicksTime: 7:30 p.m. | Location: New York | TV: Prime Video | Stream: Fubo (Try for free)SportsLine picks -- Model: Under 232.5\nThe Milwaukee Bucks (8-11) will try to stop their six-game slide when they take on the New York Knicks (11-6) at Madison Square Garden. The Bucks have played their last four games without star Giannis Antetokounmpo, who suffered a strained adductor on Nov. 17, but signs suggest he could be close to a return. Even though he did not play on Wednesday, Antetokounmpo  participated in part of shootaround and went through a pregame workout. He is listed as questionable for Friday. Milwaukee ranks 21st in the NBA in offensive efficiency (113.7 points per 100 possessions), and that includes the games with Antetokounmpo. The SportsLine Projection Model says there's a 61% chance the teams combine for 232 points or fewer and assigns a 'B' grade to Under 232.5.Mavericks at LakersTime: 10 p.m. | Location: Los Angeles | TV: Prime Video | Stream: Fubo (Try for free)SportsLine picks -- Model: Lakers -10.5 | Expert: Luka Doncic Over 33.5 total points -114 (Mike Barner)\nLuka Doncic once again faces the team that traded him when he and the Los Angeles Lakers (13-4) take on the struggling Dallas Mavericks (5-14) at Crypto.com Arena. This will be the third time Doncic has faced the Mavericks since the trade in February. In the two previous games, he has averaged 32.0 points, 11.5 rebounds and 9.0 assists. Barner notes that Doncic has scored at least 37 points in three of his last four games and is averaging 39.3 points per game at home this season. \"He's on fire right now and he'll be hyped up to face his former team, so I'll take this Over,\" Barner says. Meanwhile the SportsLine Projection Model says the Lakers have a 63% to cover and gives a 'B' grade to Los Angeles -10.5.Looking aheadCollege football: No. 1 Ohio State at No. 18 MichiganTime: Noon Saturday | Location: Ann Arbor, Mich. | TV: FOX | Stream: Fubo (Try for free)SportsLine picks -- Model: Michigan +311 | Expert: Michigan +10.5 (Matt Severance)\nNothing irritates an Ohio State fan more than being reminded that the Buckeyes have lost four in a row to Michigan. That could come to an end on Saturday when the heated rivals renew arguably the best rivalry in all of sports. Ohio State has been ranked No. 1 since beating Texas in the season opener, and quarterback Julian Sayin is playing like a Heisman Trophy winner; he leads the country in passing efficiency (185.4) and completion percentage (79.4). However Severance notes that the Wolverines are averaging 232.5 rushing yards per game over their last five games. \"Obviously, [the Buckeyes] want to end the skid in this series, but I wonder if the OSU guys are so concerned with laying a beatdown that they lose outright again,\" Severance says. Meanwhile the SportsLine Projection Model says Michigan has a 33% chance to win and assigns a 'B' grade to the Wolverines money line (+311).\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas A&M vs. Texas, Mavericks vs. Lakers among top games, best bets for Nov. 29 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/bc02da3d-aad6-4d71-9ea3-e47185fe8581/thumbnail/1200x675/b44d403ef7a39dd5a5cc60ec6db156ed/imagn-arch-manning-texas.jpg"
      ],
      "datePublished": "2025-11-28T20:30:42.000Z",
      "dateModified": "2025-11-28T20:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Texas vs. Texas A&M: TV channel, stream, odds, spread, prediction, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-texas-a-m-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/3be4888b-cf8c-4661-86e5-9a08785fe827/thumbnail/1200x675/fec04ae6354182406de27bb5444d6c10/arch-manning-will-lee-texas-vs-texas-a-m.jpg",
    "tag": "Sports",
    "date": "2025-11-29T00:20:31.000Z",
    "description": "\n        No. 16 Texas plays host to No. 3 Texas A&M in a fierce rivalry game to end the regular season at Darrell K. Royal-Texas Memorial Stadium in A",
    "body": "\n        No. 16 Texas plays host to No. 3 Texas A&M in a fierce rivalry game to end the regular season at Darrell K. Royal-Texas Memorial Stadium in Austin on Friday. The Longhorns will be trying to keep their College Football Playoff hopes alive after moving to 8-3 after a dynamic victory against Arkansas. Texas A&M has blazed out to a historic 11-0 start for the first time since 1992. The last time the Aggies won 10 games was 2012, the year Johnny Manziel won the Heisman Trophy. In their most recent SEC game, Texas A&M overcame a 30-3 halftime deficit to shock South Carolina 31-30 to stay unbeaten and virtually clinch a spot in the College Football Playoff. Texas has not hosted this rivalry game since 2010, a 24-17 victory for Texas A&M. However, the Longhorns took down the Aggies 17-7 in the return of the rivalry last year at Kyle Field. Emotions will be high for the return to Austin. Where to watch Texas vs. Texas A&M liveDate: Friday, Nov. 28 | Time: 7:30 p.m. ETLocation: Darrell K Royal-Texas Memorial Stadium -- Austin, TexasTV: ABC | Live stream: Fubo (Try for free)\nFollow along for live updates, highlights and analysis as Texas and Texas A&M renew their longstanding rivalry.  Texas vs. Texas A&M: Need to know  Breakout pass rusher: Texas A&M lost multiple defensive linemen to the NFL last season. However, Cashius Howell has stepped up and emerged as one of the best in the sport. The former Bowling Green transfer was a rotation player last season, but has since emerged to lead the SEC with 11.5 sacks. Amazingly, he has recorded a sack in seven of his eight Power Four games. Against a Texas offensive line dealing with major issues, Howell can change the game. Resurgent Arch: Texas quarterback Arch Manning had a slow start to the year as he acclimated to the job of being QB1, but has found his footing in the second half of the year. Manning now has four straight games of completing more than 60% of his passes with 13 touchdowns to only two interceptions. Texas is 3-1 in those games. Against Arkansas, he became the first Texas QB to score touchdowns via pass, rush and receiving in one game. Texas A&M will be a substantially tougher challenge, but Manning is playing his best ball. \nStrength on weakness: Despite coming into the year with a highly-rated defense, Texas' secondary has been a major liability. In SEC play, the Longhorns rank last in the conference in passing defense, surrendering more than 295 yards per game. Over the last four games, they're giving up 325 passing yards per game. Texas A&M boasts the SEC's best receiving corps behind standouts Mario Craver and KC Concepcion. The Longhorns will have their hands full.   Texas vs. Texas A&M prediction, picks  From a matchup perspective, Texas A&M clearly has the upper hand. Their passing offense will gave Texas' defense fits. Top pass rusher Cashius Howell is a matchup nightmare against an inconsistent Longhorns offensive line. Even their special teams has created opportunities. But in a rivalry game of this magnitude, it will be a mental game above all. Mike Elko's squad has stepped up in the biggest moments, and they will do the same to clinch their first spot in the SEC Championship Game and finish 12-0. Pick: Texas A&M -2.5\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            A&M -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    Who will win and cover in each Week 14 college football rivalry game? Legendary Vegas expert Bruce Marshall is on a 38-29 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Texas vs. Texas A&M: TV channel, stream, odds, spread, prediction, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/3be4888b-cf8c-4661-86e5-9a08785fe827/thumbnail/1200x675/fec04ae6354182406de27bb5444d6c10/arch-manning-will-lee-texas-vs-texas-a-m.jpg"
      ],
      "datePublished": "2025-11-29T00:20:31.000Z",
      "dateModified": "2025-11-29T00:20:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lakers' NBA Cup court deemed 'unplayable' after Luka Dončić voices complaints - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/luka-doncic-lakers-nba-cup-court-clippers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/516cb1fd-fdf1-43ef-92a9-7afa5d1c0b60/thumbnail/1200x675/11925ebe94ed1f13069641852f0e2443/lakers-court-imagn.png",
    "tag": "Sports",
    "date": "2025-11-28T20:45:47.000Z",
    "description": "\n        Luka Dončić led the Lakers to a 135-118 win against the Clippers Tuesday night, finishing with 43 points, 13 assists and nine rebounds. Despi",
    "body": "\n        Luka Dončić led the Lakers to a 135-118 win against the Clippers Tuesday night, finishing with 43 points, 13 assists and nine rebounds. Despite the MVP-caliber night, Dončić made sure to note the safety hazard of the Lakers' neon yellow NBA Cup court, and asked for the league to change the courts altogether.\"Change the courts, please,\" Dončić said after the game. \"It's just slippery. It's dangerous. I slipped. I slipped a lot of times, and you could see a lot of players slipped. And that's dangerous, man.\"Later in the week, Dončić got his wish.The Lakers will not be using the yellow NBA Cup court in their group-stage finale on Friday. When L.A. hosts Anthony Davis and Dončić's former team, the Mavericks, the team will use a regular court. The Lakers' NBA Cup court was deemed \"unplayable\" by league court vendors, per ESPN, and was sent out for repairs.\nThis isn't the firs time Dončić has voiced concern about the NBA Cup courts. During the inaugural NBA Cup tournament in 2023 when he was still a member of the Mavericks, the All-Star guard called out the New Orleans Pelicans' court for being too slippery. Dončić said there were dead spots on the floor because of the court and that the Mavericks shouldn't have played on it because it wasn't stable.There is a difference between the Cup courts and the regular ones that are used for majority of the season. Because of the full-court designs and different colors, the entire court is essentially one big painted decal. On most of the Cup courts, there isn't a speck of wood grain showing through, which gives the players less traction when playing.Dončić noticed how slippery the court was during pregame warmups, and requested for it to be swept again. However, it didn't completely solve the problem.\nTraction problems aside though, Dončić clearly had no problem putting up massive numbers against the Clippers. He shot over 50% from the floor and 3-point range, though perhaps the reason he took 12 3-point attempts was because he didn't want to run the risk of slipping while trying to get to the basket. Either way, it didn't seem to impact his ability to put points on the board.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lakers' NBA Cup court deemed 'unplayable' after Luka Dončić voices complaints - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/516cb1fd-fdf1-43ef-92a9-7afa5d1c0b60/thumbnail/1200x675/11925ebe94ed1f13069641852f0e2443/lakers-court-imagn.png"
      ],
      "datePublished": "2025-11-28T20:45:47.000Z",
      "dateModified": "2025-11-28T20:45:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]