[
  {
    "title": "Eagles vs. Packers prediction, odds: 'Monday Night Football' computer picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-packers-prediction-odds-line-time-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/f473b37b-014b-4b74-8484-fe92e1045001/thumbnail/1200x675/2e0420b47f4891e7b7859b429bc3711e/jalen-hurts-philadelphia-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-10T23:45:20.000Z",
    "description": "\n        NFL Week 10 will conclude with Super Bowl contenders meeting on 'Monday Night Football' as the Philadelphia Eagles visit the Green Bay Packer",
    "body": "\n        NFL Week 10 will conclude with Super Bowl contenders meeting on 'Monday Night Football' as the Philadelphia Eagles visit the Green Bay Packers. These are two of the seven remaining NFL teams with just two losses, as both sit atop their respective NFC divisions. Philadelphia (6-2) is coming off a bye and knocked off the New York Giants, 38-20, in Week 8. Green Bay (5-2-1) had its three-game win streak come to an end on Sunday as the Pack fell to the Carolina Panthers 16-13. Packers receiver Matthew Golden (shoulder) is inactive. Kickoff is at 8:15 p.m. ET from Lambeau Field in Green Bay, Wis. Philadelphia has won the last three meetings, including a victory in last season's Wild Card round. The latest Packers vs. Eagles odds have Green Bay as the 1.5-point home favorite, while the over/under for total points scored is 45. Before making any Eagles vs. Packers picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 10 on a sizzling 47-29 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Green Bay vs. Philadelphia. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Eagles vs. Packers:Packers vs. Eagles  spreadPackers - 1.5 at DraftKings SportsbookPackers vs. Eagles         over/under45 pointsPackers vs. Eagles         money line Packers -109, Eagles -109Packers vs. Eagles         picksSee picks at SportsLinePackers vs. Eagles streaming Fubo (Try for free)Why the Eagles can coverPhilly has several things in its favor, starting with that it eliminated the Packers from last year's playoffs with a 22-10 victory in the Wild Card Round. The Eagles have won three straight versus Green Bay, and Philadelphia has a rest advantage in coming off a bye. The Eagles are 4-0 outright after a bye under coach Nick Sirianni, and 4-0 is also the team's record as an underdog since the start of last season.The Eagles had their best offensive performance in their last game, with season highs in points (38), total yards (427), passing touchdowns (4) and rushing yards (276). That came without the injured A.J. Brown, though he is expected to return on Monday. Philly's offense leads the NFL in two very important metrics -- it has the fewest giveaways in the league and it tops the league in redzone scoring. The former will be magnified by the fact that Green Bay has the fewest takeaways in 2025. See which team to back at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states:Why the Packers can coverComing off a loss as 13.5-point favorites versus Carolina is sure to motivate Green Bay on Monday, and it also has confidence in having the backing of Lambeau Field. The Packers have won six straight home games on Mondays, with an average margin of victory of +13.6 points over this streak. Additionally, they have an 18-6 all-time record versus the Eagles at home, including winning the last Lambeau meeting in 2020.Matt LaFleur has the best cover percentage (66%) by any head coach in primetime this century, going 23-12-1 against the spread. The 2025 Packers boast top-eight rankings in total yards, passing offense and third-down offense while the defense is also carrying its weight. Green Bay shuts down the pass, allowing the fewest yards per attempt and fewest yards per completion, while Micah Parsons and co. rank in the top 10 in pressure rate. That pass rush could cause problems for an Eagles offense that ranks 28th in third-down conversion percentage. See which team to back at SportsLine. Check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make Eagles vs. Packers picksFor Packers vs. Eagles on 'Monday Night Football,' the model is leaning Under the total, projecting 44 combined points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine.Who wins Eagles vs. Packers, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Packers vs. Eagles spread you need to jump, all from the model that is 47-29 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. Packers prediction, odds: 'Monday Night Football' computer picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/f473b37b-014b-4b74-8484-fe92e1045001/thumbnail/1200x675/2e0420b47f4891e7b7859b429bc3711e/jalen-hurts-philadelphia-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-11-10T23:45:20.000Z",
      "dateModified": "2025-11-10T23:45:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB betting scandal: Guardians pitchers Emmanuel Clase, Luis L. Ortiz indicted - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-betting-scandal-emmanuel-clase-luis-l-ortiz-pitch-rigging-doj-indictment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/62ad01b6-f670-4c35-a504-207693fef860/thumbnail/1200x675/d8519e06ac29b2e3d8cfc0b48a89914c/clase-getty.png",
    "tag": "Sports",
    "date": "2025-11-10T23:58:27.000Z",
    "description": "\n        Cleveland Guardians closer Emmanuel Clase and right-handed starter Luis L. Ortiz have been indicted on charges stemming from alleged gambling",
    "body": "\n        Cleveland Guardians closer Emmanuel Clase and right-handed starter Luis L. Ortiz have been indicted on charges stemming from alleged gambling misconduct -- specifically manipulating bets on individual pitches. The U.S. Attorney's Office for the Eastern District of New York announced the charges on Sunday and unsealed the indictment at the federal courthouse in Brooklyn. Ortiz has already been arrested in Boston, while Clase is not in custody. The Department of Justice has charged the pair with wire fraud conspiracy, honest services wire fraud conspiracy, conspiracy to influence sporting contests by bribery, and money laundering conspiracy. Ortiz made his first court appearance Monday and was released on $500,000 bond, according to The Athletic. He is restricted from traveling outside Boston, where he has a home, other than court appearances in New York or to meet his attorney in Cleveland. Ortiz was also ordered to surrender his passport.Clase's alleged actions date back to May of 2023, while Oritz's began in June of 2025. Furthermore, Clase's actions are alleged to have benefitted bettors by a sum of $700,000, while Ortiz's accrued to the benefit of co-conspiring gamblers by a sum of $60,000. Overall, bettors conspiring with the pair made at least $450,000 from betting platforms, prosecutors allege. Clase is alleged to have communicated with bettors via text messages during games. The pair could face up to 65 years in prison if convicted on all charges. The indictment reads: \n\"The charges in the indictment are allegations and the defendants are presumed innocent unless and until proven guilty.  If convicted, each defendant faces a maximum sentence of 20 years' imprisonment on the wire fraud conspiracy count, 20 years' imprisonment on the honest services wire fraud conspiracy count, five years' imprisonment on the conspiracy to influence sporting contests by bribery count, and 20 years' imprisonment on the money laundering conspiracy count.\"Clase, 27, was one of two Guardians pitchers placed on administrative leave over the summer while the league investigated potential misdoing. Ortiz was also placed on leave several weeks earlier. Both Clase and Ortiz had their leaves extended in late August through the rest of the 2025 regular season. \"MLB contacted federal law enforcement at the outset of its investigation and has fully cooperated throughout the process,\" the league said in a statement to ESPN. \"We are aware of the indictment and today's arrest, and our investigation is ongoing.\"The Guardians said they will \"continue to fully cooperate with both law enforcement and Major League Baseball as their investigations continue.\"\n        \n            \n                How can MLB address prop betting problem? Five possible solutions amid Guardians' gambling scandal\n                \n                    Matt Snyder                \n            \n                            \n    \n                \n                    \n    \nAccording to the Department of Justice, both pitchers \"agreed in advance with their co-conspirators to throw specific types of pitches and speeds of pitches.\" Said co-conspirators then allegedly used that inside information to place bets.\n\"In some instances, the defendants received bribes and kickback payments ... in exchange for rigging pitches,\" prosecutors wrote.The indictment chronicles specific instances in which the pitchers are alleged to have manipulated outcomes in collaboration with bettors: On or around May 19, 2023: Bettors allegedly made roughly $27,000 on a Clase pitch that was faster than 94.95 mph.On or around June 3, 2023: Bettors allegedly made roughly $38,000 on a Clase pitch that was slower than 94.95 mph and called a ball.On or around June 7, 2023: Bettors allegedly made roughly $68,000 on a Clase pitch that was slower than 94.95 and called a ball.On or around April 12, 2025: Bettors allegedly won $15,000 on a Clase pitch that was slower than 98.45 mph and called a ball. The next day, Clase is alleged to have asked one of the co-conspiring bettors to who won money on the April 12 pitch to \"send some of it to DR,\" seemingly referring to Clase's home country of the Dominican Republic, \"for repairs at the country house.\" April 26, 2025: Bettors allegedly won approximately $11,000 on a Clase pitch that was clocked slower than 97.95 mph. May 11, 2025: Bettors allegedly won approximately $11,000 on a Clase pitch that was called a ball.May 13, 2025: Bettors allegedly won approximately $3,500 on a Clase pitch that was a ball and was slower than 99.45 mph. May 17, 2025: This is one of the games in which Clase is alleged to have used his cell phone to coordinate with one or more bettors during the game. Bettors on this date are alleged to have won roughly $10,000 on a Clase pitch that was clocked slower then 97.95 mph and called a ball.On or about May 20, 2025: Clase is alleged to have directed a co-conspiring bettor to communicate with an associate, who subsequently directed the bettor to send $2,000 to an individual in the Dominican Republic. On or about May 28, 2025: Bettors wagered roughly $4,000 that a specific pitch by Clase would be a ball. The pitch did indeed appear to be out of the strike zone, but the batter swung and missed for a strike. The indictment reads: \"Approximately 20 minutes after Bettor-I lost the wager on May 28, 2025, Bettor-I sent a text message to the defendant EMMANUEL CLASE DE LA CRUZ-a .gif image of a man hanging himself with toilet paper. Even though the Cleveland Guardians won the game, approximately 10 minutes later, CLASE responded to Bettor-I with a .gif image of a sad puppy dog face.\"Ortiz is alleged to have joined Clase's scheme in June of 2025. Some of Ortiz's specific actions highlighted by the debate include: \nOn or about June 15, 2025: Ortiz is alleged to have agreed to throw his first pitch of the second inning for a ball in exchange for $5,000 from Clase. This made approximately $26,000 for two co-conspiring bettors. On or about June 27, 2025: Ortiz agreed to throw his first pitch of the third inning for a ball in exchange for approximately $7,000. Bettors are alleged to have made about $37,000 off the pitch. Ortiz has denied all allegations against him and claimed he \"has never, and would never, improperly influence a game -- not for anyone and not for anything.\"\"Luis is and always has been a fierce competitor. He has always given his best effort in every inning of every game. Those who have played with him know this. And the government's investigation, including discussions with Luis' teammates, supports this as well,\" his lawyer told CBS Sports in a statement. \"...There is no credible evidence Luis knowingly did anything other than try to win games, with every pitch and in every inning. Luis looks forward to fighting these charges in court. The government's case is weak and circumstantial. He will defend himself, and he will be prevail.\"Ortiz's lawyer also said that all payments and money transfers were \"for lawful activities.\"\n\"Emmanuel Clase has devoted his life to baseball and doing everything in his power to help his team win,\" the closer's attorney told CBS Sports in a statement. \"Emmanuel is innocent of all charges and looks forward to clearing his name in court.\"Clase, who did not pitch after July 26, appeared in 48 games prior to the deactivation. He had amassed a 3.23 ERA (130 ERA+) and a 3.92 strikeout-to-walk ratio. His contributions had been worth an estimated 0.7 Wins Above Replacement, according to Baseball Reference's calculations. Ortiz made 16 starts before his suspension, going 4-9 with a 4.36 ERA.\"Professional athletes, like Luis Leandro Ortiz and Emmanuel Clase de la Cruz hold a position of trust-not only with their teammates and their professional leagues, but with fans who believe in fair play,\" United States Attorney Joseph Nocella, Jr. said in a statement. \n\"As alleged, the defendants sold that trust to gamblers by fixing pitches.  In doing so, the defendants deprived the Cleveland Guardians and Major League Baseball of their honest services.  They defrauded the online betting platforms where the bets were placed.  And they betrayed America's pastime.  Integrity, honesty and fair play are part of the DNA of professional sports. When corruption infiltrates the sport, it brings disgrace not only to the participants but damages the public trust in an institution that is vital and dear to all of us.  Today's charges make clear that our Office will continue to vigorously prosecute those who corrupt sports through illegal means.\"As with all such proceedings, defendants are presumed innocent unless and until proven guilty. The indictment comes just weeks after Miami Heat guard Terry Rozier was arrested as part of an NBA betting scandal. Rozier and his co-conspirators allegedly obtained insider information about games, including which players were healthy and active, and passed it along to bettors. More than $200,000 in bets were placed on Rozier's \"under\" line across multiple prop bets during a March 23, 2023, game in which he left after playing less than 10 minutes. Damon Jones, a former NBA player, was also indicted and accused of passing along inside information, including about LeBron James.\nWhile sports gambling has been legalized across the country, MLB (and other leagues) have rules that prohibit certain behavior. MLB, for example, does not allow players to gamble on diamond sports, even of other teams. In 2024, MLB banned former San Diego Padres infielder Tucupita Marcano for life and suspended four other players -- Athletics righty Michael Kelly, Padres lefty Jay Groome, Philadelphia Phillies infielder José Rodriguez, and Arizona Diamondbacks lefty Andrew Saalfrank -- after they were discovered to have bet on baseball games not involving their teams.Back in May, commissioner Rob Manfred reinstated several of the most notorious gambling-related rule violaters in league history -- Pete Rose and several members of the 1919 Black Sox -- from MLB's permanently ineligible list on the grounds that the lifetime bans ended with the player's death. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB betting scandal: Guardians pitchers Emmanuel Clase, Luis L. Ortiz indicted - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/62ad01b6-f670-4c35-a504-207693fef860/thumbnail/1200x675/d8519e06ac29b2e3d8cfc0b48a89914c/clase-getty.png"
      ],
      "datePublished": "2025-11-10T23:58:27.000Z",
      "dateModified": "2025-11-10T23:58:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by betting Eagles-Packers, Bulls-Spurs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-get-300-bonus-bets-free-nba-league-pass-eagles-packers-bulls-spurs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg",
    "tag": "Sports",
    "date": "2025-11-10T23:47:22.000Z",
    "description": "\n        The Green Bay Packers and Philadelphia Eagles will square off on Monday Night Football to conclude Week 10 of the 2025 NFL season. It will be",
    "body": "\n        The Green Bay Packers and Philadelphia Eagles will square off on Monday Night Football to conclude Week 10 of the 2025 NFL season. It will be one of the most popular games of the entire week for online sports betting, and with the latest DraftKings promo code, new users can receive $300 in bonus bets and three free months of NBA League Pass. The SportsLine model projects the Packers to defend home field and exit MNF with a victory while covering as 1.5-point home favorites in its Monday best bets at DraftKings Sportsbook. The over/under for Eagles vs. Packers is 45 points. The model has also found value on the hardwood, projecting the Chicago Bulls to upset the San Antonio Spurs at +140. One of SportsLine's top experts also has a college basketball bet on Xavier vs. Santa Clara. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 10 on a sizzling 47-29 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Monday best bets at DraftKings SportsbookPackers (-1.5) vs. EaglesBulls to defeat the Spurs (+140)Santa Clara vs. Xavier: Under 157.5 pointsCombining the model's three picks into a Monday parlay at DraftKings would result in a payout of +816 (risk $100 to win $816). Bet it at DraftKings here:\nPackers (-1.5) vs. EaglesThe Packers have played up and down to their competition at times this season, and although that's delivered frustrating losses for Green Bay fans against the Panthers and Browns while defeating the Lions and the Commanders when they were healthier earlier in the season, there is no bigger opponent to play up for than the defending Super Bowl champions, especially when they play in your conference. The Green Bay defense has the tools to take away what Philadelphia does best also, with the second-best run defense at 89.4 yards allowed per game and the fewest passing yards per attempt (5.8) in the NFL. The model projects the Packers to win and cover in 54% of simulations. Back Green Bay at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Bulls to defeat the Spurs (+140)Chicago won six of its first seven games to open the new season, and although it has lost back-to-back contests, the Bulls return home, where they are 5-0 this season. Chicago has home victories over teams such as the Pistons, Knicks and 76ers, knocking off strong opponents on its home floor this year. Josh Giddey is nearly averaging a triple-double at 21.4 points, 9.6 rebounds and 9.3 assists per game this season. Those numbers increase to 23.6 points, 10.2 rebounds and 9.8 assists at home this season, as the model projects the Bulls to win in 52% of simulations, showcasing strong value at plus-money odds. Back Chicago at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:Santa Clara vs. Xavier: Under 157.5 points\"Herb Sendek has his Santa Clara shooting lots of three-balls as in recent seasons, but it remains to be seen if he has similar marksmen on the roster,\" legendary SportsLine expert Bruce Marshall said. \"In Friday's 79-67 win over McNeese, the Broncos hit 12 of 31 triples, though it took 5 of 8 from Villanova transfer guard Sash Gavalyugov to up the percentage. While SCU's not quite a well-oiled machine yet, Xavier surely isn't for its new HC Richard Pitino (whose dad Rick once had Sendek on his staff). It might be asking a lot of these two sides to ramp up the scoreline.\" Back the Under at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass:\nWant more Monday Night Football, NBA, college basketball picks?You've seen some of the model's Monday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets, free NBA League Pass by betting Eagles-Packers, Bulls-Spurs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/24bb0297-f888-4ead-b936-3dd676583f0c/thumbnail/1200x675/ee1f25d18837a4ef85a50954575d087e/new-draftkings-promo-image-nba.jpg"
      ],
      "datePublished": "2025-11-10T23:47:22.000Z",
      "dateModified": "2025-11-10T23:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northern Illinois vs. UMass odds, picks, Wednesday MACtion best bets from model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/northern-illinois-umass-prediction-odds-picks-week-12-maction-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/f65c673a-1918-42f5-9587-ef412119ac78/thumbnail/1200x675/eef0967ba770886101585cf604a26b4d/josh-holst-niu.jpg",
    "tag": "Sports",
    "date": "2025-11-11T12:20:38.000Z",
    "description": "\n        The penultimate Wednesday of MACtion includes the UMass Minutemen hosting the Northern Illinois Huskies. Massachusetts (0-9, 0-5 MAC) is the ",
    "body": "\n        The penultimate Wednesday of MACtion includes the UMass Minutemen hosting the Northern Illinois Huskies. Massachusetts (0-9, 0-5 MAC) is the lone winless team left in FBS and is coming off a 44-10 defeat to Akron last Tuesday. NIU (2-7, 1-4 MAC) suffered a Nov. 5 loss to Toledo, 42-3, to secure a losing record this year after back-to-back seasons with winning records and bowl victories. Northern Illinois has won all three prior matchups.Kickoff is at 7 p.m. ET from Warren McGuirk Alumni Stadium in Amherst, Mass. NIU prevailed in the last meeting in 2024, taking the home contest, 34-20. The Huskies are 10.5-point favorites in the latest Northern Illinois vs. UMass odds, while the over/under for total points scored is 43.5. Before making any UMass vs. Northern Illinois picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on UMass vs. Northern Illinois. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for NIU vs. Massachusetts:UMass vs. Northern Illinois spreadNIU -10.5 at DraftKings SportsbookUMass vs. Northern Illinois                                    over/under43.5 pointsUMass vs. Northern Illinois                                                                                                                                                     money line NIU -441, UMass +338UMass vs. Northern Illinois                                                                                                                                             picksSee picks at SportsLineUMass vs. Northern Illinois                                                                                                                                               streaming Fubo (Try for free)  How to make Northern Illinois vs. UMass picksSportsLine's model has simulated Massachusetts vs. NIU 10,000 times and is going Over 43.5 total points. The last two NIU road games have hit the Over as the average point total in those games was 57 points. For UMass, it has seen three straight contests go over as both squads are projected to eclipse their season averages in scoring by at least five points.The teams combine for 48 points as the Over hits in almost 60% of simulations.The model also says one side of the spread hits nearly 60% of the time. You can only get the pick at SportsLine.   So who wins UMass vs. Northern Illinois, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Northern Illinois vs. UMass spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northern Illinois vs. UMass odds, picks, Wednesday MACtion best bets from model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/f65c673a-1918-42f5-9587-ef412119ac78/thumbnail/1200x675/eef0967ba770886101585cf604a26b4d/josh-holst-niu.jpg"
      ],
      "datePublished": "2025-11-11T12:20:38.000Z",
      "dateModified": "2025-11-11T12:20:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zay Jones injury updates: Cardinals WR out for rest of season with torn Achilles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/zay-jones-injury-updates-cardinals-receiver-out-for-remainder-of-season-with-torn-achilles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/8b8954a3-7e45-4506-8419-0881d4713390/thumbnail/1200x675/d9610068f06d3e886d8f884bfa75d9bf/zay-jones-cardinals.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:40:44.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cardinals wide receiver Zay Jones suffered a torn ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Cardinals wide receiver Zay Jones suffered a torn Achilles Sunday against the Seahawks when he turned to complain to an official about not getting a call in his favor. The injury will sideline him for the remainder of the season, coach Jonathan Gannon said Monday. Jones appeared to take a few steps after getting hurt, just before going down to the turf. Medical personnel helped him off the field, and the team ruled him out shortly thereafter.\nSeveral telltale signs of a torn Achilles were present: Jones looked down at the back of his leg as if someone had kicked him, and slow-motion replays showed a clear \"pop\" in his calf.The Cardinals were already down by 35 points in an eventual 44-22 loss when the Jones injury occurred, making the injury yet another brutal turn of events in what had already been a disastrous afternoon for Arizona.\n        \n            \n                NFL QB carousel already spinning: Kyler Murray's future, Jets' next move and more\n                \n                    Jonathan Jones                \n            \n                            \n    \n                \n                    \n    \nJones, 30, has dealt with several injuries throughout his NFL career, including multiple shoulder ailments, knee and hamstring issues and a concussion. This is his second season with Arizona; he has also spent time with the Bills (who drafted him in the second round in 2017), Raiders and Jaguars.\nThe Cardinals have dealt with several injuries this season; starting quarterback Kyler Murray (foot) has not played in over a month and was recently placed on IR. James Conner was lost for the season early in the year, and backup Trey Benson got injured shortly after that. Starting cornerbacks Will Johnson and Max Melton were also out against the Seahawks.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zay Jones injury updates: Cardinals WR out for rest of season with torn Achilles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/8b8954a3-7e45-4506-8419-0881d4713390/thumbnail/1200x675/d9610068f06d3e886d8f884bfa75d9bf/zay-jones-cardinals.jpg"
      ],
      "datePublished": "2025-11-11T00:40:44.000Z",
      "dateModified": "2025-11-11T00:40:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football fights fallout: 40 players suspended after weekend brawls - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-fights-fallout-40-players-suspended-two-programs-end-seasons-after-multiple-weekend-brawls/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/5290c0c5-0dae-428f-bd6b-be3c25d7d81f/thumbnail/1200x675/2d1ff181f4de3d03591d962dc996dbee/grambling-state-football-helmet.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:03:25.000Z",
    "description": "\n        Tempers erupted in college football this past weekend, igniting on-field brawls and postgame confrontations that led to numerous player suspe",
    "body": "\n        Tempers erupted in college football this past weekend, igniting on-field brawls and postgame confrontations that led to numerous player suspensions, institutional fines and a season-ending decision at the Division III level.The SWAC announced disciplinary actions Monday following a halftime altercation between Bethune-Cookman and Grambling State on Saturday. Video footage captured players from both teams exchanging punches and being thrown along the benches as coaching staff struggled to restore order.\"We're extremely disappointed by the events that transpired during halftime of the Bethune-Cookman at Grambling State football game,\" SWAC commissioner Dr. Charles McClelland said in a release. \"Acts of that nature have zero place in the Southwestern Athletic Conference and intercollegiate athletics. The Conference Office has and will continue to enforce a zero-tolerance policy for all acts deemed to be unsportsmanlike and contrary to the high standard of good sportsmanship we expect from all individuals associated with the athletics programs within our league.\"A total of 27 players -- nine from Bethune-Cookman and 18 from Grambling State -- were suspended, with three receiving two-game suspensions for particularly severe conduct. However, specific names were not given. Additionally, fines of $25,000 and $40,000 were levied against Bethune-Cookman and Grambling State, respectively.\nGrambling State coach Mickey Joseph defended his players after the 31-23 win, suggesting that Bethune-Cookman's delayed exit from the locker room contributed to the escalation.\"That's the disrespect stuff,\" Joseph said, via KNOE-TV's Clay Witt. \"We're not going to tolerate disrespect here at Grambling. You won't disrespect us. We're going to meet disrespect with disrespect.\"On Monday, Joseph clarified in a prepared statement that his comments were not meant to condone violence.\nTexas State-Louisiana postgame scuffle results in 13 player suspensionsThe Sun Belt handed down several suspensions after a postgame confrontation following Louisiana's 42-39 win against Texas State. The conflict began during the final offensive plays and intensified as players and coaches gathered for postgame handshakes, ultimately spilling into the stadium tunnel.\nTexas State had six players suspended, including defensive end Tymere Jackson for two games. Louisiana suspended seven players, with safety Tyree Skipper sidelined for the remainder of the season, including any potential bowl game.Louisiana suspensions:Tyree Skipper*, safety (remainder of the 2025 season including any potential bowl game)Kaliep Edwards, linebacker (1 game)Courtline Flowers*, safety (1 game)Kody Jackson, safety (1 game)Collin Jacob, safety (1 game)De'Antonio Lesueur, defensive lineman (1 game)Evan Stroman, wide receiver (1 game)Texas State suspensions:Tymere Jackson*, defensive end (2 games)Khamari Terrell*, cornerback (1 game)Justin DeLeon*, offensive line (1 game)Kyran Bourda, defensive line (1 game)J.P. Deeter, defensive line (1 game)Devarrick Woods, defensive line (1 game)* denotes starterThe altercation has left both programs dealing with fallout from the incident while trying to chase bowl eligibility in the final weeks of the season.\n\"We got some preliminary stuff that we're trying to sort through, trying to appeal some of them,\" Louisiana coach Michael Desormeaux said Monday. \"I just think it's really hard. I mean you get attacked and I don't know how you're supposed to respond. I don't understand how this wasn't cleared up before once it broke the first time I don't understand how we didn't get people off the field. I just don't understand how this happened.\"Louisiana's next game is scheduled at Arkansas State on Nov. 20, while Texas State travels to Southern Mississippi on Saturday.ODAC ends Guilford, Averett seasons after postgame altercationAt the Division III level, the Old Dominion Athletic Conference (ODAC) made the unprecedented decision to end the football seasons of Guilford College and Averett University following a postgame altercation this past Saturday. Both schools will forfeit their remaining game, with opponents Bridgewater College and Roanoke College having the opportunity to play against each other to complete their season.\n\"While competition is at the heart of what we do, the integrity with which we compete defines who we are,\" ODAC commissioner Brad Bankston said in a release. \"The actions following Saturday's contest did not reflect those values, and this decision underscores our commitment to maintaining the standards our conference represents. I want to thank both schools for their cooperation and open dialogue in reaching this decision.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football fights fallout: 40 players suspended after weekend brawls - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/5290c0c5-0dae-428f-bd6b-be3c25d7d81f/thumbnail/1200x675/2d1ff181f4de3d03591d962dc996dbee/grambling-state-football-helmet.jpg"
      ],
      "datePublished": "2025-11-11T00:03:25.000Z",
      "dateModified": "2025-11-11T00:03:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants fire Brian Daboll: Ranking 10 coaching candidates who could land NY job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-coaching-candidates-to-replace-fired-brian-daboll/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/70bdb346-a1ad-4b9f-873b-ca77462da409/thumbnail/1200x675/fc469d802d798cc33cae54411ca76b92/template-pic.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:23:40.000Z",
    "description": "\n        The New York Giants are in the market for a coach. On Monday, the club fired Brian Daboll after four seasons on the job, and in the wake of t",
    "body": "\n        The New York Giants are in the market for a coach. On Monday, the club fired Brian Daboll after four seasons on the job, and in the wake of the team dropping to 2-8 with yet another blown fourth-quarter lead in Week 10 vs. Chicago. Daboll departs with a 20-40-1 record in the regular season, and now one of the most coveted positions in the entire league is up for grabs. Not only is the head coach position for the New York Giants attractive because it's a storied franchise in a major market, but the club has plenty of budding stars throughout the roster. Most notably, this job comes with a ready-made quarterback in Jaxson Dart, who has flashed his potential as a franchise cornerstone throughout the first-rounder's rookie season. On top of Dart, the defense has stellar figures up front in pass rushers Brian Burns, Abdul Carter and Kayvon Thibodeaux, along with defensive tackle Dexter Lawrence. While they may not be healthy at the moment, wide receiver Malik Nabers and running back Cam Skattebo are two other building blocks on offense. With all that in mind, there's plenty to like about this newest opening in the NFL. But what are the Giants looking for? What sort of candidate are they hoping to fetch as they start to think about the post-Daboll era? Who will GM Joe Schoen pursue? There will certainly be no shortage of candidates, so we cast a wide net, collected up 10 notable names who could be in the running, and rank them based on who New York should prioritize. Note: For the sake of discussing external options, we'll put interim head coach Mike Kafka off to the side. \n10. Bill BelichickCurrent role: Head coach, University of North Carolina.Belichick's name will come up quite a bit throughout this search. The legendary head coach has close ties to the Mara family, and his link to the organization is well-documented. Belichick was on the Giants coaching staff beginning in 1979 and through the 1990 season, by that time elevating to defensive coordinator. Belichick was a key figure for two Super Bowl championships with New York. Currently, he's been trying his hand at coaching at the collegiate level at UNC, and it has been a turbulent tenure despite back-to-back wins. He has just a $1 million buyout, so an avenue back into the NFL is realistic from that standpoint, and it'd be hard to imagine that he wouldn't have interest in the job. That said, is New York looking for someone like Belichick at this stage of his career? He'll be 74 years old in April, so this wouldn't be looked at as a long-term fix.  9. Steve SpagnuoloCurrent role: Defensive coordinator, Kansas City ChiefsAnother familiar face for New York is Spagnuolo. Already, he has two stints with the Giants under his belt, including back in 2017 when he served as the interim head coach. Since leaving New York, Spagnuolo has been working under Andy Reid as the defensive coordinator for the Chiefs, helping that organization to three Super Bowl titles. In that time, he's been lauded as one of, if not the best defensive coordinators in the league. The prospect of him coaching up the likes of Burns and Carter does have the upside of being one of the more fearsome front sevens in the NFL. 8. Jeff HafleyCurrent role: Defensive coordinator, Green Bay PackersHafley has spent the last two seasons as the defensive coordinator with the Packers under Matt LaFleur. While he doesn't have prior NFL head coaching experience, the Montvale native was the head coach at Boston College from 2020 through the 2023 season. With that in mind, he wouldn't be coming into this role entirely green. The 46-year-old had Green Bay as a top five defense in fewest yards in 2024, and sixth in the league in points allowed. Entering Week 10, the Packers defense is once again top 10 in the league in both categories. \n7. Joe BradyCurrent role: Offensive coordinator, Buffalo BillsBrady has been a hot head coaching candidate for the last couple of years. While he comes from the offensive side, which could be attractive for a team with a young quarterback, it might be a hard pill to swallow for the Giants, particularly after just firing Daboll. Are they really going to hire another former offensive coordinator from the Buffalo Bills? It shouldn't matter, and the 36-year-old could be a youthful injection that the organization needs, but it may not be realistic, despite helping coach up Josh Allen to an MVP level in 2024. 6. Lincoln RileyCurrent role: Head coach, University of Southern CaliforniaThis one is a bit of a wild card, but why not get a little crazy? This is the type of job that coaches from all across the nation are going to be paying attention to, and may be willing to push their chips into the middle for. Riley hasn't been shy of making big career moves in the past, leaving Oklahoma after the 2021 season for USC. He currently has the Trojans in the mix for a spot in the College Football Playoff, which has only grown his stock, but Riley has recently stated he's \"where I need to be.\" Still, if New York shows interest, it'd be silly for Riley not to hear them out. \n        \n            \n                Who is Mike Kafka? A look at the new Giants interim coach following Brian Daboll's firing\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \n5. Robert SalehCurrent role: Defensive coordinator, San Francisco 49ersSaleh is known to Giants fans for his lackluster tenure with the Jets, but the current Niners DC will likely be a hot candidate once again. His biggest demise in New York was the Jets' failure to land a quarterback, which wouldn't be a problem here with Dart. Speaking of Dart, Saleh recently just gushed over the Giants rookie leading up to their Week 9 matchup, calling him \"uber-talented.\" As ESPN's Jordan Raanan noted, Saleh also met up with Dart after the game, so there is clearly some interest on the part of Saleh. He may also be the type of head coach who is better the second time around, especially if he can attach himself with a capable offensive coordinator. Maybe former Niners coordinator and current Dolphins head coach Mike McDaniel, if he is let go by Miami? Would be an interesting combo. \n4. Jesse MinterCurrent role: Defensive coordinator, Los Angeles ChargersMinter may not be a household name, but he's going to be one of the more sought-after candidates over the next few hiring cycles. Minter comes from the Jim Harbaugh coaching tree, working under him at the University of Michigan as his defensive coordinator before following him to the NFL and serving in the same role with the Chargers. The 42-year-old has coached up top 10 defenses throughout his first two years in the NFL. Last season, L.A. was No. 1 in the NFL in points allowed. Through Week 10 this season, the club is No. 7 in points allowed and No. 4 in total yards allowed. He'd do wonders with Burns, Carter, and Lawrence, thus making life much easier for Dart and the offense. 3. Kliff KingsburyCurrent role: Offensive coordinator, Washington CommandersThe Giants have seen firsthand what Kingsbury can do with a mobile quarterback, helping Jayden Daniels burst onto the scene as a rookie and catapult Washington to the NFC Championship last season. The 2025 campaign has been more trying for the Commanders, largely due to Daniels and Terry McLaurin both dealing with injuries. That said, Kingsbury is an intriguing fit and has prior head coaching experience, which includes an 11-6 season in 2021 on his résumé with the Arizona Cardinals. Given that his expertise comes from the offensive side of the ball, that could be attractive for New York, who'd likely want a consistent voice in Dart's ear throughout his development, which they may not get with a defensive-minded coach who has to hire an OC. 2. Klint Kubiak Current role: Offensive coordinator, Seattle SeahawksKubiak had the New Orleans Saints offense rolling for a minute in 2024, but the lack of talent ultimately slowed the unit down. However, talent isn't a problem in Seattle, where the offensive coordinator has been helping the Seahawks take the NFC by storm. They've powered to a 7-2 record with the No. 3-ranked scoring offense and are also No. 9 overall in total yards. Under Kubiak, Sam Darnold is averaging 9.9 yards per pass attempt while Jaxon Smith-Njigba is currently leading the NFL in receiving yards. It's scary to think what he'd be able to do with Dart and a healthy Nabers as a QB-WR combo. \n1. Lane KiffinCurrent role: Head coach, Ole MissIt should be noted that this doesn't sound like it's a realistic option, as Kiffin told Dart's father, Brandon, as much. That said, you have to make the call if you're Joe Schoen. Kiffin coached Dart at Ole Miss and helped develop him into the quarterback that New York drafted No. 25 overall. The two reportedly have remained close, so it would seem like an ideal fit to pair your young quarterback with someone who not only has in-depth knowledge of the player but is a fantastic head coach to boot. Kiffin has Ole Miss in contention for the College Football Playoff, and could be targeted by other high-profile collegiate programs once the season is over. If Kiffin feels like a different challenge and wants to get back into the NFL (he was the head coach of the Raiders from 2007 to 2008), the Giants with Dart present quite an opportunity. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants fire Brian Daboll: Ranking 10 coaching candidates who could land NY job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/70bdb346-a1ad-4b9f-873b-ca77462da409/thumbnail/1200x675/fc469d802d798cc33cae54411ca76b92/template-pic.jpg"
      ],
      "datePublished": "2025-11-11T00:23:40.000Z",
      "dateModified": "2025-11-11T00:23:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jedd Fisch speaks on 'ridiculousness' of coaching carousel as Florida job opens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/jedd-fisch-doubles-down-on-ridiculousness-of-college-football-coaching-carousel-after-florida-job-opens/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/7a406b27-3407-4710-a0e5-a828720e7846/thumbnail/1200x675/449776331b156771264f13a3cbd291f8/gettyimages-2243841465-1.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:22:52.000Z",
    "description": "\n        The work Jedd Fisch accomplished in his first two seasons at Washington, and his propensity to move from one job to another, made him a popul",
    "body": "\n        The work Jedd Fisch accomplished in his first two seasons at Washington, and his propensity to move from one job to another, made him a popular name on the 2025 college football coaching carousel. His alma mater, Florida, is in search of a new coach, which only adds to the speculation that he could bolt from Seattle early in his tenure. Fisch was vocal about his status with the Huskies amid the numerous ongoing coaching searches across the country.While he did not explicitly state his disinterest in other jobs, Fisch made it clear in a lengthy statement that he very much enjoys his position at Washington.\"Those lists are made by people that have no idea what's going on, honestly,\" Fisch said Monday of those speculating about his future. \"They don't know what's happening in our program. They have no idea how excited I am about the youth in our program. They have no idea how excited I am about the fact that we're playing six or seven true freshmen. No idea how excited I am about the fact that Demond Williams, I believe, has a chance over the next year or two years after this to be one of the all-time best quarterbacks that have come through this area.\"If Fisch were to leave Washington after just two seasons, Florida would be the obvious destination. Fisch graduated from Florida in 1998 and landed a job on Steve Spurrier's staff in 1999 as a graduate assistant, making his college coaching debut with the Gators. His ties to the university are deep and provide fuel to the intrigue of a potential return to the Sunshine State.\n\"I don't think that they would know how I enjoy coaching here, that we've spent a ton of money into building this program the way we want to build it, that I had a great hand in all the facilities,\" Fisch said. \"I was a big part of making the decisions on how we wanted to recreate this space to give our players an unbelievable opportunity to have a recovery room that they never had, working on making sure that they have the best nutrition they could possibly have, give them great new meeting rooms, new office spaces for our coaches.\"Beyond Florida, Fisch could be an attractive candidate for a number of the other open jobs across the nation. He has spent time in effectively every region of the country throughout his college and NFL coaching careers, and after resurrecting the Arizona program in short order and positioning Washington for College Football Playoff contention in Year 2, his limited track record as a head coach speaks for itself.\"I think, unfortunately, what happens is they just want to tie coaches to lists,\" Fisch said, \"and then we have to sit there and defend it rather than just be able to just tell our fans -- our players, our coaching staff, myself, my family, we love coaching at the University of Washington.\n\"The ridiculousness of people that want to claim that because my wife and daughters are living in Arizona, because I have a 16-year-old who's been in five different schools in the last eight years to finish her high school, has anything to do with my decision. Or the ridiculousness of just putting my name on a list just to do it. Not only does that affect recruiting, it affects our team, it affects our staff. My hope is that our players, our coaches, our families understand how much we love it at Washington.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jedd Fisch speaks on 'ridiculousness' of coaching carousel as Florida job opens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/7a406b27-3407-4710-a0e5-a828720e7846/thumbnail/1200x675/449776331b156771264f13a3cbd291f8/gettyimages-2243841465-1.jpg"
      ],
      "datePublished": "2025-11-11T00:22:52.000Z",
      "dateModified": "2025-11-11T00:22:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lane Kiffin lays out criteria for good coaching job amid Florida speculation - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lane-kiffin-lays-out-criteria-for-quality-coaching-job-says-blue-bloods-still-have-inherent-advantages/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/6a60d04c-ee2a-42d8-a51a-5aaf3951787e/thumbnail/1200x675/f2b41e832f5056bce00b8b7ef666cf12/gettyimages-2244520146-2.jpg",
    "tag": "Sports",
    "date": "2025-11-11T00:13:13.000Z",
    "description": "\n        Lane Kiffin is the hottest name on the college football coaching carousel. If he wants to leave Ole Miss, Kiffin will get to pick between som",
    "body": "\n        Lane Kiffin is the hottest name on the college football coaching carousel. If he wants to leave Ole Miss, Kiffin will get to pick between some of the top programs in the country, and he already has a checklist for what makes a great job.Rumored to be the top priority for Florida's vacancy, Kiffin was asked about what makes a \"good\" college coaching job at his Monday press conference, just days before the Gators roll into Oxford.In a lengthy answer, the sixth-year Rebels coach said the days of worrying about \"facilities\" or \"practice fields\" are long gone. NIL and revenue sharing have changed the college football landscape, and Kiffin said as much, drawing comparisons to \"baseball and the payrolls.\" Those with the most money win more often than not.However, even in the era of teams firing money cannons at the transfer portal and high school recruiting, Kiffin admitted that the \"blue blood\" programs still have inherent advantages over everyone else.\"People will say it's narrowed, and some stuff has narrowed because you can't stockpile [talent] at those blue bloods, or however you want to refer to it,\" Kiffin said. \"But there are still things where you're gonna struggle to beat those guys because kids get recruited, and they see the size of stadiums, traditions, Heismans and national championships. Then your location to talent. I think all of those are in there.\"\nFlorida just happens to be one of the few programs that checks all of those boxes. The Swamp seats just shy of 89,000 fans, the Gators have three national championships and three Heisman Trophy winners, and Florida is one of the most talent-rich football states in the country.Now, there are other schools that meet those criteria as well, including an LSU team in the midst of its own coaching search. Alabama, Texas and Ohio State all fit the bill when discussing those blue bloods.Does that mean Kiffin would immediately jump ship for those jobs if they came open tomorrow? Not necessarily, but by Kiffin's own admission, those programs have a leg up on others. If he wants to coach with those advantages on his side, Florida would certainly be a fit.\nFor the moment, though, Kiffin's focus is on defeating the Gators. With Ole Miss at 8-1 and No. 6 in the initial College Football Playoff rankings, the first playoff berth of Kiffin's tenure in Oxford is well within reach.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lane Kiffin lays out criteria for good coaching job amid Florida speculation - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/6a60d04c-ee2a-42d8-a51a-5aaf3951787e/thumbnail/1200x675/f2b41e832f5056bce00b8b7ef666cf12/gettyimages-2244520146-2.jpg"
      ],
      "datePublished": "2025-11-11T00:13:13.000Z",
      "dateModified": "2025-11-11T00:13:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 11 Power Rankings: Drake Maye has Patriots a year ahead of schedule - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-10-power-rankings-patriots-drake-maye/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/2a71a6d7-9341-4077-ae43-62b127b644ea/thumbnail/1200x675/bcd7bf669e36a4d96bed1edc78e2aa30/drake-maye.jpg",
    "tag": "Sports",
    "date": "2025-11-11T10:00:41.000Z",
    "description": "\n\n\n    \n                                    Pete Prisco shares his Power Rankings heading into Week 11, including the Bills falling out of the top 5\n ",
    "body": "\n\n\n    \n                                    Pete Prisco shares his Power Rankings heading into Week 11, including the Bills falling out of the top 5\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 11, 2025\n                            \n                    at\n    5:00 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Kim O'Reilly, CBS Sports\n            \n            \n    \n        I'll be honest: I thought the New England Patriots were a year away.With Mike Vrabel taking over as coach and Drake Maye entering his second season, coupled with a lot of money being spent in free agency to bolster the roster, I thought the Patriots would be a feisty team that could win eight or nine games this season.Now look. The Patriots lead the AFC East by 1½ games over the Buffalo Bills and have ripped off seven straight victories, including an impressive road victory over the Tampa Bay Buccaneers on Sunday.The Patriots are getting MVP-like play from Maye, coupled with a defense that is stout against the run and sticky in coverage on the back end.The Jerod Mayo mini era sure seems like a long time ago. Credit goes to owner Robert Kraft for making the decision to fire Mayo with a chance to hire Vrabel. He brings a discipline and a toughness to the team that shows up on Sundays.\nWhen you add in a franchise quarterback like Maye, a player who seems to have an aw-shucks personality to go with his killer style on the field, the results are not an accident.\nThe Tampa Bay game was a prove-it game of sorts for the Patriots, and they passed with flying colors. Maye was good again, aside from a horrible end-zone interception, and the defense made life tough on the Bucs offense. It helps they have outstanding cover players in Christian Gonzalez and Carlton Davis at cornerback.The Patriots' revamped defense had six players who signed as free agents last spring who started against the Bucs. Vrabel has done a great job bringing that group together.\nNew England is up to third in my Power Rankings this week, right behind the Seattle Seahawks and the Los Angeles Rams. Expect the Patriots to be near the top for at least a month.Their next three games are home against the Jets, on the road at Cincinnati and home against the Giants before a bye. A 10-game winning streak is a real possibility. After the bye, they have the rematch with the Bills, who they beat earlier in the year.Forget about the division title. With their schedule, they have a real shot to be the top seed in the AFC. That would mean the playoffs would go through Foxborough.\nWho in the name of Bill Belichick saw that coming?\n        Biggest Movers\n    \n                4\n            \n                Lions\n            \n                6\n            \n                Bills\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Seahawks\n                                \n                            Sam Darnold didn't even have to do much against Arizona because the defense was so dominant. That front is nasty and will need to show up big against the Rams this week.\n                        \n                            2\n                        \n                            7-2-0\n                        \n                                2\n                            \n                                    Rams\n                                \n                            Matthew Stafford is lighting up defenses as the Rams ready to face the Seahawks on Sunday. Their defensive front also has game-wrecking ability.\n                        \n                            2\n                        \n                            7-2-0\n                        \n                                3\n                            \n                                    Patriots\n                                \n                            Drake Maye for MVP. It's possible. The schedule gets really soft the next three weeks to help bolster his chances.\n                        \n                            2\n                        \n                            8-2-0\n                        \n                                4\n                            \n                                    Eagles\n                                \n                            The defense came up big against the Packers, but the offense has to get it going. But winning on the road against good teams is tough to do.\n                        \n                            2\n                        \n                            7-2-0\n                        \n                                5\n                            \n                                    Colts\n                                \n                            Give the ball to Jonathan Taylor. They got back to what they should always be doing, and it paid off big against the Falcons.\n                        \n                            2\n                        \n                            8-2-0\n                        \n                                6\n                            \n                                    Buccaneers\n                                \n                            Despite the loss to the Patriots, they have a hammer-lock on the division. But the idea of getting the No. 1 seed is probably fading away.\n                        \n                            5\n                        \n                            6-3-0\n                        \n                                7\n                            \n                                    Lions\n                                \n                            Dan Campbell took over as the play-caller and the offense came to life. Of course, they did it against air, otherwise known as the Commanders defense. But it was impressive.\n                        \n                            4\n                        \n                            6-3-0\n                        \n                                8\n                            \n                                    Bills\n                                \n                            The letdown after beating the Chiefs turned into a disaster in Miami. If you can't stop the run, and they can't, you can't win a Super Bowl. That has to be fixed.\n                        \n                            6\n                        \n                            6-3-0\n                        \n                                9\n                            \n                                    Broncos\n                                \n                            Where is the offense? Bo Nix just isn't playing well right now. It's up to Sean Payton to fix him.\n                        \n                            1\n                        \n                            8-2-0\n                        \n                                10\n                            \n                                    Chiefs\n                                \n                            They come off their bye with a big division road game at Denver. They can't afford to lose another one, or else their playoff chances could be in real jeopardy.\n                        \n                            --\n                        \n                            5-4-0\n                        \n                                11\n                            \n                                    Packers\n                                \n                            Where is the offense? The past two weeks, it just hasn't been good enough. The injuries to the weapons are really impacting the passing game.\n                        \n                            2\n                        \n                            5-3-1\n                        \n                                12\n                            \n                                    Chargers\n                                \n                            The defense showed up in a big way against the Steelers. With the offensive line an issue now with injuries, they might need a lot more of that down the stretch.\n                        \n                            --\n                        \n                            7-3-0\n                        \n                                13\n                            \n                                    Bears\n                                \n                            Coming back to beat the Giants was a good look for Caleb Williams. They are in the thick of the playoff race.\n                        \n                            3\n                        \n                            6-3-0\n                        \n                                14\n                            \n                                    Ravens\n                                \n                            They have righted things in a hurry and have a soft schedule coming up. The division could be theirs after a slow start.\n                        \n                            4\n                        \n                            4-5-0\n                        \n                                15\n                            \n                                    Vikings\n                                \n                            The J.J. McCarthy situation is becoming worrisome for this team. Do you think they wish they had Sam Darnold back?\n                        \n                            2\n                        \n                            4-5-0\n                        \n                                16\n                            \n                                    49ers\n                                \n                            The injuries to the defense proved to be too much to overcome in the loss to the Rams. Matthew Stafford carved them to shreds.\n                        \n                            1\n                        \n                            6-4-0\n                        \n                                17\n                            \n                                    Steelers\n                                \n                            For a bit, the offense was good and the defense was awful. Now the defense is better and the offense did nothing against the Chargers. The Ravens are coming fast too.\n                        \n                            --\n                        \n                            5-4-0\n                        \n                                18\n                            \n                                    Texans\n                                \n                            Davis Mills saved their season against the Jaguars. Who saw that coming? They are still alive for a playoff spot.\n                        \n                            2\n                        \n                            4-5-0\n                        \n                                19\n                            \n                                    Jaguars\n                                \n                            Blowing a 19-point fourth-quarter lead to Davis Mills has to sting for this group. The defense cost them this one, but the offense doesn't do enough.\n                        \n                            5\n                        \n                            5-4-0\n                        \n                                20\n                            \n                                    Panthers\n                                \n                            Just when we think they are ready to compete for a playoff spot, they lay an egg like they did against the Saints. Bryce Young needs to pick it up.\n                        \n                            1\n                        \n                            5-5-0\n                        \n                                21\n                            \n                                    Falcons\n                                \n                            They are sinking fast. The run defense was terrible against the Colts, which can't happen against a back like Jonathan Taylor.\n                        \n                            --\n                        \n                            3-6-0\n                        \n                                22\n                            \n                                    Cardinals\n                                \n                            The Jacoby Brissett hype train derailed in Seattle, but with Kyler Murray hurt, it's still his team. The line didn't help him much either.\n                        \n                            --\n                        \n                            3-6-0\n                        \n                                23\n                            \n                                    Commanders\n                                \n                            Even if Jayden Daniels had played against the Lions, it wouldn't have mattered. The defense is awful. They are done.\n                        \n                            --\n                        \n                            3-7-0\n                        \n                                24\n                            \n                                    Raiders\n                                \n                            The offense is a mess. Geno Smith has no time, but he hasn't been good when he's had some. So much for Chip Kelly livening up the offense.\n                        \n                            --\n                        \n                            2-7-0\n                        \n                                25\n                            \n                                    Cowboys\n                                \n                            They better hope getting Quinnen Williams changes the way they play defense. It has to, right? It can't get any worse.\n                        \n                            --\n                        \n                            3-5-1\n                        \n                                26\n                            \n                                    Giants\n                                \n                            Blowing the lead against the Bears, with Jaxson Dart out with a concussion, cost Brian Daboll his job. Mike Kafka has to be smarter with Dart.\n                        \n                            --\n                        \n                            2-8-0\n                        \n                                27\n                            \n                                    Bengals\n                                \n                            Any chance they found a defense during the bye? Probably not. Get ready for more shootouts.\n                        \n                            --\n                        \n                            3-6-0\n                        \n                                28\n                            \n                                    Dolphins\n                                \n                            Give Mike McDaniel credit for having his team ready to upset the Bills. They haven't quit.\n                        \n                            1\n                        \n                            3-7-0\n                        \n                                29\n                            \n                                    Saints\n                                \n                            Winning at Carolina is nice, but the big thing was that Tyler Shough seems to be making progress. Could he be their long-term guy?\n                        \n                            1\n                        \n                            2-8-0\n                        \n                                30\n                            \n                                    Jets\n                                \n                            They have won two straight to help turn this thing around. So much for the idea that trading away stars would wreck them even worse. They are set for the future with all the draft picks.\n                        \n                            1\n                        \n                            2-7-0\n                        \n                                31\n                            \n                                    Browns\n                                \n                            They find new and creative ways to lose every week. They lost to a Jets team whose wide receivers combined for 7 yards. Special teams killed them.\n                        \n                            3\n                        \n                            2-7-0\n                        \n                                32\n                            \n                                    Titans\n                                \n                            They had a bye this past week. That's a win. Plus, the first overall pick now seems like it will be theirs.\n                        \n                            --\n                        \n                            1-8-0\n                        \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 11 Power Rankings: Drake Maye has Patriots a year ahead of schedule - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/2a71a6d7-9341-4077-ae43-62b127b644ea/thumbnail/1200x675/bcd7bf669e36a4d96bed1edc78e2aa30/drake-maye.jpg"
      ],
      "datePublished": "2025-11-11T10:00:41.000Z",
      "dateModified": "2025-11-11T10:00:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UEFA Women's Champions League Power Rankings: Barca No. 1, Arsenal outside top four - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uwcl-power-rankings-barcelona-lyon-chelsea-alyssa-thompson/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/7c245675-3948-4dec-ac6a-e7e76c4d7172/thumbnail/1200x675/46bac38b3fae17cae586689807e7c8b2/fcbarcelona.jpg",
    "tag": "Sports",
    "date": "2025-11-10T21:42:38.000Z",
    "description": "\n        The 2025-26 UEFA Women's Champions League returns with Matchday 3 action and plenty at stake. The new era of the tournament got off to an exc",
    "body": "\n        The 2025-26 UEFA Women's Champions League returns with Matchday 3 action and plenty at stake. The new era of the tournament got off to an exciting start with a reformatted league phase that presents a bit of unpredictability moving forward. While a handful of clubs are riding high with perfect two-game records, others are still navigating how to lift themselves higher in the tournament table.With the league phase approaching its halfway point, most matches feel like a must-win for teams aiming to secure their place in the next round. Even with the high stakes, some teams are in better shape than others, despite some results that may have been too close for comfort.But who are the teams that flexed their power, and which clubs are reevaluating after two rounds of league phase play? If you're keeping track of where teams landed following Matchday 2, check out our previous rankings. How to watchParamount+ will be a one-stop shop for all things Champions League, while CBS Sports Network and CBS Sports Golazo Network will have select matches and additional coverage. Each day's broadcast begins with UEFA Women's Champions League Today on both Paramount+ and CBS Sports Golazo Network before the early kickoffs, while Paramount+ and CBS Sports Network will have an hour-long pre-match show before the later matches. Post-match coverage will air on Paramount+ and CBS Sports Network, while CBS Sports Golazo Network will have a new edition of Scoreline to close out the day's action.\nCBS Sports' new UEFA Women's Champions League Today studio show will be anchored by Hannah Cash, while Jen Beattie, Janelly Farias, Darian Jenkins, Kelley O'Hara, and Ali Riley will serve as analysts. Chris Wittyngham will handle play-by-play duties and will be paired with Beattie and Jenkins, while Anita Jones will report pitchside and Christina Unkel will serve as the rules analyst.Here's where teams stack up after two rounds of the league phase:1. FC Barcelona (--)Suffered a historic loss in Lifa F to Real Sociedad and was the first loss sustained by the club since 2023. The rare feat was brief, though, and Barcelona are right back to dominating other Liga F clubs and will step back into UWCL games off a big 8-0 win against Deportivo La Coruna.2. OL Lyonnes (--)The French giants are rolling domestically and still performing well after two league phase matches. They're on a seven-game winning streak in France, and Haitian international Melchie Dumornay looks unstoppable right now.\n3. Chelsea (+1)U.S. women's national team forward Alyssa Thompson has needed little time to get acclimated to WSL play, and if anything, the league needs to get acclimated to the winger because she keeps showing up in big games for Chelsea.\n4. Wolfsburg (-1) Took a brief stumble domestically, but still returned to Champions League play relatively intact. There might be question marks around Lineth Beerensteyn and if she'll start after only playing a short time against Eintracht over the weekend, but it'll take a full team performance against Lyon.5. Arsenal (--)The Champions League title holders have work to do while it's still early in the league phase. They'll be hopeful to drive with the momentum of a come-back draw over the weekend against Chelsea when they take on Bayern, and they'll have to make adjustments with Katie Reid out for the season.\n6. Real Madrid (--)The Madristas have made a quick name for themselves in league phase play. They are still rivals to Barcelona domestically and coming off a Liga F win, but the bigger victory is on the availability report. Linda Caicedo is back on the pitch and scoring goals after a hamstring injury last month.7. Manchester United (+1)The Red Devils are trending in the right direction as they're back in the Champions League. Two good opening performances in league phase play will be what they lean on despite returning to the tournament off a narrow domestic loss against Aston Villa. 8. Juventus (-1)The Serie A side are quickly getting a reputation as a tough team to go against, but that might work against them during the league phase. The Italian squad will need to figure out how to work smarter, not harder, if they want to separate themselves. \n9. Bayern Munich (+1)Got off to a very rough start to open their Champions League campaign, but may have corrected the course in time. They're back to dominating domestically in the Frauen Bundesliga, and if they can topple tournament title holders Arsenal, it'll be a big statement.10. Atletico Madrid (-1)Atletico's form has been rather unpredictable in Liga F, and they'll have a test when league phase play resumes. In a real case of the pointing Spider-Man meme, Atletico Madrid will need a better performance against Juventus if they want to be considered legitimate UWCL contenders. 11. Twente (--)Twente will relish the opportunity to bounce back into the UWCL after decent performances that saw them only secure one point over two games. They're going toe-to-toe with Ajax domestically, but Benfica won't be a simple walk in the park.\n12. OH Leuven (--)Everyone's favorite debutants are back in the Champions League mixer with their biggest test yet. If the Belgians can manage even a respectable scoreline against Barcelona, the underdogs will keep turning heads. 13. Benfica (+1)The Portuguese champions are on top at home, but have struggled in league phase play. There's an opportunity to get back into things against Twente, especially if Lucia Alves has a good game.14. Paris Saint-Germain (+1)The Parisians are back to punching above their weight in France, but still second best to Lyon for now. They'll need a far bigger response in the Champions League following two poor league phase performances if they want to prove they're legitimate this season.\n15. Paris FC (-2)Will the real Paris FC please stand up? This is quite possibly the streakiest team domestically. Paris FC just can't seem to figure things out, and they'll need to adjust quickly with an eager Real Madrid on the horizon.16. Valerenga (-1)The Norwegians will settle for second place in the Toppserien, and they'll quickly fall out of contention in the Champions League if they don't manage to snag some points.17. Roma (--)Despite making huge strides in Serie A and leading the league, Roma have quickly fallen into a Champions League hole. They'll be eager to get points off an equally desperate side in Valerenga. \n18. St. Polten (--)A run of 11 straight group stage and league phase defeats doesn't quite drum up a loud vote of confidence. If they take down Chelsea, it'll be a massive upset.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UEFA Women's Champions League Power Rankings: Barca No. 1, Arsenal outside top four - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/7c245675-3948-4dec-ac6a-e7e76c4d7172/thumbnail/1200x675/46bac38b3fae17cae586689807e7c8b2/fcbarcelona.jpg"
      ],
      "datePublished": "2025-11-10T21:42:38.000Z",
      "dateModified": "2025-11-10T21:42:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB Rookie of the Year award: Predicting the top candidates for 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2026-mlb-rookie-of-the-year-candidates-yesavage-mcgonigle-mclean-prospects/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/02a83c16-5a78-4e19-8db7-7bbec38dc7f5/thumbnail/1200x675/7e69ff00108e8973f3ca27b9414431d0/yesavage-getty.png",
    "tag": "Sports",
    "date": "2025-11-11T01:19:12.000Z",
    "description": "\n        Athletics first baseman Nick Kurtz and Braves catcher Drake Baldwin have been named the 2025 Rookies of the Year. Kurtz won the award unanimo",
    "body": "\n        Athletics first baseman Nick Kurtz and Braves catcher Drake Baldwin have been named the 2025 Rookies of the Year. Kurtz won the award unanimously following his monster debut season. In most other years, A's shortstop Jacob Wilson or Red Sox outfielder Roman Anthony would have taken home the hardware. They instead finished behind Kurtz. The National League class was stacked -- Baldwin beat out the equally deserving Caleb Durbin (Brewers) and Cade Horton (Cubs). No award gets you excited about the future the way Rookie of the Year  does. It's a young player being recognized for his greatness, and great  young players are what sports hopes are built on. With that in mind,  here's a look ahead at the 2026 rookie class and, more importantly, who could be in the  running for the 2026 Rookie of the Year awards.\n        \n            \n                MLB Rookie of the Year awards: Athletics' Nick Kurtz takes home AL honors, Braves' Drake Baldwin wins in NL\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nAmerican LeagueC Samuel Basallo, Orioles: The O's believe so much in Basallo that they signed him to an eight-year, $67 million extension in August. The 21-year-old mostly struggled during his late-season cameo (.559 OPS in 31 games), though he's already had two walk-off hits, and those 31 games were valuable experience. There's something to be said for taking your lumps, learning what adjustments you have to make, and spending the offseason getting better. Basallo, who did not play enough to exhaust his rookie eligibility, figures to share catcher/DH duty with Adley Rutschman in 2026, which could equal more playing time than the typical rookie catcher. That won't hurt his Rookie of the Year chances.SS Kevin McGonigle, Tigers: Arguably the best prospect in baseball, McGonigle slashed .305/.408/.583 with 19 home runs and more walks (59) than strikeouts (46) across three minor league levels in 2025. He has yet to reach Triple-A and the lack of minor-league seasoning could work against him, but teams increasingly view Triple-A as a pit stop more than a level to spend a full season for development. The shortstop position is wide open in Detroit. McGonigle may not make his MLB debut until June or July, though he wouldn't be the first Rookie of the Year winner to play only half a season in the big leagues, or thereabouts.\nRHP Trey Yesavage, Blue Jays: Baseball fans are already more than familiar with Yesavage given his postseason heroics. He made only three regular-season starts, however, and postseason play does not count toward rookie status, so Yesavage is still eligible for next year's Rookie of the Year award. We've already seen how good he can be on the game's biggest stage, and he'll have the added advantage of not having to compete for a big-league job in spring training. We already know Yesavage will break camp in Toronto's rotation. There's a long way to go between now and then, but given what we know right now, Yesavage has to be considered the 2026 Rookie of the Year frontrunner.National LeagueRHP Bubba Chandler, Pirates: The Pirates slow-played Chandler's development this season, so much so that he admitted he was \"mad\" he was not called up sooner. He pitched well following his August debut, striking out 31 batters against only four walks in 31 ⅓ innings. Impressive command for a rookie, that is. Chandler, 23, neither pitched enough nor spent enough time in the big leagues to exhaust his rookie status. He's eligible for the 2026 Rookie of the Year award and is likely to be part of Pittsburgh's rotation right out of the gate on Opening Day.RHP Nolan McLean, Mets: McLean could've been the National League's version of Yesavage in the postseason had the Mets, you know, made the postseason. The 24-year-old was impressive in his MLB debut this year, pitching to a 2.06 ERA with 57 strikeouts in eight starts and showing lively stuff with movement that can best be described as cartoonish. McLean threw 48 innings for the Mets, two fewer than the 50-inning rookie limit. He remains Rookie of the Year eligible going into next season and is certain to be in New York's season-opening rotation. It's not out of the question that McLean will start Opening Day in 2026.\nIF JJ Wetherholt, Cardinals: Arguably the best all-around prospect in the minors, Wetherholt hit .306/.421/.510 with 17 home runs and nearly as many walks (72) as strikeouts (73) in the minors this season. He played 47 games in Triple-A too. He's knocking on the door. Wetherholt won't unseat Masyn Winn at shortstop but he shouldn't have any trouble playing second or third. The only question is how the Cardinals will make room for him (Brendan Donovan trade?) and how soon they will do it. Wetherholt is about as close to MLB ready as a prospect can get.Mystery League Several prominent Japanese veterans are expected to make their way over to MLB via the posting system this offseason. We don't know where they will sign yet, but the rules say these players will be Rookie of the Year eligible regardless of their age or years of experience in Japan, so we're going to include them here.RHP Tatsuya Imai: Imai, 27, has been one of Japan's top pitchers with the Seibu Lions the last few years, and this year he threw 163 ⅔ innings with 178 strikeouts and a 1.92 ERA. It's the mid-to-upper-90s fastball with the usual deep array of secondary pitches you find with Japanese starters (slider, splitter, curveball, etc.). Imai is not the next Yoshinobu Yamamoto. He's viewed as more of a mid-rotation starter with untapped potential than a plug-and-play ace. The Lions posted Imai this week.\n3B Munetaka Murakami: The 25-year-old Murakami has been on the radar since his historic 56-homer season for the Tokyo Yakult Swallows in 2022, which is the single-season record for a Japanese-born player. The years since have not been quite as dominant, and an oblique injury limited him to 69 games this season, but in that timeframe he hit 24 home runs. There are real questions about Murakami's bat-to-ball ability (his 27.0% strikeout rate in 2025 was well north of the 19.5% league average) and his third base defense, but no one doubts the power. Murakami's 45-day posting window closes Dec. 22.1B/3B Kazuma Okamoto: Perhaps a safer bet to perform right away than Murakami, Okamoto has been one of the Japan's top hitters the last decade. He hit .322/.411/.581 with 15 home runs in 77 games around a non-throwing elbow injury this year (it was a fluke injury suffered in a collision at first base) and has a history of big pull power and excellent contact rates. Okamoto is a bit older than Imai and Murakami (30 in June), which will be baked into the contract. The Yomiuri Giants have never posted a position player in their history (Hideki Matsui left as a free agent). Okamoto will be the first and could land with a team willing to stick with him at third base. He not yet been officially posted.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB Rookie of the Year award: Predicting the top candidates for 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/02a83c16-5a78-4e19-8db7-7bbec38dc7f5/thumbnail/1200x675/7e69ff00108e8973f3ca27b9414431d0/yesavage-getty.png"
      ],
      "datePublished": "2025-11-11T01:19:12.000Z",
      "dateModified": "2025-11-11T01:19:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How PGA Tour should alter FedEx Cup Fall format after adding two new tournaments - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/pga-tour-alter-fedex-cup-fall-format-new-tournaments-2026-asheville-austin/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/b8615b7c-a95f-4619-a2db-39cdee8efc18/thumbnail/1200x675/4424e6c73c93be60fd57ec3b3b3f02d9/pga-tour-logo-blue-grass-g.jpg",
    "tag": "Sports",
    "date": "2025-11-10T21:24:15.000Z",
    "description": "\n        The PGA Tour on Monday announced that a new tournament will join the FedEx Cup Fall schedule next season, the Biltmore Championship in Ashevi",
    "body": "\n        The PGA Tour on Monday announced that a new tournament will join the FedEx Cup Fall schedule next season, the Biltmore Championship in Asheville, North Carolina. It will be held at The Cliffs at Walnut Cove, one week before the Presidents Cup at Medinah Country Club.The Biltmore Championship marks the second change to the PGA Tour's fall swing as the Good Good Championship was previously announced as joining the slate. That event will be held at Omni Barton Creek Resort & Spa's Fazio Canyons Course in Austin, Texas.Reading the tea leaves, it appears as if the 2026 FedEx Cup Fall will look relatively the same in terms of overall tournaments being played.The Mexico Open, typically held in the regular season, was not on the 2026 schedule; it will instead take place next October. Baycurrent debuted as a new title sponsor in 2025, and it is on board for multiple years, while the Bank of Utah and World Wide Technology have deals through 2027. RSM and Butterfield go through 2028, leaving the Procore Championship in Napa, California, and the Sanderson Farms Championship in Jackson, Mississippi, in flux.\nIf the fall schedule holds or grows, what did PGA Tour CEO Brian Rolapp mean this past summer when he announced that a new competition committee would be driven by three principles: competitive parity, simplicity and scarcity?If scarcity was going to be employed for a portion of the PGA Tour schedule, FedEx Cup Fall would be the first place to pare back, especially when considering what has taken place the last few seasons -- fewer PGA Tour cards up for grabs, smaller fields, elimination of Monday qualifiers, etc. However, whittling down the number of fall tournaments would contradict what Rolapp believes to be one of the PGA Tour's greatest strengths (another one of those three principles): competitive parity.\n\"All sports chase competitive parity,\" said Rolapp at the Tour Championship. \"The PGA Tour has incredible competitive parity and balance among its players today. We're going to lean into this while also maintaining another key characteristic of the PGA Tour: meritocracy. Anyone on Tour who's a good enough golfer should have a shot at winning, and we're going to lean into that and preserve that.\"The FedEx Cup Fall is outlined as a seven-tournament run meant to provide players with an opportunity to secure or improve their position in priority ranking, securing additional playing opportunities for the following season. Those ranked Nos. 51-60 get into the first two signature events, those inside the top 100 receive full-time status on the PGA Tour and down the list it goes.The headliners of these events have not been those players but rather Scottie Scheffler and the U.S. Ryder Cup team at the Procore Championship, Xander Schauffele at the Baycurrent Classic and now Ben Griffin at the World Wide Technology Championship. Meanwhile, some notable names outside the top 50 -- like Jordan Spieth and Tony Finau -- have yet to play in the fall.\nThis may not seem like an issue on the surface -- why would the world No. 1 winning be problematic? -- but it may present an opportunity and chance to improve scarcity and even simplicity while maintaining competitive parity.1. Increase cut-off points, increase the incentive to play In a perfect world, requiring those outside the top 50 in the FedEx Cup standings to play a certain number of tournaments would be the answer, but as we have seen over the last handful of years, professional golfers do not love being told what to do. Instead, adding qualifying tiers for tournaments in the regular season would be the play.The 70-90 range in the FedEx Cup standings is a no man's land with exciting players like Finau, Rasmus Højgaard, Nicolai Højgaard, Davis Thompson and Cam Davis. They may tell themselves they are too far outside the Aon Next 10 (Nos. 51-60) and well-positioned to avoid the top 100 cutoff. Add in exemptions from prior wins, and the incentive to play is close to zero.\nThe same can be said for those like Spieth already inside the Aon Next 10. He has the possibility of sponsor exemptions into signature events to cushion his fall -- that's a conversation for a different day-- and has only dropped one spot in the standings from No. 56 to 57 this fall. Fold in a FedEx Cup Fall champion exemption for all signature events and another cut-off point at No. 75, and it may be enough alter the schedules of players in the same position as Spieth and Finau. 2. Allow play on the DP World Tour to countLook at the DP World Tour's 2026 schedule, and one will find only three PGA Tour events: the Scottish Open, ISCO Championship and Corales Puntcana Championship. With the top 10 players in the Race to Dubai (not otherwise exempt) receiving PGA Tour playing privileges for the following season, on the surface, the strategic alliance between the two leagues has been a bit one-sided.\nA way to help both sides would be allowing those inside the top 50 of the FedEx Cup standings the opportunity to play on the DP World Tour, even if a regular-season tournament goes head-to-head with a non-signature PGA Tour event.While there is still plenty at stake during that time -- like ensuring one is inside the top 50 of the Official World Golf Rankings for major-championship qualification -- that can be achieved anywhere. With some higher-ranked European players like Rory McIlroy and Tommy Fleetwood in those DP World Tour fields, the added depth would mean more OWGR points up for grabs.Factor in what tournaments are played (Irish Open, French Open, Spanish Open), where those tournaments are played (Alfred Dunhill Links plays across St. Andrews, Carnoustie and Kingsbarns, for example) and when those tournaments are played from a U.S. perspective (in the morning before football games kick off). Suddenly, the positives pile up.\n3. Keep adding young players to the fieldWithout the top 50 players in the FedEx Cup standings participating, the composition would be much simpler and give the fall season more of an identity beyond: This is the season for those who want to improve their place on the PGA Tour for the following year.Such a move could lead to additional spots opening in these fields -- the Bermuda Championship only has one player inside the top 50 (Sam Stevens) participating -- but if it does, those should go to young, up-and-coming players, including those who recently graduated from the Korn Ferry Tour.In 2025, not a single rookie qualified for the BMW Championship, meaning no one new to the PGA Tour locked up a spot in the 2026 signature events. After Michael Brennan's win at the Bank of Utah Championship, that number was up to 36 players.\nOn the outside looking in as their PGA Tour careers begin, recent Korn Ferry graduates and soon-to-be rookies would lick their lips at the opportunity of using the fall slate as a way to get their feet underneath them. Both the players and the league would be better off because of it.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How PGA Tour should alter FedEx Cup Fall format after adding two new tournaments - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/b8615b7c-a95f-4619-a2db-39cdee8efc18/thumbnail/1200x675/4424e6c73c93be60fd57ec3b3b3f02d9/pga-tour-logo-blue-grass-g.jpg"
      ],
      "datePublished": "2025-11-10T21:24:15.000Z",
      "dateModified": "2025-11-10T21:24:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants retain GM Joe Schoen, but should he be the one to write the next chapter? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-retain-gm-joe-schoen-after-brian-daboll-firing-but-is-he-the-right-one-to-write-the-next-chapter/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/7cc8dd0f-3a73-4fe4-90ce-f13987aaf1b0/thumbnail/1200x675/c5f5a2d63505f6ca970984253a02d286/gettyimages-1238860906-2.jpg",
    "tag": "Sports",
    "date": "2025-11-10T21:56:10.000Z",
    "description": "\n        With the firing of Brian Daboll, change is coming on the New York Giants' sideline. The same can't be said for the front office, where genera",
    "body": "\n        With the firing of Brian Daboll, change is coming on the New York Giants' sideline. The same can't be said for the front office, where general manager Joe Schoen will remain in his role and lead the search for the team's next coach.\"We feel like Joe has assembled a good young nucleus of talent, and we look forward to its development,\" Giants owner and president John Mara said in a statement. \"Unfortunately, the results over the past three years have not been what any of us want. We take full responsibility for those results and look forward to the kind of success our fans expect.\"Schoen was hired in January of 2022, and he hired Daboll just one week later. Together, Schoen and Daboll turned the Giants into a surprise playoff team later that year, but the results have only gotten worse with each passing season.Just like Daboll, Schoen has drawn the ire of frustrated Giants' fans, who haven't watched their team in the conference championship game since the 2011 campaign. Unlike Daboll, however, Schoen will get more time to right the ship in New York.\nThe question now is whether Schoen, whose resume is a very mixed bag, is the right man for the job as the Giants begin their search for a new coach.\n        \n            \n                Giants coaching candidates: Ranking 10 options to replace fired Brian Daboll, including Bill Belichick\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nSchoen's mixed results in the draft, free agencyIn the first 14 months of Schoen's tenure, he managed to set the Giants back with a couple of major missteps. First, with two top-10 picks in the 2022 NFL Draft, Schoen swung and missed on both selections.Schoen took defensive end Kayvon Thibodeaux at No. 5 overall, and opted for offensive lineman Evan Neal two picks later at No. 7 overall. Thibodeaux has been a staple of the defensive line since his rookie season, but with 23.5 sacks in 53 career games, he hasn't produced like a top-10 pick.\nNeal's time in New York has been even more disappointing. Injuries and poor performance have plagued Neal throughout his career, which has been limited to 29 games. This season, Neal has been reduced to a backup role at guard.The second big miss of Schoen's first year-plus in New York was handing quarterback Daniel Jones a four-year, $160 million contract extension following the 2022 season. That deal immediately looked like a mistake as Jones' performance cratered, and in the second year of that contract, the Giants benched Jones before ultimately releasing him. (It probably doesn't help the optics given that Jones is now helming the NFL-best 8-2 Colts.)In the aftermath of those misses, Schoen only added more stains to his resume. The Giants' 2023 draft class was littered with misses, including first-round cornerback Deonte Banks, second-round center John Michael Schmitz and third-round receiver Jalin Hyatt.\nThen, there were the roster decisions in the 2024 offseason. Schoen let safety Xavier McKinney and star running back Saquon Barkley walk in free agency. McKinney signed with the Packers and immediately became a first-team All-Pro. All Barkley did after signing with the rival Philadelphia Eagles was lead the NFL in rushing (2,005 yards) en route to a Super Bowl victory.Where Schoen and Daboll differ most is that there have been more signs of improvement from the general manager over the last year or two. For starters, Schoen has more hits (some of the star variety) in the draft over the last couple years.2024: WR Malik Nabers2024: DB Andru Phillips2024: TE Theo Johnson2024: RB Tyrone Tracy Jr.2025: DE Abdul Carter2025: QB Jaxson Dart2025: RB Cam SkatteboIn addition to getting some potential franchise cornerstones in the draft, Schoen has also been aggressive in trying to upgrade weak spots in free agency. This past offseason, he signed two of the top defensive backs available in cornerback Paulson Adebo and safety Jevon Holland.\nDespite those wins, there are still serious questions for Schoen. This mess is his too, after all. Offensive line questions still abound in New York, and there are clearly still holes in the defense, especially at linebacker.Schoen just seems to have saved himself on the strength of a couple strong draft classes, which in all fairness, might include the franchise's next star quarterback.Does this reset Schoen's timeline?How long is the leash for Schoen now that he gets to make a second coaching hire? What if the team gets off to a poor start in 2026 and some of the roster decisions that Schoen makes are to blame? The Giants could find themselves in a situation where they have a lame duck general manager and a first-year coach on two separate timelines.\nIf that does happen and the Giants move on from Schoen in 2026, they will hire a new general manager who did not hire the coach. At that point, does the new general manager have a quick trigger with the coach because he wants to get his own guy on the sidelines?Things can spiral out of control quickly in those situations. Just look at how far and quickly the Tennessee Titans have fallen with a lack of cohesion and stability between the front office and the coaching staff.If firing Daboll and retaining Schoen is going to work out in the long run, Schoen needs to replicate the successes of his 2025 offseason while avoiding the catastrophic moves that derailed his first couple of years in New York.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants retain GM Joe Schoen, but should he be the one to write the next chapter? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/7cc8dd0f-3a73-4fe4-90ce-f13987aaf1b0/thumbnail/1200x675/c5f5a2d63505f6ca970984253a02d286/gettyimages-1238860906-2.jpg"
      ],
      "datePublished": "2025-11-10T21:56:10.000Z",
      "dateModified": "2025-11-10T21:56:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 10 grades: Eagles settle for C+ on MNF; Bills flop vs. Dolphins - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-10-grades-highlights-lowlights/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/92b742ab-93a9-4db7-b36c-af040073f7f4/thumbnail/1200x675/804efcad51f415b6463350e99be491f4/allen-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-11-11T04:53:29.000Z",
    "description": "\n\n\n    \n                                    Here are the grades for every team who played in Week 10\n        \n                                        ",
    "body": "\n\n\n    \n                                    Here are the grades for every team who played in Week 10\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 10, 2025\n                            \n                    at\n    11:51 pm ET\n                        \n                •\n            \n            19 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Welcome to the Week 10 grades!If you love rooting for the underdog, then Week 10 ended up being a pretty solid one for you as we saw a total of five underdogs pull out a win.The Patriot went into Tampa Bay as a 2.5-point underdog and ended up pulling off a 28-23 upset over the Buccaneers. Drake May kept himself in the MVP conversation by throwing for 270 yards and two touchdowns. With CJ Stroud out, the Texans were a 1.5-point home underdog to the Jaguars and it looked like they were going to get run out of their own stadium. Heading into the fourth quarter, the Texans were trailing 29-10, but then they pulled off a stunning comeback to top the Jags, 36-29. The Jets were also a 1.5-point underdog and although their offense didn't even produce 170 total yards, they managed to pull off an upset over the Browns thanks in large part to two special teams touchdowns. And let's not forget about the Saints. They were a 5.5-point road underdog against a 5-4 Panthers team and somehow they managed to pull off the upset with a 17-10 win. Finally, we have the Dolphins, who pulled off the shocker of the day by destroying the Bills 30-13 in a game where Buffalo closed as an 8.5-point favorite. In the final game of Week 10, the Eagles weren't an underdog, but they did go on the road and beat the Packers, 10-7, in a pivotal NFC showdown. \nLet's get to this week's grades, starting with Philadelphia's big win. Philadelphia 10-7 Green BayMiami 30-13 over BuffaloL.A. Chargers 25-10 over PittsburghL.A. Rams 42-26 San FranciscoDetroit 44-22 over WashingtonSeattle 44-22 over ArizonaNew England 28-23 over Tampa BayHouston 36-29 over JacksonvilleChicago 24-20 over N.Y. GiantsBaltimore 27-19 over MinnesotaN.Y. Jets 27-20 over ClevelandNew Orleans 17-7 over CarolinaIndianapolis 31-25 (OT) over Atlanta (in Berlin)Denver 10-7 over Las Vegas (Thursday)\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 10 grades: Eagles settle for C+ on MNF; Bills flop vs. Dolphins - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/92b742ab-93a9-4db7-b36c-af040073f7f4/thumbnail/1200x675/804efcad51f415b6463350e99be491f4/allen-jpeg.jpg"
      ],
      "datePublished": "2025-11-11T04:53:29.000Z",
      "dateModified": "2025-11-11T04:53:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]