[
  {
    "title": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-spread-time-ravens-steelers-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/36a1df33-1136-4561-8304-00b51f69280c/thumbnail/1200x675/a25cce6e48ddce2339cf341ad96ee05a/aaron-rodgers-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:32:26.000Z",
    "description": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday ",
    "body": "\nThe AFC North title and the playoff berth that comes with it will be on the line when the Baltimore Ravens battle the Pittsburgh Steelers on 'Sunday Night Football.' Baltimore is coming off a 41-24 thumping of the Green Bay Packers in Week 17, while Pittsburgh dropped a 13-6 decision to the Cleveland Browns. The Ravens (8-8), who have won the past two division championships, would hold the tiebreaker with Pittsburgh if they finish with the same record. The Steelers (9-7), who are looking for their first AFC North crown since 2020, are 5-3 on their home field. Lamar Jackson (back) will start at quarterback for the Ravens, while receiver Rashod Bateman is inactive. Pittsburgh will again be without receiver DK Metcalf (suspension), but T.J. Watt (lung) is expected to return after having surgery.Kickoff from Acrisure Stadium in Pittsburgh is set for 8:20 p.m. ET. The Steelers lead the all-time series 37-27, including a 27-22 win in Baltimore on Dec. 7. Baltimore is a 3.5-point favorite in the latest Ravens vs. Steelers odds from DraftKings Sportsbook, while the over/under for total points scored is 41.5. Baltimore is at -202 on the money line (risk $202 to win $100), with Pittsburgh at +167 (risk $100 to win $167). The Under is 8-2 over the teams' last 10 matchups. Before locking in any Steelers vs. Ravens picks, make sure to check out the 'Sunday Night Football' predictions from SportsLine NFL expert Mike Tierney.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nA veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. Mike is 235-189-13 in the NFL the past three seasons, returning $2,505 to $100 players. In addition, he is an amazing 31-14-1 on his last 46 picks in games involving the Baltimore Ravens, returning $1,527. Anyone who has followed him could be way up. Now, Tierney has set his sights on Ravens vs. Steelers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Ravens vs. Steelers: Ravens vs. Steelers                                         spreadBaltimore -3.5 at DraftKings SportsbookRavens vs. Steelers                                                 over/under41.5 pointsRavens vs. Steelers                                                 money line Baltimore -202, Pittsburgh +167Ravens vs. Steelers                                             picksSee picks at SportsLineRavens vs. Steelers                                                 streaming Fubo (Try for free)  \nWhy the Ravens can winVeteran running back Derrick Henry can put the offense on his back, as he did in last week's win over the Packers. Henry rushed 36 times for 216 yards and four touchdowns at Green Bay. For the season, he has carried 287 times for 1,469 yards and 16 touchdowns. He has 15 explosive plays of 20 yards or more, including a long of 59, with 74 first-down conversions. He has also caught 20 passes for 150 yards and has over 100 scrimmage yards earlier this year versus Pittsburgh.Wide receiver Zay Flowers has been solid in the passing game. In 16 games, Flowers has 82 receptions for 1,073 yards and three touchdowns. He also has 17 big plays of 20 yards or more, including a long of 56, with 400 yards after the catch and 45 first-down conversions. Against the Packers, he caught four passes for 30 yards and a score. Facing Pittsburgh's No. 29 passing defense, Flowers should find holes in the secondary. See which team to back at SportsLine. Bet Lamar Jackson to go Over 214.5 passing yards at DraftKings:\nWhy the Steelers can winVeteran quarterback Aaron Rodgers, who is in his 21st season in the league, powers the Pittsburgh offense. In 15 games, he has completed 65.6% of his passes for 3,028 yards and 23 touchdowns with seven interceptions and a 95.3 rating. Rodgers has also rushed for one score and should be able to take advantage of Baltimore's 29th-ranked pass defense. In the win over the Ravens in December, he completed 23 of 34 passes for 284 yards and one touchdown. He also rushed for one score.Four-year veteran running back Jaylen Warren helps lead the Steelers' ground attack. In 15 games, he has carried 197 times for 892 yards (4.5 average) and six touchdowns. He has six explosive plays of 20 or more yards, including a long of 45. He has converted 48 first downs, and he scored a touchdown versus Baltimore earlier this season. In a 29-24 win at Detroit on Dec. 21, he carried 14 times for 143 yards and two touchdowns. See which team to back at SportsLine.Bet Jonnu Smith to go Over 16.5 total receiving yards at DraftKings:\nHow to make Ravens vs. Steelers  picksTierney has analyzed Ravens vs. Steelers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Steelers vs. Ravens, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Ravens vs. Steelers spread you need to jump on, all from the expert that is 31-14-1 on his last 46 Baltimore Ravens picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Sunday Night Football' prediction, odds: Ravens vs. Steelers picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/36a1df33-1136-4561-8304-00b51f69280c/thumbnail/1200x675/a25cce6e48ddce2339cf341ad96ee05a/aaron-rodgers-imagn.jpg"
      ],
      "datePublished": "2026-01-05T00:32:26.000Z",
      "dateModified": "2026-01-05T00:32:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Dolphins vs. Patriots picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-dolphins-where-to-watch-nfl-week-18-odds-score-prediction-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/97166bec-3202-48ea-be76-91917a4869fc/thumbnail/1200x675/c6d88fe209192fec49da3fcd54b2e118/drake-maye-new-england-patriots.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:42:41.000Z",
    "description": "\nThe New England Patriots still have a chance at the AFC's No. 1 seed on Sunday when they host the Miami Dolphins in an NFL Week 18 AFC East matchup. ",
    "body": "\nThe New England Patriots still have a chance at the AFC's No. 1 seed on Sunday when they host the Miami Dolphins in an NFL Week 18 AFC East matchup. Quarterback Drake Maye will try to lock up the MVP award -- he is the -295 favorite at DraftKings -- and lead the Patriots (13-3) into the postseason on a roll. They can take the No. 1 seed with a victory and a Denver loss. The Dolphins (7-9) are simply trying to help coach Mike McDaniel keep his job. Miami knocked off the Tampa Bay Buccaneers 20-17 last week to end a two-game losing streak that eliminated them from the playoffs. New England has won 12 of its past 13 games.     Kickoff from Gillette Stadium is set for 4:25 p.m. ET. The Patriots are 13.5-point favorites in the latest Dolphins vs. Patriots odds from DraftKings, while the over/under for total points scored is 45.5. New England's over/under for total team points is 29.5, while Miami's is 15.5. Before you make any Patriots vs. Dolphins picks of your own, you have to see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Dolphins vs. Patriots on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppDolphins vs. Patriots betting previewOdds: Patriots -13.5, Over/Under 45.5The Patriots are outscoring opponents by about nine points per game and are 11-5 against the spread but just 4-4 ATS at home. Miami is 8-8 ATS (3-4 in road games) but has covered the spread in nine of its past 10 visits to Gillette Stadium. The Pats are 7-1 against the spread in their past eight AFC East matchups. Dolphins vs. Patriots SGPOver 45.5Dolphins +13.5Rhamondre Stevenson anytime TD scorerBet it at DraftKings:\nModel's Dolphins vs. Patriots score prediction, picksAs mentioned, the Dolphins are 9-1 ATS in their past 10 trips to New England. They rushed for 145 yards in last week's victory and are 10th in the NFL at 124 rushing yards per game behind De'Von Achane,who is fifth in the league with 1,350 rushing yards. The run game will take pressure off rookie quarterback Quinn Ewers. The first meeting between this season was a 33-27 New England victory, and the model has Miami covering in 53% of simulations. The total has gone Over in eight of New England's past 10 games, and the Pats score an average of 28 points per game, fifth in the NFL. The Over hits at a 60% rate in SportsLine's projections. They want the win to lock up the top seed, but they'll also want to stay healthy for the playoffs, so they could be conservative with Maye. The SportsLine props model projects him for 15 completions and has the Under as a 5-star play.Dolphins vs. Patriots score prediction: Patriots 30, Dolphins 21\nWant more Week 18 NFL picks?You've seen the model's best bets for Miami Dolphins vs. New England Patriots. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Dolphins vs. Patriots picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/97166bec-3202-48ea-be76-91917a4869fc/thumbnail/1200x675/c6d88fe209192fec49da3fcd54b2e118/drake-maye-new-england-patriots.jpg"
      ],
      "datePublished": "2026-01-04T19:42:41.000Z",
      "dateModified": "2026-01-04T19:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-bills-where-to-watch-nfl-week-18-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/64db3f7f-c371-40e7-acc1-d74096dd6a33/thumbnail/1200x675/2c347b864c9fa4e8d9639c00a807385c/josh-allen-buffalo-bills-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:31:35.000Z",
    "description": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jet",
    "body": "\nThe Buffalo Bills won't be AFC East champions this season, but they can still improve their seeding in the NFL playoffs if they beat the New York Jets and have results go their way elsewhere in Week 18. Yet given the foot injury star quarterback Josh Allen is currently nursing, Buffalo may not want to risk its most important player with a postseason berth already secured. Allen does not have an injury designation on the injury report, but it's unclear whether he will play the full game. The Jets, meanwhile, are playing out the string for another lost season. Coach Aaron Glenn may be coaching for his job.Kickoff from Highmark Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Bills are 12.5-point favorites in the latest Bills vs. Jets odds at DraftKings, and the total is 38.5 points. Before making any Jets vs. Bills picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Bills vs. Jets on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppBills vs. Jets betting previewOdds: Bills -12.5, over/under 38.5These lines could fluctuate as kickoff draws closer and it becomes clearer just how the Bills will handle their starters. Both teams are 7-9 against the spread. Buffalo is 8-8 to the Over, while New York is 10-6. The Bills have only covered in one of their last four games, while the Jets haven't covered once in that span.Bills vs. Jets SGPBills -12.5Over 38.5Bills -7.5 first half spreadBet it at DraftKings:\nModel's Bills vs. Jets score prediction, picksThe Bills cover in 62% of the model's simulations and win outright in 82%. The Over hits 69% of the time. These rates may change as player availability news emerges. Bills vs. Jets score prediction: Bills 30, Jets 16Want more Week 18 NFL picks?You've seen the model's best bets for Buffalo Bills vs. New York Jets. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bills vs. Jets picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/64db3f7f-c371-40e7-acc1-d74096dd6a33/thumbnail/1200x675/2c347b864c9fa4e8d9639c00a807385c/josh-allen-buffalo-bills-imagn-images.jpg"
      ],
      "datePublished": "2026-01-04T19:31:35.000Z",
      "dateModified": "2026-01-04T19:31:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Ravens vs. Steelers: Top daily Fantasy football lineups for 'SNF' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-ravens-steelers-daily-fantasy-picks-lineups-fanduel-draftkings-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/23/a9fb5a93-a8f8-4188-bc96-e61b4b7def64/thumbnail/1200x675/639ee9b516e9a508ad235bc437a1bb78/derrick-henry-1.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:25:49.000Z",
    "description": "\nThe Baltimore Ravens travel to take on the Pittsburgh Steelers in the Week 18 edition of 'Sunday Night Football' at 8:20 p.m. ET. Daily Fantasy playe",
    "body": "\nThe Baltimore Ravens travel to take on the Pittsburgh Steelers in the Week 18 edition of 'Sunday Night Football' at 8:20 p.m. ET. Daily Fantasy players should have no concerns about motivation in this one as both teams are win-and-in as they compete for the AFC North title. The NFL DFS players pool for this matchup also got a boost as Lamar Jackson (back) returned to practice this week and is set to play, joining other big names like Derrick Henry, Aaron Rodgers and Jaylen Warren in this matchup. Potential sleepers include Adam Thielen, Pat Freiermuth and Jonnu Smith as Baltimore wideout Rashod Bateman and Pittsburgh receiver Roman Wilson are both inactive.How should you build your NFL DFS lineups for 'Sunday Night Football,' and which sleepers should factor into your NFL DFS strategy? Before making any Steelers vs. Ravens NFL DFS picks, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure.You can also bet props like Warren as an anytime TD scorer (+185) using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Sunday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Steelers vs. RavensOne of McClure's top NFL DFS picks for 'Sunday Night Football' is Henry. With their season already hanging in the balance in Week 17, the Ravens handed it to Henry a whopping 36 times. He turned that into 216 yards and four scores. Jackson's return will likely eat into that usage a bit, but Henry very well could see 30-plus touches in this winner-take-all matchup, so he's worth the investment in the single-game format. See who else to roster at SportsLine.McClure is also building his 'Sunday Night Football' NFL DFS strategy around Pittsburgh running back Kenneth Gainwell. With DK Metcalf (suspension) out, Pittsburgh needs to find targets in the passing game, and that's where Gainwell has excelled. He's the sixth-most targeted back in the NFL this season with 76 total, and he's caught 65 of those for 422 yards and three scores. Add in his 527 rushing yards and he's approaching 1,000 yards from scrimmage for the season. See more NFL DFS picks at SportsLine.How to set Ravens vs. Steelers NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Ravens vs. Steelers: Top daily Fantasy football lineups for 'SNF' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/23/a9fb5a93-a8f8-4188-bc96-e61b4b7def64/thumbnail/1200x675/639ee9b516e9a508ad235bc437a1bb78/derrick-henry-1.jpg"
      ],
      "datePublished": "2026-01-05T00:25:49.000Z",
      "dateModified": "2026-01-05T00:25:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens vs. Steelers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-steelers-nfl-player-props-sgp-sunday-night-football-same-game-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/28/1419c01f-6b74-4aa7-b9ba-3cf4b09c57c1/thumbnail/1200x675/b79cf833e5f53b59c8baea148384d2a7/aaron-rodgers-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:19:05.000Z",
    "description": "\nThe AFC North title and a playoff berth are on the line when the Baltimore Ravens clash with the Pittsburgh Steelers in Week 18 'Sunday Night Footbal",
    "body": "\nThe AFC North title and a playoff berth are on the line when the Baltimore Ravens clash with the Pittsburgh Steelers in Week 18 'Sunday Night Football' at 8:20 p.m. ET from Acrisure Stadium in Pittsburgh. The Ravens (8-8) trail the Steelers (9-7) by one game in the division, but would win the tiebreaker if they win on Sunday. The matchup will feature Ravens running back Derrick Henry and Steelers quarterback Aaron Rodgers. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which Baltimore is favored by 3.5 points.Henry is coming off a monster game against the Green Bay Packers in which he carried 36 times for 216 yards and four touchdowns. It is the most rushing yards ever registered by an opposing player at Lambeau Field. Rodgers, meanwhile, has completed 65.6% of his passes for 3,028 yards and 23 touchdowns on the year. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Zay Flowers, Mark Andrews and DeAndre Hopkins of the Ravens, and Jaylen Warren, Kenneth Gainwell and Pat Freiermuth of the Steelers. Before betting any Steelers vs. Ravens props for Sunday Night Football, you need to see the Ravens vs. Steelers prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Steelers vs. Ravens NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Ravens vs. Steelers prop picks. You can only see the Machine Learning Model player prop predictions for Ravens vs. Steelers here.Top NFL player prop bets for Steelers vs. RavensAfter analyzing the Ravens vs. Steelers props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Steelers quarterback Aaron Rodgers goes over 1.5 passing touchdowns (+148). Rodgers has thrown two or more touchdown passes in five games this season. In a 28-15 win over the Miami Dolphins on Dec. 15, Rodgers completed 23 of 27 passes for 224 yards and two touchdowns. Additionally, Baltimore has the 30th-best passing defense, and has given up 22 passing touchdowns. Rodgers has thrown for four touchdown passes in his last two games against Baltimore. The SportsLine Machine Learning Model projects Rodgers to have 1.7 touchdown passes and gives this prop a 4 out of 5-star prop rating. See more NFL props here. Bet Rodgers to go Over 1.5 passing touchdowns at DraftKings:\nHow to make NFL player prop bets for Ravens vs. SteelersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has nine other NFL props that are rated 4 stars or better. You need to see the Machine Learning Model analysis before making any Ravens vs. Steelers prop bets for Sunday Night Football.Which Steelers vs. Ravens prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Ravens vs. Steelers props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens vs. Steelers props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/28/1419c01f-6b74-4aa7-b9ba-3cf4b09c57c1/thumbnail/1200x675/b79cf833e5f53b59c8baea148384d2a7/aaron-rodgers-imagn.jpg"
      ],
      "datePublished": "2026-01-05T00:19:05.000Z",
      "dateModified": "2026-01-05T00:19:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Lions vs. Bears picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-bears-where-to-watch-nfl-week-18-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/9c12cd82-0a5e-4c30-9a26-ad937e7a11d3/thumbnail/1200x675/d49b384723bd224b1eb0c3390144ad4a/caleb-williams-chicago-bears.jpg",
    "tag": "Sports",
    "date": "2026-01-04T19:47:21.000Z",
    "description": "\nThe NFC North has been the Detroit Lions' for the last two years, but the Chicago Bears have won the crown in 2025 under first-year head coach and fo",
    "body": "\nThe NFC North has been the Detroit Lions' for the last two years, but the Chicago Bears have won the crown in 2025 under first-year head coach and former Lions offensive coordinator Ben Johnson. He has the Bears at 11-5 entering a Week 18 matchup with Detroit, and a win would have Chicago clinching the No. 2 spot in the NFC and securing a third matchup with the Green Bay Packers, this time in NFL Super Wild Card Weekend. The Lions were eliminated from playoff contention last week, but Dan Campbell has a history of having Detroit ready to play spoiler in the final week of the season.Kickoff from Soldier Field is set for 4:25 p.m. ET. The Bears are 4.5-point favorites in the latest Lions vs. Bears odds at DraftKings, and the total is 51.5. Before making any Bears vs. Lions picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times.\nWhere to watch Lions vs. Bears on SundayWhen: Sunday, Jan. 4Time: 4:25 p.m. ETTV: FOXStream: Fubo  Follow along: CBS Sports AppLions vs. Bears betting previewOdds: Bears -4.5, over/under 51.5Detroit dominated the previous matchup 52-21 back in Week 2, but the Bears have been red hot ever since, while the Lions need a win to finish the season over .500. The Bears are 10-5-1 against the spread this season, while the Lions are 7-9 ATS. The Lions are 10-6 to the Over this year, and the Bears are 8-8 to the Over.Lions vs. Bears SGPLions +4.5Over 51.5Lions +3.5 first half spreadBet it at DraftKings:\nModel's Lions vs. Bears score prediction, picksThe SportsLine model likes backing Detroit here as the Lions cover in 51% of simulations and win outright 47% of the time. The model also expects this NFC North clash to be a high-scoring affair, with Over 50.5 hitting in nearly 60% of sims. Lions vs. Bears score prediction: Bears 28, Lions 27Want more Week 18 NFL picks?You've seen the model's best bets for Detroit Lions vs. Chicago Bears. Now, get against the spread, total and money-line picks for every Week 18 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Lions vs. Bears picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/9c12cd82-0a5e-4c30-9a26-ad937e7a11d3/thumbnail/1200x675/d49b384723bd224b1eb0c3390144ad4a/caleb-williams-chicago-bears.jpg"
      ],
      "datePublished": "2026-01-04T19:47:21.000Z",
      "dateModified": "2026-01-04T19:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks' Charles Cross signs largest contract extension in team history for non-QB - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-tackle-charles-cross-signs-history-making-contract-extension-nfl-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/05/e620258a-d89b-4eb3-b995-270fab2b1563/thumbnail/1200x675/38dfbd1b92c8e797e12d8e5758347650/cross.png",
    "tag": "Sports",
    "date": "2026-01-05T00:35:49.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Seattle Seahawks offensive tackle Charles Cross ha",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Seattle Seahawks offensive tackle Charles Cross has reportedly come to terms on a four-year, $104.4 million contract. Cross' extension is the largest contract in Seahawks history for a non-quarterback. Seattle picked up Cross' fifth-year option this past offseason. But after a strong 2025 season, the Seahawks decided to lock Cross up now instead of waiting until this offseason. Cross, 25, has missed Seattle's last three games with a hamstring injury. The hope is that he will be back on the field when the Seahawks resume play during the divisional round of the 2025 playoffs. Seattle (14-3) has secured the NFC's top playoff seed. \n\"We're optimistic for next week or the week after for Charles,\" Seahawks coach Mike Macdonald recently said of Cross. \"These guys have done a great job of getting back and working, but obviously Charles isn't going to make it this week.\"The ninth overall pick in the 2022 NFL Draft, Cross has started in each of his 62 regular season games with Seattle. He started in each of Seattle's 17 games as a rookie and did so again during the 2023 season. Cross started in each of the Seahawks' first 14 games this season before sustaining his injury. \nCross has been part of a Seahawks' offense that scored a whopping 483 points this season. He helped provide sterling protection for Sam Darnold, who earned his second consecutive Pro Bowl berth. Cross' blocking also helped wideout Jaxon Smith-Njigba lead the NFL in both receptions and receiving yards. He also contributed to Kenneth Walker III rushing for over 1,000 yards and Zach Charbonnet run for 12 touchdowns, the most by a Seahawks player since Marshawn Lynch in 2024. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks' Charles Cross signs largest contract extension in team history for non-QB - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/05/e620258a-d89b-4eb3-b995-270fab2b1563/thumbnail/1200x675/38dfbd1b92c8e797e12d8e5758347650/cross.png"
      ],
      "datePublished": "2026-01-05T00:35:49.000Z",
      "dateModified": "2026-01-05T00:35:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Yankees eye Edward Cabrera, Red Sox make 'aggressive' offer for Bregman - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-bo-bichette-phillies-alex-bregman-red-sox-blue-jays/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/380727d0-4827-4d77-8f2d-8f952cdd2330/thumbnail/1200x675/483e7ad6ac35c96decbd291bb21e415b/cabrera-getty.png",
    "tag": "Sports",
    "date": "2026-01-04T19:13:33.000Z",
    "description": "\n        The 2025-26 Major League Baseball offseason is ongoing, and with the new year having come and gone we're working our way deeper into the spor",
    "body": "\n        The 2025-26 Major League Baseball offseason is ongoing, and with the new year having come and gone we're working our way deeper into the sport's offseason calendar. With plenty of name free agents and trade candidates still on the board, there's a daily supply of rumors and reporting regarding them. Speaking of which, you can find Sunday's roundup just below. Yankees eyeing trade for starting pitcherThe Yankees have been quiet thus far in the offseason of 2025-26, but they have work to do and needs to address. Speaking of which, the club is looking to fortify the rotation, and at present they're looking to the trade market to do so. On that front, they've talked to the Marlins about right-hander Edward Cabrera and to the Brewers about right-hander Freddy Peralta, according to The Athletic. \nCabrera turns 28 in April and is under team control through the 2028 season. He owns a career ERA+ of 108 and is coming off his best and healthiest season to date. Peralta, 29, is entering his walk year and has rather quietly established himself as one of the top starters in baseball. He's reached or topped 200 strikeouts in each of the last three seasons, and for his career he's pitched to a 117 ERA+ and a 3.66 FIP. Last season, Peralta earned an All-Star selection and placed fifth in the NL Cy Young vote. On the Cabrera front, the Yankees may have company, as the Mets, Cubs, Astros, and Orioles also all have some level of interest, according to Barry Jackson of the Miami Herald. When healthy, the Yankees' rotation is a strong one, but Gerrit Cole, Carlos Rodón, and Clarke Schmidt are all expected to open the 2026 season in the injured list as they recover from various elbow surgeries. \nPhillies among big-name teams in on Bichette\nShortstop Bo Bichette, who might also make sense at third or second for some teams, is among the most coveted free agents on the market. Not surprisingly, a number of high-profile teams have interest in the 27-year-old Bichette, who boasts a career OPS+ of 121 and is coming off an impressive bounce-back campaign in 2025. The Phillies, Yankees, Cubs, Dodgers, and incumbent Blue Jays are among the teams with varying levels of interest in Bichette, Jon Heyman of the New York Post reports. Earlier in the offseason, CBS Sports ranked Bichette as the No. 3 available free agent in the current class. Red Sox favorites to retain Bregman\nVeteran infielder Alex Bregman is back on the market after an \"excellent when healthy\" 2025 season with the Red Sox. He also happens to be our second-ranked free agent of the winter. Here's part of R.J. Anderson's write-up of Bregman from earlier in the offseason: \"Bregman, one of the last notable free agents to sign last winter, showed no ill effects of being left in the cold. He kept alive his streak of having never finished worse than 15% above the league-average hitter, and for the first time in his career, he joined the 90-90 club -- that is, a 90% in-zone contact rate and a 90 mph average exit velocity. Bregman can still pick it at third base, too. It's fair to wonder how his pull-happy slugging would play in a less favorable home offensive environment than the ones he's haunted to date, but he's a good player who ought to land a better contract than three years and $120 million this go around.\"His market, like that of many other premium free agents, has been a bit slow to develop, but things may be starting to crystallize. Speaking of which, the Red Sox have made an \"aggressive\" offer to bring Bregman back, and there's a strong chance he returns to Boston, ESPN's Buster Olney reports. The Red Sox, coming off a return to postseason play last year, have been one of the most aggressive teams of the winter and re-upping with Bregman could be the capstone on their offseason. \nWhat's next for Blue JaysSpeaking of AL East teams that have been aggressive this offseason, the Blue Jays are fresh off adding slugger Kazuma Okamaoto out of Japan on a four-year free-agent contract. Okamoto is expected to log plenty of time at third base for Toronto in the season to come, and that means they're probably out on the aforementioned Alex Bregman, the Athletic reports. However, that does not necessarily rule out the Jays when it comes to bringing back shortstop Bo Bichette, as noted above. Likewise, they may still have some level of interest in outfielder Kyle Tucker, the top free agent of this winter's class. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Yankees eye Edward Cabrera, Red Sox make 'aggressive' offer for Bregman - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/380727d0-4827-4d77-8f2d-8f952cdd2330/thumbnail/1200x675/483e7ad6ac35c96decbd291bb21e415b/cabrera-getty.png"
      ],
      "datePublished": "2026-01-04T19:13:33.000Z",
      "dateModified": "2026-01-04T19:13:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengals coach Zac Taylor upset over game delay after Myles Garrett's sack record - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/zac-taylor-upset-for-officials-pausing-bengals-browns-game-following-myles-garretts-sack-record/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/0f61f784-6338-4b81-8f3e-25a2216ecf68/thumbnail/1200x675/b43fc50fa56430e38435bc24333aa1b4/garrettrecord.png",
    "tag": "Sports",
    "date": "2026-01-04T22:29:05.000Z",
    "description": "\n        Not everyone was in a celebratory mood after Myles Garrett broke the NFL's single-season sack record. Specifically, Bengals coach Zac Taylor ",
    "body": "\n        Not everyone was in a celebratory mood after Myles Garrett broke the NFL's single-season sack record. Specifically, Bengals coach Zac Taylor did not appreciate the official's decision to briefly pause the game after Garrett made history with just over five minutes remaining and the Bengals trying to score the go-ahead touchdown. Taylor was visibly upset after the game was temporarily paused after Garrett took down Joe Burrow to record his record 23rd sack of the season. Cincinnati, down 17-12 at the time, ended up punting after not gaining a yard on the next two plays. Taylor made it clear afterward that he didn't appreciate how the situation was handled. \"There's five minutes left in our season,\" Taylor said. \"We're playing for our lives here. I was never told that we're going to stop the game. In a critical moment like that, the refs just said that they made a decision that they were going to stop the game. They said they tried to do it as quickly as possible. I didn't feel that.\"\nWhile Garrett's record was being acknowledged, the Bengals tried to quickly run another play but to no avail. \"We didn't sub,\" Taylor said. \"We're trying to be on the ball and go and play with tempo. The umpire just held the ball so that we couldn't do anything. And I'm yelling at Joe, 'Get on the ball.' ... And so again, trying to get an answer was not easy. They just said that they made a decision as a crew to stop the game when that happened. I guess it didn't matter when it happened.\"\nTaylor reiterated that he was not informed prior to kickoff that the officials would temporarilly pause the game if Garrett got the record. \n\"They didn't say one word,\" Taylor said. \"We meet with [the officials] in the 90-minute meeting before the game. They didn't they never said one word about that.\"While Cincinnati (6-11) had already been eliminated from the postseason, Taylor's frustration is a reflection of his and his team's desire to win every game regardless of the situation. The Bengals, like the Browns, were trying to end their season with a win over a division rival while having one final positive moment to carry into the offseason. The Bengals were able to take the lead on their final offensive possession of the season on a Burrow touchdown pass to Ja'Marr Chase. The Browns, however, pulled off the win after Andre Szmyt drilled a 49-yard field goal as time expired. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengals coach Zac Taylor upset over game delay after Myles Garrett's sack record - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/0f61f784-6338-4b81-8f3e-25a2216ecf68/thumbnail/1200x675/b43fc50fa56430e38435bc24333aa1b4/garrettrecord.png"
      ],
      "datePublished": "2026-01-04T22:29:05.000Z",
      "dateModified": "2026-01-04T22:29:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amorim's Man United future: 'I will do my job for 18 months and then we move on' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/ruben-amorim-future-manchester-united-leeds-draw-premier-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/84d4fe62-eb97-4b03-8f10-2f4355eb118a/thumbnail/1200x675/33493cacea68b64627924a651836977b/amorim.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:04:14.000Z",
    "description": "\n        Manchester United's Ruben Amorim is once again showing signs of discontent at the club, declaring on Sunday that he intends to stay in the jo",
    "body": "\n        Manchester United's Ruben Amorim is once again showing signs of discontent at the club, declaring on Sunday that he intends to stay in the job until his contract expires – though he may \"move on\" after the fact.Amorim's comments came after a 1-1 draw at Leeds United, the hosts striking first courtesy of Brenden Aaronson in the 62nd minute before Matheus Cunha notched an equalizer three minutes later. It was a somewhat evenly contested match and leaves United in fifth place on the Premier League table, still well within touching distance of a UEFA Champions League spot, though the Red Devils now have just one win in their last five matches.That run of form has added another hurdle in a bumpy tenure at United for Amorim, who took the helm in November 2024, though his comments on Sunday suggested the disconnect between him and the club's higher-ups may be down to more than just results.\"I came here to be the manager of Manchester United, not to be the coach of Manchester United, and that is clear,\" Amorim said. \"I know that my name is not [Thomas] Tuchel, it's not [Antonio] Conte, it's not [Jose] Mourinho, but I'm the manager of Manchester United, and it's going to be like this for 18 months or when the board decides to change, so that was my point. I want to finish with that. I'm not going to quit. I will do my job until [an]other guy is coming here to replace me.\"\nAmorim also suggested that all parties involved might be willing to end things when his contract expires, even as criticism mounts amidst a poor run of form.\"I just want to say I'm going to be the manager of this team, not just the coach, and I was really clear on that, and that is going to finish in 18 months, and then, everyone is going to move on,\" Amorim continued. \"That was the deal. That is my job – not to be a coach. If people handle the [Sky Sports broadcaster] Gary Nevilles and the criticisms of everything, we need to change the club … I just want to say that I came here to be the manager of Manchester United, not to be the coach and every department – the scouting department, the [sporting] director needs to do their job. I will do mine for 18 months, and then we move on.\"Amorim has made his dissatisfaction with United's power players clear over the last several weeks, including through comments on Christmas Eve that the club needs to put in \"time and money\" to make his preferred 3-4-3 system work. He admitted, though, on Friday in a pre-match press conference that there are \"no conversations\" about bringing in players during the January transfer window and that questions on that front should be directed towards United's director of football Jason Wilcox.\nThe manager's contract expires at the end of the 2026-27 season and includes an option to extend the deal by another year.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amorim's Man United future: 'I will do my job for 18 months and then we move on' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/84d4fe62-eb97-4b03-8f10-2f4355eb118a/thumbnail/1200x675/33493cacea68b64627924a651836977b/amorim.jpg"
      ],
      "datePublished": "2026-01-04T20:04:14.000Z",
      "dateModified": "2026-01-04T20:04:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff picture Week 18: Every NFC and AFC seed, clinching scenario & wild card matchup - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-playoff-scenarios-week-18-seeds-clinching-paths-wild-card-matchups/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/95f0440e-5965-450c-900c-485758fd3de6/thumbnail/1200x675/d1b21d089392e95b481220cbde448cf1/nix.jpg",
    "tag": "Sports",
    "date": "2026-01-05T00:48:19.000Z",
    "description": "\n        The final week of the NFL season always seems to get crazy and this year has been no different. Heading into Week 18, there were four divisio",
    "body": "\n        The final week of the NFL season always seems to get crazy and this year has been no different. Heading into Week 18, there were four division titles up for grabs, but three of those have now been clinched, including an NFC South race that ended in the most unlikely way possible. The Buccaneers and Panthers had to wait until the end of the New Orleans-Atlanta game on Sunday to find out who would win the division title. The Panthers ended up clinching their first NFC South title in 10 years after the Falcons beat the Saints, 19-17. With the win, the Falcons improved to 8-9, which created a three-way tie atop the NFC South and the Panthers had the tiebreaker in that scenario. In the AFC South, there was no drama. The Jaguars needed to beat the Titans to clinch the division title and they ended up destroying Tennessee, 41-7. The win means that the Jags have now won the AFC South for just the second time in eight seasons. The NFC West race is also over and that ended on Saturday night. The Seahawks clinched the division title and the No. 1 overall seed in the NFC with a dominant 13-3 win over the 49ers. That means the Seahawks will get a bye in the opening round of the playoffs while the 49ers will be forced to hit the road for the wild card round.\nThe bye in the AFC will be going to the Broncos, who clinched the No. 1 seed with a 19-3 win over the Chargers. There's still one playoff spot up for grabs and that will be settled on Sunday night when the Steelers host the Ravens. The winner will advance to the postseason while the loser will be sent home for the year. So what do the playoffs look like right now? Glad you asked. We're going to break down the entire playoff field here. .\nAFC playoff standings\n                            \n    \n                                                \n                    \n    1. Denver Broncos (14-3)Clinched AFC WestPlayoff seed: Clinched No. 1Wild-card opponent: Clinched first-round byeAll the Broncos had to do to clinch the AFC's top seed was beat a Chargers team that was resting its starters and that's exactly what Denver did. The 19-3 win wasn't pretty, but it means the Broncos will be getting a bye in the wild-card round. This is the first time the Broncos have had the top seed since 2015. Ten years ago, they ended up winning the Super Bowl in a game played at Levi's Stadium, the same location that will be hosting Super Bowl LX. \n                            \n    \n                                                \n                    \n    2. New England Patriots (14-3)Clinched AFC EastPlayoff seed: Clinched No. 2Wild-card opponent: ChargersWith the Broncos win on Sunday, that eliminated the Patriots from possibly earning the No. 1 seed, but New England did clinch the No. 2 seed with a blow out win over the Dolphins. The Patriots will now open the postseason next week against the Chargers. Tom Brady's final home playoff win with New England came against the Chargers, and now, Drake Maye will hav a chance to pick up his first career playoff win against the same team.  \n\n                            \n    \n                                                \n                    \n    3. Jacksonville Jaguars (13-4)Clinched AFC SouthPossible playoff seed: Clinched No. 3Wild-card opponent: BillsThe Jaguars clinched the AFC South on Sunday with a dominating 41-7 win over the Titans. That means Jacksonville will officially be hosting a playoff game and that will come against a Bills team that hasn't won a road playoff game since the 1992 season. \n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (9-7)Possible seed: 4 or out of playoffsPossible wild-card opponent: Texans The Steelers' route to the playoffs is pretty simple: They have to beat (or tie) the Ravens on Sunday night. If the Steelers lose, their season will be over. If they win, they'll host the Texans in the wild-card round.\n\n                            \n    \n                                                \n                    \n    5. Houston Texans (12-5)Clinched playoff spotPlayoff seed: Clinched No. 5Possible wild-card opponent: Steelers or RavensThe Texans had a chance to win the AFC South going into Week 18, but that went out the window after Jacksonville destroyed Tennessee. However, the Texans wild 32-30 win over the Colts does mean that Houston has clinched the fifth-seed. The Texans will be heading to either Baltimore or Pittsburgh for the wild-card round next week. \n                            \n    \n                                                \n                    \n    6. Buffalo Bills (12-5)Clinched playoff spotPlayoff seed: Clinched No. 6Wild-card opponent: JaguarsThe Bills took care of business on Sunday with a 35-8 win over the Jets and they were able to officially clinch the sixth seed after the Chargers lost to the Broncos. The Bills and Texans finished with the same record, but Buffalo is behind Houston due to a head-to-head loss back in Week 12.   \n\n                            \n    \n                                                \n                    \n    7. Los Angeles Chargers (11-6)Clinched playoff spotPossible playoff seed: Clinched No. 7Possible wild-card opponent: PatriotsThe Chargers were the sixth-seed going into Week 18 and they could have stayed there with a win over Denver, but instead, the Chargers rested their starters and ended losing to the Broncos. The loss means that Los Angeles will be heading across the country to New England for the wild card round. The Chargers are 1-2 in the eastern time zone this year. \n                            \n    \n                                                \n                    \n    STILL ALIVE: Ravens (8-8)Possible seed: 4 or out of playoffsPossible wild-card opponent: TexansThe Ravens will face the Steelers on Sunday night with the AFC North on the line. This is essentially a playoff game because the loser will see their season end. If the Ravens win, they'll be hosting a playoff game in Baltimore next week. \nAFC wild card games based on current standings(7) Chargers at (2) Patriots (6) Bills at (3) Jaguars (5) Texans at (4) Steelers/Ravens Bye: BroncosNFC playoff standings\n                            \n    \n                                                \n                    \n    1. Seattle Seahawks (14-3)Clinched NFC WestPlayoff seed: Clinched No. 1Wild-card opponent: Clinched first-round byeThe Seahawks officially clinched the NFC West and the top seed in the NFC with their 13-3 win over the 49ers on Saturday night. This is the fourth time in franchise history that the Seahawks have earned the No. 1 overall seed. In each of the three previous instances (2005, 2013, 2014), Seattle made it to the Super Bowl. Thanks to the bye, the Seahawks won't be back on the field until the divisional round (Jan. 10 or 11). \n\n                            \n    \n                                                \n                    \n    2. Chicago Bears (11-6)Clinched NFC NorthPossible playoff seed: Clinched No. 2Wild-card opponent: PackersThe Bears lost a thriller to the Lions and that could have cost them the No. 2 seed, but the Eagles weren't able to take advantage of the opportunity. Philadelphia lost to the Commanders 24-17, which officially clinched the second seed for Chicago. The Bears will now be hosting the Packers next week in what will be their third meeting of the season. The series is currently tied 1-1. These two teams haven't met in the postseason since the 2010 NFC Championship, a game won by the Packers. \n                            \n    \n                                                \n                    \n    3. Philadelphia Eagles (11-6)Clinched NFC EastPossible playoff seed: Clinched No. 3Wild-card opponent: 49ers\nThe Eagles rested their starters on Sunday and that led to a 24-17 loss to Washington. If the Eagles had won, they would have moved up to the two-seed, but instead, they'll stay at three spot and they'll now be hosting the 49ers next week.\n                            \n    \n                                                \n                    \n    4. Carolina Panthers (8-9) Clinched NFC SouthPlayoff seed: Clinched No. 4Possible wild-card opponents: RamsAfter losing to the Buccaneers on Saturday, the Panthers only had one hope of winning the NFC South: They needed the Falcons to beat the Saints and that's exactly what happened. The win by the Falcons created a three-way tie atop the NFC South at 8-9, and the Panthers win that because they have the best head-to-head record among the three tied teams (the Panthers went 3-1 against the Bucs and Falcons. The Bucs went 2-2 against Carolina and Atlanta. The Falcons went 1-3 against the other two). This marks the first time since 2015 that the Panthers have won the division. The Panthers will now host a Rams team that they beat back in Week 13. \n\n                            \n    \n                                                \n                    \n    5. Los Angeles Rams (12-5)Clinched playoff spotPlayoff seed: Clinched No. 5Wild-card opponent: PanthersThe Rams clinched the fifth seed with a win over Arizona on Sunday. The Rams will now head to Carolina to face a Panthers team that actually beat them earlier this season. Back in Week 13, the Panthers pulled off one the biggest upsets of the year with a 31-28 win over the Rams. \n                            \n    \n                                                \n                    \n    6. San Francisco 49ers (12-5)Clinched playoff spotPossible playoff seed: Clinched No. 6Wild-card opponent: EaglesThe 49ers had a chance to clinch the NFC's No. 1 overall seed on Saturday, but they came up short against the Seahawks, and now, they've fallen all the way down to the sixth spot. The 49ers will be heading to Philadelphia for the wild-card round and if they can somehow win three straight playoff games, they would get to play Super Bowl LX in their home stadium. \n                            \n    \n                                                \n                    \n    7. Green Bay Packers (9-7-1)Clinched playoff spotPossible playoff seed: Clinched No. 7Possible wild-card opponents: BearsHeading into Week 18, the Packers were the only playoff team that had clinched its seed for the postseason, which explained why Matt LaFleur rested several starters in a 16-3 loss against the Vikings on Sunday. The Packers are now headed to the playoffs where they'll face the Bears for the third time since Dec. 7. \n                            \n    \n                                                \n                    \n    ELIMINATED: Tampa Bay Buccaneers (8-9) Playoff seed: Out of playoffsThe Buccaneers pulled off a huge win over the Panthers on Saturday, but to clinch the division title, they also needed the Falcons to lose on Sunday and that didn't happen. The Buccaneers had won the NFC South in four straight years, but their reign is now over. NFC wild card games(7) Packers at (2) Bears (6) 49ers at (3) Eagles (5) Rams at (4) Panthers Bye: Seahawks\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff picture Week 18: Every NFC and AFC seed, clinching scenario & wild card matchup - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/95f0440e-5965-450c-900c-485758fd3de6/thumbnail/1200x675/d1b21d089392e95b481220cbde448cf1/nix.jpg"
      ],
      "datePublished": "2026-01-05T00:48:19.000Z",
      "dateModified": "2026-01-05T00:48:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prisco's Week 18 NFL picks: Steelers vs. Ravens prediction and more best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/priscos-week-18-nfl-picks-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/31/3718fb19-12cc-4ed4-ab8d-65f7a9df74da/thumbnail/1200x675/01bee90204394c0e18cce768911a072f/aaron-rodgers.jpg",
    "tag": "Sports",
    "date": "2026-01-04T17:18:03.000Z",
    "description": "\nPicking the entire NFL slate in the final two weeks of the season is really challenging.Who is playing? Where's the motivation? Which players have th",
    "body": "\nPicking the entire NFL slate in the final two weeks of the season is really challenging.Who is playing? Where's the motivation? Which players have their minds on Cancun and Aruba? Those are my excuses for having a terrible Week 17. I went 7-8-1 against the spread and 8-8 straight up. Not good.My ATS record for the season is now 131-122-3, and my straight-up record is 167-88-1. The goal before the season was to at least be over .500 in both categories. One is a lock. The ATS one is close.So that means in one of the toughest weeks to pick games, I have to rebound.Let's just hope with these picks I've figured out who has their mind on tropical locales and not football.Aruba, Jamaica, ooh I want to take you … anywhere but the NFL field.Not yet, fellas. One more week for some and even more for others. It's just trying to gauge the want-to that makes this week so tough.All Week 18 NFL betting lines via DraftKings Sportsbook.New Orleans Saints (+3.5) at Atlanta Falcons\nBoth of these teams come in playing good football, even if they've both been eliminated. The Falcons beat the Rams on Monday night and looked good on both sides of the ball. The Saints have found something in rookie passer Tyler Shough. I think he continues to play well as the Saints win it late.Pick: Saints 23, Falcons 21New York Jets at Buffalo Bills (-7)\nThe Bills are playing only for seeding, so it will be interesting to see how they handle this one. Do they sit Josh Allen? Does it matter? The Jets are so bad right now that it won't. They are lifeless. Bills take it -- no matter who plays.Pick: Bills 27, Jets 12\n        \n            \n                NFL playoffs: Ranking the wild card matchups we want to see most heading into Week 18\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nDetroit Lions at Chicago Bears (-3)\nThe Bears are playing for seeding, while the Lions are looking to vacation spots. The Lions haven't played well down the stretch, while the Bears have on offense. The Lions playing outside have been a different team in recent years, but the Chicago defense is not good right now. This is a shootout, with the Bears taking it.Pick: Bears 31, Lions 27Cleveland Browns (+7.5) at Cincinnati Bengals\nThe battle of Ohio means nothing other than pride. Both teams are coming off impressive victories. The story here is whether Myles Garrett can get a sack to break the single-season sack record. Joe Burrow has been playing well, so look for that to continue. Bengals win it, but Garrett gets the sack record.Pick: Bengals 30, Browns 24Los Angeles Chargers at Denver Broncos (-12.5)\nThe Chargers have decided they don't care about this game, sitting Justin Herbert, while the Broncos are playing for the top seed in the conference after locking up the division last week. Look for that Denver defensive front to get after Trey Lance. This will be bad, with nothing really at stake for the Chargers.Pick: Broncos 30, Chargers 17Indianapolis Colts at Houston Texans (-10.5)\nThe Texans can still win the AFC South with a victory and a loss by the Jaguars. The Colts are done, which is why they are starting rookie Riley Leonard. He will be overwhelmed by that Texans defense. This will be ugly. Texans big.Pick: Texans 30, Colts 13Tennessee Titans at Jacksonville Jaguars (-12.5)\nIf the Jaguars win this one, they are the AFC South champions. The Titans would love to ruin that party. But the Jaguars are one of the hottest teams in the league, and the Titans' pass defense is a major issue. Look for a big game from Trevor Lawrence.Pick: Jaguars 31, Titans 17Arizona Cardinals at Los Angeles Rams (-7.5)\nThe Rams will play their starters here after losing two straight. They need to get back on track. Matthew Stafford threw three interceptions on Monday night, but this Arizona defense has major problems. Look for the Rams to get back to playing playoff-like football.Pick: Rams 30, Cardinals 14Kansas City Chiefs (-5.5) at Las Vegas Raiders\nThe Raiders need to lose. Yes, they need to lose. If they do, they get the top draft pick. The problem is this version of the Chiefs isn't very good. With Chris Oladokun starting at quarterback, they are still better than the Raiders. Chiefs win it.Pick: Chiefs 24, Raiders 16\n        \n            \n                Wilson's 2026 NFL mock draft 4.0: Raiders take Fernando Mendoza with No. 1 pick; Cowboys beef up the trenches\n                \n                    Ryan Wilson                \n            \n                            \n    \n                \n                    \n    \nGreen Bay Packers (+6.5) at Minnesota Vikings\nThe Packers are locked into the seventh spot, while the Vikings are looking to the offseason. But the Minnesota defense has been dominant the past eight weeks. The Packers have quarterback injuries on a team playing for nothing, so look for the Vikings to win it behind their defense.Pick: Vikings 23, Packers 21Miami Dolphins (+10.5) at New England Patriots\nThe Dolphins are playing for nothing, while the Patriots have a chance at the top seed. The cold weather has been a problem for Miami, and this will be a challenge in terms of motivation. Look for the Patriots to roll here as Drake Maye continues his quest for the MVP, but Miami will score with the running game.Pick: Patriots 28, Dolphins 19Dallas Cowboys at New York Giants (+3.5)\nThe Cowboys are back out on the road for a second straight week after beating the Commanders last week. This will be the final game for interim coach Mike Kafka in New York. The Giants played well in beating the Raiders, but this Cowboys team can score. Even so, look for the Giants to keep it close.Pick: Cowboys 29, Giants 27Washington Commanders at Philadelphia Eagles (-7)\nThe Eagles are playing for the possible No. 2 seed, while the Commanders are playing for nothing. The Eagles beat up on the Commanders two weeks ago, and that will likely be the case here as well. The Eagles need to get the offense going, and this is the perfect tonic for it. Eagles big.Pick: Eagles 29, Commanders 10Baltimore Ravens at Pittsburgh Steelers (+3.5)\nWith the Steelers losing Sunday, this is for the division title and a berth in the playoffs. Loser goes home. The status of Ravens quarterback Lamar Jackson will be big here. If he plays with the bad back, how healthy will he be? The Steelers clearly missed DK Metcalf last week as he's serving a two-game suspension, and he will be missed here. But the Ravens defense is a mess. Steelers take it.Pick: Steelers 23, Ravens 17\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prisco's Week 18 NFL picks: Steelers vs. Ravens prediction and more best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/31/3718fb19-12cc-4ed4-ab8d-65f7a9df74da/thumbnail/1200x675/01bee90204394c0e18cce768911a072f/aaron-rodgers.jpg"
      ],
      "datePublished": "2026-01-04T17:18:03.000Z",
      "dateModified": "2026-01-04T17:18:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers RB Emanuel Wilson registers worst NFL carry in 31 years - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-rb-emanuel-wilson-nfl-carry/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/8e44da26-2db6-4481-aae9-4441e5e6cbb7/thumbnail/1200x675/4d1ebe8df65bb61c1cf8d91345524952/em.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:44:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers sat a large number of starte",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Green Bay Packers sat a large number of starters in their Week 18 matchup against the Minnesota Vikings, as they are locked into the No. 7 seed in the NFC. Games like this provide opportunities for players that usually do not get many snaps to stand out, but late in the second quarter, Packers running back Emanuel Wilson stood out in the wrong way.On a rushing attempt, the Vikings defense stood up Wilson behind the line of scrimmage. He then decided to run backwards before being taken down for a loss of 18 yards. \nThe last running back to lose 18 or more yards on a carry without a fumble was Jon Vaughn of the Seattle Seahawks on Sept. 18, 1994, when he lost 20 yards on a rushing attempt, according to CBS Sports Research. Wilson's carry was the worst NFL carry in 31 years.\nOverall, Wilson has been solid this year when playing in the place of Josh Jacobs. He entered Sunday with 452 yards rushing and three touchdowns on a career-high 107 carries. That includes a 107-yard, two-touchdown performance against the Vikings in Week 12. However, his loss of 18 yards is a play he'd like to forget soon. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers RB Emanuel Wilson registers worst NFL carry in 31 years - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/8e44da26-2db6-4481-aae9-4441e5e6cbb7/thumbnail/1200x675/4d1ebe8df65bb61c1cf8d91345524952/em.jpg"
      ],
      "datePublished": "2026-01-04T20:44:14.000Z",
      "dateModified": "2026-01-04T20:44:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts run back-to-back fake punts, including one on first down vs. Texans - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-fake-punt-first-down-texans-back-to-back/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/0912e87c-a9cf-4c8d-9152-d907a42cf9a9/thumbnail/1200x675/5e704735735c154f8c0f9e1f8eeee080/colts.jpg",
    "tag": "Sports",
    "date": "2026-01-04T20:45:18.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indianapolis Colts have made some bizarre fake",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Indianapolis Colts have made some bizarre fake punt calls over the years, and they added to that lore with an interesting decision Sunday against the Texans.During the first quarter, the Colts called for a fake punt on back-to-back plays, including one that came on first down. On the surface, it sounds like an absolutely crazy decision, but it actually made some sense.The first fake punt came on a fourth-and-5 from Indy's own 25-yard line. Rigoberto Sanchez took the snap and, instead of punting, lofted a perfect pass to Mo Alie-Cox for a 16-yard gain. After picking up the first down, the Colts hustled to the line and ran ANOTHER fake punt. The Texans were in the process of subbing their regular defense back onto the field and weren't ready for the second fake, resulting in a penalty for having too many players on the field.\nThe drive ended with the Colts kicking a field goal, so the 21 yards gained on the two fake punt plays ended up working out well for Indianapolis. The fact that the Colts ran a fake punt on first down was almost fitting, because if there's one team that knows a thing or two about bizarre fake punts, it's definitely them. Back in 2015, the Colts ran what was arguably the most ill-conceived fake punt in the history of the NFL.\nThat one didn't work 10 years ago, but their fake punt did work on Sunday in Houston. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts run back-to-back fake punts, including one on first down vs. Texans - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/0912e87c-a9cf-4c8d-9152-d907a42cf9a9/thumbnail/1200x675/5e704735735c154f8c0f9e1f8eeee080/colts.jpg"
      ],
      "datePublished": "2026-01-04T20:45:18.000Z",
      "dateModified": "2026-01-04T20:45:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's at stake in Steelers-Ravens showdown? It's not just the AFC North title - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/whats-at-stake-in-steelers-ravens-showdown-including-the-futures-of-mike-tomlin-john-harbaugh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/c55108c6-37bb-46a4-8afa-df067df52d97/thumbnail/1200x675/77a85be4e59e629d47401e58f3059e5f/harbaughtomlin.png",
    "tag": "Sports",
    "date": "2026-01-04T17:23:36.000Z",
    "description": "\n        \"Welcome to AFC North championship week, as I like to refer to it.\"Mike Tomlin kicked off his weekly presser with a somewhat light-hearted re",
    "body": "\n        \"Welcome to AFC North championship week, as I like to refer to it.\"Mike Tomlin kicked off his weekly presser with a somewhat light-hearted reference to what's at stake when the Steelers and Ravens face off Sunday night in what will be the final game of the 2025 regular season. Pittsburgh (9-6) will host Baltimore (8-8) in a game that will determine which team wins the AFC North and the playoff spot that comes with it, and which team will be going home for the winter. Turbulent would be an adequate way to sum up how both the Steelers and Ravens' seasons have gone so far. The Ravens started 1-5 before winning five straight and temporarily leapfrogging Pittsburgh in the division standings. A 1-3 late-season slide (including a Week 14 loss to Pittsburgh), however, left the Ravens on the brink of elimination entering Week 17. \n        \n            \n                NFL Week 18 odds, predictions, expert picks: Who will win the AFC North? Can Broncos clinch AFC's top seed?\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nBaltimore needed a win in Green Bay last Saturday night, and a Steelers loss in Cleveland the following Sunday, in order to force a winner-take-all Week 18 showdown with rival Pittsburgh, who entered last weekend with three straight wins following a 6-6 start. \nThe Ravens did their part by recording a convincing 41-24 win over the Packers that included 216 yards and four touchdowns on the ground by superstar running back Derrick Henry. Baltimore then watched with glee the following day as Aaron Rodgers struggled throughout Pittsburgh's eventual 13-6 loss to the lowly Browns that prevented the Steelers of capturing their first division crown in five years. Sunday's game is obviously big, but not solely because of its playoff implications. Here's what also might be at stake when the Steelers and Ravens add another chapter to their compelling rivalry. Tomlin's future in Pittsburgh  While Mike Tomlin and John Harbaugh have enjoyed Hall of Fame caliber careers, both have their share of critics after enduring several seasons that have fallen short of expectations. That has prompted speculation regarding both coaches' futures beyond this season. \nThe noise was extremely loud regarding Tomlin's future in Pittsburgh after five losses over a seven-game span left his team at 6-6 through 12 games. Tomlin has two years left on his current contract, but the Steelers reportedly have until March 1 to pick up his option for 2027. Pittsburgh hasn't fired a head coach since 1941, so the thought of Tomlin getting relieved of his duties after this season appears as likely as the Steelers intentionally losing a game in order to prevent someone from breaking a record. You can try to talk it into existence, but reality is still reality. Barring something shocking, Tomlin will still be the Steelers' coach in 2026. A loss on Sunday night, however, could impact his status beyond next season. \nA loss on Sunday night would secure Pittsburgh's ninth straight season without a playoff win, the franchise's longest drought without a playoff win since it captured its first postseason win in December of 1972. This would be the Steelers' second season without a playoff win since Tomlin signed his most recent contract extension that was given to him by Art Rooney II with the expectation that Tomlin would \"guide the team back to winning playoff games and championships, while continuing our tradition of success.\"If Pittsburgh loses Sunday night, Tomlin would in all likelihood have two more chances under his current contract to get the Steelers back to winning playoff games. That is unless his reported option for 2027 isn't picked up. While Tomlin will most likely be back in 2026, the Steelers will likely make other changes if their season ends on Sunday night. \nIn terms of the coaching staff, defensive coordinator Teryl Austin might be coaching for his job as his contract is set to expire after this season. From a personnel standpoint, Steelers general manager Omar Khan will have to accept accountability for Pittsburgh's lack of weaponry at receiver -- a weaknesses that was recently heightened by DK Metcalf's suspension -- if the Steelers' season ends at the hands of Baltimore for a second straight year. The Steelers set out last offseason to build a roster that could defeat a Ravens team that had rushed for 299 yards against them in last January's wild-card round loss. Sunday's game will ultimately show if the Steelers accomplished that goal. Harbaugh's future in Baltimore If Tomlin has the best job security of any NFL coach, Harbaugh isn't too far behind him. \nLike Tomlin, Harbaugh has won a Super Bowl, a host of division titles and has led his team to the playoffs numerous times. Unlike Tomlin, though, Harbaugh has had playoff success in recent years. The issue has been that Harbaugh hasn't won enough in the postseason despite having a generational talent in quarterback Lamar Jackson. Harbaugh's teams also lay the occasional egg. While Tomlin has never had a losing season, Harbaugh's Ravens endured a 5-11 season in 2015 and were 8-9 in 2021 after dropping their last five games. This year's Ravens appeared to be destined for another dreadful season after a 1-5 start and losing Jackson for a month due to injury. Baltimore righted the ship, though, starting with an impressive 30-16 win over the eventual NFC North champion Bears. And despite another recent slide and with Jackson continuing to be hampered by injuries, the Ravens are one win away from officially salvaging their season. A loss, however, will give Harbaugh his third losing season in 11 years while largely overshadowing Baltimore's resilience following its 1-5 start. \nRegardless of Sunday's outcome, Harbaugh and his team's resolve this season likely won't be overlooked by Ravens owner Steve Bisciotti, who last offseason gave Harbaugh a three-year extension that runs through the 2028 season. Similar to Tomlin in Pittsburgh, it's incredibly far-fetched to think that Baltimore would part with Harbaugh this offseason despite another season that fell short of expectations.  One can expect a higher sense or urgency from Baltimore this offseason, though. Jackson isn't getting any younger, and Henry will turn 32 on Sunday. Expect the Ravens to be more aggressive this offseason in terms of addressing their weaknesses, especially at receiver and pass rusher, in an effort to avoid being in a similar spot next year. Aaron Rodgers' future in the NFL While Harbaugh and Tomlin's futures for next year are relatively easy to predict, trying to predict what Rodgers will do next year is anything but. \nBased on his presser this week, one thing we know that is that Rodgers hasn't made a decision on whether or not this will be his final NFL season. Because of that, it's safe to assume that how his and the Steelers' season ends will impact his decision. If the Steelers win, Rodgers will have won his final regular season game while also giving Pittsburgh a division title that came at the expense of Pittsburgh's chief rival in front of a national TV audience. A playoff win the following week would make Rodgers' first and possibly final season in Pittsburgh a universal success. His role in helping end Pittsburgh's playoff drought would add to his already glittering legacy as one of the greatest quarterbacks in NFL history. \nAlready considered one of the greatest quarterbacks in NFL history, Aaron Rodgers is trying to close out his eventual Hall of Fame career on a positive note.  \n                                                                    Getty Images\n                                                            Rodgers has a deep knowledge of the NFL and likely understands what it would mean for his legacy to go out like that. While it's not the John Elway exit in Denver (with back-to-back Super Bowl wins and a Super Bowl MVP in his final game), it's certainly wouldn't be a bad way to close out a career. A loss on Sunday, however, would make Rodgers' 2025 season somewhat incomplete. While he had his moments and helped the Steelers set the NFL record for most consecutive non-losing seasons, a loss on Sunday would mimic how his career with the Packers ended after Green Bay lost at home to the visiting Lions in Week 18 of the 2022 season. That loss knocked the Packers out of postseason contention while unceremoniously ending Rodgers' memorable 18-year run in Green Bay. Does Rodgers want to end his career in a similar fashion? While there are certainly worse ways to end a career, it could compel Rodgers to come back for one more shot at ending his career on a good note. \nAt 42, though, and coming off a good but not great season, would Rodgers have many viable options should he choose to come back? \"I mean, not a lot of options, but there'll be options, I would think maybe one or two if I decide I still want to play,\" Rodgers said with a laugh earlier this week. It's safe to assume that the Steelers would elect to run it back with Rodgers in 2026 should he choose to return. Tomlin has made it known that he has enjoyed his season with Rodgers, and next year's quarterback draft class isn't oozing with talent, anyway. A loss on Sunday could change the trajectory of the offseason for the Steelers, however. Pittsburgh was reportedly interested in bringing back Russell Wilson last season before the wheels came off. If the Steelers lose to Baltimore, it could compel them to make seismic changes to the roster for a second straight offseason. All that being said, it would likely take an absolute dreadful performance from Rodgers on Sunday for the Steelers to not consider bringing him back in 2026 if he expresses interest in playing. There's also the prospect of Rodgers deciding to get out while he is still playing relatively well. He knows first-hand what it looks to stick around a year or two too long after witnessing his former teammate, Brett Favre, endure a forgettable final season with the Vikings that included his NFL record of 297 consecutive starts coming to an end. Rodgers struggled against the Browns last week, and another bad game may be enough to convince him that enough is enough. Regardless, rest assured that Sunday's game will impact Rodgers' future in the NFL. Given the stakes of this game, it's possible for it not to. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's at stake in Steelers-Ravens showdown? It's not just the AFC North title - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/c55108c6-37bb-46a4-8afa-df067df52d97/thumbnail/1200x675/77a85be4e59e629d47401e58f3059e5f/harbaughtomlin.png"
      ],
      "datePublished": "2026-01-04T17:23:36.000Z",
      "dateModified": "2026-01-04T17:23:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]