[
  {
    "title": "AJ Dybantsa arrives as an elite player by leading late BYU rally in win vs. Clemson at Madison Square Garden - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/aj-dybantsa-byu-clemson-score-robert-wright-result-highlights-cougars-tigers-madison-square-garden-jimmy-v-classic/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/7175039c-a4b0-437f-b93c-baa027f6c1fc/thumbnail/1200x675/b5a2390b6f8abb8a34b657a183212d9f/ajdybantsacoldec9.jpg",
    "tag": "Sports",
    "date": "2025-12-10T07:48:46.000Z",
    "description": "\n        NEW YORK — Regardless of the franchise that selects him first, second or third in next year's NBA Draft, AJ Dybantsa will inevitably play who",
    "body": "\n        NEW YORK — Regardless of the franchise that selects him first, second or third in next year's NBA Draft, AJ Dybantsa will inevitably play who-knows-how-many games at Madison Square Garden over the next 10, 12, maybe even 15 years of his life.    And yet, for whatever NBA glories might await in the decade-plus to come, there's no guarantee any of his future games in this hallowed building will be as impactful or special as what the 18-year-old did in his debut appearance on Tuesday night at the Jimmy V Classic in BYU's record-setting, come-from-behind, buzzer-beating 67-64 win over Clemson.    This was the night AJ Dybantsa arrived as an elite college player.   The game-deciding shot, ironically, wasn't from the hands and arms of Dybantsa, though. Sophomore guard Rob Wright III was the last-second hero, draining a triple that sent the Cougar fans into hysterics.\"Just go ahead and kick it to me,\" Wright told senior Mihailo Boskovic before the play unfolded. \nThe BYU coaching staff told me afterward that the play — which has multiple names, all of which they are holding as a secret — had Richie Saunders as the first option, Dybantsa as the second and Wright III as, what else, the third. So: Saunders was double-covered as he tried to curl open. Dybantsa juked, but wasn't immediately free. In blazed Wright, who split the space between freshman Zac Foster and senior Butta Johnson and cracked open a cavity that gave him leeway to lift No. 10 BYU to 8-1, in this its final notable nonconference game of the regular season. Wright said it was his first 3-pointer to win a game in his life.  But the only reason BYU was even in a place to win on Wright's shot was because Dybantsa broke through and showed No. 1-overall-pick brilliance. Years down the way, when we look back at the start of his journey, this is the game we'll remember. The same way we remember Carmelo Anthony's debut at Syracuse coming at MSG in 2002 and Zion Williamson's moment of arrival in Duke's debut vs. Kentucky at the 2018 Champions Classic.  And if there's one play that will stand out over the others, it's probably this dunk, a tomahawk down the lane that flipped the momentum for good in BYU's favor as it mauled and bullied Clemson in the second half.   \nHere in Midtown Manhattan, Dybantsa gave college basketball a gift and BYU fans materialization of hope, as he was everything he'd been promised to be. By game's end he logged a career-high 28 points, a career-high nine rebounds and a career-high six assists, with almost all of that statistical workload coming in the second half.    This is the AJ Dybantsa we were promised.   And he was unleashed after Cougars coach Kevin Young was so pissed off he barely had anything to say to Dybantsa and his teammates in the locker room at halftime. Clemson clubbed the Cougars in the first half, closing the final 6:43 on an astonishing 21-0 run to lead 43-22 going into the break. MSG was low on energy — Florida and UConn fans hadn't begun to arrive for the nightcap — and BYU was bizarrely lethargic. As Young left the coaches' room and entered the spacious visitor's locker room, he was a man of few words. Annoyed and fed up with the latest weak first-half effort he saw from his team, he told them it was purely on the players to find a way to win. \n\"He didn't really take too much time,\" Dybantsa told CBS Sports. \"He was like, 'Y'all gotta go fix it.'\"    \"I'm a straight shooter with our guys,\" Young told CBS Sports. \"To a man, I thought they (the Tigers) were playing harder. I really challenged them. There's no secret to winning. You've got to play hard. You've got to execute. I know that sounds super 'coachy,' but they were playing harder than we were. And I thought in the second half that the trench warfare was won by us.\"Young's players responded by holding Clemson to four points for the first 11 minutes and 50 seconds of the second half. As the defense stiffened, Dybantsa sparked to life. He unspooled all of that potential into something tangible, something so impressive, all of us are allowed to believe he and BYU have enough to put the Cougars in Final Four Contender status. Specifically, it was his 22 points, seven rebounds and five assists after the break. \nNo BYU freshman had hit those numbers in a full game in at least 20 years. He outscored Clemson by himself 22-21! He accounted for 34 of BYU's 45 points after halftime. Dybantsa's 28 points is the most by a freshman since TJ Haws had that many in 2017. Soon enough, he'll hit 30, probably 35, maybe even 40.\"I told AJ, 'You have to put two halves together. He can't do this in the Big 12,'\" Dybantsa's father Ace told me after the game. \"If he'd have played in the first half the way he did in the second, he would've had 40.\"There was a dazzling, Jordan-esque fadeaway from the right side, about 15 feet out, that coolly cashed to make it 47-42, Clemson, with 9:55 to go. There was the alley-oop to Keba Keita that gave BYU a 55-54 lead with 3:18 left, one of, like, five head-turning physical moments from Keita that also helped disintegrate Clemson's spirit.\nIn putting on the best game of his young career, Dybantsa also provided BYU with its greatest second-half comeback in school history. The Cougars had never won a game after being down by as many as 22 points at halftime.  \"His processing ability is, I think, probably the most impressive thing about him,\" Young told CBS Sports. There is also a simple, level-setting approach that Young, who spent more than a decade coaching as an NBA assistant, is imparting to Dybantsa. Pick a spot. Go where you want to go, do what you know you can do. Against Clemson in the first half, Dybantsa was getting too comfortable living along the baseline. In the second half, that changed. He emerged a different player.\n\"Like Kevin Durant, something me and Monty Williams would talk about,\" Young said. \"I think they used to use it with Tim Duncan: just pick a spot. That's something he and I have talked about. Tonight, I thought that's where he was at his best, just getting to his spot, raising up, and then the thing I love about him is he's so versatile. You know, he's in pick and roll. He's throwing lobs to Keita. Two huge plays. So he's not just like a one-trick pony. He can do a lot of different things. And to do it on this stage and do it down the stretch, for a young guy in this building? It's pretty cool.\"I asked Dybantsa and Wright the word they'd use to describe what happened in the second half, to come back from 22 down, to do it at their first time playing inside the World's Most Famous Arena. They used the same word at the same time.\"Surreal.\"Then they both smiled. This was a big night for everyone in that program. \"We with each other all day, spending a bunch of time together, so all the stuff that he's doing, I see him do it a million times,\" Wright said of Dybantsa, \"but it feels good to see him doing that at the highest level.\" \nThis Clemson win is the first major milestone at the beginning of a journey dripping with promise and the potential for greatness. A corner has been turned at the quarter-mark of BYU's season.\"That's crazy. Already?\" Dybantsa said when I brought up the timeline. Yep, already. This is going to go by so fast.A quarter of the way into the season and we've been treated not just to a higher-than-usual inventory of really good games, but a bevy of incredible talent. Included in that is maybe the deepest freshman class ever. Dybantsa has always been mentioned at the top of that list, and it's because of what he's capable of doing — what a packed house saw happen here near game's end on Tuesday night and what the nation took in on TV.BYU is good ... but it can be great. If it gets there, it will have to be because of Dybantsa, whose first flash of greatness on the Garden stage doubles as a beacon of legitimate hope for potentially the best season in program history. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AJ Dybantsa arrives as an elite player by leading late BYU rally in win vs. Clemson at Madison Square Garden - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/7175039c-a4b0-437f-b93c-baa027f6c1fc/thumbnail/1200x675/b5a2390b6f8abb8a34b657a183212d9f/ajdybantsacoldec9.jpg"
      ],
      "datePublished": "2025-12-10T07:48:46.000Z",
      "dateModified": "2025-12-10T07:48:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Magic-Heat, Knicks-Raptors in NBA Cup on Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-200-bonus-bets-magic-heat-knicks-raptors-nba-cup-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-09T23:33:27.000Z",
    "description": "\n        The NBA Cup quarterfinals kick off on Tuesday with two must-see matchups, providing sports bettors with a great opportunity to check out the ",
    "body": "\n        The NBA Cup quarterfinals kick off on Tuesday with two must-see matchups, providing sports bettors with a great opportunity to check out the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. The Miami Heat travel to take on the Orlando Magic at 6 p.m. ET, followed by Raptors vs. Knicks at 8:30 p.m. ET. The SportsLine Projection Model has a play from both of these contests included in its Tuesday best bets at DraftKings Sportsbook for online sports betting. The model is backing Under 235.5 total points in Heat vs. Magic, while projecting the Raptors to cover as 4.5-point underdogs at home. Also, one of SportsLine's top experts has a pick on the Tuesday college basketball slate. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight seasons. The model enters Week 8 of the 2025-26 NBA season on a sizzling 29-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Tuesday best bets at DraftKings SportsbookHeat vs. Magic: Under 235.5 pointsRaptors (-4.5) vs. KnicksLong Beach State (+7.5) vs. San Jose StateCombining the model's three picks into a Tuesday parlay at DraftKings would result in a payout of +602 (risk $100 to win $602). Bet it at DraftKings here:\nHeat vs. Magic: Under 235.5 points (-112)The Under has hit in back-to-back Orlando games, and in three of its last four contests, while it has also hit in three straight Miami contests. The Under is 8-3 over the last 11 Heat games, despite Miami having the No. 3 scoring offense in the league. The Magic have consistently been one of the better defensive teams in the league over recent seasons, and that has continued this year as Orlando ranks eighth in scoring defense at 113.6 points per game allowed. Orlando plays its first game without leading scorer Franz Wagner, who suffered an ankle injury, and that could hinder the Magic's scoring. The model projects the Under to hit in 60.3% of simulations. Back the Magic at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Raptors (-4.5) vs. Knicks (-108)The Raptors have lost five of their last six games, but before then, Toronto won 13 of 14 games as a part of a 14-5 start to the season in a roller coaster of a start for Toronto. The Raptors enter Tuesday at 15-10 on the year, but they went 4-0 in NBA Cup contests and the younger, up-and-coming team has clearly prioritized the in-season tournament. Brandon Ingram (21.2 points per game) and Scottie Barnes (20 ppg) make a formidable 1-2 combo, and the Raptors are 8-5 at home this season. The model projects the Raptors to cover in 52% of simulations. Back the Raptors at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Long Beach State (+7.5) vs. San Jose State (-108)\"Having seen the Beach in person last Saturday, we have a new perspective of Chris Acker's bunch,\" legendary SportsLine expert Bruce Marshall said. \"The new faces are beginning to mesh, though there's a good chance Acker will be coaching some of these newcomers for only the rest of this season before they move elsewhere. That would include impressive frosh guard Gavin Sykes, who's scored 20+ points in four of the past five games, while 6-8 Syracuse transfer Petar Majstorovic is scoring almost 17 ppg across the past four. Recent Beach efforts vs. UCSD and UCSB would be good enough keep this one close. Meanwhile, some positives for Tim Miles' SJSU, but the Spartans are looking for reliable options aside from Longwood transfer G Tracy Garland (17.9 ppg).\" Back Long Beach State at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more NBA and college basketball picks?You've seen some of the model's Tuesday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Magic-Heat, Knicks-Raptors in NBA Cup on Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-09T23:33:27.000Z",
      "dateModified": "2025-12-09T23:33:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny headlines Super Bowl LX halftime, Charlie Puth to sing national anthem - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bad-bunny-selected-to-perform-during-2026-super-bowl-lx-halftime-show/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/27b10000-4c0c-4b9b-adf2-035ec54205f2/thumbnail/1200x675/87b565682f39dbf028a0c2b657293c6c/untitled-design-2025-12-09t201649-744.png",
    "tag": "Sports",
    "date": "2025-12-10T04:17:34.000Z",
    "description": "\n        Wether it's the Broncos, Patriots, Rams, Seahawks or any other NFL contender, one thing is for sure -- the roster of singers on Super Bowl Su",
    "body": "\n        Wether it's the Broncos, Patriots, Rams, Seahawks or any other NFL contender, one thing is for sure -- the roster of singers on Super Bowl Sunday are all stars in their own right. In addition to the announcement of Bad Bunny being named the featured halftime performer earlier this season, we know that Charlie Puth, Brandi Carlile and Coco Jones have been added to the list of singers for the big game next February.The Bad Bunny announcement followed months of rumors and predictions, and was made in a subtle way back at the end of September. Headlining the Super Bowl halftime show is one of the top singing gigs of the year, and this was how the 31-year-old singer made the announcement on social media. \nThe Puerto Rican singer is the most-streamed artist in the world. Bad Bunny has 10 Grammy nominations, with three wins. His three Grammy wins are for Best Latin Pop or Urban Album for YHLQMDLG, Best Musica Urbana Album for El Último Tour Del Mundo and Un Verano Sin Ti.Some of his other awards include the American Music Award for Favorite Latin Artist, the BET Award for Single of the Year for his hit song \"I Like It\" with Cardi B and J Balvin and Billboard Top Latin.\nBad Bunny's top songs are \"Vete,\" \"Titi Me Pregunto,\" \"Que Pasaria\" and \"BAILE INoLIDABLE.\" Usually the special guests are announced closer to the championship game. One early guess for a special guest is Cardi B, who is also connected to the NFL because she recently gave birth to boy, the son of Patriots receiver Stefon Diggs. Rapper Kendrick Lamar, who brought out multiple special guests including SZA and Serena Williams, was last year's headliner. Some other iconic halftime performers include Prince, Beyoncé, Rihanna, Paul McCartney, U2 and Bruce Springsteen, just to name a few. The halftime show become a cultural moment for the masses as it is typically the most-watched performance of the year. \nBut the day's festivities begin long before halftime. Multiple artists will perform ahead of the game, including Grammy-nominated singer Charlie Puth, 11x Grammy-winning artist Brandi Carlile and Grammy-winning R&B artist Coco Jones.\"Charlie, Brandi, and Coco are generational talents, and we are honored to have them -- alongside our extraordinary deaf performers -- on Super Bowl LX's world stage,\" said Desiree Perez, CEO of Roc Nation. \"This moment embodies the very best of culture, live performance, and our country, perfectly kicking off game day.\" Here's a look at who will perform each pregame song:\"The Star-Spangled Banner\"Charlie Puth and renowned Deaf music artist Fred Beam will perform the national anthem ahead of the big game. Puth is a multi-award winning and multi-platinum singer, songwriter and producer. His hits include \"See You Again,\" \"Attention\" and \"We Don't Talk Anymore.\"\n\"America the Beautiful\"Brandi Carlile and Deaf music performer Julian Ortiz will perform \"America the Beautiful.\" Carlile has an impressive resume that includes an Oscar nomination, two Emmy wins and a book that reached No. 1 on The New York Times' bestsellers list. \"Lift Every Voice and Sing\"\"Lift Every Voice and Sing\" will be performed by Coco Jones and renowned Deaf music artist Fred Beam. Jones has quickly made a name for herself in R&B music, with eight Grammy nominations. Her hit \"ICU\" is platinum certified. She is an actress as well as a musician.The 60th edition of the Super Bowl will be played on Sunday, Feb. 8, 2026, on NBC. The backdrop of the game and performances will be Levi's Stadium in Santa Clara, California, home of the San Francisco 49ers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny headlines Super Bowl LX halftime, Charlie Puth to sing national anthem - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/27b10000-4c0c-4b9b-adf2-035ec54205f2/thumbnail/1200x675/87b565682f39dbf028a0c2b657293c6c/untitled-design-2025-12-09t201649-744.png"
      ],
      "datePublished": "2025-12-10T04:17:34.000Z",
      "dateModified": "2025-12-10T04:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025-26 college football bowl confidence picks: Optimal rankings from proven expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-confidence-pools-2025-26-picks-predictions-optimal-rankings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/080500e6-a9e8-4cfd-97bf-d49b83596f4f/thumbnail/1200x675/d4599bd3f8f1b65b6165e9cd318ba858/marcel-reed-texas-am.jpg",
    "tag": "Sports",
    "date": "2025-12-10T00:47:14.000Z",
    "description": "\n        The 2025-26 college football bowl season kicks off on Saturday when Boise State battles Washington in the 2025 LA Bowl at 8 p.m. ET. Over the",
    "body": "\n        The 2025-26 college football bowl season kicks off on Saturday when Boise State battles Washington in the 2025 LA Bowl at 8 p.m. ET. Over the course of the next five weeks, there will be 46 bowl matchups (including all College Football Playoff games) and the college football bowl schedule includes some stylistically intriguing battles. After being snubbed by the College Football Playoff committee, Notre Dame has chosen not to participate in a bowl, but No. 12 BYU, who was also left out, will play No. 22 Georgia Tech in the Pop-Tarts Bowl on Dec. 27.BYU is a 4.5-point favorite in the latest college football bowl odds, but will they actually show up motivated after it looks like they weren't given serious consideration for the 12-team playoff? Motivation is always a factor during bowl season and it's something that you'll need to consider as you make your college football bowl confidence picks. Before entering any college football bowl confidence pools, be sure to see the college football picks from SportsLine's Thomas Casale.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:A frequent guest on national radio and TV shows to discuss college sports, Casale has been sports betting -- and winning -- for more than 30 years. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns.   So before filling out your college football pool picks or making any college football bets, you need to see Casale's college football bowl picks. He has analyzed each bowl matchup and ordered every game by level of confidence. He's sharing his picks over at SportsLine. New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins:Top college football bowl confidence predictionsOne of the top 2025-26 college football bowl confidence picks from Casale: He likes No. 7 Texas A&M, a 3-5-point favorite, to beat Miami (Fla.) in the first round of the College Football Playoffs. The Aggies finished 11-1 and 7-1 in the SEC, tying for first place, but missed out on playing in the conference championship after losing at Texas 27-17 on Nov. 28. The Hurricanes, who tied for second with four other teams at 6-2 in the ACC and were 10-2 overall, have won four in a row.Quarterback Marcel Reed helps power the A&M offense. The sophomore has completed 61.8% of his passes for 2,932 yards and 25 touchdowns with 10 interceptions and a 153.2 rating. He has also rushed 89 times for 466 yards (5.2 average) and six touchdowns. In a 38-17 win over No. 22 Missouri on Nov. 8, he completed 20 of 29 passes for 221 yards and two touchdowns. Miami, meanwhile, is led by senior quarterback Carson Beck. He has completed 74.7% of his passes this season for 3,072 yards and 25 touchdowns with 10 interceptions and a 165.8 rating. Beck has also rushed for one score. In a 38-7 win over No. 22 Pittsburgh on Nov. 29, he completed 23 of 29 passes for 267 yards and three touchdowns with one interception. See who else to pick here.New users can also check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make college football bowl confidence picks  Casale is also going all-in on an underdog with one of his most confident picks. Picks like these could be the difference between winning your 2025-26 bowl confidence pool and going home empty-handed. You can see who it is and get every pick for every game at SportsLine.So which order should you rank teams in your college football confidence pools, and which underdog do you need to be all-in on? Visit SportsLine to see the full college football bowl confidence picks, and see what teams won't disappoint, all from the college football expert who has been betting - and winning - for more than 30 years.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025-26 college football bowl confidence picks: Optimal rankings from proven expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/080500e6-a9e8-4cfd-97bf-d49b83596f4f/thumbnail/1200x675/d4599bd3f8f1b65b6165e9cd318ba858/marcel-reed-texas-am.jpg"
      ],
      "datePublished": "2025-12-10T00:47:14.000Z",
      "dateModified": "2025-12-10T00:47:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks for Week 15, score predictions, best bets from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-15-picks-score-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/27/34063cfe-519d-40c4-adf6-7c4bd23a7968/thumbnail/1200x675/69ae4dcf073065e58840192f7c416da9/imagn-dak-prescott-cowboys-pregame.jpg",
    "tag": "Sports",
    "date": "2025-12-10T00:45:46.000Z",
    "description": "\nThe Week 15 NFL schedule features 16 more games, including several with potential playoff ramifications. One such game is an AFC East battle between ",
    "body": "\nThe Week 15 NFL schedule features 16 more games, including several with potential playoff ramifications. One such game is an AFC East battle between the Buffalo Bills (9-4) and New England Patriots (11-2). Buffalo is favored by 1.5 points as Josh Allen and the Bills take on Drake Maye and the Patriots. Buffalo is on a two-game winning streak, while New England has won 10 straight. Another key matchup is between two NFC contenders as the Detroit Lions (8-5) clash with the Los Angeles Rams (10-3). The Lions are battling for a playoff spot, while the Rams are seeking to retain the No. 1 seed in the conference. The Rams enter as 5.5-point home favorites. Sunday's largest spreads include Raiders vs. Eagles (-11.5), Titans vs. 49ers (-12.5) and Jets vs. Jaguars (-12.5). Before making any Week 15 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 15 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 15 games. You can only see the AI predictions for the Week 15 NFL schedule here.Top Week 15 NFL AI picksAfter analyzing every game in Week 15, the AI says the Cowboys (-5.5), who have won three of their last four games, cover comfortably against the Vikings. \nQuarterback Dak Prescott has been on a roll. In 13 games, he has completed 69% of his passes for 3,637 yards and 26 touchdowns with 10 interceptions for a rating of 100.2. Bet Prescott to go Over 37.5 yards for longest completion using the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nPowering the Dallas rushing attack is fifth-year veteran running back Javonte Williams. In 13 games, he has carried 215 times for 1,022 yards (4.8 average) and nine touchdowns. He has five explosive plays of 20 yards or more, including a long of 66 yards. SportsLine AI rates the Cowboys as an A+ spread pick and also predicts a 30-20 win on average. See its other Week 15 football predictions and football picks at SportsLine, and bet the Cowboys at DraftKings here:\nHow to make Week 15 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 15. You need to see the AI's NFL picks before making any Week 15 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 15 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 15, score predictions, best bets from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/27/34063cfe-519d-40c4-adf6-7c4bd23a7968/thumbnail/1200x675/69ae4dcf073065e58840192f7c416da9/imagn-dak-prescott-cowboys-pregame.jpg"
      ],
      "datePublished": "2025-12-10T00:45:46.000Z",
      "dateModified": "2025-12-10T00:45:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Paul says he's 'at peace' in first public comments after messy Clippers exit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/chris-paul-clippers-comments-at-peace-interview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/4fe273ec-90d0-4592-bfeb-6f6dcbeaabac/thumbnail/1200x675/bcd7835f3a696f4354880241776a9e87/chris-paul.jpg",
    "tag": "Sports",
    "date": "2025-12-10T01:18:53.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        On Nov. 22, Chris Paul announced he would be retir",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        On Nov. 22, Chris Paul announced he would be retiring from the NBA after this season, his 21st as a professional. Two weeks later, the Clippers announced they were waiving Paul in a shocking move that Paul learned about in the middle of the night while the team was on a road trip in Atlanta. In the week since, we've gotten tons of reports with sourcing on both sides of the situation about what went down, including an alleged rift between Paul and Clippers coach Ty Lue -- who refuted reports that he wasn't on speaking terms with Paul by the end of his second tenure in L.A. The one person we hadn't heard from yet was Paul himself -- aside from his Instagram post at 2:40 a.m. in Atlanta the night he found out he was being sent home. That changed on Tuesday when People ran a brief interview with the future Hall of Famer, who wasn't interested in fanning the flames surrounding his sudden departure from the struggling Clippers. \"I'm actually at peace with everything,\" Paul said. \"More than anything, I'm excited about being around and getting a chance to play a small role in whatever anything looks like next.\"\nPaul is still looking for a more fitting way to end his illustrious career than what happened with the Clippers, but in the meantime he's embracing the rare opportunity to be home for a bit during the season -- including the chance to watch his son play for the first time later this week. \"I have never seen my son play a game in person,\" he said. \"Not a middle school game, not a high school game. So I'm excited about seeing him play.\"\nPaul planned on having that time at home with the family next year once he is officially retired, but is getting a sneak peek at what that retired life will be like while he searches for a potential final destination on a legendary NBA journey. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Paul says he's 'at peace' in first public comments after messy Clippers exit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/4fe273ec-90d0-4592-bfeb-6f6dcbeaabac/thumbnail/1200x675/bcd7835f3a696f4354880241776a9e87/chris-paul.jpg"
      ],
      "datePublished": "2025-12-10T01:18:53.000Z",
      "dateModified": "2025-12-10T01:18:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Cup bracket and schedule 2025: Where to watch the elimination games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-cup-2025-bracket-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/8964cb98-47ab-4c83-a1c2-8462cc551307/thumbnail/1200x675/df8c30a05ebac305b84e1e0b50f7344d/robinson-knicks-getty.png",
    "tag": "Sports",
    "date": "2025-12-10T04:17:06.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA Cup quarterfinals are here. Six teams rema",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA Cup quarterfinals are here. Six teams remain in the battle to win the league's in-season tournament, and that number will be cut to four by the end of Wednesday night. The semifinals are set in the East as the Magic and Knicks were both victorious on Tuesday night. The Magic rallied after giving up the first 15 points to the Heat to come back and defeat their in-state rival. The Knicks, meanwhile, got 35 points from Jalen Brunson in a road win against the Raptors. The Magic and Knicks will meet up in the semis on Saturday. The West quarterfinals are set for Wednesday night as the Thunder host the Suns before the Lakers and Spurs meet up.The 19-1 Thunder are currently the favorites to win the 2025 NBA Cup (-125 at FanDuel). The Bucks won the competition last year, and the Lakers won the initial version in 2023.NBA Cup knockout stage scheduleTuesday, Dec. 9Magic 117, Heat 108Knicks 117, Raptors 101Wednesday, Dec. 10Suns at Thunder (-14.5) | 7:30 p.m. ET | Amazon Prime VideoSpurs at Lakers (-4.5) | 10 p.m. ET | Amazon Prime VideoSaturday, Dec. 13Magic vs. Knicks | 5:30 p.m. ET | Amazon Prime VideoSuns/Thunder vs. Spurs/Lakers | 9 p.m. ET | Amazon Prime VideoTuesday, Dec. 16TBD vs. TBD | 8:30 p.m. ET | Amazon Prime VideoThe Heat, Magic, Knicks, Raptors, Suns, Thunder, Spurs and Lakers made the knockout stage by going 3-1 or better in group play. The Thunder, Lakers, Raptors and Magic all went unbeaten in the group stage. Our Sam Quinn has winners and losers of the group play stage.\nThe quarterfinal games are all being played in home markets of the higher seeds, but the semifinals on Saturday and the finals on Dec. 16 will be held in Las Vegas.2025 NBA Cup bracket\n                                                                    NBA\n                                                            NBA Cup group play standings\n                                                                    NBA\n                                                            \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Cup bracket and schedule 2025: Where to watch the elimination games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/8964cb98-47ab-4c83-a1c2-8462cc551307/thumbnail/1200x675/df8c30a05ebac305b84e1e0b50f7344d/robinson-knicks-getty.png"
      ],
      "datePublished": "2025-12-10T04:17:06.000Z",
      "dateModified": "2025-12-10T04:17:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 MLB Draft: White Sox secure No. 1 pick after winning Draft Lottery - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-draft-lottery-white-sox-2026-pick-winners-losers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/5cf797c5-0595-4e05-a0a0-e4e2e7fa5c7a/thumbnail/1200x675/7434cdd983867716993dcd0dfefad321/white-sox-getty.png",
    "tag": "Sports",
    "date": "2025-12-09T23:31:50.000Z",
    "description": "\n        The White Sox, with the highest odds at 27.73%, won the No. 1 overall pick in next summer's draft during Tuesday's lottery at the Winter Meet",
    "body": "\n        The White Sox, with the highest odds at 27.73%, won the No. 1 overall pick in next summer's draft during Tuesday's lottery at the Winter Meetings in Orlando. It will be Chicago's first No. 1 selection since taking Hall of Famer Harold Baines in 1977 and their third No. 1 pick overall (also Danny Goodwin in 1971).\"An opportunity to boost what we have going on right now,\" White Sox GM Chris Getz said about winning the lottery. \"It's an honor. A huge responsibility.\"MLB and the MLBPA agreed to the lottery as part of the current collective bargaining agreement in an effort to reduce tanking and anti-competitive behavior. The 18 non-postseason teams are eligible for the lottery, though the worst teams have the best odds. Only the first six picks are chosen via lottery. Here are the six lottery teams and their No. 1 pick odds:White Sox (27.73%)Rays (3.03%)Twins (22.18%)Giants (1.01%)Pirates (16.81%)Royals (0.84%)Picks 7-18 are the remaining non-postseason teams in reverse order of the standings, and picks 19-30 are the 12 postseason teams in order of their finish (Wild Card Series losers first, World Series winner last, etc.). The 2026 Draft will be held in Philadelphia during next summer's All-Star break. UCLA shortstop Roch Cholowsky is the early favorite to be the No. 1 pick.\n\n        \n            \n                White Sox win No. 1 pick in MLB Draft Lottery: Five contenders to go first overall, including UCLA's shortstop\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nWith the lottery complete, here now is the complete first round order for the 2026 MLB draft, plus some winners and losers from the lottery.2026 MLB Draft first round orderWhite SoxRaysTwinsGiantsPiratesRoyalsOriolesAthleticsBravesRockiesNationalsAngelsCardinalsMarlinsDiamondbacksRangersAstrosRedsGuardiansRed SoxPadresTigersCubsMarinersBrewersBraves (Prospect Promotion Incentive pick for Drake Baldwin winning Rookie of the Year)MetsThe Blue Jays, Dodgers, Phillies, and Yankees had their top draft picks moved back 10 spots via competitive balance tax penalties, pushing them out of the first round. The Dodgers moved from No. 30 to No. 40. The Blue Jays moved from No. 29 to No. 39. The Phillies moved from No. 26 to No. 36. The Yankees moved from the No. 25 to No. 35. The Mets had their top pick moved back for the same reason, though they technically stayed within the first round.Also, that is the order for the first round only. In the second round, it goes back to the reverse order of this year's standings, so the 43-119 Rockies have the first pick of the second round, the 60-102 White Sox have the second pick of the second round, etc.\nWinner: White SoxGet the No. 1 pick and you're automatically a winner. Sure, the White Sox had the highest odds for the No. 1 pick, but they're the first team in the four years of the Draft Lottery to get the No. 1 pick with the highest odds. Chicago is still fairly early in a very deep rebuild. The No. 1 pick next summer will accelerate things nicely.Winners: RaysThe Rays were the biggest mover in the lottery, jumping from the No. 7 pick all the way to No. 2 through the lottery. It will be their highest pick since taking Tim Beckham with the No. 1 pick in 2008. In just about every sport, the first two or three picks of the draft are far more valuable than, say, the No. 6-8 picks. Tampa's expected outcome for next year's first rounder jumped considerably.Loser: RockiesDespite losing 17 more games than any other team in 2025, the Rockies did not have a chance to win the No. 1 pick in the lottery. That's because teams can not pick in the lottery more than two years in the row. Colorado had the No. 3 pick in 2024 and the No. 4 pick in 2025, which made them ineligible for the No. 1 pick (and a top-six pick in general) in 2026. So, their reward for those 119 losses is the No. 10 pick next summer. Ouch.\nWinner: Giants and RoyalsThe 2014 World Series clubs went into the lottery with the 12th- and 13th-best odds, respectively, and although neither won the lottery, they made a huge jump into the top six. The Giants went from No. 12 to No. 4 and the Royals went from No. 13 to No. 6. Moving up that much shifts the draft calculus significantly, and not just because they're picking higher. They now have more money to spend too.\nLoser: CardinalsNot a huge loser, but a loser. Some team was going to take a hit with both the Giants and Royals moving into the lottery and that team is the Cardinals. They got bumped back from the No. 8 pick to the No. 13 pick. Five spots doesn't sound like much, but it is a pretty big ding that early in the draft. A pick in the top 10 is much more valuable than than one closer to No. 15.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 MLB Draft: White Sox secure No. 1 pick after winning Draft Lottery - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/5cf797c5-0595-4e05-a0a0-e4e2e7fa5c7a/thumbnail/1200x675/7434cdd983867716993dcd0dfefad321/white-sox-getty.png"
      ],
      "datePublished": "2025-12-09T23:31:50.000Z",
      "dateModified": "2025-12-09T23:31:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barcelona beat Eintracht Frankfurt, but defensive issues remain glaring under UCL lights - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/barcelona-eintracht-frankfurt-score-defensive-issues-champions-league/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/c51bbae9-0c83-4d62-9c48-762695587d36/thumbnail/1200x675/b7b520b21e6dd77b29c25a06f7d1737f/fcb-5.jpg",
    "tag": "Sports",
    "date": "2025-12-10T01:05:30.000Z",
    "description": "\n        Barcelona's return to the Camp Nou for Champions League play for the first time in more than three years was almost spoiled by Eintracht Fran",
    "body": "\n        Barcelona's return to the Camp Nou for Champions League play for the first time in more than three years was almost spoiled by Eintracht Frankfurt in a 2-1 victory on Wednesday. A second-half brace from Jules Kounde helped Barcelona overturn a deficit and win at home, but it's also a deficit that they never should've been in, as despite having ambitions to win this competition, the defense hasn't been able to hold up, while the attack hasn't hit the highs of last season either.Previously, when a team went to the Camp Nou, it felt like a challenge that they wouldn't be able to overcome, but when players are speaking out about how they can study the offside trap, and it doesn't change and a team who allowed six goals in their last match can mark Robert Lewandowski out of a match, that mystique is gone.There are a few reasons for that, as one is the offside trap and how, if players can stay in line or play around it, Barcelona don't have a true defensive stopper to play enforcer when a counter is getting out of hand, but their play style only works when their entire attacking band is in sync. On Tuesday, it wasn't as Lewandowski only took 19 touches during the entire match, the fewest of any Barcelona starter despite playing 66 minutes. The 37-year-old took two shots, not putting any on target, and he has now failed to score or assist a goal in Champions League play despite playing in five matches. The lone match that Lewandowski didn't feature in was Barcelona's 6-1 victory over Olympiacos, which accounts for almost half of their 14 goals scored during the league phase.\nFerran Torres and Marcus Rashford have also taken turns leading the line, creating a more mobile attack, and it's something Hansi Flick will have to think about as he sets up his team moving forward. Barcelona are set to make it through the league phase as they sit 14th after six matches. They could fall to 20th, but with Slavia Prague and Copenhagen as their remaining teams, they should be comfortably through.The issue is that when Barcelona are expected to win the Champions League after making it to the semifinals last season, after six matches, they've scored 14 goals and allowed 11 goals. Facing top teams in UCL such as Paris Saint-Germain and Chelsea, Barcelona have failed to get results there, showing the cracks in Flick's tactics when they can't control a game from start to finish. They've struggled with big teams and even ones they'd be expected to top easily. Frankfurt had a chance of going in that direction, but Marcus Rashford and Kounde had to save them from allowing one of the easiest counters that you'll see. Nathaniel Brown played a ball that the Barcelona defenders couldn't get to, and Ansgar Knauff slotted it home. \nFrankfurt have been far from defensive stalwarts as of late, which is where concern sinks in. If Barcelona can't take care of these teams with ease, how can they expect to push past teams in the knockout phase? It's easier to change the attacking personnel than it is to sign defenders, so this may be the time to begin looking into what life may be without Lewandowski leading the line.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barcelona beat Eintracht Frankfurt, but defensive issues remain glaring under UCL lights - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/c51bbae9-0c83-4d62-9c48-762695587d36/thumbnail/1200x675/b7b520b21e6dd77b29c25a06f7d1737f/fcb-5.jpg"
      ],
      "datePublished": "2025-12-10T01:05:30.000Z",
      "dateModified": "2025-12-10T01:05:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White Sox win MLB Draft Lottery: Five contenders to go No. 1 in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/white-sox-first-pick-mlb-draft-lottery-contenders-cholowsky-emerson-lombard-burress-lebron/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/07/b42fdd54-54c4-4d1f-acdc-0ee376a58fb2/thumbnail/1200x675/8805e02ca496124b8e150c4f38c3b0b2/roch-getty.png",
    "tag": "Sports",
    "date": "2025-12-09T23:30:31.000Z",
    "description": "\n        The Chicago White Sox won Major League Baseball's fourth Draft Lottery on Tuesday night, ensuring they'll make the No. 1 pick in next summer'",
    "body": "\n        The Chicago White Sox won Major League Baseball's fourth Draft Lottery on Tuesday night, ensuring they'll make the No. 1 pick in next summer's draft. That will represent the third time the South Siders have done the honors, and the first since they selected Harold Baines in 1977.MLB installed the draft lottery as part of the 2022-27 Collective Bargaining Agreement with the Players Association. The lottery determines only the top six selections and there are restrictions on how often teams can qualify for a lottery pick based on their revenue sharing status. Previous winners include the Pittsburgh Pirates, Cleveland Guardians, and Washington Nationals -- those clubs selected right-hander Paul Skenes, infielder Travis Bazzana, and infielder Eli Willits, respectively.It's only natural to wonder now who the White Sox might select next summer. My full preseason draft rankings won't be released until February, but below I've highlighted five players who appear, at this point in time, to have the best odds of headlining the class. To state the obvious: a lot -- and I mean a lot -- can change between now and then, so don't grow too fond of this particular group.The players are presented in no particular order.\n        \n            \n                White Sox win MLB Draft Lottery: Winners and losers as Chicago secures No. 1 pick in 2026 Draft\n                \n                    Mike Axisa                \n            \n                            \n    \n                \n                    \n    \n1. Roch Cholowsky, SS, UCLACholowsky will probably enter the preseason ranked as my No. 1 draft prospect. He's an athletic shortstop who hit .353/.480/.710 last season with 23 home runs, seven stolen bases (on eight attempts), and 15 more walks than strikeouts. Cholowsky, also recruited by Notre Dame to play quarterback during his prep days, is a well-rounded player who ought to also provide value on defense and on the basepaths. He could become the second Bruin ever selected No. 1 in the June draft, joining Yankees ace Gerrit Cole (2011).\n2. Grady Emerson, SS, Argyle HS (TX)Emerson will become the second player from Argyle High School ever selected in the MLB draft (onetime Yankees farmhand Austin Aune was the first). Where, exactly, he goes will be determined over the spring, but it's easy to envision him topping the class. Emerson is a projectable lefty hitter who already employs a mature operation and gameplan at the plate. Defensively, he checks all the boxes to remain at shortstop. It' a good year for shortstops, prep and collegiate, and he might end up being the best of the bunch.3. Jacob Lombard, SS, Gulliver Prep HS (FL)Lombard comes from a baseball family. His father George appeared in parts of six big-league seasons and is now the Detroit TIgers' bench coach. His brother George Jr. is a top prospect with the New York Yankees. Bloodlines aren't the only thing working in Jacob's favor. His game includes both power and speed, giving him an enticing upside -- and a chance at lifting himself to the top spot over the coming months. 4. Drew Burress, CF, Georgia TechBurress is listed at only 5-foot-9, but he's more evidence that height doesn't measure slug. He homered 44 times over his first two collegiate seasons thanks to his feel for lifting and pulling the ball. Burress did see some of his numbers decline year to year, with both his strikeout and walk rates veering in the wrong directions, and not every team will be as high on his chances of sticking in center field. Still, he should be able to cement himself as an early pick with another strong showing for the Yellow Jackets.\n5. Justin Lebron, SS, AlabamaLebron hit .327/.425/.593 with 30 home runs and 24 stolen bases (on 25 attempts) in his first two collegiate seasons with the Crimson Tide. Impressive stuff. There's just one problem: he struck out in 31% of his plate appearances during SEC play. Teams often place extra emphasis on conference play with SEC-based prospects, as that's usually the best quality of competition those players will face in a given year. Lebron will need to slice into that K rate if he wants to assure himself a top-five selection in July.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White Sox win MLB Draft Lottery: Five contenders to go No. 1 in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/07/b42fdd54-54c4-4d1f-acdc-0ee376a58fb2/thumbnail/1200x675/8805e02ca496124b8e150c4f38c3b0b2/roch-getty.png"
      ],
      "datePublished": "2025-12-09T23:30:31.000Z",
      "dateModified": "2025-12-09T23:30:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League expert picks, predictions: Real Madrid host Man City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-champions-league-wednesday-predictions-picks-real-madrid-man-city-xabi-alonso-pressure/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/f0f0b89c-0892-4d57-8bfe-b16b2cc50103/thumbnail/1200x675/bc5a26f895a4ccf390f6ef152f8bc257/untitled-design-2025-12-09t233354-195.png",
    "tag": "Sports",
    "date": "2025-12-09T22:39:02.000Z",
    "description": "\n        The UEFA Champions League is back with Matchday 6 taking place across Tuesday and Wednesday. Each club enters the week with three games to go",
    "body": "\n        The UEFA Champions League is back with Matchday 6 taking place across Tuesday and Wednesday. Each club enters the week with three games to go -- 270 minutes to make or break their league phase by securing a spot into the last 16, earning a playoff spot or watching the knockout stages from home. The schedule includes some fantastic affairs with Inter hosting reeling Liverpool highlighting Tuesday's slate as the Reds may be just be witnessing the end of Mohamed Salah's tenure at the club. Wednesday's slate features a battle of elite contenders in Real Madrid and Manchester City, but both seemingly have a point to prove to show that they are at the levels of recent years when they've conquered the continent.Here's how the CBS Sports team thinks this week's action will shake out.Don't miss any of the Champions League. As always, you can catch all of our coverage across Paramount+, CBS Sports Network and CBS Sports Golazo Network all season long. Champions League matches on WednesdayMatchup\n                    \n    \n                                            \n                    \n                                    James Benge\n                            \n            \n                    \n    \n                                            \n                    \n                                    Francesco Porzio\n                            \n            \n                    \n    \n                                            \n                    \n                                    Pardeep Cattry\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chuck Booth\n                            \n            \n                    \n    \n                                            \n                    \n                                    Roger Gonzalez\n                            \n            Qarabag vs. Ajax1-02-01-02-02-0Villarreal vs. Copenhagen2-01-01-00-12-1Benfica vs. Napoli2-21-20-21-21-1Bilbao vs. PSG0-22-30-20-30-3Club Brugge vs. Arsenal1-20-30-20-21-3Dortmund vs. Bodo/Glimt2-02-12-12-01-2Leverkusen vs. Newcastle0-01-10-10-11-2Juventus vs. Pafos4-03-03-02-13-0Real Madrid vs. Man City2-12-21-21-12-2Game of the day: Real Madrid vs. Man CityPlayer to watch: Kylian Mbappe, Real Madrid -- For all the drama that swirls around the Santiago Bernabeu, where there already seem to be questions over Xabi Alonso's future, one thing has remained constant this season. Kylian Mbappe scores goals. Twenty-five in 21 club games this season, to be precise. It was against Manchester City nearly nine years ago that the then-Monaco forward first showed his prodigious talents and he has rarely let up on them since, netting a brilliant hat trick to knock them out of last season's Champions League. -- James BengeMan of the match: Jeremy Doku, Manchester City -- Pep Guardiola is back at the Bernabeu again playing against Real Madrid, the fourth most-faced team in his coaching career after Arsenal, Chelsea and Manchester United. The Citizens are in great form and are back in contention for the Premier League as well while Real Madrid are facing a crisis with only one win in the last five LaLiga games (three draws, one win, one defeat). The pace and the technique of Doku can definitely become a big issue for the team managed by Xabi Alonso. -- Francesco Porzio\nPrediction: Real Madrid 1, Manchester City 2 -- He may have started the job a few months ago, but it's already time to talk about Xabi Alonso's job security, momentum perhaps swinging in Manchester City's favor ahead of the most anticipated game on Matchday 6. Momentum is not the only reason to pick City -- flawed as they are in Pep Guardiola's latest rebuild, the ideas seem to be clicking more often than not, plus Erling Haaland's always impressive form always makes them a contender. --  Pardeep CattryBest bet: Kylian Mbappe and Erling Haaland to have 2+ shots on target (+164): Back your stars? Both of these teams are in a bit of a rut but they'll look to get their star strikers shots to get out of them. Mbappe has continued to score no matter what happens with the club, and City's only option is to feed Haaland, so let's back them.-- Chuck BoothLeverkusen vs. NewcastlePlayer to watch: Bruno Guimaraes, Newcastle -- After Alexander Isak's departure, Eddie Howe needed others to step up and share a scoring load that would have weighed too strongly on Nick Woltemade otherwise. Guimaraes has certainly done that, his five increasingly impressive goals so far this season, culminating in a wicked corner that swerved straight in in Saturday's 2-1 win over Burnley. That Guimaraes has the quality to impose himself on Leverkusen's talented midfield only makes it more important that he excels at the Bay Arena. -- James BengeMan of the match: Patrick Schick, Bayer Leverkusen -- The German side has had some ups and down in the past weeks, but also won 2-0 in their last Champions League tie against Manchester City, one of the most surprising results of the season so far. Facing Newcastle at home, they have an immense chance to score some big points ahead of the next phase. Patrick Schick is in great form and has already scored two goals in the three Champions League matches he played so far. -- Francesco PorzioPrediction: Bayer Leverkusen 0, Newcastle United 1 -- It has been an up and down season for both of these teams, who are likely to keep things tight in a closely-contested game. Newcastle United, though, have the quality needed to take all three points home with them, calling upon the likes of Nick Woltemade and Anthony Gordon to get the job done in attack. --  Pardeep Cattry\nBest bet: Under 2.5 goals (+110): With Leverkusen finding their feet, this is a hard matchup to pick, but it could turn into a defensive slugfest. Newcastle United have only allowed more than one goal in three of their last 11 games so it's safe to say that Leverkusen will struggle to score, but the Magpies' attack has also struggled to get things going. -- Chuck Booth\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League expert picks, predictions: Real Madrid host Man City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/f0f0b89c-0892-4d57-8bfe-b16b2cc50103/thumbnail/1200x675/bc5a26f895a4ccf390f6ef152f8bc257/untitled-design-2025-12-09t233354-195.png"
      ],
      "datePublished": "2025-12-09T22:39:02.000Z",
      "dateModified": "2025-12-09T22:39:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Henry on Salah's 'mistake': 'You protect your team at all costs at all times' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/thierry-henry-mohamed-salah-controversy-liverpool-mistake-ucl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/994181cb-ac02-479c-9c5a-4248a5be2df5/thumbnail/1200x675/3b2b632a15536db632b93c445b7bce1c/lfc-mohamed-salah.jpg",
    "tag": "Sports",
    "date": "2025-12-09T23:20:29.000Z",
    "description": "\n        Ex-France international Thierry Henry has criticized Liverpool's Mohamed Salah for his comments after the Reds' 3-3 draw with Leeds United on",
    "body": "\n        Ex-France international Thierry Henry has criticized Liverpool's Mohamed Salah for his comments after the Reds' 3-3 draw with Leeds United on Saturday, with Henry saying Salah took the \"wrong\" approach despite some understandable frustration over a lack of playing time.Salah was an unused substitute on Saturday for the second time in three matches, a match that stretched his goal contribution drought to seven games. The Egypt international was critical of manager Arne Slot's approach after the match, as well as the club as a whole, during a season that has been far from perfect for both Liverpool and Salah himself.\"It seems like the club has thrown me under the bus. That is how I am feeling. I think it is very clear that someone wanted me to get all of the blame,\" Salah said on Saturday. \"I said many times before that I had a good relationship with the manager, and all of a sudden, we don't have any relationship. I don't know why, but it seems to me, how I see it, that someone doesn't want me in the club … I don't accept this situation. I have done so much for this club.\"Salah is still training with the team but was omitted from the Reds' traveling squad for Tuesday's UEFA Champions League match at Inter, a 1-0 win, and has received a lot of flak since his comments, including from Henry.\n\"Nobody's talking about what Mo Salah has achieved in the game,\" Henry said on the UEFA Champions League Today pre-match show. \"We're talking about moments in time that I think he got wrong. You do not talk about your personal situation openly when your team is struggling. You do it in the dressing room. I've done it. I went to the dressing room and smashed everything in. I went to the office of the boss and complained about stuff.\"Henry went on to compare Salah's circumstances to his own at Barcelona during the 2009-10 season, when he was left out of the team's squad at Villarreal.\"When I was at Barcelona, I went away with the team,\" Henry said. \"They put me in the stands. Did you hear me talking about it? No … We won the treble the year before but I wasn't performing so if you're not performing, you put yourself in the situation where you leave the door open for someone to [get] in. I traveled, we arrived at the stadium, I'm in the stands. Am I going to make a fuss about it? Am I going to make it about myself? Am I going to talk to the press after? I have achieved stuff in the game but team first. If I had to say something – and by the way, I said it. I said it to [manager] Pep [Guardiola], what I thought about what was happening, but not publicly.\"\nHenry believes Salah should not have gone public with his complaints at all, arguing that it endangers team dynamics.\n\"You need to protect your team at all costs, all the time,\" Henry said. \"I can understand you want to speak. I can understand the frustration. I don't [understand] the how and the when. That doesn't make sense to me. That was wrong and when people talk about relationships, the only relationship a coach wants to have with a player is for him to perform. If you're not performing, then your position is in danger. It's not [your] due to have a position, especially at a club like Liverpool … It has nothing to do, again, with what he has achieved. I repeat – I love Mo Salah. I love what he has done in the game. That's a different topic. There, that's not how you go about stuff.\"'We've all been below the standards'Following Liverpool's win in Milan, defender Andy Robertson addressed the situation between Salah and the club, admitting it stems from the team's collective dip in form after winning the Premier League title last season.\n\"Firstly, we probably want the season to have went better for the club and for him,\" Robertson said. \"He puts a huge amount of pressure on himself to perform all the time and last season, he took it to a whole new level in terms of at times, he carried this whole team forward to go and achieve amazing things. I think we've all been below the standards of last season, Mo included, and he'll be the first to admit that and then obviously, he finds himself out of the team, which is a bit of a unique situation for him.\"The Scotland international, though, said Salah was professional in training on Monday and wished his teammates well before their trip to Italy.\"It's obviously something he's not used to experiencing but he was positive yesterday in terms of wishing us all well, sending us on our way and I'm sure he would've liked to have been involved but the support for the lads was still there and as a teammate, that's all you can ask,\" Robertson said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Henry on Salah's 'mistake': 'You protect your team at all costs at all times' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/994181cb-ac02-479c-9c5a-4248a5be2df5/thumbnail/1200x675/3b2b632a15536db632b93c445b7bce1c/lfc-mohamed-salah.jpg"
      ],
      "datePublished": "2025-12-09T23:20:29.000Z",
      "dateModified": "2025-12-09T23:20:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy football Week 15 trade chart: Rest of season rankings to finalize deadline deals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-15-trade-chart-player-values/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/64b154b4-0eef-4ff4-928f-578635888768/thumbnail/1200x675/d7c69c017a28c62fc5d8ec80f8f6717f/christian-mccaffrey-san-francisco-49ers-imagn-images-3.jpg",
    "tag": "Sports",
    "date": "2025-12-09T21:57:05.000Z",
    "description": "\n\n\n    \n                                    Use this trade chart to finalize your deadline deals\n        \n                                            ",
    "body": "\n\n\n    \n                                    Use this trade chart to finalize your deadline deals\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 9, 2025\n                            \n                    at\n    4:56 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Fifteen seasons ago, the Fantasy Football Trade Chart was created by CBS Sports for the sole purpose of helping you make fair trades in your leagues.                     But in 2025, the Trade Chart expanded! This year, we've added a column for those of you who play in four-point-per-pass TD leagues, and a column for half-PPR leagues! Yes finally.                      The values assigned to the players below reflect a long-term measurement of their Fantasy value. Values are determined by expected future performance, future schedule, and, most importantly, public sentiment. Past performance isn't a major factor in the Trade Chart.                      By adding two players' values, you could determine what one player you should be able to get in return. However, Fantasy managers should take off 10% of the value in any trade where one side has two or more players than the other. Also, a handful of others only carry legitimate value in two-QB or full-PPR leagues (and thus have no value listed in one-QB or non-PPR leagues).                     \nThis list also works as a \"rest of season\" rankings for the 2025 season.                      Finally, any player not on the chart should be considered valued at no more than four points. If you want to dive deeper before sending out or replying to trade offers, be sure to find my updated projected rest of season schedule rankings available on SportsLine later this week.                          \nYou can reach out with any questions, disagreements, or reports of trades from your leagues to Dave Richard at drichard@cbs.com or at @daverichard on X.                                                        Running back                     playertmnon0.5PPRC. McCaffreySF434547D. AchaneMIA4143.546J. GibbsDET4142.544J. CookBUF363738B. RobinsonATL343638J. JacobsGB3131.532J. TaylorIND3030.531B. IrvingTB2526.528J. WilliamsDAL222324C. BrownCIN2021.523S. BarkleyPHI212121D. HenryBAL212121K. WilliamsLAR202020T. EtienneJAC171819B. HallNYJ151617O. HamptonLAC141516A. JeantyLV1314.516R. HarveyDEN131415D. SwiftCHI131415R. DowdleCAR121314Q. JudkinsCLE1212.513W. MarksHOU1010.511T. HendersonNE91011J. WarrenPIT8910K. Walker IIISEA999A. JonesMIN88.59D. NealNO88.59K. MonangaiCHI888T. Tracy Jr.NYG66.57T. PollardTEN66.57K. GainwellPIT66.57D. SingletaryNYG66.57K. HuntKC666Z. CharbonnetSEA55.56Z. KnightARI666D. MontgomeryDET666C. HubbardCAR666B. CorumLAR666C. Rodriguez Jr.WAS666R. StevensonNE666T. AllgeierATL666J. MasonMIN666K. VidalLAC555R. WhiteTB555I. PachecoKC555B. TutenJAC555J. WrightMIA555A. KamaraNO555                                         \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \tWide receiver                     playertmnon0.5PPRJ. Smith-NjigbaSEA394245J. ChaseCIN353841P. NacuaLAR333639A. St. BrownDET2729.532C. LambDAL2527.530R. RiceKC2426.529G. PickensDAL2325.528D. AdamsLAR222426N. CollinsHOU212325D. LondonATL2022.525A. BrownPHI1819.521J. WaddleMIA1718.520C. OlaveNO1517.520J. WilliamsDET1314.516T. McLaurinWAS1213.515Z. FlowersBAL111315J. JeffersonMIN101214T. McMillanCAR101214M. Harrison Jr.ARI1112.514D. SmithPHI1112.514C. WatsonGB1212.513E. EgbukaTB1011.513M. EvansTB101112G. WilsonNYJ910.512C. SuttonDEN91011L. McConkeyLAC91011M. PittmanIND89.511R. OdunzeCHI89.511J. MeyersJAC8910J. JenningsSF789W. RobinsonNYG67.59T. HigginsCIN67.59D. MetcalfPIT77.58A. PierceIND66.57S. DiggsNE66.57D. SamuelWAS66.57B. Thomas Jr.JAC66.57K. ShakirBUF66.57C. GodwinTB66.57J. HigginsHOU55.56K. BoutteNE55.56L. Burden IIICHI555J. AddisonMIN555X. WorthyKC555                                         \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \t \tTight end                                   playertmnon0.5PPRT. McBrideARI1820.523B. BowersLV1719.522G. KittleSF141618H. FanninCLE91011T. WarrenIND89.511T. KelceKC8910D. KincaidBUF789K. PittsATL67.59J. JohnsonNO66.57J. FergusonDAL567D. SchultzHOU55.56C. LovelandCHI55.56H. HenryNE55.56B. StrangeJAC55.56I. LikelyBAL555M. AndrewsBAL555D. GoedertPHI555                     Quarterback                     playertm1QB-41QB-62QBJ. AllenBUF262554M. StaffordLAR222248J. BurrowCIN181840D. MayeNE181738D. PrescottDAL171738J. HurtsPHI171636L. JacksonBAL161636P. MahomesKC141432J. BrissettARI101026J. DartNYG8820J. GoffDET7716B. PurdySF6614B. MayfieldTB6614C. WilliamsCHI6614J. LoveGB----12T. LawrenceJAC----12S. DarnoldSEA----12J. DanielsWAS----11C. StroudHOU----10J. HerbertLAC----10T. ShoughNO----10B. NixDEN----9B. YoungCAR----9T. TagovailoaMIA----9S. SandersCLE----9C. WardTEN----9J. McCarthyMIN----8A. RodgersPIT----8M. MariotaWAS----7K. CousinsATL----7T. TaylorNYJ----5G. SmithLV----5P. RiversIND----5\n            \n    \n\n        \n\n    \n            \n    \n            \n\n                    \n         Now Playing \n                    \n    \n                                        \n            \n                        \n                                                            \n                                    \n    \n                                                                                                    \n                                    \n                                                                                    \n                                                                                                    Dave's Week 15 Trade Chart \n                                                                                            \n                                        \n                                                    Dave Richard\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 15 tight end preview\n                                                                                                                                                \n                                        \n                                                    Heath Cummings\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 15 WR preview\n                                                                                                                                                \n                                        \n                                                    Heath Cummings\n                                                \n                                                                                            \n                                                     2 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                    \n                                                                                    \n                                                                            Week 15 waiver wire\n                                                                                                                                                \n                                        \n                                                    Jamey Eisenberg\n                                                \n                                                                                            \n                                                     12 min read\n                                                \n                                                                                    \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                        \n                                                            \n                                    \n                                                                                    \n                                                \n    \n                                                                                                    \n                                                                                                                                \n                                                                            \n                                \n                                                    \n                                                \n                    \n            \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy football Week 15 trade chart: Rest of season rankings to finalize deadline deals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/64b154b4-0eef-4ff4-928f-578635888768/thumbnail/1200x675/d7c69c017a28c62fc5d8ec80f8f6717f/christian-mccaffrey-san-francisco-49ers-imagn-images-3.jpg"
      ],
      "datePublished": "2025-12-09T21:57:05.000Z",
      "dateModified": "2025-12-09T21:57:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Troy Aikman says he's 'done with' NIL after giving 'sizable check' to UCLA - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/troy-aikman-nil-name-image-likeness-college-football-ucla/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/f8c551d7-9dad-42d8-823f-8d96a106bba5/thumbnail/1200x675/685835a001e7956b6987f5a0f90d3d23/gettyimages-2243691423-1.jpg",
    "tag": "Sports",
    "date": "2025-12-09T22:55:36.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It seems as if UCLA won't be able to rely on chari",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It seems as if UCLA won't be able to rely on charitable name, image and likeness donations from Troy Aikman anymore. During a recent appearance on the Sports Media Podcast with Richard Deitsch, Aikman -- the UCLA quarterback who went on to a Hall of Fame career with the Dallas Cowboys -- recounted the specific instance that turned him off from donating NIL money. \"I gave money to a kid, I won't mention who,\" Aikman said. \"I've done it one time at UCLA, never met the young man. He was there a year, he left after the year. I wrote a sizable check, and he went to another school. I didn't even get so much as a thank you note. So, it's one of those deals, to where I'm done with NIL. I want to see UCLA be successful, but I'm done with it.\"Aikman, currently the color analyst for \"Monday Night Football,\" did acknowledge that athletes should be allowed to leave a school whenever a coach does. given that programs often change dramatically in times of transition. But he also called for further guardrails with NIL legislation. \n\"There's got to be some leadership at the very top that kind of cleans all of this up,\" Aikman said. \"Starting with players that accept money. There's got to be some accountability and responsibility on their behalf, to have to stick to a program.\"\n        \n            \n                CBS Sports 136: Indiana heads to CFP as unanimous No. 1, Georgia leaps Texas Tech in college football rankings\n                \n                    Chip Patterson                \n            \n                            \n    \n                \n                    \n    \nAikman, who was a three-time Super Bowl champion and a six-time Pro Bowler in the NFL, starred with the Bruins from 1986-88. He actually arrived at UCLA as a transfer from Oklahoma, where he started his college career under legendary Sooners coach Barry Switzer. \nUCLA just wrapped up its second season in the Big Ten by going 3-9 and will be undergoing another coaching transition. After Chip Kelly left following the 2023 campaign, the school promoted DeShaun Foster, but his tenure lasted only 15 games. Foster was fired after an 0-3 start and the school officially announced the hire of James Madison's Bob Chesney on Saturday. Chesney will coach JMU in the College Football Playoff before moving over to UCLA on a full-time basis. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Troy Aikman says he's 'done with' NIL after giving 'sizable check' to UCLA - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/f8c551d7-9dad-42d8-823f-8d96a106bba5/thumbnail/1200x675/685835a001e7956b6987f5a0f90d3d23/gettyimages-2243691423-1.jpg"
      ],
      "datePublished": "2025-12-09T22:55:36.000Z",
      "dateModified": "2025-12-09T22:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spirit's new soccer exec says club need to get 'creative' with Rodman contract - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/washington-spirits-trinity-rodman-creative-new-contract-nwsl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/95564528-9156-4950-bd24-a9cff8ceeb59/thumbnail/1200x675/8723d80753463d65e813078d61c840d0/trinity-1.jpg",
    "tag": "Sports",
    "date": "2025-12-10T01:12:19.000Z",
    "description": "\n        In the nation's capital, Washington, D.C, is a city full of political maneuvering and power plays, and a new type of high-stakes negotiation ",
    "body": "\n        In the nation's capital, Washington, D.C, is a city full of political maneuvering and power plays, and a new type of high-stakes negotiation between NWSL and the Washington Spirit needs a top-level executive to handle the details. The Washington Spirit recently hired Haley Carter as the club's new president of soccer operations, and it's a move that comes with buzz as the club works towards a contract solution with free agent winger Trinity Rodman. Carter's appointment was finalized before Rodman's free agency reached the point of a grievance filed on her behalf by the NWSL Players Association. Now, the Spirit and Carter are back to work after a previous contract option, which would've made Rodman the highest-paid soccer player in women's pro soccer, was vetoed by NWSL Commissioner Jessica Berman. In an introductory press conference on Tuesday, the new club president of soccer operations told the media that there were \"no updates\" on Rodman and that they're \"having conversations every day.\" Cater's role with the Spirit isn't just some front-office promotion; it's a signal of ambition. The former NWSL goalkeeper, retired United States Marine Corps officer, and licensed attorney, made her return to the league as an executive in 2023 when she was hired as general manager and vice president of operations for the Orlando Pride. Carter helped build the 2024 roster that went on to win the league double in 2024. \nNow, her new role came with plenty of responsibility and an urgent mission by the Spirit for negotiations to keep Rodman a member of the club.\"We're going to need mechanisms right that allow NWSL clubs to compete for, not only players from overseas, but our own players, and being able to retain them,\" Carter told the media. \"We are going to have to start getting creative, I believe, because it's bigger than just one team. It's bigger than just one player. It's about the league's ability to keep its best players in this league as we continue to grow.\"Per the NWSLPA grievance, reviewed by CBS Sports, the Spirit and Rodman had initially agreed to a contract on or around Nov. 30, but the deal was vetoed by the commissioner for allegedly violating the \"spirit of the league rules.\" Now the league has 14 days to respond to the grievance filing that the NWSLPA says Berman and the league violated several CBA rules regarding free agency. Carter wants to see the \"American league\" evolve to meet the moment in a \"global sport.\"\n\"We have to be cognizant of what's happening in the global market. The evidence kind of speaks for itself. We have multiple examples of athletes, U.S. women's national team players, who are going overseas to compete, and they have their reasons for doing that, and I'm wholly supportive of athletes doing what they think they need to do, and that's in the best interest of their development. I totally get it,\" Carter said.The former Orlando Pride executive uses an example with former Pride starting midfielder Adriana. The Brazilian international signed a hefty deal to play in Saudi Arabia's league, and Carter's maneuvering is not to get in the way of players seeking those opportunities, but cites the experience as a league learning. \"It matters that we have the ability to compensate players. And I think that now there's enough writing on the wall, there's enough evidence, there's enough tangible information that's available that reflects what's happening in the market and the impact that it's having. And to be fair, we're not, we're not necessarily competing with other leagues, I think, outside of Women's Super League [England],  is certainly like the number one threat to the NWSL in terms of players. But we are really competing with a handful of clubs that are very, very serious about talent acquisition, and those are the clubs that we need to be able to compete with, collectively as a league,\" Carter told the media on working with cap issues.\nStill, the new Spirit president of operations remains \"cautiously optimistic\" at the attention and resources being spent on the negotiations, and that the club and the league are ultimately on the same page when it comes to retaining Rodman's talents in NWSL. She's hopeful that a solution will be reached for all parties involved.\"We owe it to ourselves to make sure that we're coming up with the solution that serves to compensate the athletes but also ensures that the league is in a good space and that's really where the innovation has to happen, right? Like, that's where we have to strike a balance. We have to walk through some pretty nuanced conversations,\" Carter stated. She also joked that she's no stranger to being critical of the league when it's warranted. But she credits the league office working with the board of governors on the urgency of negotiating a deal while working through various mechanisms and proposals. \n\"I think everybody who knows me knows that I'm very much on the train to pay the players, but I also, you know, am, again, pragmatic enough to recognize that we need to make sure that we're getting the revenue generating channels aligned and open and ready to go, so that, you know, as we're increasing spend, we're also increasing spend in the things that are going to generate us that revenue and get us that return on investment. So, it's got to be, it has to be a really holistic solution.\"As the league, club, player, and player agents are at the center of a contract impasse, Carter's presence alongside a negotiation team that includes general manager Nathan Minion could not only solve the puzzle of Rodman's future but reshape the league entirely. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spirit's new soccer exec says club need to get 'creative' with Rodman contract - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/95564528-9156-4950-bd24-a9cff8ceeb59/thumbnail/1200x675/8723d80753463d65e813078d61c840d0/trinity-1.jpg"
      ],
      "datePublished": "2025-12-10T01:12:19.000Z",
      "dateModified": "2025-12-10T01:12:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]