[
  {
    "title": "Week 8 college football odds, picks, predictions, best bets from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-odds-lines-spreads-picks-predictions-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/26/dbc6ade8-aa80-43fe-bdee-5d9143f6fd93/thumbnail/1200x675/8f4b308542da387e7a302a435fd18016/kaytron-allen-penn-state-cbs-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-15T12:06:45.000Z",
    "description": "\n        When scanning which games to make Week 8 college football picks on, one's eyes will gravitate towards the SEC. It features three ranked match",
    "body": "\n        When scanning which games to make Week 8 college football picks on, one's eyes will gravitate towards the SEC. It features three ranked matchups, with all six of the competing squads ranked 17th or better. There's Ole Miss vs. Georgia (-7.5), Alabama (-8.5) vs. Tennessee and Vanderbilt (-2.5) vs. LSU. Outside of the SEC, another intriguing game to make Week 8 college football bets on is one of the most storied series in the sport as USC vs. Notre Dame has the Irish favored by 9.5 points in South Bend, Ind.Meanwhile, the Big Ten has eight conference games, and while it doesn't featured any ranked matchups, it does possess two of the biggest Week 8 college football spreads. The top-ranked Buckeyes are 25.5-point favorites over Wisconsin, while No. 3 Indiana is favored by 27 points over Michigan State. Before locking in any Week 8 college football picks on those games or others, be sure to see the latest Week 8 college football predictions from SportsLine's proven model. LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college football spread picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and Week 8 college football betting lines on the spread, money line, and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Week 8One of the college football picks the model is high on during Week 8: Penn State (+3, 39.5) covers versus Iowa in a 7 p.m. ET Saturday kickoff. The firing of James Franklin could provide a psychological boost to a PSU squad that's been in a malaise for the last few weeks, while QB Drew Allar's season-ending injury should put more of Penn State's offensive focus on its run game. That's not a bad thing to lean on with a pair of future NFL running backs in Kaytron Allen and Nicholas Singleton. Iowa just allowed a season-high in rushing yards, and the Hawkeyes' offensive struggles are well documented as they haven't had a touchdown pass in three straight games. SportsLine's model has Penn State outgaining the Hawkeyes on Saturday and covering well over 50% of the time. See which other picks the model likes here.\nAnother prediction: Missouri (-1.5, 43.5) covers against Auburn in over 70% of simulations Saturday at 7:45 p.m. ET. Mizzou suffered its first loss on Saturday, falling to Alabama, but the Tigers still covered and are 4-2 ATS this season. The Tigers of Auburn have covered just once over their last five games and have winless versus the spread at home (0-3). Missouri has incredible balance, with QB Beau Pribula leading the SEC in completion rate, while RB Ahmad Hardy tops the conference in rushing yards and touchdowns. Meanwhile, Auburn ranks 92nd in FBS in scoring as both its two lowest point totals and yardage totals have come in the last two games. With that Mizzou is projected to win outright by more than a touchdown, and the Over hits nearly 60% of the time. See the rest of the model's picks here.\nHow to make college football picks for Week 8The model has also made the call on who wins and covers in every FBS matchup in Week 8, and it's calling for multiple upsets, including a double-digit underdog outright winning. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which double-digit underdog wins straight up? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.Week 8 college football odds for notable gamesSee full Week 8 college football picks, odds, predictions here(odds subject to change)Wednesday, Oct. 15Jacksonville State vs. Delaware (-3, 57.5)UTEP vs. Sam Houston (+2.5, 47.5)Thursday, Oct. 16Tulsa vs. East Carolina (-16.5, 54.5)Friday, Oct. 17Louisville vs. Miami (-13.5, 51.5)Nebraska vs. Minnesota (+7.5, 46.5)San Jose State vs. Utah State (-3.5, 64.5)North Carolina vs. Cal (-10, 47.5)Saturday, Oct. 18Georgia Tech vs. Duke (-1.5, 61.5)LSU vs. Vanderbilt (-2.5, 48.5)South Carolina vs. Oklahoma (-5.5, 43.5)SMU vs. Clemson (-9.5, 55.5)Ole Miss vs. Georgia (-7.5, 54.5)Ohio State vs. Wisconsin (+25.5, 41.5)Penn State vs. Iowa (-3, 39.5)USC vs. Notre Dame (-9.5, 61.5)Tennessee vs. Alabama (-8.5, 58.5)Missouri vs. Auburn (+1.5, 43.5)Utah vs. BYU (+3.5, 49.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 college football odds, picks, predictions, best bets from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/26/dbc6ade8-aa80-43fe-bdee-5d9143f6fd93/thumbnail/1200x675/8f4b308542da387e7a302a435fd18016/kaytron-allen-penn-state-cbs-imagn.jpg"
      ],
      "datePublished": "2025-10-15T12:06:45.000Z",
      "dateModified": "2025-10-15T12:06:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steelers vs. Bengals odds, picks, 'Thursday Night Football' predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-steelers-prediction-odds-time-thursday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/33eac641-235a-45e4-aa58-61968dd6d08c/thumbnail/1200x675/4f2a22813b0d38dd60953928d125c4a5/jamarr-chase-cincinnati-bengals-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-10-15T12:12:34.000Z",
    "description": "\n        An old-school AFC North rivalry kicks off NFL Week 7 with the Pittsburgh Steelers visiting the Cincinnati Bengals on 'Thursday Night Football",
    "body": "\n        An old-school AFC North rivalry kicks off NFL Week 7 with the Pittsburgh Steelers visiting the Cincinnati Bengals on 'Thursday Night Football.' Pittsburgh (4-1) has won three straight, including a 23-9 victory over Cleveland on Sunday, and the Steelers are 2-0 on the road this season. Cincinnati (2-4) has lost four in a row since losing Joe Burrow to injury, and the Bengals suffered a 27-18 loss to Green Bay in Week 6. These teams split their two matchups last season, with the road team winning each game. Cincinnati tight end Mike Gesicki (pectoral) and defensive end Trey Hendrickson (hip) were among the players who did not practice Tuesday.Kickoff is at 8:15 p.m. ET from Paycor Stadium in Cincinnati, and Pittsburgh has won each of its last three trips to Cincy. The latest Bengals vs. Steelers  odds have Pittsburgh as the 5.5-point favorite. The over/under for total points is 43.5. Before making any Steelers vs. Bengals picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 42-25 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Now, the model has zeroed in on Cincinnati vs. Pittsburgh. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Steelers vs. Bengals:Bengals vs. Steelers       spreadPittsburgh -5.5 at DraftKings SportsbookBengals vs. Steelers     over/under43.5 pointsBengals vs. Steelers           money line Pittsburgh -267, Cincinnati +216Bengals vs. Steelers          picksSee picks at SportsLineBengals vs. Steelers   streaming Amazon PrimeWhy the Steelers can coverPittsburgh has found its groove, not only winning three straight games but also covering in all three after beginning the year 0-2 against the spread (ATS). Aaron Rodgers' 105.4 passer rating is the sixth-highest of his career, and of the five years in which he had a better rating, he won NFL MVP in four of them. Rodgers also has the third-highest completion percentage and touchdown rate of his career, while his pairing with DK Metcalf has hit its stride. The former Seahawk has touchdown receptions in four straight games, as he's just one touchdown catch away from matching his total from last season (five).The Steelers' +7 turnover differential is the second-best in the league, and even if they don't notch a takeaway, the defense can still produce elite performances. That's what occurred on Sunday as Pittsburgh's nine points allowed to Cleveland were the fewest the Steelers have given up all year. Another dominant defensive effort can be expected on Thursday versus a Cincinnati team which ranks in the bottom four in the key stats of points scored, yards gained, rushing offense and passing offense. See which team to back at SportsLine. Why the Bengals can coverCincinnati is coming off a road loss to Green Bay, but there were some promising signs for the Bengals. One is that the team covered, after losing three straight ATS, and another was the performance of Joe Flacco, just days after being acquired by the team. Flacco provided a spark for the offense as he had two touchdown passes and no turnovers, compared to Jake Browning, who failed to have more touchdowns than turnovers in any of his four games. Ja'Marr Chase had a 10-94-1 stat line as his 12th career game with 10-plus catches and a touchdown are now tied for fourth-most in NFL history.Cincy is a perfect 4 for 4 in red-zone scoring over their last two games, and it ranks second in the NFL in red-zone conversion percentage this season. That could be a bad omen for Pittsburgh, as its defense isn't quite on par with prior seasons. The Steelers are 26th in total defense, 27th in passing defense and haven't experienced much recent success in flustering Flacco. The 40-year-old has played turnover-free ball versus the Steelers over his last three games versus them. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code to get $300 in bonus bets after placing a $5 wager:How to make Steelers vs. Bengals picksFor the NFL Week 7 Thursday Night Football game of Bengals vs. Steelers, the model is leaning Over the total, projecting 46 total points. It also says one side of the spread hits nearly 60% of the time. See what it is at SportsLine.Who wins Steelers vs. Bengals, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the Bengals vs. Steelers spread you need to jump, all from the model that is 42-25 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steelers vs. Bengals odds, picks, 'Thursday Night Football' predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/33eac641-235a-45e4-aa58-61968dd6d08c/thumbnail/1200x675/4f2a22813b0d38dd60953928d125c4a5/jamarr-chase-cincinnati-bengals-imagn-images-1.jpg"
      ],
      "datePublished": "2025-10-15T12:12:34.000Z",
      "dateModified": "2025-10-15T12:12:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Predicting overreactions for NFL Week 7: Trey Hendrickson done with Bengals? Commanders miss playoffs? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/predicting-overreactions-nfl-week-7-trey-hendrickson-done-with-bengals-commanders-miss-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/06/11/780bb310-dffe-4b71-ae95-79ec2f66fe2f/thumbnail/1200x675/4b784428ed5700f3cdaae733d20bffcb/getty-trey-hendrickson-bengals.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:47:21.000Z",
    "description": "\n        The NFL season is officially a third of the way completed, and we certainly have some interesting storylines through this point of the year. ",
    "body": "\n        The NFL season is officially a third of the way completed, and we certainly have some interesting storylines through this point of the year. None of the four AFC division leaders -- New England Patriots, Pittsburgh Steelers, Indianapolis Colts and Los Angeles Chargers -- won their division last season. The Colts are 5-1 and have the top seed in the conference!The NFC has a surprise No. 1 seed with the Tampa Bay Buccaneers, who have the best record in the conference at 5-1. The NFC West is wild with three teams -- San Francisco 49ers, Seattle Seahawks, Los Angeles Rams -- sitting at 3-2, while the NFC South currently has three teams at .500 or better.There are some big games this week, starting with the Buccaneers at the Detroit Lions on Monday night. The Colts get the Chargers in a true test in Los Angeles, while the Rams travel east to face the Jacksonville Jaguars. There are plenty of games that may warrant overreactions this week. \n        \n            \n                Prisco's Week 7 NFL picks: Steelers beat Bengals in old-timer QB battle, Lions slip past Bucs in NFC showdown\n                \n                    Pete Prisco                \n            \n                            \n    \n                \n                    \n    \nOf course, overreactions are a hot topic in the NFL these days. Can we will them into existence? Perhaps, based on the results of the upcoming slate and how we predict that game this week is going to go.\nThese overreaction predictions are a result of what we think will happen this week, rather than the actual result. Buckle up.Mike McDaniel won't be Dolphins head coach past this weekThe Dolphins played hard against the Chargers, a game they should have won. That would have pushed back some talk of McDaniel being on the hot seat, even if Tua Tagovailoa made his comments about players-only meetings. If the Dolphins lose this week, the end of the road by be here for McDaniel. The Dolphins face the Browns this week, a matchup where their poor defense has a chance to shine against rookie quarterback Dillon Gabriel. Of course, this could go the other way too. \nGabriel could shine and Quinshon Judkins could have a huge day on the ground against the Dolphins poor run defense (ranked 21st against the run). If the Browns move the ball and the Dolphins find a way to lose, this could be it for McDaniel. Drake Maye will get MVP votesWhat Maye has done in year two with the Patriots has been nothing short of impressive. Not only are the Patriots currently in first place in the AFC East, but Maybe has been a driving force toward the franchise's resurgence.Maye ranks in the top five in the NFL in completion percentage (73%), passing yards (1,522) and yards per attempt (8.5) this season. He's just the third quarterback with a completion percentage of 70% and 250+ passing yards per game through six games of his first or second season -- joining Kurt Warner (1999) and Joe Burrow (2021). Maye also leads the NFL in completion rate (63.2%) on throws of 15+ air yards this season.\nGuess who Maye and the Patriots offense get to face this week? The Titans defense, who allow a passer rating of 82.1 (24th in NFL) and a 79.9 passer rating on throws of 10+ air yards (21st in NFL). The stage is set for Maye to have a huge day, and enter the MVP conversation. The Patriots also potentially going to 5-2 will help. Commanders will miss the playoffsThis is certainly a possibility if Washington loses to Dallas on Sunday. All of a sudden this NFC East rivalry is a massive game for both teams, with Dallas at 2-3-1 and Washington at 3-3. The Commanders are coming off a loss to the Bears after failing to seal the game late while the Cowboys couldn't stop the Panthers and missed an opportunity to reenter the NFC East race.Check out the NFC playoff standings. The Falcons, Vikings and Bears are 3-2 while the Panthers are 3-3. The Bears have the head-to-head tiebreaker over the Commanders, who are 12th in the conference standings through six weeks. This is a game Washington has to win, especially with Kansas City (road), Seattle (home), and Detroit (home) coming up. \nIf Washington can't get to 4-3, it's fair to wonder if the Commanders will be a playoff team. Saquon Barkley is back to his 2024 formThere's a golden opportunity for Barkley to recapture his dominance from the 2024 season this week. Barkley has immensely struggled in 2025, a product of the banged up offensive line that has affected his rushing yards per game (54.2) and his yards per carry (3.4).Barkley is a shadow of the player that rushed for 2,006 yards last season, but that can change against a Vikings run defense Sunday. The Vikings have one of the best defenses in the NFL, but they allow 132.2 rushing yards per game (24th in NFL) and 4.5 yards per carry (22nd in NFL). \nIf the Eagles can improve the communication up front and get the ground game going, Barkley could be in line for a huge day. Don't be surprised if Barkley has a long touchdown run on Sunday. This will be Trey Hendrickson's last game with the BengalsThe Bengals are close to waving the white flag on the 2025 season, throwing a Hail Mary to salvage the year by trading for Joe Flacco to be their starting quarterback. Flacco had mixed results in Sunday's loss to the Packers, throwing for two touchdowns but was just 14 of 24 for 90 yards  through three quarters. That's not exactly moving the offense. Flacco's second test with the Bengals comes against the Steelers on Thursday, a team he is very familiar with. What if Flacco has a poor game again and the Bengals defense can't slow down the suddenly-hot Aaron Rodgers on a short week? \nThe Bengals will be 2-5 with Joe Burrow essentially done for the year. They'll be on a mini-bye, plenty of time for the front office to make a decision on the immediate future of the organization. Perhaps Cincinnati actually moves on form Director of Player Personnel Duke Tobin and takes offers for Hendrickson, who will be a free agent after the year.Plenty of contending teams desperately need pass rushers, and Hendrickson is the biggest prize on the market. The Bengals may just move on after Week 7.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Predicting overreactions for NFL Week 7: Trey Hendrickson done with Bengals? Commanders miss playoffs? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/06/11/780bb310-dffe-4b71-ae95-79ec2f66fe2f/thumbnail/1200x675/4b784428ed5700f3cdaae733d20bffcb/getty-trey-hendrickson-bengals.jpg"
      ],
      "datePublished": "2025-10-15T11:47:21.000Z",
      "dateModified": "2025-10-15T11:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UTEP vs. Sam Houston odds, picks, score predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/utep-sam-houston-prediction-odds-expert-picks-line-college-football-wednesday-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/29/4639586d-e181-4c41-93e0-6e5c8907ff90/thumbnail/1200x675/be28ffe0b221d5ad9a65fb44166f9de0/hunter-watson-sam-houston.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:24:32.000Z",
    "description": "\n        A Conference USA matchup features the UTEP Miners (1-5) and the Sam Houston Bearkats (0-6) battling on Wednesday evening. UTEP has dropped fo",
    "body": "\n        A Conference USA matchup features the UTEP Miners (1-5) and the Sam Houston Bearkats (0-6) battling on Wednesday evening. UTEP has dropped four consecutive games. Last week, Liberty defeated the Miners 19-8. The Bearkats are still searching for their first victory. On Oct. 9, Jacksonville State beat Sam Houston 29-27. Kickoff from the Shell Energy Stadium in Houston, Texas, is at 7 p.m. ET on CBS Sports Network. The Miners are 2.5-point favorites in the latest UTEP vs. Sam Houston odds, while the over/under for total points scored is 47.5 via SportsLine consensus. Before making any Sam Houston vs. UTEP picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on UTEP vs. Sam Houston. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for UTEP vs. Sam Houston:UTEP vs. Sam Houston             spreadMiners -2.5 at DraftKings SportsbookUTEP vs. Sam Houston                       over/under47.5 pointsUTEP vs. Sam Houston                       money line Miners -138, Bearkats +115UTEP vs. Sam Houston               picksSee picks at SportsLineUTEP vs. Sam Houston                 streaming Fubo (Try for free)  Why UTEP can coverJunior receiver Kenny Odom is the leading pass catcher for the Miners, as he leads the team in catches (26) and receiving yards (300) with two scores. The Georgia native has gone over 50 receiving yards in three games this season, including three catches for 53 receiving yards in his last outing. Senior safety Udoka Ezeani has 26 total tackles, with team-highs in sacks (4) and forced fumbles (2). Senior linebacker Micah Davey is another productive player in the middle of the defense. He has a team-high 63 total tackles. The Louisiana native has three games with double-digit tackles in 2025. See which team to back at SportsLine. Why Sam Houston can coverSenior quarterback Hunter Watson brings a dual-threat ability under center. Watson has 754 passing yards, 208 rushing yards and six total touchdowns this season. In his last outing against Jacksonville State, Watson went 12-of-19 for 136 passing yards and three passing scores. He's added 52 rushing yards as well. Senior defensive back Emon Allen has logged 26 total tackles, a forced fumble, two interceptions and one defensive touchdown. The Bearkats are 1-1 ATS as the home underdogs this season. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make UTEP vs. Sam Houston picksSportsLine's model is going Under on the total, projecting 44 combined points. It also says one side of the spread hits in nearly 70% of simulations. You can only get the pick at SportsLine. So who wins UTEP vs. Sam Houston, and which side of the spread hits nearly 70% of the tiem? Visit SportsLine now to see which side of the UTEP vs. Sam Houston spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UTEP vs. Sam Houston odds, picks, score predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/29/4639586d-e181-4c41-93e0-6e5c8907ff90/thumbnail/1200x675/be28ffe0b221d5ad9a65fb44166f9de0/hunter-watson-sam-houston.jpg"
      ],
      "datePublished": "2025-10-15T11:24:32.000Z",
      "dateModified": "2025-10-15T11:24:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delaware vs. Jacksonville State odds, picks, predictions from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/delaware-jacksonville-state-prediction-odds-expert-picks-line-college-football-wednesday-week-8-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/98b29cc1-a960-475e-bfbb-1c17640df1f8/thumbnail/1200x675/9ab28204cad0f0d785db9f9cbed3a01c/nick-minicucci-delaware-blue-hens-cbs.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:14:30.000Z",
    "description": "\n        Two of the better teams in Conference USA clash when the Delaware Blue Hens battle the Jacksonville State Gamecocks on Wednesday night. Delaw",
    "body": "\n        Two of the better teams in Conference USA clash when the Delaware Blue Hens battle the Jacksonville State Gamecocks on Wednesday night. Delaware is coming off a 27-24 loss to Western Kentucky on Oct. 3, while Jacksonville State held off Sam Houston State 29-27 on Thursday. The Blue Hens (3-2, 1-1 C-USA), who are in their first year in the conference, are 1-1 on the road this season. The Gamecocks (3-3, 2-0 C-USA), who have a plus-16 point differential, are 2-0 on their home field in 2025. Kickoff from AmFirst Stadium in Jacksonville, Ala., is at 7 p.m. ET. Delaware leads the all-time series 2-0. The Blue Hens are 3-point favorites in the latest Delaware vs. Jacksonville State odds, while the over/under for total points scored is 57.5 via SportsLine consensus. Before making any Delaware vs. Jacksonville State picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Delaware vs. Jacksonville State. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Jacksonville State vs. Delaware:Delaware vs. Jacksonville State                                                         spreadDelaware -2.5 at DraftKings SportsbookDelaware vs. Jacksonville State                                                                   over/under57.5 pointsDelaware vs. Jacksonville State                                                                   money line Delaware -144, Jacksonville State +121Delaware vs. Jacksonville State                                                           picksSee picks at SportsLineDelaware vs. Jacksonville State                                                             streaming Fubo (Try for free)  Why Delaware can coverThe Blue Hens' offense is led by junior quarterback Nick Minicucci. In five games this season, he has completed 120 of 186 passes (64.5%) for 1,379 yards and eight touchdowns with three interceptions. He has also carried 51 times for 128 yards (2.5 average) and seven touchdowns. In the loss to Western  Kentucky, he completed 28 of 45 passes for 314 yards and one interception, while rushing 12 times for 55 yards and three touchdowns.Minicucci's top target in the passing game is senior wide receiver Kyre Duplessis. Duplessis is in his first year in the program after three seasons at Coastal Carolina. In five games, he leads the team with 22 receptions for 340 yards (15.5 average) and two touchdowns. In a 44-41 overtime win over Connecticut, he caught nine passes for 161 yards (17.9 average) and one touchdown. See which team to back at SportsLine. Why Jacksonville State can coverFreshman Caden Creel has taken over at quarterback for the Gamecocks. In the win over Sam Houston  State, he completed 13 of 17 passes for 129 yards, while rushing 24 times for 132 yards and one touchdown. For the season, he has completed 25 of 37 passes (67.6%) for 270 yards and one touchdown with two interceptions. He has also carried 57 times for 381 yards (6.7 average) and three touchdowns.Junior running back Cam Cook powers the ground attack. In six games, he has carried 142 times for 832 yards (5.9 average) and seven touchdowns. He also has caught 13 passes for 140 yards (10.8 average). In the win over Sam Houston State, he carried 31 times for 218 yards (7.0 average) and two touchdowns. He had 195 yards rushing and two touchdowns on 29 carries in a 34-24 win over Liberty on Sept. 6. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Delaware vs. Jacksonville State picksSportsLine's model is going Under on the total, projecting 55 combined points. It also says one side of the spread hits in well over 70% of simulations.     You can only get the pick at SportsLine. So who wins Jacksonville State vs. Delaware, and which side of the spread hits well over 70% of the time? Visit SportsLine now to see which side of the Delaware vs. Jacksonville State spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delaware vs. Jacksonville State odds, picks, predictions from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/98b29cc1-a960-475e-bfbb-1c17640df1f8/thumbnail/1200x675/9ab28204cad0f0d785db9f9cbed3a01c/nick-minicucci-delaware-blue-hens-cbs.jpg"
      ],
      "datePublished": "2025-10-15T11:14:30.000Z",
      "dateModified": "2025-10-15T11:14:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Haji Wright, Cristian Roldan ace USMNT auditions, offer optimism for USA soccer eight months before World Cup - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/haji-wright-cristian-roldan-ace-usmnt-auditions-offer-optimism-for-usa-soccer-eight-months-before-world-cup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/f137f46d-839b-49a4-9ef2-c8a9534e0a58/thumbnail/1200x675/d56e04e98f4018026c0aba4dc809ff0e/haji.jpg",
    "tag": "Sports",
    "date": "2025-10-15T09:11:52.000Z",
    "description": "\n        COMMERCE CITY, Colo. – Eight months before the opening whistle blows at the World Cup, every friendly is essentially a live audition for all ",
    "body": "\n        COMMERCE CITY, Colo. – Eight months before the opening whistle blows at the World Cup, every friendly is essentially a live audition for all the world to see and on Tuesday against Australia, U.S. men's national team head coach Mauricio Pochettino embraced the spirit of experimentation completely. He made six changes to the starting lineup from Friday's 1-1 draw with Ecuador and was forced to make a seventh when Christian Pulisic came off with an injury in the first half. It was a golden opportunity for those players despite the imperfect situation of playing without the team's star player, and the results were understandably mixed. Make no mistake, though – a few winners emerged from the USMNT's 2-1 win over Australia on Tuesday, offering new signs of optimism for the World Cup hosts in the process.The one indisputable winner in the Denver suburbs on Tuesday night was forward Haji Wright, who scored twice in his first start for the national team since Pochettino took the helm a year ago. His absence was not because he was out of favor but rather the unlucky result of injuries, though he returned to the national team in arguably the form of his life – the versatile forward has nine goals in 11 games for Coventry City this season, hopes high that he would translate that form to the USMNT at a crucial time in the group's World Cup preparations.Wright did just that on Tuesday with two impressive goals, ones that showcase his unique instincts as a goalscorer. Wright was on the receiving end of an impressive ball from midfielder Cristian Roldan for his first and opted to almost run ahead of the ball, catching Australia's defense by surprise as he poked the ball into the back of the net. The second, in which Wright connected again with Roldan on a quickly-taken freekick, saw Wright outrun an opposition player and then slip behind him for a perfect, unobstructed shot on goal.\n\"I saw Roly looking at me,\" Wright said post-match. \"He kind of gave me a little head flick. I kind of picked up on it and I was like, okay, let's do it, so I spun immediately. Then as the ball bounced, I kind of noticed there's no one around me so I tried to see if anybody was in the box. I wanted to cross it initially but once nobody was in the box, I knew I had to create the chance myself.\"\nWright's trajectory nearly matches that of Folarin Balogun's, who himself spent nearly the entirety of Pochettino's first year in charge away with injury but has two goals and one assist in four games since returning in September. While Balogun may have had a chance to stake his claim first on a starting role, Wright's performance on Tuesday just might create a sense of competition that has been missing in that particular position for years – and exemplifies the competitive edge Pochettino has fostered within the expanded player pool, a year into the job.Call it What You Want: A weekly podcast where Jimmy Conrad, Charlie Davies and Tony Meola cover all things USMNT and the state of the beautiful game in the United States. Catch the show YouTube live every Tuesday and Thursday at 10 a.m. ET.\"That is what we expect when you give the opportunity to the player, no?,\" Pochettino said about Wright seizing his opportunity. \"I think that is good news to have players that can compete for a spot in the World Cup. I think every time that we can have the possibility to provide the player -- maybe they didn't play too much in the last year with us -- I think that is an important thing. It's to say, 'I am here and I want to play. I want to be part of this team,' and with [a] performance like this, it's for sure a player that performed like that, Haji can be close. It's possible to be involved.\"\nBalogun and Wright's recent contributions lend a real helping hand to the USMNT's overall attacking efforts, which have yet to fully click in the midst of Pochettino's ongoing rebuild of the side. Against Ecuador and in September's 2-0 win over Japan, the U.S. generated promising opportunities but were unable to finish them at times, while against Australia, their meaningful opportunities were almost few and far between as they faced another uber-defensive opponent. Balogun and Wright found ways to overcome those challenges even if there is room for improvement, while the assists from Malik Tillman on Balogun's goal against Ecuador and Roldan's pair for Wright against Australia signal that some things are, in fact, working. In October, the group also managed to find goals without Pulisic on the field for all but the 30-minute sliver of time he played on Tuesday, another sign that things just may be trending in the right direction.Roldan came out as another big winner on Tuesday, charting an unlikely journey back into the USMNT's good graces. Like Wright, he was a member of the U.S. 2022 World Cup team, but in the years since the 30-year-old's national team profile faded until a surprise late call-up for September's friendlies against South Korea and Japan. He returned to the fold for a second international break in a row and has now played an important role in the USMNT's last two victories, bolstered by the fact that Pochettino's new-look tactical approach, rooted in building out of the back with three center backs, is exactly how Roldan is used to playing at the Seattle Sounders.\"It's what we need and then we need players with confidence, with some belief, with a little bit [of] arrogance, a little bit being naughty, being competitive and then maybe Cristian Roldan is [an] example,\" Pochettino said. \"If you want to build your perfect player, he has a little bit of everything.\"\nWhile Wright personifies Pochettino's desire for competition, Roldan is a perfect case study for his open door policy that saw the head coach treat player pool expansion as a top priority. The compliment from Pochettino was not lost on the midfielder, and neither is his trajectory back into the national team.\"I'm playing, I feel like, the best of my career,\" Roldan said. \"Unfortunately, it's at age 30. I wish it was a little younger, but it's great that number one, I'm getting seen, that I'm getting involved in camps and now feeling like I'm a part of the team. ... I never really got the chance to play against the very best in the world. I didn't play in the World Cup in '22. I didn't play in some of the bigger games with the national team. I never left Seattle and played in Europe, played in these [UEFA] Champions League games so [the Club World Cup] was a great moment for me to understand where I'm at, understand that I can compete against the best, understand that I'm playing at a high level and it gave me a whole lot of confidence throughout the second [half] of the season.\"Wright and Roldan provided a lot of upside for the USMNT against Australia, almost making up for the mistakes that the hosts' defense made at different points during the game. The entire group -- this time made up of goalkeeper Matt Freese, center backs Chris Richards, Miles Robinson and Mark McKenzie and midfielder James Sands in front of them -- were caught ball-watching on Jordan Bos' goal for Australia, and they were caught sleeping at the start of the second half. It will perhaps come as no surprise that the USMNT are better with Tyler Adams on the field, even if it is bad news for Sands, while it may be less encouraging that the U.S.'s best defensive performances so far have come when Tim Ream is on the field as well.\nA mixed bag, though, is to be expected from a series of auditions, no matter the looming deadline of the World Cup. Pochettino made it clear that the tryouts are not over just yet, either -- November's friendlies against Paraguay and Uruguay mark the next phase in a months-long journey to decide the World Cup roster, the head coach once again underscoring why his focus on experimentation is key to making the tough calls next summer.\"I think both games [in October offered] the possibility to see different combinations [of] players playing together,\" Pochettino said. \"Today, I think that some players never played together. That is priceless for us. I think it's important. We still [have] a long time to the World Cup and I think we can. We can assess and it's open ... To be sure that which type of profile, of characteristics you need because not only [do] you need good players, but also you need good teammates, good people, people that can put the interests of our national team [above] your own interests and that is important to see all the details, the situations when you are playing well, when you are not playing well. This type of thing, we take note.\"The players are responding in accord.\"I think I have to continue to perform,\" Wright said. \"I think if I just shut off now, chances will probably diminish but I'm happy that it happened and I try and build off that.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Haji Wright, Cristian Roldan ace USMNT auditions, offer optimism for USA soccer eight months before World Cup - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/f137f46d-839b-49a4-9ef2-c8a9534e0a58/thumbnail/1200x675/d56e04e98f4018026c0aba4dc809ff0e/haji.jpg"
      ],
      "datePublished": "2025-10-15T09:11:52.000Z",
      "dateModified": "2025-10-15T09:11:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prisco's NFL picks, Week 7: Steelers beat Bengals, Bucs lose close one to Lions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/pete-priscos-week-7-nfl-picks-odds-best-bets-steelers-bengals-lions-buccaneers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/11/52543bdd-ae51-413f-a946-407913314760/thumbnail/1200x675/c1b9006167935f7c1f1f7993b9ee6c87/aaron-rodgers-pittsburgh-steelers.jpg",
    "tag": "Sports",
    "date": "2025-10-15T10:00:48.000Z",
    "description": "\n        The picks have leveled off some after a good start, which is never a good thing.I went 6-9 against the spread last week and 9-6 straight up. ",
    "body": "\n        The picks have leveled off some after a good start, which is never a good thing.I went 6-9 against the spread last week and 9-6 straight up. That's not good considering the first five weeks of the season had me nicely above .500 for both. The 6-9 ATS record felt a lot worse, too. It just wasn't pretty. That brings my ATS record to 49-44 on the season -- still above .500 in a tough year -- and my straight-up record is now 66-26-1.It's not good. It's not bad. It just is. So let's hope the string of mediocrity changes this week. I do like the card, so let's go.Bet NFL Week 7 games and NFL odds at DraftKings, where new users who win a $5 wager get $300 in bonus bets and 3 free months of NBA League Pass: Click here to get started:Pittsburgh Steelers (-5.5) at Cincinnati BengalsThursday, 8:15 p.m. on Prime Video\nThis is a battle between two old quarterbacks, Aaron Rodgers and Joe Flacco. But Rodgers is playing at a high level so far for the Steelers, while Flacco is making his second start for the Bengals. This one has the look of a lot of points, but I think it will be Rodgers who leads his team to most of those. Steelers take it.   Pick: Steelers 33, Bengals 26 | Odds via BetMGMLos Angeles Rams vs. Jacksonville Jaguars (+3), in LondonSunday, 9:30 a.m. on NFL Network (Stream: Fubo -- try for free)\nThe Rams beat the Ravens last week, while the Jaguars lost to the Seahawks. The Seattle line sacked Trevor Lawrence seven times in that game. The Rams' defensive front has to be licking its chops. The Los Angeles offense will be without Puka Nacua, its best receiver. That matters. The Jaguars will pull one out late. Pick: Jaguars 24, Rams 21 | Odds via BetMGMCarolina Panthers at New York Jets (+2)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Panthers head out on the road as favorites for the first time since 2022. The Jets are winless, so there's the reason. They also haven't played well. The Panthers are physical on both lines, but I think the Jets will be up to it. They will limit the run game and win with their defense.  Pick: Jets 20, Panthers 17 | Odds via Caesars SportsbookLas Vegas Raiders at Kansas City Chiefs (-11.5)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nThe Chiefs are big favorites here for a reason. They are getting the offense cranked up and will have Rashee Rice back to add to it. The Raiders have defensive issues, which Patrick Mahomes will use to his advantage. Geno Smith won't keep up and will continue to turn it over. Chiefs big.   Pick: Chiefs 35, Raiders 20 | Odds via FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 bet:Miami Dolphins at Cleveland Browns (-2.5)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nThis is the dog game of the day between two bottom feeders. The Browns haven't done much on offense with Dillon Gabriel playing, but the Dolphins defense will be the perfect tonic. They can't stop anybody. The Browns defense can. That's the difference. Pick: Browns 26, Dolphins 23 | Odds via DraftKings SportsbookNew England Patriots at Tennessee Titans (+7)Sunday, 1 p.m. on CBS (Stream on Paramount+)\nFormer Titans coach Mike Vrabel takes his Patriots team to Nashville to play his old team. The Titans are reeling having fired coach Brian Callahan this week. They aren't playing well, but New England is for sure. But this is a third straight road game for the Patriots. That's tough. Titans will hang around as they get the interim-coach bump.Pick: Patriots 23, Titans 19 | Odds via Caesars Sportsbook\n        \n            \n                NFL Week 7 picks and score predictions: Bengals shock Steelers, Rams top Jaguars in London\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nNew Orleans Saints at Chicago Bears (-5.5)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Bears are 3-2 coming off an impressive road victory against the Commanders. Caleb Williams is playing good football for Chicago. The Saints have hung around in games and Spencer Rattler is coming off a good game last week. But this will be the Bears pulling it out in the second half behind Williams. Pick: Bears 27, Saints 20 | Odds via BetMGMPhiladelphia Eagles at Minnesota Vikings (+2.5)Sunday, 1 p.m. on Fox (Stream: Fubo -- try for free)\nThe Eagles have lost two straight and just don't look right. The Vikings are coming off a bye, and might have quarterback J.J. McCarthy back. If not, it's Carson Wentz. It doesn't matter. This will come down to the Eagles getting Saquon Barkley going and he will run through the Vikings. Eagles will win a tight one.   Pick: Eagles 24, Vikings 22 | Odds via Caesars Sportsbook, where new users get 20 100% profit boosts with the code CBS20X:Indianapolis Colts at Los Angeles Chargers (-1.5)Sunday, 4:05 p.m. on CBS (Stream on Paramount+)\nThis is an enormous game for these two, and especially a prove-it game for the Colts since they have played a softer schedule. They have been impressive, but this will be a challenge. I think the Chargers and Justin Herbert will be up to it. This will be fun to watch with a lot of points.Pick: Chargers 34, Colts 27 | Odds via BetMGMNew York Giants at Denver Broncos (-7)Sunday, 4:05 p.m. on CBS (Stream on Paramount+)\nThe Giants are rested after beating the Eagles last Thursday, while Denver is back from a trip overseas. Advantage, Giants. But this will be a tough test for Giants rookie quarterback Jaxson Dart. The Denver defense leads the NFL in sacks. That will be the difference as they speed him up and force turnovers.   Pick: Broncos 28, Giants 16 | Odds via DraftKings SportsbookGreen Bay Packers (-6.5) at Arizona CardinalsSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\nThere is a good chance this could be Jacoby Brissett starting again for the injured Kyler Murray at quarterback. Brissett played well last week in the loss to the Colts, but this Green Bay defense will be a tougher test. Look for the Green Bay offense to get it going in the passing game as well. Packers win it. Pick: Packers 31, Cardinals 23 | Odds via Caesars SportsbookWashington Commanders (-1.5) at Dallas CowboysSunday, 4:25 p.m. on Fox (Stream: Fubo -- try for free)\nBoth of these teams are coming off tough losses, while the Commanders are playing on a short week out on the road. That's tough to do. But the Dallas defense is so bad right now that it won't matter. This will be a shootout, but the Commanders and Jayden Daniels will get the best of it against Dak Prescott. Pick: Commanders 34, Cowboys 30 | Odds via FanDuel SportsbookAtlanta Falcons at San Francisco 49ers (-2.5)Sunday, 8:20 p.m. on NBC (Stream: Fubo -- try for free)\nThe Falcons are on a short week having played Monday, but the 49ers are so banged up. There is a chance Brock Purdy can be back after missing the past two games with a toe injury. That matters. The Falcons have a fierce pass rush these days, so that will challenge Kyle Shanahan to call a game to minimize it. I think he does, and the 49ers take advantage of a team on the road on a short week.   Pick: 49ers 23, Falcons 19 | Odds via FanDuel SportsbookTampa Bay Buccaneers (+5.5) at Detroit LionsMonday, 7 p.m. ET on ABC (Stream: Fubo -- try for free)\nThis is a big game in terms of NFC dominance. Both teams have a lot of injury issues, yet they have fought through them. The Bucs are the top seed right now in the NFC because of Baker Mayfield. With Jared Goff also rolling up big numbers, this has the look of a game with a lot of points. I see the Lions winning a close one.Pick: Lions 35, Buccaneers 34 | Odds via DraftKings SportsbookHouston Texans at Seattle Seahawks (-3.5)Monday, 10 p.m. ET on ESPN (Stream: Fubo -- try for free)\nThe Seahawks looked dominant in their win at Jacksonville last week, especially on defense. Quarterback Sam Darnold also continues to play well, but he will face a tough Houston defense. The Texans are off a bye, so they are rested. But I think this will come down to the Seattle front getting the best of the Houston offensive line. Poor C.J. Stroud.   Pick: Seahawks 23, Texans 17 | Odds via DraftKings Sportsbook\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prisco's NFL picks, Week 7: Steelers beat Bengals, Bucs lose close one to Lions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/11/52543bdd-ae51-413f-a946-407913314760/thumbnail/1200x675/c1b9006167935f7c1f1f7993b9ee6c87/aaron-rodgers-pittsburgh-steelers.jpg"
      ],
      "datePublished": "2025-10-15T10:00:48.000Z",
      "dateModified": "2025-10-15T10:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One trade each contender should make: Trey Hendrickson to NFC, Alvin Kamara to Los Angeles, new RB for Chiefs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/one-trade-each-contender-should-make-trey-hendrickson-to-nfc-alvin-kamara-to-los-angeles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/77cd17c3-0e22-432d-9601-c16cc2d1c10d/thumbnail/1200x675/36f78f259270760d93c54d5ea388a9d2/trey-hendrickson.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:30:45.000Z",
    "description": "\n        Time flies when you're having fun, and that's certainly the case for the 2025 NFL season. It feels like the year has just begun, but we're al",
    "body": "\n        Time flies when you're having fun, and that's certainly the case for the 2025 NFL season. It feels like the year has just begun, but we're already six weeks in -- a third of the way through.That means enough time has passed for the league's 32 teams to assess whether they truly believe they're contenders or pretenders ahead of the NFL's Nov. 4 trade deadline. Through six weeks, here are the AFC and NFC postseason contenders that should consider making a move to supplement their roster.AFC: Indianapolis Colts (5-1), Pittsburgh Steelers (4-1), Los Angeles Chargers (4-2), New England Patriots (4-2), Buffalo Bills (4-2), Jacksonville Jaguars (4-2), Denver Broncos (4-2), Kansas City Chiefs (3-3).NFC: Tampa Bay Buccaneers (5-1), Green Bay Packers (3-1-1), San Francisco 49ers (4-2), Philadelphia Eagles (4-2), Seattle Seahawks (4-2), Detroit Lions (4-2), Los Angeles Rams (4-2), Atlanta Falcons (3-2), Minnesota Vikings (3-2), Washington Commanders (3-3)\nGiven every contender's respective needs/holes through six weeks, here's one move that each should aim to make before the 2025 trade deadline to bolster its roster for a playoff push.AFCIndianapolis Colts: New Orleans Saints LB Demario DavisRecord: 5-1\nDespite being 36 years old, two-time Pro Bowl linebacker Demario Davis can be a plus-starter for an NFL contender in 2025. Pro Football Focus grades Davis among football's 10 best inside linebackers this season -- his overall PFF defensive grade (81.1) ranks ninth, and his run defense is fifth (90.2). His 33 tackles on designed rushing plays are sixth-most in the NFL, according to TruMedia.Indianapolis has attempted to fix their inside linebacker spot next to Zaire Franklin by signing the recently-released Germaine Pratt, but adding Davis could give them the depth in the middle of their defense that coordinator Lou Anarumo craves.\nPittsburgh Steelers: Baltimore Ravens WR DeAndre HopkinsRecord: 4-1\nPerhaps the Steelers have surprised themselves with their 4-1 start and an ever-growing AFC North lead thanks to having 41-year-old Aaron Rodgers at quarterback, plus both Cincinnati Bengals Pro Bowl signal-caller Joe Burrow and Baltimore Ravens MVP Lamar Jackson sidelined by injuries.That has the Steelers positioned to be buyers this season, and they could desperately use another wide receiver alongside Pro Bowler DK Metcalf with Calvin Austin III (shoulder) banged up. Five-time Pro Bowl wide receiver DeAndre Hopkins, even at the age of 33, would make a lot of sense. He's caught nine of his 13 targets this season for 178 yards (19.8 per catch) and two receiving touchdowns without a drop. PFF's 92.1 offensive grade for Hopkins is second-highest in the NFL at wide receiver behind only Los Angeles Rams Pro Bowler Puka Nacua's's 92.6 grade.The acquisition cost for Hopkins shouldn't be high given his age, and the Ravens won't need his services much longer with one of football's worst defenses making it nearly impossible for whoever lines up at quarterback for them to win games. It seems like a win-win deal for two bitter AFC North rivals with the Ravens even getting a single pick back for a 33-year-old receiver on a one-year deal. \nLos Angeles Chargers: New Orleans Saints RB Alvin KamaraRecord: 4-2\nThe Chargers' offense is as injury-riddled as it gets with offensive tackle Rashawn Slater (torn patellar tendon, out for the season), offensive tackle Joe Alt (ankle), running back Omarion Hampton (ankle, on injured reserve) and wide receiver Derius Davis (knee) all banged up. Quarterback Justin Herbert could use some help, particularly an easy checkdown option given his depleted offensive line.Saints running back Alvin Kamara could help Herbert and the Chargers both on the ground and through the air. The five-time Pro Bowler's 595 career catches are fourth-most in NFL history by a running back. Kamara is now 30-years-old, and New Orleans is off to a 1-5 start in Kellen Moore's first season as the Saints' coach.While the Saints have notoriously kept members of their aging core to their salary cap's detriment, perhaps Kamara would be interested in a change of scenery the closer the trade deadline gets. The Chargers should at least make a call and push to acquire Kamara, especially given that Hampton is on a rookie deal and what the refinement Kamara's mentorship for Hampton could provide their 2025 first-round pick.\nNew England Patriots: Las Vegas Raiders WR Jakobi MeyersRecord: 4-2\nVeteran wide receiver Jakobi Meyers asked to be traded out of Las Vegas before the season, and the impending free agent's thoughts are likely the same with the Raiders off to a 2-4 start. Meanwhile, the Patriots are first place in the AFC East through at least six weeks of the season for the first time since the 2019 season -- Tom Brady's's last in Foxborough.Patriots quarterback Drake Maye is playing like a top 10 to top five passer through six weeks, and New England should do everything in its power to accelerate his growth in his second NFL season. Trading for Meyers is a no-brainer with the 28-year-old spending his first four seasons (2019-22) in New England, including the first three under current Patriots offensive coordinator Josh McDaniels.McDaniels also brought him to Las Vegas as a free agent in 2022 when he became the Raiders' head coach. Adding Meyers alongside four-time Pro Bowl wideout Stefon Diggs would be a huge boost for Maye, and that's why trading for him is what the Patriots should do at the trade deadline. \nDrake Maye This Season, NFL RanksNFL RanksCompletion Percentage73.2%2ndPass Yards1,5225thPass Yards/Attempt8.54thPass TD10T-9thPasser Rating112.54thExpected Points Added (EPA)/Play0.1010thBuffalo Bills: Seattle Seahawks CB Tariq WoolenRecord: 4-2  \nThe way the AFC is shaking out early on with the Chiefs off to a bumpy 3-3 start, 2025 could finally be the year for the Bills' breakthrough to reach a Super Bowl with 2024 NFL MVP quarterback Josh Allen. However, their defense could use some reinforcements, particularly in the secondary.No. 1 cornerback Christian Benford, who allowed just 0.5 yards per snap in coverage last season among cornerbacks with at least 250 coverage snaps in 2024 -- the second-fewest among that group per NFL Pro -- is slipping a little bit early on. Entering Week 6, Benford had allowed more than half of the receptions that he allowed in total last season (33 in 2024 and 18 entering Week 6 in 2025) and double the amount of receiving touchdowns in coverage, two last season and four entering Week 6 this season. Opposite of him on the outside is Tre'Davious White, who is now 30 years old and has suffered ACL and Achilles tears all within the past four years.Adding reinforcements to the secondary is critical for the Bills, and that's why they should aim to trade for bid-bodied Seattle cornerback Tariq Woolen, who stands at 6-foot-4-inches tall and weighs 210 pounds. The Seahawks are deep at cornerback, as evidenced by their 20-12 Week 6 road win at the AFC South-leading Jacksonville Jaguars with Woolen sidelined with a concussion.Jacksonville Jaguars: Cincinnati Bengals safety Geno StoneRecord: 4-2  \nThe Jaguars just made a deal at the cornerback position, sending Tyson Campbell and a 2026 seventh-round pick to the Cleveland Browns for Greg Newsome II and a 2026 sixth-round pick this past Thursday. However, their pass defense is still a work in progress after getting lit up by Sam Darnold, Jaxon Smith-Njigba and the Seahawks in Week 6: the Jaguars are allowing the third-most passing yards per game (256.3) in the entire NFL.However, they've been able to race out to a 4-2 through opportunistic play: their 14 takeaways, including 10 interceptions -- both figures lead the NFL. Trading for Bengals safety Geno Stone would only increase Jacksonville's ability to mask its pass defense via takeaways. Stone's 12 interceptions since 2023 are tied for the second-most in the NFL, trailing only Lions safety Kerby Joseph's 16 in that span. The Bengals are sinking ship with Burrow (turf toe) sidelined, and Stone is a pending free agent. This is a deal that Jacksonville should make.Denver Broncos: Baltimore Ravens TE Mark AndrewsRecord: 4-2  \nBroncos quarterback Bo Nix has been up and down in Year 2 with nine passing touchdowns to four interceptions through six games in 2025. Denver trading for three-time Pro Bowl tight end Mark Andrews, who is 30-years-old and a pending free agent, could make plenty of sense.The AFC West feels as up for grabs as it has been in years with the nine-time defending division champion Chiefs off to a 3-3 start. Denver should pounce and bolster Nix's arsenal of playmakers with Andrews, a player who had a career-high 11 receiving touchdowns just last season.The Ravens, who are off to a 1-5 start thanks to a horrific defense and Jackson sidelined by injury, have already begun to tear it down, trading former first-round pick edge rusher Odafe Oweh to the Chargers. They shouldn't have an issue trading Andrews to Denver.Kansas City Chiefs: New York Jets RB Breece HallRecord: 3-3  \nJets running back Breece Hall's talent isn't in question, but his future in New York certainly is. He's set to be a free agent next offseason, and the Jets, who are off to an 0-6 start, likely won't prioritize re-signing a running back.Meanwhile, the Chiefs could use more juice on offense, including an upgrade at running back. Isiah Pacheco has rushed for under 55 yards in every game this season, and he's gone 12 consecutive games without a rushing touchdown.New York would certainly be happy to absorb as many draft picks as it can get amid a rebuild, and the Chiefs are obviously in win-now mode. This is a deal that Kansas City should push to make.NFCTampa Bay Buccaneers: Miami Dolphins DE Jaelan Phillips Record: 5-1 \nThe Dolphins are off to a disappointing 1-5 start, All-Pro wide receiver Tyreek Hill is out for the season after a gruesome knee injury and coach Mike McDaniel is on the hot seat.That's why it would make sense for the fire sale to begin in South Beach. Oft-injured edge rusher Jaelan Phillips is only 26 years old and a pending free agent. Plus, his 20 quarterback pressures this season are the same as Houston Texans Pro Bowl edge rusher Danielle Hunter.The Buccaneers are off to a 5-1 start and the NFC's top overall seed, so they should be doing everything to bolster their roster. Boosting their pass rush with the addition of Phillips is a crucial and necessary move so that their 24th-ranked scoring defense (25.2 points per game) can do a better job of complementing their sixth-ranked scoring offense (27.5 points per game).Green Bay Packers: Arizona Cardinals DT Calais Campbell Record: 3-1-1\nThe Packers' pass rush has certainly been bolstered by the addition of All-Pro edge rusher Micah Parsons (29 quarterback pressures in 2025, tied for fourth-most in the NFL) despite the four-time Pro Bowler missing all of training with the Dallas Cowboys in a contract holdout. Green Bay ranks ninth in the NFL quarterback pressure rate (39.8%) and eighth in quarterback pressures (86). \nHowever, the team's sack numbers could be improved with the Packers' 12 teams sacks tied for 19th in the NFL and their 5.6% sack rate standing at 20th in the league. Starting defensive tackle Devonte Wyatt's knee injury in Week 4 at the Cowboys caused him to be ruled out of the Packers' Week 6 win over the Bengals despite having a Week 5 bye.Green Bay should bolster the interior of its pass rush by trading for ageless wonder and six-time Pro Bowl defensive tackle Calais Campbell. His Arizona Cardinals are off to a 2-4 start, and Campbell is 39 years old. It doesn't make any sense for him to waste what could be his 18th and final NFL season on a team that appears doomed to miss the postseason.Acquiring Campbell could create more knock back for the Packers in the middle of the line of scrimmage while Wyatt is out, thus creating more sack opportunities for Parsons, Pro Bowl edge rusher Rashan Gary and others. This is an inexpensive trade that Green Bay general manager Brian Gutekunst should make.San Francisco 49ers: Cincinnati Bengals DE Trey HendricksonRecord: 4-2\nThe Cincinnati Bengals' 2025 season is likely doomed with Burrow (turf toe) sidelined and the team out to a 2-4 start. Cincinnati has balked at giving the NFL's 2024 leader in sacks, Trey Hendrickson, a multiyear extension the past two offseasons. Now would be the time to sell high.The 49ers have the bones of a team that could compete in the wide-open NFC, but they desperately need help along their defensive front without Nick Bosa (torn ACL). Hendrickson could be the perfect rental to fill the void left by Bosa's injury, and the 49ers have the cap space, $21.2 million, according to OverTheCap.com, to absorb the final year of the four-time Pro Bowler's contract.Philadelphia Eagles: Tennessee Titans DE Arden Key Record: 4-2\nThe Eagles' pass rush was one of their superpowers en route to dominating the Chiefs in a Super Bowl LIX victory over the Chiefs to conclude the 2024 season. Following the departures of Milton Williams and Josh Sweat in free agency this offseason, Philadelphia is now just around league average at pressuring the quarterback and one of the NFL's worst at actually bringing the quarterback down.\nThey rank 15th in quarterback pressure rate (36.7%) with only nine sacks this season, tied for the seventh-fewest in the NFL with Titans. It makes sense for the Titans to struggle with getting after the quarterback because they're 1-5 and have spent the most time trailing (4:35:56) in the entire league this season.The Eagles should go get 29-year-old edge rusher Arden Key to bolster their pass rush, given that Key has 1.5 sacks while playing for Tennessee -- a team that already fired its head coach -- this season. Any help up front would be critical for Philadelphia, especially after edge rusher Za'Darius Smith's sudden retirement this week.Seattle Seahawks: Miami Dolphins safety Minkah Fitzpatrick Record: 4-2\nThe Seahawks are off to a strong start after signing Sam Darnold to be their new quarterback this offseason, and they should capitalize on that start by bolstering the back end of their defense. Safety Julian Love (hamstring) has missed three of Seattle's six games this season, so the Seahawks should be looking to bolster their depth at the position.Why not versatile, five-time Pro Bowler Minkah Fitzpatrick? The Dolphins are 1-5 and could be the next team to fire its head coach, which would trigger a clear rebuild. The Seahawks should swoop in at the opportunity to add a fun chess piece for coach Mike Macdonald to deploy on his defense in a year where the NFC looks open as ever.Detroit Lions: Miami Dolphins CB Rasul DouglasRecord: 4-2\nThe Lions could use another cornerback with cornerback D.J. Reed on injured reserve (hamstring) and cornerback Terrion Arnold (shoulder) missing for the next few weeks. Veteran Rasul Douglas knows the NFC North from his time with the Packers (2021-23) and could be a steadying, veteran presence in Detroit. It would also make all the sense in the world for the Dolphins to see if they could get a pick back for the pending free agent.Los Angeles Rams: Baltimore Ravens WR Rashod BatemanRecord: 4-2\nWith Pro Bowl wide receiver Puka Nacua suffering an ankle injury in a Week 6 win against the Baltimore Ravens, it would be wise for Los Angeles Rams general manager Les Snead to bolster quarterback Matthew Stafford's's receiving core. Wide receiver Rashod Bateman (11 catches for 120 yards and a touchdown in six games this season) has become a forgotten man in the 1-5 Baltimore Ravens' offense, especially with Jackson sidelined. Snead should give the Ravens a call to see if they would be willing to exchange Bateman for a pick or two with their defense and offensive line in desperate need of a reboot. Atlanta Falcons: Cincinnati Bengals CB Cam Taylor-BrittRecord: 3-2\nThe Falcons have the NFL's No. 1 total defense (253.4 total yards per game allowed), No. 7 scoring defense (20.0 points per game allowed) and No. 1 pass defense (139.4 passing yards per game). Atlanta should double down on that strength by bolstering its outside cornerback spot opposite A.J. Terrell that is currently occupied by Mike Hughes.Bengals cornerback Cam Taylor-Britt is a pending free agent, and Cincinnati has started him just once in his five games played this season. Taylor-Britt just turned 26 years old, and he's someone who could add crucial cornerback depth, which could further aid the development of rookie edge rushers James Pearce Jr. and Jalon Walker.Minnesota Vikings: New York Giants OL Evan NealRecord: 3-2\nThe 2-4 Giants have made 2022 seventh overall pick offensive lineman Evan Neal a healthy scratch in every game this season while building around rookie quarterback Jaxson Dart. Coach Brian Daboll has chosen to do this instead of giving Neal a shot to prove himself at guard.The Vikings have been just league average in pass protection, allowing a quarterback pressure rate of 36.2% this season, which is 16th in the NFL. Neal could be a low-cost swing for a Minnesota team that has seen its offensive line hit with some injuries thus far in 2025.Chicago Bears: New Orleans Saints CB Alontae TaylorRecord: 3-2\nFollowing three consecutive wins to get above .500 for the first time this season, the Bears have hope. However, they're without No. 1 corner Jaylon Johnson after he underwent surgery for a core muscle injury that he aggravated in Week 1. If the Saints intend to let soon-to-be 27-year-old cornerback Alontae Taylor walk in free agency this offseason after a 1-5 start to 2025 under new coach Kellen Moore, the least they could do is get a pick back for him.Bears defensive coordinator Dennis Allen made Taylor his first second-round pick as the Saints' coach (2022-24), so Taylor wouldn't need much time -- if any -- to acclimate in Allen's Chicago system. Taylor would fill a major need for the Bears for this season and potentially beyond, so general manager Ryan Poles should pick up the phone and see if he can get a deal done for Taylor.Washington Commanders: Cleveland Browns TE David NjokuRecord: 3-3\nThe Commanders need to get 2024 NFL Offensive Rookie of the Year quarterback Jayden Daniels more receiving help. Daniels' go-to-guy Terry McLaurin has missed three of the team's six games this season, and 35-year-old Zach Ertz is a fun red-zone target, but he shouldn't be relied upon to be a team's top three pass catcher in the year 2025.Fortunately for the Commanders, the Browns are 1-5, and their leader in catches (28) and receiving yards (254) happens to be rookie third-round pick tight end Harold Fannin Jr. That makes tight end David Njoku, who is set to become a free agent next offseason, expendable for the rebuilding Browns.Washington should do what it takes to get the former Pro Bowl tight end added to Daniels' arsenal in order to salvage its 2025 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One trade each contender should make: Trey Hendrickson to NFC, Alvin Kamara to Los Angeles, new RB for Chiefs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/77cd17c3-0e22-432d-9601-c16cc2d1c10d/thumbnail/1200x675/36f78f259270760d93c54d5ea388a9d2/trey-hendrickson.jpg"
      ],
      "datePublished": "2025-10-15T11:30:45.000Z",
      "dateModified": "2025-10-15T11:30:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football rankings: Two new Big Ten teams enter as UCLA escapes Bottom 25 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-rankings-bottom-25-wisconsin-purdue-ucla-big-ten-week-8/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/ebe00ea3-1712-4c43-9be3-aeb3bb2dce57/thumbnail/1200x675/f91ae970e8febf3b6bdae3d53f77e171/luke-fickell-wisconsin-vs-michigan.jpg",
    "tag": "Sports",
    "date": "2025-10-15T06:00:46.000Z",
    "description": "\n        The chances of UCLA ever escaping the Bottom 25 this season looked bleak during an 0-4 start that included a pair of losses to Mountain West ",
    "body": "\n        The chances of UCLA ever escaping the Bottom 25 this season looked bleak during an 0-4 start that included a pair of losses to Mountain West teams before the firing of coach DeShaun Foster. In fact, 0-12 seemed like a distinct possibility as the hapless Bruins prepared to host Penn State in Week 6.But since Tim Skipper took over as the interim coach, the Bruins have been on rocket fuel. A win over the Nittany Lions and a 38-13 win at Michigan State in Week 7 boosted UCLA out of the Bottom 25 with room to spare. For a team that was ranked all the way down at No. 4 in the premier metric of college football futility on Sept. 30, that's quite an accomplishment.Beating Penn State and then obliterating the Spartans effectively turned the Bruins from a bottom-feeder into a serious problem for its Big Ten opponents. As the Bruins leave the Bottom 25, two more Big Ten teams are entering this week. Purdue staved off its entry as long as it possibly could, but the Boilermakers are here now. More surprising is that Wisconsin has bottomed out so hard.The Badgers have dropped four straight games without much of a fight and have several more significant challenges looming as third-year coach Luke Fickell slips ever closer to the point of no return. Don't be surprised if Wisconsin soon inhabits the same bottom-five level of shame that UCLA recently occupied.\nThis year's Bottom 25 formula has been tweaked to ensure fair representation from across the sport. Each of the Power Four leagues gets an automatic bid to the Bottom 25 each week, and a total of 10 Power Four schools must be represented.\n        \n            \n                College football rankings: Indiana joins the top 3 after Oregon win as Texas, USC climb new CBS Sports 136\n                \n                    Chip Patterson                \n            \n                            \n    \n                \n                    \n    \nBottom 25 Rankings^ Joined Bottom 25 this weekPurdue finally arrivesGive Purdue some credit for taking longer to get here than expected. But now that the Boilermakers have arrived in the Bottom 25, we're expecting them to be repeat visitors. With games against Michigan, Ohio State and Indiana still remaining, a 2-10 or 3-9 record is quite possible. However, first-year coach Barry Odom doubled the program's win total from last season by winning his first two games. So at least there's that!25. Arkansas (24)24. Virginia Tech^23. West Virginia (23)22. Stanford^21. Purdue^\nFickle FickellWisconsin just concluded the easier half of its schedule by averaging 8.5 points during four straight losses. How bad could it get in Madison? We're about to find out, as Ohio State and Oregon are the next opponents. Indiana, Illinois, Washington and Minnesota are also left on this slate. The \"worst\" of that bunch is 4-2 Minnesota. Paul Chryst has got to be smirking somewhere after getting canned by the Badgers in 2022 when he had a .720 winning percentage. His replacement, Luke Fickell, is 15-17.20. Eastern Michigan (7)19. North Carolina (20)18. Wisconsin^17. South Alabama (17)16. Arkansas State (12)Dilfer's downfallCelebrity hires are great for headlines and buzz, but UAB is a cautionary tale of how it can go wrong. The Blazers thought it was a good idea to hire former Super Bowl-winning quarterback Trent Dilfer straight from a high school job in Nashville, and they're now paying the price for that mistake. At least Deion Sanders was actually a sitting college coach at Jackson State when Colorado hired him. Sanders also brought stud players like Travis Hunter and Shedeuer Sanders. All Dilfer brought to UAB was embarrassment up until he was fired Sunday with a 9-21 mark midway through his third season.\n15. Penn State (22)14. Air Force (19)13. UAB^12. Nevada (18)11. Northern IllinoisTexas-sized problemsThings have gotten so bad at UTEP that second-year coach Scotty Walden benched former five-star quarterback prospect Malachi Nelson this past week and started last year's QB1, Skyler Locklear, instead. It didn't have the desired effect, as the Miners lost 19-8 to a rudderless Liberty team. But there's a silver lining for CFB sickos: the outcome set up a Bottom 25 showdown for Wednesday, as UTEP will take on winless Sam Houston to decide once and for all who the worst team is in Texas.10. Akron (9)9. UTEP^8. Boston College (16)7. Charlotte (11)6. Middle Tennessee (8)\nUMassively badUMass entered the 2025 campaign with just eight victories over the past six seasons, but the 2025 Minutemen are setting a new program standard for futility. They have been outscored 194-32 in five games (all losses) against FBS teams. Their one game against an FCS foe? That was a 27-26 loss to Bryant, which is a bad FCS team whose only other victory to date is against Division II Bentley University. Being this bad is actually kind of impressive.5. Georgia State (6)4. Oklahoma State (4)3. Oregon State (5)2. Sam Houston (2)1. UMass (1)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football rankings: Two new Big Ten teams enter as UCLA escapes Bottom 25 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/ebe00ea3-1712-4c43-9be3-aeb3bb2dce57/thumbnail/1200x675/f91ae970e8febf3b6bdae3d53f77e171/luke-fickell-wisconsin-vs-michigan.jpg"
      ],
      "datePublished": "2025-10-15T06:00:46.000Z",
      "dateModified": "2025-10-15T06:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 NFL trades that should happen before deadline: Alvin Kamara to Chiefs, new WR for Giants' Jaxson Dart - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/alvin-kamara-to-chiefs-new-wr-for-giants-10-nfl-trades-that-should-happen-2025-deadline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/13/4cc01bfc-58f2-4982-8bc5-4a928992f19a/thumbnail/1200x675/002daf9c1f35fb924d2a77bb1f18f590/alvin-kamara.jpg",
    "tag": "Sports",
    "date": "2025-10-15T05:59:02.000Z",
    "description": "\n        Six weeks of the 2025 NFL season are now in the books, which means we're more than 30% through the entire regular season slate. We're also on",
    "body": "\n        Six weeks of the 2025 NFL season are now in the books, which means we're more than 30% through the entire regular season slate. We're also one step closer to this year's in-season trade deadline, the official cutoff for any trades until the 2026 offseason.All 32 teams still have until 4 p.m. ET on Tuesday, Nov. 4, to strike deals involving players or future draft picks. And there are plenty of names already rumored to be part of potential discussions, including veteran quarterbacks like Kirk Cousins and Russell Wilson. Some organizations are surely eager to add last-gasp upgrades. Others might be contemplating selling off talent to rebuild. No matter what, there are indications this October and November will be rife with activity.In the meantime, we decided to assess the entire NFL landscape and propose a couple deals of our own. Here are 10 splashy trade ideas that might actually make sense for both sides in the lead-up to the 2025 deadline, including a blockbuster defensive addition for the San Francisco 49ers and a relocation by a Pro Bowl playmaker to the Denver Broncos:\n                            \n    \n                                                \n                    \n    Alvin Kamara to the ChiefsKamara may want to retire with the New Orleans Saints, but what if the reigning AFC champions call with an offer to join a potential Super Bowl bid? Kansas City isn't ready to trust any of its bruising backs (i.e. Isiah Pacheco, Kareem Hunt, etc.) with a full workload, leaving Patrick Mahomes to do a little too much on the ground. Kamara, meanwhile, has precisely the kind of pass-catching tools that could make him a dream Swiss Army knife for Andy Reid, right alongside Xavier Worthy, Marquise Brown and Co. Would he really turn that down to stay in a rebuild?\n\n                            \n    \n                                                \n                    \n    Breece Hall to the ChargersLos Angeles just got a breakout performance from second-year reserve Kimani Vidal at running back, and rookie Omarion Hampton figures to retain a sizable role once he's back from injury. Still, the Chargers are committed to winning now under Jim Harbaugh. Why wouldn't Harbs consider bolstering the backfield for the stretch run after previously hoping Najee Harris would deepen the bench? Hall is just looking to prove his value ahead of 2026 free agency, and he's not likely to restore it taking carries for the offensively listless New York Jets.\n                            \n    \n                                                \n                    \n    Jakobi Meyers to the PanthersAre we sleeping on Carolina at 3-3? The Panthers are such a tough read given Bryce Young's volatility under center, but they're not out of the picture in the NFC South, and theoretically, they should still be in hot pursuit of anyone who can help accelerate Young's growth. Meyers lacks a long-term place with the Las Vegas Raiders, but he's the kind of proven route-runner Adam Thielen once was for the Panthers. He may not stretch the field at this point in his career, but as a savvy rental to pair with rookie Tetairoa McMillan, you could do a lot worse.\n                            \n    \n                                                \n                    \n    Rashid Shaheed to the GiantsShaheed is probably still underrated as a deep threat, averaging almost 16 yards per catch for his career. The problem is, he's due to hit free agency after the season, New Orleans is rebuilding, and Chris Olave is a higher priority for the Saints. That makes him ripe for a potential relocation. And why not New York, where the Giants suddenly have offensive juice thanks to the rugged youth of Jaxson Dart and Cam Skattebo? With Malik Nabers out due to injury, the wily Dart could really use a field-stretcher out wide. Shaheed is just that and could theoretically stick around, too.\n\n                            \n    \n                                                \n                    \n    Mark Andrews to the CommandersWe don't believe John Harbaugh and the Baltimore Ravens are interested in completely punting on the rest of the 2025 season, even with the AFC contender deflated at 1-5. But Andrews is aging (30) and Isaiah Likely is already onboard as a longer-term option at tight end, so it's possible the Ravens could try to get something for the Pro Bowler while they can. Washington can't quite stay healthy out wide, and Andrews has enough left in the tank to form a grizzled but proven 1-2 punch with Zach Ertz. You can bet Jayden Daniels would enjoy feeding him.\n                            \n    \n                                                \n                    \n    Chig Okonkwo to the RamsTyler Higbee just had a nice day for Los Angeles, but the former Super Bowl champion has been spotty this year after missing most of 2024 due to injury. Puka Nacua is also freshly banged up out wide, giving Sean McVay's all-star unit a new dose of durability concerns. Enter Okonkwo, who's one of the Tennessee Titans' few legitimate trade chips thanks to a 71% catch rate for his career. At 26, he's got dual value: as an immediate depth piece to aid Matthew Stafford's passing attack, and as a potential long-term chess piece for McVay's offense. \n                            \n    \n                                                \n                    \n    Wyatt Teller to the EaglesThe Cleveland Browns don't exactly scream \"offensive line factory,\" but Teller has been a respected staple of their front for more than a half-decade, earning a trio of Pro Bowl nods along the way. He's likely available because he's on an expiring contract with a team in perpetual transition. The Eagles already pay big bucks to Landon Dickerson at guard, but he's banged up, and fellow interior man Tyler Steen could arguably use relief. Stabilizing, or at least deepening, the trenches could be a first step to unlocking the Saquon Barkley magic that drove the Birds in 2024.\n\n                            \n    \n                                                \n                    \n    Trey Hendrickson to the 49ersIf San Francisco isn't gutting out tough wins, it's taking catastrophic losses on the medical front. Sunday marked but the latest, with the 49ers defense losing its heartbeat in All-Pro linebacker Fred Warner (ankle injury). Hendrickson can't fill those shoes, of course, but he can get after quarterbacks, which is something the 49ers need to do more consistently in the wake of Nick Bosa's own exit due to injury. Yes, he finally settled contract talks with the Cincinnati Bengals prior to the season, but he's still a candidate to be moved as a pending free agent.\n                            \n    \n                                                \n                    \n    Bradley Chubb to the ColtsRaise your hand if you expected Indianapolis to be 5-1 atop the AFC South after six games. And yes, Daniel Jones is still running the show on offense! Why not strike while the iron is hot if you're Colts brass and go all in on a prospective postseason push, attempting a Von Miller-like rental with Chubb, who's been one of the few bright spots on the Miami Dolphins' defense this year? He's approaching 30 with an injury history, but he's got the sack artistry to further elevate a Colts team that keeps winning ballgames by controlling and running the ball with great efficiency.\n                            \n    \n                                                \n                    \n    Jaelan Phillips to the JaguarsIf the Dolphins deal Chubb, it stands to reason they'll keep Phillips, the other big name in their pass rushing arsenal. But it's just as likely they'd field offers for both edge veterans, considering Phillips is a pending free agent with a much streakier resume. The Jaguars aren't necessarily hurting for defensive talent after opening the year as a top-10 scoring \"D,\" but they rank near the bottom of the NFL in terms of total sacks in 2025. New general manager James Gladstone isn't averse to gambles, and Phillips would at least offer future upside, provided he stayed put.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 NFL trades that should happen before deadline: Alvin Kamara to Chiefs, new WR for Giants' Jaxson Dart - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/13/4cc01bfc-58f2-4982-8bc5-4a928992f19a/thumbnail/1200x675/002daf9c1f35fb924d2a77bb1f18f590/alvin-kamara.jpg"
      ],
      "datePublished": "2025-10-15T05:59:02.000Z",
      "dateModified": "2025-10-15T05:59:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Next year's NBA Top 100 players: Who can crack list for 2026-27 season? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-top-100-players-2026-27-season-lonzo-ball-quentin-grimes-deandre-ayton/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/73d23f44-1e61-4a24-bdda-c8ea8ff6d03b/thumbnail/1200x675/6748eda7395ad00a2df5b3df1bbba3b7/lonzo-ball-cavaliers-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-10-15T06:01:33.000Z",
    "description": "\n        Every year, CBS Sports ranks the top 100 players in the NBA, and every year, we inevitably miss some of the most important players of the sea",
    "body": "\n        Every year, CBS Sports ranks the top 100 players in the NBA, and every year, we inevitably miss some of the most important players of the season that follows. Take last year's list for the 2024-25 season. Most Improved Player Dyson Daniels? Unranked. Breakout Rockets star Amen Thompson? Unranked. Ivica Zubac made a late run at an All-NBA selection. He did not, however, make our list of the 100 best players in the sport.Inevitably, we end up with a bit of egg on our faces. We correct that a year later, of course, but the nature of the exercise practically necessitates mistakes. We can't see the future even if the list is meant to look towards it. Players often make the list based on expected future performance, but if we knew for certain which players were set to improve, well, teams would probably try to hire us because they don't know for sure either. A lot of the fun of the beginning of the season is seeing which players break out unexpectedly.\n        \n            \n                NBA coach rankings: All 30 coaches split into eight tiers as 2025-26 season begins\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nSo today, we're going to try to take a stab at figuring that out. The following 10 players did not make our top 100 ranking. But for one reason or another, they are players who could make us look foolish for excluding them, and then ultimately make next year's list as an apology. Of course, there are some pretty obvious candidates for a list like this, so to make it more interesting, we're going to exclude a few people. For starters, no 2025 rookies are eligible here. We haven't even seen them play. We're also barring No. 1 picks in the first five years of their careers (sorry Zaccharie Risacher) and Rookie of the Year winners (so long Stephon Castle). There's no fun in predicting when players like that will make a leap.No, we're looking for slightly deeper cuts here. This list includes just one top-five pick on a rookie contract, and he has played less than 1,000 NBA minutes. Meanwhile, we have two undrafted free agents, two veterans on their fourth NBA teams and another on his third, and a late first-round pick with less than 400 minutes to his name. So here are 10 players, some of whom have obvious paths, others who'd be coming out of nowhere, who could crack next year's top 100 list.\n\n                            \n    \n                                                \n                    \n    Quentin GrimesGrimes very easily could have made this year's list. He averaged almost 22 points per game as a 76er ... but he did it as a 76er, which meant he did it for the most aggressive tankers of last season. Were those empty calories? Or signs of true growth? We'll find out this season as Grimes attempts to fit into a healthier and hopefully more competitive Philadelphia team than the one he played for last season. Considering his experience as a 3-and-D wing in New York, though, he should be perfectly capable of sliding into the background for the Sixers. Combine the role player skills from his Knicks years and the high-level scoring from March and April, and you have a no-brainer top 100 player.\n                            \n    \n                                                \n                    \n    Reed SheppardAre we cheating a little bit by excluding the No. 1 pick in 2024 but accepting the No. 3 pick? Maybe, but Zaccharie Risacher played real minutes last season. Sheppard didn't. Now, with Fred VanVleet out, he'll have to. He's fortunately in an ideal situation for his skill set. The Rockets can cover for his size issue on defense and likely won't ask him to handle the ball too much. But they badly need his shooting, and he should be able to get good looks in an offense led by Kevin Durant and Alperen Sengun. Elite shooting can get a player onto the top 100. Payton Pritchard is the obvious analogue. We don't know if Sheppard is ready for that yet, but the Rockets wouldn't have taken him No. 3 if they didn't think he could get there.\n                            \n    \n                                                \n                    \n    Shaedon SharpeEverything is lining up for Sharpe this season. He's been a training camp standout by all accounts. He has Jrue Holiday and Damian Lillard in the building as mentors. Portland has seemingly solved its defense. What it needs is a primary scorer on offense, and with Scoot Henderson out early in the season, Sharpe won't even have competition from another high lottery pick. This is his moment to prove that he can be a cornerstone player. He has the athletic gifts. If he can make 3s consistently and improve his decision-making, he's an obvious top 100 candidate for next season and a possible Most Improved Player this year.\n\n                            \n    \n                                                \n                    \n    Deandre AytonAt his peak in 2021, Deandre Ayton ranked 51st on our top 100 list. We weren't abnormally high on him either. The Pacers gave him a max offer sheet, and then the Suns matched it. He has the tools to be a high-level starting center. Lately, he hasn't had the motivation. But how many times have we seen a down-on-his-luck veteran join a LeBron James team and suddenly rediscover his old magic? Is Ayton really that different from 2020 Dwight Howard? He's in an ideal position now. Between James, Austin Reaves and Luka Dončić, he's never had more playmaking around him. If that doesn't motivate him to play harder and do the dirty work, nothing will. But if we get the 2021 version of him in a contract year? It's not hard to imagine him making it back onto the list next year.\n                            \n    \n                                                \n                    \n    Matas BuzelisMatas Buzelis flashed just about every important skill at some point last season. His handle needs work, but it was impressive for a rookie of his size. He was a league-average shooter last year on reasonable volume, which few saw coming, and he was a surprisingly capable defensive playmaker already. But you're not here for that stuff. You're here for the 6-10 dude with insane hops throwing down monster jams. The other stuff is what he needs to be a well-rounded NBA player. The hope is that he continues to grow as a ball-handler, that his shooting growth continues. If that happens, he has star potential. But that stuff takes time. What we'll absolutely see this season is this athletic giant running the floor and owning highlight reels on one of the league's fastest teams. He's already a nerd favorite. He'll be a social media darling before long as well.\n                            \n    \n                                                \n                    \n    Keon EllisOur top 100, especially the bottom half, is stuffed full of 3-and-D role players. Nickeil Alexander-Walker has never been a full-time starter and he snuck into the final slot. Ellis hasn't had the widespread exposure that Alexander-Walker did on a contending Timberwolves team because he's been stuck on the Kings, but he's an absolutely ferocious point-of-attack defender who's made just under 43% of his 3s in his three NBA seasons. If he played for a normal team, he'd have made the list by now. If he keeps this up, not even the Kings will be able to hold him off from future editions.\n\n                            \n    \n                                                \n                    \n    Lonzo BallLast year gave fans a newfound appreciation for a very specific sort of role player: those who can't play significant minutes for stylistic and durability-related reasons but absolutely own the minutes they do play. Think of Steven Adams in Houston last year, or Ty Jerome in Cleveland. T.J. McConnell almost won Indiana a championship in 18-minute increments. You could make credible arguments for any of them making the list under the logic that they are absolutely among the best 100 players in the NBA on a per-minute basis. The one I'll call attention to this season is Lonzo Ball, who is a match made in heaven for a Cleveland team that badly needed more transition creativity and on-ball defense. If Ball can give the Cavaliers 20 good minutes per night, the specific things he'll bring are so valuable that there will be a strong argument to get him back into the top 100 mix.\n                            \n    \n                                                \n                    \n    Bennedict MathurinA lot of the ingredients we've touched on for other players apply here. Newfound opportunity? Check. Without Tyrese Haliburton, someone needs to handle the ball more in Indiana. Contract year? Check. A good year could make Mathurin a lot of money. Draft pedigree? Check. Mathurin was a No. 6 pick, and even if he runs hot and cold, the playoffs showed just how valuable he can be when he's hot. If you can score in the mid-20s against Oklahoma City's historic defense multiple times in the Finals, there's a very valuable player hidden in there somewhere. Now, with the Pacers going through a gap year, we'll see if Mathurin can discover that form on a more permanent basis.\n                            \n    \n                                                \n                    \n    Terrence Shannon Jr.I promised you deep cuts, didn't I? Shannon barely played last year... but Minnesota trusted him enough to give him real minutes in the Western Conference finals. Alexander-Walker is gone and someone has to take on his bench role, but with Mike Conley aging fast, there's also going to be a juicy playmaking opportunity available for Minnesota's young players if they can seize it. Rob Dillingham, as the higher draft pick, would be the obvious suspect. He's younger and has more theoretical upside. But Shannon is immediately playable on offense and was surprisingly stout defensively for a low-minutes rookie. If you can score consistently without taking other significant skills off the table, you can be a very valuable player pretty quickly. That's the argument here. Shannon will have a bigger role this season to showcase the rest of his game, and there were signs last year that were pretty promising.\n\n                            \n    \n                                                \n                    \n    Jay HuffThe longest of our long shots, and I do mean that literally, as Huff has a 7-5 wingspan. There is a gaping vacuum at center in Indiana, and their system relies on having a big man who can shoot. Huff was over 40% last season on 12.4 attempts per 100 possessions. He's a strong shot-blocker as well, and he's quite the showman as a dunker. Is he a likely top-100 player? Absolutely not. Come on, he's barely been a rotation player. But you just know someone is emerging out of nowhere in Indiana this season. Rick Carlisle has an 82-game blank slate to work with, and Huff offers the cheapest possible replication of Myles Turner's skill set. The Pacers will give him every chance to succeed. He's under contract for essentially the minimum through 2028, so if he is a diamond in the rough, the Pacers will have him for the price of a ring pop for the foreseeable future.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Next year's NBA Top 100 players: Who can crack list for 2026-27 season? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/73d23f44-1e61-4a24-bdda-c8ea8ff6d03b/thumbnail/1200x675/6748eda7395ad00a2df5b3df1bbba3b7/lonzo-ball-cavaliers-usatsi.jpg"
      ],
      "datePublished": "2025-10-15T06:01:33.000Z",
      "dateModified": "2025-10-15T06:01:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's lingering questions: Forward battle now a good problem, Tyler Adams' backup, seeking 90 good minutes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/usmnts-lingering-questions-forward-battle-now-a-good-problem-tyler-adams-backup-seeking-90-good-minutes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/d0b14b2e-499f-4ab8-a1eb-88c27e1cb46d/thumbnail/1200x675/dd4149ef89c21921dc55a1201205976e/untitled-design-2025-10-15t120033-482.png",
    "tag": "Sports",
    "date": "2025-10-15T10:03:00.000Z",
    "description": "\n        The October international break was a job well done for the U.S. men's national team, who offered several signals that they are trending in t",
    "body": "\n        The October international break was a job well done for the U.S. men's national team, who offered several signals that they are trending in the right direction with the World Cup just eight months away. While this month's games, a 1-1 draw against Ecuador and a 2-1 win over Australia, provided some answers on what head coach Maruicio Pochettino's tactical vision is and which players might be up for the task, there are naturally still some lingering questions as the countdown to the World Cup continues.Pochettino's version of the USMNT seem to be at their most comfortable building out of the back with three center backs, while an eclectic group of apparent World Cup starters rises to the top. Mainstays like Christian Pulisic -- who came off in the first half against Australia with an apparent hamstring injury -- Chris Richards and Tim Weah make up a group of regular starters that includes rising talent Malik Tillman, while Matt Freese and Tim Ream seem like the frontrunners in their respective positions. That still leaves a handful of berths up for grabs, though, and Pochettino admitted on Tuesday that the competition for roster spots is still \"open for every single USA player.\"Given the circumstances, it comes as little surprise that the USMNT still do not look like the finished product and some unevenness against Ecuador and Australia demonstrated some clear areas for improvement regardless of the personnel on the pitch. It all sets up for a fascinating run as next summer's World Cup rapidly approaches, each of the U.S.' upcoming friendlies potentially revealing more and more about how Pochettino's team actually looks – and how far they can go.As the countdown to November's friendlies against Paraguay and Uruguay begins, here's a look at the lingering questions that still face the USMNT.\n\n        \n            \n                Haji Wright, Cristian Roldan ace USMNT auditions, offer optimism for USA soccer eight months before World Cup\n                \n                    Pardeep Cattry                \n            \n                            \n    \n                \n                    \n    \n1. Who starts in attack?It feels like the question of which of the USMNT's forwards would start transformed almost overnight from a hopeless plea into the ether to a near embarrassment of riches. For the first time in a long time, the U.S. may have two players gunning for a starting role, with both Folarin Balogun and Haji Wright each providing a compelling case for himself after combining for all three of the team's goals this month.Balogun has essentially been the starter-in-waiting, marred by an injury-plagued year but wasting no time with two goals and an assist in his last four games for the national team, bailing the team out against Ecuador on an encouraging but somewhat wasteful attacking outing from the group. Wright showcased his own creativity with a brace against Australia, meanwhile, his second goal in particular offering a glimpse at his individual talents as he created a chance for himself before scoring. If the two of them keep up this form, they are likely to make the World Cup roster but the division of playing time could be the most pressing question facing Pochettino in the final stages of his World Cup prep.Wright's success only makes Josh Sargent's recent ventures with the national team more melancholic -- both are in remarkable form for their clubs and while Wright translated that into an impressive outing against Australia, Sargent's USMNT career is perhaps now defined by the fact that he is nearly six years removed from his last international goal. Sargent's ship may have sailed at this point but the one big unknown in terms of personnel is Ricardo Pepi, who scored in Pochettino's opening match with the U.S. a year ago but has also spent much of the time since injured. If Pepi returns to his pre-injury form timely, though, Pochettino will have one of those proverbial good problems on his hands.\nCan anyone replace Tyler Adams?Tyler Adams missed the October friendlies for the birth of his second child, offering a genuine opportunity for someone to step up and at least make their case to be his indisputable understudy. It will come as little surprise that Adams is still the best player in the pool in his defensive midfield role but after the games against Ecuador and Australia, it is hard to argue that a standout candidate has emerged from the group.Tanner Tessman and James Sands each got a shot at the job, Tessman filling in against Ecuador next to Aidan Morris and Sands doing so against Australia alongside Cristian Roldan. Tessman had a better outing in this isolated comparison, Pochettino saying on Friday that \"the quality is there and the capacity to understand the game, the tactical way that we want to apply and set up [in] the game, the principles.\" Sands, meanwhile, was one of the players notably caught ball-watching on Tuesday as the Socceroos scored first.Like in the forward roles, there is the idea that the oft-injured Johnny Cardoso could have a say in this competition and there's no real shame in admitting that Adams has staked full claim on his starting job. Building a World Cup roster is about preparing for less than ideal situations, though, and the fact that no go-to backup has emerged at the No. 6 position remains one of the USMNT's longest lasting unanswered questions, one that very much pre-dates Pochettino.\nWhen will the USMNT string together a complete performance?Slowly but surely, the USMNT are stitching together an encouraging and cohesive identity, but at this stage of their preparation, it feels more like patchwork than the finished product. Even if the positives may have outweighed the negatives in October, there is still some very obvious room for improvement – the fact that they have yet to string together a complete, 90 minute performance.Pochettino pointed to that as the obvious next step for his group, some sloppy moments costing them against Ecuador and Australia. The Socceroos in particular seemed to stump the USMNT in the opening half hour of the game, with Pochettino saying the group was just a little bit slow to make their moves at the start of Tuesday's win.\"One of the [ones] that we need to improve is to, [for] 90 minutes, try to be aggressive and to [be] more solid,\" Pochettino said. \"I think we start the game thinking too much, no? When you are on the pitch and you think too much, you start not to play in a natural way and always, it's late, you move the ball so slow. When you want to press, you arrive late and then when we concede, it's like a big relief. It's not anymore, the pressure. We need to start to play and I think the team start to play [with] more freedom and then we scored a fantastic goal and we equalize and then in the second half, we concede from a few actions in the beginning but in the end, the game was always under our control, but, I think, it's to improve and to try to dominate in a better way the game and that is the thing that we need to improve.\"\nCohesion feels like a natural sacrifice when experimentation is the priority but the USMNT have paid for virtually every mistake they have made in recent months, which is perhaps unlucky, but also a problem that seems solvable to a certain degree. How quickly they figure things out, though, just might be the greatest indicator of their World Cup success.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's lingering questions: Forward battle now a good problem, Tyler Adams' backup, seeking 90 good minutes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/d0b14b2e-499f-4ab8-a1eb-88c27e1cb46d/thumbnail/1200x675/dd4149ef89c21921dc55a1201205976e/untitled-design-2025-10-15t120033-482.png"
      ],
      "datePublished": "2025-10-15T10:03:00.000Z",
      "dateModified": "2025-10-15T10:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, lineups, daily fantasy strategy for Steelers vs. Bengals on Thursday Night Football - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-thursday-night-football-steelers-bengals-daily-fantasy-lineup-advice-strategy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/21d951d6-c381-44f9-84c6-7924ac6f0c5b/thumbnail/1200x675/620626146fe2b48c5c7b2415652c8b5b/aaron-rodgers-pittsburgh-steelers-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-10-15T12:17:27.000Z",
    "description": "\n        The Week 7 NFL schedule opens with an AFC North rivalry game with the Cincinnati Bengals hosting the Pittsburgh Steelers on 'Thursday Night F",
    "body": "\n        The Week 7 NFL schedule opens with an AFC North rivalry game with the Cincinnati Bengals hosting the Pittsburgh Steelers on 'Thursday Night Football.' Kickoff is scheduled for 8:15 p.m. ET at Paycor Stadium. The over/under is 43.5 points. The game features a strong NFL DFS player pool, with big names like Aaron Rodgers, DK Metcalf, Jaylen Warren, Ja'Marr Chase, Tee Higgins, and Chase Brown taking center stage. Finding undervalued players at a cheap price is still the key to building a winning NFL DFS strategy in Showdown contests -- especially with this matchup featuring so many big-name players, who will likely be popular NFL DFS picks. Should you target potential DFS values like Jonnu Smith, Noah Fant, Calvin Austin III or Joe Flacco to pair with the bigger-name players for Thursday Night Football DFS lineups and NFL DFS stacks? Before making any NFL DFS picks for Bengals vs. Steelers on Thursday Night Football on sites like DraftKings and FanDuel, be sure to check out the NFL DFS lineup advice, strategy and player stacks from SportsLine NFL daily Fantasy expert Jimmie Kaylor. New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:Kaylor is a NFL betting and DFS expert for SportsLine, who opened the 2022 NFL season by winning DraftKings' NFL Showdown Thursday Kickoff Millionaire contest. He edged out over 355,000 other entrants in the contest and also has multiple five-figure tournament wins on his DFS resume. Kaylor has covered the NFL and college football for close to a decade as a member of the Pro Football Writers of America, and his background as a former college and NFL player gives him a unique perspective when building his fantasy lineups and locking in his betting picks. \nNow, Kaylor has turned his attention to the Thursday Night Football matchup of Steelers vs. Bengals and just locked in his top daily Fantasy football picks. You can only see his Thursday Night Football DFS picks and analysis at SportsLine.New users can get $50 in Pick6 credits at DraftKings when they play $5: Top NFL DFS picks, lineups, stacks for Bengals vs. SteelersOne of Kaylor's top DFS picks for Thursday Night Football is Steelers quarterback Aaron Rodgers. The four-time NFL MVP has been efficient in his first season with the Steelers. Through six weeks, Rodgers has guided the Steelers to a 4-1 overall record, while throwing for 1,021 yards, 10 touchdowns, and three interceptions, which is good for a 105.4 passer rating.Rodgers is one of the most accomplished quarterbacks in NFL history, with over 63,973 career passing yards, more than 513 touchdown passes, and one of the highest career passer ratings of all-time. The former Cal standout is a 10-time Pro Bowler and owns a career touchdown:interception ratio of 4.4:1, which is a NFL record. See who else to roster right here.\nPart of Kaylor's optimal NFL DFS strategy also includes rostering Bengals wide receiver Ja'Marr Chase. The four-time Pro Bowl selection continued to solidify his status as an elite receiver in 2024, hauling in 127 receptions for 1,708 yards and 17 touchdowns while capturing the NFL's receiving \"Triple Crown.\" That season also earned him First-Team All-Pro honors and another Pro Bowl selection. Through the early portion of the 2025 season, he's recorded 42 receptions for 468 yards and four touchdowns in six games, averaging about 11.1 yards per catch. In his first game with quarterback Joe Flacco, Chase caught 10 passes for 94 yards and a touchdown against the Packers in Week 6. Over the course of his young career, Chase has already been selected to the Pro Bowl every season since entering the league and was named NFL Offensive Rookie of the Year in 2021. You can see the rest of Kaylor's NFL DFS picks here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:\nHow to build NFL DFS lineups and stacks for Steelers vs. BengalsKaylor is also targeting another undervalued player who could explode for huge numbers on Thursday Night Football. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and get the rest of Kaylor's NFL DFS picks, at SportsLine. So who is Jimmie Kaylor including in his optimal NFL DFS lineups for Bengals vs. Steelers on Thursday Night Football, and which under-the-radar NFL DFS picks offer huge value? Visit SportsLine now to see optimal NFL DFS picks, rankings, advice, and stacks, all from SportsLine's proven DFS expert who won a single-game millionaire maker tournament, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, lineups, daily fantasy strategy for Steelers vs. Bengals on Thursday Night Football - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/21d951d6-c381-44f9-84c6-7924ac6f0c5b/thumbnail/1200x675/620626146fe2b48c5c7b2415652c8b5b/aaron-rodgers-pittsburgh-steelers-imagn-images-2.jpg"
      ],
      "datePublished": "2025-10-15T12:17:27.000Z",
      "dateModified": "2025-10-15T12:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 7 NFL QB Power Rankings: Has Baker Mayfield taken the top spot? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-7-nfl-qb-power-rankings-buccaneers-baker-mayfield-chiefs-patrick-mahomes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/10/23/8ba0fc39-4551-401e-81e6-f3191071a426/thumbnail/1200x675/73cf42bf759dc7807ea93234e8eee43f/qb-power-rankings-week-8-mayfield.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:24:41.000Z",
    "description": "1\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    ",
    "body": "1\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Josh Allen\n                    \n            \n            \n            Buffalo Bills QB\n        \n            \n        \nHe didn't have a game to write home about in a surprise loss to the Falcons, the Bills' second straight prime-time slip-up. He's still the most dangerous playmaker at the position, especially when Lamar Jackson isn't suiting up.2\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Baker Mayfield\n                    \n            \n            \n            Tampa Bay Buccaneers QB\n        \n            \n        \nIt's probably time to throw his name into the MVP ring. Even with countless injuries depleting his supporting cast, Mayfield is playing with a warrior's mentality, both as a timely scrambler and rip-roaring passer. He      is      the Buccaneers right now.      (+4)3\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jared Goff\n                    \n            \n            \n            Detroit Lions QB\n        \n            \n        \nDetroit's typically high-octane attack was undone by a pair of failed fourth-down tries against the Chiefs. But Goff has remained a clean distributor when afforded a clean pocket, leading the NFL in completion rate (75.9%).      (-1)4\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jordan Love\n                    \n            \n            \n            Green Bay Packers QB\n        \n            \n        \nThe perception is that the Packers don't ask Love to throw it a ton, instead leaning on the bruising Josh Jacobs ground game. That's not entirely true. Love is just incredibly efficient, using that beautiful arm talent to own the deep ball.    (-1)5\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Patrick Mahomes\n                    \n            \n            \n            Kansas City Chiefs QB\n        \n            \n        \nThe Chiefs finally looked like themselves in Sunday's rout of the Lions. And Mahomes was arguably the biggest reason why, setting the tone with tough scrambles, then spreading the ball all over the field to maximize K.C.'s gadget weapons.6\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Dak Prescott\n                    \n            \n            \n            Dallas Cowboys QB\n        \n            \n        \nIf it weren't for Dallas' persistent defensive woes, Prescott might be drawing real awards buzz. He's been without CeeDee Lamb and a fully healthy front, but his chemistry with George Pickens has helped the 'Boys light up scoreboards.      (+2)7\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Matthew Stafford\n                    \n            \n            \n            Los Angeles Rams QB\n        \n            \n        \nAge has yet to fully threaten his arm in 2025, but now we get a real test for the 37-year-old gunslinger: Top target Puka Nacua, a machine over the middle, is banged up. Let's see if Stafford gets even streakier without his favorite outlet.     (-2)8\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jayden Daniels\n                    \n            \n            \n            Washington Commanders QB\n        \n            \n        \nOn one hand, the Commanders may not have fallen to 3-3 if only Daniels could've kept control of the ball late against the Bears. On the other, Washington's offense still depends so much on No. 5's effortless gifts as a dual threat.  (+1)9\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Sam Darnold\n                    \n            \n            \n            Seattle Seahawks QB\n        \n            \n        \nDoes anyone think the Seahawks regret swapping Geno Smith out for Darnold now? The latter has brought an even sharper zeal to Seattle's aerial attack, helping elevate Jaxon Smith-Njigba to superstar material. His 116.0 rating ranks third.  (+1)10\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Drake Maye\n                    \n            \n            \n            New England Patriots QB\n        \n            \n        \nNew England is suddenly a fully fledged challenger, and it's largely because Maye's poise increasingly matches his athleticism. He's averaging 8.5 yards per throw, driving the ball and elevating all of the Patriots' pass catchers.  (+1)11\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jalen Hurts\n                    \n            \n            \n            Philadelphia Eagles QB\n        \n            \n        \nTwo things can be true here: No. 1, Hurts is a proven winner with a knack for clutch, if rugged, results. No. 2, he's stuck in mud operating with yet another new play-caller. The weapons are there. How about the protection and passing vision?  (-4)12\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Justin Herbert\n                    \n            \n            \n            Los Angeles Chargers QB\n        \n            \n        \nAfter two straight games with a critical turnover, Herbert settled down to complete more than 76% of his throws against Miami. Granted, it was the Dolphins. Overall, he's still shown improved confidence firing it on the move this year.13\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Aaron Rodgers\n                    \n            \n            \n            Pittsburgh Steelers QB\n        \n            \n        \nA-Rod couldn't stop making headlines with the Jets. Now he's 4-1 with the Steelers, controlling the ball and developing a nice connection with DK Metcalf, and everyone's quiet? Maybe it's a good thing. Even at 41, he looks quite comfortable.14\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Daniel Jones\n                    \n            \n            \n            Indianapolis Colts QB\n        \n            \n        \nThe adventures of \"Indiana\" Jones continue. Jonathan Taylor deserves a mention every week here, considering how much his legs are aiding Jones' rejuvenation. But the ex-Giants passer is also showcasing crisp accuracy on key downs.15\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                C.J. Stroud\n                    \n            \n            \n            Houston Texans QB\n        \n            \n        \nRested up after the Texans' Week 6 bye, Stroud had a perfect confidence-building win going into the off time, tossing one score after another on the injury-marred Ravens. Let's see if he can build on the improved touch and timing.  (+1)16\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Trevor Lawrence\n                    \n            \n            \n            Jacksonville Jaguars QB\n        \n            \n        \nThe Jaguars couldn't make it a two-game win streak on Sunday, but it wasn't really Lawrence's fault as the former No. 1 pick got engulfed by Seattle's pass rush. A remaining challenge for Liam Coen's squad is cleaning up the fundamentals. (+1)17\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Caleb Williams\n                    \n            \n            \n            Chicago Bears QB\n        \n            \n        \nHis numbers still aren't gaudy under the direction of new coach Ben Johnson, but guess what? He played winning football in prime time to upset the Commanders, and that's not nothing. He's quietly making strides as an energetic manager.  (+1)18\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Bo Nix\n                    \n            \n            \n            Denver Broncos QB\n        \n            \n        \nNothing tends to look overly smooth with Nix at the controls; his passer rating and completion marks both rank in the bottom half for starters. His grit never wavers, though, making him a perfectly scrappy figurehead for a defensively led team.  (-3)19\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Michael Penix Jr.\n                    \n            \n            \n            Atlanta Falcons QB\n        \n            \n        \nBijan Robinson was the unquestioned catalyst of the Falcons' Week 6 upset of Buffalo, but Penix did enough early on to set the tone in Atlanta's favor. He remains streaky through the air, but the passing zip is eye-popping when he's on time.20\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Carson Wentz\n                    \n            \n            \n            Minnesota Vikings QB\n        \n            \n        \nKevin O'Connell won't say whether J.J. McCarthy will reclaim the top job for Minnesota after the bye, but that means Wentz figures to get at least one more crack as the seasoned fill-in. He's been tough, if occasionally too gutsy, as their man. (+1)21\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jaxson Dart\n                    \n            \n            \n            New York Giants QB\n        \n            \n        \nDon't look now, but the New York Giants might be fun again. Dart has to take a little better care of his body when plowing through contact on the move. But his zesty composure, paired with Cam Skattebo's energy, at least offers hope. (+3)22\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Mac Jones\n                    \n            \n            \n            San Francisco 49ers QB\n        \n            \n        \nBrock Purdy has a chance to make his second return from a toe injury this week. But will the 49ers push it? Jones is also gutting through pain, and he was uneven, albeit still scrappy, working with a banged-up supporting cast in Week 6.23\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Bryce Young\n                    \n            \n            \n            Carolina Panthers QB\n        \n            \n        \nIs any starter as confounding as Young? For long stretches he looks entirely out of his league. Then the second half arrives, and his college-era poise tends to resurface. If only he can translate that fourth-quarter looseness to the early goings. (+6)24\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Jacoby Brissett\n                    \n            \n            \n            Arizona Cardinals QB\n        \n            \n        \nKyler Murray may or may not be back after sitting out Week 6 with a foot injury. But Arizona might quietly be OK letting Brissett get a second straight nod. He's best suited coming off the bench, but he's got more of a refined passing acumen.25\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Tua Tagovailoa\n                    \n            \n            \n            Miami Dolphins QB\n        \n            \n        \nEach week is a new dose of drama for Tagovailoa and the Dolphins, who can't get out of their own way. For every tight-window bullet Tua fires, the disheveled veteran seems to toss twice as many wayward balls when it matters most. (-5)26\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Spencer Rattler\n                    \n            \n            \n            New Orleans Saints QB\n        \n            \n        \nNo one's counting on the Saints making any kind of real push in the NFC South, but that's not really because Rattler's a walking disaster as the trial-run starter. In fact, the second-year pro has kept good control of the ball all autumn. (+5)27\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Justin Fields\n                    \n            \n            \n            New York Jets QB\n        \n            \n        \nAaron Glenn insists he's not yet ready to bench Fields, but the fact the questions are intensifying signals New York really has an issue here. He may have sweet mobility and a likable approach, but No. 1 works almost exclusively out of structure. (-2)28\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Geno Smith\n                    \n            \n            \n            Las Vegas Raiders QB\n        \n            \n        \nSmith will always be remembered for his feisty run as a surprise Seahawks leader, but he's on the fast track to a rapid-fire flameout in Las Vegas. Even in a badly needed win over the lowly Titans in Week 6, he couldn't avoid a turnover. (-1)29\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Joe Flacco\n                    \n            \n            \n            Cincinnati Bengals QB\n        \n            \n        \nThrust into the starting lineup days after arriving via trade from the rival Browns, the aging Flacco at least reopened the downfield game for top wideouts Ja'Marr Chase and Tee Higgins. But can he actually halt Cincinnati's larger slide? (+1)30\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Dillon Gabriel\n                    \n            \n            \n            Cleveland Browns QB\n        \n            \n        \nAdmirably at ease in his first NFL action, Gabriel was much more bothered in Round 2, a drubbing at the hands of the rival Steelers. It's back to square one in Cleveland, where already there are also calls to see Shedeur Sanders get a shot. (-4)31\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Cam Ward\n                    \n            \n            \n            Tennessee Titans QB\n        \n            \n        \nWard has earned points for his raw transparency about the dire state of the Titans, who just axed coach Brian Callahan. What he's yet to do with any degree of consistency is translate his gifted arm into steadily sensible decision-making. (-3)32\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Cooper Rush\n                    \n            \n            \n            Baltimore Ravens QB\n        \n            \n        \nThe Ravens benched Rush for Tyler Huntley late in their latest loss. Both veteran reserves figure to take a back seat in short order, with Lamar Jackson on track to return from injury after their bye. Baltimore needs Lamar to play hero, like, yesterday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 7 NFL QB Power Rankings: Has Baker Mayfield taken the top spot? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/10/23/8ba0fc39-4551-401e-81e6-f3191071a426/thumbnail/1200x675/73cf42bf759dc7807ea93234e8eee43f/qb-power-rankings-week-8-mayfield.jpg"
      ],
      "datePublished": "2025-10-15T11:24:41.000Z",
      "dateModified": "2025-10-15T11:24:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Jays vs. Mariners MLB ALCS Game 3 predictions, line, odds, best bets by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/blue-jays-mariners-prediction-odds-time-2025-mlb-playoff-betting-picks-alcs-game-3/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/06/35f792ff-ed11-4681-8416-413a74a99294/thumbnail/1200x675/e6a527512c892e7d9fdc7fcfecfd3e0f/usatsi-julio-rodriguez-alds.jpg",
    "tag": "Sports",
    "date": "2025-10-15T11:52:27.000Z",
    "description": "\n        The Seattle Mariners will look to put the Toronto Blue Jays on the brink of elimination when they meet in Game 3 of their best-of-seven 2025 ",
    "body": "\n        The Seattle Mariners will look to put the Toronto Blue Jays on the brink of elimination when they meet in Game 3 of their best-of-seven 2025 American League Championship Series on Wednesday. Seattle seized a 2-0 series lead in the ALCS with a 10-3 win in Toronto on Monday. The Blue Jays (94-68), who are looking to reach their first World Series since winning it all in back-to-back seasons in 1992 and 1993, are 41-42 on the road this season, including playoffs. The Mariners (90-72), who are seeking their first-ever World Series appearance, are 53-31 on their home field in 2025. First pitch from T-Mobile Park in Seattle is set for 8:08 p.m. ET. The Mariners have won four of the past seven meetings with the Blue Jays. Seattle is a -135 favorite on the money line (risk $135 to win $100) in the latest Mariners vs. Blue Jays odds from DraftKings Sportsbook, while the total number of runs Vegas thinks will be scored, or the over/under, is 7. Before making any Blue Jays vs. Mariners picks, be sure to be sure to see the MLB predictions and betting advice from SportsLine's proven computer model. New users can also target the DraftKings promo code, which offers $200 in bonus bets with a winning $5 wager:The SportsLine Projection Model simulates every MLB game 10,000 times. It enters the ALCS and NLCS rounds of the 2025 MLB playoffs a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Blue Jays vs. Mariners and just locked in its picks and MLB predictions. You can head to SportsLine now to see the model's picks. Here are several MLB odds and betting lines for Blue Jays vs. Mariners:Blue Jays vs. Mariners                             money lineToronto +113, Seattle -135Blue Jays vs. Mariners                             over/under7 runsBlue Jays vs. Mariners                             run line Seattle -1.5 (+164)Blue Jays vs. Mariners                             picksSee picks at SportsLineBlue Jays vs. Mariners                             streaming Fubo (Try for free)Why the Mariners can winSeattle is expected to send right-hander George Kirby (10-8, 4.21 ERA) to the mound. This postseason, he is 0-0 in two starts with a 2.70 ERA. In 10 innings pitched, he has allowed nine hits, three earned runs and one walk with 14 strikeouts. He pitched five innings in Friday's 3-2 15-inning win over the Detroit Tigers in Game 5 of the ALDS. He allowed three hits, one earned run and no walks with six strikeouts. In 23 regular-season starts, he logged 126 innings, allowing 121 hits and 59 earned runs with 29 walks and 137 strikeouts.Catcher Cal Raleigh has powered the Mariners' offense. In seven postseason games, he is hitting .357 with one double, two homers and five RBI. In Game 1 of the ALCS at Toronto, a 3-1 victory, he was 2-for-4 with a homer. He walked twice and scored two runs in the Game 2 win. In 159 regular-season games, Raleigh hit .247 with 24 doubles, 60 homers, 125 RBI and 110 runs scored. See which team to back at SportsLine.\nWhy the Blue Jays can winRight-handed pitcher Shane Bieber (4-2, 3.57 ERA) will get the start for Toronto. In seven regular-season starts, he pitched 40.1 innings, allowing 34 hits, 16 earned runs and seven walks, while striking out 37. He has one postseason appearance this year, pitching 2.2 innings in a 9-6 loss to the New York Yankees on Oct. 7 in the Wild Card round. In that game, he allowed five hits, three runs – two earned – with one walk and two strikeouts.First baseman Vladimir Guerrero Jr. is among Toronto's top hitters. In six postseason games, he is hitting .375 with three homers and nine RBI. He has three multi-hit performances, including a 3-for-4 performance with a homer and two RBI in a 10-1 win over the Yankees in Game 1 of the Wild Card round. In Game 2 of that series, he was 3-for-5 with a homer and four RBI in a 13-7 win. See which team to back at SportsLine. How to make Blue Jays vs. Mariners picksSportsLine's model is leaning Over on the total, projecting 8.2 combined runs. It says one side of the money line has all the value. You can head to SportsLine to see the model's MLB picks. So who wins Mariners vs. Blue Jays, and which side of the money line has all the value? Visit SportsLine now to see which side you need to jump on, all from the model that has crushed its MLB picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Jays vs. Mariners MLB ALCS Game 3 predictions, line, odds, best bets by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/06/35f792ff-ed11-4681-8416-413a74a99294/thumbnail/1200x675/e6a527512c892e7d9fdc7fcfecfd3e0f/usatsi-julio-rodriguez-alds.jpg"
      ],
      "datePublished": "2025-10-15T11:52:27.000Z",
      "dateModified": "2025-10-15T11:52:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]