[
  {
    "title": "Computer model locks in Vikings vs. Seahawks picks, score prediction, SGP for NFL Week 13 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-vikings-where-to-watch-nfl-week-13-score-prediction-betting-odds-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-30T19:46:19.000Z",
    "description": "\n        It's safe to say the Minnesota Vikings may regret letting quarterback Sam Darnold leave, and they'll get a reminder of what they're missing o",
    "body": "\n        It's safe to say the Minnesota Vikings may regret letting quarterback Sam Darnold leave, and they'll get a reminder of what they're missing out on when they visit Darnold and the Seattle Seahawks in Week 13 of the NFL season. Minnesota (4-7) has struggled badly with J.J. McCarthy under center, and the Vikings will now start rookie Max Brosmer against Seattle. The Seahawks (8-3), meanwhile, look like potential Super Bowl contenders with Darnold. Kickoff from Lumen Field is set for 4:05  p.m. ET. The Seahawks are 12-point favorites, according to the latest Vikings vs. Seahawks odds. The over/under for total points scored is 41.5, down two from the opening line. The Seahawks are -870 money line favorites (risk $870 to win $100), while the Vikings are +579 underdogs. Before making any Vikings vs. Seahawks picks, make sure you check out the NFL picks from the SportsLine Projection Model.Click here to bet Vikings vs. Seahawks at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Vikings vs. SeahawksBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Vikings vs. Seahawks on SundayWhen: Sunday, Nov. 30Time: 4:05 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppVikings vs. Seahawks betting previewOdds: Seahawks -12, over/under 41.5Minnesota is both 4-7 outright and 4-7 ATS. The Vikings are 7-4 to the Over. Seattle's outright record (8-3) also matches its ATS record. The Seahawks are 7-4 to the Over as well. Minnesota's last three games have landed Under, while four of Seattle's last five games have gone Over.Click here to bet Vikings vs. Seahawks at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Vikings vs. Seahawks SGPVikings +12Rashid Shaheed anytime touchdown scorerJaxon Smith-Njigba Over 96.5 receiving yardsFinal odds: +1500 at DraftKings (wager $100 to win $1500)Model's Vikings vs. Seahawks score prediction, picksSeattle wins in 73% of the model's simulations. However, the Vikings offer more money line betting value at +536. The Vikings cover in 55% of the simulations, and the Over hits 58% of the time. Vikings vs. Seahawks score prediction: Seahawks 28, Vikings 18Want more Week 13 NFL picks?You've seen the model's best bets for Minnesota Vikings vs. Seattle Seahawks. Now, get against the spread, total and money-line picks for every Week 13 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Vikings vs. Seahawks picks, score prediction, SGP for NFL Week 13 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd1cdbd0-8670-45cf-bab1-d546f523451e/thumbnail/1200x675/0a4256a827ce308c75ca1a7dc0963eb5/sam-darnold-seahawks.jpg"
      ],
      "datePublished": "2025-11-30T19:46:19.000Z",
      "dateModified": "2025-11-30T19:46:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos vs. Commanders odds, prediction, best bets: 'Sunday Night Football' picks by expert on 15-9 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sunday-night-football-prediction-odds-broncos-commanders-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/d8cd26bf-23bd-4c0e-ac7b-02372d5502d8/thumbnail/1200x675/c8adb318a2c26b3fc295ee16aa7adb78/marcus-mariota-commanders-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-30T20:09:16.000Z",
    "description": "\n        The Denver Broncos will look to stretch their winning streak to nine games when they battle the Washington Commanders on Sunday Night Footbal",
    "body": "\n        The Denver Broncos will look to stretch their winning streak to nine games when they battle the Washington Commanders on Sunday Night Football. Denver is coming off a 22-19 win over the Kansas City Chiefs on Nov. 16, while Washington dropped a 16-13 decision at Miami that same day. The Broncos (9-2), who lead the AFC West by two games, are 3-2 on the road this season. The Commanders (3-8), who are third in the NFC East, are 2-3 on their home field. Washington quarterback Jayden Daniels (elbow) will miss another game, but Terry McLaurin will return for Washington. Patrick Surtain II will be back for Denver after missing three games.Kickoff from Northwest Stadium in Landover, Md., is set for 8:20 p.m. ET. The all-time series is tied 8-8, with the Commanders winning two of the past three meetings. Denver is a 6-point favorite in the latest Broncos vs. Commanders odds from SportsLine consensus, while the over/under for total points scored is 43.5. Denver is at -292 on the money line (risk $292 to win $100). Before you make any Broncos vs. Commanders picks, be sure to see what SportsLine expert Mike Tierney has to say. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:A veteran sportswriter whose work appears periodically in the New York Times and Los Angeles Times, Mike Tierney has covered the NFL for decades and reported from seven Super Bowls. He is 235-189-13 in his NFL picks the past three seasons, returning $2,505 to $100 players. He hit 61.2% of his ATS picks (61-39-3) last season. Tierney is also 15-9 on his last 24 picks in games involving the Washington Commanders, returning $497. Anyone following could've seen huge returns. Now, Tierney has set his sights on Broncos vs. Commanders and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Commanders vs. Broncos:Broncos vs. Commanders                     spreadDenver -6 at DraftKings SportsbookBroncos vs. Commanders                       over/under43.5 pointsBroncos vs. Commanders                       money line Denver -292, Washington +236Broncos vs. Commanders                       picksSee picks at SportsLineBroncos vs. Commanders                       streaming Fubo (Try for free)     Why the Broncos can coverQuarterback Bo Nix leads the Denver offense. In 11 games, he has completed 61.2% of his passes for 2,421 yards and 18 touchdowns with eight interceptions. He has also rushed 50 times for 213 yards (4.3 average) and three touchdowns. In the win over Kansas City, he completed 24 of 37 passes for 295 yards. In a 44-24 win over the Dallas Cowboys on Oct. 26, he completed 19 of 29 passes for 247 yards and four touchdowns.His top target has been veteran wide receiver Courtland Sutton. In 11 games, he has 45 receptions for 649 yards (14.4 average) and four touchdowns. He has 12 explosive plays of 20 yards or more, including a long of 52. He has 162 yards after the catch with 32 first-down conversions. In the win over the Chiefs, he caught four passes for 59 yards, including a long of 21. See which team to back at SportsLine. Why the Commanders can coverVeteran quarterback Marcus Mariota is expected to get the start for Washington. He has played in parts of seven games, completing 92 of 140 passes (65.7%) for 1,065 yards and seven touchdowns with five interceptions and a rating of 90.3. He has also carried 27 times for 193 yards (7.1 average) and one touchdown, with four explosive plays, including a long of 44 yards. In the loss at Miami, he completed 20 of 30 passes for 213 yards and one touchdown with one interception.Leading the rushing attack is rookie running back Jacory Croskey-Merritt. In 11 games, he has rushed 114 times for 498 yards (4.4 average) and four touchdowns. He has two explosive runs of 20 or more yards, including a long of 42. He also has nine receptions for 68 yards. In a 27-10 win over the Los Angeles Chargers on Oct. 5, he carried 14 times for 111 yards and two touchdowns. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Broncos vs. Commanders  picksTierney has analyzed Broncos vs. Commanders from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Commanders vs. Broncos, and what critical X-factor makes one side of the spread a must-back?. You can head to SportsLine to see his Broncos vs. Commanders picks. Visit SportsLine now to see which side you need to jump on, all from the expert that is 15-9 on his last 24 Washington Commanders picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos vs. Commanders odds, prediction, best bets: 'Sunday Night Football' picks by expert on 15-9 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/d8cd26bf-23bd-4c0e-ac7b-02372d5502d8/thumbnail/1200x675/c8adb318a2c26b3fc295ee16aa7adb78/marcus-mariota-commanders-cbs.jpg"
      ],
      "datePublished": "2025-11-30T20:09:16.000Z",
      "dateModified": "2025-11-30T20:09:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Bills vs. Steelers picks, score prediction, SGP for NFL Week 13 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-bills-where-to-watch-nfl-week-13-score-prediction-betting-odds-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cfb96964-edbb-4b6f-8d23-47acd73bd88e/thumbnail/1200x675/0637b5196e530e2f6256d025ea676eb9/aaron-rodgers-steelers.jpg",
    "tag": "Sports",
    "date": "2025-11-30T20:09:33.000Z",
    "description": "\n        Josh Allen and the Buffalo Bills visit Aaron Rodgers and the Pittsburgh Steelers in Week 13 of the NFL season. Buffalo (7-4) suffered a setba",
    "body": "\n        Josh Allen and the Buffalo Bills visit Aaron Rodgers and the Pittsburgh Steelers in Week 13 of the NFL season. Buffalo (7-4) suffered a setback against the Houston Texans on Thursday Night Football last week, while Pittsburgh (6-5) was defeated by the Chicago Bears with Rodgers sidelined with a wrist injury. The veteran signal-caller is going to return against the Bills.Kickoff from Acrisure Stadium is set for 4:25 p.m. ET on CBS and Paramount+. The Bills are three-point favorites, according to the latest Bills vs. Steelers odds. The over/under for total points scored is 45.5. The Bills are -172 money line favorites (risk $172 to win $100), while the Steelers are +143 underdogs. Before making any Steelers vs. Bills picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Bills vs. Steelers at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Bills vs. SteelersBrandPromoPromo CodeDraftKingsBet $5, get $200 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $150 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Bills vs. Steelers on SundayWhen: Sunday, Nov. 30Time: 4:25 p.m. ETTV: CBSStream: Paramount+ Follow along: CBS Sports AppSteelers vs. Bills betting previewOdds: Bills -3, over/under 45.5While Buffalo is 7-4, it is just 5-6 ATS and has gone 6-5 to the Under. The Steelers, 6-5 outright, are also 5-6 ATS. Pittsburgh is 6-5 to the Over. Three of the last five Bills games have gone Under, while three of the last four Steelers games have landed that way.Click here to bet Bills vs. Steelers at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Bills vs. Steelers SGPSteelers +3DK Metcalf anytime touchdown scorerAaron Rodgers Under 199.5 passing yardsFinal odds: +1000 at DraftKings (wager $100 to win $1000)Model's Bills vs. Steelers score prediction, picksThe model has Buffalo winning in 55% of its simulations, but the Steelers offer more value on the money line at +152. Pittsburgh covers the 3.5-point spread in 53% of the simulations, while there's an even 50% split between Over and Under outcomes.Bills vs. Steelers score prediction: Buffalo 25, Steelers 23Want more Week 13 NFL picks?You've seen the model's best bets for Buffalo Bills vs. Pittsburgh Steelers. Now, get against the spread, total and money-line picks for every Week 13 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Bills vs. Steelers picks, score prediction, SGP for NFL Week 13 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cfb96964-edbb-4b6f-8d23-47acd73bd88e/thumbnail/1200x675/0637b5196e530e2f6256d025ea676eb9/aaron-rodgers-steelers.jpg"
      ],
      "datePublished": "2025-11-30T20:09:33.000Z",
      "dateModified": "2025-11-30T20:09:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass by targeting Raiders-Chargers, Broncos - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-free-nba-league-pass-raiders-chargers-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-30T16:42:45.000Z",
    "description": "\n        With the latest DraftKings promo code, new users receive $200 in bonus bets and three free months of NBA League Pass to bet on the Week 13 NF",
    "body": "\n        With the latest DraftKings promo code, new users receive $200 in bonus bets and three free months of NBA League Pass to bet on the Week 13 NFL schedule, which is filled with top matchups with postseason implications. The Denver Broncos will host the Washington Commanders on Sunday Night Football, with Denver looking to remain in the forefront of the race for the No. 1 seed in the AFC, as one of two teams in the conference entering this week with only two losses. Coming off a bye, one of SportsLine's top experts is backing the Broncos to cover as 6.5-point favorites as a part of Sunday's best bets at DraftKings Sportsbook.The SportsLine Projection Model is backing Over 40.5 total points in Raiders vs. Chargers at 4:25 p.m. ET, while another of SportsLine's top experts has locked in a pick on 49ers vs. Browns (+5.5) in windy, snowy Cleveland. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Sunday best bets at DraftKings SportsbookBrowns (+5.5) vs. 49ersChargers vs. Raiders: Over 40.5 pointsBroncos (-6.5) vs. CommandersCombining the model's three picks into a Saturday parlay at DraftKings would result in a payout of +578 (risk $100 to win $593). Bet it at DraftKings here:\nBrowns (+5.5) vs. 49ers\"Weather is likely going to be a factor in this game, with sustained winds in the 20s and a moderate chance of rain,\" SportsLine football expert R.J. White said. \"That's crashed the total to the point where the home team shouldn't be getting more than 4 points. Yes, the 49ers have a superstar at running back, but Brock Purdy looked like a problem throwing the ball in good conditions Monday, and he'll be up against a tougher defense here and prone to making more mistakes. That could neutralize the mistakes the Browns will likely get from Shedeur Sanders, and this feels like a game that ends in the 16-13 range.\" Back the Browns at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Chargers vs. Raiders: Over 40.5 pointsThe Raiders have the No. 31 scoring offense in the NFL at 15 points per game this season, but the Chargers are coming off allowing 35 points in Week 11 before their bye last week. Although the Raiders only scored 10 points last week, Geno Smith had one of his better games of the season, completing 68.2% of his passes for 285 yards. The Raiders fired offensive coordinator Chip Kelly after the loss, so that change could also provide a spark in Las Vegas. Meanwhile, the Chargers had scored at least 24 points in five straight games before their 35-6 loss before the bye. The model projects the Over to hit in 66% of simulations. Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Broncos (-6.5) vs. CommandersSiding with a sizable favorite that wins narrowly will be nerve-wracking,\" SportsLine expert Mike Tierney said. Of the Broncos' eight consecutive straight-up wins, here are the margins in six of them: one, two, three, three, three, four. On the other hand, the Commanders have failed to cover once during their current six-game straight-up slide. While both teams have regained a modicum of health, Washington QB Jayden Daniels remains idled, while Denver All-Pro CB Patrick Surtain II is expected to return after three games out. With the league's 14-ranked offense, the Broncos should be able to find sufficient points against the No. 31 defense for a cover.\" Back Denver at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:\nWant more Sunday NFL picks?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass by targeting Raiders-Chargers, Broncos - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg"
      ],
      "datePublished": "2025-11-30T16:42:45.000Z",
      "dateModified": "2025-11-30T16:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Broncos - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-betting-apps-nfl-sportsbooks-promos-sunday-night-football-how-where-to-bet-commanders-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/34d95d1c-452b-46a7-bd2d-06b298022dec/thumbnail/1200x675/5a7c69637184802f3b0f66f635df8722/bo-nix-rj-harvey-broncos-cbs-imagn-1.jpg",
    "tag": "Sports",
    "date": "2025-11-30T18:00:42.000Z",
    "description": "\n        Jayden Daniels and Bo Nix had the best rookie seasons of any quarterbacks from the Class of 2024, and we all circled a Week 13 matchup betwee",
    "body": "\n        Jayden Daniels and Bo Nix had the best rookie seasons of any quarterbacks from the Class of 2024, and we all circled a Week 13 matchup between the Washington Commanders and Denver Broncos on Sunday Night Football as a potential clash of titans. However, Daniels has battled injuries throughout the season and will not play on Sunday, so it will be Nix vs. Commanders backup Marcus Mariota instead. Washington is also an unfortunate 3-8 during an injury-plagued season, while Denver is 9-2. Kickoff is scheduled for 8:20 p.m. ET, and the latest Commanders vs. Broncos odds list Denver as the 6.5-point road favorite, while the over/under is 43.5.There are dozens of betting options if you're wondering how to bet on the NFL, or more specifically, where to bet on Broncos vs. Commanders. Here's a closer look at available sportsbook promos on some of the top NFL betting sites, as well as the best betting apps that are available for Washington Vs. Denver on Sunday Night Football, with instructions on how to claim each offer and where to bet NFL.Where to bet on Commanders vs. Broncos on Sunday Night FootballBrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus bets and 3 months of NBA League Pass free if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $150 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCashCBSFANThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users either $150 in bonus bets with the placement of a $5+ bet, or up to a $1,000 first bet safety net. Users receive the $150 bonus whether the bet wins or loses.At DraftKings and FanDuel, you need to win your first bet to receive the bonus. FanDuel offers new users $150 in bonus bets if their first bet of at least $5 wins. DraftKings offers $200 in bonus bets with a winning wager of at least $5, but with the latest DraftKings promo code, new users will receive three months of NBA League Pass free, on top of the $200 in bonus bets.The latest Fanatics Sportsbook promo code CBSFAN provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code is different than the aforementioned offers, providing profit boosts instead of bonus bets. At Caesars, new users can get 20 100% sportsbook profit boosts with a $1 bet. Bettors can use any of these promotions for Commanders vs. Broncos for Sunday Night Football on Sunday, November 30.Broncos vs. Commanders betting preview, picksCommanders (+6.5) vs. BroncosDenver is on an eight-game winning streak and is currently the No. 2 seed in the AFC, but has hardly been dominant during that span. Six of those wins have come in one-possession game,s and it took monumental comebacks against the Eagles and Giants, while victories over the Chiefs, Texans and Jets all came on the final drive. The offense has been pretty middle-of-the-road (16th in scoring and 14th in total offense), and Bo Nix is only averaging 6.3 yards per pass attempt. The model expects the trend of Denver not being able to put bad teams away to continue, predicting that Washington covers in 51% of simulations.Over 43.5 pointsJayden Daniels hasn't officially been ruled out, but Dan Quinn shouldn't be in a rush to put his franchise quarterback on the field after his choice to leave him in during the fourth quarter of a blowout loss to the Seahawks landed the Commanders in this mess in the first place. However, Terry McLaurin (quad) has returned to practice, and he could return to give the Washington offense a lift. Meanwhile, Denver has had the bye week to prep for a lackluster Commanders defense, and the model expects the Broncos to do most of the heavy lifting here. The Over hits in 57% of simulations.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Broncos - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/34d95d1c-452b-46a7-bd2d-06b298022dec/thumbnail/1200x675/5a7c69637184802f3b0f66f635df8722/bo-nix-rj-harvey-broncos-cbs-imagn-1.jpg"
      ],
      "datePublished": "2025-11-30T18:00:42.000Z",
      "dateModified": "2025-11-30T18:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25: Texas A&M plummets in Week 15 college football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ap-top-25-college-football-rankings-texas-a-m-ohio-state-week-15/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/e1f652f5-57d3-40ed-85f5-f15411482ea2/thumbnail/1200x675/8e541dafbec4847fdaedde907fa1b410/adobe-express-file-2025-11-30t122346-667.jpg",
    "tag": "Sports",
    "date": "2025-11-30T19:13:01.000Z",
    "description": "\n        Once near the top of the rankings, Texas A&M heads in the wrong direction as the postseason approaches. The formerly top-three Aggies dropped",
    "body": "\n        Once near the top of the rankings, Texas A&M heads in the wrong direction as the postseason approaches. The formerly top-three Aggies dropped four spots to No. 7 in the latest AP Top 25 poll following their 27-17 rivalry week loss to Texas. It was the first real setback of the season for Texas A&M, which started the year 11-0 while beating up on some of the SEC's lower-tier teams. The Aggies are now 0-1 against conference opponents that finished the regular season with a winning record in SEC play. The loss also cost Texas A&M a spot in the SEC Championship Game, which will now be contested between No. 3 Georgia -- which moved into the top three as a result of A&M's loss -- and No. 10 Alabama for the third time since 2020. Texas, which is pushing for an at-large bid in the College Football Playoff, continued to creep up in the AP poll from No. 16 to No. 14. Outside the SEC, Ohio State strengthened its hold on the No. 1 spot, which it has held since beating preseason No. 1 Texas in Week 1 of the season. The Buckeyes cruised past rival Michigan in their regular season finale to set up a monumental clash against No. 2 Indiana in the Big Ten Championship Game. \nThe Group of Five race is still too close to call. James Madison is still ahead at No. 19, but the Dukes are followed closely by a pair of American Conference teams in North Texas (20) and Tulane (21). Week 15 AP Top 25 rankings First-place votes in parentheses\nOhio State (61)Indiana (5)GeorgiaOregonTexas TechOle MissTexas A&M Oklahoma Notre Dame AlabamaBYUMiami Vanderbilt Texas UtahVirginiaUSCMichiganJames MadisonNorth TexasTulane ArizonaNavyGeorgia Tech MissouriOthers receiving votes: Tennessee 71, Houston 57, Iowa 51, UNLV 33, New Mexico 20, South Florida 11, SMU 8, Iowa St. 4, Arizona St. 3, Louisville 3, UConn 3, North Dakota St. 3, Illinois 2, Washington 1, Pittsburgh 1, San Diego St. 1\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25: Texas A&M plummets in Week 15 college football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/e1f652f5-57d3-40ed-85f5-f15411482ea2/thumbnail/1200x675/8e541dafbec4847fdaedde907fa1b410/adobe-express-file-2025-11-30t122346-667.jpg"
      ],
      "datePublished": "2025-11-30T19:13:01.000Z",
      "dateModified": "2025-11-30T19:13:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Florida hires ex-Jaguars GM Dave Caldwell after tabbing Jon Sumrall as next coach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/florida-hires-former-jaguars-gm-dave-caldwell-after-tabbing-jon-sumrall-as-next-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/36e4fb57-2c10-4933-a8ac-2810c95256bb/thumbnail/1200x675/2905053435749074d965425d8e0b1a30/gettyimages-2163316380-2.jpg",
    "tag": "Sports",
    "date": "2025-11-30T18:52:44.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Florida Gators are entering a new era -- and n",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Florida Gators are entering a new era -- and not just on the sidelines. In addition to tabbing Jon Sumrall as its next football coach, Florida is hiring former Jacksonville Jaguars general manager Dave Caldwell for the same role in Gainesville, sources confirm to CBS Sports' Jonathan Jones.After working his way up through the scouting ranks, Caldwell was hired by the Jaguars in 2013. Just nine days after taking the job, Caldwell fired coach Mike Mularkey and brought in Gus Bradley as his replacement.In the 2014 NFL Draft, Caldwell selected quarterback Blake Bortles with the No. 3 overall pick and wide receiver Allen Robinson at No. 61. Among the other notable draft picks during Caldwell's tenure were Jalen Ramsey (2016), Yannick Ngakoue (2016), Leonard Fournette (2017) and Josh Allen (2019).During the 2016 season, Caldwell fired Bradley, and interim coach Doug Marrone took over in a full-time role the following season. The Jaguars' best season during Caldwell's tenure came in 2017 when they reached the AFC Championship Game before narrowly losing to the New England Patriots on the road.\nJacksonville was never able to recapture the magic of that season, and the team went 12-36 in the three seasons after that AFC title run. The Jaguars fired Caldwell in the middle of the 2020 season following a 1-10 start. The franchise went 37-86 under Caldwell's watch.In 2021, Caldwell joined the Philadelphia Eagles front office as a senior personnel director and advisor to the general manager. He won Super Bowl LIX with the team last season.\nThe hiring of Caldwell is another example of college football taking a more professional approach in the age of NIL and revenue sharing. In this case, Caldwell may be able to take some of the roster-building pressure off Sumrall, allowing him to focus more of his attention on coaching.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Florida hires ex-Jaguars GM Dave Caldwell after tabbing Jon Sumrall as next coach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/36e4fb57-2c10-4933-a8ac-2810c95256bb/thumbnail/1200x675/2905053435749074d965425d8e0b1a30/gettyimages-2163316380-2.jpg"
      ],
      "datePublished": "2025-11-30T18:52:44.000Z",
      "dateModified": "2025-11-30T18:52:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Yankees eye Kyle Tucker as Cody Bellinger backup plan, Red Sox want bats - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-yankees-cody-bellinger-kyle-tucker-red-sox-brewers-jacob-misiorowski/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/0239a50e-0a98-4443-a231-881b9ce270bb/thumbnail/1200x675/e9db45a7670e14c5b73debfb4b784c14/bellinger-getty-2.png",
    "tag": "Sports",
    "date": "2025-11-30T15:34:43.000Z",
    "description": "\n        December is right around the corner and baseball's annual Winter Meetings are a week away. There will be trades and free agent signings and r",
    "body": "\n        December is right around the corner and baseball's annual Winter Meetings are a week away. There will be trades and free agent signings and rumors aplenty during those four days in Orlando. The Winter Meetings are typically the four busiest days of the offseason. Until then, here are Sunday's hot stove rumors.  Tucker a backup plan for Yankees? \nThe Yankees appear to view Kyle Tucker as a backup plan to Cody Bellinger rather than the other way around, according to the New York Post. We ranked Tucker as the top free agent available this offseason, though Bellinger figures to come cheaper, plus he's more versatile defensively and is a known quantity to the Yankees after performing well in pinstripes this past season.  New York is continuing to pursue a top outfield free agent even after Trent Grisham accepted the $22.025 million qualifying offer. Landing Bellinger or Tucker would open up the possibility of a Jasson Domínguez trade. The club's erstwhile top prospect had an OK first full season in the big leagues in 2025, though when the Yankees were playing their most important games late in the year, Domínguez was often on the bench in favor of a Bellinger/Grisham/Aaron Judge outfield. \n                            \n    \n                                                \n                    \n     \tRed Sox could add multiple bats After adding Sonny Gray, the Red Sox are focused on boosting an offense that ranked 15th in home runs in 2025, and they could add multiple hitters, reports the Boston Globe. The BoSox are known to have interest in Pete Alonso and in a reunion with Alex Bregman. They could also pursue a second-tier hitter along the lines of Jorge Polanco. \nThe Red Sox have to figure out their corner infield situation and also add balance to a lineup that leans too left-handed at times, hence their interest in Alonso and Bregman, two righty-hitting corner infielders. It's possible they will add two hitters while also trading away an outfielder, potentially Wilyer Abreu or Jarren Duran. Point is, the Gray trade was likely only the start of the offseason for the Red Sox. They have more moves coming, potentially big ones.   Misiorowski extension talks not progressing \nContract extension talks between the Brewers and flamethrowing righty Jacob Misiorowski have not gained much traction yet, reports the Milwaukee Journal Sentinel. There is no rush to get this done -- Misiorowski will not be a free agent until the 2031-32 offseason. Still, the earlier Milwaukee locks him up, the larger the discount. That's usually how these things work. \nTeams rarely sign pitchers with less than one full year of service time to long-term extensions. It's been done only three times in the last 15 years: Matt Moore with the Rays (five years, $14 million with three club options), Chris Archer with the Rays (six years, $25.5 million with two club options), and Aaron Ashby with the Brewers (five years, $20.5 million with two club options). As a small market team, early extensions are Milwaukee's best chance to keep players like Misiorowski beyond their team control years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Yankees eye Kyle Tucker as Cody Bellinger backup plan, Red Sox want bats - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/0239a50e-0a98-4443-a231-881b9ce270bb/thumbnail/1200x675/e9db45a7670e14c5b73debfb4b784c14/bellinger-getty-2.png"
      ],
      "datePublished": "2025-11-30T15:34:43.000Z",
      "dateModified": "2025-11-30T15:34:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Florida hires Jon Sumrall: Tulane coach set to lead Gators, replace Billy Napier - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/florida-hires-jon-sumrall-head-coach-tulane/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/a8d779e5-5e54-4e34-a3b9-ffcaba6cb604/thumbnail/1200x675/77b6a0989f73783823e4828616424fc6/jon-sumrall.png",
    "tag": "Sports",
    "date": "2025-11-30T19:10:20.000Z",
    "description": "\n        Florida has hired Tulane's Jon Sumrall as its next football coach, the school announced on Sunday. The move ends a search that focused on Lan",
    "body": "\n        Florida has hired Tulane's Jon Sumrall as its next football coach, the school announced on Sunday. The move ends a search that focused on Lane Kiffin before it became apparent that staying at Ole Miss or moving to LSU were Kiffin's top choices. Sumrall's deal with Florida is for six years and $45 million, according to ESPN. After amassing a 42-11 record over his first four seasons as a head coach at Troy and Tulane, Sumrall represents a promising consolation prize for the Gators. The Huntsville, Alabama native was also a candidate for the Auburn job.\"The University of Florida is one of the premier programs in college football, and it's an incredible honor to serve as the head football coach,\" Sumrall said in a statement. \"I believe in building a team rooted in toughness, accountability and a relentless competitive spirit. Florida has everything necessary to compete at the highest level—the resources, the support, the tradition and the passion of Gator Nation. My family and I are excited to get to work.\"One of my first priorities will be to assemble an incredible staff, including an offensive coordinator who understands that, at Florida, having an explosive offense isn't optional – it's mandatory!\"\nFlorida fired Billy Napier in October following a 3-4 start to his fourth season. The 43-year old Sumrall will be Florida's fifth head coach since Urban Meyer's departure following the 2010 season. \"Jon Sumrall is a proven winner and an exceptional leader who has built successful programs at every stop,\" Florida athletic director Scott Stricklin said. \"He brings tremendous energy, strong recruiting relationships across our footprint, and a philosophy rooted in toughness, discipline and player development. He will cultivate a daily culture of competitiveness, accountability and winning that drives success on the field and throughout our program. Jon fully understands the expectations at the University of Florida, including our expectations to produce championship teams that feature a dynamic offense, and we're excited to welcome him and his family to Gator Nation.\"Not many coaches win big at two different non-Power programs, and even fewer do it as quickly as Jon has done it,\" Stricklin said. \"He joins rare company—coaches like Urban Meyer, Brian Kelly and Willie Fritz—who've delivered immediate success at multiple stops. Jon's track record of rapid turnarounds speaks directly to his leadership and the culture he establishes.\"\nA former star linebacker at Kentucky, Sumrall has reached the conference championship game in each of his four seasons as a head coach. Sumrall's 2025 Tulane team is No. 22 in the CFP Rankings and clinched its spot in the American title game by improving to 10-2 (7-1 AAC) with a win over Charlotte on Saturday. Florida announced in the release that Sumrall will guide Tulane through the remainder of its run -- which could include a CFP appearance. Fit at FloridaSumrall was courted by West Virginia during last year's coaching carousel but chose to remain with Tulane in a move that looks particularly wise now. Florida is one of several SEC posts that emerged as a potential destination for Sumrall in this cycle. As a former Ole Miss assistant, he would have been a potential fit with the Rebels. Given his deep ties to Kentucky, he surely would have been been pursued by the Wildcats in the event of a coaching change there. He was strongly linked to the opening at Auburn, too, before becoming the focus of Florida's search. While Sumrall may not have been the Gators' first choice, he accepted the Florida job as a man with options.\nFlorida's last SEC Championship came in 2008, and the Gators have finished with a losing record in four of the past five seasons. Sumrall's track record of immediate success in new jobs bodes well for the Gators' aspirations returning to the SEC's ruling class. His outward intensity and defensive background also represent a change in style for Florida, whose last two coaches -- Napier and Dan Mullen -- were offensive minds with more relaxed public demeanors.Sumrall's track recordSumrall brings SEC experience as both a player and assistant. After leading Kentucky in tackles during the 2004 season, Sumrall was diagnosed with cervical spinal stenosis and transitioned into a graduate assistant role for the 2005 and 2006 seasons.He worked at the FCS level at San Diego from 2007 to 2011, starting as a position coach before rising to become the defensive coordinator. He then worked as an assistant at Tulane (2012-14), Troy (2015-17), Ole Miss (2018) and Kentucky (2019-21) before landing his first head coaching job at Troy in 2022.\nKentucky ranked fourth in the SEC in total defense during the 2021 season when Sumrall was the program's co-defensive coordinator. Though he comes from a defensive background, Sumrall's teams have typically been well-rounded. The Green Wave tied for second in the American in yards per play at 6.7 last season while dominating opponents in time of possession with the best non-service academy rushing attack in the AAC. Tulane finished with a top 25 scoring offense and defense last year. His 2023 Troy team was led by a 3,500-yard passer in Gunnar Watson. Sumrall's 2025 team has been less statistically dominant than his 2024 team, but the squad has provided evidence of Sumrall's coaching acumen.The Green Wave recovered from the transfers of star quarterback Darian Mensah and first-team all-AAC running back Makhi Hughes to earn victories over Power Four foes Northwestern and Duke in the season's first three weeks. Those victories set Tulane on the path toward its current status as the Group of Five's highest-ranked team.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Florida hires Jon Sumrall: Tulane coach set to lead Gators, replace Billy Napier - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/a8d779e5-5e54-4e34-a3b9-ffcaba6cb604/thumbnail/1200x675/77b6a0989f73783823e4828616424fc6/jon-sumrall.png"
      ],
      "datePublished": "2025-11-30T19:10:20.000Z",
      "dateModified": "2025-11-30T19:10:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Coaches Poll top 25: Texas gains ground in Week 15 college football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/coaches-poll-top-25-college-football-rankings-texas-week-15/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/3b9d97e8-9f83-46d1-9e53-e5c44b62881d/thumbnail/1200x675/2839bda4767638306d6633ecc7ff5b2e/texas.png",
    "tag": "Sports",
    "date": "2025-11-30T17:41:32.000Z",
    "description": "\n        Steve Sarkisian and the Texas Longhorns earned a signature win to end the regular season, a 27-17 triumph over previously-unbeaten Texas A&M.",
    "body": "\n        Steve Sarkisian and the Texas Longhorns earned a signature win to end the regular season, a 27-17 triumph over previously-unbeaten Texas A&M. That rivalry result sparked a multi-spot rise in Sunday's Week 15 Coaches Poll. Now slotted at No. 14 with the Aggies sliding to No. 7, Texas awaits its College Football Playoff fate as a bubble team.The Longhorns previously ranked 16th by the selection committee and need to get to No. 10 on Tuesday night to have a legitimate shot at the bracket. Texas would be the first three-loss, at-large selection to ever make the field if it happens.\"I think we're absolutely a playoff team,\" Sarkisian said. \"We're the first team since the 2019 national champion LSU team to beat three top-10 ranked teams in the same season during the regular season. Let's just chew on that for a second.\"Unbeaten Ohio State maintained its No. 1 ranking in the Coaches Poll following its win at Michigan, which snapped a four-game losing skid in the Big Ten rivalry series. The Buckeyes play second-ranked Indiana in the conference championship finale next week, a matchup that will determine the top-seed in the playoff.\nFirst-place votes in parenthesis.Week 15 Coaches Poll1. Ohio State (63)2. Indiana3. Georgia4. Oregon5. Ole Miss6. Texas Tech7. Texas A&M8. Oklahoma9. Notre Dame10. Alabama11. BYU12. Vanderbilt 13. Miami14. Texas15. Utah16. Virginia17. USC18. Michigan19. James Madison20. North Texas21. Tulane22. Arizona23. Georgia Tech24. Tennessee25. NavySchools Dropped Out: No. 24 Pittsburgh; No. 25 SMUOthers Receiving Votes: Iowa 85; Houston 73; Missouri 52; SMU 28; Washington 18; UNLV 17; Pittsburgh 15; South Florida 12; Illinois 9; Louisville 6; Connecticut 6; TCU 5; Penn State 5; Old Dominion 2; New Mexico 2; Arizona State 2; San Diego State 1ACC conundrumPittsburgh and SMU dropped out of this week's Coaches Poll after losses to Miami and California. The Mustangs controlled their own destiny in the ACC Championship picture and erased a 17-point deficit in the fourth quarter before falling on the road, which puts Duke in the league title matchup with Virginia.\nIf the five-loss Blue Devils beat the Cavaliers, the Group of Five could produce two playoff entries. The playoff selection committee has not yet ranked James Madison, but that could happen in Tuesday night's penultimate top 25.Virginia will be the 11-seed in the final bracket if Tony Elliott's team beats Duke with the 12-seed going to the American champion — either Tulane or North Texas. Both of those teams are ranked in the updated Coaches Poll.And for Miami, the Hurricanes simply needed chaos to unfold during rivalry weekend to have a legitimate shot at reaching the playoff. No teams ahead of Miami nearby on the bubble lost. \n\"This is a College Football Playoff team,\" Miami coach Mario Cristobal said after Saturday's win. \"We've all seen it. We know it. Proud of the way our guys came out, dominated from start to finish. We left a lot of points on the board as well. We're really starting to click. Complete dominance. We've got great players in all phases, and we're playing great football in all phases. The best part about football is you get to settle it on the field, where head-to-head is always the No. 1 criterion.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Coaches Poll top 25: Texas gains ground in Week 15 college football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/3b9d97e8-9f83-46d1-9e53-e5c44b62881d/thumbnail/1200x675/2839bda4767638306d6633ecc7ff5b2e/texas.png"
      ],
      "datePublished": "2025-11-30T17:41:32.000Z",
      "dateModified": "2025-11-30T17:41:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football Week 14 overreactions: Let's skip the playoff this year, SEC is in for a rough postseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-week-14-overreactions-playoff-sec/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/eb17e06d-5915-470c-912f-e71a8e3d6150/thumbnail/1200x675/ab538138b1f40a86e98540222d145a5f/adobe-express-file-2025-11-30t101038-199.jpg",
    "tag": "Sports",
    "date": "2025-11-30T15:57:39.000Z",
    "description": "\n        There's no need to have the College Football Playoff this season. We can put it on a one-year hiatus because we all know how this is going to",
    "body": "\n        There's no need to have the College Football Playoff this season. We can put it on a one-year hiatus because we all know how this is going to end.A few weeks ago, I wrote that a national title game between Ohio State and Texas A&M was already set in stone. I got 50% of that right. The Buckeyes aren't just going to make the College Football Playoff National Championship -- they're going to win the whole thing and do it in fairly dominant fashion.It doesn't seem as if any team in the country is anywhere close to Ohio State's level in 2025. Maybe Indiana can actually give the Buckeyes a run for their money in the Big Ten Championship Game, but this feels like the type of spot where Ohio State reinforces the gap between it and the rest of the conference's teams.The offense is as good as ever. Though quarterback Julian Sayin probably doesn't deserve the Heisman Trophy, the first-year starter has been playing some elite football. He's an extremely accurate passer to every level of the field and avoids mistakes. It helps when you can throw to two of the best receivers in the game, Jeremiah Smith and Carnell Tate, though Sayin is incredibly talented in his own regard.\nThe defense is on another level. There were some worries that Ohio State would regress on that side of the ball after it lost defensive coordinator Jim Knowles and several of its top stars to the NFL. So, it's frankly unfair that the Buckeyes are even better this year.New coordinator Matt Patricia's NFL approach to calling a game ties other teams into knots. New stars like Arvell Reese, who may be the first non-quarterback drafted in April, have meshed well with returning studs like defensive back Caleb Downs and fellow linebacker Sonny Styles to improve Ohio State's talent across the board.Ohio State is going to win the national title. It's not going to have much trouble getting to that point. Let's spare the bellyaching about an uneven playoff format and just give the Buckeyes the trophy now.\nThe SEC is going to have a rough time in the CFP Obviously, the College Football Playoff will be played. Some of the games will be entertaining. For a certain part of the country, watching the SEC struggle in most of its playoff contests will be delicious schadenfreude because this year's version of the SEC is not built for a deep postseason run.Oklahoma's's defense can keep it competitive, but that offense is not built to succeed against high-level competition. Alabama looks incredibly fallible -- the Crimson Tide lost to Florida State and Oklahoma while struggling against hapless teams like South Carolina and Auburn.Again, the defense is top-shelf, but the offense has serious issues -- including a late-season nosedive from quarterback Ty Simpson. Texas A&M once looked like one of the nation's premier programs, but there's an air of fraudulence around the Aggies. Their finale against Texas represented their first time playing a conference opponent with a pulse, and they got whooped by 10 points.\nTwo weeks before that, Texas A&M had to go on the largest comeback in program history to avoid a home upset against a rudderless South Carolina squad. A&M's seven conference wins came against opponents with a combined 11-41 record in SEC play and it beat four teams that fired their coach midseason. That's not the résumé of a juggernaut. Maybe Georgia can save its league's reputation, but the Bulldogs share a lot of the same problems. The Big 12 should have multiple playoff teams This really shouldn't be an overreaction, but an overwhelming amount of the at-large conversation will go to teams like Texas, Notre Dame and even Alabama if it loses in the SEC Championship Game. That's understandable. Those are the big brands, and they get a big platform.\nInstead of shoehorning a team into the playoff because they're historically good, though, the selection committee should focus on teams that have actually accomplished something this year. It feels like, unless BYU beats Texas Tech to capture the Big 12 title, the 11-1 Cougars are going to get left out in the cold.That would be the real injustice. BYU's only loss came on the road against top five Texas Tech. Its strength of record ranks No. 6, according to ESPN FPI, which is ahead of fellow bubble teams Alabama, Vanderbilt, Texas, Notre Dame, Miami and Utah. BYU's strength of schedule (35) also ranks higher than Ole Miss, Notre Dame, Miami and Virginia.BYU has won each of its past three games by double digits, so it passes the eye test. It succeeds in every single metric that the selection committee values, so what would be the logic in leaving the Cougars out?\nBoth Texas Tech and BYU are worthy of a playoff bid, no matter what happens in the Big 12 Championship Game.Notre Dame doesn't belong near the CFP Notre Dame should certainly give way to a team like BYU. \"But the Fighting Irish have won 10 games in a row,\" you may shout via the keyboard. Hang the banner. They also lost their only two games of consequence when they started 0-2 against Texas A&M and Miami.It's patently absurd that this team is anywhere near the playoff conversation while the Cougars and others like Vanderbilt and Miami -- again, a Miami team that has a head-to-head win against Notre Dame -- get left by the wayside. It's frankly impressive that Notre Dame is on a 10-game win streak and not a single one of those wins actually matters.\nYou can argue that the Irish beat USC, but the Trojans are the definition of mid. I'm convinced that Pittsburgh was only ranked to boost Notre Dame's record. Even then, the Irish looked less impressive against the Panthers than Miami did.The only thing keeping Notre Dame in the race right now is brand recognition and preseason ranking. If those are the only criteria, then cancel the regular season.Hand Diego Pavia the Heisman nowDiego Pavia is the reason that Vanderbilt is in the College Football Playoff conversation. He's the reason why the Commodores are enjoying their greatest season in program history and took Tennessee to the cleaners Saturday for their first win against the Vols since 2018.\nAll of that should be reason enough to give him the Heisman Trophy. He's the engine behind one of college football's best stories.The numbers also back it up. He had 433 total yards of offense against Tennessee while scoring two touchdowns and averaging 8.3 yards per carry. That was his sixth game this season with at least 190 yards passing and 50 yards rushing -- more than any other FBS quarterback.In Vanderbilt's last four games of the regular season, Pavia had 1,494 yards and 12 touchdowns passing. He's averaged a whopping 14.5 yards per completion during that span. He checks all the boxes of a Heisman winner.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football Week 14 overreactions: Let's skip the playoff this year, SEC is in for a rough postseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/eb17e06d-5915-470c-912f-e71a8e3d6150/thumbnail/1200x675/ab538138b1f40a86e98540222d145a5f/adobe-express-file-2025-11-30t101038-199.jpg"
      ],
      "datePublished": "2025-11-30T15:57:39.000Z",
      "dateModified": "2025-11-30T15:57:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USWNT to close out 2025 against Italy as team reflects on evaluation-heavy year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uswnt-italy-preview-2025-evaluations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/0d15efa5-c905-42fe-8cb8-35e04d9e9a3c/thumbnail/1200x675/d2c65ec1b4cb0c2d0b8819ea9dfaa22c/usa-17.jpg",
    "tag": "Sports",
    "date": "2025-11-30T19:34:04.000Z",
    "description": "\n        The U.S. women's national team have a chance to close out the year with a winning streak on Monday. After defeating Italy 3-0 on Friday, the ",
    "body": "\n        The U.S. women's national team have a chance to close out the year with a winning streak on Monday. After defeating Italy 3-0 on Friday, the group will face the Europeans once again in the final match to mark the end of 2025 at Chase Stadium in Fort Lauderdale.The friendly marks the last chapter of a year defined by roster rotation, player pool expansion, and tactical experimentation, all authored by head coach Emma Hayes. The manager has been transparent about utilizing the year as a transformative one, as the group prepares to turn the page toward 2026. The USWNT will now ride the momentum of their recent victory into the final game of the year, and a three-game streak in hand over Portugal, New Zealand, and Italy, and a chance to close out 2025 with 12 wins. Here's everything you need to know about the upcoming match:How to watch final USWNT game of the yearDate: Monday, Dec. 1 | Time: 7 p.m. ETLocation: Chase Stadium -- Fort Lauderdale, Fla.TV: TBS\nFamiliar foeThe U.S. national team have spent a large chunk of the year playing repetitive opposition multiple times this year. Brazil, Ireland, Portugal, and now Italy are all programs the USWNT will have faced in consecutive matches during international windows. Hayes has utilized the double-opponent opportunities to get players experience while ensuring evaluations.Friday's victory was a tale of two halves for the Stars and Stripes. In a similar trend to Portugal's surprise win over the USWNT, Hayes' group got off to a quick start against Italy but failed to capitalize on an early goal scored by Oliva Moultrie. But unlike Portugal's come-from-behind win, the USWNT sealed victory in the second half, thanks to Catarina Macario. She scored a brace, and the two-goal performance was her second consecutive double-goal game. Macario's rise has been a quieter comeback of sorts, as the attacking player has had a long road back from an ACL injury in 2022. She heads into the final match of the year with six goals scored in seven previous starts, and the win against Italy had other players with moral victories as well. \nNaomi Girma's return to the roster after nearly 150 days was a welcome sight. The center back last featured for the team in July, during a 3-0 win against Canada, but has battled through a calf injury throughout the majority of the year. The vice-captain sported the armband on the pitch, with captain Lindsey Heaps on the sidelines for game one. Girma's presence helped steady the backline and secure a clean sheet against Italy.Hayes is no stranger to player rotations in 2025, so there could be several swaps in the lineup as the group prepares to face Italy once again. Veteran players reflect on year of evaluationsWith another game against Italy on the horizon, one such player who might get rotated back into the lineup will be team captain Lindsey Heaps. The 31-year-old midfielder is one of the most capped players on the team (169), has scored 37 goals for the USWNT, and first featured for the team in 2013. \nShe's been integrated in and out of lineups as manager Emma Hayes tries to get as many players familiar with the program's principles.\"I think first and foremost, the depth of this team is growing so much, and I think that is the most important thing with the U.S. national team,\" Heaps told reporters on Saturday.\"It's the most competitive environment that I've ever been a part of, and that's been through years and years and years. That's what makes it, you know, one of the best teams in the world for so long. So, to have that depth, to have these new young players coming through, and absolutely killing it, and putting on a show in this last game as well ... with the balance of experienced players and new players, it's really important.\"\nSometimes in the past, U.S. women's national team systems, player rotation and integration were not always met with positivity. Hayes's arrival has shifted that perspective around the program and U.S. Soccer as a whole. \"She brings her experience and learnings from years and years at Chelsea in such a high environment and class environment, where she has players that come and go as well, and I think that's what you have to make of this [program]. Like, it can't just be a steady state starting 11 all the time. You need to have that competitive environment,\" Heaps said about Hayes' role in 2025. \"I think she's been absolutely awesome in that, but also just giving confidence to everyone as well, to go do their thing and know that they're here for a reason.\"\nPredictionThe turkey hangover was nowhere to be found on Friday, and that will likely be the case again in match two against Italy. The Europeans will want a better showing, so maybe not a big blowout, but still a win for the USWNT. Pick: USWNT 2, Italy 0\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USWNT to close out 2025 against Italy as team reflects on evaluation-heavy year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/0d15efa5-c905-42fe-8cb8-35e04d9e9a3c/thumbnail/1200x675/d2c65ec1b4cb0c2d0b8819ea9dfaa22c/usa-17.jpg"
      ],
      "datePublished": "2025-11-30T19:34:04.000Z",
      "dateModified": "2025-11-30T19:34:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Curry to be rejoined by younger brother Seth Curry on Warriors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/warriors-stephen-curry-seth-curry-nba-brother-duo/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/1ed946ab-4330-44b1-9696-426caf7c1857/thumbnail/1200x675/23bfc0f18f7b15bf98fd1c3e27efd3d0/untitled-design-2025-11-30t094747-041.png",
    "tag": "Sports",
    "date": "2025-11-30T17:58:51.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Golden State Warriors are expected to sign Set",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Golden State Warriors are expected to sign Seth Curry to a one-year deal for the remainder of the season, per ESPN. Curry rejoins older brother Stephen Curry and the Warriors after suiting up with the team during training camp before being waived prior to the start of the season.Golden State waived Curry due to financial restraints, but had always intended on re-signing him early in the season. Now that's been made possible, reuniting the Curry brothers once again.Seth joins the Warriors after spending the last two seasons with the Charlotte Hornets where he shot 43.8% from 3-point range. Prior to that, he's hopped around to several different teams, including the Dallas Mavericks, Brooklyn Nets, Philadelphia 76ers, Portland Trail Blazers Sacramento Kings, Phoenix Suns Cleveland Cavaliers and Memphis Grizzlies. He went undrafted in the 2013 NBA Draft, but has maintained a long career because of his sharpshooting skills. He led the league in 3-point shooting last season, and is a career 43.3% marksman from deep.\nWe'll see how much playing time the younger Curry brother actually gets on a Warriors team that has started the season 11-10. Golden State could certainly use his 3-point efficiency this season given that the Warriors are a middling 3-point shooting squad, despite having several quality shooters on the roster. It could be attributed to poor shooting stretches, especially from Buddy Hield who is only knocking down 30.8% from deep. Curry could elevate Golden State's shooting profile, but only if he manages to crack Steve Kerr's rotation.The Curry brothers join an ever-growing list of NBA siblings to have played on the same team together over the years. It includes Giannis and Thanasis Antetokounmpo (Bucks), Brook and Robin Lopez (Bucks), Evan and Isaiah Mobley (Cavaliers), Franz and Moritz Wagner (Magic) and Marcus and Markieff Morris (Suns) just to name a few.\nWe'll see how successful the Curry brothers can be together, because we already know the legendary career 37-year-old Stephen has pieced together. But if Seth, 35, becomes an element that somehow lifts Golden State to win a championship this season, they'd be part of an even smaller list of brothers who have won a championship together. So far, that list only has one duo: the Antetokounmpo brothers. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Curry to be rejoined by younger brother Seth Curry on Warriors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/1ed946ab-4330-44b1-9696-426caf7c1857/thumbnail/1200x675/23bfc0f18f7b15bf98fd1c3e27efd3d0/untitled-design-2025-11-30t094747-041.png"
      ],
      "datePublished": "2025-11-30T17:58:51.000Z",
      "dateModified": "2025-11-30T17:58:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football grades: Ohio State earns 'A' as Buckeyes snap Michigan losing skid - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-grades-scores-ohio-state-texas-am-report-card-week-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/e2c13158-3557-47a5-8a1f-6b26d476e119/thumbnail/1200x675/e56d08e1bd4d18bb0abfe6ba59cc1cda/ohio-state.png",
    "tag": "Sports",
    "date": "2025-11-30T17:39:58.000Z",
    "description": "\n        No. 1 Ohio State rarely looked anything less than dominant during its 11-0 start, but it was fair to wonder how much of its invincibility was",
    "body": "\n        No. 1 Ohio State rarely looked anything less than dominant during its 11-0 start, but it was fair to wonder how much of its invincibility was merely the byproduct of an easy schedule. After opening with a 14-7 win over then-No. 1 Texas, the Buckeyes didn't play another team currently in the College Football Playoff Rankings until Saturday's showdown at No. 15 Michigan.Even the Texas victory lost some of its luster as the Longhorns never lived up to their preseason ranking en route to a 9-3 campaign that included an embarrassing loss to a Florida team that finished 4-8. Against that backdrop, Ohio State was still cloaked in a certain level of mystery entering the regular season's final week.The Buckeyes took a big step toward cementing their status as the nation's dominant team in a 27-9 Rivalry Week beatdown of the Wolverines. Michigan's offense is no juggernaut, but Ohio State flexed on both offense and defense while cruising to an impressive victory over their hated foe from up north.For their efforts, the Buckeyes earned an 'A' in this week's grades. With No. 3 Texas A&M dropping from the ranks of the unbeaten with its first loss, the stage is set for the Big Ten Championship Game between No. 1 Ohio State and No. 2 Indiana to provide a definitive answer on who the nation's top team is entering the College Football Playoff.\nWe are handing out grades evaluating every team that started or ended the day with national championship odds of +3000 or better.2025 national championship odds listed below courtesy of FanDuel Sportsbook. Teams listed in order of their AP Top 25 ranking.   \n    \n                                        \n    No. 1 Ohio StateGrade: A  Result: 27-9 win at No. 15 Michigan  Title odds: +155Ohio State showed why it's a heavy betting favorite to repeat as national champions while dominating a talented rival. The defense held Michigan 125 yards below its previous season low, and the offense met the physical challenged posed by the Wolverines. The Buckeyes doubled up Michigan in time of possession thanks to a 12-minute scoring drive in the second half that squeezed the life from the Wolverines.\n\n    \n                                        \n    No. 2 IndianaGrade: A  Result: 56-3 win at Purdue  Title odds: +480Indiana has outscored Purdue 122-3 in two meetings under Curt Cignetti after Friday's evisceration of the hapless Boilermakers. The Hoosiers sputtered a bit early before inflicting a never-ending barrage of big plays while outscoring their in-state foe 42-0 over the second and third quarters. IU totaled 355 yards rushing and racked up 10 tackles for loss in an all-around beatdown. \n    \n                                        \n    No. 3 Texas A&MGrade: C-  Result: 27-17 loss at No. 16 Texas  Title odds: +1200Texas A&M's shoddy run defense and flat passing attack were big problems. A blocked field goal also contributed to an uninspired effort for a team that squandered its opportunity to reach the SEC Championship Game. A&M coach Mike Elko called the second half \"by far the worst half we've played of the year.\" That's quite a statement considering the Aggies trailed South Carolina 30-3 at halftime on Nov. 15.\n    \n                                        \n    No. 4 GeorgiaGrade: C  Result: 16-9 win at No. 23 Georgia Tech  Title odds: +800Georgia's offense screeched to a halt in the second half without starting center Drew Bobo, who suffered a foot injury. Quarterback Gunner Stockton played his worst game of the season, and the running game was not impactful as the Bulldogs were trying to grow their lead and work the clock. UGA's defense played great, though, limiting the Yellow Jackets to just one red zone trip.\n\n    \n                                        \n    No. 5 Texas TechGrade: A+  Result: 49-0 win at West Virginia   Title odds: +1100Texas Tech had already secured its spot in the Big 12 Championship Game when it showed up to a frigid morning kickoff at West Virginia. What could have been a trap quickly turned into a rout as the Red Raiders kicked the Mountaineers around during a dominant, all-around win. WVU totaled zero rushing yards in a first half that featured four three-and-outs, two failed fourth down attempts and an interception.\n    \n                                        \n    No. 6 OregonGrade: B  Result: 26-14 win at Washington  Title odds: +1000Things briefly got tense in the fourth quarter when Washington drew within 19-14. But the Ducks responded with a quick 64-yard touchdown strike from Dante Moore to Malik Benson to regain critical separation in a workmanlike rivalry win. Oregon struggled in the run game but atoned for it with some explosive passing plays. Most importantly, the Ducks took care of the football and made everything hard for Washington's offense.\n    \n                                        \n    No. 7 Ole MissGrade: A-  Result: 38-19 win at Mississippi State  Title odds: +3000Ole Miss shelved the chaos surrounding Lane Kiffin for long enough to squash a bitter rival in a must-win road showdown. Mississippi State had no answer for the Rebels' balanced offensive attack, which produced a steady stream of explosive plays on the way to amassing 545 yards and 29 first downs. The defense did a good job of bending without breaking against running quarterback Kamario Taylor.\n\n    \n                                        \n    No. 8 OklahomaGrade: CResult: 17-13 win vs. LSUTitle odds: +7500Once again, Oklahoma won ugly. The Sooners looked anemic offensively for much of the game until LSU's defense wilted late and surrendered a couple of easy passing touchdowns. A more competent opponent would have taken advantage of OU's struggles, but LSU was not up to the task. It's hard to imagine the Sooners winning in the College Football Playoff if they don't find more offensive juice.\n    \n                                        \n    No. 9 Notre DameGrade: AResult: 49-20 win at StanfordTitle odds: +1000Notre Dame did all it could to leave a positive final impression on the College Football Playoff selection committee as it laid yet another epic beatdown on a woefully overmatched opponent. This team is obviously operating at a high level, but there's only so much you can prove by eviscerating bad teams, which is art Notre Dame has perfected the past two weeks.\n    \n                                        \n    No. 10 AlabamaGrade: C+Result: 27-20 win at AuburnTitle odds: +1200Alabama jumped out to a 17-0 lead and then lost its edge. The Crimson Tide went three-and-out on five of their final seven possessions, putting pressure on a defense that began to show cracks. But as has been the case so often in 2025, Alabama made clutch plays on both sides of the ball with the game on the line. This team's poise under pressure remains its best attribute.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football grades: Ohio State earns 'A' as Buckeyes snap Michigan losing skid - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/e2c13158-3557-47a5-8a1f-6b26d476e119/thumbnail/1200x675/e56d08e1bd4d18bb0abfe6ba59cc1cda/ohio-state.png"
      ],
      "datePublished": "2025-11-30T17:39:58.000Z",
      "dateModified": "2025-11-30T17:39:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos vs. Commanders anytime touchdown scorer props, back RJ Harvey on SNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-vs-commanders-anytime-touchdown-scorer-picks-predictions-odds-bet-rj-harvey-to-score-td-snf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/be8ba885-65d1-4316-a111-614e5efaa4c3/thumbnail/1200x675/6193be421efb86c4d9a8008fb4a4c7a7/rj-harey-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-30T17:49:19.000Z",
    "description": "\n        The Washington Commanders will host the Denver Broncos on Sunday Night Football in Week 13. The Broncos (9-2) enter Week 13 atop a highly com",
    "body": "\n        The Washington Commanders will host the Denver Broncos on Sunday Night Football in Week 13. The Broncos (9-2) enter Week 13 atop a highly competitive AFC West and are one of just two teams in the AFC with only two losses. The Commanders are 3-8, and superstar quarterback Jayden Daniels remains sidelined with an elbow injury. The Broncos are rested coming off a bye, but they'll remain without starting running back J.K. Dobbins, who is on IR with a foot injury. Rookie running back RJ Harvey led all running backs with 61% of snaps in the first game without Dobbins, and largely due to that potential workload, the SportsLine model views Harvey as a top option for Week 13 Sunday Night Football anytime touchdown scorers bets when online sports betting.The model also has another Denver running back, Jaleel McLaughlin, featured in its Week 13 Sunday Night Football anytime TD scorer bets, along with Commanders tight end Zach Ertz, with both showcasing value at Sunday Night Football anytime TD scorer odds near or greater than 3-1 for Sunday Night Football bets for Commanders vs. Broncos. Before making any Broncos vs. Commanders picks or anytime touchdown scorer props at sportsbooks, be sure to see the Week 13 NFL predictions from SportsLine's proven model and see the latest NFL odds. They can also help new users take advantage of sportsbook promos like the latest Fanatics Sportsbook promo code CBSFAN, which allows new users to bet and get up to $2,000 in No Sweat Bets in FanCash.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has revealed its top Commanders vs. Broncos anytime TD scorer prop picks for Sunday Night Football: Best Week 13 Broncos vs. Commanders anytime TD prop picks:RJ Harvey, Broncos (+100)Zach Ertz, Commanders (+285)Jaleel McLaughlin, Broncos (+380)Parlay these picks for +3000 odds with a Caesars Sportsbook promo code CBS20X (odds subject to change). New users receive 20 100% profit boost token with your first $1 bet:RJ Harvey, Broncos (+100)Harvey played 38 snaps in the first game with Dobbins out, which was twice as many as any other Broncos running back. The rookie played 61% of snaps for the game, and he's shown throughout the season that he's a gamebreaker who can score whenever he possesses the ball. He has five touchdowns over the last five weeks, as the second-round pick in the 2025 NFL Draft appears to be feeling more confident and gaining more trust in the Denver offense. The Commanders allowed Jahmyr Gibbs and De'Von Achane to each rush for at least 120 yards over the last two weeks, so there will be big-play rushing potential, which could lead to a TD for Harvey. The model projects Harvey as a touchdown candidate both on the ground and receiving, making him the model's top candidate to find the end zone on Sunday Night Football.Click here to bet on Harvey as a Sunday Night Football anytime TD scorer with the latest FanDuel promo code, which gives new users $150 in bonus bets if your first $5 bet wins:Zach Ertz, Commanders (+285)Although Ertz hasn't scored a touchdown over Marcus Mariota's two starts over the last two weeks, he leads all Commanders with 13 targets as the veteran backup quarterback's most sought-after option. Ertz was tied for the team lead with eight targets last week, and he's recorded four receptions in each contest. The Broncos have an elite defense, spearheaded by a secondary that includes defensive backs Patrick Surtain II and Dre Greenlaw, which could result in Mariota seeking out Ertz even more when going against a linebacker. At nearly 3-1 odds, the model likes the value on Ertz over any other Commanders player to score a touchdown on Sunday Night Football.Click here to bet on Ertz as a Sunday Night Football anytime TD scorer with the latest DraftKings promo code, which gives new users $200 in free bets if your first $5 bet wins, plus three months of NBA League Pass free: Jaleel McLaughlin, Broncos (+380)McLaughlin received both of Denver's carries inside the 10-yard line in a touchdown drive, which the 25-year-old capped off with a 4-yard run, in the Broncos' lone touchdown drive against the Chiefs in their last game. He only played eight snaps, which was tied for the third-most among Denver running backs, but touches inside the 10-yard line carry significantly more value for anytime touchdown scorer bets. While the model also likes Harvey to potentially break a big play and score a touchdown on Sunday, it also sees value in McLaughlin at his price. McLaughlin cashed in his first week without Dobbins, so maybe he can again. Click here to bet on McLaughlin as a Sunday Night Football anytime TD scorer with the latest DraftKings promo code, which gives new users $200 in free bets if your first $5 bet wins, plus three months of NBA League Pass free: Want more Week 13 NFL picks?You've seen the model's NFL anytime touchdown scorer prop picks for Commanders vs. Broncos in Week 13 Sunday Night Football. Now, get NFL Week 1 projections for every NFL spread, total and player prop at SportsLine.Also at SportsLine:You can also see the model's best bets for every Week 13 NFL game. Finally, SportsLine expert RJ White, who is 125-97-3 (+2395) over his last 225 NFL picks, has locked in multiple Week 13 NFL picks, including one on Broncos vs. Commanders. Visit SportsLine to see his best bets.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos vs. Commanders anytime touchdown scorer props, back RJ Harvey on SNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/be8ba885-65d1-4316-a111-614e5efaa4c3/thumbnail/1200x675/6193be421efb86c4d9a8008fb4a4c7a7/rj-harey-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2025-11-30T17:49:19.000Z",
      "dateModified": "2025-11-30T17:49:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]