[
  {
    "title": "Week 12 college football picks, predictions from legendary expert on 29-17 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-picks-spreads-lines-predictions-best-bets-week-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/080500e6-a9e8-4cfd-97bf-d49b83596f4f/thumbnail/1200x675/d4599bd3f8f1b65b6165e9cd318ba858/marcel-reed-texas-am.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:15:37.000Z",
    "description": "\n        The SEC takes the spotlight during the Week 12 college football schedule with a pair of top-15 matchups. No. 4 Alabama hosts No. 12 Oklahoma,",
    "body": "\n        The SEC takes the spotlight during the Week 12 college football schedule with a pair of top-15 matchups. No. 4 Alabama hosts No. 12 Oklahoma, while No. 5 Georgia hosts No. 11 Texas. The latest Week 12 college football odds list the Bulldogs at -6.5 and the Tide at -6 in their respective matchups, which could be ones we see again in either the SEC Championship Game or College Football Playoff.Other Week 12 college football lines of note include No. 19 USC (-6.5) vs. No. 20 Iowa, No. 10 Notre Dame (-12.5) vs. No. 24 Pittsburgh, No. 3 Texas A&M (-18.5) vs. South Carolina and No. 18 Michigan (-10.5) vs. Northwestern in a game played at Wrigley Field. Before locking in any Week 12 college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters Week 12 of this season on an 29-17 run on his official SportsLine college football picks as well, returning more than $1,000 for $100 bettors. Anyone following could have seen huge returns. \nNow, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for Week 12 and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Week 12One of the top college football picks Marshall is recommending for Week 12: He likes No. 3 Texas A&M (-18.5) to cover against South Carolina in a noon ET kickoff on Saturday. He's also taking the Over (49.5) in this matchup.\nThe Aggies are coming off two of their most impressive overall performances of the season, beating Missouri 38-17 in Week 11 and LSU 49-25 back in Week 9. South Carolina, meanwhile, is having a nightmare season as the Gamecocks have just one SEC win and have covered just once since late September. \"The home team has won outright last four seasons, though the Gamecocks have covered in last three meetings, including a 44-20 romp at Williams-Brice last October,\" Marshall told SportsLine. Still, a disappointing campaign for SC, a team that has lost six of last seven outright, and is only 3-5 last eight vs. spread. The unbeaten Ags have now covered four of last five as they push forward, also have gone Over in last four in 2025, and they are 8-2 to the Over since late 2024.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football picks for Week 12Marshall has evaluated every other matchup, and he's backing a coach who is on a 15-4 streak against the spread dating back to last season. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month for $1.\nSo what college football picks can you make with confidence, and what alarming trend do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 29-17 run on college football picks this season, and find out.College football odds for Week 12 notable gamesSee full Week 12 college football picks, odds, predictions here(odds subject to change)Friday, Nov. 14Clemson vs. Louisville (-2.5, 50.5)Minnesota vs. Oregon (-25.5, 44.5)Saturday, Nov. 15Michigan vs. Northwestern (+10.5, 41.5)Notre Dame vs. Pittsburgh (+12.5, 54.5)Texas A&M vs. South Carolina (+18.5, 49.5)Virginia vs. Duke (-4.5, 58.5)Penn State vs. Michigan State (+7, 49.5)NC State vs. Miami (-15.5, 55.5)Iowa vs. USC (-6.5, 48.5)\nOklahoma vs. Alabama (-6, 45.5)Texas vs. Georgia (-6.5, 48.5)UCLA vs. Ohio State (-31.5, 47.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 12 college football picks, predictions from legendary expert on 29-17 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/080500e6-a9e8-4cfd-97bf-d49b83596f4f/thumbnail/1200x675/d4599bd3f8f1b65b6165e9cd318ba858/marcel-reed-texas-am.jpg"
      ],
      "datePublished": "2025-11-14T19:15:37.000Z",
      "dateModified": "2025-11-14T19:15:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Finch pokes fun at JJ Redick, says podcasting will 'qualify you to coach Lakers' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/timberwolves-chris-finch-lakers-jj-redick-coach-podcasting/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/9f251b93-2984-4908-9695-732aa5f23361/thumbnail/1200x675/0a8c6ab5aaa726fc20ba54a5022b9863/gettyimages-2241304567-2.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:39:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a 15-year playing career, JJ Redick is in hi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a 15-year playing career, JJ Redick is in his second year coaching the Los Angeles Lakers, but he's still catching some heat for his podcaster-to-coach career path. This time, the shot came from Minnesota Timberwolves coach Chris Finch.Finch took a swipe at Redick almost as soon as he hit the couch on a live episode of \"The Zach Lowe Show.\" When discussing Lowe's return to podcasting earlier this year, Finch said the veteran journalist now has the resume necessary to coach in Los Angeles.\"I mean, it'll qualify you to coach the Lakers,\" Finch said with a smirk.\nRedick launched a podcast while still playing and continued to hold a prominent voice in the space after his playing career ended in 2021. Redick jumped off the mic and into a coaching gig with the Lakers while the 56-year-old Finch took the scenic route to the NBA, spending more than a decade with various teams in Europe before getting a G League gig with the Rio Grande Valley Vipers in 2009.\nEven when Finch did break through into the NBA, he spent a decade as an assistant before the Timberwolves hired him to be their head coach in 2021. Finch even coached Redick when he was an assistant with the New Orleans Pelicans from 2017-20.In fairness to Redick, he's had some success in the first 94 games of his coaching career. Last season, he coached the Lakers to a 50-32 record before they were eliminated in the first round of the playoffs by Finch's Timberwolves.\nThis year, the Lakers are off to an 8-4 start with a pair of wins over the Timberwolves, and that has all come with star LeBron James sidelined due to injury. Minnesota, meanwhile, is 7-4 on the year. The Lakers and Wolves won't face off again until March 10 in Los Angeles. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Finch pokes fun at JJ Redick, says podcasting will 'qualify you to coach Lakers' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/9f251b93-2984-4908-9695-732aa5f23361/thumbnail/1200x675/0a8c6ab5aaa726fc20ba54a5022b9863/gettyimages-2241304567-2.jpg"
      ],
      "datePublished": "2025-11-14T19:39:55.000Z",
      "dateModified": "2025-11-14T19:39:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals Week 12 college football picks, free best bets for Saturday, Nov. 15 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-week-12-college-football-free-bets-odds-betting-picks-model-backing-iowa-texas-saturday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/46ed09be-37d9-4704-82bd-e8618faa120f/thumbnail/1200x675/e44034e68f5789d1263afbca97c5b261/arch-manning-texas-longhorns.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:30:45.000Z",
    "description": "\n        A matchup boasting a College Football Playoff atmosphere will take place on Saturday when the No. 5 Georgia Bulldogs host the No. 10 Texas Lo",
    "body": "\n        A matchup boasting a College Football Playoff atmosphere will take place on Saturday when the No. 5 Georgia Bulldogs host the No. 10 Texas Longhorns at 7:30 p.m. ET. Both teams will enter this SEC showdown full of confidence. Texas is 13-2 in its last 15 games on the road, while Georgia is 19-1 in its past 20 games at home. According to the latest Week 12 college football odds, the Bulldogs are favored by six points at home, while the over/under for Texas vs. Georgia is 48.5 points. However, SportsLine's advanced computer model is backing Texas, which has won 10 straight games played in November, to cover the spread in 57% of simulations. The model is also backing Iowa (+6.5) to cover the spread on the road against USC, while the Over (52.5) hits 58% of the time in TCU vs. BYU. Before locking in your Week 12 college football picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also target the all-new DraftKings promo code, which offers $300 in bonus bets and three free months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college football spread picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:Week 12 college football best bets for Saturday, Nov. 15 (odds subject to change): Texas (+6.5) vs. Georgia Iowa (+6.5) vs. USCTCU vs. BYU: Over 51 pointsCombining the model's three picks into a Week 12 college football parlay would result in a payout of +581 (risk $100 to win $581). Bet it now at Caesars Sportsbook: Texas +6.5 vs. Georgia The Longhorns are fighting for their College Football Playoff lives on Saturday night, so they'll be playing with a real sense of urgency. Texas is 7-1 in its last eight games, and quarterback Arch Manning has been playing some of his best football down the stretch. Manning has thrown for over 325 yards and three touchdowns in each of his last two outings, and SportsLine's model is expecting he'll do enough to keep it close against Georgia. The Longhorns are projected to cover the spread in 60% of simulations on Saturday. Iowa +6.5 vs. USCThe Hawkeyes are coming off a heartbreaking 18-16 defeat at home against Oregon. However, Iowa is 6-1 against the spread in its last seven games, and the Hawkeyes are 5-1 ATS in their past six meetings against a Big Ten opponent. Iowa also ranks fourth in college football in scoring defense, holding opponents to just 13 points per game. SportsLine's model is projecting Iowa's defense to disrupt USC's explosive offense, as the Hawkeyes cover the spread in 57% of simulations. Over 51 points in TCU vs. BYUBoth of these teams average over 30 points per game, and SportsLine's model is projecting we'll see a high-scoring affair on Saturday night. The Horned Frogs are scoring 32.7 points per game on average, while the Cougars average 33 points per contest. In addition, the Over has hit in 11 of BYU's last 15 games when playing as the favorite. On Saturday, the Cougars are favored by 4.5 points. The model is projecting these teams will combine for 58 points, helping the Over hit in 58% of simulations.Want more Week 12 college football picks?You've seen the model's Week 12 college football best bets for Saturday. Now, get against the spread, total and money line picks for every Week 12 CFB game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals Week 12 college football picks, free best bets for Saturday, Nov. 15 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/46ed09be-37d9-4704-82bd-e8618faa120f/thumbnail/1200x675/e44034e68f5789d1263afbca97c5b261/arch-manning-texas-longhorns.jpg"
      ],
      "datePublished": "2025-11-14T19:30:45.000Z",
      "dateModified": "2025-11-14T19:30:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Packers vs. Giants: TV channel, live stream and preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-packers-vs-giants-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/22c85396-a71e-4d73-b0b4-271e1368d6e5/thumbnail/1200x675/473497c0ff21c0e5263a4123339cf314/untitled-design-2025-11-14t014607-992.png",
    "tag": "Sports",
    "date": "2025-11-14T19:15:29.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Giants will have a new coach and quarterback when they host the Packers\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:15 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Green Bay Packers need a rebound performance, and the New York Giants will begin a new chapter on Sunday as the two teams meet at MetLife Stadium. That should make for an interesting matchup between two iconic franchises.The Packers are reeling after a pair of disappointing losses -- a stunning upset at the hands of the Carolina Panthers and narrow defeat against the Philadelphia Eagles. Over that stretch, the Green Bay offense has totaled 20 points, and the passing game has really struggled. With injuries crushing the Packers' pass catchers, Jordan Love has been unable to find any rhythm. The good news is that the Giants defense has been very generous to opposing offenses, and the Green Bay defense can keep the team in any game.After another second-half collapse on the road last weekend, the Giants fired coach Brian Daboll, and offensive coordinator Mike Kafka has taken over as the interim. Adding to all that change is the fact that Jameis Winston will get his first start of the season with Jaxson Dart still in the concussion protocol. What will it all look like against a stout Packers defense? That is anyone's guess at the moment.You can find everything you need to know about this NFC matchup below.\nWhere to watch Packers vs. Giants liveDate: Sunday, Nov. 16 | Time: 1 p.m. ETLocation: MetLife Stadium -- East Rutherford, New JerseyTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Packers -7; O/U 42.5 (via DraftKings)Packers vs. Giants: Need to knowBig changes in The Big Apple. This past week has been a whirlwind for New York. From Dart suffering a concussion in Chicago to the firing of Daboll, the Giants are dealing with some major changes. So with Winston getting the start on Sunday, it'll be interesting to see what the offense looks like with him at the helm, especially since he doesn't possess Dart's rushing ability. More broadly, how will the Giants respond to Daboll's dismissal?Pressure mounting on LaFleur. Coach Matt LaFleur is starting to feel the heat with the Packers now sitting at 5-3-1 and third place in the NFC North. The offense hasn't been able to hit another gear, and the injuries are mounting. Tight end Tucker Kraft is out for the season, and receivers Romeo Doubs and Matthew Golden are battling their own ailments. After the trade for Micah Parsons, Green Bay was seen as a Super Bowl favorite, but the team has fallen short of those expectations lately.Historic losses for Green Bay. While the Packers offense has failed to hold up its end of the bargain, the defense has been doing serious work. Neither the Panthers nor the Eagles topped 17 point, and yet Green Bay lost to both of them. That's the first time since 1977 that the Packers have allowed less than 17 points in consecutive games and lost both.Packers vs. Giants prediction, pick\nThe Packers have been hard to trust against the spread (1-6 ATS in their last seven games), but there's no way to know how the Giants will respond after the week that they had. With Jameis Winston at quarterback, I am confident there will be points, one way or another. Whether Winston is hitting big plays or turning the ball over, both are good for scoring points. Pick: Giants +7; Over 44.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Packers vs. Giants: TV channel, live stream and preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/22c85396-a71e-4d73-b0b4-271e1368d6e5/thumbnail/1200x675/473497c0ff21c0e5263a4123339cf314/untitled-design-2025-11-14t014607-992.png"
      ],
      "datePublished": "2025-11-14T19:15:29.000Z",
      "dateModified": "2025-11-14T19:15:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Texans vs. Titans: TV channel, live stream, preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-texans-vs-titans-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/cd3025bf-5f07-497d-9dcf-063bfba2dbd1/thumbnail/1200x675/adff7a0089550d2e82fe0a5f393a502e/untitled-design-2025-11-14t021058-862.png",
    "tag": "Sports",
    "date": "2025-11-14T19:15:32.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Texans can get back to .500 with a win over the Titans\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:15 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Houston Texans picked up a huge win last weekend, and now they can get back to .500 with a road win over the Tennessee Titans. For their part, the Titans are just trying to pick up their second win of the year -- and their first under interim coach Mike McCoy.The Texans overcame a 19-point deficit against the Jacksonville Jaguars to pull off a miraculous comeback win last weekend. That kept them firmly in the AFC wild card mix, and it seems pretty unlikely Houston will find itself trailing by 19 points again in Week 11, even through C.J. Stroud is to be sidelined by a concussion for the second straight game. No matter who is under center on offense, the Texans defense will have a massive edge against the Titans offense.Tennessee is coming off a bye week, so it at least had an extra week to prepare for this divisional matchup. At this point in the season, the Titans' main goal needs to be bringing along rookie quarterback Cam Ward as much as possible. Ward will face a brutal test in his second meeting with Houston. The first round went decisively to the Texans with Ward throwing for just 108 yards and one interception.Here is everything you need to know about this AFC South matchup.\nWhere to watch Texans vs. Titans liveDate: Sunday, Nov. 16 | Time: 1 p.m. ETLocation: Nissan Stadium -- Nashville, TennesseeTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Texans -6; O/U 37.5 (via DraftKings)Texans vs. Titans: Need to knowTexans own Nashville. Houston has won its last four road games against Tennessee, and the defense has been stifling in that span. The Texans haven't allowed more than 17 points in any of those games as the Titans offense searches for answers. The way things have been going for these teams of late, this trend may not end on Sunday. Tennessee has scored more than 17 points just four times this season.Titans are strangers to late leads. Some teams are bad because they can't finish when they get the lead. Others are bad because they never lead. The Titans fall into that latter category. Tennessee is just the fourth team since 2000 to not hold a fourth-quarter lead in the first nine games of the season. Can the Titans put any kind of pressure on the Texans late in this game?Major mismatch. The matchup between the Texans defense and the Titans offense is one of the most lopsided matchups you'll see on a field all season. Houston ranks first in points against per game and total yards allowed per game. The Titans offense is dead last in scoring and total yardage. Tennessee punter Johnny Hekker needs to keep his leg warm.Texans vs. Titans prediction, pick\nIf the Texans can hold the Titans to 14 points or fewer, which seems pretty likely given how the series has gone of late, then Houston just needs 21 points to cover the spread. Davis Mills makes me nervous in that regard, but he just got done lighting up the Jaguars, and the Titans defense has no one capable of covering Nico Collins. I'll lay the points with the Texans. Pick: Texans -6; Over 37.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Texans vs. Titans: TV channel, live stream, preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/cd3025bf-5f07-497d-9dcf-063bfba2dbd1/thumbnail/1200x675/adff7a0089550d2e82fe0a5f393a502e/untitled-design-2025-11-14t021058-862.png"
      ],
      "datePublished": "2025-11-14T19:15:32.000Z",
      "dateModified": "2025-11-14T19:15:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Eubank vs. Conor Benn 2: Fight predictions, odds, start time in London - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/chris-eubank-jr-vs-conor-benn-2-fight-predictions-odds-undercard-start-time-expert-picks-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/6d762963-dab2-4fca-b916-71950bac79a0/thumbnail/1200x675/498b5a3947a812cf0bdc27b91890b152/chris-eubank-jr-conor-benn-getty.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:38:13.000Z",
    "description": "\n        It took years for rivals Conor Benn and Chris Eubank Jr. to finally share the ring. Their first fight took place in April and was a surprisin",
    "body": "\n        It took years for rivals Conor Benn and Chris Eubank Jr. to finally share the ring. Their first fight took place in April and was a surprising entrant into the Fight of the Year conversation. On Saturday in London, Benn and Eubank will run it back for a highly anticipated rematch at Tottenham Hotspur Stadium.The rivalry between the two fighters dates back to their fathers, Chris Eubank Sr. and Nigel Benn, who fought two historic British megafights in the 1990s. As the sons met in April, it led to the reunion of the Eubanks after years of being estranged. Eubank Sr. was by his son's side for the first fight and the pair have continued to build their relationship in the months that followed, with Eubank Jr. saying he spent his 36th birthday with his father, having \"conversations which we've never had before.\"The narrative coming into the first fight was that Benn would be too small to handle Eubank's power. Eubank is a natural 160-pound fighter who had fought as high as 168 pounds. Meanwhile, Benn mostly fought around 147 pounds. Eubank even slightly missed weight, coming in 0.05 pounds heavy and forfeiting $500,000 for the weight miss.\n        \n            \n                Chris Eubank Jr. and Conor Benn overdeliver on expectations in giving fans a cinematic masterpiece\n                \n                    Brian Campbell                \n            \n                            \n    \n                \n                    \n    \nDespite that narrative, it was Benn who came out firing winging power punches, even scoring the first shot that truly hurt either man, a big left hand that forced Eubank to clinch and recover.\nEubank eventually began to take over the fight as the two men continued to trade shots in furious exchanges. By the end of 12 rounds of action, the fans had been treated to a spectacular fight, and Eubank got the win by unanimous scorecards of 116-112.\"I'm not going to lie, I didn't expect he'd be the guy to do that,\" Eubank said after the fight. \"Everything surprised me. I didn't know he had what he had in him. I really didn't. I thought I would break him early and I underestimated him. I didn't train for a fight like that.\"A rematch was a sure thing, though there were delays. The original plan was for the rematch to take place in September, but Eubank said he would not be able to be ready for the date, pushing it to Saturday.\nChris Eubank Jr. vs. Conor Benn 2 fight card, oddsOdds via FanDuel SportsbookChris Eubank Jr. -190 vs. Conor Benn +140, middleweightsJack Catterall -235 vs. Ekow Essuman +170, welterweightsAdam Azim -1667 vs. Kurt Scoby +850, junior welterweightsIshmael Davis -345 vs. Sam Gilley +240, junior middleweightsRichard Riakporhe vs. Tommy Welch, heavyweightsMikie Tallon -5000 vs. Fezan Shahid +1400, flyweightsPredictionThe first fight felt like Benn giving everything he had in his entire body and soul, and he still came up short. It was incredible to see him fire big shots from the jump, throwing off the narrative that he was too small and had faced very little legitimate competition in his career. Even more impressive was Benn's ability to absorb heavy shots from a much bigger man.The real question entering the rematch is if Benn can possibly be better than he was in April. That's a very big ask for Benn. Eubank is still the bigger fighter, and has better pure boxing skills. The more skilled fighter is likely to be the fighter who is able to make the bigger adjustments in a rematch.For as great as the first fight was, I'm expecting the rematch to be more one-sided in Eubank's favor, though Benn will have his moments. Pick: Chris Eubank Jr. via TKO9\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Eubank vs. Conor Benn 2: Fight predictions, odds, start time in London - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/6d762963-dab2-4fca-b916-71950bac79a0/thumbnail/1200x675/498b5a3947a812cf0bdc27b91890b152/chris-eubank-jr-conor-benn-getty.jpg"
      ],
      "datePublished": "2025-11-14T19:38:13.000Z",
      "dateModified": "2025-11-14T19:38:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Bengals vs. Steelers: TV channel, live stream, preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-bengals-vs-steelers-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/0b2ea6c4-ecb7-4383-80ad-47b1ff1a033f/thumbnail/1200x675/d1c94e5da4eadd71994b731b1e0ceed8/rodgersindy.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:15:34.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Pittsburgh is looking to avenge its Week 7 loss to Cincinnati\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:15 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        While it's technically not a must-win game, Sunday's showdown between the Bengals and Steelers certainly feels that way for both teams. At 3-6, the Bengals haven't given themselves much leeway if they are going to make a run at the playoffs. Cincinnati's motivation to win Sunday's game was likely intensified with Joe Burrow's return to practice this week. If the Bengals can win this game, they would be 3-0 in the division and just one game behind the Steelers in the division standings. After a 4-1 start, the Steelers are now 5-4 after losing three of their last four games that includes a loss to the Bengals back in Week 7. One of the biggest reasons for the Steelers' recent struggles has been the regression of Aaron Rodgers and the rest of the offense, especially on third down. \nWhere to watch Bengals vs. Steelers liveWhen: Sunday, Nov. 16 | Time: 1 p.m. ETWhere: Acrisure Stadium -- Pittsburgh, Pennsylvania  TV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Steelers -5.5; O/U 49.5 (via FanDuel)Bengals vs. Steelers: Need to know Recent rematch. These teams faced each other a month ago in Cincinnati. In a shootout, the Bengals prevailed behind the precision passing of Joe Flacco, who went 31 of 47 for 342 yards and three touchdowns. Flacco out-dueled Rodgers, who threw four touchdowns but also tossed two interceptions. That win has been Cincinnati's only victory since Burrow went on injured reserve. Ja'Marr Chase dominates. Cincinnati's No. 1 wideout feasted on Pittsburgh's out-matched secondary back in Week 7. He caught a franchise single-game record 16 passes (on 23 targets!) for 161 yards and a touchdown. Fellow wideout Tee Higgins also had a big night with 96 yards and a touchdown on six receptions. Third down woes. While they're one of the NFL's best red zone teams on both sides of the ball, the Steelers are struggling mightily on third down. Pittsburgh's offense is 26th in the league in that department, while its defense is just 22nd in the NFL. The Steelers' offense was a putrid 7 of 33 on third down in their last three games. Rough one for Rodgers. Rodgers is coming off of one worst games of his career. During Pittsburgh's Week 10 loss to the Chargers, the former league MVP completed just 51.6% of his passes for 161 yards with one touchdown and two interceptions. Rodgers has since acknowledged that he was uncharacteristically off his game. More Warren? There's been a lot of talk in Pittsburgh this week about the involvement -- or lack thereof -- of running back Jaylen Warren. Despite being arguably the team's most effective skill player, Warren was on the field for just 46% of Pittsburgh's offensive snaps in Los Angeles. He was not on the field for a single third down. T.J. closing in on JJ. T.J. Watt is just one sack away from passing older brother JJ Watt. A three-time Defensive Player of the Year, JJ Watt racked up 114.5 sacks during his 12-year career.  Bengals vs. Steelers prediction, pick \nDefense is the biggest difference between the two teams. While neither unit has been stellar this season, the Steelers' defense still has the ability to take over a game. They did exactly that two weeks ago against the Colts, and I think they'll do it again in a game that the Steelers are looking at as a must-win. Pick: Steelers -5.5; Over 49.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Bengals vs. Steelers: TV channel, live stream, preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/0b2ea6c4-ecb7-4383-80ad-47b1ff1a033f/thumbnail/1200x675/d1c94e5da4eadd71994b731b1e0ceed8/rodgersindy.jpg"
      ],
      "datePublished": "2025-11-14T19:15:34.000Z",
      "dateModified": "2025-11-14T19:15:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Islam Makhachev says loss early in UFC set him up for successful career - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-322-islam-makhachev-champion-history/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/5ef7f25e-b477-44a7-bf36-370fff3d9cd7/thumbnail/1200x675/6a9bf31edc0d4cad0edfbfde125d9fea/islam-makhachev-point.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:01:20.000Z",
    "description": "\n        NEW YORK -- Despite everything that Islam Makhachev has already accomplished in MMA, from setting the UFC lightweight record for title defens",
    "body": "\n        NEW YORK -- Despite everything that Islam Makhachev has already accomplished in MMA, from setting the UFC lightweight record for title defenses to becoming a perennial pound-for-pound king, there's a feeling that Saturday's UFC 322 main event could be the most important challenge of his 15-year pro career. Makhachev (27-1) will look to become the 11th two-division champion in UFC history when he challenges welterweight titleholder Jack Della Maddalena (18-2) inside New York's Madison Square Garden. With a win, the 34-year-old would also tie Hall of Famer Anderson Silva for the most consecutive wins in UFC history with 16. \"I expect it's going to be a high-level fight and not just for the belt but for many things -- for legacy, for rankings, for the belt,\" Makhachev told CBS Sports on Wednesday. \"I'm very excited to fight this Saturday and this is the biggest fight of my life.\"Getting Makhachev, who vacated his 155-pound title in May, to talk specifics regarding the fighting legacy he has built isn't so easy. The proud native of Dagestan, Russia, who began training as a child under the tutelage of teammate Khabib Nurmagomedov's late father Abdulmanap, has long lived a life of discipline, humility and service to his training partners.\n\n        \n            \n                UFC 322: A look at champions who have earned second division title and those who came up short\n                \n                    Brent Brookhouse                \n            \n                            \n    \n                \n                    \n    \nWith stoppage wins under his belt against the likes of Dan Hooker, Charles Oliveira, Alexander Volkanovski and Dustin Poirier (not to mention a 2019 decision win over Arman Tsarukyan), Makhachev is already in the midst of authoring one of the greatest singular runs in promotional history. But you won't get Makhachev to pause his one-dimensional mindset of sacrifice long enough to entertain any questions about whether an additional victory against Della Maddalena would cement him as one of the all-time greats in the 32-year history of the UFC. \"Myself, I don't know. I cannot say this,\" Makhachev said. \"Maybe people who make the rankings, they are going to make it. But, myself, [I'm] just focusing on hard opponent [and] to win the belt.\"Makhachev's 2015 UFC debut came and went without much fanfare as he submitted Leo Kunts via rear-naked choke in Round 2, buried deep on the early prelims of a UFC 187 pay-per-view in Las Vegas. But it was his second appearance in the Octagon at UFC 192, just five months later in Houston, that turned out to be a massive turning point in Makhachev's life and career.\nIn a moment he almost reluctantly recalls as \"a big mistake,\" Makhachev charged forward with his hands down late in Round 1 against Brazilian journeyman Adriano Martins and was flattened by a perfectly timed right hook to the jaw. Even though Makhachev never lost consciousness, the fight was instantly waived off and ruled a knockout. Two fights (and two defeats) later, Martins was cut from the UFC and would go on to close his pro career having lost six of his final seven. But Makhachev, on the other hand, would never lose again. Six years after his lone pro defeat, and following the retirement of his unbeaten teammate Nurmagomedov, Makhachev fulfilled his late coach's prophecy by submitting Oliveira at UFC 280 in 2022 to become lightweight champion.So, how important was the loss to Martins in Makhachev's evolution?  \"If you ask me, of course I want to believe this. It was something important that made me become more of a great fighter,\" Makhachev said. \"I learned a lot from this fight. Maybe, if I did not lose, I would not have become a champion.\"\nMakhachev is noticeably more thick and muscular as he prepares for his first scheduled fight at 170 pounds and he credits the unusually long layoff of 10 months for allowing him to put on the weight \"the right way,\" in a systematic approach that won't compromise his speed or power in the new weight class. It was the longest break of Makhachev's career since 2020, when injuries and COVID-19 travel issues kept him idle for 18 months.\nThe thing is, even if Makhachev hadn't been preparing for such an important move up in weight entering the biggest challenge of his pro career, the work put in behind the scenes likely would've been the same. That's because training isn't a means to an end for Makhachev as much as it's the only life he knows and/or desires. Asked about the keys to his consistency and the secret behind having authored such an impressive win streak as long as 15 inside the Octagon, where he has mostly faced elite competition in a sport where there are so many ways to lose, Makhachev didn't hesitate. \n\"Hard work,\" Makhachev said. \"I know someone who is training more than me can beat me but I know nobody training more than me. That's the key.\"In fact, when pressed with rumors regarding the idea that he might retire early while still in his physical prime (similar to Nurmagomedov) should he defeat Della Maddalena, Makhachev quickly dismissed the idea altogether by referencing the fact that he barely made it a full week while attempting to rest after his first-round submission win over Renato Moicano in January without resorting back to his preferred lifestyle.\"I started training because when you did something all of your life, you miss it,\" Makhachev said. \"I'm not good on other things [in life], I'm good in the MMA. I missed training after one week. I want to [keep] fighting and I will be fighting for more years because I feel, when I change weight now [to 170 pounds], it's easier to fight more often.\"\nShould Makhachev continue to fight on (and continue to win) as he moves up to the deepest division in the sport, it won't be long until he surpasses the legacy and achievements of Nurmagomedov, who retired in 2020 at age 32 (fulfilling a promise to his mother and late father) as the reigning P4P king with a record of 29-0 following a trio of dominant submission wins over Conor McGregor, Poirier and Justin Gaethje. In fact, considering the history Makhachev is already on the verge of achieving should he defeat Della Maddalena, there's a strong argument to be made that Makhachev could already be on the verge of eclipsing the accomplishments of Nurmagomedov this weekend. That doesn't mean Nurmagomedov, who currently trains Makhachev alongside Javier Mendez, has ever had that type of conversation with his teammate nor is it something that is ever thought about much by anyone in the camp. \"I'm going to be honest, never [have we] talked about this,\" Makhachev said. \"We never think about this, we just help each other like training partners, like brothers. When [Nurmagomedov] became a UFC fighter, I helped him and traveled with him through all training camps and now, he gives it back to me and he helps me a lot.\"\nEver a card-carrying member of the mindset that \"the journey is the destination,\" Makhachev might not be willing to speak upon his lofty accomplishments but many fans and media will happily do that for him should he become a two-division champion, equal the vaunted streak of Silva and continue to take giant steps closer toward MMA immortality.\"I just don't want people to say [I] was one of the best fighters,\" Makhachev said. \"I want people to recognize me as a good person.\"Who wins UFC 322: Della Maddalena vs. Makhachev, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Islam Makhachev says loss early in UFC set him up for successful career - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/5ef7f25e-b477-44a7-bf36-370fff3d9cd7/thumbnail/1200x675/6a9bf31edc0d4cad0edfbfde125d9fea/islam-makhachev-point.jpg"
      ],
      "datePublished": "2025-11-14T19:01:20.000Z",
      "dateModified": "2025-11-14T19:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jameis Winston starting for Giants at QB vs. Packers with Jaxson Dart ruled out - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jameis-winston-giants-starting-qb-jaxson-dart-concussion-russell-wilson/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/14/b24768de-7a13-4f40-872b-1e44d4fc8d61/thumbnail/1200x675/ff6b61eacbf0dfc6beab66a802db0831/jameis-winston-imagn.png",
    "tag": "Sports",
    "date": "2025-11-14T19:46:52.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        With Jaxson Dart in the NFL's concussion protocol,",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        With Jaxson Dart in the NFL's concussion protocol, the New York Giants will have a different starting quarterback on Sunday against the Green Bay Packers. Interim coach Mike Kafka told reporters Wednesday that the team is going with Jameis Winston under center, not Russell Wilson.Wilson completed 3 of 7 passes for 45 yards and took two sacks in place of Dart as the Giants blew their fourth double-digit lead of the season to the Chicago Bears. After the Giants fired Brian Daboll, interim coach Kafka made the decision to place Winston over the 36-year-old on the depth chart. Dart was officially ruled out Friday because of his concussion. Winston has been technically inactive for the entire 2025 season as the Giants' emergency third quarterback. He last played for the Cleveland Browns in 2024, going 2-5 as the starter while throwing for 2,121 yards, 13 touchdowns and 12 interceptions in 12 total games played. Jameis Winston's starts from Weeks 8-15 last seasonNFL RankCompletion percentage62%27thYards per attempt7.219thTurnovers14LastWinston made the Pro Bowl in his first NFL season with the Tampa Bay Buccaneers, and led the NFL in passing yards in 2019 with 5,109. That was the same year he recorded the first \"30 and 30\" season in NFL history, throwing 33 touchdowns and 30 interceptions. That was his final season in Tampa, as he then made his way to the New Orleans Saints. Winston went 6-4 as the starter in New Orleans over four seasons, as injuries started to affect his availability. Known for his boom-or-bust play, Kafka is hoping he can spark this offense. \nAs for Dart, this is the fourth time the rookie quarterback has been evaluated for a concussion this season. He has gone five straight games with a rushing touchdown, and is the fifth quarterback since 1970 to average 200 passing yards per game and 40 rushing yards per game in his first seven career starts. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jameis Winston starting for Giants at QB vs. Packers with Jaxson Dart ruled out - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/14/b24768de-7a13-4f40-872b-1e44d4fc8d61/thumbnail/1200x675/ff6b61eacbf0dfc6beab66a802db0831/jameis-winston-imagn.png"
      ],
      "datePublished": "2025-11-14T19:46:52.000Z",
      "dateModified": "2025-11-14T19:46:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Falcons vs. Panthers: TV channel, live stream, preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-falcons-vs-panthers-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/3df19804-9dcd-42a5-b79d-8e03afd9abc6/thumbnail/1200x675/25842aff562f744c21310fb5b58c18ec/bijan-vs-panthers.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:10:23.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Atlanta needs a win to secure any realistic hope of reaching the postseason\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:01 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The 5-5 Carolina Panthers are traveling to Mercedes-Benz Stadium to face the 3-6 Atlanta Falcons this week in an NFC South showdown. The Panthers are in second place in the division, while the Falcons are in third. An Atlanta loss likely would be devastating to the Falcons' hopes of playing beyond the regular season.The Panthers, meanwhile, are coming off a loss to the New Orleans Saints that never should've happened. In the 17-7 defeat, quarterback Bryce Young clearly didn't get much production going for the offense as he only produced 124 yards passing, despite finishing 17 of 25 passing with no touchdowns, one interception and a fumble.The Falcons are also coming off a loss, but a much closer one and against a better team. Atlanta needed overtime with Indianapolis to decide the winner in last week's Berlin game, although the Colts pulled out the win to extended the Falcons losing streak to four games.Here's a look at how to watch the game live, along with betting odds, what to know for the matchup and a prediction.\nWhere to watch Falcons vs. Panthers liveDate: Sunday, Nov. 16 | Time: 1 p.m. ETLocation: Mercedes-Benz Stadium -- Atlanta, GeorgiaTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Falcons -3.5; O/U 42.5 (via DraftKings)Falcons vs. Panthers: Need to knowWill it matter who's house? The Falcons are clearly better at home (2-2) than they are on the road (1-4), but the Panthers recently beat the Packers at Lambeau Field, which ought to suggest that perhaps the location issue might be a draw.Running backs vs. rushing defense. Let's take a look at Panthers running back Rico Dowdle vs. Falcons running back Bijan Robinson. Dowdle has 149 carries, 788 yards, five rushing touchdowns and one receiving touchdown. The Falcons defense has allowed 1,318 rushing yards, an average of 4.9 yards per carry and eight touchdowns on the ground. This year, Robinson has 135 rushes for 679 yards, two touchdowns on the ground and two in the air. The Panthers run defense has allowed 1,119 yards this season, an average of 4.4 yards per carry and 10 touchdowns on the ground. Dowdle did not practice on Wednesday due to a quadricep injury. Last week, to maintain a good workload for the injury, he also didn't practice on Wednesday, before being upgraded to limited on Thursday and a full participant on Friday, so he could be following that same pattern.Penix and London. Falcons quarterback Michael Penix Jr. and wide receiver Drake London have been effective this season. The QB-WR duo has 1,034 yards, and trail only the Seattle Seahawks' tandem of Sam Darnold and Jaxon Smith-Njigba. London did not participate in Wednesday's practice due to an illness, but if he can achieve the level of success that we're used to seeing it will likely make for a long day for the Panthers' defense. Falcons vs. Panthers prediction, pick\nThe last time these teams played, the Panthers won 30-0, but I think the Falcons learned their lesson after their Week 3 dud. I'm taking Atlanta in this one in a close game. The Falcons are 37-24 all-time against the Panthers. However, if London cannot play due to the illness that kept him out of practice on Wednesday, we could be looking at a different result. Pick: Falcons -3.5; Over 42.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Falcons vs. Panthers: TV channel, live stream, preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/3df19804-9dcd-42a5-b79d-8e03afd9abc6/thumbnail/1200x675/25842aff562f744c21310fb5b58c18ec/bijan-vs-panthers.jpg"
      ],
      "datePublished": "2025-11-14T19:10:23.000Z",
      "dateModified": "2025-11-14T19:10:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch 49ers vs. Cardinals: TV channel, live stream, preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-49ers-vs-cardinals-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/2d8f93f5-663d-4942-a552-31a7607ab8f0/thumbnail/1200x675/e3172fe9c9c2d4314f9adf381d3938d6/cmc49ers.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:00:50.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    San Francisco is looking to avenge its Week 10 loss to Los Angeles\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:00 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Sunday's showdown in the desert will feature two teams that are coming off tough losses. San Francisco (6-4) is looking to get back on track after dropping a 42-26 decision to the Los Angeles Rams, who are currently 1.5 games ahead of the 49ers in the NFC West standings. Speaking of the NFC West, Arizona (3-6) also lost in decisive fashion against a divisional foe last week. The first place Seahawks raced out to a 35-0 lead en route to an eventual 44-22 win over a Cardinals team that has lost six of their last seven games. For the 49ers, Sunday is a chance to remain within striking distance of Seattle and Los Angeles in the standings. For Arizona, this game is a critical one in terms of staying remotely relevant in the NFC wild card race. \nWhere to watch 49ers vs. Cardinals liveWhen: Sunday, Nov. 16 | Time: 4:05 p.m. ETWhere: State Farm Stadium -- Glendale, Arizona TV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: 49ers -3; O/U 47.5 (via FanDuel)49ers vs. Cardinals: Need to know Brock is back. 49ers quarterback Brock Purdy is making his return on Sunday after missing San Francisco's last six games with a toe injury. During Purdy's absence, the 49ers received solid play at quarterback from backup Mac Jones, who has thrown 13 touchdowns and six interceptions this season while completing 69.6% of his passes. The 49ers are 28-16 with Purdy that includes a 1-1 record this season. Week 3 rematch. San Francisco handed Arizona its first loss of the 2025 back in Week 3. After a 2-0 start, the Cardinals lost by a point after the 49ers kicked a game-winning field goal as time expired. The 49ers' 16-15 win was spearheaded offensively Christian McCaffrey, who amassed 140 all-purpose yards on 27 touches that included 88 yards on 10 receptions. Chasing history. McCaffrey has a chance to become the first player in NFL history to finish the season top-10 in both rushing and receiving. He's currently sixth in the NFL with 692 receiving yards and 13th with 626 rushing yards. McCaffrey is also in position to become the first player in NFL history with consecutive seasons with over 1,000 yards rushing and receiving. Missing Marvin and Mack. Arizona won't have Marvin Harrison Jr. at their disposal against the 49ers after having surgery earlier this week night because of a mid-week appendectomy. The Cardinals will also be without linebacker Mack Wilson Sr. after he injured his ribs during last week's loss to Seattle. More Jacoby. With Kyler Murray on injured reserve, veteran quarterback Jacoby Brissett will make his fifth start of the season. While the Cardinals are just 1-3 with him as the starter, Brissett has played well. In addition to being a threat on the ground, Brissett has thrown two touchdown passes in four consecutive games while throwing just one interception over that span. He has fumbled four times, however.49ers vs. Cardinals prediction, pick \nWhile they are better than their record, the Cardinals continue to be plagued by injuries, and that'll once again be the case Sunday against a 49ers team that is determined to get back on track. The 49ers' defense, however, needs to make enough stops on third down, something that has been an issue for them at times this season. That won't be easy on Sunday as they are facing a Cardinals offense that is fourth in the NFL on third down. Pick: 49ers -3; Under 47.5 \n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch 49ers vs. Cardinals: TV channel, live stream, preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/2d8f93f5-663d-4942-a552-31a7607ab8f0/thumbnail/1200x675/e3172fe9c9c2d4314f9adf381d3938d6/cmc49ers.jpg"
      ],
      "datePublished": "2025-11-14T19:00:50.000Z",
      "dateModified": "2025-11-14T19:00:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Buccaneers vs. Bills: TV channel, live stream and preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-buccaneers-vs-bills-tv-channel-live-stream-and-preview-for-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/0a01a839-4ea2-415b-bdef-f7a47c26b2e9/thumbnail/1200x675/78e7d14b48b6375bc51fd947bc95e92b/josh-allen.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:00:43.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    It'll be a 2018 NFL Draft class reunion as Baker Mayfield and Josh Allen are set to meet in Buffalo\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:00 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        One of the best interconference matchups of Week 11 takes place in Buffalo, as Josh Allen and the Bills host Baker Mayfield and the Tampa Bay Buccaneers. These are two of the three teams to make the playoffs in each of the last five years, while the two quarterbacks taken first (Mayfield) and seventh (Allen) in the 2018 draft are two of three NFL players to account for 60 total touchdowns since 2024.The Buccaneers are coming off a 28-23 loss to Drake Maye and the New England Patriots. Tampa Bay struggled to contain rookie running back TreVeyon Henderson, who exploded for 147 yards and two touchdowns. The Bills are also coming off a loss -- a surprising 30-13 defeat that came at the hands of the Miami Dolphins. James Cook was held to 53 yards rushing, while the offense committed three turnovers. The Bills have lost three out of the last five games after starting 4-0, while the Buccaneers have lost two out of their past three after starting 5-1. Let's break down this important matchup, but first, here's how you can watch the game. \nWhere to watch Buccaneers vs. Bills liveDate: Sunday, Nov. 16 | Time: 1 p.m. ETLocation: Highmark Stadium -- Orchard Park, New YorkTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Bills -5.5; O/U 47.5 (via FanDuel)Buccaneers vs. Bills: Need to knowBills are struggling to defend the run. Bucky Irving returned to practice this week, and if he does suit up for the first time since Week 4, he has a favorable matchup. The Bills rank bottom three in the NFL in opponent rushing yards per game (147.6), opponent yards per rush (5.5) and opponent rushing touchdowns (14).Bills are dominant in Buffalo. The Bills are 15-1 in their past 16 home games, with the lone loss coming to the Patriots in Week 5. Sean McDermott is 92-48 as the Bills coach, which is tied for the fifth-most wins through nine seasons by an NFL coach. The only coaches that have won more games through nine seasons are George Seifert (106), Paul Brown (96), Mike McCarthy (94) and John Madden (94). Emeka Egbuka is a heavy favorite to win OROY. Tampa Bay's Egbuka is -160 to win Offensive Rookie of the Year over at FanDuel Sportsbook, as he leads all first-year players with 677 yards receiving and six receiving touchdowns. Against the Patriots last Sunday, he caught six passes for 115 yards and a touchdown. Buccaneers vs. Bills prediction, pick\nThe Buccaneers are 17-8 against the spread as an underdog since Mayfield joined the team in 2023, which is the best mark in the NFL, while the Bills are 2-5 against the spread as a favorite this season. Mayfield has 12 outright wins as an underdog with the Buccaneers, which again, ranks most in the NFL. I'll take the Bills to win this game at home, but 5.5 points is a bit too much. Pick: Buccaneers +5.5; Over 47.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Buccaneers vs. Bills: TV channel, live stream and preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/0a01a839-4ea2-415b-bdef-f7a47c26b2e9/thumbnail/1200x675/78e7d14b48b6375bc51fd947bc95e92b/josh-allen.jpg"
      ],
      "datePublished": "2025-11-14T19:00:43.000Z",
      "dateModified": "2025-11-14T19:00:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Dolphins vs. Commanders: TV channel, live stream for Madrid game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-dolphins-vs-commanders-tv-channel-live-stream-and-preview-for-week-11-madrid-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/13/2622e199-cdb2-4d35-a9ed-fa55d945edc4/thumbnail/1200x675/4adc0a0b522d8ea6ac1ebf157d73dd30/devon-achane-dolphins.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:05:28.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Miami looks to keep its surprising midseason resurgence going\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:00 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The NFL expands its NFL footprint once again Sunday, playing a game in Spain for the first time when the Washington Commanders face the Miami Dolphins at Estadio Santiago Bernabéu, home of world-famous soccer team Real Madrid.Both teams enter with 3-7 records, indicative of seasons that have gone far off track. The Commanders, who will be without Jayden Daniels (elbow) once again, have lost five straight games, the last four all by at least 21 points. No team since the NFL-AFL merger in 1970 has lost five straight games by 21 or more points, and Washington certainly won't want to return to the United States with the dubious distinction of being the first.The Dolphins, on the other hand, have won two of their last three, including a stunning 30-13 upset of the Bills in Week 10. Buffalo had won 14 of the previous 15 meetings (including playoffs) coming in, but behind a spirited defensive effort and explosive running game, Miami got its biggest win in the series since 2011. Now the Dolphins will hope to reverse another historic trend: They are just 2-5 in international games all-time.Here's how to watch this across-the-pond game as well as betting information, keys to the game and a prediction.\nWhere to watch Dolphins vs. Commanders liveDate: Sunday, Nov. 16 | Time: 9:30 a.m. ETWhere: Estadio Santiago Bernabéu -- Madrid, SpainTV: NFL Network | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Dolphins -2.5; O/U 47.5 (via FanDuel)Dolphins vs. Commanders: Need to knowDolphins' explosive offense looks to feast. Behind Tua Tagovailoa, De'Von Achane and Jaylen Waddle, the Dolphins had the fourth-highest explosive play rate in the NFL from Weeks 8-10. That included touchdown rushes of 59 and 35 yards last week by Achane and touchdown receptions of 43 (Week 8) and 38 yards by Waddle. Now, the Dolphins get to face a Washington defense that has allowed the fourth-highest explosive play rate this season and allowed 546 yards to the Lions in Week 10.What does Dan Quinn do to fix the defense? After an outing like that -- and several similar outings previously -- by the defense, coach Dan Quinn decided to make a change: He will be calling the defensive plays this week instead of defensive coordinator Joe Whitt Jr. Quinn has a tall task ahead of him. The Commanders will be without several starters due to either injury or suspension, and that includes cornerbacks Marshon Lattimore and Trey Amos. Quinn, who hasn't called plays since his tenure as Cowboys defensive coordinator, will hope to jumpstart a defense that has zero sacks over its past two games.Dolphins defense looks to keep creating takeaways. The Dolphins forced three turnovers against the Bills and now have a +5 turnover margin in three wins this season compared to a -12 turnover differential in losses this season. Or, to put it another way, Miami is 3-1 when winning the turnover battle and 0-6 when losing it. Commanders quarterback Marcus Mariota has four turnovers in four starts this season.Dolphins vs. Commanders pick, prediction\nQuinn taking over the defensive playcalling may help some, but the Commanders' personnel woes are too much to overcome on that side of the ball, which should allow Tagovailoa, Achane and Waddle to have big days. Miami's defense hasn't been much better this year, but with the Commanders missing Daniels, Terry McLaurin and others, it should get enough stops to earn a win. Pick: Dolphins -2.5; Under 47.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Dolphins vs. Commanders: TV channel, live stream for Madrid game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/13/2622e199-cdb2-4d35-a9ed-fa55d945edc4/thumbnail/1200x675/4adc0a0b522d8ea6ac1ebf157d73dd30/devon-achane-dolphins.jpg"
      ],
      "datePublished": "2025-11-14T19:05:28.000Z",
      "dateModified": "2025-11-14T19:05:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Chargers at Jaguars: TV channel, live stream and preview for Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-chargers-at-jaguars-tv-channel-live-stream-preview-week-11/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/63f6bfb5-fbee-4f1e-b39b-abf33d5eb4f4/thumbnail/1200x675/8a9af043e072c963a67f528ff163dfa6/justin.jpg",
    "tag": "Sports",
    "date": "2025-11-14T19:01:00.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Los Angeles hits the road following a statement win vs. Pittsburgh\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 14, 2025\n                            \n                    at\n    2:00 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Two AFC playoff hopefuls face off in Florida this week, as Trevor Lawrence and the Jacksonville Jaguars host Justin Herbert and the Los Angeles Chargers. This is their first meeting since the 2022 wild-card matchup, where the Jaguars came back from down 27-0 to pull out the 31-30 victory.The Jags are coming off a deflating 36-29 loss to the Houston Texans, in which they blew a franchise-record 19-point lead to backup quarterback Davis Mills. As for the Chargers, they blew out Aaron Rodgers and the Pittsburgh Steelers on \"Sunday Night Football,\" 25-10. Los Angeles' defense held Pittsburgh to 221 total yards of offense, and they only were able to convert 2 of 11 third downs. Let's break down this intriguing AFC showdown, but first, here's how you can watch the game.\nWhere to watch Chargers vs. Jaguars liveDate: Sunday, Nov. 16 | Time: 1 p.m. ETLocation: EverBank Stadium -- Jacksonville, FloridaTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Chargers -2.5; O/U 43.5 (via FanDuel)Chargers vs. Jaguars: Need to knowBest weaponry in the NFL? Herbert has thrown for 2,610 yards in 10 games, which ranks second in the NFL behind Daniel Jones. While the Chargers have a talented quarterback, he has some talented weapons at his disposal. Four different Chargers have recorded at least 450 receiving yards this season. No other NFL team can say that. Ladd McConkey (631 yards) leads the team in receiving, Keenan Allen (539 yards) just broke the Chargers' all-time receptions record, Quentin Johnston (502 yards) is finally living up to the hype and tight end Oronde Gadsden II (466 yards) has certainly flashed in his first NFL season. The Jaguars secondary has their work cut out for them.The race to hit Herbert. It's not tough to figure out the \"X Factor\" for this matchup. If Herbert can get the ball out quickly and not leave it to his banged-up offensive line to protect him for longer than three seconds, the Chargers should win this game. If Travon Walker and Josh Hines-Allen can wreak havoc, that bodes well for Jacksonville. Herbert is being hit 8.9 times per game this season, the third-highest rate for any quarterback in the last 20 seasons. He's the third-most sacked quarterback this season (33), but the Jaguars defense is tied for last in sacks (12). Travis Hunter is done for the year. The No. 2 overall pick in the 2025 NFL Draft won't return this season, as the Jaguars announced this week that he underwent surgery to repair his LCL after injuring his knee in practice two weeks ago. Lawrence's new weapon. The Jaguars acquired wide receiver Jakobi Meyers from the Las Vegas Raiders at the trade deadline, and he made an instant impact with Brian Thomas Jr. out last week. In his first game with Jacksonville, Meyers led the team with 41 yards on three receptions, catching all three targets. That fact might've surprised (and delighted) Lawerence since his corps has dropped 31 passes this season, the most of any NFL club.Chargers vs. Jaguars prediction, pick\nYou can understand why the Chargers are road favorites given what happened with these two teams last week, but the Chargers are 2-5 against the spread in their past seven games after starting the year 3-0 against the spread. L.A. has also failed to cover in three straight road games. I expect that trend to end on Sunday. This Jaguars offense has been inconsistent, and the defense disappointing. The Chargers have not been the most consistent team in the world either, but on paper, they are better. I'll take them to win on Sunday. Pick: Chargers -2.5, Under 43.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Chargers at Jaguars: TV channel, live stream and preview for Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/63f6bfb5-fbee-4f1e-b39b-abf33d5eb4f4/thumbnail/1200x675/8a9af043e072c963a67f528ff163dfa6/justin.jpg"
      ],
      "datePublished": "2025-11-14T19:01:00.000Z",
      "dateModified": "2025-11-14T19:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $150 bonus bets by betting Clemson-Louisville, Spurs-Warriors, Arizona-UCLA Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-fanduel-promo-code-get-150-bonus-bets-clemson-louisville-spurs-warriors-arizona-ucla-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg",
    "tag": "Sports",
    "date": "2025-11-14T16:54:08.000Z",
    "description": "\n        The San Antonio Spurs have the chance at revenge on Friday when they host the Golden State Warriors for the second time in three days, and wi",
    "body": "\n        The San Antonio Spurs have the chance at revenge on Friday when they host the Golden State Warriors for the second time in three days, and with the latest FanDuel promo code, new users get $150 in bonus bets if your first $5 wager wins. Victor Wembanyama had a triple-double on Wednesday with 31 points, 15 rebounds and 10 assists, and although that wasn't enough to give the Spurs the victory, one SportsLine expert predicts a different outcome on Friday, backing the Spurs to defeat the Warriors as part of his best bets at FanDuel Sportsbook.The SportsLine Projection Model has a pick on one of the top college football games of the evening, backing Over 50.5 total points in Louisville vs. Clemson in an ACC battle. Meanwhile, another SportsLine expert has a pick in a top-15 college basketball showcase between No. 5 Arizona and No. 15 UCLA for Friday best bets at FanDuel Sportsbook. Claim the latest FanDuel promo code, which gives new users $150 in bonus bets if your first $5 bet wins: Check out our FanDuel promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at FanDuel here:  Friday best bets at FanDuel SportsbookClemson vs. Louisville: Over 50.5 total points (-115)San Antonio Spurs to defeat the Golden State Warriors (-138)Arizona (-1.5) vs. UCLA (-118)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +495 (risk $100 to win $568). Bet it at FanDuel here:\nClemson vs. Louisville: Over 50.5 total points (-115)Louisville defeated Clemson, 33-21, last year to go Over this total, and the Cardinals' offense has been one of the better units in college football again this season. Miller Moss, a USC transfer quarterback, has the Cardinals averaging more than 30 points per game while scoring at least 24 points in all nine games this season. Louisville is averaging 30.7 ppg over its last three contests, with the Over hitting in two of those three games. Meanwhile, Clemson quarterback Cade Klubnik was in the Heisman Trophy conversation before the season after throwing for 3,639 yards and 36 touchdowns last year. He's dealt with some injuries this season, but he appears to be at full health and is two weeks removed from leading the Tigers to 45 points and throwing for 385 yards against Duke. The Over has also hit in two of the last three Clemson games. The model projects the Over to hit in 54% of simulations. Back the Over at FanDuel Sportsbook:Spurs to defeat the Warriors (-138)\"Am I a huge Steph Curry fan? Not really,\" SportsLine expert Matt Severance said. \"In many ways, he has ruined the NBA with his crazy pull-up/step-back 3-pointers because he is so gosh-darn amazing that everyone thinks they can do it. Do I think schematically Curry was good for basketball? Absolutely not. But I would argue he has changed the NBA, maybe more than Jordan has. My point is that Steph can win a game by himself. He did Wednesday on the Riverwalk with 46 points. It's just so hard to sweep one of these baseball-type series, though -- especially away. Remember, we were in this spot last Sunday with Orlando. With trepidation, I played the Magic to sweep Boston in a similar home/home type thing. They didn't.  Back San Antonio at FanDuel Sportsbook:Arizona (-1.5) vs. UCLA (-118)\"UCLA might kick on at some point this season...but not yet,\" legendary SportsLine expert Bruce Marshall said. \"Two against the spread losses vs. Pepperdine and West Georgia have highlighted Bruin shortcomings that Mick Cronin might not find easy to solve. Though adding ex-Lobos PG Donovan Dent is a plus, at the moment he looks the only UCLA player able to make plays off the dribble. Big man Aday Mara transferring to Michigan (where he is featuring nicely) also leaves a void. Meanwhile, this doesn't look like the same Arizona as the past two years that rode so much on the whims of Caleb Love. The excitement is building around 6-8 frosh Koa Peat, who is doing a bit of everything while scoring at a 19.3 ppg pace. Play Arizona (at Inglewood).\"\nWant more college basketball, college football and NBA picks?You've seen some of the model's best bets for Friday. Now, get against the spread, total and money-line picks for NFL, NBA, college football, college basketball and more here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $150 bonus bets by betting Clemson-Louisville, Spurs-Warriors, Arizona-UCLA Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg"
      ],
      "datePublished": "2025-11-14T16:54:08.000Z",
      "dateModified": "2025-11-14T16:54:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]