[
  {
    "title": "UEFA Women's Champions League Matchday 2 storylines, schedule: How to watch UWCL on Paramount+ - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-womens-champions-league-matchday-2-storylines-schedule-how-to-watch-uwcl-on-paramount/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/d9a42922-8a5c-4923-a344-cb269384fce5/thumbnail/1200x675/dfb1f01c66ee37ee17708b584a5f34c8/heapes.jpg",
    "tag": "Sports",
    "date": "2025-10-15T03:38:17.000Z",
    "description": "\n        The 2025-26 UEFA Women's Champions League continues this week with a second round of fixtures, and Matchday 2 is poised to deliver another th",
    "body": "\n        The 2025-26 UEFA Women's Champions League continues this week with a second round of fixtures, and Matchday 2 is poised to deliver another thrilling chapter after an exciting opening week with plenty of goals and surprises. The competition saw 39 goals scored across nine matches during the opening round, and the new Swiss model format delivered on its promise to deliver unpredictability. The explosive start was highlighted by FC Barcelona's spectacular display of goalscoring, defeating Bayern Munich 7-1. It was a dominant showcase for Liga F sides in general, as Atletico Madrid handed St. Polten a lopsided 6-0 loss, and Real Madrid claimed a 6-2 victory over AS Roma.Current title holders Arsenal were handed a tough 2-1 loss by tournament giants OL Lyonnes, as Haitian international Melchie Dumornay scored a first-half brace for the French side. Opening day set the stage for a critical Matchday 2, where teams will look to either build on early momentum or recover from initial setbacks.For the first time, CBS Sports will be the exclusive U.S. home of the UWCL, with every minute of the action available across different platforms. That includes comprehensive coverage for Matchday 2, with the schedule split between Paramount+, CBS Sports Network and CBS Sports Golazo Network.\nHere's what you need to know before tuning in.How to watchParamount+ will be a one-stop shop for all things Champions League, while CBS Sports Network and CBS Sports Golazo Network will have select matches and additional coverage. Each day's broadcast begins with UEFA Women's Champions League Today on both Paramount+ and CBS Sports Golazo Network before the early kickoffs, while Paramount+ and CBS Sports Network will have an hour-long pre-match show before the later matches. Post-match coverage will air on Paramount+ and CBS Sports Network, while CBS Sports Golazo Network will have a new edition of Scoreline to close out the day's action.CBS Sports' new UEFA Women's Champions League Today studio show will be anchored by Hannah Cash, while Jen Beattie, Janelly Farias, Darian Jenkins, Kelley O'Hara, and Ali Riley will serve as analysts. Chris Wittyngham will handle play-by-play duties and will be paired with Beattie and Jenkins, while Anita Jones will report pitchside and Christina Unkel will serve as the rules analyst.The league phase comes to the UWCLThe league phase will make its way to the Women's Champions League this season, the competition expanded from the 16 to 18 teams for the new format. Each team will play six games during the league phase, with the top four teams directly booking their tickets for the quarterfinals. Eight more teams will qualify for the knockout phase playoffs, with teams ranked fifth through eighth set to face those ranked ninth through 12th for a spot in the quarterfinals. From there, the competition resumes a familiar knockout format with all eyes on the May 24 final at Ullevaal Stadion in Oslo, Norway.\nMatchday 2 TV scheduleAll times U.S./EasternWEDNESDAY, OCT. 15TIMEHOW TO WATCHUEFA Women's Champions League Today12:30 p.m.Paramount+, CBS Sports Golazo NetworkValerenga vs. Wolfsburg12:45 p.m.Paramount+Lyon vs. St. Polten12:45 p.m.Paramount+, CBS Sports Golazo NetworkUEFA Women's Champions League Today2 p.m.Paramount+, CBS Sports NetworkCBS Sports Golazo Matchday2:45 p.m.CBS Sports Golazo NetworkRoma vs. FC Barcelona3 p.m.Paramount+, CBS Sports NetworkOH Leuven vs. Twente3 p.m.Paramount+, CBS Sports Golazo NetworkChelsea FC vs. Paris FC3 p.m.Paramount+UEFA Women's Champions League Today post-match5 p.m.Paramount+, CBS Sports NetworkTHURSDAY, OCT. 16TIMEHOW TO WATCHUEFA Women's Champions League Today12:30 p.m.Paramount+, CBS Sports Golazo NetworkAtletico Madrid vs. Manchester United12:45 p.m.Paramount+, CBS Sports Golazo NetworkUEFA Women's Champions League Today2 p.m.Paramount+, CBS Sports NetworkCBS Sports Golazo Matchday2:45 p.m.CBS Sports Golazo NetworkBenfica vs. Arsenal3 p.m.Paramount+, CBS Sports NetworkBayern Munich vs. Juventus3 p.m.Paramount+, CBS Sports Golazo NetworkPSG vs. Real Madrid3 p.m.Paramount+UEFA Women's Champions League Today post-match5 p.m.Paramount+, CBS Sports NetworkUWCL StandingsPositionTeamMPWDLGFGAGDPts1FC Barcelona110071+632Atlético Madrid110060+633Real Madrid110062+434VfL Wolfsburg110040+435Lyon110021+136Juventus110021+137Manchester United110010+138OH Leuven101022019Paris FC1010220110Chelsea FC1010110111FC Twente1010110112SL Benfica100112-1013Arsenal100112-1014Vålerenga100101-1015AS Roma100126-4016Paris Saint-Germain100104-4017Bayern Munich100117-6018St. Pölten100106-60Storylines for Matchday 2Bayern, Arsenal, and Chelsea need a response: Matchday 1 took no mercy on teams considered contenders. Arsenal will try to bounce back from a disappointing result against Lyon on day one when they go against Benfica. The Portugal side are known for strong home performances, and it'll be another test for the current title holders and their ability to bounce back. Another English side that need a response is Chelsea. The Blues were held to a 1-1 draw against Twente and will try to get their campaign on track at home against Paris FC, another side also looking for more points. Chelsea will have the backing of Stamford Bridge, but Paris FC will want a better showing as well after letting a two-goal lead slip last week. German squad Bayern Munich will want to make a statement against Juventus after a miserable showing against FC Barcelona. The Bundesliga side needs points and to chip away at goal differential after losing 7-1. It won't be easy against an eager Juventus side that's looking to build off early tournament success with their 2-1 win over Benfica. USWNT players to watch in the UWCL: Multiple USWNT players featured in the Champions League last week, and others who are still hopeful. Goalkeeper Phallon Tulis-Joyce had a massive performance with Manchester United. She's the squad's starting keeper and helped the team earn a clean sheet and its first win of the tournament. Alyssa Thompson is off to an impressive beginning with Chelsea, got the start last week against Twente, and another on Sunday during the Blues' win against Tottenham. She'll likely remain an option as head coach Sonia Bompastor manages minutes across the roster. Fullback Emily Fox is Arsenal's starting fullback, and they'll rely on her against Benfica, while Jenna Nighswonger has yet to be utilized by manager Renée Slegers in the tournament or in domestic competition. Additionally, Crystal Dunn has also not yet checked into matches for Paris Saint-Germain.Meanwhile, head coach Jonatan Giraldez has utilized all his American players for Lyon. Midfielders Lindsey Heaps, Lily Yohannes, and Korbin Shrader each played roles during Lyon's opening day victory against Arsenal. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UEFA Women's Champions League Matchday 2 storylines, schedule: How to watch UWCL on Paramount+ - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/d9a42922-8a5c-4923-a344-cb269384fce5/thumbnail/1200x675/dfb1f01c66ee37ee17708b584a5f34c8/heapes.jpg"
      ],
      "datePublished": "2025-10-15T03:38:17.000Z",
      "dateModified": "2025-10-15T03:38:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets for Brewers vs. Dodgers, college football betting today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-brewers-dodgers-college-football-betting-october-14-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:12:55.000Z",
    "description": "\n        The Los Angeles Dodgers look to take a commanding 2-0 series lead when they take on the Milwaukee Brewers in Game 2 of the NLCS on Tuesday at",
    "body": "\n        The Los Angeles Dodgers look to take a commanding 2-0 series lead when they take on the Milwaukee Brewers in Game 2 of the NLCS on Tuesday at 8:08 p.m. ET. Sports fans will also have three college football matchups to choose from on Tuesday, offering new users a great opportunity to use the latest bet365 bonus code CBSBET365, which offers $200 in bonus bets after placing a first wager of $5 or more. The Dodgers are -120 money line favorites (risk $120 to win $100), according to the latest MLB odds at bet365, while the over/under for total runs scored is 7.5.However, SportsLine's model is backing the Brewers (+105) to pull off the upset in 56% of simulations on Tuesday. The model's best bets also include South Alabama (-7) covering the spread in 55% of simulations against Arkansas State, and Western Kentucky (-7.5) covering at home against FIU 63% of the time at bet365 Sportsbook. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every MLB and college football game 10,000 times. It entered the second week of the 2025 MLB playoffs a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. It's also generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 38-25 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its picks at sportsbooks and on betting sites could have seen strong returns.Tuesday's top picks, best betsBrewers (+105) vs. DodgersSouth Alabama (-7) vs. Arkansas StateWestern Kentucky (-7.5) vs. FIUCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +647 (risk $100 to win $647). Bet it at bet365 here:Brewers (+105) vs. Dodgers The Dodgers walked away with a 2-1 victory on Monday, but Los Angeles is just 1-9 in its past 10 meetings with Milwaukee. Freddy Peralta is set to start on the mound for the Brewers, and he's given up two earned runs or fewer in four of his last five outings. SportsLine's model is calling for Milwaukee to win in 56% of simulations, which is substantially different from the consensus odds implied probability of 48.1%. Bet it at bet365 here:South Alabama (-7) vs. Arkansas StateArkansas State limps into tonight's contest having lost four of its past five games. South Alabama has dominated this series in recent years, winning five of the past six meetings against the Red Wolves. Arkansas State has lost nine of its last 11 games on the road, a big reason why the model is backing South Alabama to cover the spread in 55% of simulations. Bet it at bet365 now:Western Kentucky (-7.5) vs. FIUWestern Kentucky is 8-2 in its past 10 meetings against FIU, and the Hilltoppers are 9-1 in their last 10 games at home. Western Kentucky is also 4-1 against the spread in its last five games against the Panthers. The Hilltoppers rank 34th in the nation in red zone offense, and SportsLine's model expects Western Kentucky to score 35 points on Tuesday, helping WKU cover the spread 63% of the time. Bet it at bet365 here:Looking for NFL picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets for Brewers vs. Dodgers, college football betting today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-14T21:12:55.000Z",
      "dateModified": "2025-10-14T21:12:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy basketball rankings, picks 2025: Sleepers, breakouts, busts - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-rankings-2025-nba-breakouts-busts-sleepers-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/13/5c1a00c3-f4f7-4642-9cfd-e352803a4b40/thumbnail/1200x675/ffed61219a28410e074a469e75ac57d3/jordan-poole-pelicans-getty-images.jpg",
    "tag": "Sports",
    "date": "2025-10-14T20:37:05.000Z",
    "description": "\nThe 2025-26 NBA season is just over a week away as the action tips on Tuesday, Oct. 21 with a two-game slate of Rockets vs. Thunder and Warriors vs. ",
    "body": "\nThe 2025-26 NBA season is just over a week away as the action tips on Tuesday, Oct. 21 with a two-game slate of Rockets vs. Thunder and Warriors vs. Lakers. That means the 2025 Fantasy basketball rankings are beginning to solidify, with the latest Fantasy basketball ADP listing Nikola Jokic, Shai Gilgeous-Alexander and Victor Wembanyama as the top consensus picks. Veterans such as Giannis Antetokounmpo, Luka Doncic and Anthony Edwards are also popular first-round picks. LeBron James has an ADP of No. 21 as he's set to miss a few weeks with sciatica on his right side. Can you trust those Fantasy basketball picks at the top of drafts, and which Fantasy basketball sleepers, breakouts and busts do you need to be aware of? Before making any 2025-26 Fantasy basketball picks, be sure to check out the 2025 Fantasy basketball rankings and cheat sheets from the proven computer model at SportsLine.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. SportsLine's proven model simulates each season 10,0000 times. This model is powered by the same people who powered projections for all three major Fantasy sites. These cheat sheets and rankings, available for leagues on many major sites, are updated multiple times every day. Last year the model called a breakout season for Stephon Castle, predicting that he would finish 25 spots ahead of consensus ADP at his position. The result: Castle won NBA Rookie of the year honors after averaging 14.7 points, 4.1 assists and 3.7 rebounds per game and finished as the No. 51 guard in average Fantasy points per game. The model also nailed James Harden as a sleeper last year before he put together his first All-Star season in three years and called Paolo Banchero's and Victor Wembanyama's breakout seasons before they went on to win NBA Rookie of the Year honors as well.Now, SportsLine has simulated the entire NBA season 10,000 times and released its latest Fantasy basketball rankings 2025-26, along with plenty of sleepers, breakouts and busts. Head to SportsLine now to see these 2025-26 Fantasy basketball rankings.   Top 2025 Fantasy basketball sleepers  One of the top 2025 Fantasy basketball sleepers the model is predicting: Bucks guard Kevin Porter Jr. After spending the 2023-24 season out of the league, Porter joined the Clippers last season before being acquired by Milwaukee at the trade deadline. He proceeded to become one of the Bucks most consistent players, averaging 11.7 points and 3.7 assists in just 19.9 minutes, and over his last five games of the season, Porter put up 20.2 points, 6.6 rebounds, 6.2 assists and 2.8 steals. Porter should see a huge jump in playing time this year with the injury and subsequent trade of Damian Lillard.Porter is penciled in to be Milwaukee's starting point guard, and outside of Giannis Antetokounmpo, no other player on the Bucks' 2025-26 roster averaged more than 2.9 assists last year. Thus, the team will need both his ball-handling and playmaking skills, and Porter has already shown he can produce when given ample minutes. In the 2022-23 season with Houston, he was one of just five NBA players to average at least 19 points, five rebounds, five assists and 1.4 steals per game. He is someone whose production should far exceed his 2025 Fantasy basketball ADP of 93. See more Fantasy basketball sleepers 2025 here. Top 2025 Fantasy basketball breakouts  One of the 2025 Fantasy basketball breakouts the model has identified: Jazz point guard Isaiah Collier, who has an ADP of 137. The No. 1 ranked prospect in the Class of 2023, Collier starred at USC for one season before being the 29th overall pick by Utah in 2024. He began as a backup but then wrestled the starting job away from Keyonte George, who was an All-Rookie selection the year prior. Collier really hit his stride towards the end of the season and averaged 15.9 points and 7.1 assists over his final seven games of his rookie year.Already one of the league's youngest teams, Utah then jettisoned vets Jordan Clarkson, Collin Sexton and John Collins in the offseason as it has fully embraced a youth movement. Thus, the 21-year-old Collier should have no shortage of opportunities, and he plays in an offense conducive for lots of stats. The Jazz ranked fifth in pace last season as they want to utilize those young legs to their advantage. The model slots Collier ahead of Klay Thompson and Jalen Suggs, despite those two being drafted earlier on average. Identify other Fantasy basketball breakouts 2025 here. Top 2025 Fantasy basketball busts As for players to avoid, the model lists Pelicans guard Jordan Poole as a Fantasy basketball bust. Poole was one of the major pieces in a trade between the Wizards and Pelicans in the offseason. The 26-year-old now goes to New Orleans, where he'll have to be a bit more of a complimentary player to Zion Williamson. New Orleans also brings in two lottery picks -- Derik Queen and Jeremiah Fears -- so Poole could lose some of his scoring opportunities as the season progresses. Poole is being picked in the seventh round, according to the latest ADP, but SportsLine's model has players such as Jrue Holiday and Immanuel Quickly, both of whom are being picked later, as better values. Avoid these 2025 Fantasy basketball busts as well. How to find proven 2025-26 Fantasy basketball rankings SportsLine is also extremely high on a surprising forward you aren't even thinking about being taken in the early rounds of 2025 Fantasy basketball drafts. This player is a top-3 Fantasy option at his position and is ranked ahead of stars like Kevin Durant and Paolo Banchero. You can only see who it is, and the 2025 Fantasy basketball rankings for every player, at SportsLine.So which 2025-26 Fantasy basketball sleepers, breakouts and busts should you target and fade, and which forward shocks the NBA as a top-3 player in positional rankings? Visit SportsLine now to get 2025-26 Fantasy basketball cheat sheets for every single position, all from the model that's nailed its Fantasy basketball picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy basketball rankings, picks 2025: Sleepers, breakouts, busts - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/13/5c1a00c3-f4f7-4642-9cfd-e352803a4b40/thumbnail/1200x675/ffed61219a28410e074a469e75ac57d3/jordan-poole-pelicans-getty-images.jpg"
      ],
      "datePublished": "2025-10-14T20:37:05.000Z",
      "dateModified": "2025-10-14T20:37:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Model reveals college football picks, best bets for Tuesday, Oct. 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-week-8-college-football-free-bets-betting-odds-picks-south-alabama-liberty-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/5daa97d7-0d36-4b96-824f-331c39e90adc/thumbnail/1200x675/a1931b16034a05bcd6bb6973752b5a1f/bishop-davenport.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:48:35.000Z",
    "description": "\n        Week 8 of the college football schedule begins with three games being played on Tuesday, Oct. 14. The Liberty Flames (2-4) and the New Mexico",
    "body": "\n        Week 8 of the college football schedule begins with three games being played on Tuesday, Oct. 14. The Liberty Flames (2-4) and the New Mexico State Aggies (3-2) link up in a Conference USA showdown at 7 p.m. ET. According to the latest Week 8 college football odds, the Flames are favored by 10 points at home, while the over/under for total points scored is 48.5. SportsLine's model is backing Liberty to cover the spread in 56% of simulations. The highest over/under on Tuesday's CFB schedule is 58.5 points in Arkansas State vs. South Alabama (7:30 p.m. ET)The model is also backing Western Kentucky (-9.5) to cover the spread at home against FIU, while South Alabama (-7.5) covers the spread against Arkansas State. Before locking in your Week 8 college football picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also target the all-new DraftKings promo code, which offers $300 in bonus bets if their first $5 wager wins and three months free of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns, and new users can also target the BetMGM bonus code, which offers up to $1,500 in bonus bets if your first bet loses:Week 8 college football best bets for Tuesday, Oct. 14 (odds subject to change): New Mexico State vs. Liberty (-10) FIU vs. Western Kentucky (-9.5) Arkansas State vs. South Alabama (-7.5)Combining the model's three picks into a Week 8 college football parlay would result in a payout of +612 (risk $100 to win $612). Bet it now at Caesars Sportsbook: New Mexico State vs. Liberty (-10)The Flames were able to snap their four-game losing streak in their last contest, defeating UTEP 19-8. Liberty's rushing attack is averaging 166 yards per game, led by sophomore running back Evan Dickens, who has 344 rushing yards and two scores this season. Freshman running back Caden Williams has added 246 rushing yards and is another player who can wear out a defense. This season, New Mexico State is 0-2 ATS as the away underdog and road team. SportsLine's model has the Flames covering the spread in 56% of simulations. Bet Liberty at DraftKings Sportsbook, where new users can get three free months of NBA League Pass and $300 in bonus bets:FIU vs. Western Kentucky (-9.5)FIU has dropped two consecutive games, while Western Kentucky is on a three-game win streak. The Hilltoppers are 3-0 ATS as the home team and 4-0 ATS as the favorite. As for FIU, they are 0-1 ATS in their lone conference game this season. The Hilltoppers have won five straight games over the Panthers, with each of the last four being by double-digits. SportsLine's model is backing Western Kentucky to cover the spread in 63% of simulations, targeting the Hilltoppers as one of its top Week 8 college football picks. Bet it at FanDuel, where new users get $300 in bonus bets with a winning $5 wager:Arkansas State vs. South Alabama (-7.5)Arkansas State (2-4) and South Alabama (1-5) both have struggled this season. Conference games are always tougher, and the Jaguars have won five of the last six games over the Red Wolves. The last four victories have been by at least seven points. South Alabama junior quarterback Bishop Davenport has thrown for 1,093 passing yards and nine passing touchdowns this season, and the model believes the Jaguars cover the spread in 55% of simulations. Bet it at Caesars here:Want more Week 8 college football picks?You've seen the model's Week 8 college football best bets for Tuesday. Now, get against the spread, total and money line picks for every Week 8 CFB game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model reveals college football picks, best bets for Tuesday, Oct. 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/5daa97d7-0d36-4b96-824f-331c39e90adc/thumbnail/1200x675/a1931b16034a05bcd6bb6973752b5a1f/bishop-davenport.jpg"
      ],
      "datePublished": "2025-10-14T21:48:35.000Z",
      "dateModified": "2025-10-14T21:48:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Haji Wright, Cristian Roldan ace USMNT auditions, offer optimism for USA soccer eight months before World Cup - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/haji-wright-cristian-roldan-ace-usmnt-auditions-offer-optimism-for-usa-soccer-eight-months-before-world-cup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/f137f46d-839b-49a4-9ef2-c8a9534e0a58/thumbnail/1200x675/d56e04e98f4018026c0aba4dc809ff0e/haji.jpg",
    "tag": "Sports",
    "date": "2025-10-15T03:21:17.000Z",
    "description": "\n        COMMERCE CITY, Colo. – Eight months before the opening whistle blows at the World Cup, every friendly is essentially a live audition for all ",
    "body": "\n        COMMERCE CITY, Colo. – Eight months before the opening whistle blows at the World Cup, every friendly is essentially a live audition for all the world to see, and on Tuesday against Australia, U.S. men's national team head coach Mauricio Pochettino embraced the spirit of experimentation completely. He made six changes to the starting lineup from Friday's 1-1 draw with Ecuador and was forced to make a seventh when Christian Pulisic came off with an injury in the first half. It was a golden opportunity for those players despite the imperfect situation of playing without the team's star player, and the results were understandably mixed. Make no mistake, though – a few winners emerged from the USMNT's 2-1 win over Australia on Tuesday, offering new signs of optimism for the World Cup hosts in the process.The one indisputable winner in the Denver suburbs on Tuesday night was forward Haji Wright, who scored twice in his first start for the national team since Pochettino took the helm a year ago. His absence was not because he was out of favor but rather the unlucky result of injuries, though he returned to the national team in arguably the form of his – the versatile forward has nine goals in 11 games for Coventry City this season, hopes high that he would translate that form to the USMNT at a crucial time in the group's World Cup preparations.Wright did just that on Tuesday with two impressive goals, ones that showcase his unique instincts as a goalscorer. Wright was on the receiving end of an impressive ball from midfielder Cristian Roldan for his first and opted to almost run ahead of the ball, catching Australia's defense by surprise as he poked the ball into the back of the net. The second, in which Wright connected again with Roldan, saw Wright outrun an opposition player and then slip behind him for a perfect, unobstructed shot on goal.Wright's trajectory nearly matches that of Folarin Balogun's, who himself spent nearly the entirety of Pochettino's first year in charge away with injury but has two goals and one assist in four games since returning in September. While Balogun may have had a chance to stake his claim first on a starting role, Wright's performance on Tuesday just might create a sense of competition that has been missing in that particular position for years – and exemplifies the competitive edge Pochettino has fostered within the expanded player pool, a year into the job.\nBalogun and Wright's recent contributions lend a real helping hand to the USMNT's overall attacking efforts, which have yet to fully click in the midst of Pochettino's ongoing rebuild of the side. Against Ecuador and in September's 2-0 win over Japan, the U.S. generated promising opportunities but were unable to finish them at times, while against Australia, their meaningful opportunities were almost few and far between as they faced another uber-defensive opponent. Balogun and Wright found ways to overcome those challenges even if there is room for improvement, while the assists from Malik Tillman on Balogun's goal against Ecuador and Roldan's pair for Wright against Australia signal that some things are, in fact, working. In October, the group also managed to find goals without Pulisic on the field for all but the 30-minute sliver of time he played on Tuesday, another sign that things just may be trending in the right direction.Roldan came out as another big winner on Tuesday, charting an unlikely journey back into the USMNT's good graces. Like Wright, he was a member of the U.S.' 2022 World Cup team but in the years since, the 30-year-old's national team profile faded until a surprise late call-up for September's friendlies against South Korea and Japan. He returned to the fold for a second international break in a row and has now played an important role in the USMNT's last two victories, bolstered by the fact that Pochettino's new-look tactical approach, rooted in building out of the back with three center backs, is exactly how Roldan is used to playing at the Seattle Sounders.Wright and Roldan provided a lot of upside for the USMNT against Australia, almost making up for the mistakes that the hosts' defense made at different points during the game. The entire group – this time made up of goalkeeper Matt Freese, center backs Chris Richards, Miles Robinson and Mark McKenzie and midfielder James Sands in front of them – were caught ball-watching on Jordan Bos' goal for Australia, and they were caught sleeping at the start of the second half. It will perhaps come as no surprise that the USMNT are better with Tyler Adams on the field, even if it is bad news for Sands, while it may be less encouraging that the U.S.'s best defensive performances so far have come when Tim Ream is on the field.\nA mixed bag, though, is to be expected from a series of auditions, no matter the looming deadline of the World Cup. As far as Pochettino's audition process went on Tuesday, though, the head coach may have just found a pair of new leads for his show.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Haji Wright, Cristian Roldan ace USMNT auditions, offer optimism for USA soccer eight months before World Cup - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/f137f46d-839b-49a4-9ef2-c8a9534e0a58/thumbnail/1200x675/d56e04e98f4018026c0aba4dc809ff0e/haji.jpg"
      ],
      "datePublished": "2025-10-15T03:21:17.000Z",
      "dateModified": "2025-10-15T03:21:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arkansas' John Calipari says he would retire before becoming 'transactional' in NIL, transfer portal era - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/arkansas-john-calipari-says-he-would-retire-before-becoming-transactional-in-nil-transfer-portal-era/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/b725de13-2c64-410f-a1ce-7dadb41c77cd/thumbnail/1200x675/c52344f4a0d8f7a05e40c0f0e2245381/gettyimages-2204931028-1.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:51:54.000Z",
    "description": "\n        This season marks 34 years on the college basketball sidelines for Arkansas coach John Calipari. With other old-guard coaches backing out of ",
    "body": "\n        This season marks 34 years on the college basketball sidelines for Arkansas coach John Calipari. With other old-guard coaches backing out of the sport by the year, those unable or unwilling to fully embrace the NIL and revenue-sharing era could soon be extinct. And Calipari made it clear at SEC Media Days Tuesday that he is part of that contingent.Imminent retirement may not be on the table for the three-time National Coach of the Year, but if his methodology proves untenable, he said that is when he would call it a career.\"I want to help 25 to 30 more families,\" Calipari said. \"The only way you do that is you're transformational as a coach. You're not transactional. If I become transactional -- I'm going to pay you this to do this and that -- then I won't do this anymore. I don't need to.\"\n        \n            \n                College basketball rankings: Each AP Top 25 team's strengths, weaknesses and depth chart entering 2025-26\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \nCalipari's final years at Kentucky came with a clear ceiling, and many attributed the early-round NCAA Tournament exits to his staunch commitment to an outdated model. Calipari was as successful as they came when recruiting one-and-done elite high school prospects was a surefire method to reach the Final Four. But as the transfer portal led teams to stock up on veteran standouts and resulted in experienced teams winning championships, Calipari fell behind.\"I think all of those said I've done what I do, and I'm not willing to do 'all this' to stay in the profession,\" said Calipari. \"If you watched us in practice, you would say, 'He's still connected.' I'll know before anybody else that it's transactional now. That's why if someone put their name in the portal, I said, 'You're not coming back,' because it's not going to be transactional. If this is what you want, let's go, let's work together.\"\nMost first-year coaches load up on transfer talent to construct their debut rosters. Despite inheriting an empty locker room at Arkansas, Calipari took just two transfers from programs not named Kentucky. High school recruits, and those who followed him from his old school, made up his Sweet 16 squad.One of the \"transactional\" elements of college basketball with which Calipari says he disagrees is the constant transferring from program to program in search of paydays. Players who seek to use every last ounce of their eligibility to capitalize on their earnings potential also do not fit into the Calipari model. The second-year Razorbacks coach wants to reform those realities at a sport-wide level.\"Part of the reason I'm still doing this, my son is in coaching,\" said Calipari. \"We've gotta fix some of this stuff before we're out for our own children. Right now, the things we're dealing with, we want to put it to other people, but the thing is filtered down to the coach and coaches. …\n\"Why would kids want to stay in school five extra years? For money. Well, we've gotta say 'You've got five years to play four, and that's it. That's all.' If we get those two things in order, we're on the path to being better.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arkansas' John Calipari says he would retire before becoming 'transactional' in NIL, transfer portal era - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/b725de13-2c64-410f-a1ce-7dadb41c77cd/thumbnail/1200x675/c52344f4a0d8f7a05e40c0f0e2245381/gettyimages-2204931028-1.jpg"
      ],
      "datePublished": "2025-10-14T21:51:54.000Z",
      "dateModified": "2025-10-14T21:51:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Bregman to opt out of Red Sox deal, enter MLB free agency, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/alex-bregman-to-opt-out-of-red-sox-deal-enter-mlb-free-agency-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/4cc0976b-f3cb-4ffc-b77c-7e0aad5758af/thumbnail/1200x675/5b410f32682d94f3e7c1a4069731034d/alex-bregman-getty-3.png",
    "tag": "Sports",
    "date": "2025-10-15T01:31:45.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Veteran infielder Alex Bregman will be opting out ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Veteran infielder Alex Bregman will be opting out of his contract the Boston Red Sox and becoming a free agent this coming offseason, the New York Post reports. Bregman, 31, is coming off a highly productive 2025 season for Boston in which he slashed .273/.360/.462 (128 OPS+) with 18 home runs and 28 doubles. Although he was limited to 114 games played because of a serious quad strain, Bregman still managed a WAR of 3.5 for the season. He earned his third career All-Star selection. For his career, Bregman boasts an OPS+ of 132 and a WAR of 43.1 across parts of 10 MLB seasons. \nLast winter, Bregman turned down a higher offer from the Detroit Tigers in order to sign a shorter-term deal with the Red Sox. That deal paid him $36.67 million for 2025 and includes $41.67 million salaries for both 2026 and 2027 with opt-outs after each of those seasons. Since Bregman on a rate basis enjoyed his best offensive season since 2022, he and agent Scott Boras are betting he'll have a healthier market in the coming 2025-26 offseason. \nThat upcoming free-agent class includes position players like Kyle Tucker, Pete Alonso, Bo Bichette, and Kyle Schwarber. However, at third base -- Bregman's primary position this past season -- only Eugenio Suárez stands out. Boston figures to make an effort to bring Bregman back for 2026 and beyond, and other teams possibly in need of help or upgrades at third base include the Tigers, Seattle Mariners, Toronto Blue Jays, New York Mets, Philadelphia Phillies, and Texas Rangers. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Bregman to opt out of Red Sox deal, enter MLB free agency, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/4cc0976b-f3cb-4ffc-b77c-7e0aad5758af/thumbnail/1200x675/5b410f32682d94f3e7c1a4069731034d/alex-bregman-getty-3.png"
      ],
      "datePublished": "2025-10-15T01:31:45.000Z",
      "dateModified": "2025-10-15T01:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Portland Fire coaching hire: WNBA expansion team to hire Alex Sarama from Cleveland Cavaliers, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/portland-fire-coaching-hire-wnba-expansion-team-to-hire-alex-sarama-from-cleveland-cavaliers-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/0a9bad17-0b08-4842-bb98-11ba94caab5f/thumbnail/1200x675/28a38f30305ede6e311f29ca8940a73c/untitled-design-62.png",
    "tag": "Sports",
    "date": "2025-10-15T02:13:18.000Z",
    "description": "\n        The Portland Fire are expected to hire Alex Sarama as the first coach in franchise history, according to Annie Costabile of Front Office Spor",
    "body": "\n        The Portland Fire are expected to hire Alex Sarama as the first coach in franchise history, according to Annie Costabile of Front Office Sports. The Portland Supporter first reported Tuesday that the Fire had inadvertently announced Sarama's hiring on their LinkedIn page before it was swiftly deleted. Sarama is currently an assistant coach with the Cleveland Cavaliers, having previously served as the team's director of player development. Prior to joining the Cavs, Sarama was an assistant coach and director of player development for the Rip City Remix, the Portland Trail Blazers' G League affiliate. Sarama, who hails from England, also worked with Paris Basketball and the London Lions earlier in his career. Outside of his work with professional teams, Sarama founded Transforming Basketball in 2023 with a mission to \"transform the basketball world by helping individuals and organizations make sense of an evidence-based approach.\" Sarama is a leading proponent of Constraints-Led Approach, or CLA, a method of training that is taking the sports world by storm. Here is a quick explanation of CLA, via The Athletic's Jared Weiss last month:\"The CLA takes the ground-up approach of block training, which eliminates the infinite variables that affect athletes in the heat of competition, and flips it on its head.\"That means putting players into scenarios with different limitations called \"constraints\" to simulate the unpredictable environment of an actual game. Whether it's the number of steps they can take, the area of the playing surface from which they are allowed to maneuver or even the weight of the ball they are using, players are repeatedly told to overcome restrictions to accomplish a task. While painstakingly working through mistakes, they are forced to find advantageous opportunities, \"affordances\" in CLA parlance.\"With the Cavaliers, Sarama designed practices and individual development plans for players, and played a major role in the team's leap from 48 wins in 2024 to 64 wins in 2025 with largely the same roster. The Fire will hope that Sarama, or \"Professor Alex,\" as he came to be known with the Cavaliers, can have the same impact in Portland as their journey as a franchise begins. \nThis is not the first time that the Fire have had a mishap with a major announcement. In June, a month before their branding was officially announced, trademark applications for the \"Portland Fire\" and related logos were published by Sean Highkin of The Rose Garden Report. The Fire were officially introduced as the WNBA's 15th team in September of 2024, and will begin play next season as part of the league's expansion push. The first incarnation of the Fire lasted from 2000-02 before the team folded due to financial issues. \"As a city that has long championed women's sports, Portland is ready to reclaim its place in the WNBA and reignite its connection to the game on the world stage,\" Clare Hamill, the team's interim president, said in July. \"We are thrilled to complete the journey of bringing professional women's basketball back to the Rose City, while honoring the legacy of the original franchise to blaze a new, bold path forward.\"Prior to reportedly hiring Sarama, the Fire have been building out their front office. Inky Son, their first president, was suddenly fired in June, after just three months on the job. Hamill, a long-time Nike executive was hired as her replacement on an interim basis and remains in the role. In August, the team announced it had hired Vanja Černivec as their general manager. Černivec previously worked with the Golden State Valkyries as their vice president of basketball operations, and helped them have the best inaugural season by an expansion club in league history in 2025. On Tuesday, the Fire also announced the hiring of Ashley Battle as vice president of basketball operations, strategy and innovation. Battle played in the WNBA from 2005-2010 and most recently worked as a scout for the Boston Celtics and a television commentator for the Connecticut Sun.\nThe next step for the Fire will be their expansion draft, but it's unclear when that will happen, or how it will work with the Toronto Tempo also entering the league next season. Expansion draft rules have to be collectively bargained, so the league cannot set a date until a new collective bargaining agreement is in place. If the expansion draft ends up being delayed due to the contentious labor battle between the WNBPA and the WNBA, that could actually benefit Hamill, Černivec and Sarama, who would have more time to prepare. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Portland Fire coaching hire: WNBA expansion team to hire Alex Sarama from Cleveland Cavaliers, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/0a9bad17-0b08-4842-bb98-11ba94caab5f/thumbnail/1200x675/28a38f30305ede6e311f29ca8940a73c/untitled-design-62.png"
      ],
      "datePublished": "2025-10-15T02:13:18.000Z",
      "dateModified": "2025-10-15T02:13:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavericks, Jason Kidd agree to multi-year contract extension ahead of coach's fifth season in Dallas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/mavericks-jason-kidd-agree-to-multi-year-contract-extension-ahead-of-coachs-fifth-season-in-dallas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/154b99a5-7dd9-4e7b-931e-11deed1537d3/thumbnail/1200x675/91dbebbd4d266e51b56b41deec25c5b1/usatsi-27315171.jpg",
    "tag": "Sports",
    "date": "2025-10-14T23:43:38.000Z",
    "description": "\n        The Dallas Mavericks and coach Jason Kidd have agreed to a multi-year contract extension, the team announced Tuesday. The agreement comes jus",
    "body": "\n        The Dallas Mavericks and coach Jason Kidd have agreed to a multi-year contract extension, the team announced Tuesday. The agreement comes just over a week before the team's season opener against the San Antonio Spurs. Terms of the deal were not disclosed. Kidd, 52, served as Mavericks coach for the last four seasons and posted a 179-149 record over that span. That includes a trip to the 2024 NBA Finals, where Dallas lost to the Boston Celtics in five games. Prior to his time in Dallas, he spent two seasons as a Lakers assistant after three-plus seasons with the Milwaukee Bucks, where he went 139-152. He got his coaching start in 2013-14 with the Brooklyn Nets, where he went 44-38 in one season before being traded to Milwaukee.Kidd became the subject of several coaching search conversations over the past few years, and the Mavericks denied the New York Knicks a chance to interview him for their vacancy earlier this offseason.\n        \n            \n                NBA coach rankings: All 30 coaches split into eight tiers as 2025-26 season begins\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nA Hall of Fame inductee as a player in 2018, Kidd faces a big season with the Mavericks. Dallas stunningly dealt away Luka Doncić to the Los Angeles Lakers in early February 2025, receiving Anthony Davis, among others, in return. The trade was widely panned, and things went from bad to worse in Dallas when Davis was injured in his team debut and Kyrie Irving later tore his ACL. The injury-ravaged Mavericks finished 39-43 and got into the Play-In Tournament, where they beat the Sacramento Kings but lost to the Memphis Grizzlies with a playoff berth on the line.\nThen the Mavericks' fortunes miraculously reversed when they won the NBA Draft lottery despite having just a 1.8% chance to do so. That allowed Dallas to select Cooper Flagg, the consensus player of the year at Duke last season who has already impressed in the preseason.With Flagg in the fold alongside Davis, Dereck Lively II and Daniel Gafford, the Mavericks figure to have a fearsome frontcourt defense, with Klay Thompson and Max Christie among key wings returning. Free agent signee D'Angelo Russell will be the team's lead ballhandler until Irving returns, if Irving returns at all this season.\nDallas is slightly favored to miss the playoffs (-138) at FanDuel Sportsbook, though if things go well health-wise and Flagg can make an immediate impact, the team will likely field one of the NBA's best defenses and contend for the postseason.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavericks, Jason Kidd agree to multi-year contract extension ahead of coach's fifth season in Dallas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/154b99a5-7dd9-4e7b-931e-11deed1537d3/thumbnail/1200x675/91dbebbd4d266e51b56b41deec25c5b1/usatsi-27315171.jpg"
      ],
      "datePublished": "2025-10-14T23:43:38.000Z",
      "dateModified": "2025-10-14T23:43:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 7 NFL score predictions, best bets today: Betting expert reveals picks for all 15 games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-score-predictions-week-7-bets-odds-expert-picks-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/83dc278b-2929-41ba-9758-e19df826f8f1/thumbnail/1200x675/4e76ed4d107f92830cb4d7b4af4ccead/justin-jefferson-minnesota-vikings-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-15T00:10:38.000Z",
    "description": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been ravin",
    "body": "\n        Through six weeks of the NFL season, it's hard to find a team who doesn't have a serious question mark. Two weeks ago, we would've been raving about the undefeated Eagles and Bills. Now both teams have lost two straight games. How about Lamar Jackson and the Ravens, one of the preseason favorites? With Jackson having been out each of the last two weeks, Baltimore enters its bye week 1-5 and is in serious danger of missing the postseason. Even the three-time defending AFC champion Chiefs aren't immune. They sit 3-3 heading into a Week 7 home date with AFC rival Las Vegas.Which teams would you take today to make the Super Bowl? Before the contenders start to separate from the pretenders, unpredictability in the NFL will continue to reign supreme. Week 7's 15 game slate should tell us plenty. Before making any Week 7 NFL picks, be sure to see the exact NFL score predictions from SportsLine expert Eric Cohen.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:A SportsLine expert and host, Cohen is evaluating the entire Week 7 NFL slate and delivers score predictions and logic for each matchup. He finished the 2024-25 season with a 190-95 record on straight-up NFL betting picks (69%) and was profitable for bettors. He's 60-32-1 (65%) on straight-up picks so far this season. Anyone who followed Cohen's NFL predictions has been profitable at their favorite sports betting sites and betting apps. You can only see Cohen's Week 7 NFL exact score predictions at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 7 NFL picksAfter diving into all 15 games on the NFL Week 7 schedule, Cohen likes the Vikings (+2.5, 43.5) to send the defending champion Eagles to their third straight loss.\"I think it's fair to call this game a must win for Philadelphia coming off two straight losses. We've already seen one eastern Pennsylvania team fire a successful head coach (Penn State, James Franklin), and while I don't think Nick Sirianni's job is in imminent danger considering he most recently won the Super Bowl, a third straight loss will turn up the heat a bit. Coming off a bye week and with a brutal stretch ahead, this game might be a must win for Minnesota as well. This is the type of game where I would bet both sides +7.5 at something like -125 odds and prepare for a close game no matter who wins. My coin flip says Philly's misery continues for another week. Vikings 23, Eagles 21\". See his other Week 7 football score predictions at SportsLine.How to make Week 7 NFL score predictionsIn addition, Cohen is picking one game to fly over the projected total. You can see who it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for just $1.Who wins every Week 7 NFL game, and which game is a must bet for the over? Visit SportsLine now to get Eric Cohen's NFL Week 7 score predictions, all from the NFL expert who has nailed 65% of his NFL straight-up picks this season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 7 NFL score predictions, best bets today: Betting expert reveals picks for all 15 games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/83dc278b-2929-41ba-9758-e19df826f8f1/thumbnail/1200x675/4e76ed4d107f92830cb4d7b4af4ccead/justin-jefferson-minnesota-vikings-imagn-images.jpg"
      ],
      "datePublished": "2025-10-15T00:10:38.000Z",
      "dateModified": "2025-10-15T00:10:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Al Horford explains why he left Celtics for Warriors, role Jayson Tatum's injury played in the decision - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/al-horford-explains-why-he-left-celtics-for-warriors-role-jayson-tatums-injury-played-in-the-decision/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/8dc89be3-4c94-4971-90de-8c92cf497ee2/thumbnail/1200x675/48e2aba6f1f4762a59f0756a9c649fb8/adobe-express-file-19.jpg",
    "tag": "Sports",
    "date": "2025-10-15T00:06:47.000Z",
    "description": "\n        Al Horford stood in limbo for the majority of the NBA offseason as an unrestricted free agent. In the end, the longtime Boston Celtics stando",
    "body": "\n        Al Horford stood in limbo for the majority of the NBA offseason as an unrestricted free agent. In the end, the longtime Boston Celtics standout made a difficult decision to sign elsewhere. He agreed in late September to a two-year deal with the Golden State Warriors, ending his second stint in Boston, where he won the first championship of his career. The decision was twofold, said Horford, who indicated that he and the Celtics had different priorities for the 2025-26 season.This late in Horford's career, opportunities to add another championship ring are dwindling. He already reached the mountaintop with the Celtics, but with Jayson Tatum set to miss at least the majority, if not all, of the upcoming campaign with a torn Achilles tendon, Horford's best chance of winning another title may not be in Boston.\n        \n            \n                Warriors vs. Lakers: Stephen Curry's synergy with Al Horford immediately on display in preseason opener\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \n\"There was two things there,\" Horford, 39, said to The Athletic. \"I think the financial part was a component, but more than that, it was the winning part of it, trying to contend for a championship. And I think there was a lot of things up in the air -- and it just felt like they weren't in that same vision, obviously, because JT getting hurt, that takes a big toll. Up until then I was staying in Boston the whole time.\"The Celtics were in a tricky spot financially this offseason because of the second apron. They traded Kristaps Porziņġis and Jrue Holiday in salary-shedding moves and watched as key reserve Luke Kornet walked in free agency. The talent exodus was in many ways a necessity.\nBecause of those departures and Tatum's potential to miss the entire season, the Celtics project to take a step backward from their perennial spot in the Eastern Conference's upper echelon.\"I think once that offseason happened and it started to progress, it became clear to me the team had different priorities,\" Horford said. \"Obviously, getting rid of Jrue, getting rid of Kristaps. And I know it's all salary stuff, but it was like a domino effect, and it was tough for me.\"Horford's exit is another blow to the Celtics, whose frontcourt became thinner with each departure. He left a legacy across two stints with the franchise as an integral part of the 2024 championship run and one of the NBA's top defenders on an annual basis. He remained highly prominent in the Celtics' lineup even at age 38.\nGolden State is, on paper, a terrific landing spot for Horford. He was everything the Celtics needed him to be, and he should fit just as well with the Warriors because of his defensive versatility and ability to step outside the 3-point line on the other end of the floor.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Al Horford explains why he left Celtics for Warriors, role Jayson Tatum's injury played in the decision - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/8dc89be3-4c94-4971-90de-8c92cf497ee2/thumbnail/1200x675/48e2aba6f1f4762a59f0756a9c649fb8/adobe-express-file-19.jpg"
      ],
      "datePublished": "2025-10-15T00:06:47.000Z",
      "dateModified": "2025-10-15T00:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FIU vs. Western Kentucky odds, picks, predictions from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/fiu-western-kentucky-prediction-odds-spread-week-8-tuesday-college-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/5cfccfef-b73a-44e9-b08f-547fa7364d81/thumbnail/1200x675/046c891362d742852d3dfa90d91603f2/cameron-flowers-western-kentucky-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-14T22:30:08.000Z",
    "description": "\n        Conference USA foes will face off in college football Week 8 as the Western Kentucky Hilltoppers will host the Florida International Panthers",
    "body": "\n        Conference USA foes will face off in college football Week 8 as the Western Kentucky Hilltoppers will host the Florida International Panthers on Tuesday. The Panthers (2-3, 0-1) are coming out of their bye week and looking to rebound after losing 51-10 to UConn their last time out. Meanwhile, the Hilltoppers (5-1, 3-0) have won three straight, mostly recently defeating Delaware 27-24 in Week 6. Kickoff from Houchens Industries-L. T. Smith Stadium is set for 8 p.m. ET on Tuesday. The Hilltoppers are 10-point favorites in the latest FIU vs. Western Kentucky odds, and the over/under for total points scored is 55.5. Before making any Western Kentucky vs. FIU picks, be sure to see what the SportsLine projection model has to say.  New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has zeroed in on Western Kentucky vs. FIU. You can head to SportsLine now to see its picks. Here are several college football odds and betting lines for FIU vs. WKU in Week 8:FIU vs. Western Kentucky spreadWestern Kentucky -10 at DraftKings SportsbookFIU vs. Western Kentucky over/under55.5 pointsFIU vs. Western Kentucky money line WKU -379, FIU +299FIU vs. Western Kentucky picksSee picks at SportsLineFIU vs. Western Kentucky streaming Fubo (Try for free)  Why FIU can coverThe Panthers have covered the spread three times this season. That includes covering as 42-point underdogs against Penn State in Week 2. FIU's run game is generating 147.8 average yards per game, with senior running back Kejon Owens averaging 6.1 yards per carry with 463 total yards and five touchdowns on the ground. He could keep the score close on Tuesday against a Western Kentucky rush defense that allows the second-most yards on the ground (195.8). FIU is also strong at defending against the rush, which can help limit a hot Western Kentucky offense. See which team to back at SportsLine. Why Western Kentucky can coverThe Hilltoppers are 3-0 and 2-1-0 ATS in their last three meetings with the Panthers, outscoring FIU 148-47 over that span. Western Kentucky is 5-1-0 ATS on the season, even covering as a 27.5-point favorite in Week 1. The defense is allowing 394.8 total yards per game but just 22.8 points, while the offense makes up ground by averaging a conference-leading 429.5 total yards and 33.7 points per outing. Hilltoppers quarterback Maverick McIvor leads Conference USA with 1,704 passing yards and a 12-2 TD-INT ratio, and he could go off against an FIU defense that struggles to contain the pass. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Western Kentucky vs. FIU picksFor FIU vs. Western Kentucky in Week 8, the model is leaning under the total, and also says one side of the spread hits in almost 60% of simulations. See what it is at SportsLine.Who wins FIU vs. Western Kentucky, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Western Kentucky vs. FIU spread you need to jump, all from the model that is a combined 39-27 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIU vs. Western Kentucky odds, picks, predictions from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/5cfccfef-b73a-44e9-b08f-547fa7364d81/thumbnail/1200x675/046c891362d742852d3dfa90d91603f2/cameron-flowers-western-kentucky-imagn-images.jpg"
      ],
      "datePublished": "2025-10-14T22:30:08.000Z",
      "dateModified": "2025-10-14T22:30:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHL power ratings: Avalanche lead the pack after Week 1 of 2025-26 season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/nhl-power-ratings-avalanche-lead-the-pack-after-week-1-of-2025-26-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/e9a813b7-5461-4322-ad9c-0af9d9cd57c6/thumbnail/1200x675/94a56bd6ee2641a68e70c5000bcc97a1/avalanche.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:54:51.000Z",
    "description": "\nWith one week of the 2025-26 NHL season in the books, a total of eight teams have yet to suffer a regulation loss. However, only three of those clubs",
    "body": "\nWith one week of the 2025-26 NHL season in the books, a total of eight teams have yet to suffer a regulation loss. However, only three of those clubs played more than two games, and one of them was in action four times. That team is the Colorado Avalanche.Colorado, which has eclipsed the 100-point mark in each of the past four seasons, won three of its first four contests, and its lone blemish was a shootout loss to the Dallas Stars. The Avalanche entered Week 2 with an NHL-high seven points, one more than the two-time reigning Stanley Cup champion Florida Panthers and Boston Bruins.Each week during the season, I'll rank the league's top 10 teams based on both the previous week's performances and their overall bodies of work in 2025-26. I'll also give brief synopsis for each club that explains why they're ranked where they are.Let's dive into the power ratings for Week 1 of the 2025-26 NHL season and highlight a few more teams of note.NHL Week 1 power ratings 1. Colorado Avalanche (3-0-1)The Avalanche allowed just one goal in their victories over the Los Angeles Kings, Utah Mammoth and Buffalo Sabres, and Scott Wedgewood posted a 1.72 goals-against average while playing in all four of the team's games. Offensively, 2024 Hart Trophy winner Nathan MacKinnon has gotten off to a fast start as he is tied for second in the NHL with four goals and shares the league lead in points (eight) with teammate Martin Necas. Both have recorded three multi-point performances, while Cale Makar tops all NHL defensemen with five points. 2. Florida Panthers (3-1-0)The Panthers opened the season with three consecutive victories, defeating the Chicago Blackhawks, Philadelphia Flyers and Ottawa Senators. The most impressive thing about their start was the fact they did it without Matthew Tkachuk, who likely will be sidelined until December following groin surgery, and captain Aleksander Barkov, who figures to miss the entire campaign after undergoing knee surgery. Florida's winning streak ended with Monday's 5-2 loss at Philadelphia, although the club rallied from a 2-0 deficit to forge a tie before allowing the go-ahead goal with less than five minutes remaining in the third period. Brad Marchand and Anton Lundell share the team lead with four points apiece, and both have landed on the scoresheet in each of the Panthers' last three games.3. Boston Bruins (3-1-0)The Bruins also won their first three contests of 2025-26 before dropping a 4-3 decision to the Tampa Bay Lightning on Monday. Boston is tied with Colorado, Florida and the Minnesota Wild for the most goals in the NHL with 13, while David Pastrnak and Pavel Zacha both have registered a tally and four assists to top the club with five points. The Bruins likely won't keep up their scoring pace due to a lack of depth, but it's nice to see them start strong after having missed the playoffs last season for the first time since 2016.4. Nashville Predators (2-0-1)The Predators went on a spending spree last offseason and the return was dismal as they finished 30th in the league, failing to qualify for the postseason for the second time in three campaigns. They began 2024-25 with a five-game losing streak and never were able to get to .500, so seeing them start this season with two wins and an overtime loss to Utah is encouraging. Two-time All-Star Juuse Saros posted a 1.64 GAA as Nashville allowed only five goals over its first three games, while Filip Forsberg and Erik Haula -- who is on his second tour of duty with the club -- recorded a point in each contest.5. Dallas Stars (2-0-0)The Stars gave up four goals in both of their games thus far but came away unscathed, edging the 2024-25 Presidents' Trophy-winning Winnipeg Jets in regulation and Colorado in a shootout. Mikko Rantanen and defenseman Thomas Harley lead the team with four points apiece, while Jason Robertson and Wyatt Johnston both have scored twice. Meanwhile, blue-liner Nils Lundkvist already has three points after registering only five in 39 games last season.6. Carolina Hurricanes (2-0-0)The Hurricanes are just two games into 2025-26 and have three players with multiple goals. One is Seth Jarvis, who tallied twice in the team's season-opening 6-3 triumph over the New Jersey Devils and scored the overtime winner against the Flyers. Defenseman K'Andre Miller also tallied twice versus New Jersey in his debut with Carolina and Taylor Hall converted in both of the team's contests.7. Seattle Kraken (2-0-0)After finishing next-to-last in the Pacific Division last season, the Kraken have won their first two games for the first time in the franchise's brief five-season history. They were strong defensively in those contests, allowing just one goal in victories over the Anaheim Ducks and Vegas Golden Knights. Jared McCann, who was Seattle's goal-scoring leader in each of its first three seasons, scored in both games, netting the winner against Vegas four seconds before overtime was set to conclude.8. Detroit Red Wings (2-1-0)Yes, the Red Wings opened 2025-26 with a 5-1 loss to the Montreal Canadiens. But they bounced back by sweeping a home-and-home series with the Toronto Maple Leafs, who won three of the four meetings between the Atlantic Division rivals last season. Detroit produced nine goals in the wins, with eight different players lighting the lamp. Lucas Raymond tallied twice in Saturday's 6-3 home triumph, while Mason Appleton scored with 45 seconds remaining in the third period at Toronto on Monday to give the Red Wings a 3-2 victory. Captain Dylan Larkin, who shares the team lead in goals with Raymond, notched a point in each of Detroit's first three contests.9. Minnesota Wild (2-1-0)The Wild are tied for the NHL lead in goals thanks to their power play, which was outstanding during the first week of the season. Minnesota went 8-for-17 with the man advantage over its first three games for a ridiculous conversion rate of 47.1% and cashed in seven times on 14 opportunities over its last two contests. Kirill Kaprizov recorded three power-play goals and is tied with teammate Matt Boldy and Jack Eichel of the Golden Knights for third in the NHL with seven points. The 28-year-old Kaprizov is one man-advantage tally away from matching the total he registered in 41 games last season.10. Winnipeg Jets (2-1-0)Winnipeg's top two offensive players in 2024-25 picked up where they left off, landing on the scoresheet in each of the team's first three games this campaign. Kyle Connor, who set a career high with 97 points last season, recorded his seventh hat trick in the NHL in the Jets' season-opening 5-4 loss to Dallas and notched one assist in victories over Los Angeles and the New York Islanders. Mark Scheifele set up each of Connor's goals against the Stars, netted a pair of tallies -- including the winner -- in a 3-2 triumph over the Kings and added an empty-netter in  Monday's 5-2 win versus the Islanders. Morgan Barron (two goals, two assists) also figured in the scoring in each of Winnipeg's contests and is on pace to obliterate the career high of 21 points he set in 2022-23.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHL power ratings: Avalanche lead the pack after Week 1 of 2025-26 season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/e9a813b7-5461-4322-ad9c-0af9d9cd57c6/thumbnail/1200x675/94a56bd6ee2641a68e70c5000bcc97a1/avalanche.jpg"
      ],
      "datePublished": "2025-10-14T21:54:51.000Z",
      "dateModified": "2025-10-14T21:54:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Mexico State vs. Liberty odds, line, picks, predictions, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/liberty-new-mexico-state-prediction-odds-picks-line-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/9b727ba2-f8e3-446e-bc5b-5f7963659521/thumbnail/1200x675/0d3cb07a97be09c191ac7f9e080e7ec3/jamey-chadwell-liberty-flames-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:06:30.000Z",
    "description": "\n        Teams looking to build off of wins clash when the New Mexico State Aggies battle the Liberty Flames in a Conference USA matchup on Tuesday ni",
    "body": "\n        Teams looking to build off of wins clash when the New Mexico State Aggies battle the Liberty Flames in a Conference USA matchup on Tuesday night. New Mexico State downed Sam Houston State 37-10 on Oct. 2, while Liberty topped UTEP 19-8 on Oct. 8. The Aggies (3-2, 1-1 C-USA), who have a minus-3 point differential, are 0-2 on the road this season. The Flames (2-4, 1-1 C-USA), who have a minus-20 point differential, are 1-1 on their home field this year.Kickoff from Williams Stadium in Lynchburg, Va., is at 7 p.m. ET on CBS Sports Network. Liberty leads the all-time series 6-2, including a 30-24 win last season. The Flames are 10.5-point favorites in the latest New Mexico State vs. Liberty odds, while the over/under for total points scored is 48.5 via SportsLine consensus. Before making any Liberty vs. New Mexico State picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of well over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 39-27 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on New Mexico State vs. Liberty. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for New Mexico State vs. Liberty:New Mexico State vs. Liberty                                                     spreadLiberty -10.5 at DraftKings SportsbookNew Mexico State vs. Liberty                                                               over/under48.5 pointsNew Mexico State vs. Liberty                                                               money line Liberty -415, New Mexico State +318New Mexico State vs. Liberty                                                       picksSee picks at SportsLineNew Mexico State vs. Liberty                                                         streaming Fubo (Try for free)  Why Liberty can coverJunior quarterback Ethan Vasko, who is in his first year with the program after two years at Coastal Carolina and one at Kansas, is a dual threat on offense. In five games this season, he has completed 74 of 129 passes (57.4%) for 1,006 yards and six touchdowns with three interceptions. He has also rushed 65 times for 173 yards and three scores. In last Wednesday's win at UTEP, he completed 19 of 33 passes for 243 yards, while carrying 14 times for 31 yards and one touchdown.Running back Evan Dickens also helps lead the offense. In five games, the sophomore has carried 65 times for 344 yards (5.3 average) and two touchdowns, while catching three passes for 42 yards and one touchdown. In a 34-24 loss at Jacksonville  State on Sept. 5, he rushed 13 times for 114 yards (8.8 average) and one touchdown. He carried 15 times for 96 yards (6.4 average) and one score in a 23-13 loss at Bowling Green on Sept. 13. See which team to back at SportsLine. Why New Mexico State can coverSenior quarterback Logan Fife powers the Aggies offense. Fife is in his first season at New Mexico State after one year at Montana and three at Fresno State. In five games, he has completed 98 of 172 passes (57%) for 1,272 yards and six touchdowns with four interceptions. In the win over Sam Houston  State, he completed 19 of 26 passes (73.1%) for 255 yards and one touchdown.Junior wide receiver Donovan Faupel is his top target. In four games this year, he has 23 receptions for 312 yards (13.6 average) and one touchdown. In a 19-3 win over Bryant on Aug. 30, he caught five passes for 99 yards (19.8 average), including a long of 55. He caught eight passes for 78 yards (9.8 average) and one touchdown in a 21-14 win over Tulsa on Sept. 6. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make New Mexico State vs. Liberty picksSportsLine's model is going Over on the total, projecting 58 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Liberty vs. New Mexico State, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the New Mexico State vs. Liberty spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Mexico State vs. Liberty odds, line, picks, predictions, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/9b727ba2-f8e3-446e-bc5b-5f7963659521/thumbnail/1200x675/0d3cb07a97be09c191ac7f9e080e7ec3/jamey-chadwell-liberty-flames-imagn-images.jpg"
      ],
      "datePublished": "2025-10-14T21:06:30.000Z",
      "dateModified": "2025-10-14T21:06:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FIFA World Cup 2026 qualifiers: Tracking which teams have qualified as South Africa, Qatar clinch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/fifa-world-cup-2026-qualifiers-tracking-which-teams-have-qualified-as-south-africa-qatar-clinch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/d87f699b-7cc7-49a9-94a3-552432b12f4d/thumbnail/1200x675/733ef696c38af2061c830bd91e1169c1/sa.jpg",
    "tag": "Sports",
    "date": "2025-10-14T21:06:47.000Z",
    "description": "\n        The 2026 FIFA men's World Cup is approaching next year, and qualifying is well underway with more than half of the spots now accounted for. T",
    "body": "\n        The 2026 FIFA men's World Cup is approaching next year, and qualifying is well underway with more than half of the spots now accounted for. There are now 48 teams after FIFA decided to expand from the old 32-team format that had been in place since the 1998 World Cup. The 2026 edition will take place in the United States, Canada, and Mexico, kicking off on June 11, 2026, at Estadio Azteca in Mexico City, and will end on July 19 at MetLife Stadium in New York City.With the tournament's expansion, the European confederation (UEFA) is guaranteed 16 slots of the 48 teams, while the African confederation (CAF) has nine, and the Asian confederation (AFC) has eight. There will also be a minimum of six each from South America (CONMEBOL) and the Confederation of North, Central America and Caribbean Association Football (CONCACAF). On top of this, for the first time in history, the Oceania Football Confederation (OFC) has one guaranteed slot, while the remaining two spots will be decided through intercontinental playoffs.Three teams have already secured qualification to the first men's World Cup in their history. Uzbekistan, Jordan, and Cape Verde will all be at the World Cup for the first time, and more first-timers could join them as the dust settles. With a population of 524,877, Cape Verde became the second-smallest nation to ever qualify for the World Cup, behind only Iceland, which had a population of 350,000 when they qualified for the 2018 World Cup.Let's take a look at who has already booked their tickets to the World Cup:Already qualified for the 2026 World CupWorld Cup hostsSince the 2026 World Cup is co-hosted by three nations, they all receive an automatic qualifying spot in the tournament. \nUnited StatesMexicoCanadaAFC QualifiersIranUzbekistanSouth KoreaJordanAustraliaJapanQatarSaudi ArabiaOFC QualifierNew ZealandCONMEBOL QualifiersArgentinaBrazilEcuadorParaguayUruguayCAF QualifiersMoroccoEgyptTunisiaGhanaCape VerdeAlgeriaSouth AfricaSenegalIvory CoastUEFA qualifiersEnglandChaos in UEFATeams such as England are starting to book their place in the World Cup, as the winners of each qualifying group will head directly to the tournament. But the second-placed team in each group will head to a playoff phase. Those 12 second-placed teams will be joined by the four best UEFA Nations League group winners. That means that teams such as Wales, Romania, Sweden, Northern Ireland, Moldova, and San Marino could have chances to be in the UEFA playoff even if they don't finish second in their groups.That second round will see 16 teams drawn into four paths with two rounds of single-match playoffs that will lead to a final with the four overall path winners heading to the World Cup. Due to that process, no UEFA teams will take part in the inter-confederation playoff. These also won't conclude until March of 2026.A tough route for NigeriaCAF qualifying could also see some powerhouse teams struggle to make the World Cup. South Africa and Cape Verde winning their groups will send Nigeria and Cameroon into the playoff round. Each of the nine group winners will all head directly to the World Cup in spots that have been decided, but only the four best second-placed teams will advance to the second round, which will take place during the November international window. \nThat round will see those four teams face each other in a playoff that will determine the CAF representative in the inter-confederation playoff. Teams qualified for CAF playoffs:DR CongoBurkina FasoCameroonNigeria Who makes the inter-confederation playoffs?The final World Cup participants won't be determined until March of 2026, following the draw for the World Cup groups. A playoff will take place in North America in March, including one team each from the following regions: AFC, CAF, CONMEBOL, OFC, alongside two from Concacaf to determine the final two places in the World Cup. The bottom four teams in the FIFA World Rankings will be drawn into two single-elimination matches, where the winner will advance to face the top two teams in the rankings, with the winners of those two matches qualifying for the World Cup. \nCurrently in the inter-confederation playoffsOFC: New CaledoniaCONMEBOL: BoliviaWhen is the World Cup draw?Paths to the World Cup final will be revealed on Dec. 5 in a ceremony taking place at the Kennedy Center in Washington, D.C.. At that time, teams will know what groups they will be drawn into, and while the final teams will still need to be determined, placeholders will be used for their spots in the draw.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIFA World Cup 2026 qualifiers: Tracking which teams have qualified as South Africa, Qatar clinch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/d87f699b-7cc7-49a9-94a3-552432b12f4d/thumbnail/1200x675/733ef696c38af2061c830bd91e1169c1/sa.jpg"
      ],
      "datePublished": "2025-10-14T21:06:47.000Z",
      "dateModified": "2025-10-14T21:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]