[
  {
    "title": "2026 NFL conference championship game picks, AI-generated score predictions, bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-conference-championship-games-2026-afc-nfc-title-picks-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/10/e78be24e-af3d-44dd-90d9-5cab0baf03e9/thumbnail/1200x675/69f0274c31d295d5c2b9dcd4c7c39c65/shaheedsea.jpg",
    "tag": "Sports",
    "date": "2026-01-23T00:29:07.000Z",
    "description": "\nA trip to Super Bowl LX will be on the line Sunday with both the AFC and NFC Championship Games. In the AFC, Drake Maye and the New England Patriots ",
    "body": "\nA trip to Super Bowl LX will be on the line Sunday with both the AFC and NFC Championship Games. In the AFC, Drake Maye and the New England Patriots take on backup quarterback Jarrett Stidham and the Denver Broncos, after Bo Nix had his season come to an end with an ankle injury. In the NFC, Matthew Stafford and the Los Angeles Rams will battle Sam Darnold and the Seattle Seahawks. New England enters the AFC title game as a 4.5-point favorite at DraftKings Sportsbook after opening as 5.5-point favorites. Seattle, meanwhile, is a 2.5-point home favorite for the NFC Championship, with the total at 46.5.Denver and New England are the top two seeds in the AFC, and the Broncos are tied for being the biggest home underdog in conference championship game history. The Rams and Seahawks split a pair of games this season both straight up and against the spread. Who should you consider for the conference championship game NFL bets and playoff predictions? Before making any 2026 NFL championship game picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For 2026 NFL championship game NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all four games. You can only see the AI predictions for the 2026 NFL championship game schedule here.Top 2026 championship game AI picksAfter analyzing both championship games, SportsLine AI says the under 47.5 (-115) will hit in a tight, low-scoring matchup between the Rams and Seahawks on Sunday at 6:30 p.m. ET.\nDefense has been the calling card for the Seahawks, while the Rams have held their own. Seattle had the sixth-best defense in the league, giving up 285.6 yards per game and a league-low 17.2 points per game. The Rams, meanwhile, allowed just 20.4 points, 10th-best in the league. Their respective divisional games both went under, and each of Seattle's last three contests have gone under.SportsLine AI is projecting the Under to hit, projecting 43.6 total points, and is a B-rated pick. See its other 2026 NFL championship game football predictions and football picks at SportsLine, and bet the Under at DraftKings here:\nHow to make 2026 NFL championship game picksIn addition, the AI PickBot has generated a highly-coveted A+ pick for one of the championship games. You need to see the AI's NFL picks before making any 2026 championship game NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 NFL championship game, and which A+ pick should you target now? Visit SportsLine now to see the top NFL picks against the spread, ove/-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL conference championship game picks, AI-generated score predictions, bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/10/e78be24e-af3d-44dd-90d9-5cab0baf03e9/thumbnail/1200x675/69f0274c31d295d5c2b9dcd4c7c39c65/shaheedsea.jpg"
      ],
      "datePublished": "2026-01-23T00:29:07.000Z",
      "dateModified": "2026-01-23T00:29:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rockets vs. Pistons prediction, odds, line, time: 2026 NBA picks for Friday, Jan. 23 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/rockets-pistons-odds-prediction-spread-time-2026-nba-picks-friday-january-23/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/23/c387432e-a537-4bd7-8ad8-e7b49ba311f2/thumbnail/1200x675/3a81d2c7e2c9bfe7e3c11f9e9cc2f119/jalen-duren-detroit-pistons-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-23T11:12:18.000Z",
    "description": "\n        The Houston Rockets look to get back on track when they take on the Central Division-leading Detroit Pistons in NBA action on Friday night. H",
    "body": "\n        The Houston Rockets look to get back on track when they take on the Central Division-leading Detroit Pistons in NBA action on Friday night. Houston is coming off a 128-122 loss to the Philadelphia 76ers on Thursday, while Detroit posted a 112-104 win over the New Orleans Pelicans on Wednesday. The Rockets (26-16), who are second in the Southwest Division, are 11-13 on the road this season. The Pistons (32-10), who are 10-4 against Western Conference foes, are 17-4 on their home court. Cade Cunningham (hip) is questionable for Detroit, while Houston hasn't released its injury report.Tipoff from Little Caesars Arena in Detroit is set for 7 p.m. ET. The Pistons lead the all-time series 77-75, and have won two straight in the series. Detroit is a 4.5-point favorite in the latest Rockets vs. Pistons odds from DraftKings Sportsbook, while the over/under for total points scored is 217.5. Before making any Rockets vs. Pistons picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   Now, the model has simulated Rockets vs. Pistons 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pistons vs. Rockets:\nRockets vs. Pistons                                                                                                 spread:    Detroit -4.5 at DraftKings    Rockets vs. Pistons                                                                                                               over/under:    217.5 pointsRockets vs. Pistons                                                                                                               money line:    Detroit -190, Houston +158Rockets vs. Pistons                                                                                                               picks:    See picks at SportsLineRockets vs. Pistons                                                                                                               streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Rockets vs. Pistons picksAfter 10,000 simulations of Pistons vs. Rockets, SportsLine's model is going Over on the total (217.5). The total has gone Over in two of the past six head-to-head games. The SportsLine model is projecting Houston's Kevin Durant to score 22.2 points on average and be one of six Rockets players to score 10.2 or more points. Detroit's Cade Cunningham, meanwhile, is projected to have 23.1 points if he's able to go, as four Pistons players score 10.7 points or more. The teams combine for 220 total points and the Over hits in 53% of simulations.It has also generated an against-the-spread pick that hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Pistons vs. Rockets, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Rockets vs. Pistons spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rockets vs. Pistons prediction, odds, line, time: 2026 NBA picks for Friday, Jan. 23 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/23/c387432e-a537-4bd7-8ad8-e7b49ba311f2/thumbnail/1200x675/3a81d2c7e2c9bfe7e3c11f9e9cc2f119/jalen-duren-detroit-pistons-imagn-images.jpg"
      ],
      "datePublished": "2026-01-23T11:12:18.000Z",
      "dateModified": "2026-01-23T11:12:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, 2026 championship games: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-daily-fantasy-football-lineups-fanduel-draftkings-2026-conference-championship-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/22/59bd56af-7f52-4932-ad43-a216e5ca48be/thumbnail/1200x675/c63b392b59c6075e261a72fd6b780ea1/puka-nacua-imagn-lar.jpg",
    "tag": "Sports",
    "date": "2026-01-23T00:40:02.000Z",
    "description": "\n        NFL DFS players will have their final multi-game slate of the year as Championship Sunday brings both the AFC Championship Game and the NFC C",
    "body": "\n        NFL DFS players will have their final multi-game slate of the year as Championship Sunday brings both the AFC Championship Game and the NFC Championship Game. The Broncos and Patriots play at 3 p.m. ET, followed by Seahawks vs. Rams at 6:30 p.m. ET. Injuries will play a big part in both matchups with Bo Nix (ankle) out for Denver and Zach Charbonnet (ACL) out for Seattle. Denver, especially, will have a new look on offense and daily Fantasy football players will have to craft a strategy around how to value backup Jarrett Stidham and the rest of the that offense without Nix. The latter's absence could affect the likes of Courtland Sutton, Troy Franklin and Pat Bryant.Who are the best NFL DFS picks for Sunday, and which sleepers can differentiate your NFL DFS lineups on sites like DraftKings and FanDuel? Before making any NFL daily Fantasy picks on Sunday, be sure to check out the NFL DFS advice, strategy and stacks from SportsLine daily Fantasy expert Mike McClure.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the NFL Championship Sunday DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. \nTop NFL DFS picks for SundayOne of McClure's top NFL DFS picks for Sunday is Rams receiver Puka Nacua. He's been a daily Fantasy stalwart all season with a massive 129-1,715-10 receiving line. He hasn't slowed much in the NFL playoffs, turning 28 targets into 15 catches for 167 yards and a score through two games. A new wrinkle has been using him as a runner. He's now had three straight weeks with multiple carries, giving him even more daily Fantasy value. The Seahawks are tough defensively, but he sliced them up for 12 catches, 225 yards and two touchdowns in Week 16. See who else to roster at SportsLine, and new users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins, and bet Nacua Over 92.5 receiving yards at DraftKings:\nMcClure is also building his NFL DFS strategy around Seahawks running back Kenneth Walker III. He should see an already heavy workload expand against the Rams with Charbonnet done for the year. Walker's track record against the Rams this year was already strong as he totaled 275 scrimmage yards and two scores against them in their two matchups in the regular season. The Rams have also allowed 160-plus rushing yards in three of their last five games after doing so just twice over their first 14 games. See who else to roster at SportsLine, and bet Walker to go Over 86.5 rushing yards at DraftKings: \nHow to set Sunday NFL DFS lineupsMcClure is targeting an undervalued player who could explode for huge numbers on Sunday. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.\nSo who is Mike McClure including in his optimal NFL DFS lineups for Sunday, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, 2026 championship games: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/22/59bd56af-7f52-4932-ad43-a216e5ca48be/thumbnail/1200x675/c63b392b59c6075e261a72fd6b780ea1/puka-nacua-imagn-lar.jpg"
      ],
      "datePublished": "2026-01-23T00:40:02.000Z",
      "dateModified": "2026-01-23T00:40:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting 76ers-Rockets, Lakers-Clippers on Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-200-bonus-bets-76ers-rockets-lakers-clippers-thursday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-22T22:27:15.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and there are numerous w",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and there are numerous ways to unlock those funds on Thursday. Penn State hosts Wisconsin in a college basketball matchup, while the NBA schedule features games like 76ers vs. Rockets and Clippers vs. Lakers. The Lakers have gone Over the total in four of their last six games, and SportsLine's proven computer model is backing the Over (224.5) in Lakers vs. Clippers on Thursday in its NBA best bets at bet365 Sportsbook. According to the latest NBA odds, the Lakers are now favored by 1.5 points after opening at +2.The model has also revealed a pick for Rockets vs. 76ers, while SportsLine expert Jeff Hochman has locked in a side for Wisconsin vs. Penn State. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. It also enters Week 12 of college basketball on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season. Anybody following its college basketball betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Thursday's top picks, best betsRockets -2 vs. 76ers (-110)Over 224.5 in Lakers vs. Clippers (-110)Wisconsin -5.5 vs. Penn State (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:\nRockets -2 vs. 76ers (-110)Houston has won four of its last five games and is riding a three-game winning streak, including victories over the Timberwolves and Spurs. The Rockets covered the spread as 4.5-point home favorites against San Antonio on Tuesday, as Alperen Sengun narrowly missed a triple-double. Second-year guard Reed Sheppard scored 12 of his 21 points in the fourth quarter and has knocked down 11 triples over the last three games. Philadelphia has lost three of its last four games, so SportsLine's model has Houston covering the spread in 70% of simulations. Back the Rockets at bet365 here:Over 224.5 in Lakers vs. Clippers (-110)The Clippers have won 13 of their last 16 games, but they are coming off a 138-110 loss at Chicago on Tuesday, marking the third-most points they have allowed in a game this season. They have scored at least 110 points in six of their last seven games, while the Lakers have reached that mark in six straight games. The Lakers have gone Over the total in four of their last six outings and seven of their last 10 games against Pacific Division opponents. The model has these teams combining for 231 points on Thursday night to help the Over cash in 59% of simulations. Back the Over at bet365 here:Wisconsin -5.5 vs. Penn State\"The Badgers rank 12th nationally in Adjusted Offensive Efficiency (122.9), while Penn State's defense has plummeted to 107.7 AdjD, ranking dead last in the Big Ten in field goal percentage allowed (48.3%),\" SportsLine expert Jeff Hochman said. \"The deciding factor is the interior. Penn State surrenders a staggering 57% shooting on two-point attempts. Furthermore, with leading scorer Freddie Dilione limited by an ankle injury, Penn State lacks the firepower to trade baskets in a high-efficiency game. This is a revenge spot for Wisconsin, who were upset as 11-point home favorites by the Nittany Lions last March. Expect Wisconsin to dominate the paint and cover comfortably.\" Back Wisconsin at bet365 here:\nLooking for NBA and college basketball picks?You've seen the model's best bets for Thursday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting 76ers-Rockets, Lakers-Clippers on Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-22T22:27:15.000Z",
      "dateModified": "2026-01-22T22:27:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hornets vs. Magic prediction, odds, line, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/hornets-magic-odds-prediction-time-2026-nba-picks-thursday-january-22/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/dffd54a7-6638-4ace-bfd5-3e754cf46d10/thumbnail/1200x675/a08e8e56c8d842063a1013e8163c6a22/paolo-banchero-orlando-magic-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-22T23:07:56.000Z",
    "description": "\n        The Charlotte Hornets battle the Orlando Magic in a key NBA Southeast Division matchup on Thursday night. Charlotte is coming off a 94-87 los",
    "body": "\n        The Charlotte Hornets battle the Orlando Magic in a key NBA Southeast Division matchup on Thursday night. Charlotte is coming off a 94-87 loss to the Cleveland Cavaliers on Wednesday, while Orlando dropped a 126-109 decision to the Memphis Grizzlies on Sunday. The Hornets (16-28), who are fourth in the division, are 9-15 on the road this season. The Magic (23-19), first in the Southeast, are 13-6 on their home floor. Charlotte will be without Mason Plumlee (groin), while Jalen Suggs (knee) and Franz Wagner (ankle) are out for Orlando.Tip-off from Kia Center in Orlando, Fla., is set for 7 p.m. ET. The Magic lead the all-time series 67-61, and have won five of the last six meetings. Orlando is a 4.5-point favorite in the latest Hornets vs. Magic odds from DraftKings Sportsbook, while the over/under for total points scored is 223.5. Before making any Hornets vs. Magic picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   Now, the model has simulated Hornets vs. Magic 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Magic vs. Hornets:\nHornets vs. Magic                                                                                             spread:    Orlando -4.5 at DraftKings    Hornets vs. Magic                                                                                                           over/under:    223.5 pointsHornets vs. Magic                                                                                                           money line:    Charlotte +154, Orlando -185Hornets vs. Magic                                                                                                           picks:    See picks at SportsLineHornets vs. Magic                                                                                                           streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Hornets vs. Magic picksSportsLine's model is going Over on the total (223.5 points). The total has gone Over in four of the past six Charlotte games, and in each of the last three Orlando games. The Hornets are 6-4 against the spread in their last 10 games, while the Magic are 3-7 ATS in their last 10. The SportsLine model is projecting Charlotte's LaMelo Ball to score 19.9 points on average and be one of five Hornets players to score 12.9 or more points. Orlando's Paolo Banchero, meanwhile, is projected to have 22 points as six Magic players score 10.8 points or more.It has also generated an against-the-spread pick that hits in nearly 70% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Magic vs. Hornets, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the Hornets vs. Magic spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hornets vs. Magic prediction, odds, line, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/dffd54a7-6638-4ace-bfd5-3e754cf46d10/thumbnail/1200x675/a08e8e56c8d842063a1013e8163c6a22/paolo-banchero-orlando-magic-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-22T23:07:56.000Z",
      "dateModified": "2026-01-22T23:07:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuggets vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nuggets-wizards-odds-prediction-spread-time-2026-nba-picks-thursday-january-22/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/9b4b9083-c56e-4316-af52-43986982ba49/thumbnail/1200x675/25a6d6e0685ad61fd4d159852c66c327/usatsi-28020973.jpg",
    "tag": "Sports",
    "date": "2026-01-22T23:18:31.000Z",
    "description": "\n        A cross-conference matchup on Thursday's NBA schedule has the Denver Nuggets visiting the Washington Wizards. Denver (29-15) is coming off ba",
    "body": "\n        A cross-conference matchup on Thursday's NBA schedule has the Denver Nuggets visiting the Washington Wizards. Denver (29-15) is coming off back-to-back defeats, including a 115-107 loss to the Lakers on Monday, which followed a four-game win streak. Washington (10-32) is mired in a seven-game losing streak, most recently falling 110-106 to the Clippers on Sunday, and that follows a 5-2 stretch for the Wizards. Nikola Jokic (knee) and Trae Young (knee) remain out for their respective teams, but Denver lists Jonas Valanciunas as available after he's been sidelined since Dec. 31.Tip-off is at 7 p.m. ET from Capital One Arena in Washington, D.C. Denver leads the all-time series 60-43 and just defeated the Wizards on Jan. 17. Denver is a 5.5-point favorite in the latest Wizards vs. Nuggets odds from DraftKings Sportsbook, while the over/under for total points scored is 227.5. Before making any Nuggets vs. Wizards picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Wizards vs. Nuggets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Nuggets vs. Wizards:Wizards vs. Nuggets                                                                                            spread:    Denver -5.5 at DraftKings    Wizards vs. Nuggets                                                                                                          over/under:    227.5 pointsWizards vs. Nuggets                                                                                                           money line:    Denver -254, Washington +202Wizards vs. Nuggets                                                                                                           picks:    See picks at SportsLineWizards vs. Nuggets                                                                                                          streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Nuggets vs. Wizards   picksSportsLine's model has simulated Wizards vs. Nuggets 10,000 times and is going Over on the total (227.5 points). The Nuggets have the second-best Over record in the NBA at 27-17, as the total has been eclipsed in 61.4% of their games. That includes their matchup versus the Wizards on Saturday, which saw 236 total points scored, surpassing the game's O/U of 228.5, which is the same as Thursday's contest.Each of the last four meetings between these teams have seen at least 235 combined points, with them averaging 240 points. This season, both teams struggle on the defensive end, with Denver ranking 20th in points allowed, while Washington sits 29th. With that, both squads are forecasted to score more points than their season averages. The model projects 240 total points being scored as the Over hits in 67.8% of simulations in an A-rated pick.It has also generated an against-the-spread pick that hits in well over 60% of simulations in an A-rated spread pick. You can head to SportsLine to see the model's NBA picks. So who wins Nuggets vs. Wizards, and which side of the spread hits well over 60% of the time in an A-rated spread pick? Visit SportsLine now to see which side of the Wizards vs. Nuggets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuggets vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/9b4b9083-c56e-4316-af52-43986982ba49/thumbnail/1200x675/25a6d6e0685ad61fd4d159852c66c327/usatsi-28020973.jpg"
      ],
      "datePublished": "2026-01-22T23:18:31.000Z",
      "dateModified": "2026-01-22T23:18:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wisconsin vs. Penn State prediction, odds: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/wisconsin-penn-state-odds-prediction-time-2026-college-basketball-picks-january-22/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/6236625e-3892-4d0c-9a63-550478d9ccb4/thumbnail/1200x675/277bd4292ddaa96fd0e659b2de936f4a/john-blackwell-wisconsincbs.jpg",
    "tag": "Sports",
    "date": "2026-01-22T23:11:39.000Z",
    "description": "\n        The Wisconsin Badgers will look to extend their winning streak to five games when they take on the Penn State Nittany Lions in a key Big Ten ",
    "body": "\n        The Wisconsin Badgers will look to extend their winning streak to five games when they take on the Penn State Nittany Lions in a key Big Ten Conference matchup on Thursday night. Wisconsin is coming off a 96-87 win over Rutgers on Saturday, while Penn State dropped a 96-73 decision at Maryland on Sunday. The Badgers (13-5, 5-2 Big Ten), who are looking to reach 20 wins for the fifth consecutive season, are 2-2 on the road this season. The Nittany Lions (9-9, 0-7 Big Ten), who have lost five in a row, are 7-4 on their home floor.Tip-off from Bryce Jordan Center in State College, Pa., is set for 7 p.m. ET. Wisconsin leads the all-time series 44-13, including a 19-9 edge in games played at State College. The Badgers are 5.5-point favorites in the latest Penn  State vs. Wisconsin odds from DraftKings Sportsbook, while the over/under for total points scored is 157.5. The Badgers are at -267 on the money line (risk $267 to win $100). Before making any Wisconsin vs. Penn State picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 12 on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns. \nNow, the model has simulated Wisconsin vs. Penn State 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Penn State vs. Wisconsin:Wisconsin vs. Penn State                                                                                                            spread:    Wisconsin -5.5 at DraftKings SportsbookWisconsin vs. Penn State                                                                                           over/under:    157.5 pointsWisconsin vs. Penn State                                                                                                                        money line:    Wisconsin -267, Penn State +215Wisconsin vs. Penn State                                                                                                                         picks:    See picks at SportsLineWisconsin vs. Penn State                                                                                                                         streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Wisconsin vs. Penn State picksSportsLine's model is going Over on the total (157.5 points). The Over has hit in each of the last three head-to-head meetings between the teams. The Over has hit in four of the last five Wisconsin games, and in two of the last three Penn  State games.The model projects the Badgers to have four players register 15.5 points or more, including John Blackwell's projected 20.4 points. The Nittany Lions, meanwhile, are projected to have three players score 10 or more points, led by Kayden Mingo, who is projected to score 15.2 points. The model projects a combined total of 161 points as the Over clears in well over 50% of simulations. The model also says one side of the spread hits nearly 60% of the time. You can only see that pick at SportsLine.So who wins Penn State vs. Wisconsin, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the Wisconsin vs. Penn State spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wisconsin vs. Penn State prediction, odds: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/6236625e-3892-4d0c-9a63-550478d9ccb4/thumbnail/1200x675/277bd4292ddaa96fd0e659b2de936f4a/john-blackwell-wisconsincbs.jpg"
      ],
      "datePublished": "2026-01-22T23:11:39.000Z",
      "dateModified": "2026-01-22T23:11:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs' Travis Kelce may have just hinted whether he plans to retire or not - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/travis-kelce-retirement-plans-return-to-chiefs-nfl-offseason/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/b880ba75-d6f9-4153-9e73-b6589136280e/thumbnail/1200x675/6b28bebd87a2f521be4c189da04a80cc/gettyimages-2253548000-2.jpg",
    "tag": "Sports",
    "date": "2026-01-22T18:54:09.000Z",
    "description": "\n        After 13 NFL seasons, Travis Kelce still hasn't decided if he's going to come back for another year, but he may have offered a small hint abo",
    "body": "\n        After 13 NFL seasons, Travis Kelce still hasn't decided if he's going to come back for another year, but he may have offered a small hint about his future plans during the most recent episode of \"The New Heights\" Podcast, which he hosts with his brother, Jason. During this week's episode, Jason brought up the fact that Eric Bieniemy will be returning as the Chiefs' offensive coordinator. Bieniemy was originally hired by the Chiefs in 2013, which just happened to be Travis' rookie year in the NFL, so the two spent 10 years together before Bieniemy moved on in 2023 to take the Commanders' offensive coordinator job. After one year in Washington, Bieniemy moved on to the college ranks as the offensive coordinator for UCLA. In 2025, he returned to the NFL as the running backs coach for Ben Johnson in Chicago. Now, Bieniemy is returning to Kansas City and Travis definitely sounds excited. \"I love that, shit. I think it's great,\" Kelce said on the podcast. And now, we get to the part where Kelce may have hinted at a possible return. The 11-time Pro Bowler mentioned that he's already excited at the thought of seeing Bieniemy back at the team facility.  \n\"I can't wait to see him back in the building,\" Kelce said. \"He's one of my favorite coaches of all-time, one of my favorite people of all time. I've had so many unbelievable growing moments under him as a player, as a person, and I just love the guy and it's going to be awesome to see him back in the building and see him back wearing the Chiefs logo, baby.\"If Kelce retires, then he won't be in the building anymore, so he wouldn't see Bieniemy there, but if he sticks around for one more season, then it would give him a chance to play one more year with one of his \"favorite\" coaches of all-time. On the podcast, Kelce certainly sounded excited about Bieniemy's return. Retirement speculation aside, Travis seems pretty confident that bringing Bieniemy back into the fold was a smart move for the Chiefs. \n\"I think it's a marriage that's gonna pick up right where it left off,\" Travis said. \"E.B. and who he is as a coach, you can see kind of his personality, what he brings to the table in that Chicago team. I know Ben Johnson has his own version of that, he's a very tough guy, and what he did in Detroit, he brought over as well. And you can see those running backs over in Chicago and their body of work was definitely an Eric Bieniemy style of football.\"Although Kelce's future is still up in the air, he'll almost certainly be making his retirement decision before the start of free agency so that the Chiefs can make their offseason plans. Earlier this month, Travis made it sound like he wanted to see how his body feels before making a decision. \"Right now it's just finding that answer and seeing how the body feels after this [final] game and kinda when it all settles down,\" Travis said at the end of the 2025 season. \nOne of his teammates in Kansas City isn't buying any of the retirement speculation. Chris Jones thinks that Travis will definitely be returning to play at least one more season. \"I'm not buying it, he'll be back next year,\" Jones said in early January. \"I can't promise you anything about another man. This was a tricky year for us. I have faith in my dawg coming back.\"Although Kelce is 36, he showed in 2025 that he still has some juice left in the tank, catching 76 passes for 851 yards and five touchdowns, leading the Chiefs in all three of those categories. \nThere are a lot of reasons why Travis would potentially want to return for one more year. For one, he likely won't want to end his career on a low note, which is what would happen if he calls it quits after a season where the Chiefs went just 6-11. The 2025 season marked just the second time in 13 seasons that Kelce has missed the playoffs. Also, you'd have to think that Patrick Mahomes would love to have Kelce back. The Chiefs quarterback tore his ACL in December and he's going to be motivated to return with a vengeance in 2026 and he's probably love to see Kelce on the field with him when that happens. Kelce actually has a lot to think about this offseason. Not only does he have to consider his football future, but he also has to start planning for the rest of his life. He's currently planning a wedding with his fiancée, Taylor Swift, and the two are expected to tie the knot in June, according to Page Six. If Kelce does return, the Chiefs start their offseason workouts in April, so he'd definitely be staying busy until the wedding rolls around. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs' Travis Kelce may have just hinted whether he plans to retire or not - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/b880ba75-d6f9-4153-9e73-b6589136280e/thumbnail/1200x675/6b28bebd87a2f521be4c189da04a80cc/gettyimages-2253548000-2.jpg"
      ],
      "datePublished": "2026-01-22T18:54:09.000Z",
      "dateModified": "2026-01-22T18:54:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Browns coaching search: Jesse Minter joins Mike McDaniel in withdrawing candidacy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-mcdaniel-withdraws-from-browns-coaching-search/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png",
    "tag": "Sports",
    "date": "2026-01-22T19:27:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jesse Minter is the latest candidate to remove him",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jesse Minter is the latest candidate to remove himself from the running to be the Cleveland Browns' next head coach. The Los Angeles' Chargers defensive coordinator is not going forward Thursday's scheduled meeting with the Browns, according to Cleveland.com. Minter's decision comes after former Miami Dolphins head coach Mike McDaniel withdrew his name from the team's coaching search. McDaniel since accepted an offensive coordinator position with the Chargers if he does not land one of the league's other head coaching openings. Minter's decision was likely based on his belief that he has other head coaching opportunities that are more certain, according to the report. He is, for example, considered to be a strong candidate for the Baltimore Ravens opening, which offers a roster that includes two-time MVP Lamar Jackson and future Hall of Fame running back Derrick Henry. With Minter out of the running, the Browns will move ahead in their search to find their next coach. The team conducted second interviews with defensive coordinator Jim Schwartz, former Ravens offensive coordinator Todd Monken, Jacksonville Jaguars offensive coordinator Grant Udinski and Los Angeles Rams passing game coordinator Nate Scheelhaase. \nThe Browns are in this position after firing Kevin Stefanski following a 5-12 campaign. Stefanski has since replaced Raheem Morris as the Atlanta Falcons' new head coach. While they are one of the NFL's historic clubs, the Browns have struggled to remain relevant since they fired Bill Belichick after the 1995 season. Upon their return in 1999, the Browns have had just three winning seasons and two playoff appearances, both which came under Stefanski, who also led Cleveland to its first playoff win in over a quarter century. \nCleveland's current roster includes likely 2025 Defensive Player of the Year Myles Garrett, but it also has several serious question marks, including at quarterback with Shedeur Sanders, Dillon Gabriel and Deshaun Watson all under contract. Whoever becomes the next head coach will be tasked with determining which quarterback will be under center when the Browns being the 2026 season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Browns coaching search: Jesse Minter joins Mike McDaniel in withdrawing candidacy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png"
      ],
      "datePublished": "2026-01-22T19:27:17.000Z",
      "dateModified": "2026-01-22T19:27:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI investigating doctor connected to death of Colts owner Jim Irsay, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/fbi-investigating-doctor-pain-medication-colts-jim-irsay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/c452101c-edd9-48dc-8ece-a42c0c5a8255/thumbnail/1200x675/88c3c018d25510bf6a26feaa02c17943/jim-irsay.jpg",
    "tag": "Sports",
    "date": "2026-01-22T22:55:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Indianapolis Colts owner Jim Irsay passed away at ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Indianapolis Colts owner Jim Irsay passed away at the age of 65 last May. Now, the FBI is reportedly looking into the matter.Officials are investigating the death of Irsay and the doctor that provided him with prescription pain medication as well as ketamine towards the end of his life, according to The Washington Post. The FBI is researching Irsay's \"substance [illegal and prescription] use,\" and his \"relationship with Dr. Harry Haroutunian,\" who is a prominent addiction specialist. Agents reportedly visited Indianapolis this month and interviewed multiple people who were close to Irsay before his death.Irsay died at the Beverly Hills Hotel in California on May 21, 2025. Haroutunian was reportedly staying at the hotel overseeing Irsay's treatment, and signed his death certificate stating the cause of death was cardiac arrest caused by pneumonia and heart issues. Los Angeles County's medical examiner did not conduct an autopsy, saying the death was not considered sudden or unexpected.\nIn August, The Washington Post published an extensive report citing multiple people maintaining that Irsay, who claimed to have defeated his addiction to pain meds, had not only relapsed, but overdosed multiple times in the last five years. The Post acquired images of pill bottles that showed Haroutunian had prescribed Irsay more than 200 pills days before the Colts owner had two overdoses in less than two weeks back in 2023, including one episode that left him hospitalized for four months. According to multiple people who witnessed the injections, Haroutunian then added ketamine to Irsay's treatment plan.\nIrsay was one of the most recognizable owners in the NFL at the time of his death. He became the youngest general manager in NFL history at the age of 24 back in 1984, then became the youngest NFL owner at 37 when he took over the franchise following his father's death in 1997. Under Irsay's leadership, the Colts made 16 playoff appearances, took home two AFC titles and won Super Bowl XLI.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI investigating doctor connected to death of Colts owner Jim Irsay, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/c452101c-edd9-48dc-8ece-a42c0c5a8255/thumbnail/1200x675/88c3c018d25510bf6a26feaa02c17943/jim-irsay.jpg"
      ],
      "datePublished": "2026-01-22T22:55:04.000Z",
      "dateModified": "2026-01-22T22:55:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens hiring Jesse Minter: Chargers defensive coordinator to replace John Harbaugh - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/baltimore-ravens-hiring-jesse-minter-los-angeles-chargers-coach-john-harbaugh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png",
    "tag": "Sports",
    "date": "2026-01-22T23:00:40.000Z",
    "description": "\n        A new era is underway for the Baltimore Ravens, as the team announced Thursday it is hiring Los Angeles Chargers defensive coordinator Jesse ",
    "body": "\n        A new era is underway for the Baltimore Ravens, as the team announced Thursday it is hiring Los Angeles Chargers defensive coordinator Jesse Minter as its new coach.Minter, 42, is replacing John Harbaugh, who won a Super Bowl, six AFC North titles and made 12 playoff appearances across 18 seasons with the franchise before he was fired on Jan. 6. The Ravens decided to go in a different direction after a season that began with significant expectations ended without a postseason berth. Harbaugh subsequently was hired by the New York Giants.\"We are thrilled to announce an agreement with Jesse Minter to be the fourth head coach in Baltimore Ravens history,\" general manager Eric DeCosta said in a statement. \"Jesse is a strong leader who possesses a brilliant football mind and a spirit that will resonate with our players and fanbase alike. Jesse comes from a football family, with success at every level of the sport, and we are confident that he is the right coach to lead the Ravens forward. Congratulations to Jesse and his wife, Rachelle, and the entire Minter family. It's time to get to work!\"\nMinter was hired by Harbaugh away from Georgia State in 2017 to be a Ravens defensive assistant. After four seasons, he left Baltimore to become a defensive coordinator at the college level. Minter spent one season at Vanderbilt before landing on the staff of Jim Harbaugh, John's brother, at Michigan. During his second season at Michigan, Minter helped the program capture its first national title since 1997. Michigan's defense allowed the fewest points in the nation that season. \nMinter then followed Jim Harbaugh to the Chargers, where in 2024 he presided over the league's top scoring defense. This year, the Chargers ranked ninth in the NFL in points allowed, fifth in passing yards allowed, eighth in rushing yards allowed, fifth in third down efficiency and fourth in red zone efficiency. Minter is coming to a Ravens team that started 1-5 before finishing with an 8-9 record. Baltimore's defense was a big reason for the team's disappointing season as it finished 18th in the league in points allowed, 30th in passing yards allowed, and tied for 27th in sacks.\nOffensively, the Ravens still have two of the league's best players in quarterback Lamar Jackson and running back Derrick Henry. The clock is ticking on both players, and Minter will be tasked with getting the most out of the remaining years of Jackson's prime. A two-time MVP, Jackson is one of the most electric players in league history, but he's played in just one AFC title game and has never been to the Super Bowl. That has created a narrative that Jackson -- despite his immense talent -- isn't quite good enough to take the Ravens to the promised land. Minter will now try to help Jackson dispel that narrative.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens hiring Jesse Minter: Chargers defensive coordinator to replace John Harbaugh - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png"
      ],
      "datePublished": "2026-01-22T23:00:40.000Z",
      "dateModified": "2026-01-22T23:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lindsey Vonn, Mikaela Shiffrin, Chloe Kim make Team USA's Winter Olympics squad - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-u-s-ski-snowboard-winter-olympics-lindsey-vonn-mikaela-shiffrin-chloe-kim/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/eac4b14a-9359-49ce-b669-0f17e32b1bae/thumbnail/1200x675/a30e3273576d7735eca074058b98eba5/lindsey-vonn.jpg",
    "tag": "Sports",
    "date": "2026-01-22T22:23:47.000Z",
    "description": "\n        U.S. Ski & Snowboard has announced the names of the 97 individuals who have made the Winter Olympics team that will be competing in Italy nex",
    "body": "\n        U.S. Ski & Snowboard has announced the names of the 97 individuals who have made the Winter Olympics team that will be competing in Italy next month. The list includes former Olympic gold medalists Mikaela Shiffrin, Chloe Kim and Lindsey Vonn, who is back after retiring several years ago.Shiffrin, a two-time Olympic champion and three-time Olympic medalist, is the most decorated alpine skier in history with 107 victories. Vonn retired in 2019, but has worked towards a comeback in the sport after successful knee surgery that helped ease the pain that forced her to stop her career. In December, the 41-year-old became the oldest downhill skiing World Cup winner, her 83rd World Cup win and her first victory since 2018.Another household name making a return is Kim, a snowboarder who gained popularity for her success at the 2018 Winter Olympics in Pyeongchang, South Korea. At 17, she was the youngest woman to land two 1080-degree spins in a row at the Games and was the youngest woman to win gold in the halfpipe.The Milano Cortina Games, spread across Northern Italy, will run from Feb. 6-22.Snowboarder Jamie Anderson, who was looking to make a comeback of her own after having two children in the last two years, did not make the team. Anderson said she was motivated by seeing others have families and continue their sports careers and sees it as a win that she had the opportunity to compete for a spot. Injuries also impacted her season. \"In many ways, making this team is even harder than the Olympics themselves,\" said snowboard program director Rick Bower. \"The depth of our field is incredible, and selection truly came down to the wire.\"On the men's side of alpine skiing, Olympic silver medalist Ryan Cochran-Siegle will be competing. Olympic champion and three-time Olympic medalist in cross country Jessie Diggins made the team for what will be her fourth and final Games. Red Gerard and five-time Olympian Nick Baumgartner are competing on the snowboard team.\"The athletes we are sending to the Games represent a large portion of Team USA and I am confident about the impact they will make in Italy,\" U.S. Ski & Snowboard president and CEO Sophie Goldschmidt said. \"More than the results, our athletes are also bringing some of the most captivating story lines to Milano Cortina, and we are so excited to see the impact they will have while representing their country in February.\"Here's a full breakdown of the U.S. Ski and Snowboard team by event.2026 U.S. Olympic Alpine Team(Past Olympic teams)WomenMary Bocock* Keely Cashman (2022)Katie Hensien (2022)AJ Hurt (2022)Breezy Johnson (2022)Paula Moltzan (2022)Nina O'Brien (2022)Mikaela Shiffrin (2014, 2018, 2022)Lindsey Vonn (2002, 2006, 2010, 2018)Jacqueline Wiles (2014, 2018, 2022)Isabella Wright (2022)MenBryce Bennett (2022)Ryan Cochran-Siegle (2018, 2022)Sam Morse* Kyle Negomir* River Radamus (2022)Ryder Sarchett* 2026 U.S. Olympic Cross Country Team(Past Olympic teams)WomenRosie Brennan (2018, 2022)Jessie Diggins (2014, 2018, 2022)Lauren Jortberg* Julia Kern (2022)Kendall Kramer* Novie McCabe (2022)Samantha \"Sammy\" Smith* Hailey Swirbul (2022)MenJohn Steel Hagenbuch*Zak Ketterson* Zanden McMullen* Ben Ogden (2022)James \"JC\" Schoonmaker (2022)Gus Schumacher (2022)Hunter Wonders* Jack Young*2026 U.S. Olympic Freeski Team(Past Olympic teams)HalfpipeWomenKate Gray* Svea Irving* Riley Jacobs* Abby Winterberger* MenAlex Ferreira (2018, 2022)Nick Goepper (2014, 2018, 2022)Hunter Hess* Birk Irving (2022)Slopestyle & Big AirWomenMarin Hamill (2022)Rell Harwood*Grace Henderson*Avery Krumme* Men\nMac Forehand (2022)Alex Hall (2018, 2022)Troy Podmilsak*Konnor Ralph*2026 U.S. Olympic Freestyle Ski Team, Moguls & Aerials(Past Olympic teams)AerialsWomenKyra Dossa* Kaila Kuhn (2022)Tasia Tanner* Winter Vinecki (2022)MenConnor Curran* Quinn Dehlinger* Derek Krueger*Chris Lillis (2022)MogulsWomenOlivia Giaccio (2022)Tess Johnson (2018)Jaelin Kauf (2018, 2022)Elizabeth \"Liz\" Lemley*MenCharlie Mickel* Nick Page (2022)Dylan Walczyk (2022)Landon Wendler* 2026 U.S. Olympic Nordic Combined Team(Past Olympic teams)MenBen Loomis (2018, 2022)Niklas Malacinski* 2026 U.S. Olympic Ski Jumping Team(Past Olympic teams)WomenAnnika Belshaw* Josie Johnson* Paige Jones* MenKevin Bickner (2018, 2022)Jason Colby* Tate Frantz*2026 U.S. Olympic Snowboard Team (Past Olympic teams)HalfpipeWomenBea Kim* Chloe Kim (2018, 2022)Maddie Mastro (2018, 2022)Maddy Schaffrick*MenAlessandro Barbieri* Chase Blackwell* Chase Josey (2018, 2022)Jake Pates (2018)Parallel Giant SlalomWomenIris Pflum*MenCody Winters (2022)SlopestyleWomenLily Dhawornvej* Hahna Norman* Jess Perlmutter* MenJake Canter* Sean FitzSimons (2022)Red Gerard (2018, 2022)Ollie Martin* Snowboard CrossWomenStacy Gaskill (2022)Hanna Percy* Brianna Schnorrbusch*Faye Thelen (2010, 2014, 2018, 2022)Men\nNick Baumgartner (2010, 2014, 2018, 2022)Nathan Pare* Jake Vedder (2022)Cody Winters (2022)*Denotes first-time Olympian \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lindsey Vonn, Mikaela Shiffrin, Chloe Kim make Team USA's Winter Olympics squad - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/eac4b14a-9359-49ce-b669-0f17e32b1bae/thumbnail/1200x675/a30e3273576d7735eca074058b98eba5/lindsey-vonn.jpg"
      ],
      "datePublished": "2026-01-22T22:23:47.000Z",
      "dateModified": "2026-01-22T22:23:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL line movement: Bo Nix injury clouds Patriots vs. Broncos odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-line-movement-for-conference-championships-bo-nix-injury-clouds-patriots-vs-broncos-nfl-playoffs-matchup/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/153dbba6-2eab-41ae-aa3c-b84ddb0fd16c/thumbnail/1200x675/9e5297d9a50e5224370f7208576bb44e/broncos-1.jpg",
    "tag": "Sports",
    "date": "2026-01-23T10:00:53.000Z",
    "description": "\nThe Denver Broncos are the top seed in the AFC but are now the longshot among the remaining four teams to win the Super Bowl, and it all comes down t",
    "body": "\nThe Denver Broncos are the top seed in the AFC but are now the longshot among the remaining four teams to win the Super Bowl, and it all comes down to the season-ending ankle injury suffered by starting quarterback Bo Nix. The Broncos (15-3) beat the Buffalo Bills 33-30 in overtime in the Divisional Round, but it was revealed after the game that Nix needs surgery for a broken bone in his ankle. Denver entered the NFL Playoffs as the +650 third favorite to win the Super Bowl -- and top choice from the AFC -- in DraftKings' Super Bowl futures. Now, the Broncos are +1100, with the NFC's Seattle Seahawks (+145) and Los Angeles Rams (+230) the favorites and the new England Patriots (+250) becoming the clear AFC choice.The Nix injury also flipped the spread on Broncos vs. Patriots in Sunday's AFC Championship Game, set for 3 p.m. ET on CBS and Paramount+. The Broncos were set to be 1.5-point home favorites in lookahead projections, but now New England is a 4.5-point favorite at DraftKings. The Over/Under is 42.5 total points scored as it's expected to be a more defense-oriented game. The Patriots are -251 money line favorites with the Broncos priced at +206.The NFC Championship Game on Sunday, scheduled for 6:30 p.m. ET on Fox, is the third matchup of the 2025 NFL season between division foes. NFC West champions and No. 1 seed Seattle Seahawks host the Los Angeles Rams, with the winner expected to be favored to win Super Bowl 60. The teams split their two regular-season meetings, with the home team winning each time. The Seahawks are 2.5-point favorites, with DraftKings setting the Over/Under at 46.5. Seattle is a -154 favorite, and Los Angeles is priced as a +129 money-line underdog.Here, we will break down the NFL Conference Championships odds and how they have been affected since lines first opened, with odds courtesy of DraftKings Sportsbook. Patriots vs. Broncos (Sunday, 3 p.m. ET)\nOpen: Patriots -5.5, O/U 40.5Now: Patriots -4.5, O/U 42.5Denver is covering in 58% of the SportsLine model's simulations. Bet the spread at DraftKings:\nThe Broncos are going to have to win with a strong running game and a great defense, as Jarrett Stidham will be stepping in for Nix, and the sixth-year pro has just four career starts. The good news is that running back RJ Harvey has 896 total yards at 12 total TDs in his rookie season, and J.K. Dobbins (772 rushing yards in 10 games) has been practicing on a limited basis after a long IR stint. The better news is the Denver defense led the league in sacks in the regular season with 68 (four per game) and has been the driving force for this team all season. The bad news is that New England has one of the NFL's best run defenses, ranking fifth at 101.7 yards per game in the regular season. The Patriots also had the second-highest scoring offense, averaging 28.8 points per game. But the Broncos had the third-best scoring defense (18.3) and are going to make life tough on Pats QB Drake Maye. The fans at Mile High are sure to do their part as well. The SportsLine model is expecting more from the Broncos than oddsmakers are, with Denver covering the spread 58% of the time and winning outright 46% of the time. At a price of +204, the model loves the Broncos on the money line, giving the pick an \"A\" grade. The public has been hitting the Patriots hard, with about 75% of spread bets at DraftKings on New England, dropping the spread to 4.5. The total has bumped up, moving two points with the public likely expecting the Stidham-led offense to provide more chances for Maye and the Pats to add points.  Rams at Seahawks (Sunday, 6:30 p.m. ET)\nOpen: Seahawks -2.5, O/U 47.5Now: Seahawks -2.5, O/U 46.5Seattle is covering in 58% of the SportsLine model's simulations. Bet the spread at DraftKings:\nThe Seahawks are the favorite to win the Super Bowl, so they're favored here. From past experiences, if they can avoid turnovers they should have no problem beating the Rams again. They gave the ball away seven times in the two regular-season meetings but won the matchup in Seattle and missed a 61-yard field goal that would have won the game in L.A. One question is which type of game this will be, as the first was a 21-19 nail-biter and the second was a 38-37 OT thriller. The Rams had 249 total yards in their home victory but piled up 581 in the second meeting. Seattle had 415 at home and 414 in L.A., so it looks like we know what to expect from the Seahawks offense against a Rams defense that has had some problems. L.A. averaged 30.5 points in the regular season, most in the NFL, but Seattle was third at 28.4. The Seahawks defense allowed the fewest points in the league (17.2) while the Rams were 10th (20.4). The SportsLine model is leaning slightly Under the total, with simulations projecting 46 total points, and has Seattle covering 58% of the time for an \"A\" grade. At DraftKings, 83% of the spread bets and 91% of the handle are on Seattle, while 69% of bettors are on the Over.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL line movement: Bo Nix injury clouds Patriots vs. Broncos odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/153dbba6-2eab-41ae-aa3c-b84ddb0fd16c/thumbnail/1200x675/9e5297d9a50e5224370f7208576bb44e/broncos-1.jpg"
      ],
      "datePublished": "2026-01-23T10:00:53.000Z",
      "dateModified": "2026-01-23T10:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots' Kayshon Boutte: Broncos 'can rest in Cancun' after Sean Payton's quip - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-kayshon-boutte-broncos-sean-payton-comment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/3fce0f5e-6e0f-4dea-b8b3-bf8310663736/thumbnail/1200x675/272e213666b77b4fae73135cfbf2aa8c/boutte.png",
    "tag": "Sports",
    "date": "2026-01-22T21:45:28.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kayshon Boutte has clearly taken exception to Sean",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Kayshon Boutte has clearly taken exception to Sean Payton's recent comment about how Denver Broncos fans will have \"plenty of rest ... two weeks\" to rest their voices between Sunday's game against the New England Patriots and Super Bowl LX. Payton was clearly alluding to Denver winning Sunday's game, which would give Broncos fans ample time to rest of their vocal cords in time for the big game. Payton's quote was brought to Boutte's attention by media members on Thursday. \"I ain't seen it,\" Boutte said. \"They can rest in Cancun, too, at the end of the day. It is what it is.\" Never one to hide his feelings, Boutte said that the Texans are \"not too complicated on defense\" prior to New England's 28-16 win over Houston in the AFC divisional round. Patriots coach Mike Vrabel, however, didn't take the bait when he was asked about Payton's comments. \"I think we're plenty motivated for the game,\" Vrabel said. \nWhile he risked giving the Patriots bulletin board material, Payton's comments may have been made in an effort to raise the confidence level of not only Denver's fans, but its players, too. The Broncos, after all, will try to beat the Patriots with backup quarterback Jarrett Stidham under center after Bo Nix sustained a season-ending ankle injury during the end of last week's win over the Buffalo Bills. Payton's comments are a clear indication that he isn't giving his players a pass or a built-in excuse if Sunday's game doesn't go their way. It's clear that Payton still has the same expectations for his team. Payton wants Broncos fans to have the same expectations, too. As the AFC's top-seeded team, the Broncos are hoping that their fans can provide a home field advantage while making things difficult when Drake Maye and the rest of the Patriots' offense is on the field. Denver's home crowd certainly made its impact felt when the Broncos defeated the Patriots in the AFC title games after the 2013 and 2015 seasons. \nIf Denver wins, Payton's comment will likely become part of Broncos' history. If the Patriots win, rest assured that New England players and fans will make sure that he never lives it down. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots' Kayshon Boutte: Broncos 'can rest in Cancun' after Sean Payton's quip - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/3fce0f5e-6e0f-4dea-b8b3-bf8310663736/thumbnail/1200x675/272e213666b77b4fae73135cfbf2aa8c/boutte.png"
      ],
      "datePublished": "2026-01-22T21:45:28.000Z",
      "dateModified": "2026-01-22T21:45:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Damon Wilson II commits to Miami Hurricanes as likely fill for Rueben Bain Jr. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/damon-wilson-ii-commits-transfer-miami-hurricanes/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/7e85c42a-107e-4129-8c45-efffc8254126/thumbnail/1200x675/97a64c6ceca23beef9b5b805bc5d1028/gettyimages-2253361150-1.jpg",
    "tag": "Sports",
    "date": "2026-01-22T21:11:09.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Missouri transfer Damon Wilson II, who was the top",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Missouri transfer Damon Wilson II, who was the top available defensive prospect in 247Sports' Transfer Rankings, announced Thursday that he is transferring to Miami. Wilson, the No. 8 transfer nationally and the No. 2 edge rusher, chose the Hurricanes over the likes of Texas Tech and LSU, among others. In joining Miami, Wilson, a former Georgia signee, will be on his third school in three years. He had a breakout year after transferring to Missouri ahead of the 2025 season, as he led the Tigers and ranked third in the SEC with nine sacks. He also earned second-team All-SEC honors after logging a team-high 12 quarterback pressures and one interception in addition to his sacks. Wilson had at least one sack in four of Missouri's eight SEC games, including a two-sack performance in the Tigers' 27-24 loss against Alabama.A former top-50 high school prospect out of Venice, Florida, Wilson spent the first two years of his career at Georgia. He played sparingly as a true freshman before earning a rotational role in his second season when he had 22 total tackles, three sacks and two forced fumbles. \nWilson is the seventh transfer that Miami has landed during the 2026 cycle and the fourth with at least a four-star ranking. He feels a huge need for the Hurricanes, who will have to replace both of their top pass rushers from 2025' national runner-up squad. Rueben Bain Jr., who had five sacks during Miami's College Football Playoff run, is widely regarded as one of the top defensive players in the 2026 NFL Draft. Bain's running mate, Akheem Mesidor, who actually led Miami with 12.5 sacks in 2025, is also off to the NFL. \nThat means Wilson should step into a big role on Miami's defense immediately. He'll likely slot in alongside top returning EDGE Marquise Lightfoot, a former top-40 prospect that had 2.5 sacks off the bench, to offset the production left by Bain and Mesidor. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Damon Wilson II commits to Miami Hurricanes as likely fill for Rueben Bain Jr. - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/7e85c42a-107e-4129-8c45-efffc8254126/thumbnail/1200x675/97a64c6ceca23beef9b5b805bc5d1028/gettyimages-2253361150-1.jpg"
      ],
      "datePublished": "2026-01-22T21:11:09.000Z",
      "dateModified": "2026-01-22T21:11:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]