[
  {
    "title": "Buccaneers vs. Rams odds, picks: 'Sunday Night Football' best bets from 10K sims - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-rams-prediction-odds-line-spread-nfl-week-12-sunday-night-football-picks-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/0c5daeb8-fdba-40fd-aae8-cf7ff98d6604/thumbnail/1200x675/37309b4b83c3c5fdb9e4fe2ca16f3688/davante.jpg",
    "tag": "Sports",
    "date": "2025-11-24T00:32:51.000Z",
    "description": "\n        The NFL Week 12 matchup on 'Sunday Night Football' pits NFC contenders as the Los Angeles Rams host the Tampa Bay Buccaneers. The Rams (8-2) ",
    "body": "\n        The NFL Week 12 matchup on 'Sunday Night Football' pits NFC contenders as the Los Angeles Rams host the Tampa Bay Buccaneers. The Rams (8-2) are tied with Philadelphia for the best record in the conference and are riding a five-game win streak. L.A. knocked off Seattle, 21-19, in Week 11. Tampa (6-4) sits atop the NFC South but has dropped three of its last four, most recently falling to Buffalo, 44-32. The Rams have won eight of the last 10 matchups between the teams. The Bucs have ruled out Bucky Irving (shoulder/foot), while receiver Chris Godwin (fibula) is active for the first time since Week 5.Kickoff is at 8:20 p.m. ET from SoFi Stadium in Inglewood, Calif. The Bucs won the last matchup, 16-13, back in 2022. The latest Buccaneers vs. Rams odds have Los Angeles as 7-point home favorites. The over/under for total points scored is 49.5 via SportsLine consensus. L.A. is at -368 on the money line (risk $368 to win $100), with Tampa at +290 (risk $100 to win $290). Before making any Rams vs. Buccaneers picks, check out the NFL predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Buccaneers vs. Rams. You can visit SportsLine now to see the picks. Here are the football odds and trends for Rams vs. Bucs:Buccaneers vs. Rams spreadRams -7 at DraftKings SportsbookBuccaneers vs. Rams over/under49.5 pointsBuccaneers vs. Rams money line                                                                                 Rams -368, Bucs +290Buccaneers vs. Rams picks                                                                                         See picks at SportsLineBuccaneers vs. Rams streaming Fubo (Try for free)  Why the Buccaneers can coverThe Bucs are coming off a defeat, but they are also 8-2 against the spread (ATS) following a loss since the start of last season. Despite the outcome versus Buffalo last week, Tampa did put up 32 points on the scoreboard, which is its second-most of the season, despite not having Godwin, and the Buccaneers could take advantage of a slumping pass for rush the Rams. L.A. hasn't recorded a defensive sack in back-to-back games and has just one QB takedown over its last three games. Los Angeles also gave up its second-most rushing yards of the year (135) last week versus Seattle, so there are defensive holes that Tampa's top-10 scoring offense can exploit. See which team to back at SportsLine. Why the Rams can coverRecent spread results favor L.A. which is 4-1 ATS during its five-game win streak, while Tampa is just 1-3 ATS over its last four. Recent on the field results also tilt in favor of the Rams, who have won eight of the last 10 meetings between the teams, including in the postseason. This year, Matthew Stafford is the MVP favorite as he leads the NFL in passing touchdowns (27) for a Rams team which is well balanced on both sides of the ball. L.A. has the No. 6 scoring offense and the No. 2 scoring defense, making it one of two teams to rank in the top six in both. The Rams also boast the second-best turnover differential (+10) in the league and have the second-best ATS record at 7-3. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Buccaneers vs. Rams picksSportsLine's model has simulated Rams vs. Bucs 10,000 times and is going Under on the total, projecting 48 combined points. It also says one side of the spread hits in almost 60% of simulations.     You can only get the pick at SportsLine. So who wins Bucs vs. Rams, and which side of the spread hits almost 60% of the time? Visit SportsLine now to see which side of the Rams vs. Buccaneers spread to jump on, all from the advanced model that finished up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Buccaneers vs. Rams odds, picks: 'Sunday Night Football' best bets from 10K sims - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/0c5daeb8-fdba-40fd-aae8-cf7ff98d6604/thumbnail/1200x675/37309b4b83c3c5fdb9e4fe2ca16f3688/davante.jpg"
      ],
      "datePublished": "2025-11-24T00:32:51.000Z",
      "dateModified": "2025-11-24T00:32:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Buccaneers vs. Rams prediction, odds: Expert picks for 'Sunday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/buccaneers-rams-prediction-odds-line-spread-2025-week-12-sunday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/e033630d-f1a2-4c89-9a73-6713ab0fd4f7/thumbnail/1200x675/6739f74487d577188388527f7683a6d0/imagn-sean-tucker-buccaneers.jpg",
    "tag": "Sports",
    "date": "2025-11-24T00:01:43.000Z",
    "description": "\n        Division leaders clash when the NFC South-leading Tampa Bay Buccaneers take on the NFC West-leading Los Angeles Rams on 'Sunday Night Footbal",
    "body": "\n        Division leaders clash when the NFC South-leading Tampa Bay Buccaneers take on the NFC West-leading Los Angeles Rams on 'Sunday Night Football'. Tampa Bay is coming off a 44-32 loss at Buffalo last week, while Los Angeles defeated Seattle 21-19. The Buccaneers (6-4), who have lost two in a row, are 4-2 on the road this season. The Rams (8-2), who have won five consecutive games, are 4-1 on their home field. L.A. is 7-3 ATS, with the Bucs 5-5 versus the line. Chris Godwin (leg) is questionable, while Tristan Wirfs does not carry an injury designation for Tampa.Kickoff from SoFi Stadium in Inglewood, Calif., is set for 8:20 p.m. ET. The Rams lead the all-time series 19-10, including being 5-1 all-time in games played in L.A. Los Angeles is a 7-point favorite in the latest Buccaneers vs. Rams odds, while the over/under for total points scored is 49.5. L.A. is at -368 on the money line (risk $368 to win $100), while Tampa is priced at +290 (risk $100 to win $290). Before you make any Rams vs. Buccaneers picks, make sure to check out the NFL predictions from SportsLine NFL expert Larry Hartstein.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:A former lead writer for Covers and The Linemakers, Hartstein combines a vast network of Vegas sources with an analytical approach he honed while working for Pro Football Focus. Hartstein tied for 52nd place (out of 1,598 entries) in the 2022 Westgate Las Vegas SuperContest, going 53-34-3 ATS. He is coming off a down 2024 NFL season at SportsLine that puts him at 967-821 all-time on NFL sides and props (plus 13.8 units), including 593-518 ATS. Entering the 2025-26 season, he has been profitable in five of six seasons, going 659-564 ATS (plus $3,556 for $100 players). In addition, Hartstein has gone 26-10 on his last 36 picks involving the Rams, returning more than $1,500. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, Hartstein has set his sights on Buccaneers vs. Rams and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Rams vs. Bucs:Buccaneers vs. Rams                 spreadLos Angeles -7 at DraftKings SportsbookBuccaneers vs. Rams                     over/under49.5 pointsBuccaneers vs. Rams                     money line Tampa Bay +290, Los Angeles Rams -368Buccaneers vs. Rams                 picksSee picks at SportsLineBuccaneers vs. Rams                     streaming Fubo (Try for free)  New users can also check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make Buccaneers vs. Rams  picksFor Sunday Night Football's matchup, Hartstein is leaning over the total. The Buccaneers are 5-5 against the spread in their last 10 games with the over hitting in six of 10 games. The Rams, meanwhile, are 7-3 ATS in their last 10 games with the under going 5-4-1 in that same stretch. The teams have scored a lot of points in their last seven meetings, with the over going 6-1, with the Rams winning five of those matchups.Matthew Stafford is having an MVP-type year, completing 66% of his passes for 2,557 yards and 27 touchdowns with just two interceptions and a rating of 112.7. Baker Mayfield leads Tampa Bay, completing 63.5% of his passes for 2,365 yards and 17 touchdowns with three interceptions and a 97.0 rating. Both former No. 1 overall picks, Stafford and Mayfield are each projected to have at least 250 total yards with them combining for 3.50 passing touchdowns on average. Hartstein has also identified a critical X-factor that makes one side of the spread a must-back. He's only sharing what it is, and which side to back, at SportsLine.Who wins Bucs vs. Rams, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Buccaneers vs. Rams spread you need to jump on, all from the expert that is 26-10 on his last 36 Los Angeles Rams picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Buccaneers vs. Rams prediction, odds: Expert picks for 'Sunday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/e033630d-f1a2-4c89-9a73-6713ab0fd4f7/thumbnail/1200x675/6739f74487d577188388527f7683a6d0/imagn-sean-tucker-buccaneers.jpg"
      ],
      "datePublished": "2025-11-24T00:01:43.000Z",
      "dateModified": "2025-11-24T00:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Panthers prediction, odds: 'Monday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-panthers-prediction-odds-line-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/76866127-4bd0-4dc8-ac1f-b013d83eb93c/thumbnail/1200x675/f71c7906faf9f98b5e7c5e194cfe4da2/rico-dowdle-carolina-panthers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-24T12:08:45.000Z",
    "description": "\n        Teams hoping to finally put together a winning streak will meet on 'Monday Night Football' as the San Francisco 49ers host the Carolina Panth",
    "body": "\n        Teams hoping to finally put together a winning streak will meet on 'Monday Night Football' as the San Francisco 49ers host the Carolina Panthers. San Fran (7-4) has alternated wins and losses over its last nine games and is coming off a 41-22 victory over Arizona in Week 11. Carolina (6-5) has alternated wins and losses over its last five contests, most recently knocking off Atlanta, 30-27 in overtime, on Sunday. The Niners entered NFL Week 12 ranked seventh in the NFC standings, with the Panthers ninth. Linebackers Christian Rozeboom (hip/hamstring) and Trevin Wallace (shoulder) along with center Cade Mays (ankle) are out for Carolina. Kicker Eddy Pineiro (hamstring) and linebacker Tatum Bethune (ankle) are out for the Niners. Kickoff is at 8:15 p.m. ET from Levi's Stadium in Santa Clara, Calif. The Niners have won the last two matchups, with the most recent meeting coming in 2022. San Francisco is the 7.5-point favorite in the latest Panthers vs. 49ers odds, while the over/under for total points scored is 49.5. Before making any 49ers vs. Panthers picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $200 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 12 on a 48-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on Carolina vs. San Francisco. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for 49ers vs. Panthers:Panthers vs. 49ers        spread49ers -7.5 at DraftKings SportsbookPanthers vs. 49ers             over/under49.5 pointsPanthers vs. 49ers             money line 49ers -395, Panthers +305Panthers vs. 49ers             picksSee picks at SportsLinePanthers vs. 49ers     streaming Fubo (Try for free)Why the Panthers can coverBryce Young has been one of the best quarterbacks versus the spread this season, going 7-2 ATS over his last nine starts. Carolina has covered in five of six games versus NFC opponents in 2025, and its MNF opponent has major defensive holes. The Niners can neither get to the quarterback nor take the ball away as they rank dead last in defensive sacks and also have the second-fewest picks. That should bring comfort to Young in the pocket, while he also has the league's No. 4 rusher in Rico Dowdle to lean on. Finally, there doesn't appear to be much of a home-field advantage for the 49ers who have eight giveaways versus just one takeaway at Levi's Stadium this year. See which team to back at SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states:Why the 49ers can coverA finally healthy Brock Purdy showed what San Francisco is capable of last week as the Niners scored a season-high of 41 points after averaging just 22 on the season. The offense, however, runs through Christian McCaffrey, who leads the NFL in scrimmage yards and is on pace for 1,000-yard seasons both on the ground and through the air. George Kittle has also made an impact since coming off IR, with four scores over his last four games, and San won't see the most threatening of offenses come Monday. Carolina ranks 28th in scoring, with additional bottom-10 marks in passing offense, third down offense and yards per play. See which team to back at SportsLine. Check out the latest BetMGM promo code CBSSPORTS, where new users can get up to $1,500 in bonus bets if your first bet loses.How to make 49ers vs. Panthers   picksFor Panthers vs. 49ers   on 'Monday Night Football,' the model is leaning Over the total, projecting 52 combined points. It also says one side of the spread hits well over 50% of the time in an A-rated pick. See what it is at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.Who wins 49ers vs. Panthers, and which side of the spread hits in well over 50% of simulations in an A-rated pick? Visit SportsLine now to see which side of the Panthers vs. 49ers spread you need to jump, all from the model that is 48-33 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Panthers prediction, odds: 'Monday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/76866127-4bd0-4dc8-ac1f-b013d83eb93c/thumbnail/1200x675/f71c7906faf9f98b5e7c5e194cfe4da2/rico-dowdle-carolina-panthers-imagn-images.jpg"
      ],
      "datePublished": "2025-11-24T12:08:45.000Z",
      "dateModified": "2025-11-24T12:08:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Browns' QB Shedeur Sanders throws first career TD vs. Raiders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/shedeur-sanders-browns-qb-first-career-touchdown/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/1e9fa494-8817-4b51-ab38-78f8190526f8/thumbnail/1200x675/cda012b5d2537e525fb12ef7301e6caa/shedeur-sanders-browns-3.jpg",
    "tag": "Sports",
    "date": "2025-11-24T00:16:45.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shedeur Sanders threw his first career NFL touchdo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Shedeur Sanders threw his first career NFL touchdown pass Sunday, sending a swing pass out to running back Dylan Sampson, who burst past the Raiders' defense 66 yards untouched.\nSanders made his NFL debut in Week 11, coming in for an injured Dillon Gabriel (concussion) in the second half against the Ravens and struggling. But given a week of preparation, Sanders looked much more prepared and poised. He completed a 52-yard pass to Isaiah Bond earlier in the game, a completion that had been Cleveland's longest of the year before the pass to Sampson above.With the touchdown pass, Sanders also went over the 200-yard passing mark.\nCrucially, Sanders has for the most part avoided mistakes. After throwing an interception and taking two sacks in just one half of action last week, Sanders had one interception and just one sack at the time of his touchdown throw.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Browns' QB Shedeur Sanders throws first career TD vs. Raiders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/1e9fa494-8817-4b51-ab38-78f8190526f8/thumbnail/1200x675/cda012b5d2537e525fb12ef7301e6caa/shedeur-sanders-browns-3.jpg"
      ],
      "datePublished": "2025-11-24T00:16:45.000Z",
      "dateModified": "2025-11-24T00:16:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots rookie OL Will Campbell to have MRI after knee injury vs. Bengals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/new-england-patriots-will-campbell-knee-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/72ae2571-84d6-4252-b587-deb4bef64d1f/thumbnail/1200x675/3bc6e51b93d04d71b16d520a130c53df/will-campbell.jpg",
    "tag": "Sports",
    "date": "2025-11-23T22:23:14.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        New England Patriots rookie offensive tackle Will ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        New England Patriots rookie offensive tackle Will Campbell was carted off the field with a knee injury during Sunday's 26-20 victory over the Cincinnati Bengals. The No. 4 overall pick went down with the injury in the third quarter and he was officially ruled out in the fourth quarter.Campbell's leg was landed on at the end of a 4-yard run. He went to the blue medical tent, then looked emotional as he was carted off, putting a towel over his head as he exited the field.The rookie has played 695 offensive snaps, or 98.3%, this year before going down with the injury.\nPatriots left guard Jared Wilson exited the game in the first quarter with an ankle injury. According to ESPN Research, Wilson and Campbell were only the second rookie duo to open a season as starters at left guard and left tackle since 2000. Veteran tackle Vederian Lowe and veteran guard Ben Brown came in to replace the injured linemen.\nThis year, the Patriots have remained relatively healthy and started the same offensive line for 10 of their 11 games. Quarterback Drake Maye, who is in the MVP conversation, has benefited from the consistency the offensive line has provided.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots rookie OL Will Campbell to have MRI after knee injury vs. Bengals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/72ae2571-84d6-4252-b587-deb4bef64d1f/thumbnail/1200x675/3bc6e51b93d04d71b16d520a130c53df/will-campbell.jpg"
      ],
      "datePublished": "2025-11-23T22:23:14.000Z",
      "dateModified": "2025-11-23T22:23:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cal fires Justin Wilcox: Bears coach was 48-55 across nine seasons with program - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/justin-wilcox-fired-cal-bears-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/04/04/0e73c297-cead-4aa1-8275-d4e7278a9cb5/thumbnail/1200x675/4c1708a75e2bd5b34ed1597dd5ba1ffe/adobe-express-file-52.jpg",
    "tag": "Sports",
    "date": "2025-11-24T03:14:18.000Z",
    "description": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        California fired coach Justin Wilcox on Sunday after nin",
    "body": "\n    \n    \n                    \n                USATSI\n            \n            \n    \n        California fired coach Justin Wilcox on Sunday after nine seasons leading the program, the school announced on Sunday. CBS Sports first reported the news of Wilcox's firing earlier in the day. The school owes Wilcox $10,879,167 in buyout money, according to USA Today's college football coaching salary database. The Golden Bears are 6-5 this season but just suffered an embarrassing 31-10 loss to rival Stanford in Week 13. Former Washington State coach Nick Rolovich, currently a senior offensive assistant with the Bears, will be the interim coach. \"I want to thank Justin for all of his contributions to our football program, our athletic department and our university,\" Cal general manager Ron Rivera said in a statement. \"He has always comported himself with class and professionalism. After careful consideration, we believe the time has come for new leadership. We wish Justin the best of luck in his future endeavors.\"\nIt's been an uneven year overall for Cal. It began the season 3-0 with a lot of momentum thanks to the presence of freshman quarterback Jaron-Keawe Sagapolutele. Things have been much more uneven since, however. The Bears were blown out 34-0 by San Diego State in nonconference play, and they're just 3-4 on the season in the ACC. Wilcox, 49, was once considered one of the top up-and-coming coaches on the West Coast -- so much so he was a candidate for Oregon when Mario Cristobal left the program following the 2021 season. It's been a difficult run for Wilcox in the time since. The Bears haven't produced a winning season since 2019, and they're just 22-27 over the last four seasons. \nCal currently has a pair of interim athletic directors. It's expected that Rivera will have a large say in the upcoming coaching search to replace Wilcox. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cal fires Justin Wilcox: Bears coach was 48-55 across nine seasons with program - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/04/04/0e73c297-cead-4aa1-8275-d4e7278a9cb5/thumbnail/1200x675/4c1708a75e2bd5b34ed1597dd5ba1ffe/adobe-express-file-52.jpg"
      ],
      "datePublished": "2025-11-24T03:14:18.000Z",
      "dateModified": "2025-11-24T03:14:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WATCH: Christian Pulisic win Derby della Madonnina for AC Milan with clutch goal - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/watch-christian-pulisic-goal-ac-milan-vs-inter-highlight/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/11847af6-5b59-43e3-80dd-347042555e5f/thumbnail/1200x675/4aba92b207f9388d2a37b91c14bf477c/pulisic.jpg",
    "tag": "Sports",
    "date": "2025-11-23T22:59:03.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Christian Pulisic is back and AC Milan shined as t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Christian Pulisic is back and AC Milan shined as the Rossoneri won 1-0 in the Derby della Madonnina against Inter, thanks to the goal scored by the American captain in the second half at San Siro. Despite a match in which Cristian Chivu's side pushed hard—especially in the first half, when Francesco Acerbi and Lautaro Martinez both hit the post, AC Milan capitalized on a fast transition, with the American international scoring after a poor save from Yann Sommer. The Nerazzurri tried to at least equalize but even Hakan Calhanoglu missed his second-ever penalty since he joined the Italian Serie A, which was saved by Mike Maignan, who was voted MVP of the match after making two incredible saves in the first half on Marcus Thuram and Lautaro. AC Milan are now only two points behind AS Roma, the leaders of the standings, who next week will face Napoli at the Stadio Olimpico, while Inter are now three points behind the Giallorossi. Let's take a look at the winning goal scored by Pulisic:  \nThe American striker was once again the star of the night in Milan and scored his fifth goal of the Serie A season in eight matches played so far, and he started against Inter for the first time this season alongside Rafael Leao, which was the initial plan of manager Massimiliano Allegri before both players struggled with injuries in the first part of the season. Pulisic showed to be ready after he recovered from the injury, as he also missed the international break with the USMNT to prepare ahead of his comeback in Italy and immediately proved again to be a pivotal player for the Serie A giants. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WATCH: Christian Pulisic win Derby della Madonnina for AC Milan with clutch goal - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/11847af6-5b59-43e3-80dd-347042555e5f/thumbnail/1200x675/4aba92b207f9388d2a37b91c14bf477c/pulisic.jpg"
      ],
      "datePublished": "2025-11-23T22:59:03.000Z",
      "dateModified": "2025-11-23T22:59:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Raiders fire offensive coordinator Chip Kelly amid 2-9 start - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/raiders-fire-offensive-coordinator-chip-kelly-amid-2-9-start-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/0ee56079-7eb8-4e79-ac07-87fccec48b89/thumbnail/1200x675/a9c75b48f32bfb1b4f52b5b771c848c2/chip.jpg",
    "tag": "Sports",
    "date": "2025-11-24T04:48:37.000Z",
    "description": "\n        The Las Vegas Raiders have fired offensive coordinator Chip Kelly following Sunday's 24-10 loss to the Cleveland Browns. The loss dropped the",
    "body": "\n        The Las Vegas Raiders have fired offensive coordinator Chip Kelly following Sunday's 24-10 loss to the Cleveland Browns. The loss dropped the Raiders to 2-9 on the season. \"I spoke with with Chip Kelly earlier this evening and informed him of his release as offensive coordinator of the Raiders,\" Raiders coach Pete Carroll said in a statement. \"I would like to thank Chip for his service and wish him all the best in the future.\" Kelly, 61, was on the job for less than a year. Sunday's game marked the sixth time this year that the Raiders' offense failed to score at least 20 points. Over its past three games, Las Vegas scored just 7, 16 and 10 points, respectively.Kelly is the second assistant coach the Raiders have fired this season. The team parted ways with former special teams coach Tom McMahon following their Week 10 loss to Denver. Sunday was largely a microcosm of the Raiders' offense this season. Against the Browns, the Raiders had just 268 total yards, were 4 of 17 on third down and had just one trip inside Cleveland's 20-yard line. Quarterback Geno Smith was sacked a whopping 10 times, while first-round pick Ashton Jeanty was held to 50 yards on 17 carries. \nThe Raiders' offense entered Sunday's game ranked 30th in the NFL in scoring, 25th in passing, 30th in rushing and in red zone efficiency, and 21st in third-down efficiency. While Kelly surely deserves some blame, it wasn't like he and the Raiders' offense was set up to have much success this season. In fact, the team traded one of their few proven skill players -- wideout Jakobi Meyers -- before the trade deadline. The Raiders have also continuously received spotty play from Smith, who despite his struggles has continued to get the support of Carroll. Kelly was fresh off of winning a national title with Ohio State before returning to the NFL. Prior to the Raiders and Ohio State, Kelly was UCLA's head coach from 2018-23. He was the Eagles' head coach from 2013-15 before spending one season as the 49ers coach. \nKelly's coaching breakthrough occurred at Oregon, where he spent two years as offensive coordinator before being promoted to head coach. He led the Ducks to a Rose Bowl victory in 2011 and a Fiesta Bowl win in 2012.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Raiders fire offensive coordinator Chip Kelly amid 2-9 start - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/0ee56079-7eb8-4e79-ac07-87fccec48b89/thumbnail/1200x675/a9c75b48f32bfb1b4f52b5b771c848c2/chip.jpg"
      ],
      "datePublished": "2025-11-24T04:48:37.000Z",
      "dateModified": "2025-11-24T04:48:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 12 breakouts: Dylan Sampson is worth stashing with Shedeur Sanders at QB - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-12-breakouts-dylan-sampson-is-worth-stashing-with-shedeur-sanders-at-qb/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/50c6fe3f-d0ad-403a-819d-613d2dfe8002/thumbnail/1200x675/3fa9578d51c77475505785c2c211ada4/gettyimages-2248126910.jpg",
    "tag": "Sports",
    "date": "2025-11-24T03:06:17.000Z",
    "description": "\n        In Week 12, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and",
    "body": "\n        In Week 12, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 13 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Dylan Sampson, RB, BrownsThe Browns haven't decided on a starting quarterback for Week 13 just yet, but it would be unlikely they don't stick with Shedeur Sanders. That is great news for Sampson. One thing the Browns are going to focus on with Sanders at quarterback is providing him with easy outlets in the pass game. Sanders has taken very first first-team reps and he hasn't seen many plays at NFL speed (preseason isn't the same speed). Screen passes and designed quick hitters to Sampson will serve as an extension of the run game they intend to lean on. Sampson has proven himself an explosive playmaker from earlier this season and I have a sneaky suspicion he might become a player with a role in a Sanders-led offense. I'm stashing him this week in 12-team leagues or deeper.Shedeur Sanders, QB, BrownsSanders' raw stat line looks a lot better than his EPA per play, but raw stats play in Fantasy Football and as long as he can hit a few explosive plays each game then he is at the very least worth monitoring. I'm waiting for this week to confirm it on the All-22, but it feels pretty obvious Sanders should have been starting over Dillon Gabriel weeks ago. I say that as someone skeptical of Sanders' ceiling. It's more of an indictment of Gabriel. But Sanders does do a few things that are Fantasy friendly. He can create off script throws downfield because he keeps his eyes up when he's breaking pocket. He is also a lot more accurate than Gabriel which will lead to more plays like the long gain to Jerry Jeudy where he broke pocket, reset his feet and then relied on his mechanics to deliver the ball accurately downfield. I've watched Gabriel miss these throws all season. Sanders has enough on offense and a budding rapport with Sampson. I wouldn't add him in leagues that start just one quarterback just yet.\nCam Ward, QB, TitansWelcome to the Fantasy Football world Mr. No. 1 overall pick Cam Ward! We've seen flashes before this season, but Ward put together a strong second half and it translated to his breakout Fantasy performance of his rookie season. Ward racked up 256 passing yards and a touchdown and he ran more. Ward finished with six carries for 37 rushing yards and a touchown. He was the fifth-highest scoring Fantasy QB heading into Sunday Night Football. Ward may have some late season value in 2QB and SuperFlex leagues. John Metchie, WR, JetsIt's the Tyrod Taylor era for the Jets -- at least for now -- and he certainly likes to get Metchie involved. Metchie finished Week 12 with six receptions on seven targets for 65 yards and a score. For now, he's just a stash. Metchie could work his way into the WR3 range in specific plus matchups if he can continue to build his rapport out with Taylor. \nDarnell Mooney, WR, FalconsThis one only applies to shallow leagues, but if Mooney is still on your waiver wire, fix that. He is and has always been a favorite of Kirk Cousins. Their rapport will continue to grow with more practice reps. Mooney is a threat to score on any touch. Cousins can still get the ball out on time -- well at least some of the time -- despite some of the physical traits dropping off.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 12 breakouts: Dylan Sampson is worth stashing with Shedeur Sanders at QB - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/50c6fe3f-d0ad-403a-819d-613d2dfe8002/thumbnail/1200x675/3fa9578d51c77475505785c2c211ada4/gettyimages-2248126910.jpg"
      ],
      "datePublished": "2025-11-24T03:06:17.000Z",
      "dateModified": "2025-11-24T03:06:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WNBA Draft Lottery winners and losers: Dallas Wings get No. 1 pick again - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/2026-wnba-draft-lottery-dallas-wings-win-no-1-overall-pick/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/26c4acec-2025-4b38-8507-9eda0d366c5d/thumbnail/1200x675/382b442536561f04bad73df9e87aa777/dallas-wings-paige-buckers-aziaha-james-wnba-draft-lottery.png",
    "tag": "Sports",
    "date": "2025-11-24T02:06:05.000Z",
    "description": "\n        The Dallas Wings have won the 2026 WNBA Draft Lottery and will have the No. 1 overall pick in the 2026 WNBA Draft next spring. This is the se",
    "body": "\n        The Dallas Wings have won the 2026 WNBA Draft Lottery and will have the No. 1 overall pick in the 2026 WNBA Draft next spring. This is the second year in a row that the Wings have won the top pick. Last year they selected Paige Bueckers, who went on to win 2025 WNBA Rookie of the Year. Franchises winning the No. 1 pick in back-to-back years has become a trend in the WNBA over the last decade. The Wings are the fourth team to have back-to-back No. 1 picks since 2015, joining the Seattle Storm (2015, 2016), Las Vegas Aces (2017, 2018, 2019) and Indiana Fever (2023, 2024). The Wings had the best odds to receive the top pick at 42%, so it was no surprise when they won. In fact, the lottery wound up going chalk. The Minnesota Lynx will pick No. 2, followed by the Storm, Washington Mystics and Chicago Sky. Per the WNBA, this is the fifth time in league history that the lottery results matched the order of chances held by the lottery teams. 2026 WNBA Draft first round orderNote: The expansion Tempo and Fire will be slotted in after the lottery. A coin flip will determine which team picks No. 6 and which team picks No. 7. \nDallas WingsMinnesota Lynx (via Chicago)Seattle Storm (via Los Angeles)Washington MysticsChicago Sky (via Connecticut)Toronto Tempo/Portland FireToronto Tempo/Portland FireGolden State ValkyriesWashington Mystics (via Seattle)Indiana FeverWashington Mystics (via New York)Connecticut Sun (via Phoenix)Atlanta DreamSeattle Storm (via Las Vegas)Connecticut Sun (via Minnesota)Unlike the past two years, when Cailtin Clark and Paige Bueckers were the clear top prospects, there is no consensus No. 1 pick in this year's class -- at least not right now. Spanish center Awa Fam has the most upside, but she is only 19 years old and no international player has gone No. 1 since Lauren Jackson in 2001. UCLA center Lauren Betts will also receive consideration for the top pick, and there are a number of talented guards, including TCU's Olivia Miles, who could play their way into the mix. Now that the lottery is in the books and the draft order is set, let's take a look at some winners and losers from the night's results. Winner: WingsThis is an obvious one, but the Wings are the biggest winner of the night. This is the second year in a row that the franchise has had the top pick, and the third time since 2021. In the 2025 WNBA Draft, the Wings took former UConn star Paige Bueckers, who went on to have a historic rookie season and established herself as a franchise cornerstone. \nThere's no clear choice this time around, but it's always exciting to control the board and the Wings are still thrilled with their luck. On ESPN's broadcast, analyst Chiney Ogwumike said she sent a text to Wings general manager Curt Miller, who responded with three letters: \"LFG.\" Aside from the addition of Bueckers, nothing went to plan for the Wings in 2025. They were beset by injuries, ended up trading NaLyssa Smith and DiJonai Carrington and finished in last place at 10-34, which tied the league's single-season losses record. First-year coach Chris Koclanes, who appeared out of his depth, was fired soon after their campaign came to an end. As bad as 2025 was, there's plenty of hope for the future in Dallas, especially after winning the lottery again. Bueckers is already an All-WNBA caliber player, fellow rookies Aziaha James and JJ Quinerly showed some flashes and former lottery picks Maddy Siegrist and Diamond Miller are signed for 2026. Bringing in a player like Fam, who makes a lot of sense for the Wings, would give them an exciting young core. \nOff the court, Miller is one of the most well-respected executives in the league and new coach Jose Fernandez comes highly regarded for the work he did at the collegiate level with South Florida. Add in a new practice facility, which is expected to open before the 2026 season starts, and things are finally looking up in Dallas. \nLoser: SkyThe Sky only had a 5.5% chance at winning the top pick, and the most likely outcome was always that they would wind up at No. 5. Still, Sunday's result highlighted the mess that the franchise is in. Ever since their 2022 playoff collapse, the Sky have made a series of short-sighted, win-now moves that have resulted in a combined 41-83 record over the last three seasons, one playoff appearance and zero playoff wins. Last season, they went 10-34 to tie the league's single-season losses mark. \nDespite such an abysmal record, the Sky were lucky to even be in the lottery. They owe their 2026 first-round pick to the Lynx, who wound up with the No. 2 selection thanks to the Sky's odds. If not for a pair of separate deals with the Sun and Mercury, which allowed the Sky to swap first-round picks with the Sun, they wouldn't have had a lottery pick. The Sky can still add a good player. There is an abundance of backcourt talent in this class -- Olivia Miles, Azzi Fudd, Flau'jae Johnson and Ta'Niya Latson -- and Chicago still needs a guard for the future after trading the No. 3 pick in last year's draft (Sonia Citron) for Ariel Atkins. But at No. 5, they won't have their choice of the bunch. Once again, the Sky's future options have been limited by their past mistakes. Winner: LynxThe Lynx went 34-10 last season to tie the league's single-season wins record, and were the clear favorites to win the title until they suffered a playoff collapse -- partially due to key injuries to Napheesa Collier and DiJonai Carrington -- in the second round against the Mercury. \nIt goes without saying that the Lynx are not a typical lottery team, but thanks to a series of trades with the Sky, they own Chicago's 2026 first-round pick. As a result, the Lynx will select in the lottery for the first time since 2023, and will have a chance to add a top talent to one of the league's top rosters (assuming they re-sign the majority of their core in free agency). At No. 2, the Lynx will have plenty of choices. One of Fam or Betts is guaranteed to be available, and the Lynx could use additional frontcourt depth. And if they want to bolster their backcourt, the likes of Olivia Miles, Azzi Fudd and Flau'jae Johnson could all help their cause immediately. Furthermore, plenty of teams would be eager to trade up and take the Lynx's spot, and Minnesota could look to orchestrate a trade for a more established player(s). Whatever happens in April, the Lynx are going to be even better in 2026, and that's bad news for the rest of the league. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WNBA Draft Lottery winners and losers: Dallas Wings get No. 1 pick again - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/26c4acec-2025-4b38-8507-9eda0d366c5d/thumbnail/1200x675/382b442536561f04bad73df9e87aa777/dallas-wings-paige-buckers-aziaha-james-wnba-draft-lottery.png"
      ],
      "datePublished": "2025-11-24T02:06:05.000Z",
      "dateModified": "2025-11-24T02:06:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Messi sends Miami to MLS Cup semis, but don't discount Mascherano's impact - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/lionel-messi-inter-miami-score-fc-cincinnati-mls-cup-playoffs-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/35e97ac9-4693-459f-a908-b32a059bd35f/thumbnail/1200x675/8b56ecb263a29643c017362b555d0517/messi-10.jpg",
    "tag": "Sports",
    "date": "2025-11-24T00:32:02.000Z",
    "description": "\n        Lionel Messi and Inter Miami are now 90 minutes from their first MLS Cup appearance in their history after defeating FC Cincinnati 4-0 at TQL",
    "body": "\n        Lionel Messi and Inter Miami are now 90 minutes from their first MLS Cup appearance in their history after defeating FC Cincinnati 4-0 at TQL Stadium on Sunday. As has been the case during the playoffs, the Herons have been able to lean on their talisman in Messi, who opened the scoring with a header in the first half before he added a hat trick of assists, being involved in all four goals. That's his sixth goal of the MLS Cup playoffs so far, but this game was far from a solo effort by the Argentine. \nWith Luis Suarez available following his suspension, manager Javier Mascherano was left with an important choice of putting him back in the lineup or continuing on with 19-year-old Mateo Silvetti. Mascherano continued with Silvetti, and he put in a professional performance, assisting Messi's opening goal before adding to Miami's lead with a lovely finish of his own to make it 2-0. With only six appearances for Inter Miami following his move from Newell's Old Boys in August, you would've thought that Silvetti was leading the line the entire season with how his movement synced up with Messi and Tadeo Allende while Suarez looked on from the bench.As Suarez is 38, we could be seeing the future of the nine for Inter Miami taking hold in the playoffs now. Silvetti already has a goal and two assists in two playoff appearances, and it'd be hard for Mascherano to take him out of the XI with the Eastern Conference final on the line. Miami have yet to win a trophy this season, so capping things off with an MLS Cup title would be a sweet way to end the season, and there's a chance that they may be able to continue things at Chase Stadium to also close the stadium out on a high with the new Miami Freedom Park set to open in 2026.\nIf New York City FC defeat the Philadelphia Union on Saturday night, Miami will not only host the Eastern Conference final, but they'll have hosting priority for the remainder of the playoffs due to having more points in the Supporters' Shield standings than any of the remaining teams outside of the Union. If the Union win, they'd host the final.Playing home or away hasn't been an issue for the Herons, who have found their balance during these playoffs. New the end of the season, Mascherano gave Rocco Rios Novo the starting job at goalkeeper over Oscar Ustari, and he has run away with it, and when it has mattered, key decisions by the manager have made the difference. Miami have gone more than 200 minutes without conceding a goal during the playoffs, and changes such as Rios Novo are the reason behind that.\n Messi may be what powers this team, evident by being invovled in every Miami goal this postseason, but for the supporting cast to keep him in the playoffs, Mascherano has done an excellent job responding to adversity. This win also extends the careers of Sergio Busquets and Jordi Alba, who will retire at the end of the season, while giving Evander and FC Cincinnati a long offseason to think about the opportunities missed during this playoff run. But Miami will march on with nothing but winning the MLS Cup on their minds. With Messi's supporting cast on all cylinders, they just may get there too.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Messi sends Miami to MLS Cup semis, but don't discount Mascherano's impact - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/35e97ac9-4693-459f-a908-b32a059bd35f/thumbnail/1200x675/8b56ecb263a29643c017362b555d0517/messi-10.jpg"
      ],
      "datePublished": "2025-11-24T00:32:02.000Z",
      "dateModified": "2025-11-24T00:32:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Baseball Trade Reaction: Arrow up for Marcus Semien, down for Brandon Nimmo in trade of boring vets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-trade-reaction-arrow-up-for-marcus-semien-down-for-brandon-nimmo-in-trade-of-boring-vets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/02/01/8d6b125f-c11a-4800-8241-112708b8384c/thumbnail/1200x675/4d31869ae60646f69c44ba9551d566ad/marcus-semien.jpg",
    "tag": "Sports",
    "date": "2025-11-23T23:46:36.000Z",
    "description": "\n        The Mets figure to be big players in free agency this offseason (as they have been every offseason, lately), and they might have tipped their",
    "body": "\n        The Mets figure to be big players in free agency this offseason (as they have been every offseason, lately), and they might have tipped their hand about which direction they are looking Sunday, trading long-time outfield stalwart Brandon Nimmo to the Rangers in exchange for second baseman Marcus Semien.It's a big-name trade, but the impact for real life may revolve more around the fact that the Mets now have a wide open spot to chase after Kyle Tucker or another premier outfielder in free agency. For Fantasy Baseball, the impact might not be huge either, though it should make us a bit more open to the possibility of a bounceback season for Semien, at least. So that's where we'll start. Semien's Fantasy value seems to be in free fall. He finished as the No. 23 second baseman in Fantasy in 2025, and it wasn't just because he missed 35 games, his first time missing more than seven games in a season since 2017. Even when Semien was on the field, the play wasn't up to his usual standards. His strikeout rate creeped up to 17.4%, the highest it has been since 2021, and his overall line fell to .230/.305/.364, leading to the lowest wOBA of his career at .295, 11 points lower than his 2024 mark.But if you crack under the hood, things don't look quite as dire. Semien's athletic traits seem intact, to start with. He remains a very valuable defender, for example, and his sprint speed was still in the 81st percentile in 2025, right in line with his 2024 mark. His bat speed is also basically unchanged, going from 68.7 mph to 68.3 to 68.4 in the three seasons BaseballSavant.com has been tracking it. \nIn fact, Semien's damage on contact actually rebounded a bit last season. His xwOBA on contact was .341, up from .329 in 2024, and his average exit velocity moved in the same direction. The uptick in strikeout rate distracted from that, and likely stemmed from a slip in his contact skills. Given his age – Semien turned 35 midway through September – it doesn't make much sense to bet on a bounceback in that regard, even if his swing decisions and swing speed don't look much different than they did before.But there are a couple of reasons to think this trade could lead to better days for Semien, or at least a more gentle final decline phase for his career. For one thing, Semien actually underperformed his expected stats in 2025, putting up that .295 wOBA with a .318 xwOBA; for his career, Semien has overperformed his expected wOBA by about 10 points. And he might be more likely to do so by getting out of Globe Life Field, where he had a .277 wOBA last season compared to a .311 mark on the road. Citi Field, the Mets' home, isn't necessarily a great place to hit, ranking 21st in park factor for hitters over the past three seasons; Globe Life Field ranks second-to-last ahead of only Seattle. You certainly shouldn't expect a vintage Semien season in 2026, or anything. He'll likely continue to be a big drain on your batting average even in a best-case scenario, and you're probably looking at a ceiling of 25 homers. But he could run more in New York to go along with a potential bounce back in overall hitting, making him a reasonable candidate for a top-12 ranking at a weak second base position. \nAs for Nimmo, he was clearly the better hitter in 2025, and his ability to get on base is something the Rangers could really benefit from at the top of the lineup. However, despite being a few years younger than Semien, there are some bigger red flags in his athletic profile that make the possibility of a steep drop off in the coming years pretty scary. I'm not necessarily projecting that for 2025, and as a No. 3 outfielder, he remains a decent bet for Fantasy.  But it's not like there's a ton of upside to get excited about here, and with a downgrade both in his home ballpark and lineup, it's fair to discount Nimmo a bit. He's still in that No. 3 outfielder range, but if you want to push him down to around 40th or so, I wouldn't complain to much – I would rather take the bet on Jakob Marsee, Jurickson Profar, or Mike Trout, to name just three outfielders currently being drafted behind Nimmo in very early ADP. Ultimately, it's a slight upgrade for Semien and a slight downgrade for Nimmo, but not an earth-shattering deal either way. The earth may start to tremble a bit if the Mets take advantage of the newfound hole in a corner outfield spot by chasing Tucker in free agency, as I suspect they now will. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Baseball Trade Reaction: Arrow up for Marcus Semien, down for Brandon Nimmo in trade of boring vets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/02/01/8d6b125f-c11a-4800-8241-112708b8384c/thumbnail/1200x675/4d31869ae60646f69c44ba9551d566ad/marcus-semien.jpg"
      ],
      "datePublished": "2025-11-23T23:46:36.000Z",
      "dateModified": "2025-11-23T23:46:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys' George Pickens 'not from this planet'; powers Dallas to win over Eagles with another 140-yard effort - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-george-pickens-not-from-this-planet-powers-dallas-to-win-over-eagles-with-another-140-yard-effort/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/f1a1230a-08b1-4724-8729-81e86b49beb1/thumbnail/1200x675/53910bbe4fcdc2ae7ac4f04b404e14aa/pickens-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-11-24T04:46:56.000Z",
    "description": "\n        ARLINGTON, Texas -- It was one thing for new Dallas Cowboys wide receiver George Pickens to go off for 144 yards and a touchdown on nine catc",
    "body": "\n        ARLINGTON, Texas -- It was one thing for new Dallas Cowboys wide receiver George Pickens to go off for 144 yards and a touchdown on nine catches in the team's Week 11 \"Monday Night Football\" victory over the Las Vegas Raiders.It's another for Pickens to top that effort with 146 yards receiving and a touchdown with catches on all ninw of his targets to help power the Cowboys back from a franchise-record 21-0 hole to upset the defending Super Bowl LIX champion Philadelphia Eagles 24-21 like he did in Week 12. Of his total yards receiving, 133 came after the Eagles took the 21-0 early in the second quarter. \"Well, I'll tell you George has been such an integral part of our story. He has his story to a degree, and that's our story. I'm so proud for him,\" Cowboys owner and general manager Jerry Jones said. \"Everybody on this team is, and he certainly has absolutely been the difference as we've played over the last two weeks. … It's something when you've got 88 [CeeDee Lamb] and Pickens.\"He is now up to 1,054 yards receiving (the second-most in the NFL), eight receiving touchdowns (the third-most in the NFL) on a career-high 67 catches (the eighth-most in the NFL). Pickens' 15.7 yards per catch rank as the fifth-most in the league, and his eight receiving touchdowns are tied for the second-most by a Cowboys player in his first 11 games with the franchise.\n\"Really just grinding. I just kind of always [knew] what I was capable of,\" Pickens said. \"I used to have 100-yard games in college all the time. Just definitely, as a team, keep going because I've seen the downs of it as well. Just keep going and get as many wins as we can.\"Not a bad value for the Cowboys with all they had to give up to get the 24-year-old in a trade with the Pittsburgh Steelers this past offseason being a 2026 third-round pick and a 2027 fifth-round pick.\"We are proud we've got him. I don't know if anyone has helped his team any more to win this year,\" Jones said. \"So the good times we've had, Pickens has had his hand in for the most part. … Of course, we are proud to have him, and I don't even want to play games with[out] him. We'd love to have him on the team. By the way, I'd love to have 88 on the team. I know what we're asking around here, but we like the way the combination is letting us execute on offense.\"\nQuarterback Dak Prescott knew he was getting another No. 1-caliber wide receiver this season, but now the 10-year vet, who is now Dallas' all-time passing yards leader, views the peak for Pickens as \"limitless.\"\"It's hard for me to say [he] exceeds my expectations. My expectations for him are limitless, and he'll tell you that he's not from here,\" Prescott said. ... \"He's not from here, he's not from this planet and so, I'm not going to put limitations on him. He went out there and did what he's done in games when he has that opportunity,  in practice as well. The guy loves the game. He stays focused. Just the communication, as I've said before, to other guys  in the huddle about staying focused and keep doing what you're doing. We lucked out with getting a guy like that. We have to make sure that we can keep him here. He's a hell of a player turning into a leader, and he's special.\"\nThe electricity he provides for Dallas was especially apparent in the fourth quarter on Sunday. With Dallas trailing 21-14 and driving to try to tie the game, Prescott heaved a play-action deep shot from his own 46 up to Pickens despite two Eagles cornerbacks, Cooper DeJean and Sydney Brown draped around. Pickens made the catch to push Dallas all the way down to the 11. Two plays later, the game was tied at 21 with the Cowboys scoring on an 8-yard scramble from Prescott with 11:48 left to play. \n\"Definitely the energy,\" Pickens said of what he feels after his explosive catches. \"I'm an energy guy myself, so that's why you probably always see me do the crazy celebrations, get really hyped, because I know it's a big turning point. And I know defenses, when you've got the momentum or you make a splash play, that demoralizes them.\"  \nEarlier this week, Lamb made it clear how much he and Dallas' teammates have gone out of their way to embrace Pickens, and he's feeling the love. That's perhaps one of the driving forces behind Pickens' All-Pro-caliber season in Year 1 as a Cowboy. \"The guys I'm doing it with honestly. I feel like the guys I'm doing with it are some amazing guys: Dak, CeeDee [wide receiver Ryan] Flo [Flournoy],\" Pickens said. \"Even some guys on defense. Just the guys I'm doing it with.\"\nPickens' Dallas futureJones was asked about Pickens' future as he finishes the last year of his rookie deal in 2025, and he signaled the Cowboys front office would continue to let things play out. That may come back to bite them come negotiation time in the spring because Pickens' production has him angling to be one of the highest-paid wide receivers in football. \"We can let it come as well. It's something when you've got [Lamb] and Pickens,\" Jones said. ... \"I don't just try to spend my day messing with agents as you well know. I'm proud he's having the season he is having. It exceeds anything we could have hoped for.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys' George Pickens 'not from this planet'; powers Dallas to win over Eagles with another 140-yard effort - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/f1a1230a-08b1-4724-8729-81e86b49beb1/thumbnail/1200x675/53910bbe4fcdc2ae7ac4f04b404e14aa/pickens-jpeg.jpg"
      ],
      "datePublished": "2025-11-24T04:46:56.000Z",
      "dateModified": "2025-11-24T04:46:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants become first NFL team to be eliminated from playoff contention - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-historic-playoff-elimination-week-12-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/70a10476-d364-4ebf-a0ff-cf03c1a6fa4e/thumbnail/1200x675/772c4eaac8d0b39c2425b6126368cb40/giants.jpg",
    "tag": "Sports",
    "date": "2025-11-23T23:05:16.000Z",
    "description": "\n        The New York Giants became the first NFL team to be eliminated from playoff contention on Sunday, as they were defeated by the Detroit Lions ",
    "body": "\n        The New York Giants became the first NFL team to be eliminated from playoff contention on Sunday, as they were defeated by the Detroit Lions in overtime, 34-27. It was a spirited effort, as Jameis Winston threw for 366 yards, two touchdowns and one interception while also catching a touchdown from Gunner Olszewski, but New York became the first team in NFL history to lose five road games in a season after leading by double digits, and is the first team that will officially not be playing playoff football in 2025.According to CBS Sports Research, this is the earliest the Giants have been eliminated from the playoffs since 1976. NFL tiebreaker expert Joe Ferreira also says it's the earliest playoff elimination since the New York Jets in 2020 when Sam Darnold's Jets started that season 0-13.The 2025 season has been a disaster for the Giants. They have started 2-10 in consecutive years for the first time in franchise history, and already fired coach Brian Daboll. There have been some bright spots, but even those bright spots have recently dimmed. Wide receiver Malik Nabers tore his ACL in Week 4, electric rookie running back Cam Skattebo suffered a season-ending ankle injury in Week 8 and quarterback Jaxson Dart is still in concussion protocol.\nReason for optimism moving forwardSo it's already been established that the Giants are struggling right now. The defense ranked bottom four in both yards allowed per game and points allowed per game entering Week 12, in addition to allowing 5.5 yards per rush -- the most by any team since the 1952 Dallas Texans. (Apparently the Dallas Texans were around for just one season and went 1-11.) Offensively, the Giants haven't been a total disaster. Injuries have hampered this unit, and it's essentially been forced to start three different quarterbacks through 12 games.\n        \n            \n                The Giants' next coach will determine whether Jaxson Dart becomes a franchise savior or just another statistic\n                \n                    Ryan Wilson                \n            \n                            \n    \n                \n                    \n    \nWith all of that being said, the Giants' job is still an attractive one. New York is the largest media market in the world and full of passionate fans. The Giants have a prospective franchise quarterback in Dart, who has been the best rookie quarterback this season, a talented running back in Skattebo and a wide receiver who could be a top-10 player at his position with Nabers. New York also has pieces on defense, such as an elite pass-rusher prospect in Abdul Carter, plus Brian Burns, Dexter Lawrence and Kayvon Thibodeaux.\nNow, it just comes down to getting the right coaching staff in the building. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants become first NFL team to be eliminated from playoff contention - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/70a10476-d364-4ebf-a0ff-cf03c1a6fa4e/thumbnail/1200x675/772c4eaac8d0b39c2425b6126368cb40/giants.jpg"
      ],
      "datePublished": "2025-11-23T23:05:16.000Z",
      "dateModified": "2025-11-23T23:05:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brandon Aiyuk potential landing spots if 49ers move on from star wide receiver - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brandon-aiyuk-landing-spots-where-49ers-wide-receiver-could-go-next-with-split-from-san-francisco-looming/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/c04667c7-e3d2-4d01-89b8-e9f0254ab1d6/thumbnail/1200x675/f45e5a6c700e3b40260848f90dacee6c/aiyuk-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-11-23T22:30:39.000Z",
    "description": "\n        Brandon Aiyuk hasn't suited up for the San Francisco 49ers in over a year, and his future with the franchise took a major turn recently.Accor",
    "body": "\n        Brandon Aiyuk hasn't suited up for the San Francisco 49ers in over a year, and his future with the franchise took a major turn recently.According to CBS Sports lead NFL insider Jonathan Jones, the 49ers voided Aiyuk's guaranteed money for the 2026 season during training camp, citing the wide receiver did not meet the requirements of his four-year, $120 million contract extension signed in August 2024.Saturday, coach Kyle Shanahan confirmed the team had voided the guarantees.\"It takes a lot of things to get a contract voided,\" Shanahan said. \"I've never dealt with that in my career and been in any building that's had that. It was unusual. But that's stuff that I can't get into right now.\"Aiyuk tore his ACL in Week 7 of last season. He has not been ruled out for this season, but the recent reports on his contractual changes certainly put his future in San Francisco in doubt.\nStill, Aiyuk is only 27 years old and just two years removed from a 1,342-yard, seven-touchdown 2023 season that earned him second-team All-Pro honors. As such, he'd be an intriguing -- and potentially quite popular -- free agent if he is indeed one in the 2026 offseason. Here are some potential suitors.\n        \n            \n                Shedeur Sanders becomes first Browns QB to win first career start since 1995\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nWashington CommandersThe Commanders are enduring a disappointing 2025 season after breaking through for an NFC Championship Game berth in 2024, but there are plenty of connections here. Aiyuk played his college football at Arizona State, where he was current Commanders quarterback Jayden Daniels' teammate. In fact, last summer, Aiyuk and Daniels talked during Aiyuk's contract dispute. Furthermore, Washington GM Adam Peters used to be in San Francisco.The Commanders' lack of wide receiver depth has been on display this season as Terry McLaurin has dealt with a quad injury. Deebo Samuel -- a former 49er -- is in the final year of his deal. Washington is projected to have ample salary cap room and could look to add a wide receiver opposite McLaurin to bounce back in 2026.\nBuffalo BillsThe Bills have struggled to find a top wide receiver to pair with Josh Allen ever since they traded Stefon Diggs after the 2023 season. Last year's second-round pick, Keon Coleman, has been a healthy scratch each of the last two weeks, and in Week 12's loss to the Texans, no Buffalo wide receiver could do much downfield.The Bills are very much in their Super Bowl window, and Aiyuk could be a strong fit in what has been a major team need.Pittsburgh SteelersNo matter who is playing quarterback for Pittsburgh -- a seemingly annual question ever since Ben Roethlisberger departed -- wide receiver is a significant need. The Steelers traded for and extended DK Metcalf this offseason, but opposite him, it's been a mishmash of younger players who haven't delivered.\nThe Steelers were reportedly interested in acquiring Aiyuk during the 2024 offseason. Perhaps two offseasons later, they could make it work.Jacksonville JaguarsNew GM James Gladstone certainly hasn't been shy, and beyond Brian Thomas Jr. and Travis Hunter -- whose rookie season ended with a knee injury and whose position remains up in the air -- the rest of Jacksonville's wide receivers are scheduled to be free agents.Aiyuk and Thomas Jr. could form a promising outside wide receiver group, and given Gladstone's willingness to make bold moves to improve Trevor Lawrence's surroundings, Aiyuk could be a fit.\nThe non-playoff contendersSeveral teams who don't project to be playoff contenders in 2026 could also be suitors. That includes ...Titans -- It's been a rough debut year for Cameron Ward, but rookie wide receivers in Elic Ayomanor and Chimere Dike have flashed, and Aiyuk would be a big help.Raiders -- The Raiders are in for a lengthy rebuild and will be looking for a new quarterback. Coach Pete Carroll knows Aiyuk well from his time as Seahawks coach, and adding Aiyuk to Brock Bowers could jump-start the passing offense.Saints -- The Saints could be looking for a new quarterback, and adding Aiyuk to the mix would be a major help. Chris Olave is one of the league's most under-appreciated wide receivers, and pairing him with Aiyuk would create a strong ecosystem for any quarterback.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brandon Aiyuk potential landing spots if 49ers move on from star wide receiver - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/c04667c7-e3d2-4d01-89b8-e9f0254ab1d6/thumbnail/1200x675/f45e5a6c700e3b40260848f90dacee6c/aiyuk-jpeg.jpg"
      ],
      "datePublished": "2025-11-23T22:30:39.000Z",
      "dateModified": "2025-11-23T22:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]