[
  {
    "title": "NBA DFS picks, Friday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-dfs-draftkings-fanduel-daily-fantasy-basketball-picks-lineups-friday-february-20-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/d8f44904-69e0-4ffe-849c-d98e2d651938/thumbnail/1200x675/b60279172c14f8c52321a4f78c778678/cam-spencer-memphis-grizzlies-imagn-iamges.jpg",
    "tag": "Sports",
    "date": "2026-02-20T19:24:42.000Z",
    "description": "\n        Friday's NBA schedule contains nine games with the action beginning at 7 p.m. ET with the last tip set for 10 p.m. ET.     There are a number",
    "body": "\n        Friday's NBA schedule contains nine games with the action beginning at 7 p.m. ET with the last tip set for 10 p.m. ET.     There are a number of high quality options in the NBA DFS player pool to build your daily Fantasy basketball lineups around. Stars like James Harden, Donovan Mitchell, Kevin Porter, Anthony Edwards, Jalen Johnson, Lauri Markkanen, Trey Murphy III, Brandon Miller and Julius Randle   are scheduled to be in action, so you certainly have plenty of directions to go with NBA DFS picks. Some standout players have already been ruled out for tonight. Among those include Pascal Siakam (personal), Santi Aldama (knee), Ivica Zubac (ankle), Jalen Williams (hamstring), Cooper Flagg (foot) and Dejounte Murray (Achilles).  Finding someone who can outperform his price tags on sites like FanDuel and DraftKings is key to that and to constructing a winning NBA DFS strategy. Before making any NBA DFS picks, be sure to check out the NBA DFS advice, player rankings, stacks, and top daily Fantasy basketball picks from SportsLine's Mike McClure.New users can also target the DraftKings promo code, which offers $200 in bonus bets if your initial $5+ bet wins:McClure is a DFS professional with more than $2 million in career winnings. He's also a predictive data engineer at SportsLine who uses a powerful prediction model that simulates every minute of every game 10,000 times, taking factors like matchups, statistical trends and injuries into account. This allows him to find the best NBA DFS values on sites like DraftKings and FanDuel and create optimal lineups that he shares only over at SportsLine. They're a must-see for any NBA DFS player.\nMcClure has turned his attention to NBA action on Friday and locked in his top daily Fantasy basketball picks. You can only see them by heading to SportsLine.Top NBA DFS picks for Friday, February 20For Friday, one of McClure's top NBA DFS picks is Memphis Grizzlies shooting guard Cam Spencer ($5,300 FanDuel), who has averaged 15.5 points over two games against Utah this season. In 51 games, including 14 starts, he is averaging 11.6 points, 5.6 assists and 2.7 rebounds in 24.1 minutes. Spencer has had some big games of late. In a 135-115 loss at Portland on Feb. 6, he poured in 18 points, while dishing out five assists. See McClure's other NBA DFS picks right here.He's also building his NBA DFS strategy around stacking Spencer with point guard Javon Small, who is $4,100 on FanDuel. Small has come on of late and is averaging 10.6 points, 4.8 rebounds and 3.2 assists over his past 10 games. His minute totals have climbed substantially as well. In a 122-115 loss at Portland on Feb. 7, he scored 22 points, while adding six rebounds and four assists. See McClure's other NBA DFS picks right here.\n New users can see the latest FanDuel promo code to get $100 in bonus bets at FanDuel if your $5+ bet wins:How to set your NBA DFS lineups for Friday, Feb. 20McClure is also targeting a player who could go off for massive numbers on Friday because of an optimal matchup. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is here.Who is DFS pro Mike McClure putting in his optimal NBA DFS lineups for Friday? Visit SportsLine now to see optimal NBA DFS picks, rankings, advice, and stacks, all from a professional DFS player who has over $2 million in career winnings, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA DFS picks, Friday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/d8f44904-69e0-4ffe-849c-d98e2d651938/thumbnail/1200x675/b60279172c14f8c52321a4f78c778678/cam-spencer-memphis-grizzlies-imagn-iamges.jpg"
      ],
      "datePublished": "2026-02-20T19:24:42.000Z",
      "dateModified": "2026-02-20T19:24:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VCU vs. Saint Louis prediction, odds, line, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/vcu-saint-louis-odds-prediction-time-2026-college-basketball-picks-friday-february-20/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/0bb98eb2-6067-4f94-8828-7146e3a0a32b/thumbnail/1200x675/cf48fba4d59c306294919419d7b5c256/robbie-avila-saint-louis-billikens-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-20T20:09:00.000Z",
    "description": "\n        The No. 18 Saint Louis Billikens will look to get back on track after having their 18-game winning streak snapped when they battle the VCU Ra",
    "body": "\n        The No. 18 Saint Louis Billikens will look to get back on track after having their 18-game winning streak snapped when they battle the VCU Rams in a key Atlantic 10 Conference matchup on Friday. VCU is coming off an 89-75 win over George Washington, while Saint Louis dropped an 81-76 decision at Rhode   Island on Tuesday. The Rams (21-6, 12-2 A-10) can overtake Saint Louis for first place with a win. They have won 10 in a row. The Billikens (24-2, 12-1 A-10), who have won 19 games by double digits this season, are 16-0 on their home floor.Tipoff from Chaifetz Arena in St. Louis is set for 7 p.m. ET. VCU leads the all-time series 17-7, but Saint Louis earned a 71-62 win on Jan. 7. Saint  Louis is a 7.5-point favorite in the latest VCU vs. Saint Louis odds from DraftKings Sportsbook, while the over/under for total points scored is 164.5. Before making any Saint Louis vs. VCU picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it entered Week 16 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on a 13-7 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated VCU vs. Saint Louis 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Saint Louis vs. VCU:VCU vs. Saint  Louis                                                                             spread:    Saint Louis -7.5     at DraftKings SportsbookVCU vs. Saint  Louis                                                                                                                                                                                                                                                           over/under:    164.5 pointsVCU vs. Saint  Louis                                                                                                                                     money line:    Saint Louis -352, VCU +277VCU vs. Saint  Louis                                                                                                                                                                                                                                                                                        picks:    See picks at SportsLineVCU vs. Saint  Louis                                                                                                                                                                                                                                                                                         streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top Saint Louis vs. VCU predictionsSportsLine's model is going Under on the total (166.5 points). The Under has hit in two of the last three head-to-head meetings between the schools. The Under has also hit in six of the last nine VCU games, and in six of the last 10 Saint Louis games. The Rams are 5-5 against the spread in their last 10 games. The Billikens are 6-4 ATS in their last 10.The model projects the Rams to have two players score 12.6 points or more, including Terrence Hill's projected 13.8 points. The Billikens are projected to have five players score 10 or more points, led by Robbie Avila, who is projected to score 15.2 points. The Under clears in over 60% of simulations.How to make VCU vs. Saint Louis picksThe model also says one side of the spread hits well over 50% of the time. You can only see that pick at SportsLine.So who wins VCU vs. Saint Louis, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the VCU vs. Saint Louis spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VCU vs. Saint Louis prediction, odds, line, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/0bb98eb2-6067-4f94-8828-7146e3a0a32b/thumbnail/1200x675/cf48fba4d59c306294919419d7b5c256/robbie-avila-saint-louis-billikens-imagn-images.jpg"
      ],
      "datePublished": "2026-02-20T20:09:00.000Z",
      "dateModified": "2026-02-20T20:09:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WWE superstars react to Tom Brady 'very cute' comment - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/cm-punk-paul-heyman-drew-mcintyre-tom-brady-very-cute-insult/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/21/5009c07b-9fd8-42b4-97ca-f7032493ef95/thumbnail/1200x675/e7c2a91bc3d57ec758a27a2837b99244/tom-brady-milan.jpg",
    "tag": "Sports",
    "date": "2026-02-21T03:30:03.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        WWE superstars don't think Tom Brady would find pr",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        WWE superstars don't think Tom Brady would find professional wrestling so cute if he gave it a shot. Last week, Brady and Logan Paul debated the athleticism of pro wrestlers on the latter's \"IMPAULSIVE\" podcast. Brady, widely regarded as the best NFL quarterback of all time, said he loved WWE but called it \"very cute.\" Paul, a part-time WWE superstar, argued that Brady was underestimating the athleticism required of pro wrestlers. Several high-profile WWE superstars and personalities reacted to Brady's statement when approached by Sports Illustrated. Some WWE talent brushed it off, while others went for Brady's throat.\"What's Tom Brady done? He's thrown a football across a field that was   caught by [Rob] Gronkowski,\" Hall of Famer Paul Heyman said. \"Gronkowski deserves the credit. [Bill] Belichick and his   girlfriend deserve the credit. But Tom Brady [gestures no].\"World heavyweight champion CM Punk had a more playful response than his longtime mentor and friend.\n\"What's wrong with cute?\" Punk said, looking directly into the camera. \"I'm cute, Tom.\" Former two-time NXT champion Oba Femi, an outdoor first-team All-USA selection with multiple shot put titles, challenged Brady to put himself through the rigorous pro wrestling training process. Undisputed WWE champion Drew McIntyre brushed off Brady's comments. He chalked up Brady's statement to a lack of understanding.\n\"I don't get annoyed,\" McIntyre said. \"It just comes from a place of ignorance.\"\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WWE superstars react to Tom Brady 'very cute' comment - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/21/5009c07b-9fd8-42b4-97ca-f7032493ef95/thumbnail/1200x675/e7c2a91bc3d57ec758a27a2837b99244/tom-brady-milan.jpg"
      ],
      "datePublished": "2026-02-21T03:30:03.000Z",
      "dateModified": "2026-02-21T03:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WWE Elimination Chamber: Matches, card, date, rumors for annual event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-elimination-chamber-2026-card-matches-rumors-date-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-21T03:33:47.000Z",
    "description": "\n        CM Punk is coming home. \"The Second City Saint\" returns to Chicago for WWE Elimination Chamber on Feb. 28. Punk defends his world heavyweight",
    "body": "\n        CM Punk is coming home. \"The Second City Saint\" returns to Chicago for WWE Elimination Chamber on Feb. 28. Punk defends his world heavyweight title against Finn Balor, plus two superstars will punch their tickets to WrestleMania 42.Punk has his hands full as the world heavyweight champion. He'll rematch Finn Balor at Elimination Chamber, the last major stop before WrestleMania. If he leaves Chicago with his champion status intact, Royal Rumble winner Roman Reigns awaits him in Las Vegas.Plus, Punk's wife, AJ Lee, returns for her first singles match in over a decade when she takes on Becky Lynch for the women's intercontinental championship.Elimination Chamber's two titular matches will also take place. The superstars who emerge from their respective steel structures victorious will earn world title matches at WrestleMania. Randy Orton, LA Knight and Cody Rhodes are among those who've qualified for a shot at the undisputed WWE title. Tiffany Stratton, Rhea Ripley, Alexa Bliss and Asuka will compete with two other women for a shot at one of the two women's world titles as Royal Rumble winner Liv Morgan has still yet to make her decision on who she will face.\nTake a look below at the confirmed matches for Elimination Chamber and take a glance at the crystal ball of what may come. The event streams live on ESPN Unlimited on Feb. 28 with the main card starting at 6 p.m. ET.2026 WWE Elimination Chamber matchesWorld Heavyweight Championship -- CM Punk (c) vs. Finn Balor: Balor returned to the main event scene after Judgment Day ally Liv Morgan accused him of complacency. Balor fell short of defeating the world heavyweight champion in Balor's home nation of Ireland. The respect Punk and Balor showed each other after the match fizzled out after Balor was denied a rematch by Raw general manager Adam Pearce. Balor took matters into his own hands, attacking Punk and provoking the champ into granting him a rematch.Elimination Chamber match -- Randy Orton vs. LA Knight vs. Cody Rhodes vs. Je'Von Evans vs. Trick Williams vs. TBA: An undisputed WWE title shot awaits the winner of the men's Elimination Chamber match. Orton qualified by beating Aleister Black and Solo Sikoa in a triple threat match. Knight defeated Austin Theory and Penta to earn his spot. After Rhodes earned his spot with a win over Jacob Fatu and Sami Zayn, Evans became the biggest surprise entrant in the match by defeating Gunther and Dominik Mysterio on Raw. Williams earned the penultimate spot by beating Carmelo Hayes and Damian Priest.\nWomen's Intercontinental Championship -- Becky Lynch (c) vs. AJ Lee: Punk isn't the only adored superstar coming home to Chicago. Lee seeks to join her husband as an active champion at Elimination Chamber. Lynch proposed the match, but only agreed to defend her women's intercontinental title after Lee refused to wrestle her otherwise. Lee is 2-0 against Lynch since ending her 10-year retirement, beating her in a mixed tag team match and in WarGames.Elimination Chamber match -- Rhea Ripley vs. Tiffany Stratton vs. Alexa Bliss vs. Asuka vs. Kiana James vs. TBA: Stratton advanced to the Elimination Chamber by beating Lash Legend and Chelsea Green on SmackDown. Ripley qualified by overcoming Lyra Valkyria and Ivy Nile on Raw. Bliss defeated Giulia and Zelina Vega to grab a spot in the match, and was joined by Asuka, who defeated Bayley and Nattie. James snuck a pinfall over Charlotte Flair in their match with Nia Jax.2026 WWE Elimination Chamber predictionsUndisputed WWE Championship -- Drew McIntyre (c) vs. Jacob Fatu: WWE subverted expectations by booking Rhodes and Fatu in the same Elimination Chamber qualifying match. All signs pointed to an eventual triple threat match between them and McIntyre. Rhodes is still the favorite to challenge McIntyre at WrestleMania. Maybe Fatu loses his qualifying match and earns a separate title shot against McIntyre. It seems odd to reward Fatu with a title opportunity if he loses his upcoming qualifier match. Whatever direction WWE takes, expect Fatu to orbit McIntyre in the next few months.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WWE Elimination Chamber: Matches, card, date, rumors for annual event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg"
      ],
      "datePublished": "2026-02-21T03:33:47.000Z",
      "dateModified": "2026-02-21T03:33:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC Fight Night predictions -- Sean Strickland vs. Anthony Hernandez: Card, picks, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-fight-night-sean-strickland-anthony-hernandez-predictions-odds-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/2a91954e-c340-4a31-b07a-2e54162b1436/thumbnail/1200x675/7ff8e492330665d11fa81ea9265d95d7/anthony-hernandez-houston-weighin.jpg",
    "tag": "Sports",
    "date": "2026-02-21T00:57:06.000Z",
    "description": "\n        A middleweight title shot could be at stake for the winner of Saturday's UFC Fight Night main event in Houston. Former UFC champion Sean Stri",
    "body": "\n        A middleweight title shot could be at stake for the winner of Saturday's UFC Fight Night main event in Houston. Former UFC champion Sean Strickland looks to bounce back against red-hot contender Anthony Hernandez.Strickland (29-7) has a new path to the middleweight title after Khamzat Chiamev became champion. Strickland was unlikely to get a third crack at Dricus du Plessis after two failed attempts. But Chimaev vs. Strickland is a fresh matchup. Between Strickland's No. 3 middleweight ranking and name value, it's feasible he could sneak ahead of the more deserving title challenger Nassourdine Imavov. Strickland has to beat Hernandez before those conversations can start. Oddsmakers think that's a tall task; Strickland disagrees.\"He has been steamrolling guys that I could f---ing write a clinic on,\"  Strickland told CBS Sports' Brian Campbell before the fight. \"So, no, he's not [on my level].\"Sign up for Paramount+ and Watch UFC Fight Night: Strickland vs. Hernandez for no additional fee -- every UFC numbered event and UFC Fight Night is included with your subscription! Plans start as low as $8.99/month or $89.99/year!\nHernandez (15-2, 1 NC) is ready for his breakout moment after taking the long road through the division. \"Fluffy\" was won eight consecutive fights with six finishes. He's days away from potentially having the third longest middleweight win streak in UFC history. Beating Strickland would be the biggest accomplishment of his career, and puts him on par with Imavov as the most deserving middleweight title challenger. In fact, \"Fluffy\" would arguably have a better case than Imavov, boasting a longer win streak and just as many wins over former UFC champs.\"I think if you beat a former champ, that really makes a statement  because everybody is really good here,\" Hernandez said. \"Someone who has already done that  shit, you go out there and take him out? You are sitting in a really  good place.\"  Bet UFC Fight Night at DraftKings and get $300 in bonus bets if your first $5 bet wins:\nUFC Fight Night also features two perennial contenders looking to protect their places in the pecking order. Geoff Neal (No. 12) battles the tenacious Uros Medic, and Dan Ige (No. 14) tries to snap Melquizael Costa's five-fight win streak. Both veterans approach fight night renewed after overcoming personal health issues. For Neal, a five-year battle with substance abuse. For Ige, eye injuries before the Patricio Pitbull fight. \"I didn't have the energy for anything. I didn't prepare right. The weight cuts were terrible,\" Neal told CBS sports this week. \"There was a point before all that shit happen, I'd run for an hour at a seven mile pace. I'm knocking out eight point six miles in an hour. I'm trying to get back to the old me.\"\"I had trauma to my eyes,\" Ige said. \"My mindset going into that fight was, 'I don't know if I'll ever fight again.' I didn't know what I was dealing with. I didn't want a way out of the fight. I knew if I went to a doctor, they would tell me not to fight. That's my ego and my pride. I've battled with that for a long time. I probably should've addressed it, but I didn't... It's something I've always battled, but I'm getting better with it. I have a better relationship with myself and my thoughts. Things are night and day different.\" \nLet's take a look at the rest of the fight card with the latest odds from DraftKings before getting to a prediction and expert pick on the main event below.UFC Fight Night card, oddsFavoriteUnderdogWeightclassAnthony Hernandez -278Sean Strickland +225MiddleweightGeoff Neal -218Uros Medic +180WelterweightMelquizael Costa -218Dan Ige +180FeatherweightAnte Delija -142Sergehi Spivac +120HeavyweightJacobe Smith -310Josiah Harrell +250WelterweightMichel Pereira -155Zach Reese +130MiddleweightUFC Fight Night viewing informationDate: Feb. 21 | Start time: 8 p.m. ETLocation: Toyota Center -- HoustonStream: Paramount+ (subscribe now for as little as $8.99 per month)PredictionSean Strickland vs. Anthony Hernandez: I'm surprised with how far apart the odds are. Hernandez is taking a meaningful step up in competition against arguably the division's most frustrating defensive fighter. Strickland has elite experience and is uniquely equipped to limit his opponent's offense. Hernandez also has serious gaps in his defensive striking that Strickland can exploit. That being said, I'll side with the rising tide. Hernandez is a menace when he has grappling control and half guard on the ground. Strickland did a fantastic job stuffing du Plessis' takedowns and getting off the mat quickly. \"Fluffy\" lacks DDP's physicality, but makes up for it with tenacious chain wrestling and far better top control. Hernandez will have a tough time taking Strickland down. When he does, he'll make the most of it. Enough to win a close decision against a former champ who can certainly play spoiler. Pick: Hernandez via Split DecisionWho wins Strickland vs. Hernandez, and which UFC best bet of over +500 should you be all over? Visit SportsLine now to get detailed picks and analysis from the advanced model which showed a 6.1% ROI from over 500 fights from 2023-25, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC Fight Night predictions -- Sean Strickland vs. Anthony Hernandez: Card, picks, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/2a91954e-c340-4a31-b07a-2e54162b1436/thumbnail/1200x675/7ff8e492330665d11fa81ea9265d95d7/anthony-hernandez-houston-weighin.jpg"
      ],
      "datePublished": "2026-02-21T00:57:06.000Z",
      "dateModified": "2026-02-21T00:57:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zuffa Boxing adds Conor Benn to its growing list of stars on roster - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/zuffa-boxing-signs-conor-benn/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/4eff7704-0fc5-4040-bddd-2e6a3d6dd003/thumbnail/1200x675/bab73e3060414ebf8fab8b9063377c85/conor-benn-family-win-celebrate.jpg",
    "tag": "Sports",
    "date": "2026-02-21T01:30:39.000Z",
    "description": "\n        Zuffa Boxing continued making headlines on Friday as Dana White announced the signing of British star Conor Benn. Benn (24-1, 14 KOs), a 29-y",
    "body": "\n        Zuffa Boxing continued making headlines on Friday as Dana White announced the signing of British star Conor Benn. Benn (24-1, 14 KOs), a 29-year-old native of Essex, England, follows cruiserweight star Jai Opetaia as just the latest big-name signing for the upstart promotion, which debuted its first of three fight cards over the past month on Jan. 23 in Las Vegas. \"Conor Benn is an absolute beast and a superstar,\" White said. \"He shows up every time and destroys people, and now some of the best fighters in the world are calling him out. He's ready for a world title next and I can't wait to see him compete in Zuffa Boxing. He's going to be a huge addition to a growing stable of very talented boxers.\"\nNo contract details were announced as part of the deal.The son Nigel Benn, a former two-division champion and 2026 inductee into the International Boxing Hall of Fame, the younger Benn is fresh off of a resounding victory at middleweight over family rival Chris Eubank Jr. in a rematch of their 2025 fight of the year that served as Benn's lone pro defeat.\nThe flashy and confident Benn has spent the majority of his career at welterweight and plans to return to 147 pounds in the future in search of big fights. In January, Benn entered the ring in New York following Shakur Stevenson's 140-pound title win over Teofimo Lopez Jr. to hype a future meeting between the two. \"I'm filled with excitement and hunger for what's ahead with Zuffa Boxing,\" Benn said. \"I want the legacy fights, the biggest nights, the biggest stages. I fear no man at any weight, and I'm ready to give the fans the fights they've been calling for. I'm in my prime, and together we have bold, ambitious plans.\"Benn was initially scheduled to face Eubank, the son of Hall-of-Famer Chris Eubank Sr., who took part in two legendary British fights with Benn's father, in 2022 until a failed drug test and subsequent suspension for Benn delayed the legacy fight. But despite giving up a ton of size throughout their two-fight series, both of which took place in front of sellout crowds at Tottenham Hotspur Stadium in London, Benn proved to be the bigger puncher and aggressor. \nZuffa's signing of Benn comes in the midst of a public feud between White and Benn's former promoter, Eddie Hearn of Matchroom Sport. Benn posted a letter to social media following Friday's announcement to address the situation. \"First and foremost, I want to thank Eddie and the entire team at Matchroom for everything they've done for me over the past decade,\" Benn said. \"It has been a journey beyond anything we could've imagined, and for their belief, support and guidance, I will always be truly grateful, but Zuffa Boxing presented me with an opportunity I simply couldn't refuse.\"I'd love Eddie to continue to be part of my team and for our partnership to evolve in this new chapter.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zuffa Boxing adds Conor Benn to its growing list of stars on roster - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/4eff7704-0fc5-4040-bddd-2e6a3d6dd003/thumbnail/1200x675/bab73e3060414ebf8fab8b9063377c85/conor-benn-family-win-celebrate.jpg"
      ],
      "datePublished": "2026-02-21T01:30:39.000Z",
      "dateModified": "2026-02-21T01:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Floyd Mayweather plans to end boxing retirement after Mike Tyson exhibition - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/floyd-mayweather-retirement-boxing-return-mike-tyson-exhbition/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/2ae92197-e328-4780-bc4d-a88ff9079f16/thumbnail/1200x675/30e4d7139631924ce76bc9eb6c86283e/floyd-mayweather-nba-dodgers-hat.jpg",
    "tag": "Sports",
    "date": "2026-02-20T23:08:14.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Floyd Mayweather is coming out of retirement. Mayw",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Floyd Mayweather is coming out of retirement. Mayweather announced that he will compete professionally in boxing after an exhibition fight with Mike Tyson in the spring.Mayweather will end his professional boxing retirement nine years after riding off into the sunset with a perfect 50-0 record. On Friday, Mayweather announced his plans to box professionally again after a planned exhibition bout with legendary heavyweight champion Tyson. Mayweather signed an exclusive deal with CSI Sports/FIGHT SPORTS for his upcoming exhibition and professional fights.\"I still have what it takes to set more  records in the sport of boxing,\" Mayweather said in a press release. \"From my upcoming Mike Tyson event to my  next professional fight afterwards, no one will generate a bigger  gate, have a larger global  broadcast audience, and generate more money with each event than my  events.\"CSI Sports said they'd reveal details about event dates, broadcast information and the professional opponent for Mayweather's sanctioned return in the coming weeks. \nLast year, Mayweather and Tyson confirmed plans for an exhibition fight between them. The Ring recently reported the fight would take place on April 25 in the Democratic Republic of the Congo; however, CSI Sports has not announced the date, location, or ruleset. Mayweather and Tyson are a combined 107 years old. Mayweather weighed in at 160.7 pounds for his last exhibition fight with John Gotti III. Tyson weighed 228.4 pounds for his exhibition bout with Jake Paul.Mayweather (50-0) retired from pro boxing after defeating former  two-division UFC champion Conor McGregor in 2017. Mayweather has taken  eight exhibition boxing bouts in the time since, most notably a first-round TKO against generational kickboxer Tenshin  Nasukawa and an eight-round affair in a non-scored bout with WWE superstar  Logan Paul. \nTyson (50-7, 2 NC) has boxed three times since retiring in 2004. Two of those were exhibitions: a non-scored bout with Corey Sanders in 2006 and a draw against Roy Jones Jr. in 2020. Last year, Tyson boxed in his first professional fight in two decades against Paul. Tyson lost a lifeless decision against Paul, 30 years his junior. The critically panned fight was a huge commercial success for Netflix.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Floyd Mayweather plans to end boxing retirement after Mike Tyson exhibition - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/2ae92197-e328-4780-bc4d-a88ff9079f16/thumbnail/1200x675/30e4d7139631924ce76bc9eb6c86283e/floyd-mayweather-nba-dodgers-hat.jpg"
      ],
      "datePublished": "2026-02-20T23:08:14.000Z",
      "dateModified": "2026-02-20T23:08:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Basketball: Week 19 Waiver Wire adds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-week-19-waiver-wire-pickups-out-of-all-star-break/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/48a937c2-d2f7-478f-ae89-553d33b11588/thumbnail/1200x675/814148d46cd0dc23d2c7844733185d80/jay-huff-indiana-pacers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-20T18:56:02.000Z",
    "description": "\n        With the fantasy basketball stretch run underway, working the waiver wire can be the difference between a playoff push and a missed opportuni",
    "body": "\n        With the fantasy basketball stretch run underway, working the waiver wire can be the difference between a playoff push and a missed opportunity. Injuries, trades, and tanking teams are opening up new roles across the league, creating short-term streaming value and potential rest-of-season risers. Players like Jay Huff and Day'Ron Sharpe are seeing increased minutes due to shifting frontcourt situations, while emerging options such as Devin Carter and Tristan Vukcevic offer category-specific upside. Meanwhile, Precious Achiuwa's expanded workload could quietly translate into steady production. Here are the top waiver wire targets to consider as schedules, roles, and rotations begin to stabilize.Jay Huff, Pacers (43% rostered)It's been an up-and-down season for Huff. Efficiency and role haven't been consistent. But there appears to be a trend upward lately, which has upside to continue following the Pacers trading away competition at center in Isaiah Jackson.Huff has played at least 21 minutes in six straight games, averaging 11.3 points and 1.2 3s on 47/26/100 shooting, five rebounds, 1.8 assists, 1.7 blocks, and 1.2 steals (27.9 fantasy points). He might not make sense for fantasy managers in standard leagues who don't need 3s or blocks, but he at least needs to be on the streaming radar in all leagues. In deep formats, I don't think he should be on the wire given what we've seen lately.Day'Ron Sharpe, Nets (33% rostered)Sharpe has started the past two games with Nic Claxton out, providing mixed results due to a competitive game against the Pacers and a blowout loss to the Cavaliers. Still, he was able to total 23 points, 17 rebounds, eight assists, two steals, and two blocks in those 51 minutes.\nSimilar to Huff, Sharpe doesn't qualify as a must-roster player for every team in a standard league. But he will fit the bill for someone who needs rebounds at minimum, and who could also use some extra assists and steals. Over Sharpe's past eight games, he's averaging 11.9 points, nine rebounds, 2.3 assists, and one steal (27.9 fantasy points) in 20.8 minutes. With the Nets playing four games next week, he needs to at least be on streaming radars.Devin Carter, Kings (12% rostered)The Kings are deep in the tank, partially due to legitimate injuries. That has vaulted a few players into fantasy relevance, including Carter. The 23-year-old guard has stepped into a bigger role across the past six games, averaging 14 points on 39.5 percent from the field, 4.5 rebounds, 4.2 assists, and 1.2 steals (28.7 fantasy points) in 26.8 minutes.There's no reason to think Carter won't keep seeing this kind of role. And it's possible there's an expanded role incoming if Russell Westbrook or Malik Monk sit games out. The Kings drafted Carter No. 13 overall in 2024, so the assumption should be they will use this as an opportunity to see what they have in him. Fantasy managers should act accordingly, especially if you need steals and assists.\nTristan Vukcevic, Wizards (12% rostered)Starting center Alex Sarr is expected to be sidelined for at least another week, which should afford Vukcevic continued chances for extended run. He's started four games this season, including Thursday against the Pacers, averaging 12 points and 1.3 3s on 46/28/60 shooting, 4.8 rebounds, 1.3 assists, 1.8 steals, and one block (27.1 fantasy points) in 20.3 minutes when getting the nod.It's hard to trust Vukcevic as a rest-of-season add given that he's on a two-way contract and Sarr could be back sooner than later. Still, he's a strong per-minute player that hardly needs 20 minutes to be worth a short-term pickup. Fantasy managers in all leagues should at least have him on their watchlist, and I wouldn't let him be available right now in deep formats.Precious Achiuwa, Kings (5% rostered)With Domantas Sabonis done for the year and Dylan Cardwell out for a month, Sacramento's frontcourt is in bad shape. Most managers have already picked up Maxime Raynaud, who is a must-roster player. But Precious Achiuwa saw massive run in Thursday's loss to the Magic. In 34 minutes, he produced 14 points, 10 rebounds, one assist, four steals, and two blocks.\nAchiuwa's value has fluctuated for much of the year, but it could stabilize now, given the situation in Sacramento. When Achiuwa plays more than his season average of 20.5 minutes, he averages 11 points, 7.5 rebounds, 1.3 assists, and 1.2 steals (26.9 fantasy points). That's good enough to be worth rostering for some standard league managers. At the very least, he should be scooped up in deep formats to see how this plays out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Basketball: Week 19 Waiver Wire adds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/48a937c2-d2f7-478f-ae89-553d33b11588/thumbnail/1200x675/814148d46cd0dc23d2c7844733185d80/jay-huff-indiana-pacers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-20T18:56:02.000Z",
      "dateModified": "2026-02-20T18:56:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Serie A on Paramount+: Schedule, live stream as Inter deal with big injury news - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/how-to-watch-serie-a-on-paramount-inter-lautaro-juventus-como/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/4af43a9b-4652-4352-aec1-209a17de9c77/thumbnail/1200x675/60eda0c93665db92d3894f95efb796f8/lautaro-2.jpg",
    "tag": "Sports",
    "date": "2026-02-20T20:51:30.000Z",
    "description": "\n        The 2025-26 Serie A season is in full swing in Italy. Napoli started the campaign as defending champions after winning the 2024-25 title, the",
    "body": "\n        The 2025-26 Serie A season is in full swing in Italy. Napoli started the campaign as defending champions after winning the 2024-25 title, their fourth Scudetto ever on the last matchday of the season. Inter and AC Milan will compete with the team coached by Antonio Conte to win the Serie A title, while other teams such as AS Roma, Atalanta, Juventus, Bologna and Como are all in contention for a spot in next season's European tournaments. This week's Serie A slate features some interesting matchups, such as the game between Como and Juventus on Saturday in Turin, but it is injury news that is all the talk heading into the weekend. Here's what to know:Lautaro Martinez injuredInter will have to react after the disappointing 3-1 defeat against Bodo/Glimt in the Champions League as the Nerazzurri are currently leading the Serie A standings with a seven-point margin on AC Milan, which drew 1-1 at San Siro against Como on Wednesday. Cristian Chivu's side will have to deal with the injury of Lautaro Martinez, who was replaced in the second half of the Champions League first leg playoffs. The Argentinian captain underwent a medical examinations that \"revealed a strain to the soleus muscle in his left calf,\" and the player will be reevaluated in the coming weeks, but he's expected to miss at least two weeks of action and will likely miss the key fixture against AC Milan on March 8. This is why the upcoming two Serie A games and the Champions League return leg against Bodo/Glimt will be even more important for Chivu and his team, as the Nerazzurri will need to continue performing even without their best striker on the roster. Players such as Marcus Thuram, Yann Bonny and the young Italian talent Francesco Pio Esposito will be called to make the difference against Lecce on Saturday, the first match Lautaro will definitely miss. How to watch Lecce vs. Inter, oddsDate: Saturday, Feb. 21 | Time: 12 p.m. ETLocation: Stadio Via del Mare -- Lecce Live stream: Paramount+Odds: Lecce +669; Draw +318; Inter -223How to watch Serie A Matchday 26All times U.S./Eastern. \nFriday, Feb. 20Sassuolo vs. Hellas Verona, 2:45 p.m. (Paramount+)Saturday, Feb. 21Juventus vs. Como, 9 a.m. (Paramount+)Lecce vs. Inter, 12 p.m. (Paramount+)Cagliari vs. Lazio, 2:45 p.m. (Paramount+)Sunday, Feb. 22Genoa vs. Torino, 6:30 a.m. (Paramount+)Atalanta vs. Napoli, 9 a.m. (Paramount+)AC Milan vs. Parma, 12 p.m. (Paramount+)AS Roma vs. Cremonese, 2:45 p.m. (Paramount+)\nMonday, Feb. 23Fiorentina vs. Pisa, 12 p.m. (Paramount+)Udinese vs. Bologna, 2:45 p.m. (Paramount+)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Serie A on Paramount+: Schedule, live stream as Inter deal with big injury news - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/4af43a9b-4652-4352-aec1-209a17de9c77/thumbnail/1200x675/60eda0c93665db92d3894f95efb796f8/lautaro-2.jpg"
      ],
      "datePublished": "2026-02-20T20:51:30.000Z",
      "dateModified": "2026-02-20T20:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee QB Joey Aguilar denied 2026 eligibility, what's next for Vols - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tennessee-qb-joey-aguilar-eligibility/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/f795a66c-c7a5-4b8f-b595-4cb99435e1c0/thumbnail/1200x675/f4d28cbe03d68f4c5952e6fcc60aa188/aguilar.jpg",
    "tag": "Sports",
    "date": "2026-02-20T21:08:56.000Z",
    "description": "\n        Tennessee quarterback Joey Aguilar was denied a preliminary injunction in his eligibility lawsuit against the NCAA by a Knoxville judge, per ",
    "body": "\n        Tennessee quarterback Joey Aguilar was denied a preliminary injunction in his eligibility lawsuit against the NCAA by a Knoxville judge, per multiple reports. That denial figures to be a decisive blow to his efforts at playing for the Volunteers in 2026, and serves as a big win for the NCAA which has been on the wrong side of a number of eligibility cases recently. Aguilar hoped to follow in the footsteps of Ole Miss star quarterback Trinidad Chambliss, who received his own temporary injunction from a Mississippi-based chancery court earlier in February. However, Aguilar's case is different than Chambliss', who argued successfully he should gain another year of eligibility due to a health condition he dealt with in 2022. Aguilar's attorneys tried to argue that his junior college years should not count against his NCAA eligibility. Aguilar spent two years at the City College of San Francisco (2019-20) and two years Diablo Valley College (2021-22) before signing with Appalachian State ahead of the 2023 season. That was not a sufficient enough argument to win him the same type of temporary injunction against the NCAA that will allow Chambliss to play another year in Oxford, and barring an unforeseen reversal via a quick appeal, Aguilar will not be back in a Volunteer uniform this fall. \nWhat Aguilar's departure means for Tennessee's QB situationWithout Aguilar under center, Tennessee must replace one of the most productive quarterbacks in the SEC from a season ago. Aguilar completed 67.3% percent of his passes for 3,565 yards and 24 touchdowns in 2025 and was going to be one of the top returning QBs in the SEC in 2026. Because Tennessee didn't land one of the top quarterbacks in the transfer portal -- but not for a lack of trying with Sam Leavitt before LSU locked him down --  the Volunteers will have to turn to unproven youngsters in what becomes one of the most interesting spring quarterback battles in the SEC. The Vols have redshirt freshman George MacIntyre, who played in just two games last season, and true freshman Faizon Brandon, a five-star prospect from the class of 2026 that ranked as the No. 3 player nationally and the No. 3 quarterback, as the most intriguing options, along with Colorado transfer Ryan Staub. MacIntyre threw a total of nine passes in those two appearances last year, completing seven of them for 69 yards. \nHis leg up on Brandon for the starting job won't be on-field experience, but the fact that he's had a year to absorb more of coach Josh Heupel's system. For a Tennessee team hoping to threaten for a College Football Playoff berth in 2026, losing Aguilar puts a tremendous amount of pressure on their young quarterback room to get up to speed quickly -- and on Heupel to make the correct choice between two unproven freshmen. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee QB Joey Aguilar denied 2026 eligibility, what's next for Vols - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/f795a66c-c7a5-4b8f-b595-4cb99435e1c0/thumbnail/1200x675/f4d28cbe03d68f4c5952e6fcc60aa188/aguilar.jpg"
      ],
      "datePublished": "2026-02-20T21:08:56.000Z",
      "dateModified": "2026-02-20T21:08:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas coach Bill Self offers nuanced opinion on star Darryn Peterson not finishing games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kansas-bill-self-gets-darryn-checking-out/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/7085fd9c-aae1-4446-913f-c84dd7ef5e66/thumbnail/1200x675/59b2c3dd320ba0bf16a6d93726ee85f3/kansas.jpg",
    "tag": "Sports",
    "date": "2026-02-20T21:26:19.000Z",
    "description": "\n        LAWRENCE, Kansas -- The noise around Darryn Peterson's availability -- or lack thereof -- has swelled by the day. It overflowed this week aft",
    "body": "\n        LAWRENCE, Kansas -- The noise around Darryn Peterson's availability -- or lack thereof -- has swelled by the day. It overflowed this week after Peterson's cramping reared its ugly head again in Wednesday's 81-69 win over Oklahoma State. Peterson splashed a triple right in front of Kansas' bench, appeared to signal to head coach Bill Self that he needed to be pulled from the game, and the aftermath of takes that followed were impossible to miss. Here are some of the outtakes:Stephen A. Smith: \"There is no team in hell that should grab Darryn Peterson at No. 1.\"Kendrick Perkins: \"If you love the game of basketball, you're not pulling these kinds of stunts.\"Jay Williams: \"His talent is unquestionable. It's elite. But I don't feel like he really wants to be there.\"No. 8 Kansas is set to play Cincinnati in less than 24 hours. The Jayhawks are just a game behind Arizona and Houston in the top-heavy Big 12. Winning this game is vital to KU's title hopes, but Self admitted the noise about the freshman sensation has been hard to blot out fully. \"It's not a distraction for me as much as it is for him,\" Self said. \"He hasn't finished games. The reasons why they say he hasn't finished games is 100% false. At least in 70 to 80% of the reasons why, that I've heard. So I can't say 100% of everything would be false, but that's the narrative that's being put out there. The basis of what's being said, you can't argue with. He hasn't finished games consistently. The reasons why he hasn't finished, he's saving himself for the NBA, or load management or that kind of stuff, that, to me, couldn't be more false.\"\nPeterson has missed 11 games due to a laundry list of injuries. A balky hamstring, a nasty sprained ankle and an illness have been the culprits, with untimely cramps sending the potential No. 1 pick to the bench for good numerous times this season.\"The bottom line is, there is a way to change the narrative,\" Self said. \"Play. Finish. Now, if his body allows him to, fantastic. If it doesn't allow him to, they'll say something again the next game. That's the way to get people to quit talking. It's not me saying it's not fair. I don't think that really keeps anybody from having an opinion on it at a national level, or on this level, or any level, to be quite candid.\"\nBut Self pushed back hard on the claims that Peterson is not obsessed with basketball.\"I don't know that we've had a guy who studies the game, has prepared himself for this more so than what Darryn Peterson has,\" Self said. \"He loves ball. He can't get enough ball. I think that those are the things that are probably hurtful as much as anything. So say those types of things. And nobody's putting more time in outside of practice, working on their game on an individual level, than probably what he has over a lifetime. I don't think it'd be close. So I don't buy those scenarios at all. Peterson is expected to play in Saturday's clash against the Bearcats. Will he be able to finish the game? That's the million-dollar question.\n\"If he wasn't a top pick in an NBA draft, regardless of where that is, would anybody even be talking about this in the way they are?\" Self said. \"Maybe they would, but I certainly doubt it.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas coach Bill Self offers nuanced opinion on star Darryn Peterson not finishing games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/7085fd9c-aae1-4446-913f-c84dd7ef5e66/thumbnail/1200x675/59b2c3dd320ba0bf16a6d93726ee85f3/kansas.jpg"
      ],
      "datePublished": "2026-02-20T21:26:19.000Z",
      "dateModified": "2026-02-20T21:26:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's Josh Sargent reportedly agrees to MLS move: - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/usmnt-josh-sargent-mls-transfer-toronto-fc-usa-world-cup-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/7c7a24db-f288-4205-8791-6ef0c40dc425/thumbnail/1200x675/54116bab4804618f7b5eae18ed318163/usa-josh-sargent.jpg",
    "tag": "Sports",
    "date": "2026-02-20T20:23:46.000Z",
    "description": "\n        Toronto FC have finally worked out an agreement to bring American striker Josh Sargent to MLS from Norwich City, according to The Athletic. I",
    "body": "\n        Toronto FC have finally worked out an agreement to bring American striker Josh Sargent to MLS from Norwich City, according to The Athletic. It has been a roundabout process, but the fee is around $22 million, which is one of the highest in MLS history and would mark a record purchase for Toronto. Despite being from Missouri, Sargent has never played in MLS, but the move back to North America comes at a time when the 25-year-old is settling down to raise his family. It was a strange departure from Norwich City as Sargent reportedly declared himself unavailable for an FA Cup tie in January via a text to manager Philippe Clement, and he has been banished to the U-23's since. In 156 appearances for Norwich City, Sargent has scored 56 goals between the Premier League and the Championship, but despite reported interest from Wolfsburg during the summer, according to The Athletic, the move to North America is what made the most sense.Sargent has fallen down the pecking order for the United States men's national team as he looks to make the squad for a second consecutive World Cup. He hasn't been called into camp since September of 2025, when he started against South Korea before being benched against Japan, which started the USMNT's current five-match unbeaten streak. Manager Mauricio Pochettino has stated multiple times that the door isn't closed for players, so if Sargent comes into Toronto and starts scoring, there could be a window to make the World Cup, but with Patrick Agyemang, Haji Wright, and Folarin Balogun all performing well at their clubs and Ricardo Pepi coming back from injury, it will be hard to break back into the USMNT rotation.The first priority is getting back to fitness, as Sargent hasn't played first-team soccer since January, but coming to a Toronto team that also hasn't played competitive matches since the MLS season ended in October of 2025, Sargent won't be that far off the pace of his teammates. Toronto finished 12th in the Eastern Conference last season, missing the playoffs and averaging less than a point per game while also being one of the lowest scoring attacks in the league. Sargent will be alongside midfielder Djordje Mihailovic as the key players in Toronto's attack this season in a team that has high expectations despite rebuilding.\n\n                                                                    CBS Sports\n                                                            Sargent will bring a strong presence to the team, but he's been someone who is at their best when others are creating chances for him, which is where Mihailovic comes in. If the duo can get things going together, there's no reason why Toronto won't win some games this season, as an improvement is needed. Toronto will open their season on Saturday night, facing FC Dallas.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's Josh Sargent reportedly agrees to MLS move: - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/7c7a24db-f288-4205-8791-6ef0c40dc425/thumbnail/1200x675/54116bab4804618f7b5eae18ed318163/usa-josh-sargent.jpg"
      ],
      "datePublished": "2026-02-20T20:23:46.000Z",
      "dateModified": "2026-02-20T20:23:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Twins' Pablo Lopez out for 2026 after Tommy John surgery, which could lead to more trade rumors in Minnesota - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/twins-pablo-lopez-tommy-john-surgery-trade-rumors/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/ac0e097c-1ceb-407a-8d56-0cba81cc9b71/thumbnail/1200x675/dea8ee4d889f2b6bef683bcf2ee78e6e/pablo-lopez-getty-1.png",
    "tag": "Sports",
    "date": "2026-02-20T19:18:41.000Z",
    "description": "\n        Minnesota's already slim postseason hopes were dealt a significant blow Friday. Twins right-hander Pablo López will have Tommy John surgery n",
    "body": "\n        Minnesota's already slim postseason hopes were dealt a significant blow Friday. Twins right-hander Pablo López will have Tommy John surgery next Wednesday, reports The Athletic. This will be López's second Tommy John surgery, which comes with a 14-18 month rehab. His season is over and he will likely miss the start of next season as well.\"Obviously  it's really disappointing news,\" GM Jeremy Zoll told MLB.com after tests revealed a UCL tear in López's elbow earlier this week. \"You  really feel for Pablo. As everyone knows, his work ethic, how much he  cares about his body, his preparation is second to none. Huge blow for  him. He was understandably quite disappointed.\" López, 30 next month, had his first Tommy John surgery as a minor leaguer in 2014. Hamstring, shoulder, and forearm injuries limited him to only 14 starts last season, but, prior to that, López was one of the game's most reliable workhorses. He made 32 starts every year from 2022-24 and ranked seventh with 559 ⅓ innings those three years. \nThis is Year 3 of the four-year, $73.5 million extension López signed in April 2023. He is owed $21.5 million in both 2026 and 2027. That salary, plus an injury that will wipe out his entire 2026 and at least part of his 2027, makes López untradeable. At least for the next 18 months or so. Things could change if he looks sharp when he returns next year. \nFanGraphs projections put Minnesota's postseason odds at 26.0% following the López injury. They were considered an unlikely contender coming into the spring with him. Losing him is devastating. Here is the club's updated rotation depth chart: RHP Joe RyanRHP Pablo López (will miss 2026 with Tommy John surgery)RHP Bailey OberRHP Simeon Woods RichardsonRHP Taj BradleyRHP Zebby MatthewsRHP Mick AbelRHP David FestaThere is plenty of talent and upside there, though the lineup is unimposing and the bullpen is short on proven late-inning options. If the Twins contend this year, it will be because their rotation lives up to its potential and props up the offense and bullpen, but López's injury now takes away an important part of that rotation. A major blow, it is. No doubt. Ryan has been in trade rumors for more than a year now. If the Twins fall out of the race, he would become the top starter available at the trade deadline. He has two years of control remaining and, as López's injury shows, two years of control can be reduced to half-a-season really quickly. The longer the Twins hold onto Ryan, the more injury risk they assume. \nMinnesota went 70-92 last season and sold hard at midseason, moving 10 members of their active 26-man roster in the days leading up to the trade deadline. López was on the injured list at the time and not a real candidate to be traded. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Twins' Pablo Lopez out for 2026 after Tommy John surgery, which could lead to more trade rumors in Minnesota - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/ac0e097c-1ceb-407a-8d56-0cba81cc9b71/thumbnail/1200x675/dea8ee4d889f2b6bef683bcf2ee78e6e/pablo-lopez-getty-1.png"
      ],
      "datePublished": "2026-02-20T19:18:41.000Z",
      "dateModified": "2026-02-20T19:18:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's top games to watch, best bets: Indiana at Purdue, Clippers at Lakers, more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-indiana-at-no-7-purdue-clippers-at-lakers-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/51a5ca44-0695-465d-bf76-f028492d5769/thumbnail/1200x675/3f0e42b00ec99234e76836b37badf6b3/purdue.jpg",
    "tag": "Sports",
    "date": "2026-02-20T20:30:42.000Z",
    "description": "\nThe Purdue Boilermakers face a gut-check game on Friday night.Ranked No. 1 in the country entering the season, the Boilermakers are coming off a 91-8",
    "body": "\nThe Purdue Boilermakers face a gut-check game on Friday night.Ranked No. 1 in the country entering the season, the Boilermakers are coming off a 91-80 loss to the current top-ranked team, Michigan, at home. After jumping out to a 5-0 lead, Purdue was never in the contest, trailing by 20 points at one point.After the loss, Boilermakers coach Matt Painter had a subtle critique for his team. \"You can be preseason No. 1 in the country,\" he said. \"It means nothing.\"And now Purdue (21-5, 11-4 in Big Ten), with its conference title hopes all but dashed, must regroup on Friday when it faces the rival Indiana Hoosiers, a team that beat the Boilermakers earlier this season, at Mackey Arena in West Lafayette, Ind. The Hoosiers (17-9, 8-7) are coming off a loss, 71-51, at No. 8 Illinois. They currently sit on the NCAA Tournament bubble and cannot afford too many more losses if they hope to make the 68-team field.The Boilermakers are 11.5-point favorites on Friday.While Purdue vs. Indiana is the marquee attraction on Friday, there are other options on a sporting landscape that includes nine NBA games and a partial college basketball schedule. Below is a snapshot of what to watch and bet for Friday, Feb. 20. All times Eastern.College basketball best bets, where to watchVCU at No. 18 Saint LouisTime: 7 p.m. | Location: St. Louis | TV: ESPN2 | Stream: Fubo (Try for free)SportsLine picks -- Model: Saint Louis -7.5 | Expert: VCU +8.5 (Chip Patterson)\nThe lead in the Atlantic 10 will be on the line when the Saint Louis Billikens and VCU Rams collide at the Chaifetz Arena. The Billikens (24-2, 12-1 in A-10) lead the conference by a half game over the Rams (21-6, 12-2) but are coming off a shocking loss at Rhode Island on Tuesday. Meanwhile, VCU has reeled off 10 straight wins. In the previous matchup between the teams, the Rams led 62-61 with 2:30 remaining in the game before Saint Louis scored the last 10 points of the contest. \"Phil Martelli Jr.'s team is playing well enough to threaten for the road upset,\" Patterson says. The SportsLine Projection Model, which simulates every college basketball game 10,000 times, disagrees. It says the Billikens have a 53.0% chance to cover and assigns a C grade to Saint Louis -7.5.Indiana at No. 7 PurdueTime: 8 p.m. | Location: West Lafayette, Ind. | TV: FOX | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 149.5 | Expert: Purdue First Half -6 (Chip Patterson)\nDespite the Boilermakers' loss to Michigan on Tuesday, they still have the No. 2-rated offense in the country (129.2 points per 100 possessions, according to KenPom). But the defense struggled against the Wolverines, allowing Michigan to shoot 52.6% from the field and 56.5% on 3-pointers. The SportsLine Projection Model says there's a 71.6% chance the teams combine for 150 points or more and gives a B grade to Over 149.5. Meanwhile, Patterson is expecting to see a motivated Boilermakers team. \"Purdue simply has to come out breathing fire after getting run by Michigan at home on Tuesday night,\" he says.NBA best bets, where to watchMavericks at TimberwolvesTime: 7:30 p.m. | Location: Minneapolis | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Under 239.5\nAs if things aren't already bad enough for the Dallas Mavericks, who have lost nine in a row, rookie sensation Cooper Flagg has been ruled out for Friday's game against the Minnesota Timberwolves with a foot injury that kept him out of the NBA's All-Star events. That's a tough blow considering Flagg is on pace to become just the eighth rookie in league history to average at least 20 points, six rebounds and four assists a game. Meanwhile, the Minnesota Timberwolves are an elite defensive team when at home. They give up just 108.1 points per 100 possessions at the Target Center, which is the third-best defensive rating at home in the league. The SportsLine Projection Model says there's a 57.3% chance the teams combine for 239 points or fewer and assigns a B grade to Under 239.5.Clippers at LakersTime: 10 p.m. | Location: Los Angeles | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Over 226.5\nThe good news for the Los Angeles Lakers: Their big three of LeBron James, Luka Doncic and Austin Reaves are all set to play on Friday against the Los Angeles Clippers. The bad news: James, Doncic and Reaves are all subpar perimeter defenders on big contracts, and that's no way to win a title. The Lakers give up 116.6 points per 100 possessions, which ranks 23rd in the league. Meanwhile, the Clippers are coming off a 115-114 upset of the Nuggets on Thursday night. The SportsLine Projection Model says there's a 64.1% chance the teams combine for 227 points or more and gives a strong A grade to Over 226.5.Looking aheadCollege basketball: No. 4 Arizona at No. 2 HoustonTime: 3 p.m. Saturday | Location: Houston | TV: ABC | Stream: Fubo (Try for free)SportsLine picks -- Model: Houston -5.5 | Expert: Houston -3.5 (Thomas Casale)\nSaturday is an enormous day in college basketball, with two massive games, each featuring two top-four teams and national title contenders. In the first game, the Houston Cougars and Arizona Wildcats collide with the lead in the Big 12 on the line and a possible No. 1 seed in the NCAA Tournament at stake. The Cougars (23-3, 11-2 in Big 12) and Wildcats (24-2, 11-2) enter Saturday's showdown tied for the top spot in the conference. Arizona, however, will be without its No. 2 scorer, Koa Peat (lower leg). That doesn't bode well against Houston, which has the second-best scoring defense in the country (61.6 points per game). \"I like the spot for Houston at home and I think they are the better team,\" Casale says. The SportsLine Projection Model says the Cougars have a 64.0% chance to cover and assigns a B grade to Houston -5.5.No. 1 Michigan vs No. 3 DukeTime: 6:30 p.m. Saturday | Location: Washington, D.C. | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Duke +2.5\nSettle in for college basketball's game of the year: the No. 1 Michigan Wolverines against the No. 3 Duke Blue Devils at Capital One Arena in a showdown that could be a preview of the national championship game. The matchup to watch will be Duke's Cameron Boozer, who's the favorite to win the national player of the year award, against Michigan's army of big men. Led by Boozer, who ranks 14th in the country in rebounds per game (10.0), the Blue Devils rank eighth in the nation in rebound margin (9.8 per game) and have the ability to neutralize the Wolverines' ability to get second shots. The SportsLine Projection Model says there's a 67.0% chance Duke covers and gives a B grade to Blue Devils +2.5.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's top games to watch, best bets: Indiana at Purdue, Clippers at Lakers, more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/51a5ca44-0695-465d-bf76-f028492d5769/thumbnail/1200x675/3f0e42b00ec99234e76836b37badf6b3/purdue.jpg"
      ],
      "datePublished": "2026-02-20T20:30:42.000Z",
      "dateModified": "2026-02-20T20:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duke vs. Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/duke-michigan-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg",
    "tag": "Sports",
    "date": "2026-02-20T23:24:08.000Z",
    "description": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No.",
    "body": "\n        College basketball fans will get an absolute treat on Saturday with a rare marquee nonconfrence showdown in the month of February between No. 1 Michigan and No. 3 Duke. After No. 2 Houston lost earlier this week to Iowa State, this game will more than likely determine who is ranked No. 1 in the AP Top 25 poll on Monday and the team that is in the driver's seat for the No. 1 overall seed in next month's NCAA Tournament. Duke and Michigan have combined for just three losses heading into the weekend. Duke lost to Texas Tech back in December and fell on the road earlier this month to in-state rival North Carolina after the Tar Heels hit a go-ahead 3-pointer with 0.4 seconds remaining after trailing the entire game. The Wolverines have won 11 consecutive games since losing to Wisconsin earlier this month. Michigan remains in firm contention to win the Big Ten regular season title. The Wolverines have a 2.0-game lead over Illinois heading into the weekend with just four conference games remaining in the regular season.  \n        \n            \n                Bracketology: Experts predict NCAA Tournament bracket before committee reveals early top 16 seeds\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nMeanwhile, Duke is 2.0 games ahead of Virginia in the ACC standings, also with four games remaining. Duke faces Virginia at home next weekend. \nHere is everything you need to know ahead of Duke's matchup with Michigan on Saturday.  Duke vs. Michigan: Need to know  No. 1 overall seed on the line: This game not only has major stakes for next week's AP poll, but also the top line of the NCAA Tournament. The winner of this game will be in the driver's seat to earn the No. 1 overall seed in CBS Sports Bracketology.  No. 3 Duke and No. 1 Michigan are 1-2 in WAB -- a new metric the committee will be looking at -- and the NET rankings. Duke and Michigan are tracking to be placed on opposite sides of the NCAA Tournament bracket, which could make this game a potential national title preview if both teams make it to Indianapolis. Frontcourt is the strength of both teams: Michigan's strength is its frontcourt. The Wolverines have one of the best frontlines in the nation in the trio of Morez Johnson Jr., Yaxel Lendeborg and Aday Mara. Michigan will face its toughest test yet, with a matchup against Duke big man Cameron Boozer, the current national player of the year frontrunner. Boozer has been the most consistent player in the sport. Boozer is a walking double-double. Mara is one of the best shot blockers and defenders in the nation. The key to this one will come down to how Michigan can slow down Boozer. \nGuards will be asked to step up: Yes, the strength of both teams is their frontcourt play, but the guards could also decide this game. On the Michigan front, Elliot Cadeau is familiar with Duke as anyone. He spent the last two seasons at North Carolina before transferring to Michigan last offseason. Cadeau's backcourt mate, Nimari Burnett, is a steady veteran presence. On the other side, Duke guard Isaiah Evans has stepped up and become the clear-cut No. 2 option. There are question marks about Duke's point guard play, with Caleb Foster and Cayden Boozer sharing that responsibility. Boozer has seen his role increase lately. That's a good thing for all parties.  Where to watch Duke vs. Michigan live  Date: Saturday, Feb. 21 | Time: 6:30 p.m. ET Location: Capital One Arena -- Washington, D.C. TV: ESPN | Live stream: fubo (Try for free)   Duke vs. Michigan prediction, pick  \nThis game is a rare nonconference Final Four/national title preview in February. It's truly going to be a toss-up. Duke and Michigan rank 1-2 in adjusted defensive efficiency, per KenPom.com, and are also No. 1 and 2 in most other metrics. The key will be the frontcourt and 3-point shooting. Duke shots 34.9% from the 3-point line, while Michigan knocks down 36.1% from beyond the arc. In a sense, Boozer has become almost underrated because people have just gotten used to how dominant he is. This is an opportunity for him to show everyone why he's a Tier 1 NBA Draft prospect. Duke wins behind Boozer and Evans. Pick: Duke +2.5\n \t \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            UM -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duke vs. Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/98cba1bc-9708-4cec-ba27-677da61b3cc5/thumbnail/1200x675/17b74a91bb83b034019f511e7c2fd554/usatsi-28237320-1.jpg"
      ],
      "datePublished": "2026-02-20T23:24:08.000Z",
      "dateModified": "2026-02-20T23:24:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]