[
  {
    "title": "2026 College Football National Championship Game odds, prediction: Miami vs. Indiana picks by proven expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-playoff-national-championship-game-odds-prediction-miami-indiana-top-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/29/f19b6c48-ba7f-4f09-94b2-ef72fb18709a/thumbnail/1200x675/51c3e10689250622cd448b0a2614ffb7/rueben-bain-miami-hurricanes-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-19T15:23:34.000Z",
    "description": "\n        A season which began in August will conclude on Monday with the 2026 College Football Playoff National Championship Game between the Indiana ",
    "body": "\n        A season which began in August will conclude on Monday with the 2026 College Football Playoff National Championship Game between the Indiana Hoosiers and Miami (Fla.) Hurricanes. The No. 1 Hoosiers (15-0) are seeking their first national title and aiming to become the third 16-0 team in the history of the sport. No. 10 Miami (13-2) is looking for its sixth national championship and hopes that playing on its home field proves to be the ultimate advantage. Kickoff is at 7:30 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., which is also Miami's home venue. The Hoosiers are 8.5-point favorites in the latest Indiana vs. Miami odds from DraftKings Sportsbook, while the over/under for total points scored is 47.5. Indiana is at -340 on the money line, with Miami priced at +270. Before making any Miami vs. Indiana picks, make sure you check out what SportsLine expert, Matt Severance, has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:Severance is a well-connected writer and high-volume handicapper who has worked in the industry since 2005. He enters the 2026 CFP tile game as SportsLine's No. 1 college football expert as he's on a 69-43-1 run, returning $1,316 to $100 players. Anyone who has followed him could be way up. \nNow Severance has set his sights on Indiana vs. Miami and just locked in his picks and CFP predictions. You can head to SportsLine now to see Severance's picks. Here are the FBS college football odds and trends for Miami vs. Indiana:Indiana vs. Miami                                                                                                                             spreadIndiana -8.5 (-107) at DraftKings SportsbookIndiana vs. Miami                                                                                                                           over/under47.5 pointsIndiana vs. Miami                                                                                                                                                                                                                                          money line Indiana -340, Miami +270Indiana vs. Miami                                                                                                                                                                                                                                   picksSee picks at SportsLineIndiana vs. Miami                                                                                                                                                                                                                                     streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Indiana can coverRecent history supports the Hoosiers as the favorite has covered in each of the last six national title games. This year, IU is 5-0 ATS versus ranked opponents, with each of those five coming against top-10 teams. On the field, Indiana is peerless, ranking second in the nation in both scoring offense and scoring defense, despite having the ninth-hardest strength of schedule. Heisman winner, and Miami native, Fernando Mendoza has more touchdown passes (8) than incompletions (5) during Indiana's CFP run, and he plays on the most disciplined team in college football. No team has a better turnover differential than the Hoosiers, who also average the fifth-fewest penalties per game in the country. See which team to back at SportsLine.Why Miami can cover In addition to having home-field advantage, Miami also has a spread edge with Carson Beck under center. He's both won and covered in nine straight versus ranked foes, while the Hurricanes are on a 7-0 ATS run against Top 25 teams. Miami has a pair of future first-round draft picks on its D-line as the Canes average the fourth-most sacks per game in FBS. That pass rush is a strength which plays into what's Indiana's biggest weakness. Mendoza has been under pressure recently as he's been sacked an average of 2.5 times over his last six games, following only going down 0.8 times over his first nine games. On the other hand, Beck should have plenty of time in the pocket as Miami allows the lowest pressure rate in the nation. See which team to back at SportsLine.How to make Miami vs. Indiana picksSeverance has analyzed Indiana vs. Miami and is leaning Under on the total. He's also found a critical x-factor that has him jumping on one side of the spread. You can see what it is at SportsLine.Who wins Miami vs. Indiana, and what critical x-factor makes one side of the spread hit hard? Visit SportsLine now to find out, all from the top-ranked expert who is on a 69-43-1 roll (+1316) on college football picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football National Championship Game odds, prediction: Miami vs. Indiana picks by proven expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/29/f19b6c48-ba7f-4f09-94b2-ef72fb18709a/thumbnail/1200x675/51c3e10689250622cd448b0a2614ffb7/rueben-bain-miami-hurricanes-imagn-images.jpg"
      ],
      "datePublished": "2026-01-19T15:23:34.000Z",
      "dateModified": "2026-01-19T15:23:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Indiana-Miami, Nets-Suns, Warriors-Heat - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-300-bonus-bets-targeting-indiana-miami-nets-suns-warriors-heat/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-01-19T15:42:54.000Z",
    "description": "\n        The College Football Playoff National Championship Game and a full NBA schedule on MLK Day provide ample opportunities to take advantage of t",
    "body": "\n        The College Football Playoff National Championship Game and a full NBA schedule on MLK Day provide ample opportunities to take advantage of the newest DraftKings promo code offering $300 in bonus bets. Kickoff for Indiana vs. Miami is scheduled for 7:30 p.m. ET and the Hurricanes covering an 8.5-point spread (-115) is among the top picks from SportsLine's team of experts tonight. Meanwhile, the SportsLine Projection Model is backing Over 217.5 points in Nets vs. Suns (7:30 p.m. ET) and is all over Golden State -5.5 against the Heat (10 p.m. ET). Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season.  Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Monday best bets at DraftKings SportsbookMiami +8.5 vs. Indiana (-115)Over 216.5 points in Nets vs. Suns (-118)Warriors -5.5 vs. Heat (-108)Combining the three picks into a Monday parlay at DraftKings would result in a payout of +564 (risk $100 to win $564). Bet it at DraftKings here: (Odds subject to change)\nMiami +8.5 vs. Hoosiers (-115)\"The temptation to simply side with rampant Indiana at whatever the price is understandable, given the dominating form over Alabama and Oregon in the playoffs, seen off a combined 94-25. Yet we recall struggles vs. Iowa, Penn State, and Ohio State in the Big Ten final; the Buckeyes are the only common foe with the Canes, and Miami arguably was more impressive in its 24-14 Cotton Bowl win over OSU,\" SportsLine college football expert Bruce Marshall said. \"Indiana has been a bully most of this season, and the script could flip on the Hoosiers if Miami holds its nerve, establishes the punishing ground game that has helped it get to the final, and QB Carson Beck meets the moment.\" Back the Texans at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Over 216.5 points in Nets vs. SunsOnly a few years after joining up as trade partners in a blockbuster Kevin Durant deal, both of these rosters look completely different. The injury report will require close monitoring, with Jalen Green (hamstring) and Devin Booker (ankle) listed as questionable for the Suns. However, Michael Porter Jr. should be back after a night of rest on Sunday against the Bulls. The model predicts that the two teams combine for 230 points on average and that the Over hits 66% of the time. Back the Over at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Warriors -5.5 vs. Heat (-108)Golden State has won and covered the spread in five of its last six outings and Miami will be without Tyler Herro (rib) on Monday. Both teams are eighth in their respective conferences, but the Warriors are 24-19 on the season while the Heat are 22-20. The model predicts that Golden State covers the spread in 68% of simulations. Back the Warriors at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:\nWant more NBA picks for Monday?You've seen some of the model's Monday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Indiana-Miami, Nets-Suns, Warriors-Heat - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-01-19T15:42:54.000Z",
      "dateModified": "2026-01-19T15:42:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Stampfl highlights top 2026 Fantasy Baseball sleepers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/2026-fantasy-baseball-draft-prep-frank-stampfls-sleepers-1-0/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/048d34a9-f262-4689-be63-e43d6d33ec55/thumbnail/1200x675/b7f6fe8b66e4e3413b8f281ed3cc85ab/jj-wetherholt-st-louis-cardinals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-19T15:50:33.000Z",
    "description": "\n        Last week I got busts out of the way, and now we get to the fun part… sleepers. As I've said many times before, sleepers are synonymous with ",
    "body": "\n        Last week I got busts out of the way, and now we get to the fun part… sleepers. As I've said many times before, sleepers are synonymous with undervalued. For those paying close attention to Fantasy Baseball, there are no such things as sleepers. Instead, I put together a list of players who I believe have the potential to outperform their early ADP.This list is all over the place, by the way. I have over-the-hill veterans, yet-to-debut prospects, injury bounce-backs, and everything in between. When I first started looking into which players I wanted to write about, I said I would keep this list to 10 names. Instead, I wound up with at least one sleeper at each position (and way more than 10 total). Enough blabbing, let's get it on!Just a heads up that I used NFBC ADP for the month of January (so far).Make sure to check out all of our Sleepers, Breakouts, and Busts:Sleepers 1.0: Scott | Chris | FrankBreakouts 1.0: Scott | Chris | FrankBusts 1.0: Scott | Chris | Frank\nIt's hard to believe Gabriel Moreno is only turning 26 in February. We've heard his name for a long time, and I'm sure many have fatigue by now. I'm here to tell you that Moreno is still loaded with potential, and he actually started to realize that last season. Moreno has great discipline and has always hit the ball hard. The problem is that a lot of that hard contact went straight into the ground. He changed that in 2025, raising his average launch angle from 8.8 degrees to 14.4. According to Statcast, Moreno dropped his GB rate from 50 percent in 2024 to 39 percent in 2025. His pulled air rate nearly doubled from 7.8 percent to 14.6 percent. He's finally starting to figure it out.Over Moreno's final 30 games, he hit .311 with four homers, 20 RBI, an .863 OPS, and an 8.3 percent barrel rate. His groundball rate was just 26 percent during that span! The last hurdle for Moreno will be the injuries. He's yet to play more than 111 games in a season and has played less than 100 each of the past two years. If he stays on the field for 110-120 games, I'm convinced we will get his best season yet. Let's say he hits .280-plus with 12-15 home runs, a handful of steals, and great counting stats, hitting in the middle of that Diamondbacks lineup. Target Moreno as an upside second catcher in two-catcher leagues or a flier in H2H points formats because of his great plate discipline.\nAlec Burleson is somebody who continues to improve. Over the past three years, his OPS has jumped from .691 to .735 to .801 while his wRC+ has gone from 89 to 106 to 124. He's always made a lot of contact, but now he's starting to optimize that contact. Last season, Burleson posted career-highs in average exit velocity (91 MPH) and barrel rate (9.5 percent). He also improved against left-handed pitching, hitting .271 with a .708 OPS. I get that it was a small sample size (127 plate appearances vs. LHP), but with Willson Contreras gone, I believe the Cardinals are just going to give Burleson everyday playing time at first base.Burleson has always given me Josh Naylor vibes as a hitter. He makes a ton of contact, hits the ball decently hard, and continues to improve his launch angle. With everyday playing time, I believe we'll see his best season yet. I envision Burleson hitting .275-plus with 20-plus homers, 5-10 steals, and strong RBI. Those numbers don't blow you away, but it's solid production across the board without hurting you anywhere. Having first base and outfield eligibility doesn't hurt, either. Target Burleson as your corner infielder, an OF4/5 in Roto leagues or a late-round flier in H2H formats.METS DOUBLE DIP\nJorge Polanco just finished as the seventh-best second baseman in Roto and the 10th-best in H2H points, and, based on early ADP, nobody cares. Polanco has had a very hard time staying healthy, but last year he did and went on to hit 26 homers with an .821 OPS. His strikeout rate was just 16 percent, and he hit the ball hard! His 90.8 MPH average exit velocity and 10.3 percent barrel rate both ranked top-five among qualified second basemen last season. While he won't play second base with the Mets in 2026, he still has that eligibility for Fantasy. I get that there's injury-risk here, but Polanco is going late enough where that risk is worth the reward, especially when he's projected to bat in the middle of the Mets lineup. Target Polanco as a middle infielder with pop or a fallback second baseman in H2H points leagues.\nI will admit there's a real chance Marcus Semien is just cooked, but you know what, Stranger Things have happened (hated the ending, by the way). We said the same thing about George Springer last offseason, and look at him! Yes, Springer was the exception, not the rule, but I still think Semien could contribute something. He got off to a brutal start last season, but then reminded us in June that he still has some juice left. In the month, Semien hit .324 with four homers, two steals, and a .932 OPS. While his overall offensive production has dipped the past two years, Semien's underlying data looks pretty similar to what it's always been. He doesn't hit the ball hard, but makes a lot of contact, pulls a decent amount of his fly balls, and remains very fast. Let's say he hits .240-.250 with 20 homers, 15 steals, and decent counting stats. If Semien can approach those numbers, he's currently undervalued.\nKazuma Okamoto signed a four-year deal with the Blue Jays this offseason, and that is a match made in heaven. As we saw in the postseason, Blue Jays hitters had this perfect blend of contact and power in their approach. That's pretty much the player they're getting in Okamoto. He's coming off a season in Japan where he hit .327 with 15 homers, a 1.014 OPS, and the same number of walks as strikeouts in just 69 games. Among NPB hitters with at least 250 plate appearances, Okamoto ranked first in OPS (1.014) and first in wRC+ (210). His power is legit, too. He started his NPB career with six straight seasons of 30-plus homers, including one season with 41 and another with 39. \nWhile Okamoto doesn't have incredible raw power, he pulls the ball in the air at an incredible rate. This is the trick we talk about often when analyzing players like Isaac Paredes and Alex Bregman. They don't have big raw power, either, but they optimize the angle of the ball of the bat. When we put all of this together, we get a pretty complete hitter in a great Blue Jays lineup. I'd bet on a transition period, and maybe Okamoto gets off to a slow start, but once things start to click, I believe he'll put up some big numbers. I actually think Paredes and Bregman are pretty good examples of what you should expect from Okamoto once he gets going.\nTRIO OF SHORTSTOP PROSPECTS\n                                    \n                    Konnor Griffin\n                \n            SS\n        \n                    \n                MiLB stats\n            \n                    BA.333R117HR21RBI94SB65NFBC ADP205        \n            \nI know top prospects have struggled in their first taste in the majors in recent years, but there's no risk when these three are going so late. Through 18 days of January, each of Konnor Griffin, JJ Wetherholt, and Kevin McGonigle are going outside the top-200 picks in NFBC ADP. Let's start with Griffin, who was named Baseball America's Minor League Player of the Year. Simply put, he is a freak. In his first minor-league season, Griffin hit .333 with 21 homers, 117 runs scored, 94 RBI, 65 steals, and a .941 OPS! He improved at each level, even getting 21 games in at Double-A as a 19-year-old. It would be extremely aggressive for Griffin to be up on Opening Day, but the Pirates need to capitalize while Paul Skenes is still on their team. According to Jeff Passan, Pittsburgh is strongly considering giving Griffin the opportunity to win their starting shortstop job. His ADP is one to monitor, but assuming it doesn't rise too much, Griffin should definitely be on your radar as a late-round option.\n                                    \n                    JJ Wetherholt\n                \n            2B\n        \n                    \n                MiLB stats\n            \n                    BA.306R82HR17RBI59SB23NFBC ADP262.4        \n            \nNext up, we have JJ Wetherholt, a first-round pick by the Cardinals back in 2024. Wetherholt is 23 years old and appears to be knocking on the door to the bigs. Last season, he hit .306 with a .421 OBP, 17 homers, 23 steals, and a .931 OPS across three levels. Like Griffin, Wetherholt got better each time he moved up a level, posting a .978 OPS in 47 games at Triple-A. Wetherholt is not as dynamic as Griffi,n but he's an extremely polished hitter (nearly as many walks as strikeouts) with solid power and speed. The Cardinals have been tearing down their roster and aren't done yet. I'd still bet on Brendan Donovan getting moved before spring training. Once that happens, Wetherholt will have two positions available to try and win: second or third base. Wetherholt should be on your radar as a late-round flier, especially in H2H points leagues due to his strong plate discipline.\nKevin McGongile is a lot like Wetherholt, except he might have a little more juice. McGonigle was limited to just 88 games last season, but when he played, he dominated. He hit .305 with a .408 OBP, 19 homers, 10 steals, and a .991 OPS across three levels. The difference between McGonigle and Wetherholt is that McGonigle didn't make it all the way to Triple-A. He had an ankle injury earlier in the season that delayed his progression. McGonigle did, however, play in the Arizona Fall League, where he put up huge numbers and eventually won league MVP. Chris Towers and I had a chance to watch McGonigle twice in the AFL, and he looked like a man among boys (see below). We'll see how aggressive the Tigers want to be with McGonigle this spring, but they could slow-play him a little bit, considering he hasn't played above Double-A. Even if he starts the season in the minors, he's worth drafting and stashing given his incredible approach, power, and speed.\nSome of the biggest league winners last season were veteran bats coming off injury-plagued seasons. I keep going back to Anthony Santander as one of the hitters who could do something similar in 2026. He dealt with a shoulder issue all season, returned in September, and then got shut down in the playoffs with a back injury. He was never right, hitting just .175 with six homers and a .565 OPS in 54 games. Let's not forget what Santander did back in 2024, though. He hit 44 homers with 102 RBI, finishing as a top-seven outfielder in both Roto and H2H points leagues. From 2022-2024, Santander was actually one of the most reliable sluggers in baseball. During that three-year stretch, his 105 homers were sixth most, while his .234 isolated power ranked in the top 20 among qualified hitters.I don't think Santander will get back to hitting 44 bombs, but can he hit around 30? I think so, and if he does so in this Blue Jays lineup, the counting stats should be plentiful. Back in December, we got a good report from Blue Jays manager John Schneider, too. \"Tony is going to be huge for us… He is motivated. He is hungry to get back to the player we know he is.\" Santander should fit this Blue Jays team like a glove. When he's at his best, he avoids strikeouts and hits for power. Like I mentioned with Okamoto, that's exactly what this Blue Jays team did in the postseason. Santander's batting average will be a drag, but I believe he can produce above-average home runs and RBI. He's also a name you can target late in H2H points leagues since he typically avoids strikeouts.\nI want to quickly mention two deep-league outfield prospects, one that should provide big speed and another who should provide power. First up, we have Justin Crawford, son of former Major Leaguer Carl Crawford. Justin was a first-round pick back in 2022, and so far, his skillset is very similar to his father's! He hits for a high batting average with a bunch of steals. In 112 games at Triple-A last season, Crawford hit .334 with 46 steals and 88 runs scored. He actually hits the ball harder than you'd expect for a speedster, but a large majority of his batted balls go straight into the ground. Crawford still needs to earn his spot on the Opening Day roster, but it sure sounds like Phillies President Dave Dombrowski believes that will happen. If you're looking for this year's Chandler Simpson, it very well could be Crawford.\nThe outfield prospect who should provide power is Owen Caissie. He arrived in Miami a few weeks back via the Edward Cabrera trade. While Miami is not the best hitting environment, Caissie has light-tower power that should translate anywhere... assuming he makes enough contact. Caissie is 23 years old and just hit 22 homers in 99 games at Triple-A last season. He posted a 91.9 MPH average exit velocity and his 16.9 percent barrel rate, which ranked in the 96th percentile. His issue has been strikeouts. Caissie's posted strikeout rates above 27 percent at every single level of the minors, and that's something he'll definitely have to work on. Like Crawford, it sounds like Caissie has a very real chance to be on his team's Opening Day roster. I actually think his skillset is very similar to teammate Kyle Stowers, who just had a breakout season of his own. I'm hoping Stowers takes Caissie under his wing and helps him tap into that massive power in year one.\nPeople aren't sleeping on Nick Lodolo in the truest sense of the word, but I do think he's undervalued based on early ADP. Lodolo finally had his breakout season last year, posting a 3.33 ERA and 1.08 WHIP over a career-high 156.2 innings. How'd he do it? He improved the control and tweaked the pitch-mix. Entering last season, Lodolo had a 7.8 percent walk rate in his career, but in 2025, he dropped it down to 4.8 percent. I have no idea if that's sustainable, but it's obviously a step in the right direction. As for the pitch-mix, Lodolo lowered the sinker usage and added more changeups. The sinker gets hit hard while the changeup has been solid. Last season, that changeup had a .201 batting average against with a 28 percent whiff rate. Lodolo got better in the second half, too. His strikeout rate jumped from 22 percent in the first half to 30 percent in the second half. He threw more curveballs after the All-Star break, which makes sense as it's far and away his best pitch. I believe Lodolo has figured it out and could perform like an SP2 this season. The metrics back it up. Among pitchers with 150 innings last season, Lodolo ranked top 20 in K-BB rate, xFIP, SIERA, xERA, and swinging strike rate. He's missed time in the past, but it's mostly been blisters and lower-body issues. Of course, I'd rather him have a clean bill of health, but at least it hasn't been arm-related. I'm viewing Lodolo like Cristopher Sanchez and Bryan Woo from last season, a pitcher going in the middle rounds who could take another step forward this year. Don't miss out!\nHas everybody forgotten that Kris Bubic was a beast last season? In 20 starts, he posted a 2.55 ERA with a 1.18 WHIP. His 14.4 Fantasy points per game ranked higher than Logan Gilbert, Joe Ryan, and Framber Valdez. When Bubic is at his best, he gets whiffs and ground balls while limiting hard contact. What more could you ask for? Health, duh! Bubic was shut down in late July with a rotator cuff strain and did not return last season. I understand the severity of the situation, but his upside is worth the risk outside the top-200 picks. Look at his teammate, Cole Ragans. He also dealt with a rotator cuff strain, but returned in September and didn't miss a beat. It's a scary injury, but not an impossible one to come back from.Bubic has mostly a four-pitch mix, and all of them are quality offerings. His four-seam fastball, changeup, and sweeper each had an xwOBA below .290 last season. To put that in perspective, here are some qualified hitters who had an xwOBA below .290: Alek Thomas, Gabriel Arias, and Adam Frazier. I think you get the point. While Bubic has a good mix of pitches, everything starts with his fastball. It's not hard at 92 MPH, but he gets great extension and induced vertical break on the pitch. The 27 percent whiff rate on his fastball ranked in the 89th percentile last season. Bubic is definitely a risk with the shoulder injury from last season, but his upside is SP2 production. Who knows, maybe he even finds a way to stay on the mound in a contract year. \nI'll move much quicker through these deep starting pitcher sleepers, but I have a trio I wanted to mention. Robby Snelling is up first. The Marlins have already traded away Edward Cabrera and Ryan Weathers this offseason. Part of why they can afford to do that is that they have elite pitching prospects in Snelling and Thomas White. I believe Snelling will get the first opportunity, and I am very excited about his potential. He has a four-pitch mix, but it's mostly his four-seam and curve that do the heavy lifting from the left-hand side. Last year in the minors, Snelling did a great job getting whiffs, inducing ground balls, and limiting hard contact. He also threw six-plus innings in 14 of 25 starts, which is an outlier for a pitching prospect. I believe Snelling will win a job in the Marlins rotation this spring and will continue to rise up draft boards.\nAs a general thesis for 2026, I like buying low on Rays pitchers now that they're moving back into Tropicana Field. For whatever reason, the Trop helps pitchers' stuff play up, which leads to more strikeouts in that venue. One of the Rays pitchers you can get very late is Ian Seymour. We've heard the name as a prospect for years, but he finally got called up last season and impressed. Seymour put up a massive 26 percent strikeout rate behind a 12 percent swinging strike rate. His fastball, changeup, and sweeper all generated whiffs at an above-average rate. I also like that he's another one of these funky lefties at a time when that type of pitcher is thriving. He's not locked into a rotation spot as of now, but I believe he'll win one this spring. Seymour is also a SPARP for those in H2H points leagues.\nSpeaking of funky lefties, can I interest you in Parker Messick? The Guardians called him up late last season, and he impressed in his seven starts. He got decent whiffs, limited the walks, and induced a good amount of ground balls. I'm a little skeptical of his control given the minor-league numbers, but overall I'm intrigued by him as a talent. Messick has a nasty fastball-changeup combination and a slider he mixes in to get lefties out. The fastball generated a 29 percent whiff rate, which ranked in the 95th percentile. Also, the Guardians have a pretty good track record when it comes to pitching. Like Seymour, it's not a guarantee that Messick is in the rotation, but I have confidence he'll win a job this spring.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Stampfl highlights top 2026 Fantasy Baseball sleepers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/048d34a9-f262-4689-be63-e43d6d33ec55/thumbnail/1200x675/b7f6fe8b66e4e3413b8f281ed3cc85ab/jj-wetherholt-st-louis-cardinals-imagn-images.jpg"
      ],
      "datePublished": "2026-01-19T15:50:33.000Z",
      "dateModified": "2026-01-19T15:50:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas' reported $2.2 billion valuation leads nation as college football business skyrockets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-most-valuable-programs-texas-ohio-state-lsu-notre-dame/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/4a2483a4-e0e3-4ad1-8499-9711a5ff2645/thumbnail/1200x675/ab35a00090de0d5fc0b2c0fd7cdb4f6b/maning.png",
    "tag": "Sports",
    "date": "2026-01-19T15:35:24.000Z",
    "description": "\n\n\n    \n                                    The Wall Street Journal has released its study on highest valuations within college football\n        \n    ",
    "body": "\n\n\n    \n                                    The Wall Street Journal has released its study on highest valuations within college football\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 19, 2026\n                            \n                    at\n    10:35 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The estimated valuation of the Texas football program is nearly $2.2 billion, according to the Wall Street Journal's annual study of college football's wealthiest programs. Valuations have increased 46% year-over-year within the top 20 of the nation's top programs, a record during the NIL and revenue-sharing era ahead of Monday night's College Football Playoff National Championship Game featuring Indiana and Miami.Ironically, neither of those programs rank among the highest valuations, as 15 teams exceeded $1 billion, including 14 from the SEC or Big Ten with Notre Dame being the outlier at No. 6 ($1.418 billion valuation). The Longhorns hold the highest adjusted revenue from 2025 at $298 million, followed by Texas A&M ($218 million), LSU ($213 million) and Nebraska ($197 million).College football media rights recently crossed $4 billion, with ticket sales, alumni donations, licensing, ad contracts and conference distributions collectively helping make college athletics one of the world's biggest businesses.The SEC and Big Ten, who hold voting power over other major conferences and Notre Dame, are going back and forth on the next round of playoff expansion with a deadline set for Friday. As of Monday, no agreement has been made for 2026 with the two leagues split on either a 16-team or 24-team bracket.\nCollege football program valuationsProgramAdjusted revenue 2025Valuation1. Texas$298,000,000$2.197 billion2. Texas A&M$218,000,000$1.593 billion3. Ohio State$185,000,000$1.547 billion4. LSU$213,000,000$1.543 billion5. Michigan$200,000,000$1.463 billion6. Notre Dame$170,000,000$1.418 billion7. Georgia$195,000,000$1.472 billion 8. Penn State$193,000,000$1.411 billion9. Alabama$192,000,000$1.401 billion10. Nebraska$197,000,000$1.236 billion11. Oklahoma$160,000,000$1.153 billion12. Washington$182,000,000$1.147 billion13. Tennessee$177,000,000$1.114 billion14. Auburn $175,000,000$1.101 billion15. Iowa$162,000,000$1.017 billion16. USC$161,000,000$999 million17. Florida $155,000,000$978 million18. Wisconsin$156,000,000$963 million19. Oregon$139,000,000$873 million20. Colorado$141,000,000$870 millionFollowing last summer's landmark House v. NCAA antitrust settlement, the door was opened for the first time for millions of dollars to be shared between schools and players. Schools were allowed to share as much as $20.5 million of their revenues with players this season, with that figure reportedly being the floor of roster-spending with many exceeding that number.Texas coach Steve Sarkisian dispelled \"irresponsible reporting\" of his roster nearing $40 million this season back in May 2025. Indiana coach Curt Cignetti told CBS Sports last spring that many of the top programs allocated tens of millions to their talent acquisition efforts.\n        \n            \n                Which 2025 College Football Playoff teams have the most money? Breaking down the field's NIL spending power\n                \n                    Carter Bahns                \n            \n                            \n    \n                \n                    \n    \nPrior to winning last season's national championship, Ohio State athletic director Ross Bjork confirmed the Buckeyes had one of the nation's highest-paid rosters. This came a few years after the NCAA began permitting NIL compensation in 2021, allowing athletes the ability to earn money through endorsements and third-party entities.With one of the nation's largest athletic budgets, Ohio State was one of the early adopters of college football's new recruiting and player retention model and it worked to the Buckeyes' advantage.Ohio State, Oregon, Texas Tech, Texas A&M and Miami are in a tier of their own when it comes to spending from this season's playoff field. Each of those programs has reloaded annually through the transfer portal, highlighted by the Red Raiders, who have garnered one of the new seats at the table thanks to spending.Per the WSJ's study, Oregon ranked 19th in valuation for 2025 at $873 million. The Ducks were sandwiched between Wisconsin and Colorado to round out the top 20.A quarter of the top 20 will have new coaches in 2026, including LSU (Lane Kiffin) and Penn State (Matt Campbell). The Tigers currently hold the top transfer class nationally ahead of Kiffin's first season, per 247Sports. That includes the acquisition of top-rated quarterback and No. 1 overall player Sam Leavitt (Arizona State) and fellow signal caller Husan Longstreet (USC).\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas' reported $2.2 billion valuation leads nation as college football business skyrockets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/4a2483a4-e0e3-4ad1-8499-9711a5ff2645/thumbnail/1200x675/ab35a00090de0d5fc0b2c0fd7cdb4f6b/maning.png"
      ],
      "datePublished": "2026-01-19T15:35:24.000Z",
      "dateModified": "2026-01-19T15:35:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking eight NFL head coaching vacancies: Which jobs look most appealing in 2026? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ranking-head-coaching-vacancies-which-of-these-eight-remaining-jobs-is-the-most-desirable/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/fa7a1d0b-0060-4b54-8144-82b8c686351b/thumbnail/1200x675/bf0fa27f4da67d758de25e37f3baed20/getty-sean-mcdermott-josh-allen-bills.jpg",
    "tag": "Sports",
    "date": "2026-01-19T15:34:59.000Z",
    "description": "\n        The 2025 NFL regular season is in the books, and change is already in the air. The offseason is a time of immense turnover, as players switch",
    "body": "\n        The 2025 NFL regular season is in the books, and change is already in the air. The offseason is a time of immense turnover, as players switch teams via free agency or trade, teams change their rosters by acquiring them through one of those avenues or in the draft, and plenty of clubs swap out their coaches as they look to improve from one year to the next.We're here today to talk about the latter group of teams. So far nine NFL teams have fired their coaches and one, Mike Tomlin, has stepped down. The Tennessee Titans and New York Giants fired Brian Callahan and Brian Daboll during the regular season. The Atlanta Falcons fired Raheem Morris right after their season ended. And on Black Monday, the Cleveland Browns fired Kevin Stefanski, the Las Vegas Raiders fired Pete Carroll and the Arizona Cardinals fired Jonathan Gannon. The Baltimore Ravens fired John Harbaugh after 18 seasons. Then the Miami Dolphins fired Mike McDaniel. Tomlin stepped down from his post as the Pittsburgh Steelers head coach after 19 seasons last week. Following a playoff loss to the Broncos in the divisional round, the Buffalo Bills entered the coaching hunt after firing Sean McDermott. In the wake of all of those changes, let's rank the coaching vacancies in order of their desirability.Follow live updates on NFL coaching and GM changes, firings and rumors.\n                            \n    \n                                                \n                    \n    1. BillsThe Buffalo Bills have arguably the best player in the league at the most important position in the sport in Josh Allen. That alone makes this the most coveted job of this cycle, after the Bills fired Sean McDermott after their latest playoff loss to the Denver Broncos. Pairing yourself next to Allen has championship potential, so every head coach who hasn't already accepted a job will almost certainly stop what they're doing and see if they can align themselves with Allen. \nOutside of the elite QB, Buffalo does have other things going for it. James Cook is coming off a 2025 regular season where he led the NFL in rushing, the defense allowed a league-low 156.9 passing yards per game, and they are just about to move into a brand new stadium. That said, whoever is hired will need to help improve a horrid run defense and get the most out of a lacking pass-catching group to truly help Allen get over the hump in the postseason. \n                            \n    \n                                                \n                    \n    2. RavensThe Baltimore Ravens are the only team this coaching cycle that can offer prospective candidates the opportunity to coach a multi-time NFL MVP quarterback in Lamar Jackson. Plus, running back Derrick Henry showed no signs of slowing down in his age-31 season in 2025, rushing for 1,585 yards -- the second-most in the entire NFL. There are also a couple All-Pro building blocks on defense with linebacker Roquan Smith and safety Kyle Hamilton. Baltimore should make a playoff return in 2026 no matter who their head coach is provided they reinforce Jackson's offensive line as well as their defensive line. The Ravens do have some cap space to play with at the moment with $12.4 million in effective cap space, according to OverTheCap.com. Moving off of defensive tackle Nnamdi Madubuike's contract down the road following his neck injury could free up significant cap space in the coming years. \n\n                            \n    \n                                                \n                    \n    3. TitansTennessee restructured its front office over the weekend such that Mike Borgonzi will oversee the 53-man roster and lead the coaching search while Chad Brinker will handle the other football operations responsibilities. The Titans had one of the worst rosters and coaching situations in the NFL this season, but they might be set up to make a jump next year.Cam Ward's overall numbers don't look great, but there were so many flashes of high-level talent when you turn on the film. He was let down by a decrepit supporting cast and has a chance to be much better next year if the Titans improve the talent around him. And they'll have every chance to do so because Tennessee is set to enter the offseason with over $105 million in cap space and the No. 4 pick in the draft. They're not necessarily a candidate to go worst-to-first like the Bears and Patriots did this year, but they definitely have a chance to be a lot better next season if they hit on the right coach and use their budget and draft capital wisely, like those teams did. \n\n                            \n    \n                                                \n                    \n    4. RaidersThe Raiders are here for four reasons: Brock Bowers, Ashton Jeanty, the No. 1 pick in the draft and $100 million in cap room. (You could say five reasons and include Maxx Crosby, but there are already rumors swirling that the Raiders are finally willing to listen to trade offers for the star edge rusher, so he may not be long for Las Vegas.) There is just not much talent on this team outside of those players. There is a loooong way to go before the Raiders can be remotely competitive, and it doesn't help that they play in the AFC West, which is one of the most competitive divisions in football. Like the Titans, though, they can take a jump next season if they hit on their coach and whichever quarterback they presumably draft with the No. 1 pick, and spend their free-agent money to upgrade the talent level on the roster.One drawback here is the ownership situation, where Mark Davis seems to flail wildly from one plan to the next in quick succession. The Vegas job is not exactly stable, and doesn't come with a lot of job security, as evidenced by all the changes the Raiders have made over the last several years. \n\n                            \n    \n                                                \n                    \n    5. SteelersThe Pittsburgh Steelers have a patient ownership group under the Rooney family: they've only had three head coaches since the 1970 AFL/NFL merger. Their defense remains stout led by All-Pro edge rusher T.J. Watt with the Steelers generating three takeaways -- an interception and two fumbles recoveries -- off of Houston Texans quarterback C.J. Stroud in an eventual defeat thanks to their crumbling offense around Aaron Rodgers. This is an organization headed for a rebuild after five consecutive seasons with 9 or 10 wins with four of those years ending with wild card round defeats. Pittsburgh does have $23.6 million in effective cap space according to OverTheCap.com, but this offseason doesn't have a great free agency quarterback class, notable considering the Steelers haven't had a long-term quarterback since Ben Roethlisberger's retirement after the 2021 season. The best options are Daniel Jones coming off of a torn Achiles, Rodgers entering his age-43 season or Green Bay Packers backup quarterback Malik Willis who shined in relief of Jordan Love the last two seasons. On the trade market, Kyler Murray is likely the best choice. Whoever takes this job will be tasked with helping the Steelers build around that elusive franchise quarterback, rebuild a stale offense and manage what's becoming a quickly aging defense.  \n\n                            \n    \n                                                \n                    \n    6. BrownsThe Browns have a good defense built around Myles Garrett, who is just an inhuman monster coming around the edge. They drafted a pair of star rookies in tight end Harold Fannin Jr. and linebacker Carson Schwesinger. They have multiple first-round picks in this year's draft thanks to last year's Travis Hunter trade. What the Browns don't have is much other talent on offense (Quinshon Judkins will be coming off a dislocated ankle and fractured fibula), an answer at quarterback or any cap space to solve their various issues. Cleveland is set to begin the offseason more than $12 million over the cap, according to Over the Cap, and it still has the albatross of Deshaun Watson's contract weighing down its books in both 2026 and 2027, at least.The Browns also have an ownership and management situation that is, shall we say, not all that desirable. The Haslam family has run one of the most unstable organizations in the league, and Andrew Berry hasn't exactly put together a great roster. (The combination of the Haslams and Berry was responsible for the disastrous Watson trade.)\n\n                            \n    \n                                                \n                    \n    7. CardinalsArizona lost 14 of its final 15 games this season and looked incredibly listless in doing so. The Cardinals have an uncertain quarterback situation with Kyler Murray seemingly not long for the team, and they really have no viable path to solving that situation this offseason unless it becomes a three-quarterback draft or the Jets decide to pass on someone like Dante Moore (if he enters) or Fernando Mendoza at No. 2 overall. Arizona is set to have only around $21 million in cap room (and only $9.8 million in effective cap space), per Over the Cap, so it's not like there are a lot of resources here to solve the various roster issues. They do have players like Trey McBride, Michael Wilson, Paris Johnson Jr., Josh Sweat, Budda Baker, Garrett Williams, Walter Nolen and Will Johnson, but there are still a lot of holes here and not that much to build around.\n\n                            \n    \n                                                \n                    \n    8. DolphinsMiami is an interesting spot. Mike McDaniel was able to have his team playing better down the stretch (5-3 after a 2-7 start), but that wasn't enough to save his job, and, in turn, it has them on the outside looking in on the top 10 of the 2026 NFL Draft (picking No. 11 overall). That doesn't give them a clear lane for a top quarterback prospect, as they are likely to move on from Tua Tagovailoa in some capacity this offseason. That could lead to the Dolphins exploring free agency or the trade market to fill their need under center. Because that position is currently clouded at the moment, it may make some coaching candidates wary. The franchise is also looking at a tricky salary cap situation as they are currently projected to be $23.2 million over the cap. Per Over the Cap, even if Miami found a trade partner for Tagovailoa, they'd be looking at a $45.,2 million dead cap charge and about $11.2 million in savings (pre-June 1). That's a long way in saying that it could be a lean first year as the new general manager gets the books in order. As for the talent on the roster, there are some nice pieces on offense in Tyreek Hill, Jaylen Waddle, and De'Von Achane, but they are still missing some key building blocks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking eight NFL head coaching vacancies: Which jobs look most appealing in 2026? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/fa7a1d0b-0060-4b54-8144-82b8c686351b/thumbnail/1200x675/bf0fa27f4da67d758de25e37f3baed20/getty-sean-mcdermott-josh-allen-bills.jpg"
      ],
      "datePublished": "2026-01-19T15:34:59.000Z",
      "dateModified": "2026-01-19T15:34:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League: Inter host Arsenal to headline Matchday 7 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-matchday-7-inter-host-arsenal-while-manchester-city-and-liverpool-look-to-get-back-on-track/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/e665800a-d1ee-48a1-a8d6-6f901ce37e22/thumbnail/1200x675/c97438785f5ea3cf51914cc93396433d/untitled-design-2026-01-19t163147-391.png",
    "tag": "Sports",
    "date": "2026-01-19T15:41:31.000Z",
    "description": "\n        It's getting real as we prepare for Matchday 7 in Champions League play. With only two matchdays remaining in the league phase, there's still",
    "body": "\n        It's getting real as we prepare for Matchday 7 in Champions League play. With only two matchdays remaining in the league phase, there's still much to be decided. Only five teams have booked their places in the knockout stage, and no teams have clinched places in the top eight of the league phase, although that could change depending on how the dust settles at the end of the matchday.Chelsea and Real Madrid will be debuting new managers in the Champions League, as quite a lot has changed since matchday six ended back in December. Both clubs have a shot at finishing in the top eight of the league phase, which would mean a direct spot in the round of 16, but there's plenty that needs to happen ahead of that.Here's what you need to know ahead of a busy Champions League week.How to watchParamount+ will have every minute of the Champions League action on Matchday 5, while CBS Sports Network and CBS Sports Golazo Network will have supplemental coverage. The broadcast begins with the UEFA Champions League Today pre-match show on Paramount+ and CBS Sports Network, while  CBS Sports Golazo Network will also preview the early games on Tuesday, while Paramount+  will have the UEFA Champions League Today pre-match show exclusively on Wednesday. Post-match coverage consists of the UEFA Champions League Today post-match show on Paramount+ and CBS Sports Golazo Network, while coverage concludes with new editions of The Champions Club and Scoreline.Matchday 7 TV scheduleAll times U.S./Eastern\nTUESDAY, Jan. 20TIMEHOW TO WATCHKairat Almaty vs. Club Brugge10:30 a.m.Paramount+, CBS Sports Golazo NetworkUEFA Champions League Today pre-match12 p.m.Paramount+, CBS Sports NetworkChampions League Matchday12 p.m.Paramount+, CBS Sports Golazo NetworkBodo/ Glimt vs. Manchester City12:45 p.m.Paramount+, CBS Sports NetworkUEFA Champions League Today pre-match2:45 p.m.Paramount+, CBS Sports NetworkChampions League Matchday2:45 p.m.CBS Sports Golazo NetworkThe Golazo Show3 p.m.Paramount+, CBS Sports Golazo NetworkInter vs. Arsenal3 p.m.Paramount+Tottenahm vs. Borussia Dortmund3 p.m. Paramount+Olympiacos vs. Bayer Leverkusen3 p.m. Paramount+Villarreal vs. Ajax3 p.m.Paramount+Copenhagen vs. Napoli3 p.m.Paramount+, CBS Sports NetworkSporting CP vs. Paris Saint-Germain3 p.m.Paramount+Real Madrid vs. Monaco3 p.m.Paramount+UEFA Champions League Today post-match5 p.m.Paramount+, CBS Sports Golazo NetworkThe Champions Club6 p.m.CBS Sports Golazo Network, YouTubeScoreline7 p.m.CBS Sports Golazo NetworkWEDNESDAY, Jan. 21TIMEHOW TO WATCHChampions League Matchday12 p.m.CBS Sports Golazo NetworkGalatasaray vs. Atletico Madrid12:45 p.m.Paramount+, CBS Sports NetworkQarabag vs. Eintracht Frankfurt12:45 p.m.Paramount+UEFA Champions League Today pre-match2 p.m.Paramount+Champions League Matchday2:45 p.m.CBS Sports Golazo NetworkThe Golazo Show3 p.m.Paramount+, CBS Sports Golazo Network Marseille vs. Liverpool3 p.m.Paramount+Newcastle United vs. PSV3 p.m.Paramount+, CBS Sports NetworkBayern Munich vs. Union Saint-Gilloise3 p.m.Paramount+Liverpool vs. PSV3 p.m.Paramount+Chelsea vs. Pafos3 p.m.Paramount+Juventus vs. Benfica3 p.m.Paramount+Atalanta vs. Athletic Club3 p.m.Paramount+Slavia Praha vs. Barcelona3 p.m.Paramount+UEFA Champions League Today post-match5 p.m.Paramount+, CBS Sports Golazo NetworkThe Champions Club6 p.m.CBS Sports Golazo Network, YouTubeScoreline7 p.m.CBS Sports Golazo NetworkStorylines for Matchday 7Which Manchester City will appear?: Just when it seemed like the addition of Antonine Semenyo was turning around fortunes at Manchester City, they'll now need to bounce back from a disappointing loss to Manchester United in the Manchester derby during a trip to the Arctic Circle. Facing Bodo/Glimt, Pep Guardiola's side will be favored for a good reason, but with City failing to beat teams such as Brighton and Sunderland in league play, anything could happen. City have now failed to pick up a win in four consecutive Premier League games, while star striker Erling Haaland has only scored once in his last seven appearances in all competitions.\n                                                                    CBS Sports\n                                                            When City have struggled to figure out who their secondary option is in attack after the Norwegian, this spell of not scoring has been detrimental, with the defense also suffering injuries. Marc Guehi's arrival is imminent and will help with improving the defnese but he won't be ready by this game as City's form will be something to watch.Can Liverpool stop the slide?: The list of struggling Premier League sides is quite a long one, and pressure is rising on Arne Slot at Anfield. Florian Wirtz has been in the process of turning his season around in the turn of the new year, but it hasn't been enough for the Reds to improve their own form as they prepare for a tough away trip to face Marseille after drawing with a Burnley side who are bound for the Championship. With only one win in their last five matches in all competitions, it's hard to have confidence that Liverpool will go away to France and leave with a victory. Marseille manager Roberto De Zerbi is familiar with the Premier League from his time at Brighton, and with the French side only in 16th in the table, they can't feel comfortable with their place, as a few bad results could see them miss the knockout stage altogether. When both teams need a win, and each has their flaws in European play, it's a time where stars will need to step up and make things happen.\nInter and Arsenal meet for must-see television: We could be in for a preview of the Champions League final. Inter have finished as runners-up in two of the last three Champions League finals, and Cristian Chivu has them on track to make another deep run in this competition. Meanwhile, Arsenal are marching toward a Premier League title and are still chasing the first Champions League title in their rich club history. Their defensive dominance has translated to European play, but matches like this one, facing Inter, are what will show if Mikel Arteta's side can rise to the occasion and better their semifinal appearance from last season. Both teams are currently in the top six of the league phase table, with Arsenal leading the pack, only allowing one goal in the Champions League, while Inter are sixth, allowing four goals. It could be hard for anyone to hit the back of the net, but sometimes when teams meet in matches of this magnitude, they can open up.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League: Inter host Arsenal to headline Matchday 7 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/e665800a-d1ee-48a1-a8d6-6f901ce37e22/thumbnail/1200x675/c97438785f5ea3cf51914cc93396433d/untitled-design-2026-01-19t163147-391.png"
      ],
      "datePublished": "2026-01-19T15:41:31.000Z",
      "dateModified": "2026-01-19T15:41:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking the top 20 prospects in the NL East ahead of the 2026 MLB season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-prospect-ranking-nl-east-mets-phillies-nationals-marlins-braves/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/29/686e9f31-01e8-48b6-9b64-bab374580fe3/thumbnail/1200x675/a0ab14bedb8ec0ff40c1e08f0039346e/mclean-getty.png",
    "tag": "Sports",
    "date": "2026-01-19T15:30:19.000Z",
    "description": "\n        The start of a new year can mean only one thing around these parts: it's time to analyze and rank an unhealthy amount of minor-league prospec",
    "body": "\n        The start of a new year can mean only one thing around these parts: it's time to analyze and rank an unhealthy amount of minor-league prospects. Such is the tradition here at CBS Sports, but while we're upholding that tradition, be aware that we're making some changes to our approach by ranking the top 20 prospects per division, however that breaks down by team. Our belief is that those tweaks will make the coverage better by making it easier for fans to compare how their future players stack up against their top rivals. These rankings are formed through firsthand observational and statistical analysis; conversations with scouts, analysts, and player development specialists; and an understanding of historical trends. Add in some biases toward and against certain player types and, on occasion, a tiebreaking coin flip, and you have a general idea about how we put these lists together.Below, you'll find the National League East list. It's fair to write that the Mets have the best farm system of this group. Both the Mets and the Phillies employ three of the top 10 prospects apiece, but the Mets separate themselves by employing two additional ranked prospects (versus just one for the Phillies). As an added bonus, the Mets could graduate all of their ranked players: right-handers Nolan McLean, Jonah Tong; outfielders Carson Benge and Jett Williams; and infielder Jacob Reimer. New York, then, should have plenty of depth to call upon.Conversely, the Braves have the weakest farm system of the division when you take prospect quality into account. Of Atlanta's three ranked players, the highest checks in at No. 11. To be fair, the Braves could graduate two of the three this season: right-handers JR Ritchie and Didier Fuentes. If nothing else, at least they can benefit from immediate help.\nNow, let's get down to business. \n                            \n    \n                                                \n                    \n    1. Nolan McLean, RHP, MetsThe quick hook: End-of-season breakout star remains eligibleMLB ETA: Already debutedMcLean was the breakout star of the regular season's final six weeks. He debuted in mid-August then notched a 2.06 ERA (196 ERA+) and a 3.56 strikeout-to-walk ratio in eight starts. It's hard to do much better than that. It's also hard to do much better from a modern arsenal perspective than what McLean has going on. He throws six pitches -- a pair of mid-90s fastballs, two high-spin breaking balls with massive horizontal break, and a cutter that serves as a bridge offering -- giving him plenty of options to break out against hitters of either hand. He works the angles too, with a delivery that sees him launch the ball from a low angle and release height. Piece it all together and it's easy to understand why McLean looks like a star already on the rise.\n                            \n    \n                                                \n                    \n    2. Aidan Miller, SS, PhilliesThe quick hook: Left-side infielder on the cuspMLB ETA: Summer 2026The knocks against Miller as an amateur pertained to his age (he was 19) and his long-term defensive home (scouts thought he'd move to third base). The Phillies took him in the late stages of the first round all the same. Three years later, his birthdate and position remain unchanged. Miller is still a shortstop, even if he's not likely to win any individual honors for his fielding. The same may not be true of his hitting. Between his strong hands, his discerning eye, and his feel for contact, he should be able to bat in the middle of good lineups. The Phillies already have one quality shortstop in place, but Miller ought to make his big-league debut this season at some left-side position or another.\n                            \n    \n                                                \n                    \n    3. Thomas White, LHP, MarlinsThe quick hook: Physical left-hander reimagined MLB ETA: Late summer 2026White overhauled his arsenal from year to year, making clear alterations to his changeup (it now features more velocity and far more sink) and adding in a cutter/slider to serve as a bridge offering between his rising mid-90s fastball and his sweeping slider. His new-look repertoire empowered him to post a 2.31 ERA and a 2.84 strikeout-to-walk ratio across three levels, including a two-start stint in Triple-A. White still needs to reduce his walk rate (he averaged more than five free passes per nine), but the stuff is good and he's one decent stretch of strike-throwing away from joining Miami's rotation.\n\n                            \n    \n                                                \n                    \n    4. Andrew Painter, RHP, PhilliesThe quick hook: The waiting is the hardest partMLB ETA: Spring 2026Painter has been in line to debut since 2023, when he injured his elbow and subsequently required two full seasons to recover. He seemed certain to get over the line last year, only to stumble his way to a 5.40 ERA and a 2.41 strikeout-to-walk ratio in 22 Triple-A starts. Painter remains a compelling pitching prospect thanks to his (unusually steep) release point, arm strength, and arsenal depth. His fastball clocked in at 96 mph in Triple-A and he complemented it with a curveball, a changeup, a sweeper, and a slider that he shows exceptional feel for locating within the zone. It's fair to have reservations after a challenging season, but there's still plenty of reason to believe in him becoming a quality starter.\n                            \n    \n                                                \n                    \n    5. Eli Willits, SS, NationalsThe quick hook: Well-rounded shortstop with youth, bloodlinesMLB ETA: Summer 2029The No. 1 pick in last year's draft, Willits possesses four above-average tools -- or, everything except power. He's a switch-hitter with a good feel for contact and the zone alike, and his combination of quickness and headiness should play up on the basepaths and at shortstop. He hit .300/.397/.360 in a 15-game sample against Carolina League competition that was on average three years his senior. Willits, whose father was a big-league outfielder, is accustomed to being the youngest player on the field seeing as how he only turned 18 in December. Such polish at this age bodes well for his long-term prospects.\n                            \n    \n                                                \n                    \n    6. Jonah Tong, RHP, MetsThe quick hook: Funky righty with sterling track recordMLB ETA: Already debutedTong is an undersized right-hander who effectively jumped from Double-A to the majors late last season. He didn't fare so well in a five-start sample, surrendering 20 runs in 18 innings as the Mets collapsed. Tong should be back and better in 2026 thanks to his unusual mechanics and two quality pitches. He manipulates his body to achieve a steep arm slot and release point, and in turn he throws a mid-90s fastball with plenty of ride and more cut than expected. Tong's go-to secondary offering these days is a changeup but he also throws a slider and a curve that features 16 inches of drop. He's so unlike most pitchers that it's only fair to have some reservations about the profile. Even so, it seems clear that Tong is going to be a big-league contributor.\n\n                            \n    \n                                                \n                    \n    7. Justin Crawford, OF, PhilliesThe quick hook: Speedy outfielder with throwback batMLB ETA: Spring 2026Crawford spent the entire season in Triple-A, hitting .334/.411/.452 with seven home runs and 46 stolen bases. He possesses raw power, but his game is built around hitting the ball the other way, often on the ground -- to the extent that his average launch angle was 0.6 degrees. Only three MLB players (min. 100 PA) finished below 1 degree: Chandler Simpson, Jake Mangum, and Brandon Lockridge -- none of whom were above-average hitters and two of whom finished below a 90 OPS+. To Crawford's credit, he does leverage his speed by dropping down bunts and causing chaos on the basepaths. There will be many occasions where he creates a run using his legs. You can argue about whether or not that's the optimal version of him. It may not matter. Crawford should break camp with the Phillies.\n                            \n    \n                                                \n                    \n    8. Carson Benge, OF, MetsThe quick hook: Garden variety right-handerMLB ETA: Spring 2026Benge, a two-way player at Oklahoma State, has made a quick ascent since being drafted 19th overall in 2024. He split last season across three levels, batting .281/.385/.472 with 15 home runs and 22 stolen bases. Benge has shown real promise at the plate, particularly against right-handed pitching, by showing a good feel for contact and the strike zone. He has above-average juice as well, though a lot of his most authoritative contact is low flying in nature. The Mets have openly discussed letting Benge compete for the starting center field job next spring. If he wins it, he probably won't give it back.\n                            \n    \n                                                \n                    \n    9. Harry Ford, C, NationalsThe quick hook: Second-division catcher in a new homeMLB ETA: Already debutedThe Nationals landed Ford from the Mariners early in the offseason in exchange for reliever Jose A. Ferrer. That should prove to be a nifty piece of business. He spent most of last year in Triple-A, hitting. 283/.408/.460 with 16 home runs and seven stolen bases. Ford isn't going to be as productive in the majors, but the shape of that statline is true to his game: he employs a very patient approach at the plate while possessing enough raw juice to keep pitchers honest. Defensively, he's improved to the point where there's no longer any question about him catching for the long haul. Ford figures to serve as the Nationals' most-days backstop beginning this spring.\n\n                            \n    \n                                                \n                    \n    10. Aiva Arquette, SS, MarlinsThe quick hook: Left-side infielder with powerful righty strokeMLB ETA: Summer 2027Arquette was the first collegiate hitter off the board last summer, going to Miami at No. 7 in what was considered to be a weak class for the group. There's no denying his impressive raw strength, but scouts have had reservations about other aspects of his game -- like his swing and miss tendencies and his future defensive home. Arquette passes the eye test at shortstop, yet his 6-foot-5 listing is unusually tall for the position. If he can stick there, he'll buy more margin for error for his hit tool.\n                            \n    \n                                                \n                    \n    11. Robby Snelling, LHP, MarlinsThe quick hook: Big league-ready leftyMLB ETA: Spring 2026Snelling, part of the return that landed the Padres Tanner Scott at the 2024 trade deadline, could've debuted last season without any fuss. Instead, he finished the year with an 11-start stretch in Triple-A that saw him compile a 1.27 ERA and a 4.76 strikeout-to-walk ratio. Snelling boasts a four-pitch arsenal led by a mid-90s fastball that found the zone 60% of the time in Triple-A despite featuring more rise than you would expect from his sub-6 foot release height. He also throws a changeup, a gyro slider, and a curveball that generated 41% whiffs in Triple-A. The total package here should allow him a lengthy career as a mid-rotation starter.\n                            \n    \n                                                \n                    \n    12. Cam Caminiti, LHP, BravesThe quick hook: Athletic lefty with deception MLB ETA: Summer 2028The Braves popped Caminiti with their first pick in 2024 on the strength of his athleticism and budding arsenal. His deception might end up being an X-factor. Caminiti creates tough angles, especially on left-handed batters, thanks to a flat plane and a crossfire delivery that sees him loosen the ball from well off the first-base side of the rubber. He's not just throwing junk out there either. Caminiti has a low-to-mid-90s fastball and a promising sweeper. Scouts have long predicted that Caminiti will add a gyro slider to his mix at some point. Time is working in his favor: he only turned 19 in August, giving him plenty of daylight between now and his eventual arrival. \n\n                            \n    \n                                                \n                    \n    13. JR Ritchie, RHP, BravesThe quick hook: Former first-round pick with broad arsenalMLB ETA: Spring 2026Ritchie was limited to 20 starts over his first three professional seasons on account of Tommy John surgery. He more than doubled his career total last year, spinning a 2.64 ERA and a 2.59 strikeout-to-walk ratio in 26 starts spread across three levels. Ritchie has a broad arsenal that gives him plenty of ways to attack the opposition: two low-90s fastballs, two breaking balls, a cutter, and what looks like a kick-changeup. Provided Ritchie's control continues to bounce back the further he gets from his surgery, he ought to settle into the middle of Atlanta's rotation. \n                            \n    \n                                                \n                    \n    14. Jett Williams, CF/SS/2B, MetsThe quick hook: Undersized speedster with popMLB ETA: Summer 2026Williams will test your preconceived notions. He's a 5-foot-7 speedster who has experience at all three up-the-middle positions. Yet his offensive game isn't built on a strong foundation of bat-to-ball skills. Rather, he's all about the slug. Williams lifts and pulls the ball at high frequencies, allowing him to get the most from pedestrian strength markers. The downside here is that Williams swings and misses a lot (he had a 73.5% contact rate in Triple-A), meaning he's likely to strike out around a quarter of the time in the majors. He should provide enough of everything else -- power, walks, defense, and baserunning -- to enjoy a big-league career. It just won't be the one you'd expect at first blush.\n                            \n    \n                                                \n                    \n    15. Owen Caissie, OF, MarlinsThe quick hook: Boom-or-bust outfielderMLB ETA: Already debutedCaissie has been a fixture on prospecting radars since he was drafted in 2020. He's since been moved in deals involving Yu Darvish and Edward Cabrera, all without getting an extended look at the big-league level. That ought to change soon. He has a real chance of becoming a valued contributor, too, thanks to his innate strength (he recorded an exit velocity over 114 mph in the big leagues) and plate discipline -- that despite an unusually upright swing. Caissie does swing and miss a lot, however, running a nearly 40% whiff rate on non-fastballs. He's not a great defender or runner, so it's on his bat to make him playable. The Marlins have every reason to find out if he can it work.\n\n                            \n    \n                                                \n                    \n    16. Gage Wood, RHP, PhilliesThe quick hook: Impressive right-hander with durability concernsMLB ETA: Late summer 2026Wood may have lasted until the 26th pick, but he was clearly one of the most talented pitchers in the class (as evidenced by his 19-K no-hitter against Murray State in the Men's College World Series). He sits in the mid 90s with his heater, which plays up thanks to the interplay between its rising action and the flat plane he generates by getting far down the mound. Wood has multiple quality breaking balls, including a curveball he throws hard with ample depth and an even harder slider, and he's thrown strikes when he's been able to perform. The last part is key because he tallied just over 100 innings across three collegiate seasons, and fewer than 40 in 2025 on account of a shoulder impingement. The Phillies have reason to move him quickly with his body determining his ultimate role.\n                            \n    \n                                                \n                    \n    17. Jarlin Susana, RHP, NationalsThe quick hook: Arm strength for days, healthy for hoursMLB ETA: Late summer 2026Susana has been a fixture on these lists since being part of the trade that sent Juan Soto to San Diego. The book on his game hasn't changed a ton. He remains a physical right-hander who regularly pumps 100-plus mph fastballs and chucks nasty sliders as part of a power arsenal. The drawbacks here have to do with his durability and his command. Susana was limited to 56 innings in 2025 because of various arm woes -- perhaps not the biggest surprise given his extreme velocity -- and he averaged more than five walks per nine innings for the second time in three years. Taken together, those negatives would seem to point to a future in relief. Susana will try to avoid that fate in 2026.\n                            \n    \n                                                \n                    \n    18. Joe Mack, C, MarlinsThe quick hook: Legit catcher with powerMLB ETA: Summer 2026The odds were stacked against Mack working out. Not only was he a prep catcher chosen in the first round, but he hailed from a cold-weather state. Generally, that's a bad combination. Yet here he is, on the cusp of making it to The Show with his prospect standing intact. Mack has two major traits on his side: he's capable of launching 20-plus home runs per season thanks to a lift-and-pull happy approach; and he's an above-average defender who can really frame and chuck the ball. Those skills can (and must) atone for his extreme swing-and-miss tendencies. Mack had a 32.4% whiff rate in Triple-A and was particularly susceptible to pitches down. He's going to strike out a lot against MLB pitching, limiting his overall upside in the process. \n\n                            \n    \n                                                \n                    \n    19. Jacob Reimer, 3B/1B, MetsThe quick hook: Corner player with a near-ready batMLB ETA: Late summer 2026Reimer split the season between High- and Double-A, batting .282/.379/.491 with 17 home runs. He became a popular ask in trade talks thanks to his disciplined approach and legit thump. Reimer's contact rate did crater with his promotion, dropping from 78.7% to 72.5%, and that'll be worth monitoring heading forward. Ditto for his defensive position. There's a fair chance Reimer ends up playing a different corner over the coming years, putting more pressure on his bat playing to its full potential. \n                            \n    \n                                                \n                    \n    20. Didier Fuentes, RHP, BravesThe quick hook: Little righty, big fastballMLB ETA: Already debutedThe Braves, as part of their attempts to salvage a lost season, gave Fuentes a series of starts right after his 20th birthday. The results weren't good -- he allowed 20 runs in 13 innings -- and he later missed time with a shoulder injury, but it shouldn't be long before he's back in the fold. Fuentes is a short, hard-throwing righty (his fastball clocked in at 96 mph in the majors) who really gets down the mound, creating an incredibly flat plane. Indeed, his vertical approach angle on heaters would've ranked behind only Bryan Woo and Logan Webb among MLB qualifiers. The rest of Fuentes' arsenal isn't as good or well-defined. He's not an extreme benefactor of seam-shifted effects, like the aforementioned Woo and Webb, and he doesn't throw either of his breaking balls as hard as they do despite his demonstrable arm strength. He's a work in progress, then, but his fastball quality and control ensure some kind of big-league future.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking the top 20 prospects in the NL East ahead of the 2026 MLB season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/29/686e9f31-01e8-48b6-9b64-bab374580fe3/thumbnail/1200x675/a0ab14bedb8ec0ff40c1e08f0039346e/mclean-getty.png"
      ],
      "datePublished": "2026-01-19T15:30:19.000Z",
      "dateModified": "2026-01-19T15:30:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami vs. Indiana expert picks: CFP National Championship predictions and odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-indiana-expert-picks-predictions-odds-cfp-national-championship/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/6513e02a-968d-457b-a183-6859da1add4a/thumbnail/1200x675/1beb8e975e5680f8b418c7781877989d/hoosiers-tunnel-1.jpg",
    "tag": "Sports",
    "date": "2026-01-19T15:45:37.000Z",
    "description": "\nMonday night's College Football Playoff National Championship Game at Hard Rock Stadium between No. 1 Indiana and No. 10 Miami shapes up as a gruelin",
    "body": "\nMonday night's College Football Playoff National Championship Game at Hard Rock Stadium between No. 1 Indiana and No. 10 Miami shapes up as a grueling, physical battle between two teams that have embraced that identity the entire season. The unbeaten Hoosiers are trying to become college football's first 16-0 national champion, but they must get past a resurgent Hurricanes team playing on its home field.Miami's path has been anything but easy. The Hurricanes knocked off No. 7 Texas A&M on the road, eliminated No. 2 Ohio State in the Cotton Bowl and outlasted No. 6 Ole Miss in the Fiesta Bowl to reach the title game. Powered by a massive offensive line, Miami has created running lanes for Mark Fletcher Jr. while quarterback Carson Beck distributes the ball to elite playmakers such as Malachi Toney, giving the Hurricanes a balanced, efficient attack.First-year defensive coordinator Corey Heatherman has elevated Miami's defense into one of the nation's best, bringing to life fourth-year coach Mario Cristobal's vision of a big, punishing roster. Still, the question remains whether that physicality is enough to test Indiana.The Hoosiers have overwhelmed everyone in their path, blasting No. 9 Alabama 38-3 in the Rose Bowl and dismantling No. 5 Oregon 56-22 in the Peach Bowl. With Heisman Trophy-winning quarterback Fernando Mendoza at the controls and no obvious weaknesses on the roster, Indiana enters as a more-than-touchdown favorite.Second-year coach Curt Cignetti has orchestrated one of the most remarkable turnarounds in college football history, putting Indiana on the brink of its first national championship.\nKeys to victory in CFP National Championship: How Indiana can win | How Miami can winWhere to watch Miami vs. IndianaDate: Monday, Jan. 19 | Time: 7:30 p.m. ETLocation: Hard Rock Stadium -- Miami Gardens, FloridaTV: ESPN | Live stream: Fubo (Try for free)Miami vs. Indiana picks for CFP National Championship \t \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            IND -8.5\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    Tom Fornelli: At what point does everybody start listening to what Indiana's been telling them all season? It has blown out Alabama and Oregon in consecutive playoff games and comes into the championship in much better shape than the Miami Hurricanes do health-wise. I don't expect we see a blowout along the lines of what the Rose and Peach Bowls provided, but I do expect the outcome will be clear before the fourth quarter starts. Pick: Indiana - 8.5 | Indiana 31, Miami 13Chip Patterson: I do think that Miami has the defense to be able to limit what Fernando Mendoza can do pushing the ball deep down the field and also a better rushing attack than Ohio State, which should help no bungling red zone opportunities like the Buckeyes did in the Big Ten title game. The Hoosiers' efficiency and effectiveness should keep them in control most of the game, but the playmaking potential should give Miami enough splash plays to keep it interesting. As long as Miami executes on its scoring chances, it will have a chance to win, but I've got Indiana (best TD% red zone defense in the country) winning those key plays to emerge as 16-0 national champions. Pick: Indiana -8.5 | Indiana 30, Miami 20Brandon Marcello: Miami is still the most physical, violent team remaining in the playoff. Indiana has been unbreakable all season, even in a pair of close calls against Penn State and Iowa, but this Hurricanes team is relentless along the offensive and defensive lines. The problem for Miami is that it still doesn't quite trust quarterback Carson Beck to throw deep, leading to more underneath throws. Even against Ole Miss, drives stalled in the second half when the Hurricanes pulled away from running the ball with Mark Fletcher Jr. Indiana's offense gets a lot of attention with Heisman winner Fernando Mendoza, but it's the defense that has won games. I trust both quarterbacks in 2-minute situations, but Mendoza protects the ball and Beck is a bit more unpredictable. This will be a slugfest at times, but Indiana will pull away to make this the eighth straight title game with the champion winning by double digits. Pick: Indiana -8.5 | Indiana 31, Miami 21John Talty: Indiana has been the best team all season long. They are elite offensively and defensively. They have America's best coaching staff. They have my favorite curmudgeon in the sport. I've been riding with the Hoosiers since the spring, and I'm not stopping now. What once felt unbelievable will become reality: Indiana as national champions. Pick: Indiana -8.5 | Indiana 34, Miami 20Shehan Jeyarajah: Indiana has been a perfect football team in 2025, and it will ultimately end with an elusive first national championship. It won't come easy. Miami's top-rated defensive line will force mistakes, including at least one turnover from Heisman winner Fernando Mendoza. However, Mendoza's legend will be cemented with a fourth-quarter touchdown to ice the game and deliver the Hoosiers an unlikely title. Pick: Indiana - 8.5 | Indiana 27, Miami 17David Cobb: Miami's offensive line is sturdy enough to prevent Indiana's defensive front from completely taking over, a necessity if the Hurricanes hope to stay within striking distance. On the other side, Miami has enough punch up front -- led by Rueben Bain Jr. and Akeem Mesidor -- to make the Hoosiers uncomfortable at times. Ultimately, Indiana looks like a team of destiny and should win outright. But Miami is capable of turning this into a fight. Pick: Miami +8.5 | Indiana 27, Miami 20Richard Johnson: Indiana will get the job done largely on the strength of their defense. With all the post-snap movement and zone drops that Indiana incorporates to their defense, my expectation is that eventually Carson Beck will get fooled and give the Hoosiers a couple interceptions. It's all they'll need to outlast Miami and tip the scales in their favor with the extra possessions. It's also the path that could see the game get truly out of hand. Pick: Indiana -8.5 | Indiana 34, Miami 17Chris Hummer: Miami is playing a national championship game at home. What a story. What an opportunity. What a moment. The Hurricanes can't lose it, right? Well ... here comes Indiana. It feels ridiculous to type that with a 15-0 Indiana. It's Indiana! History tells us this isn't possible, but Curt Cignetti has created a monster in Bloomington. They're the most well-coached, most disciplined and best team in the country. Plus, they have a Heisman Trophy-winning QB and, if you talk to coaches around the sport, have a roster that athletically matches up with anyone. As crazy as it feels to write, I'm picking Indiana to win a national championship. How could I not? Maybe Miami finds a bit more magic at home. But this has been the season of Indiana. As long as Indiana's o-line can hold up on the edges, it wins this game. Pick: Miami +8.5 | Indiana 24, Miami 21Who will win and cover in Indiana vs. Miami? SportsLine's computer model just simulated the College Football Playoff National Championship Game 10,000 times and projects that one side will cover well over 50% of the time. Visit SportsLine to find out who it is.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami vs. Indiana expert picks: CFP National Championship predictions and odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/6513e02a-968d-457b-a183-6859da1add4a/thumbnail/1200x675/1beb8e975e5680f8b418c7781877989d/hoosiers-tunnel-1.jpg"
      ],
      "datePublished": "2026-01-19T15:45:37.000Z",
      "dateModified": "2026-01-19T15:45:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rams' Sean McVay critical of his own 'bad coaching' in playoff win over Bears - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-sean-mcvay-bad-coaching-bears-nfl-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/f9d2f25f-d58a-4092-bf3b-ed405ee55ce7/thumbnail/1200x675/4b1bdb1b9f5c90ca6ba7a1fad650d705/mcvay.png",
    "tag": "Sports",
    "date": "2026-01-19T14:16:47.000Z",
    "description": "\n        Los Angeles Rams quarterback Matthew Stafford shook his head in disbelief on the sideline after an ill-fated third down decision led to an ov",
    "body": "\n        Los Angeles Rams quarterback Matthew Stafford shook his head in disbelief on the sideline after an ill-fated third down decision led to an overtime punt with his team's season hanging in the balance during Sunday night's NFC divisional round playoff game against the Chicago Bears.The MVP candidate got another opportunity, however, connecting on several clutch throws on the Rams' next possession that led to a game-winning field goal in a 20-17 final to clinch a spot in the NFC Championship against the Seattle Seahawks.After the win, Rams coach Sean McVay was critical of his own play-calling and grateful it didn't prove costly. \"We start off, you feel like you're getting a little bit of momentum,\" McVay said. \"I make a terrible third-down-and-1 call. No excuse for that. Should've used the timeout. They did a good job of having a good call on there and we had to punt it out.\"\nThe Rams' three-and-out on their first possession of the extra session came after a misdirection pitch to Blake Corum lost two yards at their own 35-yard line. It was the third straight overtime run play for Los Angeles, whose quarterback, Stafford, led the NFL in passing yards and touchdowns this season.\"I felt like when we had possessed the ball first, I thought that possession was really going to cost us,\" McVay said. \"There's no excuse for that. I have to be better for our group, I will be better for our group.\"\n        \n            \n                NFL conference title game lookahead: Odds, matchup breakdowns, TV times, early picks for AFC, NFC winners\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nThe Rams recovered after swiping their third interception of Caleb Williams on Chicago's ensuing possession. Los Angeles stopped the Bears three times on fourth down during the contest and overcame Williams' heroics in the final minute of the fourth quarter after he found Cole Kmet on a 14-yard touchdown pass to tie the game.\n\"I did not like the feel for the flow of the game outside of the first series where our guys did a great job,\" McVay said. \"Defensively, it kept us in it in spite of how poor of a job I did for our group. But like I said, I'm really grateful for this group being able to find a way, stick with it and be able to overcome some bad coaching by me tonight.\"Chicago stifled one of the league's highest-powered offenses throughout, but Stafford was confident he could lead the Rams on a game-winning drive following Kam Curl's diving interception in overtime.Stafford finished 20 of 42 for 258 yards, including three completions to move the chains on the final drive to Colby Parkinson, Davante Adams and Puka Nacua. The 16-yard toss to Nacua came on third-and-6 against pressure and put Los Angeles at the Bears' 27-yard line, setting up the winning kick -- a 42-yard strike by Harrison Mevis.\n\"I looked right at Sean, he looked at me … and was like here we go,\" Stafford said before the Rams' last possession. \"That's what it's all about. What an unbelievable job by our defense today getting us the ball over and over again. Whether it be fourth-down stops or turnovers, they were clutch and timely. That's what it takes to win in the playoffs.\"Sometimes offense is gonna go out and have a great day and find a way to win it, and sometimes defense is going to have a day like they did today and keep us in it for as long as they did and then make the play to get us the ball back. It's a team effort. We've got a resilient group. Love being part of it. Obviously, things we can do better, but we found a way to win the football game and in January and February that's what matters.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rams' Sean McVay critical of his own 'bad coaching' in playoff win over Bears - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/f9d2f25f-d58a-4092-bf3b-ed405ee55ce7/thumbnail/1200x675/4b1bdb1b9f5c90ca6ba7a1fad650d705/mcvay.png"
      ],
      "datePublished": "2026-01-19T14:16:47.000Z",
      "dateModified": "2026-01-19T14:16:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana vs. Miami prediction, odds, kickoff time: 2026 CFP national championship game picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-miami-prediction-odds-betting-line-spread-time-2026-college-football-playoff-national-championship-game-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/b3de07c2-e4b0-42cf-a247-dc6eece76b02/thumbnail/1200x675/daca2858bcc2532630dd27310e9c03b3/fernando-mendoza-indiana-hoosiers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-19T13:55:10.000Z",
    "description": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes i",
    "body": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes in the 2026 College Football Playoff National Championship Game on Monday. Miami (13-2) upset Texas A&M and Ohio State in the first two rounds and then won and covered (-3.5) against Ole Miss in the semifinals. Indiana (15-0) has breezed through its CFP schedule after enjoying a first-round bye, beating Alabama 38-3 in the quarterfinals and dominating Oregon 56-22 in the semifinals. Kickoff is at 7:30 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., which is the Hurricanes' home venue. The Hoosiers are 8.5-point favorites in the latest Miami vs. Indiana odds, as the line has held steady since opening. The over/under for total points scored is 47.5 via DraftKings Sportsbook. Before making any Indiana vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. \nNow, the model has set its sights on Miami vs. Indiana. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Indiana vs. Miami:Miami vs. Indiana                                                                                                                                                                                         spreadIndiana -8.5 (-107) at DraftKings SportsbookMiami vs. Indiana                                                                                                                                                                                     over/under47.5 pointsMiami vs. Indiana                                                                                                                                                                                                                                                                                                     money line Indiana -340, Miami +270Miami vs. Indiana                                                                                                                                                                                                                                                                                             picksSee picks at SportsLineMiami vs. Indiana                                                                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Indiana can coverJunior quarterback and Heisman Trophy winner Fernando Mendoza helps power the Hoosiers' offense. In 15 games, he has completed 73% of his passes for 3,349 yards and 41 touchdowns with just six interceptions. He also has rushed 83 times for 284 yards and six scores. In the national semifinal win over the Oregon Ducks, he completed 17 of 20 passes for 177 yards and five touchdowns. Mendoza's elite accuracy makes Indiana's offense extremely tough to stop, but the Hoosiers are also incredibly strong on defense. Indiana finished the regular season ranked fourth nationally in total defense. Indiana has been just has stingy in the postseason, holding Ohio State, Alabama and Oregon to an average of just 11.6 points per game.  See which team to back at SportsLine.\nWhy Miami can cover Senior quarterback Carson Beck helps guide the Hurricanes. In 15 games, he has completed 73.3% of his passes for 3,581 yards and 29 touchdowns with 11 interceptions. He has also rushed for a pair of touchdowns. In the national semifinal win over Ole Miss, he completed 23 of 37 passes for 268 yards and two touchdowns with one interception.The Miami ground attack is led by junior running back Mark Fletcher Jr. In 13 games this season, he has carried 199 times for 1,080 yards (5.4 average) and 10 touchdowns. He also has caught 16 passes for 132 yards (8.3 average) and two touchdowns. In the win over Ole Miss, he rushed 22 times for 133 yards, including a long of 19. See which team to back at SportsLine.How to make Indiana vs. Miami picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.So who wins Indiana vs. Miami, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Miami vs. Indiana spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana vs. Miami prediction, odds, kickoff time: 2026 CFP national championship game picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/b3de07c2-e4b0-42cf-a247-dc6eece76b02/thumbnail/1200x675/daca2858bcc2532630dd27310e9c03b3/fernando-mendoza-indiana-hoosiers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-19T13:55:10.000Z",
      "dateModified": "2026-01-19T13:55:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills fire Sean McDermott: Buffalo moves on from longtime coach after latest playoff exit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-fire-sean-mcdermott-buffalo-coach-nfl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/2fd422cb-b295-4890-b0de-eb6e1376c525/thumbnail/1200x675/7121bdf7b52df2bb41e95b4d77e87df7/sean-mcdermott-getty.png",
    "tag": "Sports",
    "date": "2026-01-19T15:49:31.000Z",
    "description": "\n        The Buffalo Bills have fired coach Sean McDermott following the team's AFC divisional round playoff loss to the Denver Broncos. Brandon Beane",
    "body": "\n        The Buffalo Bills have fired coach Sean McDermott following the team's AFC divisional round playoff loss to the Denver Broncos. Brandon Beane is being retained with the title of president of football operations/general manager and will help lead the search for Buffalo's next coach. \"Sean has done an [admirable] job of leading our football team the past nine seasons,\" Bills owner Terry Pegula said in a statement. \"But I feel we are in a need of a new structure within our leadership to give this organization the best opportunity to take our team to the next level. We owe that to our players and to Bills Mafia.\" McDermott, 51, had a largely successful nine-year run with the Bills that included five consecutive AFC East division titles from 2020-24. However, Buffalo went just 8-8 in the playoffs under McDermott with repeated gut-wrenching losses, including Saturday's 33-30 defeat to the Broncos that included several self-inflicted wounds. While McDermott led the Bills to the franchise's first road playoff win in 33 years a week earlier against the Jacksonville Jaguars, he was unable to snap Buffalo's longtime stretch without a Super Bowl appearance, which dates back to the 1993 season. Buffalo has been unable to advance past the AFC Championship despite having one of the NFL's best players in quarterback Josh Allen, whose eight playoff wins without a Super Bowl start is an NFL record. With Allen at quarterback, the Bills lost once in the wild-card round, four times in the divisional round, and twice in the AFC Championship.\n\n        \n            \n                Buffalo's reckoning: Josh Allen's prime and a window that's shrinking\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nIn all, McDermott posted a 98-50 record with the Bills and made the postseason in eight of his nine seasons. McDermott's eight postseason wins are the most by any coach without a Super Bowl appearance. His 98 wins is the second-most in NFL history during a coach's first nine seasons. When McDermott arrived in 2017, the Bills had not been to the postseason since 1999.\"Sean helped change the mindset of this organization and was instrumental in the Bills becoming a perennial playoff team. I respect all the work, loyalty and attention to detail he showed for this team and community,\" Pegula said. Buffalo's 73-27 record since 2020 is the best in the NFL. This season, the Bills became the fifth team in NFL history with six straight 11-win seasons. They also became the first team in NFL history to lose a playoff game by three points or less in three straight seasons. \nThe Bills enter an offseason where they are slated to have just $3 million in projected cap space (which ranks 24th in the NFL) but will have at least one pick in each of the first five rounds of the upcoming NFL Draft. Receiver, defensive tackle and edge rusher are the Bills' biggest projected areas of need heading into the offseason. Buffalo also has several notable pending free agents, including pass rusher Joey Bosa, defensive lineman DaQuan Jones, center Connor McGovern and linebacker Matt Milano. McDermott is the latest in a string of high-profile coaching moves in the AFC. Mike Tomlin stepped down after 19 seasons leading the Pittsburgh Steelers and John Harbaugh was fired after 18 seasons with the Baltimore Ravens. Harbaugh has already landed with the New York Giants. \nWith the Giants and Atlanta Falcons jobs filled (Atlanta hired Kevin Stefanski Sunday), the Bills become the eighth NFL opening, joining the Arizona Cardinals, Ravens, Cleveland Browns, Las Vegas Raiders, Miami Dolphins, Steelers and Tennessee Titans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills fire Sean McDermott: Buffalo moves on from longtime coach after latest playoff exit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/2fd422cb-b295-4890-b0de-eb6e1376c525/thumbnail/1200x675/7121bdf7b52df2bb41e95b4d77e87df7/sean-mcdermott-getty.png"
      ],
      "datePublished": "2026-01-19T15:49:31.000Z",
      "dateModified": "2026-01-19T15:49:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wilbur Wood dies at 84: Knuckleballer was an All-Star workhorse for the White Sox - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/wilbur-wood-chicago-white-sox-legend-dies/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/20d2e1b1-6622-4458-89bc-da73ed86bb8a/thumbnail/1200x675/54e6f973edc9a94ddaf2df0d9c74a897/wood-getty.png",
    "tag": "Sports",
    "date": "2026-01-19T14:56:42.000Z",
    "description": "\nKnuckleballer and legendary Chicago White Sox lefty Wilbur Wood has died, the team announced late Sunday. He was 84. Wood played 17 seasons in the bi",
    "body": "\nKnuckleballer and legendary Chicago White Sox lefty Wilbur Wood has died, the team announced late Sunday. He was 84. Wood played 17 seasons in the big leagues from 1961-78, including the final 12 with the White Sox.The Cambridge, Massachusetts, native signed with his hometown Boston Red Sox in 1960 and made his MLB debut as a 19 year old the next season. Wood spent most of the 1961-66 seasons in the minors with the Red Sox and Pittsburgh Pirates, appearing in 73 MLB games (11 starts) with a 4.17 ERA those years.The Pirates traded Wood to the White Sox following the 1966 season, at which point he became a full-time knuckleballer and had his first taste of extended success in the show. Wood pitched to a 2.49 ERA from 1967-70 and led the majors in relief appearances every year from 1968-70. He received MVP votes in 1968.\"I was signed as a fastball/curveball pitcher and did very well with those in the minor leagues, but they  just weren't good enough for the majors. I'd be fine for three or four  innings, but after I went through the batting order once I'd start to  get hit,\" Wood told Sports Illustrated in 2019. \"I just decided to junk my curve and everything else and go 100%  with the knuckleball.\"An injury opened a rotation spot for Wood in 1971. That was the start of a five-year stretch in which he won 20 games four times, led the majors in starts four times, and posted a 3.08 ERA in 1,681 ⅔ innings. Three times Wood placed in the top five of the Cy Young voting those years, including finishing second to Gaylord Perry in 1972.Because he was a rubber-armed knuckleballer, Wood made the majority of his starts on two or three days' rest from 1971-75. He led baseball with 224 starts those five years, 23 more than any other pitcher, and those 1,681 ⅔ innings were 87 more than anyone else. Only Tom Seaver was ahead of Wood in WAR.\"People  said I didn't get sore because all I threw was the knuckleball, but  that's not true. I'd get stiff and sore, and in those days pitchers  never used ice,\" Wood told SI. \"I didn't get as sore as if I was throwing, say, a slider, because I wasn't putting the pressure on my elbow and shoulder, but I did get sore.\"A line drive broke Wood's kneecap on May 9, 1976, ending his season. He struggled when he returned the following year, and posted a 5.11 ERA in 290 ⅔ innings from 1977-78. He retired after the 1978 season at age 37. \"I just couldn't do what I could do before I got hurt. That took the fun out of it,\" he explained.Wood retired with a 164-156 record and a 3.24 ERA in 2,684 innings. He was a three-time All-Star (1971-72, 1974) and he still ranks among the White Sox franchise leaders in wins, innings, games pitched, strikeouts, and many other categories. Wood received Hall of Fame votes every year from 1984-89 before falling off the ballot.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wilbur Wood dies at 84: Knuckleballer was an All-Star workhorse for the White Sox - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/20d2e1b1-6622-4458-89bc-da73ed86bb8a/thumbnail/1200x675/54e6f973edc9a94ddaf2df0d9c74a897/wood-getty.png"
      ],
      "datePublished": "2026-01-19T14:56:42.000Z",
      "dateModified": "2026-01-19T14:56:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bears down: Chicago's magic runs out, but should be bullish on Caleb Williams - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/whats-next-for-bears-nfl-playoffs-offseason-caleb-williams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/6f74bf11-ca2f-4c3b-beb1-a1d10f3c24c6/thumbnail/1200x675/16aff48b68625cb3387290bb5cb15044/gettyimages-2255623925.jpg",
    "tag": "Sports",
    "date": "2026-01-19T14:28:39.000Z",
    "description": "\n        The Chicago Bears' exhilarating rollercoaster ride of a 2025 season came to a screeching halt in their 20-17 overtime defeat in the NFC divis",
    "body": "\n        The Chicago Bears' exhilarating rollercoaster ride of a 2025 season came to a screeching halt in their 20-17 overtime defeat in the NFC divisional round against the Los Angeles Rams. Chicago roared back to their first NFC North division title since 2018 and their first playoff win since the 2010 season in Year 1 of head coach Ben Johnson's and 2024 first overall pick quarterback Caleb Williams' partnership. The cherry on top of the season for the Bears was winning their last two matchups against the hated Green Bay Packers with two furious comebacks, including a 31-27 wild card round victory that involved the biggest playoff rally in franchise history. They erased a 21-3 halftime deficit in that frantic finish. Williams' last two throws of the Bears' final two drives of the season were a microcosm of a streaky Chicago squad. The Bears lost their first two games of the season, but then they followed that up with victories in 11 of their next 13 games before losing their final two regular season games to finish 11-6 in the regular season. \n        \n            \n                Texans' C.J. Stroud may have cost himself millions with 4 INTs; Head-scratching game for Sean McVay\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nWilliams heaved a game-tying, 14-yard touchdown pass on fourth-and-4 with 18 seconds remaining to tight end Cole Kmet while fading away over multiple Rams defenders that was one of the most clutch, breathtaking throws in recent NFL playoff memory. After he scrambled backward, Williams' throw soared 51.2 yards in the air, the most on a red zone passing touchdown in 10 seasons, per CBS Sports Research. That touchdown pass ended up being thrown 26.5 yards behind the line of scrimmage, the most on any completion in the past 10 seasons, according to CBS Sports Research. \nFor as amazing as Williams' game-extending touchdown throw was, his pass that ended what became the Bears' final possession of 2025 was equally as horrendous. He sailed a throw over a seemingly open Luther Burden III, and he miscommunicated with a crossing DJ Moore for an interception to Rams safety Kamren Curl when Chicago just needed a field goal to secure an overtime win after Los Angeles' punt. \nFunny enough, Williams had time in the pocket and set his feet before making that back-breaking throw. It's almost as if Williams having more time to process what he is seeing when he drops back to pass causes him to overcomplicate the easier throws. Williams' 14.6% off target throw rate was the highest in the NFL in 2025 among the league's 33 qualified quarterbacks. Minnesota Vikings quarterback J.J. McCarthy, who was last in the NFL in almost every key passing metric this season, was barely behind Williams with a 14.4% off target throw rate.   So what lies ahead for the Bears as they enter the 2026 offseason? Here are three key things Chicago will have to work through ahead of their 2026 season.  \nHow to maintain late-game magicNo team had a more clutch 2025 season than the Bears. Their seven wins when trailing in the final two minutes of the fourth quarter, including the playoffs, is an NFL record. Some of that likely had to do with Chicago getting accustomed to the high-wire act of winning close games with an NFL-most eight wins by fewer than seven points this season, including the playoffs. Johnson told reporters some of that comeback magic had to do with an exercise he did with his team back in training camp. He showed his squad the New England Patriots 34-28 overtime victory over the Atlanta Falcons in Super Bowl LI, a game in which the Patriots came back from a Super Bowl record, 25-point deficit (28-3). He had two players on the 2025 Bears who played in that game, one for each team. Left guard Joe Thuney was on the Patriots and defensive tackle Grady Jarrett was on the Falcons. Johnson said he used that example as a reminder to never give up, no matter what the score. He'll need to cook up another similar exercise to that in 2026 as well as spend plenty of time in prayer because regression to the mean comes almost every year for NFL teams that rely heavily on clutch, one-score wins. The 2024 Kansas City Chiefs were an NFL record 11-0 in one score games last season en route to a third consecutive Super Bowl trip. In 2025, the Chiefs' late-game success completely flipped as they lost 9 of their 10 one-score games this season. \nChicago will need to improve across the board in 2026 to avoid a similar letdown in the coming year. How to upgrade the roster with limited paths to do just thatHaving a starting quarterback on their rookie contract is typically viewed as the best bargain in the NFL because it frees up plenty of money to spend at other positions over the life of the rookie passer's first four seasons. Despite Williams entering just his third season in 2026, the Bears aren't in a position where they are flush with cap space to bolster the rest of their roster for the next two or three years. OverTheCap.com projects the Bears to have the 11th-fewest effective cap space, defined as the cap space a team will possess after signing at least 51 players and its projected rookie draft class, in the NFL entering the 2026 offseason at -$18.23 million. That's honestly remarkable considering Williams' contract status. The biggest area where the Bears need to improve is on defense. Chicago was the NFL's No. 9 scoring offense (25.9 points per game) while they were the league's No. 23 scoring defense (24.4 points per game allowed). Continuity typically helps, and they'll have Dennis Allen back as their defensive coordinator in 2026. \nHowever, the Bears don't have the money to maintain continuity in the secondary. Safety Kevin Byard, a 2025 first team All-Pro after leading the league with seven interceptions, is set to become a free agent as is fellow starting safety Jaquan Brisker, nickel C.J. Gardner-Johnson and outside cornerback Nahshon Wright, who led the NFL with eight takeaways (five interceptions and three fumble recoveries). The potential losses of both Byard and Wright, who combined to account for 15 of Chicago's league-leading 33 takeaways (45.4%), could certainly set the Bears' defense back. Cutting linebacker Tremaine Edmunds could save $15 million in cap space while netting the Bears just $2.4 million in dead money. With first-round rookie tight end Colston Loveland's emergence, releasing tight end Cole Kmet could save Chicago $8.4 million in cap room while costing just $3.2 million in dead money. However, with such a small difference, the team might just hang on to Kmet for one more year. General manager Ryan Poles will need to ace the 2026 NFL Draft, particularly on defense, if Chicago is to have any real chance of improving upon its 2025 performance in 2026. While it sounds crazy to say, the 2025 season may have been the Bears' best shot to make a Super Bowl run with Williams on his rookie contract. That's something Johnson can understand from his time as the Detroit Lions offensive coordinator from 2022 to 2024. Detroit won the NFC North in 2023 with a 12-5 record and reached the conference championship game. They lost 34-31 to the San Francisco 49ers in that game after leading 24-7 at halftime. They haven't won a playoff game since. Detroit won a franchise record 15 games in 2024, but they were upset in the divisional round by the No. 6 seed Washington Commanders in their first playoff game as the NFC's No. 1 seed. Johnson left for Chicago the following offseason, and Detroit missed the playoffs entirely in 2025. \n\"Sometimes you can only say so much,\" Lions head coach Dan Campbell told reporters after the Lions' 34-31 NFC championship game loss. \"[Sometimes] you gotta live it, unfortunately. You gotta get your heart ripped out, which we did. And it's a lesson learned. And look, I told those guys, 'This may have been our only shot.' Do I think that? No. Do I believe that? No. However, I know how hard it is to get here. I am well aware. It's gonna be twice as hard to get back to this point next year.\"  The 2025 season may have been the Bears' only shot to seriously contend on Williams' rookie deal. True Super Bowl contention will be more difficult to chase once Chicago has to pay Williams his market value by making him one of the NFL's highest-paid players in the coming years. If the Bears struggle to manage the salary cap with what Williams making now, it's hard to envision the cap management improving when their quarterback will account for a much higher percentage of the team's payroll. How to get more consistency in the accuracy department from Caleb WilliamsWilliams produced the NFL's fifth-best touchdown-to-interception ratio, 3.9 (27 passing touchdowns to 7 interceptions) in 2025, but he ranked just 22nd out of 33 qualified quarterbacks in passer rating (90.1). How is that possible? Williams was one of the least accurate passers in the league in 2025: his 58.1% completion percentage was the second-worst in the NFL behind only Minnesota Vikings quarterback J.J. McCarthy's 57.6% figure. Williams' 14.6% off target throw rate was the highest in the NFL in 2025 among the league's 33 qualified quarterbacks. McCarthy, who ranked dead last in the NFL in nearly every critical passing statistic in 2025, was barely ahead of Williams with a 14.4% off target throw rate. \nWhen asked what he needs to do to help carry momentum from the Bears' 2025 campaign into 2026, Williams knew exactly what the answer is: increase his accuracy. Being better at setting his feet for a more stable throwing platform, particularly from the pocket, in 2026 should help a lot as should spending even more time with his pass catchers. \"Work on accuracy, work on my feet in the offseason,\" Williams said postgame after the Bears' NFC divisional round defeat. \"It's get with the receivers and work with them and things like that throughout the offseason so that we're on the same page. [So] We're starting out hot for training camp, OTAs and then going into next season.\"If Williams can make very correctable footwork adjustments and build a better rapport with his receivers in Year 2 of operating Johnson's offense, the Bears could rise to being a top-five scoring offense in 2026. Time will tell if he'll have a defense that is able to complement his development. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bears down: Chicago's magic runs out, but should be bullish on Caleb Williams - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/6f74bf11-ca2f-4c3b-beb1-a1d10f3c24c6/thumbnail/1200x675/16aff48b68625cb3387290bb5cb15044/gettyimages-2255623925.jpg"
      ],
      "datePublished": "2026-01-19T14:28:39.000Z",
      "dateModified": "2026-01-19T14:28:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bo Nix injury mars thrilling NFL divisional round; CFP National Championship preview - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bo-nix-injury-nfl-divisional-round-college-football-playoff-national-championship-preview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/a5a09f94-3f6b-4c02-9c7b-b5da5667d4e6/thumbnail/1200x675/bc88aa68097fa8db300150b06a86e19c/gettyimages-2256823301-1.jpg",
    "tag": "Sports",
    "date": "2026-01-19T13:26:56.000Z",
    "description": "\n\n\n    \n                                    Plus all the details from Bo Bichette's signing with the Mets\n        \n                                   ",
    "body": "\n\n\n    \n                                    Plus all the details from Bo Bichette's signing with the Mets\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 19, 2026\n                            \n                    at\n    8:26 am ET\n                        \n                •\n            \n            8 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        This is an article version of the CBS Sports HQ AM Newsletter, the ultimate guide to every day in sports. You can sign up to get it in your inbox every weekday morning here. \nGood morning, sports fans! Carter Bahns with you on this holiday Monday. The leagues in action today will honor the legacy of Martin Luther King Jr. while delivering a full day of action as much of the country takes the day off from work. Everything culminates tonight in the College Football Playoff National Championship. Speaking of postseason football, we have heaps of NFL storylines to address after a divisional round that featured a little bit of everything, including two overtime thrillers. Let's get to it.  🩼 Five things to know Monday The NFL's conference championship games are set, and Bo Nix will watch from the sideline. The Broncos will play for the AFC Championship, but they'll do so without their starting quarterback in action. Nix fractured a bone in his ankle on the penultimate play of overtime in their divisional round win over the Bills and is scheduled to have surgery on Tuesday. Jarrett Stidham is in line to start just his fifth career game and make his first pass since the 2023 season when Denver hosts the Patriots, who defeated the Texans in a turnover frenzy. On the NFC side, the top-seeded Seahawks obliterated the 49ers to punch their ticket to the conference title game against the overtime-winning, drama-surviving Rams.Bo Bichette agreed to terms with the Mets. The dominoes continue to fall in free agency after Kyle Tucker signed with the Dodgers. Bichette immediately became the biggest target on the market, and it did not take long for the Mets to pivot onto the shortstop after missing out on Tucker. The parties agreed to a three-year contract worth $126 million which includes opt-outs after the first and second seasons, no deferrals and a full no-trade clause. This figures to be the first of multiple moves for New York, while the Blue Jays are next up after missing out on their top two targets. The Phillies also shifted their focus and re-signed J.T. Realmuto to a three-year deal.Kevin Stefanski will take over the Falcons, while Matt LaFleur remains with the Packers. Less than two weeks after his firing in Cleveland, Stefanski found a landing spot in Atlanta. The two-time AP Coach of the Year will be tasked with snapping the Falcons' eight-year playoff drought. LaFleur, meanwhile, agreed to a multi-year extension to remain in Green Bay, ending the uncertainty that swirled after his latest postseason hiccup, which dropped him to 3-6 in playoff games.The transfer portal closed, but not before Darian Mensah departed from Duke. The Blue Devils made Mensah one of the highest-paid players in college football last offseason, but he is out after just one year and is now the most highly sought-after player in the portal. Miami is aggressively shopping for a quarterback and is a team to watch in Mensah's recruitment, according to CBS Sports' Chris Hummer and Matt Zenitz. Mensah's last-minute portal entrance at the Friday deadline wrapped up the 2026 window.The Golden Knights traded for Rasmus Andersson. Perceived as the best defenseman available on the trade market, Andersson is headed to Las Vegas in return for a 2027 first-round pick, conditional 2027 second-round pick, defenseman Zach Whitecloud and defensive prospect Abram Wiebe. Barring a contract extension, Andersson is essentially a rental to fill the spot in the top four vacated by injured Alex Pietrangelo. The Flames agreed to retain 50% of his remaining contract. 🏆 Do not miss this: College football will crown a national champion tonight \n                                                                    Imagn Images\n                                                            Miami fans could be in for their best night in 25 years. While the Indiana faithful might enjoy the highlight of their entire fandoms. Either way, the winner of Monday's College Football Playoff National Championship will snap a lengthy title drought. And for those fortunate enough to secure historically expensive tickets, seeing their team hoist the trophy should be worth every penny. Here's what to expect in the championship game: \nExpert picks: The majority of our college football panel is riding with Indiana to not only win the national championship but to do so by a wide margin. See why Tom Fornelli, Chip Patterson and others foresee a blowout victory incoming for the Hoosiers.Tale of the tape: Two of the three most accurate quarterbacks in the nation go head-to-head in this matchup. A pair of outstanding defenses will duke it out. So who has the edge? We have the answer for every position.Keys to the game: Miami's biggest key to victory is that the pass rush has to be dominant. For the Hoosiers, protecting the ball is one of five necessities.What's at stake for Miami: National championship No. 6 is within reach for the Hurricanes. The 2025 squad can stake its claim as one of the greatest teams in program history if it wins one more game. Freshman sensation Malachi Toney can put a bow on a remarkable debut season, too, and set the stage for more title runs in the years to come.What's at stake for Indiana: Curt Cignetti is already a legend for turning a historically downtrodden program into a two-time playoff participant. Winning the national championship would make his efforts one of the greatest sports stories in American history. His quick turnaround of the Hoosiers is nearly unmatched by any team, collegiate or professional. 🏈 NFL divisional round fallout, conference championship lookahead \n                                                                    Getty Images\n                                                            Is the Super Bowl window closed for the Bills? That may be more reality than overreaction after their loss to the Broncos, wherein Josh Allen committed four turnovers. The window is wide open, though, for their AFC East rivals. The Patriots overcame three turnovers of their own to defeat the Texans, and with a Bo Nix-less Denver squad awaiting them in the conference championship game, everything is ahead of them. Looking ahead to next weekend … The Seahawks are a machine on an eight-game winning streak. They'll look to make it nine straight against their NFC West rival Rams, who survived an overtime scare and remain in search of another Super Bowl for potential MVP Matthew Stafford. On the other side of the bracket, the Patriots continue to beat good teams and squash the narrative about their favorable regular-season schedule. If they beat the Broncos, though, expect a few naysayers to discredit them for taking down a backup quarterback. As for the teams whose seasons came to an end … Are the 49ers' best days behind them? Kyle Shanahan has overseen a prolific run, but the blowout loss to Seattle indicates the title-chasing era in San Francisco may be winding down. That looks to be the case in Buffalo, too. Allen was in tears postgame after a heartbreaking overtime defeat, which halted his postseason run short of the Super Bowl for a seventh consecutive year. Young talent could keep the Bears and Texans in contention over the years to come, though. What Caleb Williams achieved on a miracle touchdown in Sunday's defeat alone is enough to spark optimism for 2026. \n 👍👎 The best (and not-so-best) of the rest \n                                                                    Getty Images\n                                                            The ink is dry as the Giants finalized a five-year deal with John Harbaugh after days of last-minute negotiations.College basketball is down to three undefeated teams -- No. 1 Arizona and No. 8 Nebraska and Miami (Ohio) -- after No. 2 Iowa State and No. 10 Vanderbilt both lost back-to-back games. Meanwhile, Kentucky is on a run of comeback victories and Virginia looks like the biggest threat to Duke in the ACC.On the women's side, there are three top-25 games on today's slate, and we picked the winner of each.The Knicks fell to 2-8 in their last 10 games, giving them the NBA's second-worst January record. Here's what that means for their championship outlook.DJ Lagway is set to make his transfer to Baylor official. The prized quarterback considered other schools despite committing to the Bears 10 days ago and is now set to sign with the Big 12 program.The Braves expect shortstop Ha-Seong Kim to miss four to five months after undergoing surgery to repair a torn tendon in his right middle finger. He could rejoin the lineup this summer.We have likely seen the last of Aaron Rodgers in a Steelers uniform, as he is not expected to return to Pittsburgh in the wake of Mike Tomlin's exit.College Football Playoff executives did not reach a decision on whether to expand the field after a lengthy meeting. Friday is the deadline to vote for expansion.Chris Gotterup won the first tournament of the PGA Tour season with a final-round 64 in the Sony Open.President Donald Trump said he plans to sign an executive order cementing an exclusive four-hour broadcast window for the Army-Navy football game. Other college football games would be prohibited from overlapping the rivalry matchup.Don't get your hopes up for Curt Cignetti to make a move to the NFL. The Indiana coach remains staunch in his commitment to college football.Crystal Palace captain Marc Guehi is finalizing a move to Manchester City.The NFL fined Texans linebacker Azeez Al-Shaair for wearing eye black that stated \"stop the genocide.\"As expected, Ole Miss quarterback Trinidad Chambliss filed a lawsuit against the NCAA in search of a sixth year of eligibility.The vibes at Real Madrid are off after fans whistled the team and specific players after their El Clásico defeat and cup losses.Air Force suspended basketball coach Joe Scott pending an investigation into the treatment of cadet-athletes.Clippers owner Steve Ballmer filed a motion to dismiss a fraud lawsuit tied to the Kawhi Leonard salary cap circumvention allegations.On WWE Smackdown, Cody Rhodes declared his entry for the Royal Rumble and booked a match with Jacob Fatu at Saturday Night's Main Event.Jai Opetaia, the IBF and The Ring cruiserweight champion, signed with Zuffa Boxing. 📺 What we're watching Monday 🏀 No. 10 TCU vs. No. 14 Ohio State (W), Noon on Fox 🏀 Bucks at Hawks, 1 p.m. on NBC Sports Network 🏒 Sabres at Hurricanes, 1:30 p.m. on TNT 🏀 Thunder at Cavaliers, 2:30 p.m. on NBC 🏀 No. 8 Michigan vs. No. 5 Vanderbilt (W), 2:30 p.m. on Fox ⚽ AFC Bournemouth at Brighton & Hove Albion, 3 p.m. on USA Network 🏒 Capitals at Avalanche, 4 p.m. on TNT 🏀 Mavericks at Knicks, 5 p.m. on NBC 🏀 No. 23 Notre Dame at No. 1 UConn (W), 5 p.m. on Fox 🏈 CFP National Championship: No. 1 Indiana vs. No. 10 Miami, 7:30 p.m. on ESPN 🏀 Celtics at Pistons, 8 p.m. on NBC 🎾 Australian Open, first round, 11:15 p.m. on ESPN2 \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bo Nix injury mars thrilling NFL divisional round; CFP National Championship preview - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/a5a09f94-3f6b-4c02-9c7b-b5da5667d4e6/thumbnail/1200x675/bc88aa68097fa8db300150b06a86e19c/gettyimages-2256823301-1.jpg"
      ],
      "datePublished": "2026-01-19T13:26:56.000Z",
      "dateModified": "2026-01-19T13:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff overreactions for divisional round: C.J. Stroud cost himself millions? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-playoffs-divisional-round-overreactions-c-j-stroud-cost-himself-millions-sean-mcvays-in-a-slump/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/01874a80-fb0d-47d2-98cd-7962d24f5d0a/thumbnail/1200x675/7ca3276ee44dd2345bac281ecfae2452/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-01-19T05:05:52.000Z",
    "description": "\n        The divisional round is in the books, and the NFL's final four is set. It'll be the Los Angeles Rams and Seattle Seahawks duking it out in th",
    "body": "\n        The divisional round is in the books, and the NFL's final four is set. It'll be the Los Angeles Rams and Seattle Seahawks duking it out in the NFC Championship, while the New England Patriots will visit the Denver Broncos next Sunday for the AFC Championship. These matchups crystallized after another bonkers weekend of NFL playoff action that saw multiple overtime games and high drama throughout. Naturally, when the games are of this magnitude, they leave a pretty big impression. For instance, C.J. Stroud throwing four interceptions in a playoff loss to the New England Patriots is going to be branded on his résumé more than had that happened in some random game over the regular season. The same can be said for Josh Allen, who has his reputation dinged after missing a golden opportunity for his first trip to the Super Bowl with Buffalo this postseason after falling to Denver.  Those are some storylines that are legitimate narratives now out in the ether.  Then, there are some storylines that don't really carry much weight and are overblown. Just as we did for Day 1 of the divisional round, we're going to dive into some of the big-picture talking points that are coming out of the final day of this round below. To read the overreactions from Day 1, you can check them out here. C.J. Stroud cost himself millionsOverreaction or reality: OverreactionIt was a downright terrible day for C.J. Stroud. The Houston Texans quarterback looked lost throughout his team's 28-16 loss to the New England Patriots, and tossed four interceptions in the losing effort. Stroud was erratic with the ball for the bulk of the game and completed just 45.4% of his passes and finished with a 28.0 passer rating. \nWhen you factor in his poor showing over Wild Card Weekend against Pittsburgh, Stroud became the first player in NFL playoff history with five-plus interceptions and five-plus fumbles in a postseason. Not great. This disastrous postseason comes at a bad time for Stroud, who is extension-eligible this offseason. The knee-jerk reaction to this performance would be that the Texans should not sign Stroud to an extension and/or not ink him to a deal that pays him around $55 million annually with the upper-echelon quarterbacks. That won't happen, however. In all likelihood, the Texans are going to sign Stroud to a lucrative extension this offseason that makes him one of the highest-paid quarterbacks in the league. Why? Because they have no other choice. It's either pay Stroud or reset at the position entirely. While he hasn't given them a ton of confidence that he'll live up to his eventual monster extension, they'll inevitably slide it across the table for him to sign. \nBears comeback magic won't carry over into 2026Overreaction or reality: RealityThe Chicago Bears had one last rabbit to pull out of their hat, with Caleb Williams throwing a jaw-dropping 14-yard touchdown to Cole Kmet on a fourth-and-4 attempt to help send their divisional round matchup with the Rams to overtime. While L.A. was able to edge out the win in overtime, it was a herculean effort from Williams to force the extra period. \nAs ridiculous as that throw was, it was something we've come to expect from Williams and the Bears this season. In all, the franchise had seven wins this season when down in the final two minutes of the fourth quarter, which is an NFL record (including playoffs). They also had an NFL-high eight wins by fewer than seven points this season (including playoffs). You can call it a clutch gene, or you can call it luck that the ball bounced their way that many times. The one thing that you can definitely call it, however, is unsustainable. Chicago can't expect this late-game magic to carry over into 2026 and will need to revamp the roster this offseason in order to pull out a win without needing to pull off miracles. \nUse the Kansas City Chiefs as a cautionary tale. They were 11-0 in one-score games during the 2024 regular season. The following year, in 2025, they were 1-9 in one-score games. Patriots can overcome Drake Maye's turnoversOverreaction or reality: Overreaction\nLost in C.J. Stroud's four-interception day was that Drake Maye was also a little too loose with the football, albeit in the winning effort.In the win over Houston, Maye had four fumbles (two lost) and an interception. In the prior round against the Chargers, Maye also had protection issues, fumbling twice (one lost) and another pick. So, over the course of two playoff games this postseason, Maye has six fumbles (three lost) and two interceptions. Part of those turnovers is due to some protection issues along the left side of the offensive line, and facing some top-tier pass rushers, but Maye's awareness in the pocket has been lacking as well. \nJust because the Patriots have overcome them to this point doesn't mean that'll continue as they push deeper into the playoffs. Most view New England as a heavy favorite over the Denver Broncos in the AFC Championship, particularly after Bo Nix's season-ending ankle injury, and backup Jarrett Stidham is now slated to start. One way to give Stidham and the Broncos life, however, is handing the ball over, so Maye will need to tighten it up if he wants to advance to and win the Super Bowl. Sean McVay coached poorly despite Rams winOverreaction or reality: RealityWhen we talk about the best coaches in the NFL, it doesn't take long before Sean McVay comes up in the conversation, and for good reason. The Rams coach has routinely kept his team competitive and just earned his 10th career playoff win. That said, this latest showing from McVay will not go on the highlight reel. Despite coming out with the win, McVay had a poor coaching effort on Sunday night, making several head-scratching decisions.In the first half, he failed to properly attack a Bears run defense that allowed 134.5 yards per game during the regular season (sixth-most in the league). In all, L.A. ran the football just seven times over the first two quarters. McVay changed his tune over the second half and overtime (24 rushing attempts), but then leaned a little too heavily on the ground attack. \nSpecifically, he elected to run just before the two-minute warning with his team up 17-10. There was 2:07 on the game clock, and the Rams were looking at a third-and-10 situation. Because the cock was going to stop anyway, McVay should've put the ball in the air to try and convert and win the game in regulation. Then, McVay ran it three-straight times on the opening possession of overtime, which led to a three-and-out. Had Los Angeles' defense not picked off Caleb Williams to help set up the game-winning field goal, Chicago could've won the game with Matthew Stafford, the MVP favorite, not attempting a pass in overtime. \"Offensively, man, I did not do a very good job for our group tonight, but I thought our guys were able to overcome it,\" McVay told reporters postgame.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff overreactions for divisional round: C.J. Stroud cost himself millions? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/01874a80-fb0d-47d2-98cd-7962d24f5d0a/thumbnail/1200x675/7ca3276ee44dd2345bac281ecfae2452/template-pic.jpg"
      ],
      "datePublished": "2026-01-19T05:05:52.000Z",
      "dateModified": "2026-01-19T05:05:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]