[
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by targeting LSU-Texas A&M, Houston-ASU, Dodgers-Blue Jays today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-fanduel-promo-code-get-300-bonus-bets-lsu-texas-a-m-houston-asu-dodgers-blue-jays/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-25T18:29:59.000Z",
    "description": "\n        Saturday's sports calendar is loaded with matchups happening across several different sports, providing sports fans with a great opportunity ",
    "body": "\n        Saturday's sports calendar is loaded with matchups happening across several different sports, providing sports fans with a great opportunity to use the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. The college football slate is packed with big matchups like No. 3 Texas A&M vs. No. 20 LSU, while Game 2 of the 2025 World Series takes place when the Toronto Blue Jays host the Los Angeles Dodgers at 8 p.m. ET. According to the latest college football odds at FanDuel Sportsbook, Texas A&M is favored by 2.5 points, while the over/under for total points scored is 49.5. SportsLine's model has the over cashing (49.5) in Texas A&M vs. LSU, with the over hitting in 64% of simulations of the CFB odds. The model's best bets also include the Houston covering the spread (+7) against Arizona State in 53% of simulations of the college football odds. Meanwhile, SportsLine's model is backing the over (7.5) in the Dodgers vs. Blue Jays, with the over hitting in 63% of simulations. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and is a profitable 42-30 combined on money-line and over/under college football picks since the beginning of 2024. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best Saturday picksTexas A&M vs. LSU: Over 49.5 total points (-105)Houston (+7.5) vs. Arizona State (-120)Dodgers vs. Blue Jays: Over 7.5 total runs (-106)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +595 (risk $100 to win $595). Bet it at FanDuel here:\nTexas A&M vs. LSU: Over 49.5 total points (-105)Texas A&M's offense is averaging 36.1 points per game. Sophomore quarterback Marcel Reed has 1,770 passing yards with 15 passing touchdowns. Sophomore receiver Mario Craver is the main pass-catcher, reeling in 674 receiving yards and four touchdowns. LSU senior quarterback Garrett Nussmeier has compiled 1,638 passing yards and 11 passing scores. The Tigers' offense is logging 25.9 points per contest. SportsLine's model has these teams scoring 58 total points and the over hitting in 64% of simulations. Bet Texas A&M vs. LSU over at FanDuel Sportsbook:Houston (+7.5) vs. Arizona State (-120)The Cougars have won two straight games and head into this contest with momentum. Houston is 5-2 ATS in regular-season games and 2-1 ATS as the away team. Meanwhile, Arizona State is 1-2-1 ATS after a win and 1-2 ATS as the favorite. Houston quarterback Conner Weigman has 1,380 passing yards with 11 passing touchdowns and only two interceptions. SportsLine's model has the Cougars covering the spread in 53% of simulations. Bet Houston to cover at FanDuel Sportsbook:Dodgers vs. Blue Jays: Over 7.5 total runs (-105)These teams have the firepower to pour in runs. In Game 1, these teams scored a combined 15 total runs. The Blue Jays had three home runs in this outing, as Alejandro Kirk went 3-of-3 with a home run and two RBI. On the other side, Shohei Ohtani was 1-of-4 with a two-run home run. This was his sixth home run of the postseason for Ohtani. The total has gone Over in six of Toronto's last seven games, and the Over has hit in eight of Toronto's last nine games against an opponent from the NL West. SportsLine's model has these teams combining for 9.1 total runs and the over hitting in 63% of simulations. Bet Dodgers vs. Blue Jays over at FanDuel Sportsbook:\nWant more college football picks?You've seen the model's best bets for Saturday. Now, get against the spread, total and money-line picks for every CFB game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by targeting LSU-Texas A&M, Houston-ASU, Dodgers-Blue Jays today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-25T18:29:59.000Z",
      "dateModified": "2025-10-25T18:29:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canadiens' Patrik Laine out three to four months after core muscle surgery, could miss 2026 Winter Olympics - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nhl/news/canadiens-patrik-laine-out-three-to-four-months-after-core-muscle-surgery-could-miss-2026-winter-olympics/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/d851002e-51e3-4d0d-b9ef-e0834555cea0/thumbnail/1200x675/3a858a41509ecdaa07d5f376e0fe43a1/patrik-laine.jpg",
    "tag": "Sports",
    "date": "2025-10-25T19:24:11.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Montreal Canadiens announced on Saturday that ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Montreal Canadiens announced on Saturday that right winger Patrik Laine will miss three-to-four months following a surgery to repair a core muscle. This means Laine's status to represent Finland at the 2026 Winter Olympics could be in jeopardy, with the games beginning on Feb. 6 and his return timeline ranging from late January to late February.The seven-time 20-goal scorer last hit the ice on Oct. 16 in their game against the Nashville Predators and has been absent from the lineup since, listed day-to-day with a lower body injury. In five games this season, he had one assist. Last season, Laine had 33 points, including 20 goals and 13 assists.This year was Laine's first chance to represent his home country in the Olympics, as the NHL is allowing players to participate for the first time since 2014. His international play includes a World Junior Championship with Finland in 2016 as well as silver in the IIHF World Championship and the IIHF World U18 Championship. He had three assists in three games in the 4 Nations Face-Off last season as a member of team Finland.\nFinland won its first Olympic men's ice hockey gold medal in 2022, defeating the Russian Olympic Committee. Finland's journey to repeat has already taken some hits, with star Aleksander Barkov, who tore his ACL and MCL in training camp, out for months.Other players representing Finland, Juuso Valimaki, Kaapo Kakko, Rasmus Ristolainen and Ukko-Pekka Luukkonen, have missed the beginning of the NHL season due to injury.\nLaine joined the Canadiens in 2024 and previously played for the Winnipeg Jets and Columbus Blue Jackets.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canadiens' Patrik Laine out three to four months after core muscle surgery, could miss 2026 Winter Olympics - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/d851002e-51e3-4d0d-b9ef-e0834555cea0/thumbnail/1200x675/3a858a41509ecdaa07d5f376e0fe43a1/patrik-laine.jpg"
      ],
      "datePublished": "2025-10-25T19:24:11.000Z",
      "dateModified": "2025-10-25T19:24:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing LSU, Michigan, college football games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-lsu-texas-a-m-michigan-state-michigan-college-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:29:35.000Z",
    "description": "\n        Saturday's college football slate is underway, but several pivotal matchups are set to unfold later in the day. Matchups like No. 20 LSU vs. ",
    "body": "\n        Saturday's college football slate is underway, but several pivotal matchups are set to unfold later in the day. Matchups like No. 20 LSU vs. No. 3 Texas A&M at 7:30 p.m. ET provide a great opportunity for new users to check out the latest bet365 bonus code CBSBET365, offering $200 in bonus bets after placing a first wager of $5 or more. According to the latest college football odds, Texas A&M is favored by 2.5 points, while the over/under for total points scored is 49.5.SportsLine's proven computer model thinks LSU pulls off the upset as a home underdog, and it has also revealed two more best bets for Saturday night's college football action. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. It is on a sizzling 43-28 run on top-rated picks dating back to 2024. Additionally, the model is up well over $10,000 for $100 players on top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. Anybody following its NBA betting picks and NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Saturday's top picks, best betsOver 44.5 points in Oregon vs. WisconsinLSU +2.5 vs. Texas A&MMichigan -14.5 vs. Michigan StateCombining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:\nOver 44.5 in Oregon vs. WisconsinThis is one of the lowest totals of the week in college football, which is largely due to Wisconsin's offense. The Badgers were shut out by Iowa and Ohio State in their last two games, but Oregon has not recorded a shutout this season and has allowed double digits in five of its first seven outings. SportsLine's model has Wisconsin scoring 12 points on Saturday night, which is enough to help the full game Over cash in 67% of simulations. Bet it at bet365 here:  LSU +2.5 vs. Texas A&MLSU desperately needs a win on Saturday night to keep its SEC title and College Football Playoff hopes alive, as the Tigers are coming off a 31-24 loss at Vanderbilt. They have not lost a home game so far this season, and Texas A&M has played its two closest games in its two road games. The Aggies escaped with a 1-point win at Notre Dame and a 3-point win at Arkansas, and this is their second week in a row on the road. LSU wins outright and is covering the spread 58% of the time, according to the model. Bet it at bet365 here:Michigan -14.5 vs. Michigan StateMichigan State is in a major rut right now, dropping its fourth straight game last week. The Spartans have lost their last two games by 25 points each, while Michigan has already beaten Wisconsin and Washington by two-plus touchdowns. The Spartans are 0-7 against the spread in their last seven games at home. The model has Michigan cruising to another win in this rivalry game, as the Wolverines cover the spread in 66% of simulations. Bet it at bet365 here:\nLooking for Week 8 NFL picks?You've seen the model's best bets for Saturday. Now, get against the spread, total and money-line picks for every NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing LSU, Michigan, college football games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-10-25T17:29:35.000Z",
      "dateModified": "2025-10-25T17:29:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in 49ers vs. Texans picks, score prediction for NFL Week 8 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-vs-texans-where-to-watch-nfl-week-8-betting-odds-promos-score-prediction-mac-jones-cj-stroud/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:12:16.000Z",
    "description": "\n        The San Francisco 49ers continue to battle key injuries, but they just keep winning as they enter Week 8 with a 5-2 record. Brock Purdy's toe",
    "body": "\n        The San Francisco 49ers continue to battle key injuries, but they just keep winning as they enter Week 8 with a 5-2 record. Brock Purdy's toe injury has kept him out of all but two games this year, and Mac Jones is 4-1 as a starter and will be under center again on Sunday. The Houston Texans are just 2-4 on the year and have struggled offensively. That unit will be tested even more on Sunday as star receiver Nico Collins is dealing with a concussion, taking away quarterback C.J. Stroud's top option in the passing game.Kickoff from NRG Stadium is set for 1 p.m. ET, and the Texans are 1.5-point favorites, according to the latest 49ers vs. Texans odds. The over/under for total points scored is 42. Before you make any Texans vs. 49ers picks, make sure to check out what the SportsLine Projection Model has to say. Click here to bet 49ers vs. Texans at DraftKings Sportsbook, where new users get $300 in bonus bets if your first bet wins and three free months of NBA League Pass:Where to bet on 49ers vs. TexansBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  Just click hereWhere to watch 49ers vs. Texans on SundayWhen: Sunday, Oct. 26Time: 1 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports App49ers vs. Texans betting previewOdds: Texans -1.5, over/under 42The Texans can't afford to lose too many more games if they want to repeat as AFC South champs, especially with the Indianapolis Colts off to a stellar 6-1 start. The 49ers, meanwhile, are one of three 5-2 teams in the NFC West. The 49ers are 4-3 against the spread this year, and their games have gone Over the total in four of seven contests. The Texans, meanwhile, are 2-4 against the spread and only two of their six games have gone Over, both because their defense has been very good and their offense has struggled early in 2025.Click here to bet 49ers vs. Texans at FanDuel Sportsbook, where new users get $300 in bonus bets if their first bet of at least $5 wins:Model's 49ers vs. Texans score prediction, picksEven with Jones set to start again in place of Purdy, the 49ers have to be feeling good about this matchup against a Texans team that has only beat the lowly Tennessee Titans and a Lamar Jackson-less Baltimore Ravens team. San Francisco has been able to cover in the majority of its games this year, and the SportsLine Projection Model has the 49ers covering +1.5 in the majority of simulations, good for a 'B' grade.49ers vs. Texans score prediction: Texans 21, 49ers 20Want more Week 8 NFL picks?You've seen the model's best bets for San Francisco 49ers vs. Houston Texans. Now, get against the spread, total and money-line picks for every Week 8 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in 49ers vs. Texans picks, score prediction for NFL Week 8 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/7fd6b151-e503-48d9-bf49-339e736c02db/thumbnail/1200x675/de6afba176bd703362238cbe30ce44bc/christian-mccaffrey.jpg"
      ],
      "datePublished": "2025-10-25T17:12:16.000Z",
      "dateModified": "2025-10-25T17:12:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn women's basketball reveals national title rings, designed by Paige Bueckers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/look-uconn-womens-basketball-reveals-national-title-rings-with-design-help-from-paige-bueckers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/a5e99e59-1164-47a0-ab13-be0299a4ec76/thumbnail/1200x675/3c0df80d785e14b5ff476defc8437614/uconn.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:49:30.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The UConn women's basketball team knows a thing or",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The UConn women's basketball team knows a thing or two about winning championships, and this past season they earned their 12th in program history by beating South Carolina. Their 2024-25 season was celebrated again this week when the team received their championship rings. Those rings are designed by former UConn star and current WNBA point guard Paige Bueckers, along with current Huskies Azzi Fudd and Caroline Ducharme. The new bling represents the Huskies' history and success, as well as their most recent season.\nThe bezel is removable to become a pendant, and underneath is a piece of a championship game ball under etched stone. \nThe 12 trapezoid-shaped stones on the front represent the 12 national championships, and the five triangles on the side represent five straight Big East Tournament championships. The side of the ring also says \"The Power of Friendship,\" which is something Bueckers credits for the win. \nInside the ring is the road they took to the national championship. The scores of each game are listed, from the 82-59 Sweet 16 win Oklahoma, to thr 82-59 victory over the Gamecocks to win it all.The word \"vibes\" is at the bottom, a reference to Bueckers saying the team \"went straight off vibes\" during the season. \"All in all, a beautiful decoration of all that we accomplished,\" Bueckers said. \"And I think you kind of just encapsulated everything that we had and everything we went through to get there.\"\nUConn begins their campaign for a 13th national championship on Nov. 4 against Louisville. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn women's basketball reveals national title rings, designed by Paige Bueckers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/a5e99e59-1164-47a0-ab13-be0299a4ec76/thumbnail/1200x675/3c0df80d785e14b5ff476defc8437614/uconn.jpg"
      ],
      "datePublished": "2025-10-25T17:49:30.000Z",
      "dateModified": "2025-10-25T17:49:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee promotes Josh Elander to baseball coach, filling vacancy left by Tony Vitello - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/general/news/tennessee-promotes-josh-elander-to-baseball-coach-quickly-filling-vacancy-left-by-tony-vitello/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/29c0f91c-786a-4a55-a392-45a746bc703f/thumbnail/1200x675/d852c1815e0b250c5456aad3d71c2c85/adobe-express-file-57.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:20:23.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Tennessee will go with an in-house hire to fill th",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Tennessee will go with an in-house hire to fill the vacancy left by former coach Tony Vitello, who took the same job with the San Francisco Giants in a historic move. The Volunteers are promoting Josh Elander, the team's associate head coach since 2022, the team announced three days after Vitello's departure. \"From the outset of this national search, Josh emerged as the undeniable top choice,\" Tennessee athletic director Danny White said in a statement. \"His relentless commitment has helped transform Tennessee baseball into a powerhouse, and we are proud to have him as our next head coach on Rocky Top. His influence inspires excellence in every aspect of our program and we look forward to continuing our quest for championships on the diamond under Josh's guidance!\"Elander followed Vitello to Knoxville as a member of his inaugural staff with the Vols in 2018. He initially served as an assistant coach and recruiting coordinator, and he maintained those recruiting responsibilities when he was named associate head coach three years ago. Over the past few seasons, Elander has served as an offensive coordinator of sorts as Tennessee's third base coach. Under Elander's tutelage, Tennessee finished No. 1 nationally in home runs in 2022 and 2024. \nHe's also had a hand in developing 27 hitters and position players that have been selected in the MLB Draft. In his capacity as recruiting coordinator, Elander was instrumental in Tennessee signing back-to-back No. 1 ranked high school classes from 2024-25, according to Perfect Game. \"I'm incredibly grateful for the opportunity here on Rocky Top,\" Elander said. \"I'm really happy for our players to continue building on what we've already built here. The hunt continues, and we're still excited. Love this place and these people. So thankful for the best that's yet to come.\"Elander has learned from some of college baseball's top coaches during his time as a player and assistant. He starred on the diamond at TCU from 2010-12, where he played under current Texas coach Jim Schlossnagle and Vitello as an assistant. \nIn 2016, Elander joined the Horned Frogs as a student assistant and in 2017 moved to Arkansas, where he was a volunteer coaching assistant under Dave Van Horn. Vitello was also a member of that Arkansas coaching staff. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee promotes Josh Elander to baseball coach, filling vacancy left by Tony Vitello - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/29c0f91c-786a-4a55-a392-45a746bc703f/thumbnail/1200x675/d852c1815e0b250c5456aad3d71c2c85/adobe-express-file-57.jpg"
      ],
      "datePublished": "2025-10-25T17:20:23.000Z",
      "dateModified": "2025-10-25T17:20:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trevon Diggs injury update: Cowboys place star CB on IR for concussion, knee - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/trevon-diggs-injury-update-cowboys-ir-fluke-situation-concussion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/0fc68a0b-7b42-4015-bbfd-07cf0a8d64cb/thumbnail/1200x675/35cbddd1a4cacd3c6f702b5de4e0c2a4/gettyimages-2235815941-2.jpg",
    "tag": "Sports",
    "date": "2025-10-25T20:00:38.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Dallas Cowboys have placed Trevon Diggs on inj",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Dallas Cowboys have placed Trevon Diggs on injured reserve as the star cornerback works through concussion and knee injuries, the team announced ahead of their Week 8 game against the Denver Broncos. Diggs suffered a concussion during an accident at his home, which forced him to miss last week's win over the Washington Commanders. Now on IR, Diggs will miss at least the next four games; at the earliest, he could return for Week 13 vs. the Kansas City Chiefs. Through the first six games of the season, Diggs recorded 13 tackles and one tackle for loss. In his six-year career with the Cowboys, Diggs has tallied 20 interceptions, 63 pass break-ups and 233 tackles.Exactly how Diggs suffered a concussion at his home has been shrouded in mystery, and Cowboys owner and general manager Jerry Jones referred to it as a \"fluke situation\" but didn't anticipate a lengthy absence for Diggs.\"I don't know the combination of the injury and how it impacted, regarding concussion issue, I'm not sure that I know the detail of how that happened,\" Jones said. \"He said what happened, and I'm not saying that didn't happen, but a lot of times, you're not the best viewer of what happened to you. ... Yeah, no I won't get into that [what Diggs said happened], but the bottom line is that I do expect him back.\"\nEven with Diggs, the Cowboys have been the worst pass defense in the NFL. They've allowed 260.3 yards per game, which ranks dead last, and now they'll have to move forward without a staple of their defensive backfield.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trevon Diggs injury update: Cowboys place star CB on IR for concussion, knee - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/0fc68a0b-7b42-4015-bbfd-07cf0a8d64cb/thumbnail/1200x675/35cbddd1a4cacd3c6f702b5de4e0c2a4/gettyimages-2235815941-2.jpg"
      ],
      "datePublished": "2025-10-25T20:00:38.000Z",
      "dateModified": "2025-10-25T20:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Antonio Conte benches new signings, feuds with with Inter's Lautaro Martinez in dramatic 3-1 win for Napoli - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/antonio-conte-benches-new-signings-feuds-with-with-inters-lautaro-martinez-in-dramatic-3-1-win-for-napoli/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/df6dda6a-1502-419f-8c23-0f0cefe0c39d/thumbnail/1200x675/d6cae6ce7fb985b1b56d9d19bfb222d9/untitled-design-2025-10-25t211453-727.png",
    "tag": "Sports",
    "date": "2025-10-25T19:18:46.000Z",
    "description": "\n        Napoli needed to react after a disappointing week, following the shocking 6-2 defeat against PSV in the UEFA Champions League, and react they",
    "body": "\n        Napoli needed to react after a disappointing week, following the shocking 6-2 defeat against PSV in the UEFA Champions League, and react they did against one of the best teams around Europe right now, Cristian Chivu's Inter. The Azzurri won 3-1 at the Stadio Diego Armando Maradona in front of their home fans and got back on track in the right moment and in the right match, showing their Serie A rivals they are still the team to beat this season after what happened last year, when Antonio Conte's team won the title on the last matchday of the season. The Italian manager was the absolute star of the show in this victory, with his starting lineup decisions and an heated clash with his former striker, Lautaro Martinez. \nAfter the European disappointment, Conte spoke to Sky Italy and expressed his concerns on the new season and the players signed over the summer 2025. \"Last year we won an extraordinary and incredible championship where everyone pushed their limits with unity across the board. This year, however, between playing so many games and bringing in so many players in my opinion, nine new players were too many. We weren't balanced. I've always said this year would be difficult, there are some aspects that take time to absorb.\" He put his money where his mouth was as Conte decided to bench most of the summer signings including strikers Lorenzo Lucca, Noa Lang and center back Sam Beukema, showing once again his concerns for the current roster. The Azzurri suffered in the first part of the game while Inter had some big chances to score the opening goal before a much discussed penalty awarded to the home team, later scored by Kevin De Bruyne, the only summer signing who started the match alongside goalkeeper Vanja Milinkovic-Savic. However, the former Manchester City midfielder got injured while taking the penalty, forcing Conte to replace him early in the match. \nAmong the decisions taken by the Italian manager, the most interesting one is about the central striker. Conte deployed the usual 4-1-4-1 with David Neres playing up front instead of a more physical striker like Lucca, who was benched a few days after receiving a red card against PSV, while both Rasmus Hojlund and Romelu Lukaku are currently injured. De Bruyne's injury, which doesn't appear to be a short-term one, is likely to force a tactical rethink for the Azzurri. Conte may opt to return to the 4-3-3 system used during the 2024–25 season, rather than deploying both the Belgian midfielder and Scott McTominay together, the biggest tactical adjustment of the new campaign.However, one of the most discussed moments of the second half was Antonio Conte's on-pitch clash with Inter captain Martínez. The two exchanged words from a distance after Conte had already been involved in a heated argument with another Inter player, Denzel Dumfries. Speaking to DAZN after the game, Conte didn't go easy on the Inter captain: \"Lautaro is an excellent player, though maybe I didn't get the chance to really know him on a personal level. I wish him all the best, and that's fine by me.\"\nBack in 2021, the two had an argument when Conte was the Inter manager and won the Scudetto during the 2020-21 season, with Lautaro leading the team. Recently, the Argentinian star went back and talked about the episode. \"We had a little argument at the time and it was eventually resolved. My teammates then set up a boxing ring as a joke, it was better to laugh about it! It was a nice moment and helped us relax.\" Still, perhaps things weren't as settled as he suggested.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Antonio Conte benches new signings, feuds with with Inter's Lautaro Martinez in dramatic 3-1 win for Napoli - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/df6dda6a-1502-419f-8c23-0f0cefe0c39d/thumbnail/1200x675/d6cae6ce7fb985b1b56d9d19bfb222d9/untitled-design-2025-10-25t211453-727.png"
      ],
      "datePublished": "2025-10-25T19:18:46.000Z",
      "dateModified": "2025-10-25T19:18:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sunderland down Chelsea as their dramatic Premier League return takes them as high as second place in table - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/sunderland-down-chelsea-as-their-dramatic-premier-league-return-takes-them-as-high-as-second-place-in-table/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/9e82943b-efa1-4714-9721-682538ffd586/thumbnail/1200x675/b7f179087386788fbe54d5603a694a23/untitled-design-2025-10-25t204232-527.png",
    "tag": "Sports",
    "date": "2025-10-25T18:44:51.000Z",
    "description": "\n        From rock bottom to the Champions League places, Sunderland marched into Stamford Bridge and left with a 2-1 victory over Chelsea. When the B",
    "body": "\n        From rock bottom to the Champions League places, Sunderland marched into Stamford Bridge and left with a 2-1 victory over Chelsea. When the Black Cats got promoted back to the Premier League, there was hope that after making interesting transfers, they'd find their stride and avoid a third consecutive season during which all three newly promoted teams were relegated from the Premier League, but now they can do something that hasn't been done since 2020-21 by, fellow Premier League returnee Leeds United.That's the last time that a newly promoted side finished in the top half of the Premier League. It was done by Wolverhampton, Sheffield United, and Leeds between 2018 and 2021, but hasn't been accomplished since, with the gap between the Premier League and the Championship growing wider by the season, with increased spending in the top flight. But even predicting a resurgence this year from promoted sides, Sunderland, the third team promoted, winning their place through the Championship playoffs, would've been one of the most unlikely suspects.The Black Cats were last in the Premier League in the 2016-17 season before a quick fall happened, going down from the Championship all the way to League One. That stay in League One was a lengthy one as well, with it lasting four seasons before spending three seasons in the Championship. Even for a well-known club, that's enough to break things apart, but not for Sunderland with a blend of youth and experience leading them.Adding Granit Xhaka from Bayer Leverkusen has transformed the club's midfield, but even players like Chemsdine Talbi are new to the club. With Wilson Isador scoring the opening goal after being involved in their promotion campaign from the Championship, it shows the balance of adding new players to the club while keeping experience from those who got them here to create a balanced squad.\nGoing into Stamford Bridge for a win is the biggest win so far this season for the Black Cats, putting them on 17 points. With the magic number for Premier League safety usually being 40 points, they're almost halfway to that target under Regis Le Bris. There's nothing better than quickly collecting Premier League points because those can't be taken away from you, and doing so is giving Sunderland more confidence by the day.Defensively, they've been among the best teams in the league, only allowing seven goals and looking at their expected goals allowed of 10, while they're overperforming, it's not by enough that would suggest that the wheels will fall off this team. With contributions from everywhere in the attack, there's also no over-reliance on one player either.\nIn a season where teams like Nottingham Forest, West Ham United, and Wolves are all in the relegation zone, if there's a time for Sunderland to break into the top half, it's now. There's still plenty of the season to play ou,t but they've already announced that the Black Cats are back, now they need to prove that they're here to stay.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sunderland down Chelsea as their dramatic Premier League return takes them as high as second place in table - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/9e82943b-efa1-4714-9721-682538ffd586/thumbnail/1200x675/b7f179087386788fbe54d5603a694a23/untitled-design-2025-10-25t204232-527.png"
      ],
      "datePublished": "2025-10-25T18:44:51.000Z",
      "dateModified": "2025-10-25T18:44:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics star Jaylen Brown says NBA has not prepared, protected players in new sports betting environment - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-star-jaylen-brown-says-nba-has-not-prepared-protected-players-in-new-sports-betting-environment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/67f6f2e9-89f0-4027-90dc-6691e9e8de6e/thumbnail/1200x675/419408209181e4ca785a30055852a6e4/gettyimages-2240653793-1-1.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:42:01.000Z",
    "description": "\n        The arrests of Chauncey Billups and Terry Rozier in the federal investigation into sports betting and illegal gambling called into question h",
    "body": "\n        The arrests of Chauncey Billups and Terry Rozier in the federal investigation into sports betting and illegal gambling called into question how the NBA is working to protect its players from the dark side of the wagering world. And according to Boston Celtics forward Jaylen Brown, the league has not done enough in that regard.Brown, who serves as a vice president of the National Basketball Players Association, lamented the lack of discourse between the league and its athletes about staying safe in the era of legalized sports betting. Whether it be the dangers of soliciting information to bettors or fans' regrettable behavior towards players, Brown said there is ample work to be done in keeping players out of harm's way.\"A lot more could have been done to help players and prepare players,\" Brown said in his Friday pregame media availability. \"But even in the aftermath, I don't think little care or attention to detail goes into it. They're like, 'You make X amount of money or X, Y and Z, you should be able to deal with all the extra negativity, people approaching you about parlays. It creates a negative discourse around the game and players when people have money involved.\"Complicating matters is that the NBA has business partnerships with sportsbooks, which produce immense revenue from wagers made on the league's games, teams and individual players. Commissioner Adam Silver called this week for stricter regulations on sports betting and said the NBA asked some of its partners to pull back on some of their player prop bet offerings in an attempt to prevent game manipulation.\n\"I don't think once from my conversations with the union and the NBA has been like 'How can we protect players more with the environment?'\" Brown said. \"There's been little to no conversation about that. It's all about 'How can we increase business and increase revenue?' I'm not sure if we're having enough conversations about the aftermath or the consequences some of that stuff has.\"Billups and Rozier were among the more than 30 people arrested by the FBI as part of the investigation. Billups was allegedly connected with illegal high-stakes poker games, and Rozier was allegedly tied to a ring of current and former NBA players trading inside information with bettors.\"That whole world was introduced a couple of years ago, and I don't think they took players into consideration, especially with the energy and the behavior that goes around gambling and how that directly correlates with players,\" Brown said. \"We don't benefit from any of the profits or anything like that, but we gotta deal with a lot of the extra negativity and scrutiny behind all the gambling stuff. On top of that, it creates more integrity issues, et cetera. I'm not sure what the answer is going forward, but definitely something that people gotta spend more time having conversations about.\"\nPlayers do, in fact, benefit from shares of gambling-related revenue at the league level as it falls under the NBA's basketball-related income umbrella. The league also asserts that it has protections in place to shield players from some of the issues Brown highlighted.\"Protecting the safety of players and coaches has always been of critical importance,\" NBA spokesman Mike Bass said in a statement. \"League security works with team officials and law enforcement to respond to any type of fan behavior that violates our code of conduct -- whether that's in our arenas or online. We have put safeguards in place, including social media monitoring, to track and mitigate any potential threats or safety risks. And we have increased communications to fans attending games to reinforce our code of conduct and emphasize that disrespectful and abusive behavior will not be tolerated.\"This is the NBA's second major gambling scandal in the last two years. The league banned Jontay Porter in 2024 for his role in a scheme involving his prop bets.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics star Jaylen Brown says NBA has not prepared, protected players in new sports betting environment - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/67f6f2e9-89f0-4027-90dc-6691e9e8de6e/thumbnail/1200x675/419408209181e4ca785a30055852a6e4/gettyimages-2240653793-1-1.jpg"
      ],
      "datePublished": "2025-10-25T17:42:01.000Z",
      "dateModified": "2025-10-25T17:42:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jets rule out Tyrod Taylor due to knee injury; Justin Fields to start Week 8 vs. Bengals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jets-rule-out-tyrod-taylor-due-to-knee-injury-justin-fields-to-start-week-8-vs-bengals/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/02/a618bb37-8fd9-4c3f-a8d5-852a703037b0/thumbnail/1200x675/a35fcfe1acf04d366f98788616dca3a2/justin-fields-jets-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-25T17:44:44.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The New York Jets will start Justin Fields at quar",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The New York Jets will start Justin Fields at quarterback when they visit the Cincinnati Bengals in Week 8, the team announced Saturday. This comes after they downgraded Tyrod Taylor to out due to a knee injury that initially had him listed as questionable for the contest. With Taylor sidelined, rookie Brady Cook will serve as the backup. This wraps up the mystery of which quarterback would start for the Jets in Week 8, as coach Aaron Glenn had kept the decision close to the vest throughout the week. Had it not been for Taylor's knee injury, however, the veteran likely would've received his first start of the season after taking over for Fields to begin the second half of last week's loss to the Carolina Panthers. After Fields' benching, Taylor completed 10 of his 22 pass attempts for 126 yards and threw two interceptions. \nFor Fields, this has been quite the whirlwind of a week. Not only did the former first-rounder need to field questions about his in-game benching in Week 7, but he also found himself under fire from Jets owner Woody Johnson. At the NFL league meetings, Johnson was openly critical of Fields' play this season, throwing jabs like, \"If we could complete a pass, it would look good.\" When asked for his comments on the matter, Fields took the high road, saying, \"It doesn't bother me, it doesn't. Of course, everybody knows I need to play better, we need to play better as a team.\" \nUnder Fields, who inked a two-year, $40 million deal this offseason, the Jets are 0-7 on the season, and the quarterback has struggled mightily when dropping back to pass, averaging 140.8 passing yards per game. Meanwhile, New York is averaging 18.4 points per game, which is the sixth-lowest in the NFL. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jets rule out Tyrod Taylor due to knee injury; Justin Fields to start Week 8 vs. Bengals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/02/a618bb37-8fd9-4c3f-a8d5-852a703037b0/thumbnail/1200x675/a35fcfe1acf04d366f98788616dca3a2/justin-fields-jets-imagn.jpg"
      ],
      "datePublished": "2025-10-25T17:44:44.000Z",
      "dateModified": "2025-10-25T17:44:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 321 card, start time, location for Tom Aspinall vs. Ciryl Gane main event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-321-card-time-location-fights-tom-aspinall-ciryl-gane/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/04/20f24a1f-e36c-44eb-aec1-421cd2d530f5/thumbnail/1200x675/1b07b5c732b20ac85b222c09ed9d34b9/tom-aspinall-ufc-321-ciryl-gane-mma-news-today-cbs-sports.jpg",
    "tag": "Sports",
    "date": "2025-10-25T19:34:46.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Aspinall makes his first undisputed title defense, after Jon Jones vacated the title, against Gane at UFC 321\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Oct 25, 2025\n                            \n                    at\n    3:34 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        It's fight night in the United Arab Emirates. UFC 321 is set to go down on Saturday from Abu Dhabi as UFC returns to its former \"Fight Island\" as part of its annual journey to the Middle East. A pair of title fights are on the marquee with a heavyweight title fight tipping the bill. Newly crowned undisputed heavyweight champion Tom Aspinall looks for his first full title defense against Ciryl Gane. Plus, Mackenzie Dern and Virna Jandiroba are set to scrap it out for the now vacant women's strawweight crown. It all goes down from the Eithad Arena on Saturday.Aspinall now gets his chance as the leading man after two years of turmoil. He was one of four fighters ever to defend an interim title as Jones continued to avoid the matchup while fighting just once against Stipe Miocic, who made his first appearance in over four years. Aspinall's lone blemish was avenged in that interim title defense when he TKO'd Curtis Blaydes. Aspinall lost that first meeting with Blaydes after suffering a knee injury in the opening minute of the bout. Gane, meanwhile, bounced back from his defeat to Jones with a pair of wins to earn his shot at the crown.Be sure to keep up with all the action on Saturday with our live coverage that includes round-by-round scoring and updating fight results throughout the night!Meanwhile, the second title fight is guaranteed to produce a new champion. Zhang Weili vacated the women's strawweight crown when she made the decision to move up and challenge Valentina Shevchenko for the flyweight title. That left top contender Virna Jandiroba and Mackenzie Dern waiting in the wings to battle it out on Saturday. Jandiroba, 37, is on a five-fight win streak while Dern, 32, is 2-2 in her last four appearances.Bet UFC 321 at DraftKings Sportsbook, where new users get $300 in bonus bets and 3 free months of NBA League Pass with a winning $5 wager.\nIn addition, Umar Nurmagomedov looks to get back to a title opportunity when he takes on streaking contender Mario Bautista. Nurmagomedov, cousin of Hall of Famer Khabib Nurmagomedov, lost his bout with Merab Dvalishvili for the title in January. But it's the lone blemish on an otherwise impeccable resume. UFC CEO Dana White said on Thursday that if Nurmagomedov -- or Bautista -- truly impresses, the winner will get the next shot at the champion, after Dvalishvili takes on Petr Yan in December.Below is the complete fight card for UFC 321 along with the latest odds. Check back all week long for the latest news, features and other content around this massive event.UFC 321 card, fight oddsTom Aspinall (c) -345 vs. Ciryl Gane +275, heavyweight titleMackenzie Dern -155 vs. Virna Jandiroba +130, vacant women's strawweight titleUmar Nurmagomedov def. Mario Bautista via unanimous decision (30-27, 30-27, 30-27)Alexander Volkov def. Jailton Almeida via split decision (29-28, 28-29, 29-28)Azamat Murzakanov def. Aleksandar Rakic via first-round TKO (punches)Quillan Salkilld def. Nasrat Haqparast via first-round knockout (head kick)Ikram Aliskerov def. Jun Yong Park via unanimous decision (30-27, 30-27, 30-27)Ludovit Klein def. Mateusz Rebecki via majority decision (29-28, 28-27, 28-28)Valter Walker def. Louie Sutherland via first-round submission (heel hook)Nathaniel Wood def. Jose Delgado via unanimous decision (29-28, 29-28, 29-28)Hamdy Abdelwahab def. Chris Barnett via unanimous decision (29-26, 29-27, 29-27)Mitch Raposo def Azat Maksum via unanimous decision (30-26, 29-27, 29-27)Mizuki def. Jaqueline Amorim via unanimous decision (30-27, 30-27, 29-28)Where to watch UFC 321Date: Saturday, Oct. 25 | Start time: 2 p.m. ET (main card) Location: Etihad Arena -- Yas Island, United Arab EmiratesWhere to watch: ESPN+ PPV\nUFC 321 countdownStaff predictions and expert picks for every main card boutBrookhouse: Best bets to consider on the main card in Abu DhabiWhite challenges Nurmagomedov to earn title shot on SaturdayMahjouri: Aspinall over the Jon Jones drama ahead of first title defenseBrookhouse: Women's strawweight moves on as Weili Zhang moves upCampbell: Nurmagomedov seeks redemption -- and second title shot Mahjouri: Undercard fights worth watching this weekendCampbell: Why it feels like now or never for Ciryl Gane as a title contenderCampbell: Five biggest storylines to watch in Abu DhabiWho will win UFC 321: Aspinall vs. Gane, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $1,500 on his UFC main-card picks, and find out.\n            \n    \n\n        \n    \n                                            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 321 card, start time, location for Tom Aspinall vs. Ciryl Gane main event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/04/20f24a1f-e36c-44eb-aec1-421cd2d530f5/thumbnail/1200x675/1b07b5c732b20ac85b222c09ed9d34b9/tom-aspinall-ufc-321-ciryl-gane-mma-news-today-cbs-sports.jpg"
      ],
      "datePublished": "2025-10-25T19:34:46.000Z",
      "dateModified": "2025-10-25T19:34:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Iowa vs. Minnesota TV channel, live stream, prediction, picks, odds, spread - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/iowa-minnesota-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/dfae3e56-d2b3-46e2-a802-c36f54aec8a2/thumbnail/1200x675/4a20bc759fcf5413cff7ccc2cb3f7580/iowa-1.jpg",
    "tag": "Sports",
    "date": "2025-10-25T19:20:39.000Z",
    "description": "\n        The time has come to enter another chapter into one of the Big Ten's oldest rivalries as Minnesota (5-2) travels to Kinnick Stadium to face I",
    "body": "\n        The time has come to enter another chapter into one of the Big Ten's oldest rivalries as Minnesota (5-2) travels to Kinnick Stadium to face Iowa (5-2) in Big Ten action on CBS on Saturday at 3:30 p.m. ET. This marks the 119th meeting between the two programs, a series steeped in history and tradition, including the famed \"Floyd of Rosedale\" trophy.Both teams rank among the top-30 in FBS scoring defense. Iowa allows just 14.6 points per game, while Minnesota gives up 19.0. The Golden Gophers have struggled on the road, dropping games at California and Ohio State. The Hawkeyes, meanwhile, have an edge at home, with their only loss at Kinnick Stadium this season coming against current No. 2 Indiana -- a matchup where they gave the Hoosiers their toughest test of the season.Bet Minnesota vs. Iowa at BetMGM Sportsbook, where new users get up to $1,500 in bonus bets back if their first wager doesn't win with the promo code CBSSPORTS:Minnesota and Iowa find themselves in a six-way tie for third place in the Big Ten at 3-1 in conference play. Both are looking to separate themselves in the standings, and this matchup could be decisive in shaping the middle of the conference race.\nThe matchup also features the Big Ten's two longest-tenured active coaches, Kirk Ferentz (Iowa) and P.J. Fleck (Minnesota), adding another layer of intrigue to a rivalry that typically produces closely contested games.How to watch Iowa vs. Minnesota liveDate: Saturday, Oct. 25  | Time: 3:30 p.m. ETLocation: Kinnick Stadium -- Iowa City, IowaTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ PremiumFollow along LIVE as Iowa takes on Minnesota in a Big Ten rivalry clash.   Iowa vs. Minnesota: Need to know  Key playmakers: Minnesota's Darius Taylor leads all active FBS players with 10 career games with at least 150 yards from scrimmage. He got his first rushing touchdown of the season last week against Nebraska, rushing for a season-high 148 yards. Iowa counters with transfer quarterback Mark Gronowski, who has 10 rushing touchdowns -- tied for most among FBS quarterbacks -- and recently set the NCAA record for most career wins (54) by a starting quarterback. The former South Dakota State star won two FCS national championships.\nWhat is Floyd of Rosedale?: The Iowa-Minnesota rivalry features one of college football's most unique traditions: the Floyd of Rosedale trophy. It dates back to 1935, after a controversial 1934 game where tempers ran high due to the treatment of Iowa running back Ozzie Simmons, one of the few black players in college football. To ease tensions, the governors of Minnesota and Iowa made a friendly wager involving prize pigs. Minnesota won 13-6, and the pig -- named Floyd after Minnesota governor Floyd Olson -- was later immortalized as a bronze trophy awarded annually to the winner.Penalty discipline: These Big Ten rivals are among the most disciplined teams in college football this season. The Hawkeyes lead the nation with just 2.3 penalties per game, while the Golden Gophers rank fifth in FBS, averaging only 3.6 per contest. Minimizing mistakes has been key for both teams' success, and in a close, physical rivalry game like this, staying disciplined could be a deciding factor. Iowa is 9-1 in its last 10 meetings against Minnesota with 14 fewer accepted penalties and a plus-three turnover margin.Iowa vs. Minnesota prediction, picks  \nIt might seem risky to rely on Iowa's offense to put up enough points, but these rivals have opposite trends ATS this season, with Iowa at 4-1-1 and Minnesota at 1-4-1. The Hawkeyes giving up more than a touchdown is a bit rare, with seven of the last 10 meetings decided by seven points or fewer. While Minnesota found its rushing attack against Nebraska with 186 yards -- up from a combined 133 in the previous three Big Ten games -- Iowa's stout run defense, allowing just 2.8 yards per carry and roughly 92 yards per game, should keep the Golden Gophers in check. That defensive advantage, combined with Iowa's consistency ATS in the series (7-2-1 since 2015), makes the Hawkeyes a comfortable pick. Pick: Iowa -8.5\nSportsLine's proven computer model has simulated every Week 9 college football game 10,000 times. Visit SportsLine now to see all the picks, all from the model that is 42-30 since the beginning of last season on top-rated money-line and over/under picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Iowa vs. Minnesota TV channel, live stream, prediction, picks, odds, spread - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/dfae3e56-d2b3-46e2-a802-c36f54aec8a2/thumbnail/1200x675/4a20bc759fcf5413cff7ccc2cb3f7580/iowa-1.jpg"
      ],
      "datePublished": "2025-10-25T19:20:39.000Z",
      "dateModified": "2025-10-25T19:20:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Sarkisian's NFL interest isn't new, but timing of latest report raises fresh questions at turbulent Texas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/steve-sarkisian-nfl-interest-why-he-would-want-to-leave-texas-why-nfl-may-not-want-him/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/d92de8f6-96c8-44ee-ac98-e968dc181540/thumbnail/1200x675/91fd83eab5e6f2c01ccc05a36ef45e39/gettyimages-2242344278-2.jpg",
    "tag": "Sports",
    "date": "2025-10-25T19:17:27.000Z",
    "description": "\n        Hours before an important road game for Texas at Mississippi State came a report that Steve Sarkisian could be interested in jumping to the N",
    "body": "\n        Hours before an important road game for Texas at Mississippi State came a report that Steve Sarkisian could be interested in jumping to the NFL.This isn't a new development, though The Athletic was the first to publicly report what has been bubbling behind the scenes in college football this year. In what's already been a bit of a bumpy season so far for Sarkisian in Austin, there is belief in NFL and college football circles he could be looking for an exit ramp, sources told CBS Sports. \"I'm told that representatives for Texas coach Steve Sarkisian have let NFL decision-makers know that he would be interested in potential head-coaching openings, including the Titans',\" Dianna Russini tweeted.Texas is coming off its worst offensive output of the Sarkisian era, managing 179 yards in a 16-13 overtime win vs. Kentucky, the worst team in the SEC. \n\n        \n            \n                Is it fixable? As Texas' offensive struggles continue, tough questions face Steve Sarkisian, Arch Manning\n                \n                    Chris Hummer                \n            \n                            \n    \n                \n                    \n    \nOne industry source told CBS Sports last month Sarkisian was expected to have interest in the Miami Dolphins job, should it open up. Miami Dolphins head coach Mike McDaniel is 1-6 this season with plenty of speculation about how long he can hold on to his job. The Athletic reported Saturday that Sarkisian had interest in the Tennessee Titans vacancy. The Titans fired Brian Callahan two weeks ago after a 1-5 start to the season. Sources told CBS Sports that NFL organizations are aware of Sarkisian's potential interest in making the jump to the NFL. His name came up in January during the NFL hiring cycle as a possible name that could pop up in coaching searches. Those whispers have been louder this fall with a season that has not gone to plan (Texas is No. 22 with little wiggle room for a College Football Playoff return) and the looming probability Sarkisian will have to make tough decisions about his friends on the coaching staff, namely maligned offensive coordinator/o-line coach Kyle Flood, whose offensive line reconstruction has not gone to plan. Something important to consider, however: There is healthy skepticism around the league that Sarkisian's possible NFL interest will be reciprocated this cycle. \nIn a rare move, Jimmy Sexton and Ed Marynowitz, Sarkisian's agents at CAA, issued a statement denying Sarkisian has interest in a move to the NFL. \"Any reports regarding communications on coaching opportunities with NFL teams are patently false and wildly inaccurate,\" Sexton said. \"Sark is solely focused on coaching the University of Texas football team.\"Sarkisian spent two seasons as an offensive coordinator for the Atlanta Falcons from 2017-18 before being fired. He has had a well-publicized bout with alcoholism, which included going to rehab, and was fired from USC in 2015. He has claimed to be sober since 2016 and rehabilitated his career at Alabama, first as an offensive analyst and later as the offensive coordinator on the Crimson Tide's 2020 national championship-winning team. \nSarkisian isn't the only college coach whose name has been mentioned with potential NFL searches -- Notre Dame's Marcus Freeman, Iowa State's Matt Campbell and Oregon's Dan Lanning have all come up in the past -- but the NFL has largely eschewed the college ranks to find its head coaches. The Los Angeles Chargers hired Jim Harbaugh in 2024 from Michigan though he had previously guided the San Francisco 49ers to a Super Bowl appearance. The last three before Harbaugh -- Urban Meyer with the Jaguars (2021), Matt Rhule with the Panthers (2020) and Kliff Kingsbury with the Cardinals (2019) -- all struggled in the NFL which could contribute to hesitancy on going down that path. Sarkisian has been at Texas since 2021 and has a 42-19 record over four-and-a-half seasons. He has guided the Longhorns to back-to-back College Football Playoff appearances, winning 25 games over that two-year period, and in February inked the school's first No. 1-ranked recruiting class. He is quite easily Texas' best coach since Mack Brown left the building and is on the short list of best coaches in school history. This has not been a season of warmth and and fuzzies, though. Preseason No. 1 Texas is 5-2 with road losses to Ohio State and Florida. A satisfying win over Oklahoma was followed up by a near-loss to Kentucky. The offense, Sarkisian's calling card, has taken a colossal step back as much-hyped quarterback Arch Manning has struggled in his first season as the full-time starter while the offensive line, wide receiving corps and running back room have all come up short of the standard Sarkisian established at Texas once he got things rolling. \nThe Longhorns rank 80th in scoring offense, 80th in passing offense and 84th in total offense. Sarkisian faced a battery of difficult questions at his press conference Monday, including whether he had contemplated benching Manning and whether he would give up offensive play-calling. He has refused to do so.\"That's why I got hired,\" Sarkisian said. \"I was a really good offensive coordinator, so I just believe in what we're able to do.\"Sarkisian is the fifth highest-paid coach in college football, making $10.8 million this season. He received a raise and contract extension in February that extended his deal through 2031. NFL coaching salaries aren't publicly available the way college coaches are, but multiple reports have stated Callahan made approximately $3 million per year with the Titans while McDaniel reportedly makes approximately $3.5 million annually. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Sarkisian's NFL interest isn't new, but timing of latest report raises fresh questions at turbulent Texas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/d92de8f6-96c8-44ee-ac98-e968dc181540/thumbnail/1200x675/91fd83eab5e6f2c01ccc05a36ef45e39/gettyimages-2242344278-2.jpg"
      ],
      "datePublished": "2025-10-25T19:17:27.000Z",
      "dateModified": "2025-10-25T19:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 8 NFL parlay, predictions, bets: These 5 picks could return around +2500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-parlay-week-8-2025-odds-lines-spreads-picks-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/03/3bc757ee-b265-4efe-964a-676f12dfbb0d/thumbnail/1200x675/69989ce6f18a434694165efb39c697f2/devonta-smith-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-10-25T19:01:20.000Z",
    "description": "\n        Aaron Rodgers and the Pittsburgh Steelers look to get back on track when they take on Rodgers' old team, the visiting Green Bay Packers on 'S",
    "body": "\n        Aaron Rodgers and the Pittsburgh Steelers look to get back on track when they take on Rodgers' old team, the visiting Green Bay Packers on 'Sunday Night Football.' Pittsburgh (4-2) is coming off a disappointing 33-31 loss to the Cincinnati Bengals in Week 7, while the Packers (4-1-1) rallied to defeat the Arizona Cardinals 27-23. Pittsburgh still holds a 1.5-game lead over Cincinnati in the AFC North, while Green Bay holds a lead by percentages over the Detroit Lions in the NFC North. The Packers enter as a 3-point favorite in one of three games with a Week 8 NFL spread of 3 points or fewer, while another is 49ers vs. Texans (-1.5).  There are a number of intriguing matchups on the Week 8 NFL schedule, including Giants at Eagles (-7.5), Cowboys at Broncos (-3.5) and Commanders at Chiefs (-11.5) on 'Monday Night Football.' Which other teams have value to include in Week 8 NFL parlay bets, and which side of the NFL odds should you target? Before locking in any Week 8 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 43-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 8 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of around 25-1. You can only see the model's Week 8 NFL picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top Week 8 NFL picksAfter simulating every game 10,000 times, the model is high on the Philadelphia Eagles (-7.5, 43.5), even without A.J. Brown (hamstring), to cover against the New York Giants on Sunday. The Eagles will look to avenge a 34-17 loss to the Giants on 'Thursday Night Football' in Week 6. Philadelphia rebounded with a 28-22 win over the Minnesota Vikings on Sunday as Jalen Hurts completed 19 of 23 passes for 326 yards and three touchdowns. New York, meanwhile, blew a 19-point lead in the fourth quarter and dropped a 33-32 decision to the Denver Broncos.The Giants are led by rookie quarterback Jaxson Dart, who threw for 283 yards and three touchdowns with one interception in the loss at Denver. That came on the heels of his 17-for-25 performance for 195 yards and one touchdown in the win over the Eagles on Oct. 9. Cam Skattebo nearly rushed for 100 yards against Philadelphia. In that game, he carried 19 times for 98 yards and three touchdowns. The model has Philadelphia winning outright well over 70% of the time and covering in well over 50% of simulations. See which other NFL parlay picks to make here, and bet the Eagles to cover here:How to make Week 8 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 8 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 8 NFL picks, and which NFL matchups should you target for an epic 25-1 payout? Visit SportsLine now to see the Week 8 NFL best bets from a model on a 43-28 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 8 NFL parlay, predictions, bets: These 5 picks could return around +2500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/03/3bc757ee-b265-4efe-964a-676f12dfbb0d/thumbnail/1200x675/69989ce6f18a434694165efb39c697f2/devonta-smith-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-10-25T19:01:20.000Z",
      "dateModified": "2025-10-25T19:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]