[
  {
    "title": "Floyd Mayweather vs. Manny Pacquiao fight: Rematch at The Sphere in Las Vegas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/floyd-maywether-manny-pacquiao-fight-rematch-sphere-las-vegas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/472db6f6-34d0-4321-bb08-84ae79325535/thumbnail/1200x675/752bfc7640b36581d2cad157ea7e1e5f/floyd-mayweather-manny-pacquiao-getty.jpg",
    "tag": "Sports",
    "date": "2026-02-23T22:03:19.000Z",
    "description": "\n        Manny Pacquiao and Floyd Mayweather are set to run back one of the biggest fights in boxing history. Mayweather and Pacquiao will rematch in ",
    "body": "\n        Manny Pacquiao and Floyd Mayweather are set to run back one of the biggest fights in boxing history. Mayweather and Pacquiao will rematch in a Sept. 19 clash from The Sphere in Las Vegas, as announced by Netflix, with the streaming service set to air the event.The first meeting between Pacquiao and Mayweather took years of negotiation to come together, as both fighters were on top of the boxing world. The fight eventually happened in May 2015. Mayweather won the fight by clear unanimous decision, with the fight reportedly drawing more than 4.5 million pay-per-view buys, making it a massive success, though the fight itself disappointed many due to a general lack of action.\nNegotiations for the first meeting began in early 2010, though those plans fell apart when the two sides could not come to an agreement on drug testing for the fight.Drug testing would continue to be a sticking point as negotiations would continue as time passed. Between the type of drug testing, with Mayweather wanting \"Olympic-style\" testing, or timing, with Pacquiao refusing testing that went beyond 14 days prior to the bout, testing remained an ongoing sticking point as the negotiations dragged on for years.\nOver the past few years, the idea of a rematch has popped up repeatedly, though it never seemed to gain much momentum until recent months, when interest was ignited once again.After a controversial semifinal loss in the 1996 Olympics that ultimately led to winning a bronze medal, Mayweather turned professional, going on to hold world championships across five weight classes. Mayweather's championship accomplishments are slightly eclipsed by Pacquiao, who remains the only boxer to have won world championships in eight different divisions.Pacquiao, 47, ended his retirement in July 2025, facing Mario Barrios for the WBC welterweight title. That fight, Pacquiao's first professional bout since a WBA welterweight title loss to Yordenis Ugas in August 2021, ended in a majority draw but showed Pacquiao to still have some of his signature speed and power.\nMayweather, 48, has not fought professionally since a TKO win over UFC superstar Conor McGregor in August 2017. The win over McGregor allowed Mayweather to enter retirement with a sparkling 50-0 record.Both Mayweather and Pacquiao have participated in various exhibition bouts in the years since entering retirement. Mayweather is currently planning another exhibition, this time against Mike Tyson, in an event that was recently announced as a final tune-up before returning to the professional ranks.Likewise, Pacquiao recently announced an April exhibition against Ruslan Provodnikov in what will be his own tune-up ahead of the clash with his former rival.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Floyd Mayweather vs. Manny Pacquiao fight: Rematch at The Sphere in Las Vegas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/472db6f6-34d0-4321-bb08-84ae79325535/thumbnail/1200x675/752bfc7640b36581d2cad157ea7e1e5f/floyd-mayweather-manny-pacquiao-getty.jpg"
      ],
      "datePublished": "2026-02-23T22:03:19.000Z",
      "dateModified": "2026-02-23T22:03:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drew McIntyre says he was set to face John Cena on retirement tour before it was scrapped - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/drew-mcintyre-john-cena-match-retirement-tour-aj-styles-crown-jewel/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/d507267f-d980-4a42-8a0c-80d95a594b85/thumbnail/1200x675/dd4689d04032437d1200205c637f662d/drew-mcintyre-john-cena-wwe-2019.jpg",
    "tag": "Sports",
    "date": "2026-02-23T21:58:45.000Z",
    "description": "\n        John Cena vs. AJ Styles was the pinnacle of Cena's retirement tour  for many fans. Their showdown at WWE Crown Jewel is regarded as one of  t",
    "body": "\n        John Cena vs. AJ Styles was the pinnacle of Cena's retirement tour  for many fans. Their showdown at WWE Crown Jewel is regarded as one of  the best matches of the year. However, the original plan for Crown Jewel  was for Cena to face Drew McIntyre.Cena recently told the \"No-Contest\" podcast that Cena vs. McIntyre was slated for WWE's  October pay-per-view. However, the promotion pivoted to Styles after  Cena tweeted out \"The Phenomenal\" one's name. The fan response to Cena's tweet seemed to spur a different outcome than what was originally planned for McIntyre.\"I knew enough,\"  McIntyre told CBS Sports of the original plan at the WWE 2K26 hands-on event in Stamford. \"I keep my head down and  keep working no matter what happens. I can't take his phone and say,  'Just tweet my name.'\"\nIt was another blow for McIntyre, who  spent the last few years putting on acclaimed performances but consistently losing big matches. He had campaigned for a  coveted spot on Cena's retirement tour, seeking to prove once more that  he was on par with the top stars who kept beating him. \n\"I can't  change the creative direction,\" McIntyre said. \"I talked about getting a match  with Cena.  Getting a situation on the microphone with Cena to prove what  I'm  capable of because I want to compete with the best. He was the  best on  the microphone. I heard the quote John gave. \"Whatever people  weren't  feeling or going on, they decided to pivot. He outright asked  if the  people wanted AJ. The match was incredible. I could sit there  and go,  'Damn, what if he tweeted my name?' But the reality is he's  retired, and  I'm world champion, so it worked out fine for Drew  McIntyre.\"To his point, McIntyre conducted the interview with the undisputed WWE championship slung around his shoulder. It's not McIntyre's first world title reign, but it's his most validating. His first world title reign played out in front of empty seats during the pandemic. His second barely lasted five minutes. Now, McIntyre heads into WrestleMania 42 -- where tens of thousands will pack Las Vegas' Allegiant Stadium on April 18 and 19 -- as the defending WWE champion.\nHe's worlds apart from the boy band cosplayer who was released from WWE in 2014. The Cena setback was another reminder of a lesson he learned many times: control the controllable and keep moving.\"Things happen the way they're supposed to,\" McIntyre said. \"Many times I've been frustrated. I knew something was the right thing to do. But you have someone like Triple H leading the charge.\"WWE 2K26 is available worldwide on March 13. Fans who purchase any of  the three special editions -- King of Kings, Attitude Era, or Monday  Night Wars -- can access the game on March 6.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drew McIntyre says he was set to face John Cena on retirement tour before it was scrapped - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/d507267f-d980-4a42-8a0c-80d95a594b85/thumbnail/1200x675/dd4689d04032437d1200205c637f662d/drew-mcintyre-john-cena-wwe-2019.jpg"
      ],
      "datePublished": "2026-02-23T21:58:45.000Z",
      "dateModified": "2026-02-23T21:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League Power Rankings: Juventus in crisis, Arsenal top - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-power-rankings-juventus-crisis-arsenal-barcelona-top/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/2038aedf-aee9-40d3-abfe-140191c6ab39/thumbnail/1200x675/1983809fc8c0649ff441db5c08ba0a7f/power-rankings-soccer-ucl-template-3.png",
    "tag": "Sports",
    "date": "2026-02-23T20:44:57.000Z",
    "description": "\n        The 2025-26 edition of the Champions League returns this week when the 16 teams involved in the playoffs take the stage across Europe, compet",
    "body": "\n        The 2025-26 edition of the Champions League returns this week when the 16 teams involved in the playoffs take the stage across Europe, competing for the remaining eight spots left in next month's knockout. Some of Europe's biggest teams are currently shining, such as Arsenal and Bayern Munich, while others will also contend for one of the most prestigious tournaments in the world of soccer. Let's take a look at our weekly power rankings:           1. Arsenal (--)    The side coached by Mikel Arteta is at the top of the Premier League standings once again after an incredible performance in the North London Derby, beating Tottenham 4-1 away from home. Could this finally be their season? They are currently the favorites to win the Premier League for the first time in more than 20 years, but the last weeks of the season will be crucial ones, both domestically and in Europe. Get ready for the Knockout Stage like never before with the UEFA Champions League Bracket Games! Create a pool to compete against friends or enter our Bracket Challenge for a chance to win a dream trip to London, including 2 UCL tickets and a tour of the UCL Today set! Plus, see how you stack up against UCL Today's own Jamie and Micah. Sign up now before brackets are unlocked after the Round of 16 Draw, or play on the CBS Sports App!    2. Bayern Munich (--)If there is one team that is having a better season than Arsenal that's Bayern Munich. The team managed by Vincent Kompany is at the top of the Bundesliga table with a solid margin over Borussia Dortmund, an 8-point gap that seems almost impossible to decrease. This Saturday, the two German giants will meet for the Der Klassiker, the most anticipated match of the Bundesliga season, one that will tell us if there is still something to watch in the coming weeks. \n3. Barcelona (+1)The Spanish team is back at the top of the LaLiga standings after Real Madrid's defeat against Osasuna over the weekend. It's difficult to predict what will happen next as Hansi Flick's side has had so many ups and downs over the past weeks. Still, they are competing in all competitions and can potentially win at least one of the big trophies they continue to compete for. 4. PSG (-1)PSG are back, and this is something we've been waiting for over the past few weeks. The 2024-25 Champions League winners had a slower start to the season due to injuries, and the latest one, to 2025 Ballon d'Or winner Ousmane Dembele, will definitely have an impact on the key weeks of the season, but facing AS Monaco in the playoffs won't be an issue, as the first leg already showed it to us. 5. Real Madrid (+1) Despite the chaotic match against Benfica last week and the disappointing defeat against Osasuna over the weekend, Real Madrid are still close to the top of the LaLiga standings and are in a good spot ahead of the second leg of the playoffs against Benfica, taking place on Wednesday at the Bernabeu. \n6. Manchester City (+1)It hasn't been the best season under Pep Guardiola for Manchester City. Still, they are only five points behind Arsenal in the Premier League standings, and in the top eight teams of the league phase of the Champions League. They are in the race for another trophy under Guardiola without knowing if he will be in charge next season—something they need to resolve as soon as possible. 7. Inter (-2)While the Nerazzurri are dominating the Serie A season with a ten-point margin on AC Milan, they suffered a 3-1 defeat against Bodo/Glimt last week in Norway, which will force them to make a comeback on Tuesday in Milan. They should make it, but it's not what we expect from the team managed by Cristian Chivu.   8. Chelsea (--) A second consecutive Premier League draw might raise a few eyebrows, especially against Burnley, but there's little real cause for concern. Liam Rosenior's side is proving to be consistently competitive. While the wins may not be flowing at the moment, the foundations are clearly in place. When the decisive moments of the season arrive, this is a team capable of rising to the occasion and delivering when it matters most. Let's be honest, we weren't expecting such an impact from the former Strasbourg coach. \n 9. Liverpool (--) Too many ups and downs for them this season, and that's why I don't see Arne Slot's side being competitive to win a trophy this year. It's a bit of a disappointment, especially after they spent so much money in the summer transfer window, and there were a lot of expectations around this team. Maybe too many. 10. Borussia Dortmund (+4)Last week's victory over Atalanta revealed a very different Borussia Dortmund compared to the side we had seen in recent months. It was another reminder of their European pedigree and ability to rise to the occasion on the continental stage. After reaching the 2024 Champions League final, where they were beaten by Real Madrid, Dortmund remain one of the most lively underdogs in the tournament. 11. Atletico Madrid (-1)This team can't win more than two games in a row. After losing 3-0 to Rayo Vallecano last week and then drawing 3-3 to Club Brugge in the first leg of the playoffs, Diego Simeone's side won 4-2 against Espanyol over the weekend. They obviously have potential, but they are too unpredictable to hope to win trophies in what could potentially be the last season with Diego Simeone in charge at the club.  \n12. Newcastle (+1)A strong but expected win against Qarabag away in the first leg of the playoffs is what we wanted to see from the side coached by Eddie Howe. They will advance to the knockouts, where it will be much different and more challenging.  13. Atalanta (-1)They definitely disappointed in the first leg against Borussia Dortmund, but knowing how well the team is playing under Raffaele Palladino, and after they won 2-1 against Napoli over the weekend, you shouldn't count them out. It'll be difficult, but they can do it. 14. Galatasaray (+3) Winning 5-2 against Juventus was incredible, and this is the kind of performance I was expecting from them since the start of the season in the Champions League. They've got one of the best strikers in the world in Victor Osimhen, and he showed it again. They just need to focus and bring home the unexpected result. \n\n        \n            \n                Champions League burning questions: Is Victor Osimhen a top three striker? Can Kylian Mbappe break records?\n                \n                    James Benge                \n            \n                            \n    \n                \n                    \n    \n15. Sporting CP (--)What they are doing is impressive, because staying close to Porto isn't an easy job to do this season in Portugal, as the team coached by Francesco Farioli won 20 games, drew twice, and only lost once, while Sporting CP are sitting in second place, four points behind the leaders. 16. Juventus (-5)What's going on at Juventus? After a run of encouraging results under Luciano Spalletti, the Bianconeri suddenly find themselves in crisis mode again. Three defeats in one week against Inter, Galatasaray and Como have reopened wounds that recently seemed to be healing. The return leg against the Turkish side now feels like a defining moment, not only for the squad but also for the Italian manager. 17 Bayer Leverkusen (+1)They are in a similar spot as Borussia Dortmund, even if they also have to perform domestically to qualify again for the Champions League next season. Facing Olympiacos in the playoffs will guarantee them a spot in the knockouts, if they don't ruin it in the second leg in Germany this week. \n   18. Tottenham (-2)New manager, same issues, and a 4-1 loss to Arsenal over the weekend in the North London derby. They should really start to worry about the relegation battle now. 19. Bodo/Glimt (+5) Another incredible European night for them. After beating Manchester City and Atletico Madrid, the Norwegian side won 3-1 against Inter. Their home stadium is becoming a real factor, but they can also perform in the second leg; the only question is if it will be enough against the 2025 Champions League finalists. 20. Club Brugge (+2)I was expecting them to be in this spot after a convincing 3-3 draw at home against Atletico Madrid. However, it will be more challenging to play in Madrid this week. \n 21. AS Monaco (-2) Despite a good start in the first half last week against PSG, they don't really have much chance to qualify against their French rivals. 22. Benfica (-2)Regardless of what happened between Gianluca Prestianni and Vinicius Jr., the 1-0 home defeat against Real Madrid probably put an end to their dreams.     23. Olympiacos (--)They could have done much better in the league phase and in the first leg against Bayer Leverkusen. It's probably too late now. \n24. Qarabag (-3)Last week I wrote, \"The biggest surprise of the league phase will meet Newcastle in the two-legged playoffs. Will they do it again?\" No, they haven't.   Teams eliminated  Olympique MarseillePafosUnion SGPSVAthletic ClubNapoliFC CopenaghenAjaxEintracht FrankfurtSlavia PragueVillarrealKairat\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League Power Rankings: Juventus in crisis, Arsenal top - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/2038aedf-aee9-40d3-abfe-140191c6ab39/thumbnail/1200x675/1983809fc8c0649ff441db5c08ba0a7f/power-rankings-soccer-ucl-template-3.png"
      ],
      "datePublished": "2026-02-23T20:44:57.000Z",
      "dateModified": "2026-02-23T20:44:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "U.S. women's hockey team declines invitation to attend the State of the Union - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/usa-womens-hockey-team-declines-invitation-state-of-the-union/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/db1eab05-413f-4198-95a3-616581504eab/thumbnail/1200x675/6cf7a04fad2d3eac13145688c96b0323/teamusawomenshockey.png",
    "tag": "Sports",
    "date": "2026-02-23T22:16:30.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The USA women's hockey team has declined an invita",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The USA women's hockey team has declined an invitation to attend Tuesday night's State of the Union, a day after President Donald Trump jokingly told the men's hockey team that he would probably be impeached if he also didn't invite the women's team. Scheduling conflicts was the reason for declining the invitation to attend the State of the Union, according to a USA Hockey spokesperson. \"We are sincerely grateful for the invitation extended to our gold medal–winning U.S. Women's Hockey Team and deeply appreciate the recognition of their extraordinary achievement,\" the spokesperson said. \"Due to the timing and previously scheduled academic and professional commitments following the Games, the athletes are unable to participate.\"The spokesperson added that the team was \"honored to be included and are grateful for the acknowledgment.\"Trump invited the men's team to the State of the Union during a call with the team shortly after their win over Canada. It is unclear whether the team will attend. \n\"I must tell you, we're gonna have to bring the women's team,\" he said. \"I do believe I probably would be impeached.\" Team USA made history at the 2026 Olympics by completing a sweep of hockey gold medals for the first time. The women's team won the gold for the first time in eight years after recording a 2-1 overtime win over Canada. Two days later, the men's team followed suit in nearly identical fashion after posting a 2-1 overtime win over Canada. The men's team captured their first gold medal since the 1980 \"Miracle on Ice.\" While the women's team trailed for most of regulation before tying the score in the third period, the men's team took an early lead before Canada tied things up in the second period. It remained tied throughout the third period before Zach Werenski fed Jack Hughes for the game-winning goal less than two minutes into overtime. \nThe women's golden goal was scored by Megan Keller, who had assisted on Hilary Knight's game-tying goal in the third period. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "U.S. women's hockey team declines invitation to attend the State of the Union - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/db1eab05-413f-4198-95a3-616581504eab/thumbnail/1200x675/6cf7a04fad2d3eac13145688c96b0323/teamusawomenshockey.png"
      ],
      "datePublished": "2026-02-23T22:16:30.000Z",
      "dateModified": "2026-02-23T22:16:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "10 storylines to watch during NFL combine week - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/10-storylines-to-watch-during-combine-week-nfl-draft/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/26/761b5c50-0b1c-46c9-ac4b-636c2b78ae03/thumbnail/1200x675/8760f80c5a554207b7903fd0ad515cff/getty-ty-simpson-alabama.jpg",
    "tag": "Sports",
    "date": "2026-02-23T20:35:46.000Z",
    "description": "\n        The NFL Scouting Combine will take place throughout this week in Indianapolis. It's one of the biggest events of the NFL calendar for several",
    "body": "\n        The NFL Scouting Combine will take place throughout this week in Indianapolis. It's one of the biggest events of the NFL calendar for several reasons, including but not limited to what actually takes place on the field during the measurements, testing and on-field workouts. Coaches, general managers, scouts and agents from across the entire league gather in Indy for the entire week, along with hundreds to thousands of media members. And that makes it a veritable hotbed for information, as much as anything else. And that's not just information related to the combine itself -- the free-agency and trade markets get started in earnest at the combine, too.There will be storylines aplenty to watch throughout the week because you'll rarely ever find so many of the league's decision makers and news breakers in the same place at the same time. So with that in mind, we wanted to give you a list of 10 of the biggest things to watch out for throughout combine week. Ty Simpson will throw at the combineSimpson is widely considered the QB2 in this draft class behind presumptive No. 1 overall pick Fernando Mendoza. Mendoza is not going to throw at the combine and will instead only work out at Indiana's Pro Day, so Simpson's work in the passing portion of the program is likely to be the most-watched aspect of the quarterback workouts. He potentially has a lot to gain (or lose) from the week of work, especially considering he doesn't have the most extensive track record as a starter at Alabama.\nArvell Reese's positionReese is listed by some as the top overall prospect in the draft -- even ahead of Mendoza. But he's also a bit of an interesting evaluation because we don't know how teams plan to use him. He played a lot of off-ball linebacker at Ohio State, but draft gurus think he could be even more dangerous on the edge. Which group he works out with, and whether he does the position drills with both groups, will make for interesting fodder.Rueben Bain's arm lengthBain is considered arguably the top edge rusher in this draft class (it's him or David Bailey, depending on how you classify Reese, as mentioned above), but he's also one of its most polarizing prospects. He plays with incredible power and has the production to match his reputation, but NFL teams prioritize measurements on the edge and Bain is likely to fall short of some bench marks when he has his arms measured. How short he falls and whether teams decide to care a lot about that will be one of the biggest stories of the week.Jermod McCoy's medicalsMcCoy is one of the top cornerback prospects in the class, but he sat out Tennessee's entire 2025 season due to a torn ACL suffered the previous season. While many observers focus on the measurements and the testing, the medical portion of the combine is actually the single-most important element when it comes to determining where players will ultimately be drafted. If McCoy's knee checks out, he'll remain a first-round pick and potentially go very early on; if it doesn't, he could slide.\n\n        \n            \n                Who are the biggest 2026 NFL combine snubs? History says don't count them out\n                \n                    Ryan Wilson                \n            \n                            \n    \n                \n                    \n    \nCan Brenen Thompson challenge a combine record?The Mississippi State wideout is a true speedster. He clocked speeds over 22 miles per hour during games in 2025 and supposedly hit over 23 miles per hour during the offseason. He's also a former track star who ran the 100 meters in 10.18 seconds in high school. He's expected to run a 40-yard dash in the 4.2 to 4.3-second range. Xavier Worthy owns the current record at 4.21 seconds. Top offensive linemanThere isn't much consensus about who is the top offensive lineman in the draft. Players like Miami's Francis Mauigoa, Utah's Spencer Fano and Caleb Lomu and Alabama's Kadyn Proctor are in the mix at tackle, but some think that Penn State guard Olaivavega Ioane could be the actual best offensive lineman in the class. How these guys measure up and how they test throughout the week could determine which of them (likely one of the tackles) comes off the board first.The quarterback carouselThe free-agent crop at quarterback isn't currently the most exciting group in the world. It basically consists of Daniel Jones, Aaron Rodgers and Malik Willis at the high end, and not much else that's all that attractive after that. But players like Kyler Murray could be available via trade, and others like Tua Tagovailoa, Kirk Cousins or Geno Smith could hit the market as cap casualties. Then there are backups like Joe Flacco and Marcus Mariota, and wild cards like Justin Fields who could become available as well. There are plenty of teams in need of quarterbacks, but not a lot of attractive options. Who is headed where and which teams are going to be left out, is something we'll learn more about as the week progresses -- even if the \"legal tampering\" period can't start for another few weeks.\nThe running back marketJavonte Williams has already been taken off the board with a three-year, $24 million deal from the Cowboys, but Breece Hall, Kenneth Walker III and Travis Etienne are still available to be signed in free agency. They're likely to command double-digit million dollars per year, given what Williams just got from Dallas, but we don't yet know where they'll land. Those rumors should heat up during combine week. Maxx Crosby trade rumorsCrosby is sure to be one of the hottest commodities to potentially hit the market this offseason. The situation between him and the Raiders seemingly got frosty toward the end of the year, with the superstar edge rusher getting shut down for the stretch run. We don't yet know if he's bought into Klint Kubiak's vision for the future of the team, or if he'd rather be traded somewhere with a better chance for immediate contention. We're likely to hear a whole lot about his future this week.George Pickens' Dallas futureThe Cowboys are widely expected to use the franchise tag on Pickens, who was named a Second Team All-Pro in 2025 after catching 93 passes for 1,429 yards and nine touchdowns -- all career highs. But just because they use the tag on Pickens, doesn't mean the Cowboys will bring him back to Dallas. If they're not willing to pony up a big-time contract and someone else is, Pickens could be on the move. We'll find out more about the situation as the offseason progresses. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "10 storylines to watch during NFL combine week - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/26/761b5c50-0b1c-46c9-ac4b-636c2b78ae03/thumbnail/1200x675/8760f80c5a554207b7903fd0ad515cff/getty-ty-simpson-alabama.jpg"
      ],
      "datePublished": "2026-02-23T20:35:46.000Z",
      "dateModified": "2026-02-23T20:35:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gunner Rivers, 4-star QB recruit and son of Philip Rivers, commits to NC State - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/gunner-rivers-4-star-qb-recruit-commits-nc-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/af034313-7b4f-4f24-8675-5f9675d09da5/thumbnail/1200x675/5a7e5e8598e7c6370c0d913afcc6d751/gettyimages-1244562016-1.jpg",
    "tag": "Sports",
    "date": "2026-02-24T00:28:29.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        NC State secured a commitment on Monday from quart",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        NC State secured a commitment on Monday from quarterback Gunner Rivers, the son of program legend and longtime NFL standout Philip Rivers, according to 247Sports. The four-star recruit and No. 42 overall prospect in the 2027 class is one of the 20 highest-rated commits in Wolfpack history.Rivers, a junior at Fairhope (Ala.) St. Michael, has been tied closely to NC State since last season. He completed a visit during the final week of the regular season when the Wolfpack thumped rival North Carolina in a 42-19 blowout and progressed through his recruitment in the months since, leading to his commitment nearly a year in advance of the 2027 class' National Signing Day.While Rivers also held offers from Auburn, Boston College, Miami and South Carolina, his familial link to NC State made the Wolfpack difficult to beat. Dave Doeren offered him a scholarship in May 2024, getting a head start on his recruitment after a strong freshman year of high school.Rivers plays for his father, who is the coach at St. Michael. He earned the starting job as a freshman and increased his production over the ensuing seasons, leading to a 2025 campaign in which he completed 237 of 343 passes for 3,176 yards and 46 touchdowns with five interceptions. He also ran 33 times for 196 yards and a touchdown. Rivers has yet to pass for fewer than 3,000 yards in a season.\nThe terrific junior season led Rivers to secure an ASWA Super All-State selection, and he was a finalist for the 4A Back of the Year award. He guided St. Michael to a 13-1 record and a semifinal berth in the state 4A playoffs for the second consecutive season.247Sports director of scouting Andrew Ivins evaluated Rivers last week and described him as a \"skilled passer with elite pedigree that has a chance to be a high-end distributor in college and beyond.\" Like his father, Rivers is described as having a \"shot put-like release\" and puts prolific touch on his passes. He is the No. 6-ranked quarterback in his class and has a chance to contend for five-star status during his senior year of high school.\nRivers will not suit up for NC State until the 2027 season but could be in line to contend for the starting job as a true freshman. Incumbent starter CJ Bailey has two more years of eligibility but could be a candidate to depart early for the NFL Draft, potentially opening the door for Rivers to contribute straight away.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gunner Rivers, 4-star QB recruit and son of Philip Rivers, commits to NC State - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/af034313-7b4f-4f24-8675-5f9675d09da5/thumbnail/1200x675/5a7e5e8598e7c6370c0d913afcc6d751/gettyimages-1244562016-1.jpg"
      ],
      "datePublished": "2026-02-24T00:28:29.000Z",
      "dateModified": "2026-02-24T00:28:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dynasty QB Rankings Update: February 2026 movers, Malik Willis watch, and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/dynasty-fantasy-football-rankings-february-is-the-calm-before-the-storm-at-the-quarterback-position/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/20/dfb953a4-55df-4a5b-8286-f063c839f8ac/thumbnail/1200x675/36655473ea549bc426b125be1ce9dac5/malik-willis-1.jpg",
    "tag": "Sports",
    "date": "2026-02-23T23:40:19.000Z",
    "description": "\n        Dynasty ranking changes from January to February are generally pretty minimal. They are mostly influenced by the smattering of news we get an",
    "body": "\n        Dynasty ranking changes from January to February are generally pretty minimal. They are mostly influenced by the smattering of news we get and my first run at 2026 Fantasy Football projections. This year, at quarterback, the changes in the rankings are almost completely nonexistent. Just don't get used to this static situation because before I release my March rankings, there are at least eight quarterbacks who could change uniforms and their Dynasty outlook radically altered.My way-too-early 2026 quarterback projections are here.The first two obvious names are Kyler Murray and Tua Tagovailoa. Both of their respective teams have new coaches and have expressed at least some interest in moving on from their very expensive quarterbacks. The risk of them not finding starting jobs has already been factored in to some degree, but it could be worse. For either of these quarterbacks, if their situations are unresolved a month from now, I will be more nervous. At the same time, if they find a new home as a starter in March, they could be risers. I am more optimistic both about Murray's chances of finding a starting job and his Fantasy upside if he does, which is why he is ranked considerably higher than Tagovailoa.Earlier in February, I had Jay Felicio from QB List on Fantasy Football Today Dynasty to discuss the state of the quarterback position. Check it out:\nThe free agent I am most interested in monitoring in the next month is Malik Willis. From my view, those two teams we just talked about, the Dolphins and the Cardinals, are the two most likely to give Willis a starter's contract in 2026. The path to him being a riser in the next month is if Willis receives a contract that offers him more long-term security than what Justin Fields received last year. These two coaching staffs have close connections to the Packers, so if anyone is willing to take that risk, it should be them. Over the past two seasons, Willis has thrown 89 passes and averaged 10.9 yards per attempt with six touchdowns and zero interceptions. Combine that with his rushing upside, and if Willis gets a three-year deal, he could vault into the top 20 in the rankings below.Other quarterbacks who could see the biggest gains or losses in the next month are Jacoby Brissett, Aaron Rodgers, Daniel Jones, and Geno Smith. Of course, we have no reason to expect Rodgers to make a decision that fast, and we'll have to wait until August at least to see how Jones' rehab is coming. One thing is for sure: We should expect far more changes in the Dynasty QB rankings next month than we got this month. We may even get to add Derek Carr back in if he decides to return to the NFL.I don't rank rookies until they are drafted, but I have already started to think about where I will put them. Assuming Fernando Mendoza is taken first overall by the Raiders, I anticipate he will rank somewhere between QB15 and QB18 in the rankings below. I would be surprised if any other rookie cracks the top 25.\nHere are my updated Dynasty QB rankings:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dynasty QB Rankings Update: February 2026 movers, Malik Willis watch, and more. - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/20/dfb953a4-55df-4a5b-8286-f063c839f8ac/thumbnail/1200x675/36655473ea549bc426b125be1ce9dac5/malik-willis-1.jpg"
      ],
      "datePublished": "2026-02-23T23:40:19.000Z",
      "dateModified": "2026-02-23T23:40:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Predicting Team USA's 2028 Olympic basketball roster: Who joins Kevin Durant? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/predicting-team-usa-2028-olympic-mens-basketball-roster-kevin-durant/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/5335952f-e21c-4712-b52f-e4a6e3fa8ae5/thumbnail/1200x675/f704fc514bb69a35ef19f5a517ce966a/durant-edwards-getty.png",
    "tag": "Sports",
    "date": "2026-02-23T23:43:48.000Z",
    "description": "\n        The 2026 Winter Olympics concluded on Sunday, and the NBA is already looking ahead to the 2028 games. Recently, four-time Olympian Kevin Dura",
    "body": "\n        The 2026 Winter Olympics concluded on Sunday, and the NBA is already looking ahead to the 2028 games. Recently, four-time Olympian Kevin Durant said that he wants to play for a historic fifth gold medal in Los Angeles. \"Hell yeah, I want to play,\" Durant said. \"I would love to, but I've got to stay on top of my game. I'm not expecting, I want to produce on the floor and make Grant (Hill) and whoever is making the decisions, want to put me on the team. I don't want -- not just for seniority. I want to still prove I can help the team win.\"Durant may ultimately deserve a spot on merit -- 2028 is still a ways away for a 37-year-old, but he is still an All-Star-caliber NBA player -- but if he wants a spot, it's his on seniority. He is the greatest Olympic basketball player of all time, and his skillset should age well enough and fits so smoothly next to other elite players that, short of significant injury- or age-related decline, it's hard to envision a scenario in which he wouldn't be able to help Team USA.But that exacerbates a first-world problem for Team USA: after years of fear about the American developmental pipeline, we're in the middle of a talent boom. The last handful of drafts have been very kind to American prospects, and when you consider all of the great existing American players who have already worn the red, white and blue, it suddenly gets very difficult to trim the roster down to 12 players. With Durant in place, there are really only 11 spots.So... who do we think is filling those other slots? We're going to take a shot at filling in the rest of the team. Keep in mind that we're still more than two years away here, so aging will be a factor. So will the stylistic differences between the NBA and FIBA game. Remember, FIBA has no defensive three-second rule, no goaltending and a shorter 3-point line, so shooting is at an absolute premium. Officials tend to call fewer fouls as well, allowing for more physicality defensively. We still have a ways to go before 2028, but for now, these are the players who make the most sense four Team USA's next Olympic roster.\nThe starsYes, yes, I know, almost everyone who plays for Team USA is going to qualify as a \"star.\" But every Olympic cycle reminds us this process is a bit more complex than slapping the 12 biggest names together. We just watched Jayson Tatum ride the bench in the 2024 run to gold while his less-accomplished NBA teammate, Derrick White, played a vital rotation role. The idea here is to grab a handful of the best players in the NBA and then use the rest of the roster to round out the team with specialists.Now, Durant will be on the team, but he will be 39 when the Olympics arrive. He's probably coming off of the bench. We'll address the bigs separately. Fortunately, the four other starters appear to be relatively straightforward at this point.Cade Cunningham is, at worst, the fourth-best point guard in the NBA. Shai Gilgeous-Alexander is Canadian, Luka Dončić is Slovenian and Stephen Curry likely won't be back as a 40-year-old in 2028. That leaves Cunningham as the obvious choice as our starting point guard. His playmaking should fit in quite well on an Olympic roster with far more offensive firepower than his Pistons, and his size and defensive versatility ensure he won't get picked on. This one's a no-brainer.Anthony Edwards won gold in 2024, has improved markedly as a shooter and post player since then and will turn 27 soon after the 2028 Olympics. He should be at the peak of his powers at this point and could easily be the best American player in the NBA. Once again, this one is obvious.Jayson Tatum really should have been one of the core members of the 2024 team. American Olympians usually only play once or twice before handing the baton to the next generation. Durant and LeBron James didn't do that last time, so that forced Tatum to the bench, where Steve Kerr seemingly determined that despite being a jack of all trades, he was not enough of a master at any single one to justify consistent specialist minutes off the bench. Well, with James presumably done competing for gold and Durant headed for the bench, Tatum's versatility alongside other stars suddenly looks a lot more valuable. Assuming he doesn't significantly decline as a result of his torn Achilles, he should still be a deserving starter. He was the best American forward in the NBA before he got hurt, and arguably the best overall American player.Cooper Flagg rounds out our core. We're admittedly doing some projecting here, but it feels relatively safe to do so. He's just the fourth rookie in NBA history to average 20 points, six rebounds and four assists. The first three were Michael Jordan, Larry Bird and Luka Dončić. Odds are, he'll be a special player by his third season. His defensive versatility and competitiveness should fit in quite well here.So let's take stock here. In Cunningham, Edwards, Tatum and Flagg, we have an enormous set of starters in which our smallest player, Edwards, is 6-foot-4. Defensively, this foursome should be stellar and capable of pretty much any scheme Erik Spoelstra wants to run. There's plenty of playmaking here too. Cunningham currently trails only Nikola Jokić for the NBA lead in assists, and Tatum and Edwards have both averaged at least five assists per game in a season despite not playing point guard. Throw in Flagg's passing and you have a really balanced group that can all set one another up.\nIf it's lacking anywhere, it's probably shooting, and that's only a minor blemish. Cunningham is roughly a 34% shooter from deep, Flagg is at around 30%, and while Tatum is typically a reliable shooter, his jumper seemingly abandoned him during his last run with Team USA. Fortunately, we have a wide pool of American players to choose from to fill in that \"gap\" and round out the rest of the team. Let's start with the big men, who deserve their own category. Fortunately, there isn't really a shortage of American bigs who can shoot.The bigsOur first center choice is easy. We want a big who can shoot? Chet Holmgren is roughly a 37% 3-point shooter. Problem solved. That he's also a perpetual Defensive Player of the Year candidate is a nice bonus. He's not a great rebounder, but having Tatum and Flagg at forward should help offset that minor deficiency, and besides, we have two more big slots at our disposal here. We can stylistically cherrypick from this point on.Rebounding largely fits into the broader need for physicality. Serbia gave Team USA its biggest test in 2024, so winning in 2028 means having an answer for Nikola Jokić. Alperen Sengun, Domantas Sabonis and Giannis Antetokounmpo loom as possible opponents here as well, and though he plays differently, Team USA needs as many stylistic options as it can find to throw at Victor Wembanyama. So for our second big slot, we're looking for a bit of heft.\nThis isn't something the American hoops pipeline tends to deliver much anymore, but we fortunately have a pretty straightforward choice here. It's Jalen Duren. He comes with baked in chemistry with Cunningham, he rebounds, and although the sample in the modern NBA is always going to be fairly small, his numbers defending the post have by and large been excellent. Over the past three seasons, he has been in the 75th percentile or better at post up points allowed per possession. Again, tiny sample, but it checks out. When you're as strong as Duren, you're probably going to be tough to score on near the basket.The third spot comes down to two names, and they're pretty similar players. Both Bam Adebayo and Evan Mobley are enormously versatile defensive big men who have improved meaningfully as shooters in recent years and can create some of their own looks. The standard aging curve would suggest that Mobley, who will be 27 when the Olympics roll around, is likely to be better at that point than Adebayo, who will be 31. He might even be better now. But Erik Spoelstra is coaching this team, and he's probably going to lean toward the player he's more comfortable with, which would surely be the one he's coached in Miami for almost a decade now. It wouldn't hurt to have a bit more Olympic experience on this roster, so Adebayo's 2024 run is a plus as well. If it's a tie or close to it, he's probably going to win. If he's declined at all by then, though, Mobley is ready to go.The supporting castSo right now, we have eight spots locked up: Durant, Cunningham, Edwards, Tatum, Flagg, Holmgren, Duren and Adebayo. There are three pretty straightforward roles we need to fill with our four remaining slots: backup point guard, designated shooter and designated defender.\nTyrese Maxey is our backup point guard. His speed and shooting contrasts nicely with the bigger Cunningham, giving Team USA a curveball to throw at opposing bench lineups. The name of the game here is versatility, and Cunningham and Maxey just complement each other perfectly.Kon Knueppel is the clear designated shooter choice. He's leading the NBA in made 3-pointers as a rookie. He's averaging eight 3-point attempts per game, and the only players to shoot a higher percentage from deep on that volume in a season are Stephen Curry and Duncan Robinson. He's on track to succeed Curry as the best shooter in the NBA, so if we're looking for one, pure shooter for the roster, he's our guy.Amen Thompson is our defensive specialist. This was the trickiest choice. He just checked the most boxes. He's perhaps the NBA's best athlete, he's 6-foot-7 with a seven-foot wingspan so he's positionally versatile, and FIBA's whistle should be very kind to him given how physically he likes to play.We'll get into some of the other players I considered for those slots in the snub section, but for now, we have one last slot to fill. It's a tricky one. There's no specific need we're looking to address here. We've checked every positional box, and because of how big some of our guards are, there's not really an impetus to seek out size here either. It's just a matter of picking the best available American player.Now, this could change in the next two years, but I believe at this point the best available American player is Donovan Mitchell. He'll be closing in on his 32nd birthday by then, so decline is a real possibility, but he still hasn't played and 2028 will probably be his last realistic chance. He's a seven-time NBA All-Star. Every other active player to be chosen to that many All-Star teams has at least been chosen by Team USA, though Kawhi Leonard dropped out due to injury. He finished fifth in MVP voting last year and just ranked seventh in ESPN's latest MVP straw poll for this season. Only two Americans finished above him, Cunningham and someone we'll get to in a moment. Purely as an individual, he is the most accomplished American player without a gold medal.So Mitchell is the pick to round out the roster. That leaves us with the following 12-man team...\nThe final rosterPoint guardCade CunninghamShooting guardAnthony EdwardsSmall forwardJayson TatumPower forwardCooper FlaggCenterChet HolmgrenGuardTyrese MaxeyGuardDonovan MitchellGuardKon KnueppelForwardAmen ThompsonForwardKevin DurantCenterBam AdebayoCenterJalen DurenThe snubsSo, we mentioned one other American player who just outranked Mitchell in the MVP straw poll. That would be Jaylen Brown. In pure basketball terms, he would be a reasonable choice. He's having the best season of his career, he played for Team USA in the FIBA World Cup, and our roster does lean a bit more toward guards than forwards.Ultimately, the prediction was informed by two factors. The first is that I simply think Mitchell is slightly better. In the best year of Brown's career, he and Mitchell are still basically even in terms of scoring volume. Brown is the better defender given his size, but Mitchell is a better playmaker, is more efficient and beats Brown in most of the all-in-one metrics pretty meaningfully. They're close enough that if there was a specific need for something Brown did, he'd be a fair choice. But if that were the case, we would have carved out a specialist slot for him and we didn't.The other factor was politics. Brown criticized Team USA in 2024 for his belief that it allows Nike influence over roster decisions. Whether that's true or not, it's a headache Team USA would probably prefer to avoid. If we were talking about a foundational part of USA Basketball, that would be one thing, but for one of the last slots on the roster, the tie is probably going to go to someone else.The other candidate for the final, \"best available American player\" slot was Jalen Williams. He's not the individual creator Brown is, but he's a better defender and on the right side of the aging curve. He's having a down year as he recovers from a wrist injury, but it's reasonable to assume that he'll at least bounce back to the level he played at last season, when he was an All-NBA choice. If USA Basketball wants a forward for this last slot, he's the easy pick. But in a tie, I'm giving the edge to the older player. Williams will have more chances.Backup point guard was a nightmare. Tyrese Haliburton was on the 2024 team, though he barely played. Jalen Brunson missed the cut, and he reportedly wants another shot in 2028. Either would have been worthy choices. But the guard pool is so deep that, with two years out, I'm inclined not to gamble on what Haliburton looks like post-Achilles tear. I'm a bit more comfortable with Tatum, a forward, looking mostly like himself after that injury compared to Haliburton, a guard. Brunson is the oldest of the three, right in the same range as Mitchell, but his playing style is a bit more tailored to the NBA given his mid-range mastery and defensive vulnerability at his size. Both were agonizing cuts, especially given how well Haliburton's passing fits into the FIBA game, but we only have 12 spots.Devin Booker didn't really fit into a neat box, but he was another brutal cut considering how well he played in 2024. But Mitchell has outplayed him for several years now, and we've now had two full seasons of subpar 3-point shooting out of Booker, so he wasn't going to get any consideration in the designated shooter slot. He's not beating players off of the dribble quite as easily anymore either, so I'd be a bit concerned with how he'll look in two-and-a-half years.I could have gone in so many different directions for the designated defender slot. Jalen Suggs isn't durable enough. Herb Jones doesn't do enough offensively. Alex Caruso is too old. Cason Wallace is too small. The two players that most seriously challenged Amen Thompson were his brother Ausar and Stephon Castle. In the end, Amen's offensive advantage over his brother and his slight size advantage over Castle were the tiebreakers. Castle is certainly better on offense than Thompson, though, and if either of them can just get to passable as a 3-point shooter, that would make picking a winner easier. Speaking of shooting, that was what kept Scottie Barnes off the team. He could qualify as a defensive specialist, though he's obviously more well-rounded than that overall. This team just already has enough of what he does offensively, and Thompson is an easier fit in the on-ball defensive role we're looking to fill.The only other big man I gave any consideration to was Walker Kessler. He hasn't played much this season due to injury, but he played for Team USA in the 2023 World Cup and he checks the same size and physicality boxes that Duren does. Duren's growth into an All-Star this season made him the clear choice for this role on the team, but I'm keeping an eye on Kessler just on the faint hope that his experiments with 3-point shooting ever bear fruit. If he ever learns to shoot at his size, he'd be a great FIBA player, so watch out over the next two years.And then there are the youngsters. I don't think Reed Sheppard is going to catch Knueppel, but he was a similarly gifted college shooter. The 2025 draft class is promising enough that some of these players, like Cedric Coward or Derik Queen, may be heard from in the years to come. And of course, we have three enormously promising American youngsters coming in June in Darryn Peterson, AJ Dybantsa and Cam Boozer. Making the team after only two years as a professional is rare, but not unheard of. Keldon Johnson made the cut after his rookie season in 2020, and Anthony Davis played for Team USA before he even played in the NBA. Neither played major roles in the Olympics, but both won gold medals, so we can't rule the upcoming rookies out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Predicting Team USA's 2028 Olympic basketball roster: Who joins Kevin Durant? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/5335952f-e21c-4712-b52f-e4a6e3fa8ae5/thumbnail/1200x675/f704fc514bb69a35ef19f5a517ce966a/durant-edwards-getty.png"
      ],
      "datePublished": "2026-02-23T23:43:48.000Z",
      "dateModified": "2026-02-23T23:43:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chargers' O-line heading toward huge overhaul with Bradley Bozeman's retirement - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/los-angeles-chargers-bradley-bozeman-retires-offensive-line-overhaul/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/d2869059-ede4-4a86-b501-48f9561e5c77/thumbnail/1200x675/63983fa13c18a3b4108e9be7f01ab477/bradley-bozeman-chargers.jpg",
    "tag": "Sports",
    "date": "2026-02-23T22:55:49.000Z",
    "description": "\n        Los Angeles Chargers center Bradley Bozeman, 31, announced Monday on Instagram that he is retiring.\n\n\"This game has given me so much — lesson",
    "body": "\n        Los Angeles Chargers center Bradley Bozeman, 31, announced Monday on Instagram that he is retiring.\n\n\"This game has given me so much — lessons, lifelong friendships, and memories my family will carry forever,\" Bozeman wrote as part of his caption. \"I've poured everything I had into this journey, and I walk away grateful and proud.\"Thank you to every teammate, coach, and fan I was blessed to cross paths with along the way. Thank you to my amazing family who supported me every step of this journey, to my three amazing kids — Brody, Bailey, and Boone — who made every sacrifice worth it, and especially to my unbelievable wife, my ride or die from the very beginning. I couldn't have done any of this without you!\"A sixth-round pick of the Baltimore Ravens in 2018 out of Alabama, Bozeman spent his first four years in Baltimore before joining the Carolina Panthers for 2022 and 2023. He joined the Chargers ahead of the 2024 season on a two-year deal and was set to become a free agent this offseason. Bozeman started in 33 of the Chargers' 34 regular-season games over the past two years but struggled in 2025, finishing last in Pro Football Focus' center grades.\nChargers set to overhaul offensive lineWith Bozeman retiring, left guard Zion Johnson hitting free agency and right guard Mekhi Becton coming off a disappointing first season in Los Angeles, the Chargers are in line to make major moves among their offensive line, which was among the NFL's worst in 2025.Chargers OL who played at least 500 snaps in 2025PFF position rankOT Jamaree SalyerT-55th out of 70OT Trey Pipkins67th out of 70OT Bobby Hart68th out of 70OT Austin Deculus70th out of 70OG Zion Johnson47th out of 66OG Trevor Penning56th out of 66OG Mekhi Becton65th out of 66C Bradley Bozeman34th out of 34The Chargers finished 31st in pass blocking and 32nd in run blocking in Pro Football Focus' grades.\n        \n            \n                Justin Herbert still hasn't won a playoff game. How much is his fault, and how can the Chargers change that?\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nWith new offensive coordinator Mike McDaniel arriving and tackles Joe Alt and Rashawn Slater returning from injury, the interior of the offensive line will be a particular focus. Los Angeles has over $78 million in effective cap space, per Over The Cap. Only the Tennessee Titans have more. The Chargers also have the 22nd pick in the NFL Draft.\nJustin Herbert took 54 sacks -- one shy of the league lead -- and was pressured on an NFL-high 42.8% of his dropbacks in 2025.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chargers' O-line heading toward huge overhaul with Bradley Bozeman's retirement - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/d2869059-ede4-4a86-b501-48f9561e5c77/thumbnail/1200x675/63983fa13c18a3b4108e9be7f01ab477/bradley-bozeman-chargers.jpg"
      ],
      "datePublished": "2026-02-23T22:55:49.000Z",
      "dateModified": "2026-02-23T22:55:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs part ways with two-time Super Bowl champion pass rusher ahead of free agency - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-part-ways-with-two-time-super-bowl-champion-pass-rusher/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/6c097a9a-45de-4473-8943-7655911f26af/thumbnail/1200x675/351afe25338e95110974e2ad5be241a1/mikedanna.png",
    "tag": "Sports",
    "date": "2026-02-23T21:41:45.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Another notable name has entered the open market w",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Another notable name has entered the open market with NFL free agency just around the corner. Veteran pass rusher Michael Danna is now available after the Kansas City Chiefs decided to release him. Like every team, the Chiefs need to be in compliance with the NFL salary cap prior to 4 p.m. on Wednesday, March 11, which is the start of the new league year. The release of Danna is slated to free up $8.94 million of cap space, which leaves Kansas City $6.5 million over the cap. Danna, 28, spent each of his first six seasons with the Chiefs, who drafted him in the fifth round of the 2020 NFL Draft. In 87 regular season games, Danna has recorded 21.5 sacks, 194 tackles (25 for loss), six forced fumbles and one interception. He has two sacks and one forced fumble in seven playoff games. \nDanna's two best seasons with the Chiefs took place during Kansas City's back-to-back championship run during the 2022-23 seasons. In 2022, he recorded a then-career-high 5.0 sacks despite playing in just 13 games and not receiving a single start. The following season, Danna started in each of his 16 regular season games and recorded a career-high 6.5 sacks. \nThe last two seasons haven't been as productive, however. Specifically, this past season was Danna's least productive so far as he had just one sack and 25 tackles in 15 games. He did record his first career interception during Kansas City's Week 8 win over the Washington Commanders. \nExpect Danna to have a pretty active market in free agency. Among the teams that are most in need of help at pass rusher include the Cincinnati Bengals, Tennessee Titans, Buffalo Bills, New England Patriots, San Francisco 49ers, Las Vegas Raiders and Detroit Lions. \n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs part ways with two-time Super Bowl champion pass rusher ahead of free agency - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/6c097a9a-45de-4473-8943-7655911f26af/thumbnail/1200x675/351afe25338e95110974e2ad5be241a1/mikedanna.png"
      ],
      "datePublished": "2026-02-23T21:41:45.000Z",
      "dateModified": "2026-02-23T21:41:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League predictions: Can Juvents, Inter come back? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uefa-champions-league-expert-predictions-playoff-picks-juventus-inter-real-madrid/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/ae5c2dd5-c732-423e-bfa0-fb740b78e443/thumbnail/1200x675/ce2bf799bab5df0bafa9e487bfd518b2/untitled-design-2026-02-23t221635-714.png",
    "tag": "Sports",
    "date": "2026-02-23T21:21:59.000Z",
    "description": "\n        Eight teams will officially book their spots in the round of 16 this week as the UEFA Champions League's knockout phase playoffs come to a cl",
    "body": "\n        Eight teams will officially book their spots in the round of 16 this week as the UEFA Champions League's knockout phase playoffs come to a close with high stakes for a batch of Europe's top teams.Heavyweights Real Madrid and Paris Saint-Germain each carry a slender one-goal advantage as they return home to face Benfica and Monaco, respectively. Both teams have plenty of work to do in order to ensure a return to the last 16. Atletico Madrid, meanwhile, are deadlocked with Club Brugge after an entertaining 3-3 draw in Belgium last week, each side with a reasonable chance to advance.This week's action will also be a consequential week for Italy, as each of its remaining clubs is in danger of dropping out of the competition. Inter's clash with Bodo/Glimt will take center stage on Tuesday, while Atalanta will host Borussia Dortmund, each side carrying a two-goal disadvantage into their home legs. Juventus, meanwhile, host Galatasaray on Wednesday and are tasked with reversing a three-goal deficit after their unraveling in Istanbul last week.Here's what the CBS Sports team is predicting for a busy week in Europe's top club competition.\nDon't miss any of the Champions League. As always, you can catch all of our coverage across Paramount+, CBS Sports Network and CBS Sports Golazo Network all season long.     Tuesday's Champions League matchesMatch\n                    \n    \n                                            \n                    \n                                    James Benge\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chuck Booth\n                            \n            \n                    \n    \n                                            \n                    \n                                    Pardeep Cattry\n                            \n            \n                    \n    \n                                            \n                    \n                                    Francesco Porzio\n                            \n            \n                    \n    \n                                            \n                    \n                                    Roger Gonzalez\n                            \n            Atletico Madrid vs. Club Brugge2-12-12-12-12-1Leverkusen vs. Olympiacos1-21-11-03-01-1Newcastle vs. Qarabag3-04-03-05-04-0Inter vs. Bodo/Glimt2-13-12-14-03-0Get ready for the Knockout Stage like never before with the UEFA Champions League Bracket Games! Create a pool to compete against friends or enter our Bracket Challenge for a chance to win a dream trip to London, including 2 UCL tickets and a tour of the UCL Today set! Plus, see how you stack up against UCL Today's own Jamie and Micah. Sign up now before brackets are unlocked after the Round of 16 draw, or play on the CBS Sports App!Wednesday's Champions League matches Match\n                    \n    \n                                            \n                    \n                                    James Benge\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chuck Booth\n                            \n            \n                    \n    \n                                            \n                    \n                                    Pardeep Cattry\n                            \n            \n                    \n    \n                                            \n                    \n                                    Francesco Porzio\n                            \n            \n                    \n    \n                                            \n                    \n                                    Roger Gonzalez\n                            \n            Atalanta vs. Dortmund2-0 (Atalanta advance on penalties)0-01-02-11-1PSG vs. Monaco1-02-12-13-12-0Juventus vs. Galatasaray2-12-11-12-02-1Real Madrid vs. Benfica3-02-02-03-12-0 Underdogs who will make it throughJames Benge: Atalanta -- As will become apparent when you read on, the underdogs in this tie are really in the eye of the beholder, but what certainly can't be argued is that Atalanta are the outsiders after their 2-0 defeat in Dortmund. And yet their win over Napoli at the weekend was a sign of the cocktail of composure and quality that should give this team a fighting chance.  Pardeep Cattry: Bodo/Glimt -- While last week's 3-1 win over Inter came as a surprise, Bodo/Glimt have gone from strength to strength over the last year, learning how to navigate the challenges of European competition along the way. They have frazzled the likes of Manchester City, Atletico Madrid and now Inter in a matter of a few short weeks, creating a comfortable advantage as they travel to Milan and take on a team in desperate need of goals, but one may not be able to count on their top goalscorer to pitch in. The odds may still be in Inter's favor, but there's more than a small chance that Glimt can see things out in Italy, teasing an upset for the ages.  Francesco Porzio: Borussia Dortmund --I expected Atalanta to be the favourites in the playoff against the German side, but Borussia Dortmund claimed a 2–0 victory in the first leg at home, shifting the balance of the tie. It will now be a significant challenge for Raffaele Palladino's team to come back at the New Balance Arena in Bergamo on Tuesday. Despite their weekend Serie A win over Napoli, overturning a two-goal deficit against a side of Dortmund's caliber will require an outstanding performance.\n Chuck Booth: None? -- While technically Galatasaray should advance as underdogs, they never should've actually been considered to be underdogs in my opinion. The knockout stages are usually where feel-good stories come to an end, which brings us to Bodo/Glimt facing Inter. On the turf of their home stadium, Bodo have one of the biggest advantages of any European side at their home stadium, and even without Lautaro Martinez available, Inter will be able to turn this around. Favorites who will crash outJames Benge: Inter -- Even as Bodo/Glimt were celebrating perhaps the greatest European win in their history, you could feel the skepticism bubbling up inside yourself. Sure, Kjetil Knutsen's side did what they so often do on (artificial) home turf, but it would all fall apart under the bright lights of the San Siro. I'm not so sure. Bodo/Glimt are a decent counterattacking team and might have the energy and organisation to disrupt Inter. Also, as I understand it, Norwegians have been quite successful in the Milan area lately.  Pardeep Cattry: Juventus -- Last week was not a great one for Italy, and while Inter can still plot a path to the round of 16, Juventus may have dug themselves into a hole that's too deep to get out of. Luciano Spalletti's tactical innovations in attack have helped Juventus over the course of the season but it may not be enough against Galatasaray, who have a three-goal advantage and boast two talented goalscorers in Victor Osimhen and Mauro Icardi. The tie is now officially Galatasaray's to lose, and with their first round of 16 berth in 12 years within their reach, they probably won't throw it away now.  Francesco Porzio: Juventus -- The Bianconeri were expected to advance against Galatasaray despite playing the first match away, and that clash became a nightmare for the team coached by Luciano Spalletti, that lost 5-2. It will be a big challenge for Juventus to make a comeback in the second leg in Turin on Wednesday with Turkish talent Kenan Yildiz in doubt to play the second leg due to a minor injury.   Chuck Booth: Juventus -- No Gleison Bremer, no party. While there's a chance that the Brazilian defender may be available for this match, he's the heartbeat of the Juventus defense and needs to be at the peak of his powers for them to have a chance. Needing to win by three goals to even force extra time, this is a mountain that will be too high to climb, even with the match taking place in Turin.Game of the weekJames Benge: Atletico Madrid vs. Club Brugge -- Yeah, it might not have the superstar talent or the European Cup-winning pedigree, but Diego Simeone's side against a team they're expected to beat in this competition tends to mean one thing over these last few years: gripping psychodrama. This one is going to be tense and potentially error-prone. Secretly, that's what we all want.  Pardeep Cattry: Atletico Madrid vs. Club Brugge -- If last week's 3-3 draw in Belgium was anything to go by, Atletico Madrid and Club Brugge's meeting in the Spanish capital just might be the most fun match of the week. Each side has a well-documented ability to score goals and will come to the matchup with a vulnerable defense that should be easy for the opposing attack to take advantage of. Add to that the fact that both teams actually need to score on Tuesday, and, fingers crossed, we may just end up with a jam-packed match. Francesco Porzio: Real Madrid vs. Benfica -- All the eyes will be on the Bernabeu where Real Madrid will host Benfica for the second leg after the disgraceful incident that occurred last week in Lisbon between Benfica player Gianluca Prestianni and Vinicius Jr. The two will meet again on Wednesday in Madrid for what will be one of the most awaited clashes of the season, while Benfica manager and former Real Madrid coach Jose Mourinho will be suspended after receiving a red card last week in Lisbon. \n Chuck Booth: Real Madrid vs. Benfica -- Some of the intrigue around this game may be for unfortunate reasons, considering the events that took place in Portugal, but given the performances on the pitch by Vinicus Junior as of late, he's box office viewing at this stage. With Goals in four consecutive matches, he's in his best form of the season and has a point to prove facing Benfica, even if Jose Mourinho won't be on the sidelines. This is one where Real will absolutely look to run up the score even if they can advance to the round of 16 with a draw.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League predictions: Can Juvents, Inter come back? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/ae5c2dd5-c732-423e-bfa0-fb740b78e443/thumbnail/1200x675/ce2bf799bab5df0bafa9e487bfd518b2/untitled-design-2026-02-23t221635-714.png"
      ],
      "datePublished": "2026-02-23T21:21:59.000Z",
      "dateModified": "2026-02-23T21:21:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jalen Green can't replace Dillon Brooks, but the Suns need him to get buckets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jalen-green-dillon-brooks-suns-get-buckets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/fe67efb5-a538-4baf-a477-b1c7515d3d9d/thumbnail/1200x675/29356364576345ad7baac5c7c3097016/jalen-green-getty-1.png",
    "tag": "Sports",
    "date": "2026-02-23T20:12:59.000Z",
    "description": "\n        The Phoenix Suns have been one of the NBA's best stories this season, and Dillon Brooks has been at the heart of it. He's scoring at a rate (",
    "body": "\n        The Phoenix Suns have been one of the NBA's best stories this season, and Dillon Brooks has been at the heart of it. He's scoring at a rate (and in ways) we've never seen from him before on any kind of a consistent basis. He's defending, as always. His competitive prints are all over one of the grittiest teams in the league. And now he has a broken hand.There are bummers and there are bummers. This is the latter. Here's to hoping Brooks can get back in time for the playoffs/Play-In tournament (ESPN reports he'll be out 4-6 weeks), but in the meantime the Suns, who are also without Devin Booker (hip strain) for at least the next week, need to find a way to replace at least some of Brooks' 21 points per game. The natural next man for that job would be Jalen Green, who also came over from Houston with Brooks in the Kevin Durant trade. You're forgiven if you forgot Green even played for the Suns. He's missed most of the season with a hamstring issue that has refused to fully repair. But he's back and healthy (for) now. He had 26 points and four 3-pointers against San Antonio coming out of the All-Star break. On Saturday, he made up for a miserable shooting night by knocking down a fading corner 3 at the buzzer to beat the Magic in overtime. \nGreen is an electric athlete who had a legitimate superstar stretch last season in Houston, but he's never been a consistent shooter or anything close to an efficient scorer on the whole. He's only 24, but he's making $33.5 million. Next year that number rises to $36.2 million, and the year after that he has a $36 million player option as the first player to ever sign a 2+1 rookie extension on a nine-figure contract. It's a lot of money if Green doesn't pan out. But if he does, it has a chance to become a team-friendly deal. He's not going to defend like Brooks, if at all. He's not going to go to work in the post. But he'll never have a better opportunity to prove his value than right now, with the Suns badly in need of anyone who can contribute to the cause of recreating Brooks' production in the aggregate, particularly as a self creator. One of the notable strides Brooks has made this year is as a guy who can get buckets on his own; over 55% of his field goals have been unassisted. For better or worse, this is what Green does. Last season 63% of his non-garbage-time buckets were unassisted (that was the highest percentage for any wing in the league, per Cleaning the Glass). \nAgain, it's never been efficient. And so far it hasn't been with the Suns. On Sunday, Green cooked up a donut in the first half of Phoenix's loss to Portland and finished 1 of 7 from 3. So far this season he's averaging 13.3 points and shooting 38% from the field over 10 games. Small and randomized sample notwithstanding, that's obviously not going to cut it. \nBut don't be fooled, there is a big-time-scorer version of Jalen Green that is going to come out, and the Suns need it to be sooner than later. The dream of him turning into the actual superstar his talent theoretically suggests he could be is almost surely dead, but the question remains whether he can be winning player on a winning team. We've seen in in stretches, but the Rockets, all told, were more than eight points per 100 possessions better with him off the floor last season, per CTG. He's probably regarded as a negative asset at this point with $70 million in guaranteed money still on the books, but winning looks good on everyone. He's playing for another contract, be it in Phoenix or elsewhere. \nThese next six weeks aren't do-or-die for Green; he'll have a big opportunity next season, as well. But it has to start now. NBA perceptions can become sort of irreversible at some point, and Green is toeing that line as the dreaded empty-stats scorer. It just so happens that the Suns -- who are just two games back of the No. 6 Timberwolves with one head-to-head remaining and the tiebreaker already secured, but are also just two games up on the No. 8 Warriors -- are not in a position to consider any scoring stat empty without Brooks. They scored 77 points on Sunday. They need every bucket they can get. And if there's one thing Green can do, it's get buckets. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jalen Green can't replace Dillon Brooks, but the Suns need him to get buckets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/fe67efb5-a538-4baf-a477-b1c7515d3d9d/thumbnail/1200x675/29356364576345ad7baac5c7c3097016/jalen-green-getty-1.png"
      ],
      "datePublished": "2026-02-23T20:12:59.000Z",
      "dateModified": "2026-02-23T20:12:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kevin Durant plans to play for Team USA at 2028 Summer Olympics in Los Angeles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/kevin-durant-team-usa-2028-summer-olympics-los-angeles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/23/2ed620a1-5566-41f2-b915-955e7db9c525/thumbnail/1200x675/6c03a0d16711f81d3c1181860f486964/kevin-durant-olympics.jpg",
    "tag": "Sports",
    "date": "2026-02-23T20:10:32.000Z",
    "description": "\n        The 2028 Summer Olympics are still two years away, but athletes are already confirming that they intend to compete when Los Angeles serves as",
    "body": "\n        The 2028 Summer Olympics are still two years away, but athletes are already confirming that they intend to compete when Los Angeles serves as host. Four-time Olympic gold medalist Kevin Durant is one of those athletes, as he told ESPN that he has every intention to compete at the 2028 Games.\"Hell yeah, I want to play,\" Durant said. \"I would love to, but I've got to stay on top of my game. I'm not expecting, I want to produce on the floor and make Grant [Hill] and whoever is making the decisions, want to put me on the team. I don't want -- not just for seniority. I want to still prove I can help the team win.\"Durant will be just two months shy of turning 40 when the 2028 Summer Olympics happen, but if he maintains the level of play that we've seen this season over the next two years, there would be no reason to not include him on the Olympic roster.Health will certainly be a major factor in the matter, but Durant's been durable in each of the last three seasons including the current one, and if that trend keeps, he should be a no-brainer to make the roster. The way Durant plays lends itself to aging well in the NBA, and we've seen that in the years since he tore his Achilles in 2019. He's been an All-Star in six of the seven years since that injury cost him a full season in the NBA, and the outlier year was because he was limited to 39 games due to injury.\nDurant earning a roster spot on Team USA isn't the surprising part, it's that he still wants to compete in the Olympics. There was an assumption that the 2024 Paris Games would be the final year he, LeBron James and Stephen Curry would all compete with Team USA. James has already said publicly that he doesn't plan on suiting up for the 2028 Games. Curry hasn't said if he'll play, but he'll also be 40 by then.But Durant is letting us know that we were all wrong with that line of thinking.\"You guys, the media, have projected that,\" Durant said. \"That narrative, where did the last dance thing come from? I didn't say I wasn't playing. LeBron said he wasn't. You didn't hear that from me or Steph.\"For now we can pencil Durant's name in for the 2028 Olympic roster, which will certainly see some turnover with all the aging stars likely not participating. Cade Cunningham stated his desire to play in the 2028 Olympics in a recent GQ profile, while making the bold statement that he thinks he's the best American player. And will get some holdovers like Anthony Edwards, Jayson Tatum and Tyrese Haliburton, as well as several of the younger players who are just starting out like Rookie of the Year frontrunners Cooper Flagg and Kon Knueppel.\nTeam USA certainly won't be short on talent to pick from, but there's already this narrative that other countries are starting to catch up with them. The men's basketball team has won a gold medal in each of the last five Olympic Games, as they've been the far superior team in most cases in Olympic history. There's only been three times the U.S. men's basketball team hasn't won gold since 1936, so it's been an incredibly dominant run for them in the sport for a very long time.However, at the 2024 Games, teams like Serbia and France did put up a good fight against Team USA, and Canada's talent pool just continues to deepen with each passing year. The talent gap isn't as wide as it once was, but Durant thinks it's being overblown.\"I just don't like the talk around the USA versus European style of how you approach the game,\" Durant said. \"All I hear is, 'AAU is destroying the game; the Euros do it right while the Americans do it wrong.'\" \nDurant went on to talk about how he feels the conversation feels a bit racially charged in the way its discussed.\"It's a lot of bullshit with that,\" Durant said. \"I can read between the lines on that. It's a shot at Black Americans. We're controlling the sport. They're tired of us controlling the sport. 'France is coming for you.' Really? We smacked them boys.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kevin Durant plans to play for Team USA at 2028 Summer Olympics in Los Angeles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/23/2ed620a1-5566-41f2-b915-955e7db9c525/thumbnail/1200x675/6c03a0d16711f81d3c1181860f486964/kevin-durant-olympics.jpg"
      ],
      "datePublished": "2026-02-23T20:10:32.000Z",
      "dateModified": "2026-02-23T20:10:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dynasty Running Back Rankings: NFL Combine Updated Ranks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/dynasty-fantasy-football-running-back-rankings-2026-nfl-combine/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png",
    "tag": "Sports",
    "date": "2026-02-23T23:47:06.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first of the running back dominoes has fallen.",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The first of the running back dominoes has fallen. Javonte Williams is staying in Dallas on a three-year deal that assures he will be the starting running back at the beginning of the 2026 season. This is a big win for Williams, but you don't see a lot of movement in his Dynasty ranking below because it is also pretty much what I expect. Williams is still a low-end RB2 with high-end RB2 upside. The truth his that Williams' value did increase, but he is at the top of a tier and still behind Saquon Barkley and RJ Harvey who are at the bottom of the tier above him. But there are several free agent backs around him that could pass him in either direction in the coming month.Breece Hall seems likely to stay in New York with the Jets, as much as we are all hoping he won't. He remains my highest ranked free agent running back, at RB11, but the idea of him being stuck in New York for one more year does not make that ranking as appetizing. He's still just 24 years old and has posted at least 1,300 yards from scrimmage each of the past three years, but the Jets' lack of touchdowns has held down Hall's upside. I don't really expect that to improve much in 2026, but if they could sign a veteran QB who is more willing to dump the ball off to his backs, that would be a help.Check out my way-too-early look at running back projections for 2026 here.Travis Etienne and Kenneth Walker III are the other two top-20 Dynasty backs who don't have a team yet. So far all we have to go on with them is rumors and rumors of rumors. If you believe those, Walker won't be tagged by Seattle and Etienne would like to go to Kansas City. Uncertainty keeps these two backs just behind Williams for now, but a good landing spot could propel either of them in front of him. I'd also be happy with either of them returning to their former team, particularly if Zach Charbonnet misses extended time in Seattle next year.\nEarlier in February I had Dave Kluge from Footballguys on Fantasy Football Today Dynasty to discuss the state of the running back position in Dynasty. Check it out:Of course there are many other backs who could see wild swings in their value in the next month. Rico Dowdle, Isiah Pacheco, Rachaad White, Kenneth Gainwell, and Tyler Allgeier are just a few of them. While I am not sure any of them get starting jobs next year, they could absolutely torpedo a back that we are currently hoping will be a workhorse.As for the rookies, I have pretty low expectations for this class and won't be adding any of them to my Dynasty rankings until after the 2026 NFL Draft. Expect Jeremiyah Love to crack my top seven and don't expect any other rookies to crack my top 20, barring a surprise during the draft.\nHere are my updated Dynasty running back rankings:\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dynasty Running Back Rankings: NFL Combine Updated Ranks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png"
      ],
      "datePublished": "2026-02-23T23:47:06.000Z",
      "dateModified": "2026-02-23T23:47:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UNC has momentum after big win over Louisville, optimism for return of Caleb Wilson - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/north-carolina-unc-louisville-caleb-wilson-injury-score-analysis-game-recap/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/24/de692d89-3ec6-480a-8f86-7d15321aa022/thumbnail/1200x675/dc04f0cbe34b676dfc936f2232afd1f5/usatsi-28324306-1.jpg",
    "tag": "Sports",
    "date": "2026-02-24T05:15:02.000Z",
    "description": "\n        North Carolina passed a significant test without star forward Caleb Wilson on Monday night, as the No. 18 Tar Heels toppled No. 24 Louisville",
    "body": "\n        North Carolina passed a significant test without star forward Caleb Wilson on Monday night, as the No. 18 Tar Heels toppled No. 24 Louisville 77-74. The win improved the Tar Heels (22-6, 10-5 ACC) to 3-1 since Wilson suffered a fractured hand in a Feb. 10 loss at Miami. Between the uncertainty around Wilson's potential return and a subsequent injury to starting center Henri Veesaar, UNC's trajectory seemed uncertain less than a week ago. Those concerns were laid bare in blowout loss at NC State on Feb. 17.But Veessar's return in Saturday's win at Syracuse, Monday night's victory over a quality ACC foe and Wilson's apparent progression have steadied the waters in Chapel Hill. North Carolina hopes to have Wilson back for its regular-season finale against Duke on March 7, ESPN reported during the broadcast of the game .The Tar Heels are squarely in the hunt for a double-bye at the ACC Tournament and expected to remain a No. 6 seed in CBS Sports Bracketology on Tuesday following their sixth Quad 1 win.\nSeth Trimble paced North Carolina with a career-high 30 points as UNC kept Louisville at arm's length for most of the second half. The Cardinals closed within a possession on two occasions in the final minute, but a pair of Trimble free throws with nine seconds left helped UNC escape.\nIn his second game back since a two-game absence due to a lower-extremity Veesaar added 12 points for North Carolina. Mikel Brown Jr. paced Louisville (20-8, 9-6) with 24 points for the Cardinals.\n        \n            \n                Bracketology: Houston's Monday night showdown at Kansas is critical for Cougars' No. 1 seed aspirations\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nLight at the end of the tunnelGames against Virginia Tech and Clemson still await before Wilson's expected return. But the light is now at the end of the tunnel, and the Tar Heels are proving they can manage without their leading scorer and rebounder. Wilson, who is a potential top-five pick in the 2026 NBA Draft, averages 19.8 points, 9.4 rebounds, 2.7 assists and 1.4 blocks.\nIn his absence, UNC has leaned more on junior forward Jarin Stevenson and Montenegrin import Luka Bogavac. Both carried their weight against Louisville by combining for 21 points on 4 of 9 shooting from 3-point range.Seth Trimble's star gearWhile having Veesaar back and getting Wilson healthy are pivotal for North Carolina's aspirations, UNC's ceiling may ultimately be determined by the sort of guard play it gets in March. Trimble showed he can put UNC on his back, if needed, by turning in the best offensive game of his four-year Tar Heels career.His steal and breakaway dunk at the 13:38 mark gave North Carolina its biggest lead at 56-40. Trimble outplayed Louisville's formidable star tandem of Brown and Ryan Conwell, which was an accomplishment considering those two combined for 47 points. Once Wilson is back, less will be required of Trimble offensively. But this game was a reminder of his capabilities and could be a confidence booster for the team's third-leading scorer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UNC has momentum after big win over Louisville, optimism for return of Caleb Wilson - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/24/de692d89-3ec6-480a-8f86-7d15321aa022/thumbnail/1200x675/dc04f0cbe34b676dfc936f2232afd1f5/usatsi-28324306-1.jpg"
      ],
      "datePublished": "2026-02-24T05:15:02.000Z",
      "dateModified": "2026-02-24T05:15:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]