[
  {
    "title": "FIU Panthers vs. UTSA Roadrunners prediction, odds: 2025 First Responder Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/utsa-fiu-prediction-odds-time-2025-first-responder-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/29/933ec719-e1de-457a-9ca4-a184b30added/thumbnail/1200x675/b4fd89a133c868c6b54bde8e128ae696/owen-mccown-utsa-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T12:26:33.000Z",
    "description": "\n        Teams hit hard by the transfer portal meet when the Florida International Panthers face the UTSA Roadrunners in the 2025 First Responder Bowl",
    "body": "\n        Teams hit hard by the transfer portal meet when the Florida International Panthers face the UTSA Roadrunners in the 2025 First Responder Bowl on Friday night. FIU is coming off a 56-16 win at Sam Houston  State on Nov. 29, while UTSA dropped a 27-24 decision to Army that same day. FIU (7-5), who finished tied for fourth in Conference USA at 5-3, have won four in a row. UTSA (6-6), who tied for sixth in the American Conference, have won two of three. Both sides are expected to be down multiple key players due to injuries and the transfer portal, with FIU particularly decimated in the secondary. FIU's quarterback situation is a bit unclear as well after Keyone Jenkins and Joe Pesansky both dealt with injuries late in the season. Both are expected to play in some capacity on Friday. Kickoff from Gerald J. Ford Stadium in Dallas is at 8 p.m. ET. The Roadrunners are 5.5-point favorites in the latest FIU vs. UTSA odds, while the over/under for total points scored is 60.5 via SportsLine consensus. Before making any UTSA vs. FIU picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on FIU vs. UTSA. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for UTSA vs. FIU:FIU vs. UTSA                                                                                                                                                 spreadUTSA -5.5 at DraftKings SportsbookFIU vs. UTSA                                                                                                                                             over/under60.5 pointsFIU vs. UTSA                                                                                                                                                                                                                                                             money line UTSA -228, FIU +188FIU vs. UTSA                                                                                                                                                                                                                                                     picksSee picks at SportsLineFIU vs. UTSA                                                                                                                                                                                                                                                       streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make FIU vs. UTSA picksSportsLine's model is going Over (60.5) on the total. The Over has hit in six of FIU's last 10 games, and in seven of UTSA's last 10. The model has FIU quarterback Keyone Jenkins passing for more than 225 yards and two touchdowns, while UTSA quarterback Owen McCown is projected to throw for 290 yards and three touchdowns. The teams are projected to combine for 65 points as the Over clears in well over 50% of simulations. The model also says one side of the spread hits in well over 60% of simulations. You can see the model's pick at SportsLine.  So who wins FIU vs. UTSA, and which side of the spread hits in well over 60% of simulations? Visit SportsLine now to see which side of the FIU vs. UTSA spread to jump on, all from the advanced model that has simulated this matchup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FIU Panthers vs. UTSA Roadrunners prediction, odds: 2025 First Responder Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/29/933ec719-e1de-457a-9ca4-a184b30added/thumbnail/1200x675/b4fd89a133c868c6b54bde8e128ae696/owen-mccown-utsa-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T12:26:33.000Z",
      "dateModified": "2025-12-26T12:26:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northwestern vs. Central Michigan prediction, odds: 2025 GameAbove Sports Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/northwestern-central-michigan-prediction-odds-spread-time-2025-gameabove-sports-bowl-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/a6baef00-0e7b-42ed-9922-55eb45fc4726/thumbnail/1200x675/1f606f04bc20a9a67340ce5ff94e989c/preston-stone-northwestern-wildcats-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-26T16:05:28.000Z",
    "description": "\n        The Central Michigan Chippewas will battle the Northwestern Wildcats in the 2025 GameAbove Sports Bowl on Friday afternoon. Both teams closed",
    "body": "\n        The Central Michigan Chippewas will battle the Northwestern Wildcats in the 2025 GameAbove Sports Bowl on Friday afternoon. Both teams closed out their regular seasons on Nov. 29, with Central Michigan falling 21-3 to Toledo, while Northwestern was beaten 20-13 at Illinois. The Chippewas (7-5), who finished fifth in the MAC at 5-3, have won two of three. The Wildcats (6-6), who tied for 10th in the Big Ten at 4-5, have won five straight bowl games, tied for the third-longest active streak. CMU was 8-4 against the spread this season, while Northwestern was 6-4-2 ATS. Kickoff from Ford Field in Detroit is at 1 p.m. ET. The Wildcats are 10.5-point favorites in the latest Central Michigan vs. Northwestern odds, while the over/under for total points scored is 42.5, down a point from the opening line. Before making any Northwestern vs. Central Michigan picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Central Michigan vs. Northwestern. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Northwestern vs. Central Michigan:Central Michigan vs. Northwestern                                                                                                                                             spreadNorthwestern -10.5 at DraftKings SportsbookCentral Michigan vs. Northwestern                                                                                                                                         over/under42.5 pointsCentral Michigan vs. Northwestern                                                                                                                                                                                                                                                         money line Northwestern -431, Central Michigan +335Central Michigan vs. Northwestern                                                                                                                                                                                                                                                 picksSee picks at SportsLineCentral Michigan vs. Northwestern                                                                                                                                                                                                                                                   streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Central Michigan vs. Northwestern picksAfter 10,000 simulations of this matchup, SportsLine's model is going Over on the total (42.5). The Over has hit in three of Central  Michigan's last five games, and in four of Northwestern's last five. The model has Central Michigan running backs Nahree Biggins, Brock Townsend and Trey Cornist combining to rush for more than 150 yards and one touchdown, while Northwestern quarterback Preston Stone will throw for more than 225 yards and two touchdowns. The teams are projected to combine for 44 points, making the Over the slight value side.The model also says that one side of the spread hits well over 50% of the time. You can see the model's pick at SportsLine.  So who wins Northwestern vs. Central Michigan, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Central Michigan vs. Northwestern spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northwestern vs. Central Michigan prediction, odds: 2025 GameAbove Sports Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/a6baef00-0e7b-42ed-9922-55eb45fc4726/thumbnail/1200x675/1f606f04bc20a9a67340ce5ff94e989c/preston-stone-northwestern-wildcats-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-26T16:05:28.000Z",
      "dateModified": "2025-12-26T16:05:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texans vs. Chargers prediction, odds, time: NFL Week 17 Saturday picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/texans-chargers-prediction-odds-time-nfl-week-17-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/508f5f92-006b-4d58-9c6c-f3a7b1dfabdb/thumbnail/1200x675/b7d9e82b57a26f5ebddfcd56f0b29991/c-j-stroud-houston-texans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T11:35:39.000Z",
    "description": "\nSurging AFC teams will meet on Saturday as the Houston Texans visit the Los Angeles Chargers. Houston (10-5) is riding a seven-game win streak that i",
    "body": "\nSurging AFC teams will meet on Saturday as the Houston Texans visit the Los Angeles Chargers. Houston (10-5) is riding a seven-game win streak that is the longest active in the league and will clinch a postseason berth with a victory. Los Angeles (11-4) already has a playoff spot locked up and has won four in a row. This is a rematch of an NFL Wild Card game from Jan. 2025 in which the Texans prevailed 32-12.Kickoff is at 4:30 p.m. ET from SoFi Stadium in Inglewood, Calif. L.A. leads the all-time series 6-4. The latest Texans vs. Chargers odds have Los Angeles as a 1.5-point favorite, while the over/under for total points scored is 39.5 via DraftKings Sportsbook. Before making any Chargers vs. Texans picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Chargers vs. Texans. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Texans vs. Chargers:Chargers vs. Texans                                                                     spreadLos Angeles -1.5 at DraftKings SportsbookChargers vs. Texans                 over/under39.5 pointsChargers vs. Texans                                                                                                                                                                                 money line Los Angeles -130, Houston +110Chargers vs. Texans                                                                                                                                                                        picksSee picks at SportsLineChargers vs. Texans                                                                                                                                                                           streaming Fubo (Try for free)   \nWhy the Texans can coverThere's no hotter team in the league than Houston, winners of seven straight, while the team is 6-2 against the spread in the last eight games started and finished by C.J. Stroud. Houston has the league's top defense, ranking first in both points allowed and yards allowed, and it's a defense that Justin Herbert knows all too well. In the Jan. 2025 playoff game between these teams, Houston picked off Herbert four times, which is one more pick than Herbert had in the entire 2024 regular season. Speaking of turnovers, the Texans have committed an NFL-low of five giveaways during their 10-2 run over their last dozen games, and they're on pace to be the first team in 17 years to not allow 250 passing yards in a game. See which team to back at SportsLine. Why the Chargers can coverWhile the Texans have lost multiple games ATS during their winning streak, the same can't be said about L.A. which has covered in all four games of its four-game win streak. The Chargers have clinched a playoff spot, but they still has a huge incentive in front of them as they can get the No. 1 seed, and a bye, if they win out. Meanwhile, Los Angeles' defense has actually performed better than Houston's over the last two months as L.A. has given up a league-low of 254.5 total yards over the last eight games. The Chargers also have a big historical edge in regard to the spread, going 7-3 versus the line over their 10 all-time meetings. See which team to back at SportsLine.How to make Texans vs. Chargers picksSportsLine's model has simulated Chargers vs. Texans 10,000 times and is going Over on the total, projecting 42 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Texans vs. Chargers, and which side of the spread is the better value? Visit SportsLine now to see which side of the Chargers vs. Texans spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans vs. Chargers prediction, odds, time: NFL Week 17 Saturday picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/508f5f92-006b-4d58-9c6c-f3a7b1dfabdb/thumbnail/1200x675/b7d9e82b57a26f5ebddfcd56f0b29991/c-j-stroud-houston-texans-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T11:35:39.000Z",
      "dateModified": "2025-12-26T11:35:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, picks, predictions, best bets: This Friday parlay returns over +600 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-parlay-friday-december-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/081a3985-6157-4f9b-9c67-5eabb7588b19/thumbnail/1200x675/dfff3c38673e75378098c44d4ed5b897/norman-powell-miami-heat-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T14:54:24.000Z",
    "description": "\n        A nine-game NBA schedule highlights Friday's 2025-26 NBA slate. Among the notable NBA odds include Heat vs. Hawks (-2.5), Hornets vs. Magic (",
    "body": "\n        A nine-game NBA schedule highlights Friday's 2025-26 NBA slate. Among the notable NBA odds include Heat vs. Hawks (-2.5), Hornets vs. Magic (-5.5), Celtics (-8.5) vs. Pacers, 76ers vs. Bulls (-1.5), Suns (-4.5) vs. Pelicans, Bucks vs. Grizzlies (-5.5) and Clippers (-2.5) vs. Trail Blazers. Chicago will look to extend its winning streak to five games, while Indiana looks to snap a six-game losing skid.    What are the NBA best bets for Friday, and which combination of picks should you target in a Friday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 10 of the 2025-26 NBA season on a sizzling 30-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +600. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $250 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Friday, Dec. 26After simulating every game 10,000 times, the model is backing the Heat (+2.5) to cover the spread against the Hawks in Atlanta at 7 p.m. ET. The Heat have won the last three meetings with the Hawks, including three of five last season. Miami is 2-8 against the spread in its last 10 games, while Atlanta is 3-6-1 ATS in its last 10. The Heat have also won three of the last five games against the Hawks played in Atlanta.Shooting guard Tyler Herro (toe) is out for Miami, while Atlanta will be without center Kristaps Porzingis (illness). The Heat (15-15) are second in the Southeast Division, trailing first-place Orlando by two games, but are just 2-8 in their past 10 games. The Hawks (15-16), who are third in the division, have lost four in a row.The model is projecting five Heat players to score 13.4 or more points, led by Norman Powell, who is projected to score 22.5 points. The model also says six Hawks players will score 10.6 points or more, led by Jalen Johnson's 22.9 points. The model is also projecting that this game will be decided by single digits as Miami covers in nearly 60% of simulations. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Friday, Dec. 26The model also has locked in two more picks, including another bet that hits over 60% of the time. You can only see the model's NBA parlay at SportsLine.What are the model's top NBA parlay picks for Friday, and which best bets should you target for a chance at a payout of over +600? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, picks, predictions, best bets: This Friday parlay returns over +600 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/081a3985-6157-4f9b-9c67-5eabb7588b19/thumbnail/1200x675/dfff3c38673e75378098c44d4ed5b897/norman-powell-miami-heat-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T14:54:24.000Z",
      "dateModified": "2025-12-26T14:54:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football bowl and CFP picks, predictions: Legendary Vegas expert reveals best bets for today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-games-picks-cfp-quarterfinal-expert-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/01b1feca-5ee2-43c7-ba5a-e0aebb7875cf/thumbnail/1200x675/834cf82497e2b34a2f9db4b43d544e37/luke-altmyer-illinois-fighting-illini-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T14:24:27.000Z",
    "description": "\n        More than a dozen bowl games are already in the books, including the College Football Playoff first round, with the CFP quarterfinals set to ",
    "body": "\n        More than a dozen bowl games are already in the books, including the College Football Playoff first round, with the CFP quarterfinals set to begin on Dec. 31. In the meantime, there is still plenty of other college football bowl action, especially on Saturday, Dec. 27. Contests that day include Penn State vs. Clemson (-3), BYU vs. Georgia Tech (+3.5), Missouri vs. Virginia (+4) and LSU vs. Houston (-2.5), with LSU quarterback Garrett Nussmeier opted out for the Tigers.The final college football bowl game of the calendar year will head to the Cotton Bowl and Ohio State vs. Miami. The Dec. 31 CFP quarterfinal matchup has the reigning champion Buckeyes favored by 9.5 points, per the latest college football bowl odds. Before locking in any college football picks on those games or any others during bowl season, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 9-3 run on his official SportsLine college football over/under picks as well. Anyone following could have seen strong returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for every bowl and CFP game and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football bowl predictionsOne of the top college football picks Marshall is recommending for the remaining 2025-26 bowl schedule: He is backing Illinois (+2.5) to cover against Tennessee in the 2025 Music City Bowl on Dec. 30. The line opened at Tennessee -8.5, but has fallen significantly with Illinois quarterback Luke Altmyer deciding to play. Tennessee receiver Chris Brazzell II, cornerback Colton Hood and linebacker Arion Carter are among the opt outs for Tennessee. Marshall has looked closely at the trends for this one and found that Tennessee only covered two times in its last nine games this season. Illinois, meanwhile, is on an 11-4-1 ATS streak dating back to last season, making the Illini the value side in Nashville. Go to SportsLine to see all of Marshall's picks, and bet that pick right here:\nHow to make college football conference championship picksMarshall has evaluated every other matchup, and he's backing a coach who has covered in 17 of the past 23 times when he has been the underdog. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles, and find out.2025-26 college football bowl oddsSee full college football bowl picks, odds, predictions here(odds subject to change)Friday, Dec. 26GameAbove Sports Bowl: Central Michigan vs. Northwestern (-10.5, 43.5)Rate Bowl: New Mexico vs. Minnesota (-1.5, 42.5)First Responder Bowl: FIU vs. UTSA (-5.5, 60.5)Saturday, Dec. 27Military Bowl: Pittsburgh vs. East Carolina (+10, 52.5)Pinstripe Bowl: Clemson vs. Penn State (+3, 48.5)Fenway Bowl: Army vs. UConn (+9.5, 43.5)Pop-Tarts Bowl: Georgia Tech vs. BYU (-3.5, 55.5)Arizona Bowl: Miami (OH) vs. Fresno State (-5.5, 41.5)New Mexico Bowl: North Texas vs. San Diego State (+5.5, 53.5)Gator Bowl: Virginia vs. Missouri (-4, 44.5)Texas Bowl: LSU vs. Houston (-2.5, 41.5)Monday, Dec. 29: Birmingham Bowl: Georgia Southern vs. Appalachian State (+7, 59.5)Tuesday, Dec. 30Independence Bowl: Louisiana Tech vs. Coastal Carolina (+9.5, 51.5)Music City Bowl: Tennessee vs. Illinois (+2.5, 61.5)Alamo Bowl: USC vs. TCU (+6.5, 55.5)Wednesday, Dec. 31ReliaQuest Bowl: Iowa vs. Vanderbilt (-4.5, 47.5)Sun Bowl: Arizona State vs. Duke (-3, 49.5)Citrus Bowl: Michigan vs. Texas (-7.5, 48.5)Las Vegas Bowl: Nebraska vs. Utah (-15.5, 50.5)CFP quarterfinal/Cotton Bowl: Miami vs. Ohio State (-9.5, 42.5)Thursday, Jan. 1CFP quarterfinal/Orange Bowl: Oregon vs. Texas Tech (+1.5, 52.5)CFP quarterfinal/Rose Bowl: Alabama vs. Indiana (-7, 48.5)CFP quarterfinal/Sugar Bowl: Ole Miss vs. Georgia (-6.5, 56.5)Friday, Jan. 2Armed Forces Bowl: Rice vs. Texas State (-11.5, 59.5)Liberty Bowl: Navy vs. Cincinnati (+6.5, 54.5)Holiday Bowl: Arizona vs. SMU (+3, 51.5)Duke's Mayo Bowl: Wake Forest vs. Mississippi State (-3.5, 53.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football bowl and CFP picks, predictions: Legendary Vegas expert reveals best bets for today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/01b1feca-5ee2-43c7-ba5a-e0aebb7875cf/thumbnail/1200x675/834cf82497e2b34a2f9db4b43d544e37/luke-altmyer-illinois-fighting-illini-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T14:24:27.000Z",
      "dateModified": "2025-12-26T14:24:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025-26 college football bowl confidence picks, predictions, computer rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-confidence-pool-optimal-picks-rankings-playoff-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/fb3a3f91-efef-4e56-a0ca-8c32c515cf08/thumbnail/1200x675/49c072c8ccd1055e1ddff204c11f2430/king-miller-usc-trojans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T15:16:00.000Z",
    "description": "\n        Eleven 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries ",
    "body": "\n        Eleven 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries or modifications as there are around 30 matchups remaining to make college football bowl picks on before the curtain closes on this season. The biggest remaining college football spread has Utah as a 15.5-point favorite over Nebraska in the Las Vegas Bowl on Wednesday, Dec. 31 as Kyle Whittingham will coach his final game for the Utes. While putting faith in big favorites is a part of just about everyone's college football bowl confidence strategy, correctly predicting a couple upsets can give you a big edge in any football pools. Anticipated matchups outside of the CFP include Penn State vs. Clemson (-3), Vanderbilt (-4.5) vs. Iowa, Georgia Tech vs. BYU (-3.5), Tennessee vs. Illinois (+2.5) and Michigan vs. Texas (-7.5). Before making any college football predictions for bowl season, be sure to see the latest college football bowl confidence picks from SportsLine's proven model.New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting for confidence pools. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top 2025-26 college football bowl confidence picks  One of the model's most confident picks is that No. 16 USC (-6.5), who will have quarterback Jayden Maiava, gets a comfortable win over TCU in the Alamo Bowl on Dec. 30. USC went 9-3 in the regular season, with all three defeats coming versus ranked teams. TCU found itself in the Top 25 once -- back in September -- before having a pedestrian run through the Big 12 schedule, finishing 5-4. Even with the Horned Frogs playing in the easier conference than the Trojans, USC both averaged more points and allowed fewer points per game. USC sports a 32-9 (78%) straight-up record when favored since Lincoln Riley came aboard in 2022, as it is projected to easily take care of business in San Antonio. SportsLine's model has the Trojans prevailing 70% of the time. See all of the model's college football bowl confidence picks here.Another one of the bowl confidence predictions the model is high on: Northwestern (-10.5) handles Central Michigan in the GameAbove Sports Bowl on Dec. 26. Central Michigan struggled mightily against Power 4 opponents this year, losing 63-3 to Michigan and 45-17 to Pittsburgh. Northwestern went just 6-6 this year, but that was largely thanks to a very tough Big Ten schedule that included Oregon, Michigan, USC and Illinois. For comparison, Northwestern lost to Michigan by two points on a last-second field goal. The model has Northwestern winning nearly 80% of the time, making the Wildcats the clear side to back. See the rest of the college football bowl confidence predictions here. How to make college football bowl confidence picksThe model has also made the call on who wins every other bowl game. There are several teams that win at least 70% of the time, so you need to go big on those matchups, as well as plenty of underdogs that win outright. You can get all the model's picks at SportsLine.So who wins every college football bowl game, and which matchups should you assign the most confidence points to? Check out the college football bowl schedule below, then visit SportsLine to see which teams to pick, all from a proven computer model that has simulated each bowl game 10,000 times, and find out.College football bowl schedule See every college football bowl game pick hereFriday, Dec. 26 GameAbove Sports Bowl: Central Michigan vs. Northwestern, 1 p.m. ET Rate Bowl: New Mexico vs. Minnesota, 4:30 p.m. ET First Responder Bowl: FIU vs. UTSA, 8 p.m. ET  Saturday, Dec. 27 Military Bowl: Pitt vs. East Carolina, 11 a.m. ET Pinstripe Bowl: Penn State vs. Clemson, noon ET Fenway Bowl: UConn vs. Army, 2:15 p.m. ET Pop-Tarts Bowl: Georgia Tech vs. BYU, 3:30 p.m. ET Arizona Bowl: Miami (OH) vs. Fresno State, 4:30 p.m. ET New Mexico Bowl: North Texas vs. San Diego State, 5:45 p.m. ET Gator Bowl: Virginia vs. Missouri, 7:30 p.m. ET Texas Bowl: LSU vs. Houston, 9:15 p.m. ET  Monday, Dec. 29 Birmingham Bowl: Georgia Southern vs. App. State, 2 p.m. ET  Tuesday, Dec. 30 Independence Bowl: Coastal Carolina vs. Louisiana Tech, 2 p.m. ET Music City Bowl: Tennessee vs. Illinois, 5:30 p.m. ET Alamo Bowl: USC vs. TCU, 9 p.m. ET  Wednesday, Dec. 31 ReliaQuest Bowl: Iowa vs. Vanderbilt, noon ET Sun Bowl: Arizona State vs. Duke, 2 p.m. ET Citrus Bowl: Michigan vs. Texas, 3 p.m. ET Las Vegas Bowl: Nebraska vs. Utah, 3:30 p.m. ET CFP quarterfinals/Cotton Bowl: Miami vs. Ohio State, 7:30 p.m. ETThursday, Jan. 1 CFP quarterfinals/Orange Bowl: Texas Tech vs. Oregon, noon ETCFP quarterfinals/Rose Bowl: Alabama vs. Indiana, 4 p.m. ETCFP quarterfinals/Sugar bowl: Ole Miss vs. Georgia, 8 p.m. ET Friday, Jan. 2 Armed Forces Bowl: Rice vs. Texas State, 1 p.m. ET Liberty Bowl: Navy vs. Cincinnati, 4:30 p.m. ET Holiday Bowl: Arizona vs. SMU, 8 p.m. ET Duke's Mayo Bowl: Wake Forest vs. Mississippi State, 8 p.m. ET\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025-26 college football bowl confidence picks, predictions, computer rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/fb3a3f91-efef-4e56-a0ca-8c32c515cf08/thumbnail/1200x675/49c072c8ccd1055e1ddff204c11f2430/king-miller-usc-trojans-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T15:16:00.000Z",
      "dateModified": "2025-12-26T15:16:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting UTSA vs. FIU, Clippers vs. Trail Blazers Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-draftkings-promo-code-to-get-200-bonus-bets-utsa-fiu-clippers-trail-blazers-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-26T15:08:59.000Z",
    "description": "\n        A jam-packed sports betting run continues on Friday with plenty of college football and NBA action to use the current DraftKings promo code, ",
    "body": "\n        A jam-packed sports betting run continues on Friday with plenty of college football and NBA action to use the current DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. Friday features a college football bowl tripleheader and a nine-game NBA slate, and the SportsLine advanced computer model has best bets from both sports. The model is backing UTSA to cover as 5.5-point favorites against FIU in the First Responder Bowl at 8 p.m. ET and the Portland Trail Blazers to upset the Los Angeles Clippers at 10 p.m. ET in its Friday best bets at DraftKings Sportsbook.Also, one of SportsLine's top experts has locked in a pick on Heat vs. Hawks in a 7 p.m. ET contest for Friday best bets at DraftKings. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 10 of the 2025-26 NBA season on a sizzling 30-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookHawks (-148) to defeat HeatUTSA (-5.5) vs. FIUTrail Blazers (+110) to defeat ClippersCombining the model's three picks into a Friday parlay at DraftKings would result in a payout of +577 (risk $100 to win $577). Bet it at DraftKings here:\nHawks (-148) to defeat HeatThe New Year is often my \"kickstart,\" but this would be value if Bam Adebayo sits for Miami, which is still without Tyler Herro,\" SportsLine expert Matt Severance said. \"It's a little startling how bad the Hawks are WITH Trae Young -- that little dude cannot play an ounce of defense -- as opposed to without as they have lost four straight. But if I wait on Adebayo, then this ML probably isn't playable. Since it's the front end of a back-to-back for Miami, I tend to think the team gives him that extra day off, and he plays Saturday back at home. And the Heat are really slumping too; also 5-10 away.\" Back the Hawks at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:UTSA (-5.5) vs. FIU (-108)UTSA has one of the best offenses in the nation, led by a quarterback who has been surrounded by high-level football his entire life. Starting quarterback Owen McCown is the son of 16-year NFL QB Josh McCown, and although Owen McCown's throwing style certainly looks different as a lefthander, he can sling the ball like his dad. McCown threw for 2,700 yards and 27 touchdowns with seven interceptions this season. He also has a top running back behind him in Robert Henry Jr., who rushed for 1,045 yards on 6.9 yards per carry this season. The model projects UTSA to cover in 63% of simulations. Back UTSA at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Trail Blazers (+110) to defeat ClippersThe Clippers have been one of the biggest disappointments early in the 2025-26 NBA season, starting 8-21 on the season despite having postseason aspirations with one of the strongest duos on paper in the league in James Harden and Kawhi Leonard. Portland is home on Friday, and the Trail Blazers are 2-2 over their last four home games. Meanwhile, the Clippers are 3-13 on the road this season, including 1-7 over their last eight away games. The model projects Portland to win in 61% of simulations, showcasing strong value at plus-money odds. Back the Trail Blazers at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more college football and NBA picks for Friday?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting UTSA vs. FIU, Clippers vs. Trail Blazers Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-26T15:08:59.000Z",
      "dateModified": "2025-12-26T15:08:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens vs. Packers prediction, odds, time, line: Week 17 NFL Saturday picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-packers-prediction-odds-start-time-week-17-nfl-saturday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/c993b3ea-0581-4e19-95a2-2c576d593728/thumbnail/1200x675/60f0a17af2e5da3e33f8d33c878ca68c/josh-jacobs-green-bay-packers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-26T12:05:00.000Z",
    "description": "\nThe Baltimore Ravens look to keep their slim playoff hopes alive when they battle the Green Bay Packers on Saturday night. The Ravens (7-8), who trai",
    "body": "\nThe Baltimore Ravens look to keep their slim playoff hopes alive when they battle the Green Bay Packers on Saturday night. The Ravens (7-8), who trail first-place Pittsburgh by two games in the AFC North, need to win out and have Pittsburgh lose to the Browns in Week 17 to make the playoffs. The Packers (9-5-1), who are 1.5 games behind Chicago for the NFC North lead, clinched a playoff spot on Thursday when the Vikings upset the Lions. Both teams have major question marks at quarterback. Green Bay QB Jordan Love (concussion/shoulder) is listed as questionable, as is backup Malik Willis (shoulder/illness). Baltimore lists quarterback Lamar Jackson (back) as doubtful.Kickoff from Lambeau Field in Green Bay is set for 8 p.m. ET. The Packers lead the all-time series 5-2. The Packers are 4.5-point favorites in the latest Ravens vs. Packers odds, while the over/under for total points scored is 40.5 via DraftKings Sportsbook. Before making any Packers vs. Ravens picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Ravens vs. Packers. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Packers vs. Ravens:Ravens vs. Packers                                                                         spreadGreen Bay -4.5 at DraftKings SportsbookRavens vs. Packers                     over/under40.5 pointsRavens vs. Packers                                                                                                                                                                                     money line Green   Bay -205, Baltimore +170Ravens vs. Packers                                                                                                                                                                             picksSee picks at SportsLineRavens vs. Packers                                                                                                                                                                               streaming Peacock   \nWhy the Packers can coverVeteran running back Josh Jacobs can help power the Green Bay offense with all the uncertainty at quarterback. In 14 games, he has carried 230 times for 926 yards (4.0 average) and 13 touchdowns. He has three explosive plays of 20 yards or more, including a long of 40, with 55 first-down conversions. He also has 35 receptions for 282 yards and one touchdown.Fourth-year veteran wide receiver Christian Watson (questionable, shoulder/illness) is an explosive in the passing game if he's able to go. In nine games this season, he has 30 receptions for 498 yards (16.6 average) and five touchdowns. He has eight explosive plays, including a long of 52 yards, with 94 yards after the catch and 23 first-down conversions. In a 28-21 win over the Chicago Bears on Dec. 7, he caught four passes for 89 yards (22.3 average) and two touchdowns. See which team to back at SportsLine. Why the Ravens can coverVeteran running back Derrick Henry is a big part of the Baltimore offense. In 15 games, he has carried 251 times for 1,253 yards (5.0 average) and 12 touchdowns. He has 13 explosive plays of 20 or more yards, including a long of 59, with 60 first-down conversions. He also has 15 receptions for 150 yards. He has rushed for over 100 yards in six games this season, including 128 yards on 18 carries in Sunday's loss to the Patriots.Leading the Ravens' receiving corps is wide receiver Zay Flowers. In 15 games this season, he has 78 receptions for 1,043 yards (13.4 average) and two touchdowns. He has 17 explosive plays, including a long of 56, including 384 yards after the catch and 42 first-down conversions. In the loss to New England, he caught seven passes for 84 yards, including a long of 19. See which team to back at SportsLine.How to make Ravens vs. Packers picksSportsLine's model is going Over on the total, projecting 45 combined points. It also says one side of the spread is the better value.         You can only get the pick at SportsLine. So who wins Packers vs. Ravens, and which side of the spread is the better value? Visit SportsLine now to see which side of the Ravens vs. Packers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens vs. Packers prediction, odds, time, line: Week 17 NFL Saturday picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/c993b3ea-0581-4e19-95a2-2c576d593728/thumbnail/1200x675/60f0a17af2e5da3e33f8d33c878ca68c/josh-jacobs-green-bay-packers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-26T12:05:00.000Z",
      "dateModified": "2025-12-26T12:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs vs. Broncos prediction, odds, spread: Christmas 'Thursday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-chiefs-prediction-odds-spread-time-2025-christmas-nfl-thursday-night-football-picks-line-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/be8ba885-65d1-4316-a111-614e5efaa4c3/thumbnail/1200x675/6193be421efb86c4d9a8008fb4a4c7a7/rj-harey-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-25T23:55:28.000Z",
    "description": "\nThe 2025 NFL Christmas schedule concludes with a \"Thursday Night Football\" AFC West battle of teams in a surprising position as the Kansas City Chief",
    "body": "\nThe 2025 NFL Christmas schedule concludes with a \"Thursday Night Football\" AFC West battle of teams in a surprising position as the Kansas City Chiefs host the Denver Broncos. The Broncos (12-3) lead the entire AFC and are chasing a top seed and a bye in the NFL playoffs. Kansas City, meanwhile, has been eliminated from the playoff picture. Kansas City is starting Chris Oladokun at quarterback after losing Patrick Mahomes and Gardner Minshew to knee injuries in consecutive weeks. Chiefs LB Nick Bolton (illness) is listed as questionable.Kickoff from GEHA Field at Arrowhead Stadium in Kansas City is set for 8:15 p.m. ET. The latest Broncos vs. Chiefs odds have Denver favored by 13.5 points, according to DraftKings Sportsbook. Meanwhile, the over/under for total points scored is 38.5, which is a 2-point increase from opening at 36.5. Denver is at -1064 on the money line (risk $1,064 to win $100). Before making any Chiefs vs. Broncos picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Chiefs vs. Broncos. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Broncos vs. Chiefs:Broncos vs. Chiefs spreadDenver -13.5 at DraftKings SportsbookBroncos vs. Chiefs over/under38.5 pointsBroncos vs. Chiefs money line Denver -1064, Kansas City +688Broncos vs. Chiefs picksSee picks at SportsLineBroncos vs. Chiefs streaming Amazon Prime \nWhy the Chiefs can coverThe Chiefs haven't been this big of an underdog since the 2021 season, so it's a massive number of points to be getting for the Chiefs, especially at home. Kansas City has been decimated by injuries at quarterback, but still has star power in tight end Travis Kelce, defensive lineman Chris Jones, receiver Xavier Worthy and others. Even in a the midst of a lost season, they'll be highly-motivated to avoid a blowout at the hands of their division rivals in the national spotlight. Denver is just 2-5 against the spread on the road and it only has two double-digit wins this season. The Broncos are also coming off a poor showing against the Jaguars, losing 34-20 despite being 3.5-point favorites in that Week 16 matchup. See which team to back at SportsLine. Why the Broncos can coverDenver has more to play for as the Broncos have the inside track for the top seed in the AFC side of the NFL playoff bracket. The Broncos already beat the Chiefs 22-19 last month, and that was when Kansas City had Mahomes and was still in contention, so a much bigger margin could be in play in this one. The Chiefs are just 5-10 overall this season against the spread. They are also just 1-7 ATS against quality opponents (teams that have won 55% or more of games) 0-7 ATS against teams that give up fewer than 21 points per game. Denver ranks fifth in the NFL in scoring defense (19.7 ppg), fourth in the NFL in total defense (291.6 ypg) and leads the league in total sacks (63) by a wide margin, making life extremely tough on a quarterback with virtually no experience. See which team to back at SportsLine.How to make Chiefs vs. Broncos picksSportsLine's model has simulated Broncos vs. Chiefs 10,000 times and is going Under on the total, projecting 36 combined points. It also says one side of the spread hits 60% of the time. You can only get the pick at SportsLine. So who wins Broncos vs. Chiefs, and which side of the spread hits in 60% of simulations? Visit SportsLine now to see which side of the spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs vs. Broncos prediction, odds, spread: Christmas 'Thursday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/be8ba885-65d1-4316-a111-614e5efaa4c3/thumbnail/1200x675/6193be421efb86c4d9a8008fb4a4c7a7/rj-harey-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2025-12-25T23:55:28.000Z",
      "dateModified": "2025-12-25T23:55:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JJ Redick rips Lakers after Christmas loss to Rockets: 'We don't care enough' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jj-redick-blasts-lakers-christmas-loss-rockets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/f73bdb86-8d4b-4c40-88ee-46e9b50d7f0a/thumbnail/1200x675/db1930993ed5a750e314616668cbda6d/jj-redick-getty.jpg",
    "tag": "Sports",
    "date": "2025-12-26T16:06:08.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Lakers fell to 19-10 on the season",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Lakers fell to 19-10 on the season after a 119-96 blowout loss to the Houston Rockets on Christmas. The loss was the Lakers' third straight defeat, and coach JJ Redick was quick to rip into his squad after the game.\"We don't care enough right now,\" Redick said. \"And that's the part that bothers you a lot. We don't care enough to do the things that are necessary. We don't care enough to be a professional.\"Redick's frustration and questioning of his team's professionalism came after the Lakers fell to 4-6 in their last 10 games following a 15-4 start to the season. The Lakers trailed by double digits for the entirety of the second half against the Rockets, only adding fuel to Redick's post-game comments.\"The two words of the day were effort and execution,\" Redick said. \"And I feel like when we've done both of those things at a high level, we've been a good basketball team. When we haven't, we're a terrible basketball team. And tonight we were a terrible basketball team. And that started legitimately right away.\"  \nThe effort Redick questioned could be seen in nearly all facets of the game, including the Rockets outrebounding the Lakers 48-25.Redick promised an \"uncomfortable\" practice for his team on Saturday as they prepare for Sunday's game against the Sacramento Kings. The Kings sit last in the Western Conference at 7-23 and offer an opportunity for Los Angeles to get things moving in the right direction.Lakers star Luka Dončić, who leads the NBA with 33.7 points per game, echoed his coach's comments following the loss.\n\"I don't know what has to change, but definitely something needs to change,\" Dončić said. \"Think we [were] blown out the last three games. It definitely looks, like, terrible. We just got to talk about it. Everybody got to talk about it. I know JJ said it's going to be uncomfortable [for everybody]. As they should be. Everybody has got to give better effort, starting with me.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JJ Redick rips Lakers after Christmas loss to Rockets: 'We don't care enough' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/f73bdb86-8d4b-4c40-88ee-46e9b50d7f0a/thumbnail/1200x675/db1930993ed5a750e314616668cbda6d/jj-redick-getty.jpg"
      ],
      "datePublished": "2025-12-26T16:06:08.000Z",
      "dateModified": "2025-12-26T16:06:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Packers vs. Ravens prediction, pick, odds, where to watch, live stream, kickoff time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/packers-vs-ravens-where-to-watch-pick-odds-prediction/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/e4000b59-f770-4815-9d68-c76714b1f80e/thumbnail/1200x675/50572bdb5bb5289cc2d221e0d07856b1/derrick-henry-ravens-2.jpg",
    "tag": "Sports",
    "date": "2025-12-26T13:18:56.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Packers are headed to the playoffs, but still have hopes of winning the NFC North\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 26, 2025\n                            \n                    at\n    8:18 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Green Bay Packers and the Baltimore Ravens are both coming off brutal losses, both dealing with injured quarterbacks and both having to manage significant injuries up and down their rosters.The biggest difference? The Packers, with some help from their division rival Minnesota Vikings on Christmas, clinched a playoff berth when the Detroit Lions were eliminated. Meanwhile, the Ravens need a win simply to stay in the running.The Packers (9-5-1) blew yet another late lead in an eventual 22-16 overtime loss to the Chicago Bears in Week 16, and making matters worse, starting quarterback Jordan Love left early with a concussion. Green Bay would certainly love to have Love back -- he's in the top 10 in several categories, including expected points added per dropback (third), passing touchdown-to-interception ratio (fourth) and yards per attempt (ninth). If Love is unable to play, the Packers should take comfort in having Malik Willis under center. He performed admirably last week after taking over for Love (9-for-11 passing, 121 yards, one touchdown; 44 rushing yards) and has done so in the past as well.The Ravens also blew a late lead in a 28-24 loss to the New England Patriots, a game Lamar Jackson exited in the second quarter with a back injury and did not return. Jackson has dealt with a bevy of injuries this season, and Baltimore would turn the keys over to Tyler Huntley if Jackson cannot play. Huntley went 9-for-10 for 65 yards relieving Jackson and also won his lone start this season, back in Week 8 against the Bears.\nBelow, you'll find information on how to watch this game, plus betting information, keys to the game and a prediction.Where to watch Packers vs. Ravens liveDate: Saturday, Dec. 27 | Time: 8 p.m. ETLocation: Lambeau Field -- Green Bay, WisconsinStream: PeacockFollow: CBS Sports AppOdds: Packers -4.5, O/U 40.5 (via DraftKings)\nPackers vs. Ravens: Need to knowPlayoff significance for both. The Packers are looking at an uphill battle to win the NFC North, but they are at least in the tournament. The Ravens, on the other hand, have to win their final two games of the season and have the Pittsburgh Steelers lose both of their final two games. The Steelers face the Cleveland Browns on Sunday before hosting the Ravens in Week 18.Can Derrick Henry deliver? It's been a down season for Henry. After 2,114 yards from scrimmage last year, he has 1,403 this season -- still a huge number, but not close to his 2024 totals. Furthermore, Henry has had three lost fumbles, all in one-possession losses. Last week, the Ravens scored on their opening drive and were driving again when Henry coughed up the ball. The Packers can have some struggles against physical run games, though, and there's no one better to lead that charge than Henry.Packers defense must bounce back. In Week 15 against the Denver Broncos, the Packers gave up 391 yard, at the time their most allowed since Week 4. Then last week, they allowed 400 yards against the Bears. The Broncos threw for 302 yards; the Bears ran for 150. Without Micah Parsons, Devonte Wyatt and others, Green Bay has taken a step back in both facets.Packers vs. Ravens prediction, pickThe Ravens have their backs against the wall. The Packers are in and have the NFC North title still in their sights. The Packers are simply the better team -- more talented, more disciplined -- and if the teams have to go to their backups, Willis has played at a higher level than Huntley.\nPick: Packers 23, Ravens 17 | (Green Bay -4.5, Under 40.5)\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Packers vs. Ravens prediction, pick, odds, where to watch, live stream, kickoff time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/e4000b59-f770-4815-9d68-c76714b1f80e/thumbnail/1200x675/50572bdb5bb5289cc2d221e0d07856b1/derrick-henry-ravens-2.jpg"
      ],
      "datePublished": "2025-12-26T13:18:56.000Z",
      "dateModified": "2025-12-26T13:18:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wrexham vs. Sheffield United: Where to watch, odds, start time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/wrexham-championship-season-premier-league-promotion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/d4305a5e-8b5c-494d-8192-f151238f59e7/thumbnail/1200x675/b5ca7e588d5fe6668f05176d8150a8fa/untitled-design-2025-12-26t154747-728.png",
    "tag": "Sports",
    "date": "2025-12-26T14:51:54.000Z",
    "description": "\nThe jump from the EFL Championship to the Premier League is seen as one of the biggest in English Soccer, but not far off is going from League One to",
    "body": "\nThe jump from the EFL Championship to the Premier League is seen as one of the biggest in English Soccer, but not far off is going from League One to the Championship. A shift from a a league where it's easy to be the top spenders to one where teams are running at a loss season after season in order to chase potential Premier League glory brings up an arms race that League One teams aren't used to, but despite that Wrexham have been able to enter the holidays sitting comfortably in 15th place in the Championship without a massive increase in spending.How to watch Wrexham vs. Sheffield United, oddsDate: Friday, Dec. 26 | Time: 12:30 p.m. ETLocation: SToK Racecourse Ground -- Wrexham, WalesLive stream: Paramount+Odds: Wrexham +220; Draw +240; Sheffield United +120Manager Phil Parkinson has overseen three consecutive promotions with the Dragons -- something that has never happened at this level, and while he may not be overseeing a fourth, the job that he's doing in the Championship may be his best yet. They made impact signings like Kieffer Moore, Lewis O'Brien, and Josh Windass, but it's nothing like what the Dragons were doing in the lower divisions when they overturned their team year after year. Continuity was needed, and being able to balance the side without major reinfocements is quite a credit to Parkinson.With the expected Hollywood reinfocements like Christian Eriksen not coming despite a star-studded ownership group of Ryan Reynolds and Rob Mac, Wrexham were able to make additions to the squad as the third-highest spending side in the Championship, but those were also needed if they were going to survive the drop. That spending was spread around 11 signings, most of whom have become key members of Parkinson's rotation. From identifying talent to ensuring that it's used well, the Wrexham front office has done a good job in working together with the manager to push this team to new heights.In lower divisions in England, a team's squad value can be indicative of their performance, and Wexham sit 15th in the Championship following their promotion with a value of €55.78 million per Transfermarkt. To put that into context, fellow promoted sides Charlton and Birmingham City are at different ends of the spectrum. Charlton sit 23rd out of 24 clubs at €27.60 million while Birmingham City are eighth at €97.10. At the moment, all three would avoid the drop as they're only separated by three points in the table.It does help to have Sheffield Wednesday this season, who are on negative nine points at the bottom of the Championship table due to an 18-point deduction due to financial issues, while also being put into administration in October, but even with that, Wrexham would be in their position without a historically poor team in the division. Comfortably staying up in the Championship may not make the greatest television, but it also shows that what the Dragons are doing is sustainable.They've been able to move on from club legends like Paul Mullin and Elliott Lee without missing a beat, all of which are testaments to Parkinson's leadership. A manager with plenty of experience when he came to Wrexham, he has become arguably the most irreplaceable figure at the ground during this rise. As things have shifted around the club, Parkinson has remained constant, and the Dragons have been better off from it.Looking at the league table, Wrexham are slightly overperforming at the moment, allowing only 27 goals from an expected goals against of 33.76, but even that figure is better than three teams in the Championship, including Hull City, who are currently in a playoff place. A bit of regression during the remainder of the season likely won't see the club slip into the relegation zone, but it should temper expectations of how high they can go. With more investment, there's no reason why Wrexham can't dream of the Premier League, but going back to the squad value of teams in the Championship, there's a considerable gap between them and league leaders Coventry City. The Sky Blues are valued at €143.80 million, so just getting the squad on par with bigger clubs such as them and Birmingham City are the next step for Wrexham to push for promotion. When the Dragons have already exceeded expectations of their precious five year plan and more investment is coming into the club, reaching the Premier League in the next five years is quite achievable. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wrexham vs. Sheffield United: Where to watch, odds, start time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/d4305a5e-8b5c-494d-8192-f151238f59e7/thumbnail/1200x675/b5ca7e588d5fe6668f05176d8150a8fa/untitled-design-2025-12-26t154747-728.png"
      ],
      "datePublished": "2025-12-26T14:51:54.000Z",
      "dateModified": "2025-12-26T14:51:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Footy Fix: EFL Championship takes center stage in Boxing Day bonanza on Paramount+ and across CBS Sports - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-efl-championship-boxing-day-paramount-cbs-sports/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/bed3416c-d53b-46e8-8378-3c21b4c8049a/thumbnail/1200x675/4a5e819a8334d2b778170867a04a82c4/golazoshow-efl-boxingday-hqslate-1920x1080-today.jpg",
    "tag": "Sports",
    "date": "2025-12-26T14:35:53.000Z",
    "description": "\n        Happy Boxing Day! The Premier League may be taking a light day, but we've got a loaded slate in the EFL Championship while AFCON gets closer ",
    "body": "\n        Happy Boxing Day! The Premier League may be taking a light day, but we've got a loaded slate in the EFL Championship while AFCON gets closer to the end of matchday one. I'm Chuck Booth, and let's get to the soccer. 📺 Footy fixAll times U.S./EasternFriday, Dec. 26🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Leicester City vs. Watford, 10 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Middlesbrough vs. Blackburn Rovers, 10 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: West Brom vs. Bristol City, 10 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Oxford United vs. Southampton, 10 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Stoke City vs. Preston North End, 10 a.m. ➡️ Paramount+, CBS Sports Network🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Coventry City vs. Swansea City, 10 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Championship: Wrexham vs. Sheffield United, 12:30 p.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Manchester United vs. Newcastle United, 3 p.m. ➡️ USA🌎 AFCON: Morocco vs. Mali, 3 p.m. ➡️ beIN Sports, FuboSaturday, Dec. 27🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Nottingham Forest vs. Manchester City, 7:30 a.m. ➡️ USA🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Arsenal vs. Brighton, 10 a.m. ➡️ USA🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Chelsea vs. Aston Villa, 12:30 p.m. ➡️ NBC🇮🇹  Serie A: Udinese vs. Lazio, 12:30 p.m. ➡️ Paramount+, CBS Sports Network🇮🇹 Serie A: Pisa vs. Juventus, 2:45 p.m. ➡️ Paramount+, CBS Sports Network🌎  AFCON: Nigeria vs. Tunisia, 3 p.m. ➡️ beIN Sports, Fubo \nSunday, Dec. 28🇮🇹 Serie A: Milan vs. Verona, 6:30 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Crystal Palace vs. Tottenham, 11:30 a.m. ➡️ USA🌎 AFCON: Algeria vs. Burkina Faso, 12:30 p.m. ➡️ beIN Sports, Fubo 🌎 AFCON: Ivory Coast vs. Cameroon, 2 p.m. ➡️ beIN Sports, Fubo 🇮🇹 Serie A: Atalanta vs. Inter, 2:45 p.m. ➡️ Paramount+\n                                                                    Paramount+\n                                                            What's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Footy Fix: EFL Championship takes center stage in Boxing Day bonanza on Paramount+ and across CBS Sports - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/bed3416c-d53b-46e8-8378-3c21b4c8049a/thumbnail/1200x675/4a5e819a8334d2b778170867a04a82c4/golazoshow-efl-boxingday-hqslate-1920x1080-today.jpg"
      ],
      "datePublished": "2025-12-26T14:35:53.000Z",
      "dateModified": "2025-12-26T14:35:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan targets Kyle Whittingham: Ex-Utah coach emerges as Wolverines' top candidate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-kyle-whittingham-coach-utah/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/b5db66f9-812d-4767-b315-6ec5038bfd2a/thumbnail/1200x675/687f5aecd6b5ff86dc831c34a57d263a/kyle-whittingham.png",
    "tag": "Sports",
    "date": "2025-12-26T14:59:14.000Z",
    "description": "\n        Former Utah coach Kyle Whittingham has emerged as the lead figure in Michigan's coaching search, sources confirmed to CBS Sports' Matt Zenitz",
    "body": "\n        Former Utah coach Kyle Whittingham has emerged as the lead figure in Michigan's coaching search, sources confirmed to CBS Sports' Matt Zenitz. Whttingham, 66, stepped down in December after 21 seasons leading the Utes, and he left the door open to continuing his legendary coaching career elsewhere. Over more than three decades with the Utes, first as an assistant and then as head coach since 2005, Whittingham cultivated a clean image and a winning program. Both factors would make him attractive to the Wolverines, who are seeking to turn the page from a scandal-ridden era without taking a step back on the field.Michigan is in the midst of an external review focused on its handling of Sherrone Moore, who was fired with cause on Dec. 10 after evidence surfaced that he had an inappropriate relationship with a staff member. Moore, who had been the program's offensive coordinator during Jim Harbaugh's scandal-marred tenure, was subsequently charged with felony home invasion and stalking.Whittingham's final Utah team finished 10-2 (7-2 Big 12) this past season before the school announced on Dec. 13 that he would be stepping down to make way for head coach-in-waiting Morgan Scalley to begin his tenure. However, Whittingham is still slated to coach the Utes in the Las Vegas Bowl against Nebraska on New Year's Eve.\nUtah reached the Rose Bowl in both 2021 and 2022 under Whittingham after winning 11 games in 2019. Arguably his best season with the Utes came in 2008, however, when Utah went 13-0, beat Alabama in the Sugar Bowl and finished No. 2 in the AP poll.Michigan's search processMoore's firing came after the early signing period for high school prospects and well before the transfer portal opens on Jan. 2, which eliminated any need for the Wolverines to rush the hiring process.Though Michigan was a late entrant to what's been a busy coaching carousel, the Wolverines have been the only Power Four school on the market for the past couple of weeks. Given the job's allure as one of the nation's best, the list of names connected to the opening in some capacity was been strong.\nAmong them have been Alabama's Kalen DeBoer, Arizona State's Kenny Dillingham and Louisville's Jeff Brohm. The elevation of interim coach Biff Poggi also loomed as a potential option if the Wolverines struggled to find a suitable candidate. Poggi has been leading Michigan as it prepares to play Texas in the Citrus Bowl on New Year's Eve.Stabilizing forceHiring Whittingham instead of elevating Poggi, who is also 66, would signal that Michigan is OK with a relatively short-term hire but that it wants to accomplish a couple of things in the meantime. First, landing one of the longest-tenured and most successful sitting head coaches at the Power Four level shows the Wolverines are serious about contending in the Big Ten and have no interest in taking a step back competitively as they sort their way through the wreckage of what Harbaugh and Moore left behind.Elevating Poggi could have been interpreted as a gesture of surrender for the 2026 season after he went 6-16 as head coach at Charlotte in 2023 and 2024. Secondly, hiring Whittingham would show the university is intent on moving forward from its past. Poggi served two stints under Harbaugh at Michigan, including one as the program's associate head coach in 2021 and 2022. Fair or not, he is viewed as a product of that era.\nSo while Whittingham may not be a long-term solution, he's more than a stopgap interim. He's a proven winner who can help the program turn the page from the turmoil of the Harbaugh and Moore eras. As he wipes the slate clean, the program can begin preparing to make a run at a huge name at some point in the relatively near future.Utah dynamicHiring Whittingham could set up an interesting tug of war for both staffers and players between Michigan and Utah. What's certain is that Whittingham will be without Scalley as his defensive coordinator for the first time since the 2015 season.As Scalley launches his Utah tenure and puts his own spin on things there, will he be able to fend off a well-resourced Michigan program led by Whittingham? One of the top storylines to monitor will be Whittingham's appetite to recruit from Utah's roster and coaching staff. It was always assumed that when the Whittingham to Scalley transition occurred at Utah, Whittingham would be retiring.\nInstead, he has landed an even better job. If he attempts to build the Wolverines program with Utah talent, it could make for an awkward dynamic that would have been difficult to imagine just a few weeks ago.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan targets Kyle Whittingham: Ex-Utah coach emerges as Wolverines' top candidate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/b5db66f9-812d-4767-b315-6ec5038bfd2a/thumbnail/1200x675/687f5aecd6b5ff86dc831c34a57d263a/kyle-whittingham.png"
      ],
      "datePublished": "2025-12-26T14:59:14.000Z",
      "dateModified": "2025-12-26T14:59:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Nuggets vs. Timberwolves: TV channel, live stream, odds, time - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nuggets-vs-timberwolves-prediction-odds-time-where-to-watch-nba-christmas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/2977aebd-e56b-47d0-b50a-37f2528a3b5a/thumbnail/1200x675/a03d9a9502b8dc6dd087352a42e5ba6b/murray-edwards-getty.png",
    "tag": "Sports",
    "date": "2025-12-26T03:11:24.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA's 2025 Christmas slate concludes with a se",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The NBA's 2025 Christmas slate concludes with a set of familiar opponents. The Minnesota Timberwolves and Denver Nuggets were built by the same general manager, Tim Connelly. They faced off in the 2024 playoffs, where Minnesota ended Denver's championship defense with a second-round upset. Every year, they seem to play in a thriller or two. Last year, the Timberwolves stole a double overtime victory on a terrible Russell Westbrook shooting foul.Neither team is quite at its peak. Denver is still dealing with injuries to Aaron Gordon and Christian Braun. Minnesota is still adjusting to life without Nickeil Alexander-Walker. But these are still both Western Conference contenders, and any game between the two of them is a deserving marquee regular-season event. Below is our pick against the spread as well as the best prop bet for the Christmas finale.\n        \n            \n                Bold predictions for each NBA Christmas Day game: Thunder-Spurs tension, a Curry flurry and more\n                \n                    Jack Maloney                \n            \n                            \n    \n                \n                    \n    \nTimberwolves at Nuggets: Where to watchTime: 10:30 p.m. ET | Date: Thursday, Dec. 25Location: Ball Arena -- DenverTV channel: ABC/ESPN | Live stream: fubo (Try for free)Odds: Nuggets -3.5, O/U: 238.5 (via BetMGM) Timberwolves at Nuggets: Prediction, odds, best bets\nDenver's depth has improved significantly this season, but the injuries are just becoming too much to overcome against a great opponent like Minnesota. Aaron Gordon and Christian Braun are still out, and on Tuesday, Cam Johnson suffered a knee injury that we don't know the extent of yet, but should leave Denver without a third starter for at least some period of time. The Timberwolves always get up for Nuggets games and they've now won 10 of their last 12, including statement wins over the Knicks and Thunder. They're the safer pick with the points. The Pick: Timberwolves +3.5\nI'll admit my instinct was to pick Nikola Jokić's scoring over to account for his missing teammates, but no team limits his shot total better than Minnesota. Outside of his 61-point gem last season, which came without Jamal Murray and Michael Porter Jr. and took two overtimes, Jokić has averaged just 15.4 shot attempts per game against Minnesota over the past two regular seasons. So I'm going the other way and expecting a more balanced offensive night for the three-time MVP. The Pick: Jokić Under 29.5 Points\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Nuggets vs. Timberwolves: TV channel, live stream, odds, time - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/2977aebd-e56b-47d0-b50a-37f2528a3b5a/thumbnail/1200x675/a03d9a9502b8dc6dd087352a42e5ba6b/murray-edwards-getty.png"
      ],
      "datePublished": "2025-12-26T03:11:24.000Z",
      "dateModified": "2025-12-26T03:11:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]