[
  {
    "title": "Week 13 NFL picks, exact score predictions, best bets today from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-13-picks-exact-score-predictions-ai-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/26/310594e4-2007-4d0c-881f-9d2f39aa4756/thumbnail/1200x675/c167c84e9381030ab6a76e13b3f3a1c7/puka-nacua-los-angeles-rams-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:36:31.000Z",
    "description": "\n        NFL Week 13 features a a number of key divisional matchups. In an important AFC South battle, the Houston Texans look to pull within one game",
    "body": "\n        NFL Week 13 features a a number of key divisional matchups. In an important AFC South battle, the Houston Texans look to pull within one game of the division lead when they meet the Indianapolis Colts. The Colts are favored by 3.5 points as C.J. Stroud (concussion) is expected to play after practicing on Wednesday and Thursday. Indianapolis quarterback Daniel Jones is dealing with a fibula injury, but did practice on Thursday and is expected to go as well.A non-divisional matchup with heavy AFC playoff race implications will be played on Sunday afternoon when Josh Allen and the Buffalo Bills (-3.5) take on Aaron Rodgers, who missed last week's game, and the Pittsburgh Steelers. Buffalo has won four of the past five meetings, with the Bills pulling out a 31-17 win in the last meeting on Jan. 15, 2024. Sunday's largest spreads are Vikings vs. Seahawks (-11.5), Rams (-10.5) vs. Panthers and Raiders vs. Chargers (-9.5).Before making any Week 13 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 13 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 16 games. You can only see the AI predictions for the Week 13 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 13 NFL AI picksAfter analyzing every game in Week 13, the AI says the Rams (-10), who have won six in a row, cover comfortably against the Panthers. Quarterback Matthew Stafford has played at an MVP-type level. In 11 games for Los Angeles, he has completed 66.5% of his passes for 2,830 yards and 30 touchdowns with two interceptions and a 113.7 rating. Stafford is coming off a solid outing against the Tampa Bay Buccaneers on Sunday Night Football. In that game, a 34-7 win, Stafford completed 25 of 35 passes for 273 yards and three touchdowns.His favorite target has been Puka Nacua. In 10 games this season, he has 80 receptions for 947 yards (11.8 average) and four touchdowns. He has 13 explosive plays of 20 or more yards, including a long of 39. SportsLine AI rates the Rams as an A+ spread pick and also predicts a 30-17 win on average. See its other Week 13 football predictions and football picks at SportsLine, and bet the Rams here:How to make Week 13 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A+ picks for Week 13. You need to see the AI's NFL picks before making any Week 13 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 13 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 13 NFL picks, exact score predictions, best bets today from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/26/310594e4-2007-4d0c-881f-9d2f39aa4756/thumbnail/1200x675/c167c84e9381030ab6a76e13b3f3a1c7/puka-nacua-los-angeles-rams-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T15:36:31.000Z",
      "dateModified": "2025-11-28T15:36:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 13 NFL betting guide, expert and computer picks, props, DFS, fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-13-nfl-betting-guide-props-spreads-lines-parlay-dfs-fantasy-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/26/928adf75-18e7-4319-b657-e7584e0ba2b5/thumbnail/1200x675/2fad73dac18633da791ac90146c8f6a7/woody-marks-houston-texans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:58:03.000Z",
    "description": "\n        Some quality Week 13 NFL betting advice would be to consider anything and everything before placing Week 13 NFL predictions. How teams perfor",
    "body": "\n        Some quality Week 13 NFL betting advice would be to consider anything and everything before placing Week 13 NFL predictions. How teams perform versus the spread on a short week is pertinent for this week's slate, as are how teams perform in adverse conditions or with lengthy travel, which are also relevant with this week's NFL schedule. A dome team in Atlanta has to travel to NYC to face the Jets, as the former may have to deal with the elements. Meanwhile, the Rams, who are the biggest favorites per the Week 13 NFL odds at -10.5, will have to travel cross country to Carolina for a 1 p.m. ET Sunday kickoff.Those are things outside of the NFL spread records one should consider before laying down any wagers. Along with the Rams, other double-digit favorites include the Seahawks (-11.5) versus the Vikings and the Chargers (-9.5) against the Raiders. The heavily favored teams feature the likes of Puka Nacua, Davante Adams, Sam Darnold and Justin Herbert who could factor into NFL player props, plugged into Fantasy football lineups or be a part of your NFL DFS strategy. If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 13, SportsLine has you covered with its proven model, Machine Learning Model and team of experts.Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 13 that pays 25-1, and one of the legs is the Rams (-10, 45) covering against the Panthers. The model has Los Angeles covering in nearly 60% of simulations in an A-rated pick, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $200 in bonus bets + 3 months of NBA League Pass if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Jags' Trevor Lawrence as one of its top value picks at quarterback, while Las Vegas' Ashton Jeanty is among the best values at running back for Sunday's main slate. Here are its complete Week 13 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Browns' Harold Fannin Jr. as a top-10 Fantasy tight end this week. Get his full Week 13 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 13 Fantasy football rankings that can be used to make start-sit decisions. The Texans' Woody Marks is projected to be a top-20 Fantasy running back this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024 and has revealed picks for every Week 13 NFL game. One of its favorite picks is the Falcons (-2.5, 39.5) covering versus the Jets, which cashes nearly 60% of the time. You can find the model's picks for every NFL Week 13 game here. You can also use the latest FanDuel promo code to get $150 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Larry Hartstein, who is 24-18-1 (+386) over his last 43 NFL ATS picks, is backing Indianapolis (-3.5) to cover at home versus Houston on Sunday.\"The Colts haven't played at home since Oct. 26, when they destroyed Tennessee 38-14. They're a different offense inside, on an artificial surface. This is the one of the only 3.5s left in the market, as money is pouring in on the Colts. Houston's elite defense isn't quite as tough on the road. Lay the points.\" Hartstein's NFL best bets for Week 13 can be found here.Bears vs. Eagles Black Friday NFL picksThe NFL Black Friday Game features a pair of 8-3 teams as the Eagles host the Bears. Philly has won each of the last six matchups and is a 7-point favorite in this contest. NFL expert Adam Silverstein, who is 40-25-2 (+1260) over his last 67 picks in Eagles games, is backing Philadelphia to cover, saying, \"The Eagles will be fuming off the Cowboys loss and back at home where it has covered three of the last four. The offensive issues are a legitimate concern, but Chicago is not stout enough defensively to stop Jalen Hurts & Co., especially with the team at its peak motivation coming off the terrible Dallas loss.\" See Silverstein's full analysis here.SportsLine's self-learning AI, which has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 NFL season, projects Bears WR Rome Odunze to go Under 3.5 receptions (+110). SportsLine AI forecasts Odunze to have 2.2 receptions in a prop pick rated 5 stars. Get more picks from SportsLine AI here.Broncos vs. Commanders 'Sunday Night Football' picksThe 9-2 Denver Broncos are chasing the top overall seed in the AFC, and they'll go on the road to face the struggling Washington Commanders (3-8) on Sunday night. The Broncos have won eight straight since opening the season 1-2. Six of their past seven wins, however, have been by four or fewer points. The Broncos are 4-3 against the spread in that span, so while they are winning, they haven't been covering with room to spare. Washington quarterback Jayden Daniels (elbow) has been a limited participant at practice on Wednesday and Thursday. Mike Tierney is on a 15-9 run on picks involving Washington, and he's backing the Broncos (-5.5) to get the cover.\"With the league's 14th-ranked offense, the Broncos should be able to find sufficient points against the No. 31 defense for a cover,\" Tierney told SportsLine. Get more 'Sunday Night Football' picks right here. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 13 NFL betting guide, expert and computer picks, props, DFS, fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/26/928adf75-18e7-4319-b657-e7584e0ba2b5/thumbnail/1200x675/2fad73dac18633da791ac90146c8f6a7/woody-marks-houston-texans-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T15:58:03.000Z",
      "dateModified": "2025-11-28T15:58:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL odds, lines, spreads: Week 13 picks, predictions, best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-13-nfl-odds-spreads-picks-lines-best-bets-today-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/2e545629-58e7-490f-95ca-07732cf120ce/thumbnail/1200x675/3950809c61ff52f799fe4c1a33ce966f/bijan-robinson-atlanta-falcons-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:47:21.000Z",
    "description": "\n        The Week 13 NFL schedule has already seen three upsets on Thanksgiving, and features Eagles vs. Bears on Black Friday. There's plenty more to",
    "body": "\n        The Week 13 NFL schedule has already seen three upsets on Thanksgiving, and features Eagles vs. Bears on Black Friday. There's plenty more to come over the weekend, however. The other standalone games to make Week 13 NFL picks on are both Super Bowl rematches. Broncos vs. Commanders saw Washington prevail in The Big Game back in 1988, and the Week 13 NFL odds have Denver as 5.5-point road favorites on Sunday night, with Jayden Daniels (elbow) doubtful to suit up. Then on Monday, Giants vs. Patriots (-7.5) is a matchup we've seen twice in the Super Bowl, with New York winning each time.Sunday afternoon's slate features a couple of matchups where time and travel could be factors with your Week 13 NFL picks. Cardinals vs. Buccaneers (-3) and Rams vs. Panthers (+10) both see the NFC West teams flying to the East Coast for 1 p.m. ET kickoffs. Historically, this is known to favor the home teams, thus making the Bucs and Panthers, perhaps, a bit more appealing than the NFL spreads suggest. All of the updated Week 13 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 13 NFL picks now. LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can also target the DraftKings promo code, which offers $200 in bonus bets if your initial $5 bet wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 13 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top Week 13 NFL predictionsWe can tell you one of the model's strongest Week 13 NFL picks is that the Falcons (-2.5, 39.5) cover at the New York Jets in a Sunday 1 p.m. ET kickoff. Kirk Cousins had two passing touchdowns in Sunday's win over New Orleans, and having two passing scores, plus getting a win, is something that Michael Penix Jr. did once across his 12 NFL starts. Meanwhile, the Jets also had a QB change, but Tyrod Taylor dropped to 0-2 this season in a Week 12 loss to Baltimore. Taylor has nearly as many turnovers (three) across his pair of starts as Justin Fields had (four) across nine starts, so it's hard to call the change an upgrade. The Falcons are undefeated ATS over their last three outside of Atlanta, while the Jets are just 1-3 ATS over their last four at MetLife Stadium. The model has Atlanta prevailing versus the spread well over 50% of the time. See which other teams to pick here.\nAnother one of its Week 13 NFL predictions: the Jaguars (-6, 41.5) cover versus the Titans in well over 50% of simulations. The Jags have won five of their last six versus the Titans, as Tennessee is now 1-16 over its last 17 games overall. Cam Ward hasn't thrown more than one touchdown in any game as a pro, and only J.J. McCarthy has a lower passer rating this season. Ward won't find much help in the ground game on Sunday as Jacksonville has the No. 1 run defense, while the Jags also control the trenches on offense as they rank eighth in rushing yards. The Jaguars are projected to have over 120 rushing yards, while the Titans have under 80 and average less than 3.8 yards per carry. The model has the Jags covering and says the Over hits in almost 60% of sims. See which other teams to pick here.\nHow to make Week 13 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 13 NFL schedule and just revealed four teams projected to outright win in at least 70% of simulations, potentially giving you a huge payday by betting the money line. You can only get every pick for every game at SportsLine.So what Week 13 NFL picks can you make with confidence, and which four teams should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 13 NFL betting odds, lines, live spreads, scoresGet Week 13 NFL picks at SportsLineGameSpreadTotalPicksPackers at Lions (Thursday)F: Packers 31, Lions 24Chiefs at Cowboys (Thursday)F: Cowboys 31, Chiefs 28Bengals at Ravens (Thursday)F: Bengals 32, Ravens 14Bears at Eagles (Friday)PHI -744.5SEE  PICKS HERERams at PanthersLAR -10.545SEE  PICKS HERE49ers at BrownsSF -4.536.5SEE  PICKS HERETexans at ColtsIND -4.544.5SEE  PICKS HERESaints at DolphinsMIA -641.5SEE  PICKS HEREFalcons at JetsATL -2.539.5SEE  PICKS HERECardinals at BuccaneersTB -344.5SEE  PICKS HEREJaguars at TitansJAX -6.541.5SEE  PICKS HEREVikings at SeahawksSEA -11.541SEE  PICKS HERERaiders at ChargersLAC -1041.5SEE  PICKS HEREBills at SteelersBUF -3.547.5SEE  PICKS HEREBroncos at CommandersDEN -6.543.5SEE  PICKS HEREGiants at Patriots (Monday)NE -7.546.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL odds, lines, spreads: Week 13 picks, predictions, best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/2e545629-58e7-490f-95ca-07732cf120ce/thumbnail/1200x675/3950809c61ff52f799fe4c1a33ce966f/bijan-robinson-atlanta-falcons-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T15:47:21.000Z",
      "dateModified": "2025-11-28T15:47:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Footy Fix: USWNT in action Friday night and MLS Conferences finals headline Thanksgiving weekend action - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/footy-fix-uswnt-in-action-friday-night-and-mls-conferences-finals-headline-thanksgiving-weekend-action/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/d6146026-5d2f-4b14-922e-f0c78118ede4/thumbnail/1200x675/0525ce14d1272e62140d3b5c1deb63c8/untitled-design-2025-11-28t163623-197.png",
    "tag": "Sports",
    "date": "2025-11-28T15:50:06.000Z",
    "description": "\n        Welcome to the weekend! Thanksgiving is over and we all hope you had a nice time with the ones you love. Let's shift back to the action now, ",
    "body": "\n        Welcome to the weekend! Thanksgiving is over and we all hope you had a nice time with the ones you love. Let's shift back to the action now, as another exciting weekend leads us into the MLS conference finals coming up on Sunday. I'm Francesco Porzio with the latest.📺 Footy fixAll times U.S./EasternFriday, Nov. 28🇺🇸 Friendly: USWNT vs. Italy, 7 p.m. ➡️ TNTSaturday, Nov. 29🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Manchester City vs. Leeds United, 10 a.m. ➡️ Peacock🇪🇸 LaLiga: Barcelona vs. Alaves, 10 a.m. ➡️ ESPN+🇮🇹 Serie A: Juventus vs. Cagliari, 12 p.m. ➡️ Paramount+🇮🇹 Serie A: AC Milan vs. Lazio, 2:45 p.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Tottenham vs. Fulham, 3 p.m. ➡️USA NetworkSunday, Nov. 30🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Crystal Palace vs. Manchester United, 7 a.m. ➡️ USA Network🇮🇹 Serie A: Pisa vs. Inter, 9 a.m. ➡️ Paramount+🏴󠁧󠁢󠁥󠁮󠁧󠁿 Premier League: Chelsea vs. Arsenal, 11:30 a.m. ➡️ USA Network🇮🇹 Serie A: Atalanta vs. Fiorentina, 12 p.m. ➡️ Paramount+🇮🇹 Serie A: AS Roma vs. Napoli, 2:45 p.m. ➡️ Paramount+🇪🇸 LaLiga: Girona vs. Real Madrid, 3 p.m. ➡️ ABC🇺🇸 MLS: Inter Miami vs. NYCFC, 6 p.m. ➡️ AppleTV🇺🇸 MLS: San Diego FC vs. Vancouver Whitecaps, 9 p.m. ➡️ AppleTVYour Food Coma PlansWhat's on CBS Sports Golazo Network\n🥅 Scoreline (Daily): Scoreline is the newest place for fans to catch up on all the biggest news and results impacting global football, match highlights from the top soccer competitions and all the can't-miss goals from the day's action, starting Thursday and airing seven days a week.📺 How to watch: CBS Sports Golazo Network is a free 24/7 channel exclusively dedicated to offering unparalleled coverage of all the top soccer competitions worldwide. You can stream for free on the CBS Sports app, Pluto TV and Paramount+.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Footy Fix: USWNT in action Friday night and MLS Conferences finals headline Thanksgiving weekend action - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/d6146026-5d2f-4b14-922e-f0c78118ede4/thumbnail/1200x675/0525ce14d1272e62140d3b5c1deb63c8/untitled-design-2025-11-28t163623-197.png"
      ],
      "datePublished": "2025-11-28T15:50:06.000Z",
      "dateModified": "2025-11-28T15:50:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. Bears SGP best bets: 2025 Black Friday NFL same-game parlay picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-bears-sgp-black-friday-nfl-same-game-parlay-picks-bets-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/5ca26508-c089-40de-946d-a88782a8a243/thumbnail/1200x675/ced32a15a270d8d6b856ac967ce1dba0/usatsi-27425169-odunze-wiggins-1q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2025-11-28T13:16:30.000Z",
    "description": "\n        A newer holiday tradition is the Black Friday NFL Game, and this year's edition has the Philadelphia Eagles hosting the Chicago Bears at 3 p.",
    "body": "\n        A newer holiday tradition is the Black Friday NFL Game, and this year's edition has the Philadelphia Eagles hosting the Chicago Bears at 3 p.m. ET. Both teams are 8-3 and laden with stars who frequently find themselves within an NFL SGP such as Jalen Hurts, Saquon Barkley, Caleb Williams and D'Andre Swift. Revenge could be a factor which makes Swift appealing in prop bets and an NFL same-game parlay as the Philly native was not re-signed by the Eagles after a Pro Bowl year for them in 2023. He had 144 rushing yards in his last game versus the Eagles, but with the emergence of rookie running back Kyle Monangai, Swift's rushing yards NFL prop is 43.5.Swift had just 15 rushing yards on eight carries last week, which was his lowest total in two years. Meanwhile, some NFL betting advice that could be helpful is knowing that Philadelphia is holding opponents to just 3.7 yards per carry over its last five games, as opposed to 4.7 yards per carry over its first six contests. Is this player prop for Swift one to include in your Black Friday NFL picks? Before locking in any Eagles vs. Bears picks for your Black Friday NFL SGP, be sure to see the Bears vs. Eagles prop predictions powered by SportsLine's Machine Learning AI.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1 JOIN NOW. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. Now, the model has analyzed Bears vs. Eagles on Black Friday and locked in three confident best bets for an NFL SGP. If you successfully parlay its picks, you'd be looking at a payout of more than 6-1. You can only see the Machine Learning Model player prop predictions for Philadelphia vs. Chicago here.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins:Top Eagles vs. Bears SGP picksAfter simulating Bears vs. Eagles, SportsLine's Machine Learning Model says Bears receiver Rome Odunze goes Under 3.5 receptions (+110 at FanDuel). The second-year wideout started off the year by going Over his receptions total in back-to-back games, but he's lived in the Under since then. He's failed to reach his receptions total in seven of the last nine games, including a three-catch game last week versus Pittsburgh, which followed a two-reception outing versus Minnesota.Chicago has shifted to a run-heavy offense as it ranks second in the NFL in both rushing attempts and yards. Odunze has become a casualty of that, and don't expect the Bears to suddenly air the ball out versus Philly's stifling pass defense. The Eagles allow the lowest completion percentage in the NFL, which SportsLine AI has taken into account. It projects Odunze to have 2.2 receptions in a 5-star prop that could be a part of a winning NFL SGP. See which other Black Friday NFL same-game parlay picks to make here,How to make Bears vs. Eagles   SGP picksIn addition, the SportsLine Machine Learning Model has six other NFL props that are rated 4 stars or better that could be a part of your Eagles vs. Bears SGP picks. You can only see the Machine Learning Model's Black Friday NFL parlay at SportsLine.What are the model's top NFL same-game parlay picks you should target with your Bears vs. Eagles predictions? Visit SportsLine now to see the Black Friday NFL SGP from the SportsLine Machine Learning Model and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. Bears SGP best bets: 2025 Black Friday NFL same-game parlay picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/5ca26508-c089-40de-946d-a88782a8a243/thumbnail/1200x675/ced32a15a270d8d6b856ac967ce1dba0/usatsi-27425169-odunze-wiggins-1q-2025-1920.jpg"
      ],
      "datePublished": "2025-11-28T13:16:30.000Z",
      "dateModified": "2025-11-28T13:16:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon State hires JaMarcus Shepard: Alabama assistant tapped to lead Beavers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oregon-state-hires-jamarcus-shepard-head-coach-alabama-assitant-pac-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/eb13b0ab-683e-4769-8929-721b5a4d6927/thumbnail/1200x675/8a8ec93cce13c8a8a5b5d3965763f8e7/gettyimages-2247808669-2.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:32:24.000Z",
    "description": "\n        Oregon State football has found its next coach. The Beavers have hired Alabama assistant head coach JaMarcus Shephard, the school announced o",
    "body": "\n        Oregon State football has found its next coach. The Beavers have hired Alabama assistant head coach JaMarcus Shephard, the school announced on Friday. CBS Sports' Matt Zenitz first reported the news of Shepard's impending hire on Thursday.Shephard has been at Alabama since joining Kalen DeBoer's staff in 2024. Over the last two seasons, Shephard has served as the Crimson Tide's assistant head coach, co-offensive coordinator and wide receivers coach.\"I'm honored to lead the Oregon State University football program and to join a community that cares so deeply about its student-athletes,\" Shephard said in a statement. \"We will build a culture rooted in toughness, integrity, and relentless effort, and I'm excited to get to work with our players, staff, and supporters to write the next great chapter of Beaver football.\"\n        \n            \n                College football coaching carousel tracker: Grades, analysis on coach changes, 2025-26 firings and hirings\n                \n                    Brandon Marcello                \n            \n                            \n    \n                \n                    \n    \nThis season, Shephard has helped build an offense that ranks 25th in the country in points per game at 33.8 and ninth in passing yards per game at 292.5. The offense has been humming for much of the season, and quarterback Ty Simpson has had a breakout campaign. Shephard will try to bring some of that magic with him to Corvallis.\nPrior to his tenure in Tuscaloosa, Shephard was with DeBoer at Washington, where he worked as the assistant head coach, passing game coordinator and wide receivers coach.\"I'm extremely excited to announce JaMarcus Shephard as the head coach of the Oregon State football program,\" Oregon State athletic director Scott Barnes said. \"His character and persona are top-notch and genuine, which will make all of Beaver Nation proud. His values align perfectly as an exceptional leader who fosters a sincere connection with his student athletes. He has coached at the highest level, with stops in the Pacific Northwest, and I cannot wait to see him on the recruiting trail and leading our football program to immediate success.\"After to playing college football at DePauw, Shephard began his coaching career at Northrop High School in Indiana. From there, he worked his way up through the ranks with stops at Western Kentucky, Washington State and Purdue.\nShephard will lead Oregon State into the new Pac-12, which will begin with the 2026 season and includes programs like Boise State and Colorado State. Shephard replaces former coach Trent Bray, who went 5-14 in 19 games.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon State hires JaMarcus Shepard: Alabama assistant tapped to lead Beavers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/eb13b0ab-683e-4769-8929-721b5a4d6927/thumbnail/1200x675/8a8ec93cce13c8a8a5b5d3965763f8e7/gettyimages-2247808669-2.jpg"
      ],
      "datePublished": "2025-11-28T15:32:24.000Z",
      "dateModified": "2025-11-28T15:32:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saquon Barkley among best bets for anytime touchdown scorer picks on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/eagles-bears-anytime-touchdown-scorer-picks-odds-predictions-back-saquon-barkley-nfl-black-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/e0d94d21-1da1-4913-b751-10332f17a345/thumbnail/1200x675/0f0b879dc26d9d0b50e52ab86420937a/saquon-barkley-philadelphia-eagles-3.jpg",
    "tag": "Sports",
    "date": "2025-11-28T13:22:43.000Z",
    "description": "\n        The NFL has expanded its holiday presence in recent years to include Black Friday, and this year's day after Thanksgiving matchup will pit th",
    "body": "\n        The NFL has expanded its holiday presence in recent years to include Black Friday, and this year's day after Thanksgiving matchup will pit the Philadelphia Eagles against the Chicago Bears. Kickoff is scheduled for 3 p.m. ET, and both teams lead their divisions with 8-3 records. Saquon Barkley has had a penchant for primetime since arriving in Philadelphia, rushing for 766 yards and scoring eight total touchdowns in eight night games the past two seasons. However, you can still find Barkley listed as high as -120 in the Eagles vs. Bears anytime touchdown scorer odds. He's one of our top NFL anytime TD scorer picks for Friday against a Bears defense down three starting linebackers.Targeting NFL player props is one way to approach NFL odds at online sports betting sites for NFL on Black Friday in Week 13. With NFL props available for almost every player in Bears vs. Eagles at top online sportsbooks, SportsLine's proven computer model can help you find value to add to your Black Friday NFL picks. New users can take advantage of sportsbook promos like the latest BetMGM bonus code, where new users can get up to $1,500 back in bonus bets if their first bet loses:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a sizzling 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, it has revealed its top anytime touchdown picks for Eagles vs. Bears.Best NFL on Black Friday anytime TD prop picks:A.J. Brown, Eagles (+115)Saquon Barkley, Eagles (-130)Colston Loveland, Bears (+400)Parlay these picks for +2000 odds with the latest DraftKings promo code and get $200 in bonus bets if your first $5 wager wins and three months free NBA League Pass:A.J. Brown, Eagles (+115, bet365)Brown has been the squeaky wheel that has gotten the grease in recent weeks, as he's received 21 targets in two weeks since vocalizing complaints about the offense on social media. He's parlayed those targets into 15 catches for 159 yards and a touchdown, and his YAC ability could make him a nightmarish matchup for a Bears defense battling injuries and struggling with its tackling. The model predicts that he scores in 57% of simulations, while these odds imply a 46.5% chance to score. Use the latest bet365 bonus code to find this price and get $150 in bonus bets after your first $5 wager win or lose.Saquon Barkley, Eagles (-130, DraftKings)The Eagles haven't been nearly as dominant up front as they were during Barkley's 2,000-yard season in 2024. However, he's still produced 943 scrimmage yards and six touchdowns over his first 11 games, and he's going up against a Chicago run defense that ranks 28th in the NFL this season. With three starting linebackers out against the Steelers, the Bears gave up 186 yards on the ground and a couple of rushing touchdowns. Barkley scores 0.70 touchdowns on average while his implied scoring probability is 56.5%. Get $200 in bonus bets if your first $5 wager wins and three months free NBA League Pass:Colston Loveland, Bears (+400, FanDuel)The No. 10 overall pick in the 2025 NFL Draft was eased into an offense that already had a $12 million tight end (Cole Kmet) on the roster. However, his role has been gradually expanding, and he's been one of the most productive tight ends in the NFL in recent weeks, catching 17 passes for 262 yards and three touchdowns in the last four games. The Eagles gave up a touchdown to Jake Ferguson last week, and the model predicts that Loveland scores 0.29 touchdowns to greatly outpace his 20% implied scoring probability. Use the latest FanDuel promo code to find this price and get $150 in bonus bets if your first $5 wager winws.Want more Week 13 NFL picks?You've seen the model's NFL anytime touchdown prop picks for several players in Eagles vs. Bears. Now, get NFL projections for every player prop at SportsLine.Need more from SportsLine? See today's best NFL picks from SportsLine's R.J. White, who is on a 125-97-3 roll (+2395) on his last 225 NFL picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saquon Barkley among best bets for anytime touchdown scorer picks on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/e0d94d21-1da1-4913-b751-10332f17a345/thumbnail/1200x675/0f0b879dc26d9d0b50e52ab86420937a/saquon-barkley-philadelphia-eagles-3.jpg"
      ],
      "datePublished": "2025-11-28T13:22:43.000Z",
      "dateModified": "2025-11-28T13:22:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB free agency: Four players who could be Black Friday-level bargains - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-free-agency-black-friday-bargains/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/23/22d017f1-e8d8-4ca8-8c6a-cda85528b62e/thumbnail/1200x675/52aab7bd2b312b4c053e567f6f5b21ca/rodgers-getty.png",
    "tag": "Sports",
    "date": "2025-11-28T15:45:07.000Z",
    "description": "\n        If there's one thing everyone loves, it's finding a bargain. It's true of you, it's true of me, it's true of front offices across MLB. So, on",
    "body": "\n        If there's one thing everyone loves, it's finding a bargain. It's true of you, it's true of me, it's true of front offices across MLB. So, on this blessed day when consumerism runs amok, I'm here to continue a longstanding tradition at CBS Sports by identifying four discounted MLB free agents who I believe could offer a lot more to teams next season than you'd expect.For those new to this piece, the only restriction I place on myself is that I do not include any players who were in my top-50 free-agent rankings. Everyone else is fair game. As far as track record goes, last year's version of this piece included Carson Kelly and Mike Soroka. In the past, this feature has also correctly identified Jacob Stallings, Pierce Johnson, Anthony DeSclafani, and Luis Garcia, among others. Now, let's get to it.1. RHP Tyler Kinley\nKinley, 35 come January, closed out the season with an excellent 24-game stint that saw him compile a 0.72 ERA and a 3.67 strikeout-to-walk ratio as a member of the Braves. Overall, he ranked in the 93rd percentile in average exit velocity allowed, which speaks to his pair of high-quality breaking balls. Those pitches ought to play up even more for as long as he's freed from Colorado's high altitude.There are some real similarities, in style and in background, between Kinley and Brewers reliever Nick Mears. They both survived stints with the Rockies and now they both feature north-south arsenals. That may not read like a flattering comparison for Kinley, but keep in mind Mears made the third-most high-leverage appearances for baseball's best regular season -- that counts for something.\nI would expect Kinley to settle for a one-year pact and to serve as a competent middle reliever.2. 2B Brendan Rodgers\nRodgers, 29, was one of last season's worst-performing hitters. In 43 games with the Astros, he batted .191/.266/.278 (52 OPS+) with six extra-base hits and more than four times as many strikeouts as walks. Rodgers' summer didn't get better after he suffered an oblique injury in mid-June. He had one rehab assignment end after a collision with a teammate resulted in a concussion and fractured nose, and another later dashed because of lumbar spine inflammation. Things can only get better, right? I think so, in part because Rodgers' season did include some interesting underlying tweaks. He upped his bat speed and altered his point-of-contact so that he was intending to pull and lift the ball. Those changes, unfortunately, introduced a significant -- and thus far overwhelming -- amount of swing-and-miss to his game.\nRodgers has two converging paths to pick from this offseason: revert to being a more contact-driven batter or make the necessary adjustments to his new approach. My guess is he'll find better results either way -- hopefully enough that he's again a capable second-division starter when combined with his solid defense at second base.3. LHP Sean Newcomb\nNewcomb split last season between the Red Sox and the Athletics, tallying a 2.73 ERA (153 ERA+) and a 2.94 strikeout-to-walk ratio. Teams aren't going to view him as a likely bet to perform so well heading forward. Still, I wouldn't be shocked if some club entertains him as a back-end rotation option.Although Newcomb hasn't made double-digit starts at the big-league level since 2018, he continues to sport a six-pitch arsenal that features three fastball variants. He's not blessed with more than one or two above-average offerings anymore, but recent history has shown pitchers can benefit from the cascading effects of having so many different looks to throw a hitter's way. \nNewcomb also took a step forward in respect to his control by throwing nearly 65% of his pitches for strikes -- not bad for someone who, even now, sits below 62% for his career.Again, I won't pretend Newcomb is a secret stud. But when you look around the league at who some teams are starting, it's probably fair to think he should get a shot.4. LHP Justin Wilson\nWilson had a quality year with the Red Sox, shredding opponents with a three-pitch mix that was heavy on four-seamers, sliders, and cutters. In 61 outings, he generated a 3.35 ERA (123 ERA+) and a 2.85 strikeout-to-walk ratio. I'm including him in this piece anyway for two reasons.\nFirst and foremost, Wilson celebrated his 38th birthday last August. Teams, almost as a rule, no longer give relievers that old multi-year pacts. Indeed, the only free-agent reliever I could find in the past five winters who signed a multi-year agreement was Darren O'Day -- and he inked a two-year deal with the Yankees in 2021 for a trivial $3.2 million. Otherwise? Daniel Bard signed an extension with the Rockies the following summer for $19 million, and that's it. I doubt Wilson proves to be an outlier and that's in part because of the second reason he's on this list: his erratic past few years. He missed the entirety of the 2023 season because of injury and then posted a 5.59 ERA in 2024. Even so, I think he has a chance to be a solid get on a one-year arrangement. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB free agency: Four players who could be Black Friday-level bargains - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/23/22d017f1-e8d8-4ca8-8c6a-cda85528b62e/thumbnail/1200x675/52aab7bd2b312b4c053e567f6f5b21ca/rodgers-getty.png"
      ],
      "datePublished": "2025-11-28T15:45:07.000Z",
      "dateModified": "2025-11-28T15:45:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan vs. Ohio State: Wolverines out to rewrite history, stamp CFP candidacy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-ohio-state-rivalry-game-history-college-football-playoff-implications/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/ff494d66-c561-4295-8c0a-67bf671bf4be/thumbnail/1200x675/cce76544f2b6183fa6a640caef8da948/michigan-football.png",
    "tag": "Sports",
    "date": "2025-11-28T13:40:09.000Z",
    "description": "\n        Ninety-nine years ago — back when Woody Hayes was just a teenager and Bo Schembechler was but a glint in his father's eye — Michigan pulled o",
    "body": "\n        Ninety-nine years ago — back when Woody Hayes was just a teenager and Bo Schembechler was but a glint in his father's eye — Michigan pulled off something it hasn't managed since: five straight wins over Ohio State.Nearly a century later, the No. 15 Wolverines (9-2) are staring at the same possibility. Beat the No. 1 Buckeyes (11-0) on Saturday and Michigan ties a streak that predates Route 66 and the Great Depression, a run almost no one saw coming when this rivalry flipped four years ago.\"This four-year run, especially with that strange, strange result last year, is remarkable,\" said Greg Dooley, a university lecturer and Michigan football historian.Last season's shocker in Columbus added more powder to the keg. A 13-10 Michigan win as a 19.5-point underdog sparked turmoil after Michigan planted its flag at midfield. Tempers flared, chaos ensued and police cleared the scene with pepper spray.\nMichigan enters Round 121 of The Game as a 10.5-point underdog, per FanDuel. Everything feels bigger this time. A win could propel Michigan into the College Football Playoff and possibly set up a postseason rematch.\"They acknowledge, they understand the importance of this game, that it's different than last year,\" Michigan coach Sherrone Moore said. \"You're playing for something big. And that's what you want.\"\n        \n            \n                2025 Big Ten Championship Game scenarios: Tiebreakers, paths for Ohio State, Oregon, Michigan, Indiana\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nThis isn't just another meeting. Ohio State and Michigan fans have lived, breathed, obsessed and verbally sparred over this rematch since the players cleared from The Horseshoe in Columbus a year ago.\n\"Every single day. That's what this game means to me. It means everything to me,\" said senior Michigan tight end Marvin Klein. \"If you ask me what the greatest day of my life was, it was last year, going down there and beating them in their place. It was the best day of my life so far. Trying to repeat that this year.\"The stakes are high. A playoff spot for Michigan is on the line. An undefeated record and possibly a No. 1 seed for Ohio State is at stake. And Ryan Day is still trying to quiet the critics -- even after winning the national title last season -- because of his 1-4 record against The Team Up North.\"Like I say, fun is kicking ass, and that's what we want to do on Saturday,\" Day said. \"So we're preparing to do that, and that's it. There's nothing funny about this at all, but the fun part is winning.\"\nThe Game is a pressure cooker. Last year's loss aggravated some Ohio State fans so much that Day was compelled to hire security to guard his home. His family was reduced to tears.Former Michigan coach Lloyd Carr knows the cycle better than most. He started 3-0 against OSU and went 5-1 before dropping six of his final seven.\"When you're on a streak, there's nothing like it,\" Carr told CBS Sports. \"And when you're on the downside, you live every day with the thought that you have to lead this team into victory in this game.\"\nMichigan's current run began in 2021 when Jim Harbaugh hopped off the hot seat and snapped Ohio State's eight-year stranglehold with a 42-27 win. That win sparked the program's run to the 2023 national championship. Since that afternoon in 2021, when fans stormed the field and grown men cried in the snow, the rivalry has only become more serious. On-field drama. Off-field controversy. And a sign-stealing scandal that added jet fuel to Ohio State's fury.Then came 2023: an undefeated showdown, Harbaugh suspended and Michigan sealing a 30-24 win with a late interception. It became a defining moment in the rivalry for Michigan.\n\"It's undeniable that it's the biggest game in the history of the rivalry when you look at it,\" Dooley said. \"But it frankly almost felt like a relief for Michigan fans.\"For comparison, you have to rewind to the 1990s when Michigan ambushed four Ohio State teams -- including three undefeated Buckeye teams -- ranked in the top five.\"In the '90s, the tables were turned,\" Dooley said. \"Ohio State had these superpower teams. It has a similar feel to today, where it just seems so unlikely for us to get them again -- and we kept doing it.\"\nThe Game is an unbreakable spell. It can make grown men tumble to their knees and create moments that imprint on generations. It has produced a Ten-Year War, a Game of the Century, a Snow Bowl, gold pants, and heroes and villains in sweater vests. Michigan even began rewarding players with their own gold pendants in 2021, a nod to Ohio State's gold pants tradition that began in 1934 and sparked a four-game winning streak against the Wolverines. \"By the way, it set off a series of victories in a row that ended up with our coach being fired,\" Dooley laughed.If Michigan stretches this run to five, it would stitch a new page into a rivalry saga that hasn't seen a twist like this in almost a century.\n\"I just know that being a part of rivalries, the other games don't matter,\" Moore said. \"Whatever happened in the past doesn't matter. So all we can do is focus on now.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan vs. Ohio State: Wolverines out to rewrite history, stamp CFP candidacy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/ff494d66-c561-4295-8c0a-67bf671bf4be/thumbnail/1200x675/cce76544f2b6183fa6a640caef8da948/michigan-football.png"
      ],
      "datePublished": "2025-11-28T13:40:09.000Z",
      "dateModified": "2025-11-28T13:40:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football picks: Predictions, odds for key top 25 games on Black Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-picks-predictions-odds-top-25-games-week-14-black-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/27/cb9fdd5c-ff11-4bb8-9b78-485e4d2c0a80/thumbnail/1200x675/6f72ce38f7e6e50a3ef65a003fde2b66/marcel-reed-t25-picks-1.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:51:39.000Z",
    "description": "\nThe final weekend of the 2025 college football regular season has arrived, bringing an incredible slate of rivalry matchups with far-reaching ramific",
    "body": "\nThe final weekend of the 2025 college football regular season has arrived, bringing an incredible slate of rivalry matchups with far-reaching ramifications. The fun starts Friday when Iowa and Nebraska renew what has quickly developed into a fierce rivalry. No. 7 Ole Miss travels to Mississippi State for an Egg Bowl showdown that will likely determine both teams' postseason fate. The Rebels are eying a College Football Playoff berth and the Bulldogs would love nothing more than to throw a monkey wrench into those plans.  The subplot surrounding Lane Kiffin's future only adds to the intrigue between bitter in-state foes. Speaking of bitter in-state foes, No. 23 Georgia Tech hosts No. 4 Georgia on Friday afternoon before No. 16 Texas welcomes No. 3 Texas A&M in the evening. This trio of successive SEC rivalry clashes carries CFP implications and the kind of intensity reserved for only the sport's fiercest matchups. Iowa vs. Nebraska \nNoon on CBS, CBSSports.com, CBS Sports App, Paramount+ Premium: We throw out the record books in rivalry games like this because anything can happen, so I'm not sure who will win, or who will cover. However, I don't expect there to be a lot of points scored in this one. It's going to be cold at Memorial Stadium, and with TJ Lateef at QB for the Cornhuskers now, this team has leaned heavily on its rushing attack. Iowa's been a run-heavy team all year. Unless we see a lot of explosive rushing plays (not out of question) or numerous defensive and special teams scores (also not out of the question!), I don't think either offense does enough to put a lot of points on the board. After all, the last two meetings have finished with 13-10 scores.  Pick: Under 38.5 No. 7 Ole Miss vs. Mississippi State \nNoon on ABC, fuboTV (try for free): Distractions aside, this is a game that Ole Miss should win handily. The Egg Bowl is a weird game, so it can be hard to predict, but the Rebels have a distinct advantage in almost every major category. They should be able to move the ball at-will against a Mississippi State team that ranks 15th in the SEC in total defense (393.2 yards per game) and scoring defense (28.4 points per game). Ole Miss wins by at least a touchdown (plus the extra point) for the third year in a row. Pick: Ole Miss -6.5 (-120)  \t \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            Ole Miss -7.5\n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miss. State\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    No. 4 Georgia vs. Georgia Tech \n3:30 p.m. on ABC, fuboTV (try for free): November has unfolded in starkly different ways for these two programs. Georgia has extended its win streak to seven games, while Georgia Tech has dropped two of its last three, watching its CFP hopes slip away. The Bulldogs' defense has been dominant against Power Four opponents over the last three contests, allowing just 17 points per game and 3.11 yards per carry. Georgia Tech, by contrast, is 3-2 in games where it averages fewer than five yards per rush, with a combined -13 point margin in those contests. Pick: Georgia -13.5  \t \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            Georgia -14\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    No. 16 Texas vs. No. 3 Texas A&M 7:30 p.m. on ABC, fuboTV (try for free): From a matchup perspective, Texas A&M clearly has the upper hand. Their passing offense will gave Texas' defense fits. Top pass rusher Cashius Howell is a matchup nightmare against an inconsistent Longhorns offensive line. Even their special teams has created opportunities. But in a rivalry game of this magnitude, it will be a mental game above all. Mike Elko's squad has stepped up in the biggest moments, and they will do the same to clinch their first spot in the SEC Championship Game and finish 12-0. Pick: Texas A&M -2.5  \t \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            A&M -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas A&M\n                    \n    \n    Who will win and cover in each Week 14 college football rivalry game? Legendary Vegas expert Bruce Marshall is on a 38-29 roll on college football picks. Visit SportsLine now to see all his college football picks. Boise State vs. Utah State prediction, picks Noon on CBS, CBSSports.com, CBS Sports App, Paramount+ Premium: If Boise State can get its rushing attack going against Utah State, the Broncos will be able to walk away with a win and a spot in the Mountain West title game. Boise State likes to control the time of possession, while Utah State ranks No. 122 in the FBS (28 minutes) in that category. Another key matchup to watch is Boise State's red zone defense, as the Broncos rank No. 128 in the FBS. Look for Boise State to control the clock and come away with a win over Utah State. Pick: Boise State -3.5 Watch Boise State vs. Utah State live at 4 p.m. ET on CBS and streaming live on CBSSports.com, the CBS Sports App and Paramount+ Premium. Keep it locked here for live updates, analysis and highlights from the game on Friday. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football picks: Predictions, odds for key top 25 games on Black Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/27/cb9fdd5c-ff11-4bb8-9b78-485e4d2c0a80/thumbnail/1200x675/6f72ce38f7e6e50a3ef65a003fde2b66/marcel-reed-t25-picks-1.jpg"
      ],
      "datePublished": "2025-11-28T15:51:39.000Z",
      "dateModified": "2025-11-28T15:51:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best betting apps, NFL sportsbooks promos: How, where to bet Bears-Eagles in the 2025 NFL Black Friday Game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-betting-apps-nfl-sportsbooks-promos-how-where-to-bet-bears-eagles-2025-nfl-black-friday-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/480be0f9-c864-4b47-a9d4-6aec28de4041/thumbnail/1200x675/17df48aada55f37d486383527f73a49e/jalen-hurts-philadelphia-eagles-6.jpg",
    "tag": "Sports",
    "date": "2025-11-28T13:30:22.000Z",
    "description": "\n        The fourth consecutive NFL Black Friday Game takes place on Friday, Nov. 28, in a new annual NFL tradition for Thanksgiving Weekend. This yea",
    "body": "\n        The fourth consecutive NFL Black Friday Game takes place on Friday, Nov. 28, in a new annual NFL tradition for Thanksgiving Weekend. This year, the defending Super Bowl champion Philadelphia Eagles (8-3) host the Chicago Bears (8-3). The Eagles are coming off a 24-21 loss to the Cowboys on Sunday, where they blew a 21-0 lead, including being outscored 17-0 in the second half. Meanwhile, the Bears enter on a four-game winning streak off a 31-28 victory over the Steelers last week. However, they need a win on Friday to avoid falling behind Green Bay in the NFC North standings. The 2025 NFL Black Friday Game is scheduled to kick off at 3 p.m. ET. The Eagles are favored by seven points, according to the latest Bears vs. Eagles odds, while the over/under for total points scored is 44.5.There are dozens of betting options if you're wondering how to bet on the NFL, or more specifically, Eagles vs. Bears. Here's a closer look at available sportsbook promos on some of the top NFL betting sites, as well as the best betting apps that are available for Bears vs. Eagles on Black Friday, with instructions on how to claim each offer and where to bet NFL.Where to bet on Bears vs. Eagles in the NFL Black Friday GameBrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus bets and 3 months of NBA League Pass free if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $150 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash CBSFANThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users $150 in bonus bets with the placement of a $5+ bet, whether the bet wins or loses.At DraftKings and FanDuel, you need to win your first bet to receive the bonus. FanDuel offers new users $150 in bonus bets if their first bet of at least $5 wins. DraftKings offers $200 in bonus bets with a winning wager of at least $5, but with the latest DraftKings promo code, new users will receive three months of NBA League Pass free, on top of the $200 in bonus bets.The latest Fanatics Sportsbook promo code CBSFAN provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code is different than the aforementioned offers, providing profit boosts instead of bonus bets. At Caesars, new users can get 20 100% sportsbook profit boosts with a $1 bet. Bettors can use any of these promotions for Eagles vs. Bears in the 2025 NFL Black Friday Game on Friday, November 28.Bears vs. Eagles betting preview, picksBears (+7) vs. Eagles\"The Bears have now won eight of their last nine, and yet they're not getting respect due to the quality of their opponents,\" SportsLine NFL expert RJ White said. \"This should be a bigger test against an Eagles team that has the potential to be elite on both sides of the ball, but their offense has not lived up to last year's baseline, while the defense just blew a 21-0 lead against a division rival. Only one of the Eagles' eight wins has been by more than 7, so all we're asking here is for Ben Johnson to do as good a job as most teams have against Philly this year to keep this a one-score game.\"Over 44.5 pointsBen Johnson has proven he was ready for the big chair as an NFL head coach, as the former standout Lions offensive coordinator is leading another elite offensive unit in the NFC North. The Bears are eighth in the league in scoring offense at 26.3 points per game. The defense has struggled, though, ranking 27th at 26.5 ppg allowed this year. The Eagles' offense is one of the most perplexing aspects about the 2025 NFL season, as the unit is filled with star power such as Jalen Hurts, Saquon Barkley, A.J. Brown and DeVonta Smith, yet it ranks in the middle of the league in scoring at 23.2 ppg, which is 17th. The Bears' defense could be what the Eagles need to break out, though. The model projects the Over to hit in 55% of simulations.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best betting apps, NFL sportsbooks promos: How, where to bet Bears-Eagles in the 2025 NFL Black Friday Game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/480be0f9-c864-4b47-a9d4-6aec28de4041/thumbnail/1200x675/17df48aada55f37d486383527f73a49e/jalen-hurts-philadelphia-eagles-6.jpg"
      ],
      "datePublished": "2025-11-28T13:30:22.000Z",
      "dateModified": "2025-11-28T13:30:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 13 college football odds, picks, predictions, betting guide for Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/week-14-college-football-best-bets-odds-friday-college-football-picks-betting-predictions-nov-28/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/c5a474f0-ba77-4fd3-b7d6-dc26576cd299/thumbnail/1200x675/6cd0ec0b341ebffa32483bbac1bdba93/arch-manning-texas-longhorns-4.jpg",
    "tag": "Sports",
    "date": "2025-11-28T13:36:29.000Z",
    "description": "\n        The Black Friday college football schedule is unlike any other Friday during college football season, featuring critical rivalry games throug",
    "body": "\n        The Black Friday college football schedule is unlike any other Friday during college football season, featuring critical rivalry games throughout the day. Georgia heads to Georgia Tech at 3:30 p.m. ET in a matchup with College Football Playoff Implications for the Bulldogs, who are 14-point favorites in the Week 14 college football odds. Later in the day, Texas (+2.5) hosts Texas A&M at 7:30 p.m. ET, while Purdue (+28.5) faces Indiana in a Big Ten rivalry matchup at the same time. The Hoosiers are undefeated and cruised to a 66-0 win over Purdue last year, but SportsLine's proven computer model is backing the Boilermakers to cover the spread in its Friday college football best bets for online sports betting. Click here to bet on Friday's games with the latest Fanatics Sportsbook promo code CBSFAN, which gives new users up to $2,000 in bet insurance FanCash:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Best bets for Friday's college football scheduleGeorgia -14 vs. Georgia TechTexas +2.5 vs. Texas A&MPurdue +28.5 vs. IndianaCombining the model's three picks into a Week 14 college football parlay would result in a payout of +590 (risk $100 to win $590). Bet it now at Caesars Sportsbook: Friday college football best bets Game: Georgia Tech Yellow Jackets vs. Georgia Bulldogs, 3:30 p.m. ET The Pick: Georgia -14Georgia is still alive for an SEC Championship game appearance heading into the final week of the regular season, as it has won seven straight games since losing to Alabama by a field goal in late September. The Bulldogs have knocked off multiple top-10 opponents during that stretch, including a 35-10 win over then-No. 10 Texas two weeks ago. They are averaging 33.7 points per game while allowing just 17.4 points per game. Georgia Tech has lost two of its last three games, and it has lost seven straight games against Georgia. SportsLine's proven computer model has the Bulldogs covering the spread in 66% of simulations.    Bet Georgia vs. Georgia Tech at BetMGM, where new users can get up to $1,500 back in bonus bets if your first bet loses:Game: Texas Longhorns vs. Texas A&M Aggies, 7:30 p.m. ETThe Pick: Texas +2.5Texas A&M needs a win to clinch its spot in the SEC Championship, otherwise it will be needing losses from Alabama and Ole Miss. The Aggies have had several close calls this season, beating Notre Dame by one point, Auburn by six points, Arkansas by three points and South Carolina by one point in a game that the Gamecocks led by 27 points. Texas has won five of its last six games, and it is riding an eight-game home winning streak. Texas A&M is just 5-11 against the spread in its last 16 games, so the model has Texas covering in 57% of simulations on Friday night.  Bet Texas vs. Texas A&M at FanDuel, where new users receive $150 in bonus bets if your first $5 bet wins:Game: Purdue Boilermakers vs. Indiana Hoosiers, 7:30 p.m. ETThe Pick: Purdue +28.5Purdue is on a nine-game losing streak since opening the season with a pair of blowout victories, but only one of those losses came by 28-plus points, which was last week at Washington. The Boilermakers previously lost to Ohio State by 24 points, Michigan by five points and Notre Dame by 26 points, among others. Indiana is going on the road for the third time in four weeks, so the mileage is starting to add up. Purdue has won five of the last seven head-to-head meetings between these teams, covering the spread in six of the last eight matchups. Bet Indiana vs. Purdue at DraftKings, where new users get $200 in bonus bets and three free months of NBA League Pass:More college football best betsEvery college football game simulated 10,000 times\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 13 college football odds, picks, predictions, betting guide for Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/c5a474f0-ba77-4fd3-b7d6-dc26576cd299/thumbnail/1200x675/6cd0ec0b341ebffa32483bbac1bdba93/arch-manning-texas-longhorns-4.jpg"
      ],
      "datePublished": "2025-11-28T13:36:29.000Z",
      "dateModified": "2025-11-28T13:36:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football odds, lines Rivalry Week predictions: Picks from expert on 38-29 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-rivalry-week-2025-picks-spreads-predictions-best-bets-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/1e234d3c-b413-45f6-b2b5-6f9052dd16b2/thumbnail/1200x675/8db8918c78da12c0934fdfcff7b2019e/john-mateer-oklahoma-ssoners-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:20:53.000Z",
    "description": "\n        The Week 14 college football schedule, also known as Rivalry Week, is loaded with rivalry matchups that also have College Football Playoff im",
    "body": "\n        The Week 14 college football schedule, also known as Rivalry Week, is loaded with rivalry matchups that also have College Football Playoff implication. Some of the key Week 14 college football odds include at least one playoff contender include Texas A&M (-2.5) vs. Texas, Tennessee (-3) vs. Vanderbilt, Ohio State (-9.5) vs. Michigan and Alabama (-5.5) vs. Auburn. The action continues Friday and Saturday, and there are dozens of opportunities remaining to make college football best bets on rivalry matchups. Before locking in any Week 14 college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He entered Week 14 of this season on an 38-29 run on his official SportsLine college football picks as well, returning more than $500 for $100 bettors. Anyone following could have seen huge returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for Week 14 and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Week 14One of the top college football picks Marshall is recommending for Week 14: He's backing Oklahoma (-10.5) to cover against LSU at 3:30 p.m. ET on Saturday in a game he also projects to go Under the total (36.5).LSU dominated this matchup 37-17 last season in Baton Rouge, but the Tigers are going nowhere this season after firing Brian Kelly, while the Sooners are a win away from a likely playoff berth. That should give the clear motivation edge to the Sooners, who have now knocked off three ranked teams in a row. \"LSU is on an 0-5 spread skid heading into weekend,\" Marshall told SportsLine. \"LSU is also 1-7 in last eight vs. number in 2025 and is 8-3 to the Under this campaign and 0-4 in last four as the underdog this term. The Sooners have won and covered in last three this season and 9-2 to the Under in 2025.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football picks for Week 14Marshall has evaluated every other matchup, and he's backing a quarterback who is on an 18-6 streak against the spread dating back to last season. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 38-29 run on college football picks this season, and find out.College football odds for notable Week 14 gamesSee full Week 14 college football picks, odds, predictions here(odds subject to change)Friday, Nov. 28Ole Miss vs. Mississippi State (+7, 62.5)Georgia vs. Georgia Tech (+14, 59.5)Texas A&M vs. Texas (+2.5, 52.5)Indiana vs. Purdue (+28.5, 53.5)Saturday, Nov. 29Ohio State vs. Michigan (+9.5, 43.5)Clemson vs. South Carolina (-2.5, 46.5)Miami vs. Pitt (+7, 49.5)LSU vs. Oklahoma (-10.5, 36.5)Vanderbilt vs. Tennessee (-3, 65.5)Oregon vs. Washington (+6.5, 51.5)Florida State vs. Florida (-1.5, 50.5)Alabama vs. Auburn (+5.5, 46.5)UCLA vs. USC (-21.5, 59.5)Notre Dame vs. Stanford (+32.5, 49.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football odds, lines Rivalry Week predictions: Picks from expert on 38-29 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/1e234d3c-b413-45f6-b2b5-6f9052dd16b2/thumbnail/1200x675/8db8918c78da12c0934fdfcff7b2019e/john-mateer-oklahoma-ssoners-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T15:20:53.000Z",
      "dateModified": "2025-11-28T15:20:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football odds, picks, lines, spreads: Week 14 predictions, best bets for rivalry games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-odds-lines-spreads-picks-predictions-best-bets-rivalry-week-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/28/967d0dec-3446-418b-82b7-69928440a8ae/thumbnail/1200x675/ce39eda966b91493f3c6775e3237b57e/chandler-morris-virginia-cavaliers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-28T15:08:32.000Z",
    "description": "\n        There's no better time to make college football picks than during Rivalry Week, which is loaded with fierce foes squaring off. From Ohio Stat",
    "body": "\n        There's no better time to make college football picks than during Rivalry Week, which is loaded with fierce foes squaring off. From Ohio State vs. Michigan (+9.5) to Alabama vs. Auburn (+5.5) to Virginia vs. Virginia Tech (+8.5), many may place Week 14 college football bets with their hearts as much as their heads. Not only can you make picks on those conference matchups, but a number of non-conference contests could factor into your college football betting strategy. South Carolina is a 2.5-point favorite over Clemson, per the latest Week 14 college football odds, in an SEC vs. ACC battle.Others of that ilk include Florida vs. Florida State (+1.5) and Kentucky vs. Louisville (-3). Meanwhile, no team has performed better in college football picks against the spread than Texas Tech, which is 10-1 versus the line. The Red Raiders are 23.5-point favorites over West Virginia as the former seeks a win to secure its first-ever trip to the Big 12 Championship Game. Before locking in any Week 14 college football picks, be sure to see the latest Week 14 college football predictions from SportsLine's proven model. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest college football odds and Week 14 college football betting lines on the spread, money line, and over/under. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Rivalry WeekOne of the college football picks the model is high on during Week 14: Florida (-1.5, 49.5) covers against Florida State in a 4:30 p.m. ET Saturday kickoff nearly 60% of the time. The Gators have been much more competitive since firing Billy Napier as the team has as many ATS wins (two) in four games under interim Billy Gonzales as it had in seven games under Napier. Florida won last year's matchup -- by 20 points on the road -- and it hosting this year's contest gives it a massive advantage. The Seminoles have not won or covered in an away stadium since 2023 as they are 0-8 both straight-up and against the spread over that run. In addition to Florida covering, the model forecasts the Under to hit in over 60% of simulations. See which other picks the model likes here.\nAnother prediction: Virginia Tech (+8.5, 52.5) covers on the road versus No. 17 Virginia at 7 p.m. ET on Saturday. It's impossible to ignore the outright dominance of the Hokies over their in-state rival in this series, as Virginia Tech has won 19 of its last 20 games versus Virginia Tech. The last few matchups haven't even been close, as Virginia Tech won by 20 points at home last year and prevailed by 38 points the last time UVA hosted in 2023. This year, the Hokies have played much better under interim coach, Philip Montgomery, as they've both outright won and covered three times under him, compared to being winless both straight up and ATS under former coach Brent Fry. UVA has dropped two straight at home ATS as the model forecasts this as a one-score game. The model projects the Hokies to cover well over 50% of the time. See the rest of the model's picks here.\nHow to make college football picks for Week 14The model has also made the call on who wins and covers in every FBS matchup in Week 14, and it's identified several A-rated picks involving major games. You can only get every pick for every game at SportsLine, and for a limited time you can use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and which A-rated picks should you jump on? Check out the latest college football odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $2,000 in profit since its inception, and find out.Week 14 college football odds for notable gamesSee full Week 14 college football picks, odds, predictions here(odds subject to change)Friday, Nov. 28Ole Miss vs. Mississippi State (+7, 62.5)Georgia vs. Georgia Tech (+14, 59.5)Texas A&M vs. Texas (+2.5, 52.5)Indiana vs. Purdue (+28.5, 53.5)Saturday, Nov. 29Ohio State vs. Michigan (+9.5, 43.5)Clemson vs. South Carolina (-2.5, 46.5)Miami vs. Pitt (+7, 49.5)LSU vs. Oklahoma (-10.5, 36.5)Vanderbilt vs. Tennessee (-3, 65.5)Oregon vs. Washington (+6.5, 51.5)Florida State vs. Florida (-1.5, 50.5)Alabama vs. Auburn (+5.5, 46.5)UCLA vs. USC (-21.5, 59.5)Notre Dame vs. Stanford (+32.5, 49.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football odds, picks, lines, spreads: Week 14 predictions, best bets for rivalry games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/28/967d0dec-3446-418b-82b7-69928440a8ae/thumbnail/1200x675/ce39eda966b91493f3c6775e3237b57e/chandler-morris-virginia-cavaliers-imagn-images.jpg"
      ],
      "datePublished": "2025-11-28T15:08:32.000Z",
      "dateModified": "2025-11-28T15:08:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Eagles-Bears, Texas-Texas A&M today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-free-nba-league-pass-eagles-bears-texas-texas-a-m-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg",
    "tag": "Sports",
    "date": "2025-11-28T13:48:32.000Z",
    "description": "\n        Retail sites aren't the only places where you'll find top offers on Black Friday, as new users can capitalize on the latest DraftKings promo ",
    "body": "\n        Retail sites aren't the only places where you'll find top offers on Black Friday, as new users can capitalize on the latest DraftKings promo code to receive $200 in bonus bets and three free months of NBA League Pass for Friday online sports betting. Friday features a packed slate with Eagles vs. Bears in a pair of divisional leaders, Texas A&M looking to secure its spot in the SEC Championship Game and College Football Playoff in a contest against Texas, and NBA Cup betting in the final week of group play. The SportsLine Projection Model has found value in the action, including backing Over 44.5 total points in Eagles vs. Cowboys and the Lakers to cover as 10.5-point favorites against the Mavericks in its Friday best bets at DraftKings Sportsbook.One of SportsLine's top experts also has a pick on Texas vs. Texas A&M. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins, plus 3 months of NBA League Pass free: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 13 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returnsFriday best bets at DraftKings SportsbookEagles vs. Bears: Over 44.5 total pointsTexas (+2.5) vs. Texas A&MLakers (-10.5) vs. MavericksCombining the model's three picks into a Friday parlay at DraftKings would result in a payout of +644 (risk $100 to win $644). Bet it at DraftKings here:\nEagles vs. Bears: Over 44.5 total points (-108)The Bears have climbed up the top-scoring offense rankings over recent weeks during their four-game winning streak, as Chicago currently has the No. 8 scoring offense at 26.3 points per game this season. The Bears are coming off a 31-28 win over the Steelers, and Chicago is averaging 30.3 ppg over its last four contests. Meanwhile, the Eagles have a star-studded offense that's always capable of big-time plays, led by Jalen Hurts, Saquon Barkley, A.J. Brown and DeVonta Smith. The model projects the Over to hit in 55% of simulations. Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Texas (+2.5) vs. Texas A&M (-102)\"Whew! The Ags are still unbeaten but have cut it close more than once, especially two weeks ago vs. South Carolina, and earlier escapes at Notre Dame and Arkansas. Flying so close to the flame, A&M could eventually get burned, and cannot again afford QB Marcel Reed to make mistakes as his two picks vs. the Gamecocks on November 15 nearly proved very costly,\" SportsLine legendary expert Bruce Marshall said. \"Texas salvages its season with a win and keeps its remote playoff chances alive (there will need to be lots of dominoes falling the Longhorns' way, but not impossible). The defense will need to prevent too many big plays by Reed, but Arch Manning has played his best games in November, and the Horns offense is starting to click. Play Texas\" Back Texas at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:Lakers (-10.5) vs. MavericksLuka Doncic goes up against his former team again on Friday, and although it's not the first time since being traded away, you'd have to imagine there are still personal feelings on Doncic's end against Dallas. Although the Mavericks fired general manager Nico Harrison, it's still the same ownership that approved the trade. Doncic had a triple-double with 19 points, 15 rebounds and 12 assists in his first meeting, and then scored 45 points in his final meeting against Dallas last year. The Lakers won both of those contests by an average of 11.5 points. The Lakers are 13-4 and have won five straight games, while the Mavericks are 5-14 and tied for the second-worst record in the Western Conference. The model projects the Lakers to cover in 65% of simulations. Back the Lakers at DraftKings Sportsbook, where new users get $200 in bonus bets and 3 free months of NBA League Pass:\nWant more Friday NFL, NBA and college football picks?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets, free NBA League Pass for Eagles-Bears, Texas-Texas A&M today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/d8ea99a5-f58a-4cef-92a5-837396e992ff/thumbnail/1200x675/c326e2c46e85bab4a9de4bd571a134dc/draftkings-200-league-pass-promo.jpg"
      ],
      "datePublished": "2025-11-28T13:48:32.000Z",
      "dateModified": "2025-11-28T13:48:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]