[
  {
    "title": "Model locks in Ravens vs. Browns picks, score prediction, SGP for NFL Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-browns-where-to-watch-nfl-week-11-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/55aaee80-cdf0-4fbf-87cd-69be03aafe5d/thumbnail/1200x675/719e0a37a1350be7216e847de8efa9e1/derrick-henry-lamar-jackson.jpg",
    "tag": "Sports",
    "date": "2025-11-16T20:01:03.000Z",
    "description": "\n        The Baltimore Ravens (4-5) look to win their fourth in a row when they take on the AFC North-rival Cleveland Browns (2-7) in NFL Week 11 acti",
    "body": "\n        The Baltimore Ravens (4-5) look to win their fourth in a row when they take on the AFC North-rival Cleveland Browns (2-7) in NFL Week 11 action on  Paramount+. The Ravens, second in the division, are trying to chase down the Pittsburgh Steelers for the AFC North lead. Baltimore and quarterback Lamar Jackson have been on a roll and are coming off a 27-19 win over the Minnesota Vikings. The Browns and rookie quarterback Dillon Gabriel, meanwhile, have struggled, losing five of their last six games, including a 27-20 loss to the New York Jets last week.Kickoff from Huntington Bank Field in Cleveland is set for 4:25 p.m. ET on CBS and Paramount+. Baltimore is a 7.5-point favorite in the latest Ravens vs. Browns odds from SportsLine consensus, while the over/under for total points scored is 38.5. The Ravens are -455 money line favorites (risk $455 to win $100), while the Browns are +347 underdogs. Before making any Ravens vs. Browns picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Ravens vs. Browns at DraftKings Sportsbook, where new users get $300 in bonus bets if your initial $5 bet wins and three months of NBA League Pass free:Where to bet on Ravens vs. BrownsBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Ravens vs. Browns on SundayWhen: Sunday, Nov. 16Time: 4:25 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppRavens vs. Browns betting previewOdds: Ravens -7.5, over/under 38.5Despite battling injuries for much of the season, Baltimore's Lamar Jackson is having yet another MVP-type season. In six games, he has completed 103 of 147 passes (70.1%) for 1,249 yards and 15 touchdowns with one interception and a 127.1 rating. He has also rushed 35 times for 216 yards (6.2 average) and one touchdown. Helping lead the Ravens' rushing attack is veteran running back Derrick Henry. In nine games, he has carried 148 times for 704 yards (4.8 average) and six touchdowns.Cleveland has struggled for much of the year, but rookie Dillon Gabriel has had his moments. In seven games, Gabriel has completed 58.6% of his passes for 869 yards and seven touchdowns with two interceptions. He has also carried 12 times for 84 yards. Rookie running back Quinshon Judkins has also been solid. In eight games, he has carried 140 times for 561 yards and five touchdowns. He has had four explosive plays of 20 yards or more, including a season-long 46. Click here to bet Ravens vs. Browns at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Model's Ravens vs. Browns score prediction, picksThe Ravens are 4-5 against the spread, while the Browns are 3-6 ATS. Both teams have bottom half offenses, but Cleveland boasts the second-best defense. The SportsLine model projects Baltimore will cover the spread in 50% of simulations. Ravens vs. Browns score prediction: Ravens 27, Browns 18 Ravens vs. Browns same game parlayBrowns +331Jerry Jeudy, Cleveland Browns, Over 42.5 receiving yards (-114)Lamar Jackson, Baltimore Ravens, Under 194.3 passing yards (-114) Want more Week 11 NFL picks?You've seen the model's best bets for Baltimore Ravens vs. Cleveland Browns. Now, get against the spread, total and money-line picks for every Week 11 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Model locks in Ravens vs. Browns picks, score prediction, SGP for NFL Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/55aaee80-cdf0-4fbf-87cd-69be03aafe5d/thumbnail/1200x675/719e0a37a1350be7216e847de8efa9e1/derrick-henry-lamar-jackson.jpg"
      ],
      "datePublished": "2025-11-16T20:01:03.000Z",
      "dateModified": "2025-11-16T20:01:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh Jacobs injury update: Packers RB knee issue not thought to be season-ending - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/josh-jacobs-injury-update-packers-running-backs-knee-issue-not-expected-to-be-season-ending/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/8d96189f-9746-40fe-b81b-55c6b0b22de7/thumbnail/1200x675/d479fcc4340392756bc15cedac0097a4/jacobsnyg.jpg",
    "tag": "Sports",
    "date": "2025-11-17T02:25:09.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Green Bay Packers were dealt with two notable inju",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Green Bay Packers were dealt with two notable injuries during the first half of Sunday's win against the New York Giants. Quarterback Jordan Love briefly left the game but returned sustaining a left shoulder injury, however, running back Josh Jacobs did not return to action after sustaining a knee injury during the second quarter. Following the Packers 27-20 win, Packers coach Matt LaFleur said that Jacobs' injury is not expected to be season-ending and that more tests will be done on Monday. \"I think anytime a player, especially of his magnitude, but anytime a player doesn't finish a game, you're always concerned about the welfare of them,\" LaFleur said.  \nJacobs went to locker room after getting injured during Green Bay's first scoring drive. The three-time Pro Bowl player had 40 yards on seven carries prior to getting injured. \nWith Jacobs out, the Packers' ground attack was led by backup Emmanuel Wilson, who rushed for 40 yards on a touchdown on 11 carries. Green Bay ran for a solid 128 yards and one touchdown on 23 carries despite Jacobs' absence. After leaving the game, Love went to the medical tent before heading to the locker room. He was labeled as questionable to return shortly thereafter. While it doesn't appear to be season-ending, it does seem that Jacobs suffered a rather significant injury. That's clearly not good news for the Packers, as Jacobs has been one of their most productive players since the start of the 2024 season. \nLast season, his first with the Packers, Jacobs rushed for a career-high 15 touchdowns while helping Green Bay clinch a playoff berth. He's rushed for 648 yards and 11 touchdowns this season for the Packers, who improved to 6-3-1 on the year following Sunday's win. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh Jacobs injury update: Packers RB knee issue not thought to be season-ending - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/8d96189f-9746-40fe-b81b-55c6b0b22de7/thumbnail/1200x675/d479fcc4340392756bc15cedac0097a4/jacobsnyg.jpg"
      ],
      "datePublished": "2025-11-17T02:25:09.000Z",
      "dateModified": "2025-11-17T02:25:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bears' Nahshon Wright pays tribute to late coach John Beam with interception - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bears-nahshon-wright-pays-tribute-john-beam-interception/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/a9f419d5-0a20-4130-ae77-762157edfc40/thumbnail/1200x675/56945f38fddc1e9b2c8e100c763530d9/gettyimages-2247015983-1.jpg",
    "tag": "Sports",
    "date": "2025-11-17T03:02:52.000Z",
    "description": "\n        The interception Nahshon Wright hauled in during the Chicago Bears' 19-17 win over the Minnesota Vikings had way more meaning than just an av",
    "body": "\n        The interception Nahshon Wright hauled in during the Chicago Bears' 19-17 win over the Minnesota Vikings had way more meaning than just an average takeaway. Wright played with a heavy heart on Sunday, grieving the loss of his former coach at Laney College, the late John Beam. He played in Beam's honor after the legendary junior college coach was tragically killed in a shooting on the Laney campus.Wright played for Beam in 2018 and he remained in regular contact with him after reaching the NFL. Beam was a father figure for the Bears cornerback and his brother, Rejzohn Wright, after they lost their dad in 2017. Both brothers spent time at Laney before transferring to Oregon State and embarking on their professional careers.\"Today he was watching over me,\" Wright said in the Bears' locker room. \"It's crazy; he called me the night before he passed and he told me every game he watched, I just seemed to get a pick. I just know he was behind me today. He was with me today.\"The interception was the fourth of what has become a breakout season for Wright. He said he will take the ball back to Oakland and deliver it to Beam's family because \"that one was for him.\" It helped the Bears seal a divisional victory and notch their seventh win in eight games.Wright was instantly overcome with emotion after making the play.\n\"He meant the world to me,\" Wright said. \"When my dad was killed, he came to my house and got me out the bed. Someone I can confide in, someone that I love dearly. We talked once a week, easily. Really at a loss for words.\"My dad was killed in 2017. Beam stepped in as a father figure, a father role. He did a lot for me and my brother, my family. He's been there every step of the way. And it won't stop. I gained an angel.\"Beam, who stepped away from coaching in 2024 and since served as Laney's athletic director, died Nov. 14 after being shot a day earlier in what authorities said was a targeted attack. Oakland Police arrested a suspect and said that Beam and the suspect knew each other but did not have a close relationship. The suspect, who played football at Oakland's Skyline High School, was not a Laney student but was known to loiter around the campus.Officers found Beam suffering from gunshot wounds when they responded to the school's fieldhouse. The college was placed on lockdown shortly thereafter.\nBeam gained national attention when he was featured in the \"Last Chance U\" television series, which followed Laney's 2019 football season. During his tenure as the school's football coach, Beam guided the Eagles to two league championships, a 2018 state title and a No. 1 national ranking. He previously coached at Skyline High School and won 15 league championships and 11 section titles in 16 years.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bears' Nahshon Wright pays tribute to late coach John Beam with interception - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/a9f419d5-0a20-4130-ae77-762157edfc40/thumbnail/1200x675/56945f38fddc1e9b2c8e100c763530d9/gettyimages-2247015983-1.jpg"
      ],
      "datePublished": "2025-11-17T03:02:52.000Z",
      "dateModified": "2025-11-17T03:02:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michael Penix Jr. injury update: Falcons QB to be evaluated after hurting knee - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/michael-penix-jr-injury-falcons-qb-knee-injury/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/509c4e5a-1b7a-4a83-8a1b-c0eb7a164f7a/thumbnail/1200x675/9652bd7e49402914dd75d53f7cbdb71a/michael-penix.jpg",
    "tag": "Sports",
    "date": "2025-11-17T02:06:22.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Atlanta Falcons quarterback Michael Penix Jr. suff",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Atlanta Falcons quarterback Michael Penix Jr. suffered a knee injury in Sunday's 30-27 loss to the Carolina Panthers and was initially listed questionable to return, but he ultimately did not return to the game. Veteran Kirk Cousins took over for the injured second-year player.After the game, Raheem Morris said he did not have an update on Penix.Penix sustained the injury after a third-down sack in the third quarter and slammed his helmet down, appearing frustrated, after the hit. He was able to walk off the field on his own and immediately went into the blue medical tent as the special teams unit punted.The 25-year-old was seen sitting on the sideline after exiting the tent, as Cousins prepared to enter the game. \nCousins, last year's starter, has one start this year, a loss, and has appeared in two games before this week. He went 26 of 38 with 202 yards, no touchdowns and no interceptions in both games. On Sunday, Cousins finished with six passes on 14 attempts with 48 passing yards.Before leaving the game, Penix went 13 of 16 with 175 yards, no touchdowns and no interceptions. The Falcons were up 21-19 in the divisional matchup when Penix exited.\nPenix has a history of knee injuries, as he torn his ACL in 2018 and in 2020, before entering the NFL.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michael Penix Jr. injury update: Falcons QB to be evaluated after hurting knee - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/509c4e5a-1b7a-4a83-8a1b-c0eb7a164f7a/thumbnail/1200x675/9652bd7e49402914dd75d53f7cbdb71a/michael-penix.jpg"
      ],
      "datePublished": "2025-11-17T02:06:22.000Z",
      "dateModified": "2025-11-17T02:06:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL playoffs schedule, results, scores: Spirit into final, Pride face Gotham - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-playoffs-schedule-scores-results/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/855105ac-07ab-4978-8048-b0b72647815b/thumbnail/1200x675/a92c4627732af0e08c4a3bd269bb7343/untitled-design-2025-11-16t145639-268.png",
    "tag": "Sports",
    "date": "2025-11-17T02:09:03.000Z",
    "description": "\nThe 2025 NWSL Championship matchup is set, and it will be Gotham FC and the Washington Spirit next Saturday night for the title, which will take plac",
    "body": "\nThe 2025 NWSL Championship matchup is set, and it will be Gotham FC and the Washington Spirit next Saturday night for the title, which will take place at San Jose's PayPal Park. The match kicks off at 8 p.m. and will be broadcast on CBS and Paramount+.The last four NWSL champions -- the Orlando Pride, Gotham FC, Portland Thorns and Washington Spirit -- made it to the penultimate round of the NWSL playoffs to duke it out for the league's top prize, which set up the wild weekend that was. Gotham got a late free kick golazo from Jaedyn Shaw to top the Orlando Pride.In the first of the semifinal battles, it was the Spirit who kept their title dreams alive, winning 2-0 over the Thorns thanks to goals from Gift Monday and Croix Bethune. In an added bonus for the D.C. side, superstar Trinity Rodman returned to the field as a late substitute in the second half, marking her first minutes played since an MCL injury threatened to end her season early. Those minutes, plus however long she manages to play in the final, could mark the last time she suits up for the Spirit, as Rodman's contract winds down at the end of the season.   In the quarters, the victories were just as crazy. The Pride notched a 2-0 over the Seattle Reign in regular time, but the other three quarterfinals all went to extra time in closely contested matches. The Thorns notched a 1-0 win over the San Diego Wave, while the Spirit needed a penalty shootout to beat postseason first-timers Racing Louisville.The most stunning result of the quarterfinals, though, was Gotham's upset win over the Kansas City Current. The Current were arguably the favorites to win the NWSL Championship for the first time in club history after winning the Shield and ending the regular season with a 21-point advantage over second place. A last-gasp winner from Katie Stengel in the 121st minute, though, ensured the Current's playoff run would end as soon as it started.2025 NWSL Playoffs bracket\n2025 NWSL Playoffs scheduleAll times U.S./EasternQuarterfinalsFriday, Nov. 7Orlando Pride 1, Seattle Reign 0Saturday, Nov. 8Washington Spirit 1, Racing Louisville 1 (Spirit win on PKs, 3-1)Sunday, Nov. 9Gotham FC 2, Kansas City Current 1Portland Thorns 1, San Diego Wave 0SemifinalsSaturday, Nov. 15Washington Spirit 2, Portland Thorns 0Sunday, Nov. 16Gotham FC 1, Orlando Pride 0FinalSaturday, Nov. 22Gotham FC vs. Orlando Pride, 8 p.m. (CBS. Paramount+)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL playoffs schedule, results, scores: Spirit into final, Pride face Gotham - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/855105ac-07ab-4978-8048-b0b72647815b/thumbnail/1200x675/a92c4627732af0e08c4a3bd269bb7343/untitled-design-2025-11-16t145639-268.png"
      ],
      "datePublished": "2025-11-17T02:09:03.000Z",
      "dateModified": "2025-11-17T02:09:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions vs. Eagles props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-eagles-nfl-player-props-sgp-jahmyr-gibbs-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/caca2385-699e-4ce8-95c9-93a264f5f8e6/thumbnail/1200x675/59d1702f49e242493b51b52aec4cdcb0/jared-goff-jahmyr-gibbs-detroit-lions.jpg",
    "tag": "Sports",
    "date": "2025-11-17T00:20:37.000Z",
    "description": "\n        NFC teams vying for the top seed in the conference meet when the Detroit Lions take on the Philadelphia Eagles in Week 11 'Sunday Night Footb",
    "body": "\n        NFC teams vying for the top seed in the conference meet when the Detroit Lions take on the Philadelphia Eagles in Week 11 'Sunday Night Football' at 8:20 p.m. ET from Lincoln Financial Field in Philadelphia. The Lions (6-3) lead the NFC North, while the Eagles (7-2) have a 3.5-game bulge in the  NFC East standings over the Dallas Cowboys. The game will feature Lions quarterback Jared Goff against Eagles signal caller Jalen Hurts. Both players figure into several NFL player props or a Sunday Night Football SGP. Detroit tight end, Sam LaPorta (back), is out as he was recently placed on injured reserve.Goff has played at a high level all season, completing 74% of his passes for 2,235 yards and 20 touchdowns. Hurts, meanwhile, has been equally as impressive. In nine games, he has completed 68.9% of his passes for 1,860 yards and 16 touchdowns. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Jahmyr Gibbs, Amon-Ra St. Brown or David Montgomery of the Lions or Saquon Barkley, DeVonta Smith or A.J. Brown of the Eagles. Before betting any Lions vs. Eagles props for Sunday Night Football, you need to see the Lions vs. Eagles prop predictions powered by SportsLine's Machine Learning Model AI.New users can also target the DraftKings promo code, which offers $300 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Lions vs. Eagles NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Lions vs. Eagles prop picks. You can only see the Machine Learning Model player prop predictions for Lions vs. Eagles here.Top NFL player prop bets for Lions vs. EaglesAfter analyzing the Lions vs. Eagles props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Lions running back Jahmyr Gibbs goes over 13.5 carries (-128). Gibbs has gone over 14 carries in three of the last four games, and in five of his last eight games. In last week's 44-22 win at Washington, Gibbs carried 15 times for 142 yards and two touchdowns.Gibbs is also going against the 19th-best defense in the league. The Eagles are giving up an average of 118.6 rushing yards per game. With LaPorta out, Detroit may lean a bit more on the ground game than trying to move the ball through the air. The SportsLine Machine Learning Model projects Gibbs to have 18.7 carries and gives this prop a 4.5 out of 5-star prop rating. See more NFL props here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make NFL player prop bets for Lions vs. EaglesIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has 10 additional NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Lions vs. Eagles prop bets for Sunday Night Football.Which Lions vs. Eagles prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Lions vs. Eagles props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions vs. Eagles props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/caca2385-699e-4ce8-95c9-93a264f5f8e6/thumbnail/1200x675/59d1702f49e242493b51b52aec4cdcb0/jared-goff-jahmyr-gibbs-detroit-lions.jpg"
      ],
      "datePublished": "2025-11-17T00:20:37.000Z",
      "dateModified": "2025-11-17T00:20:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One Knoxville SC top Spokane Velocity, claim first USL League One title for club - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/one-knoxville-usl-league-one-title-spokane-velocity/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/17/b83d4d34-d9a1-4c85-afdb-193c8f559805/thumbnail/1200x675/9a9414fe05d5e912140e270177372b75/usl.jpg",
    "tag": "Sports",
    "date": "2025-11-17T00:44:25.000Z",
    "description": "\n    \n    \n                    \n                Courtesy of United Soccer League\n            \n            \n    \n        One Knoxville SC won their fir",
    "body": "\n    \n    \n                    \n                Courtesy of United Soccer League\n            \n            \n    \n        One Knoxville SC won their first USL League One title in their history on Sunday, riding a fast start to defeat the Spokane Velocity 2-0. Ian Fuller's men took a great finish from Nicola Rosamilia in the fourth minute and wouldn't look back from there, shepherding Spokane shots into areas that were easy for their stout defense to deal with. It was quite a finish from Rosamilia, but winger Stavros Zarokostas made the goal happen. Latching on to a ball over the top, he went on a mazy run through the Spokane defense before cutting it back for Rosamilia to have an easy finish. It's only the third goal of the season and the first since July for Rosamilia, but in a championship, you need contributions up and down the roster, which Knoxville got.\nKempes Tekiela added an insurance goal from the penalty spot to put the match out of reach, while defender of the year Jordan Skelton and the backline kept Spokane at bay. During the lead-up to the match, Fuller spoke about how much the community means to the team, and it's an impressive feat for him to bring them a title in only his first season as a head coach. Fuller has gotten the team to play in his image, and they were rewarded with an impressive title victory over a Spokane side that have made it back-to-back League One finals. Knoxville also did it in front of a league-record crowd of 7,500 fans, showing just how many people are tuning into what the club is building. \nTo topple Spokane, it took a prepared side who were up for the challenge. With this kind of progression in only his first year as a head coach, the future is bright for him and Knoxville. Another final loss will sting for Spokane, but they'll also be back for this stage as manager Leigh Veidman has been able to turn this side into consistent contenders, but for Sunday, it's time to party in Knoxville.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One Knoxville SC top Spokane Velocity, claim first USL League One title for club - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/17/b83d4d34-d9a1-4c85-afdb-193c8f559805/thumbnail/1200x675/9a9414fe05d5e912140e270177372b75/usl.jpg"
      ],
      "datePublished": "2025-11-17T00:44:25.000Z",
      "dateModified": "2025-11-17T00:44:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rory McIlroy wins 7th Race to Dubai; Matt Fitzpatrick takes DP World Tour Championship - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/rory-mcilroy-race-to-dubai-matt-fitzpatrick-dp-world-tour-championship-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/1a9b08bb-af74-4d27-ae9e-503de3a9eebb/thumbnail/1200x675/a8437b1e6527d27e9b0c002e1da7db6f/matt-fitzpatrick-rory-mcilroy-dp-world-tour-dubai-g.jpg",
    "tag": "Sports",
    "date": "2025-11-16T20:20:32.000Z",
    "description": "\n        Long before the final putt of the 2025 DP World Tour Championship fell, Rory McIlroy had his hands on his seventh Race to Dubai title. Securi",
    "body": "\n        Long before the final putt of the 2025 DP World Tour Championship fell, Rory McIlroy had his hands on his seventh Race to Dubai title. Securing his fourth straight season-long crown in Europe to pull him second all-time behind only Colin Montgomerie (eight), the Northern Irishman nearly added even more hardware to his trophy case by pulling off a double and winning the European circuit's season finale alongside the year-long race.Instead, McIlroy -- despite an eagle on the 72nd hole -- fell on the first playoff hole to Matt Fitzpatrick, his Ryder Cup teammate and fellow European. The Englishman carded dueling 66s over the weekend to traverse his way through the peloton by tournament's end and finish his 72 holes at 18 under. A par on the first extra hole, the par-5 18th, was all Fitzpatrick needed to fend off McIlroy and secure his third DP World Tour Championship title.\"It means the world,\" said Fitzpatrick of his victory. \"Struggled at the start of this year, obviously, and to turn it around in the summer like I did and have a Ryder Cup like I did, Ryder Cup in particular, [I] feel like it's hard to top given everything. But the way that I played today, I feel like I really didn't hit one bad shot all day. I'm so proud of myself, the effort that everyone puts in behind the scenes. What a feeling.\"McIlroy appeared to have the tournament under control, walking off the par-4 11th as he possessed a two-stroke lead with seven holes to play. Getting as deep as 5 under in his round at that stage, the 36-year-old only then began to take on water, adding squares to his scorecard on Nos. 12 and 16 to fall off the pace.\nUp ahead, Fitzpatrick continued to scratch and claw, reminiscent of his year as a whole. A hefty diet of pars in the middle of his round preceded a flurry of a finish as Fitzpatrick rolled in respective birdie efforts from 9 feet and 25 feet on Nos. 14 and 15 to propel himself towards the top of a crowded leaderboard that featured the likes of Tommy Fleetwood, Ludvig Åberg and Laurie Canter.When those three men could do no better than 17 under, Fitzpatrick found himself in a position to seize the moment on the final hole. Getting up and down from right of the green, he posted 18 under as McIlroy watched from the right side of the fairway with 5 wood in hand and eagle on his mind.McIlroy feathered his 5 wood to perfection to set up a look for eagle. After getting a teach from his playing partner, Rasmus Neergard-Petersen, McIlroy marched to his putt and marched to the hole to pick up his ball from the bottom as he once again found his best at the precise right time.\n\"Of course you [think he'll make it],\" Fitzpatrick said. \"He's probably one of the only few that you know you go to a playoff, two clear and one to play, and you know you're going to a playoff. In typical Rory fashion, he did it again, and obviously, you never like to see the way it ends. But obviously delighted.\"While it may not have gone the way of McIlroy in the playoff, he does now inch closer to even more golf immortality. With seven Race to Dubai titles under his belt, the grand slam champion -- who now has an award named after him -- moves past European legend Seve Ballesteros' six titles and directly into the rearview mirror of Montgomerie. \"I said this on this green last year, [Seve] means so much to this tour and to the European Ryder Cup team,\" McIlroy said. \"We rally so much around his spirit and his quotes and everything he meant for European golf. To equal him last year was cool, but to surpass him this year, yeah, I didn't get this far in my dreams. So, it's very cool.\"\nMontgomerie's record number of eight included a streak of seven straight from 1999 to 2005. McIlroy finds himself amid a heater of his own, donning four crowns in a row dating back to 2022. He appears intent on giving it a go as he shows no signs of slowing down in the late 30s of his career.\"I want it, of course I do,\" McIlroy said. \"I caught up with [Montgomerie] this week when he was here a couple days ago, and I saw him. Look, it seems within touching distance now. I'd love to be the winningest European in terms of Order of Merits and season-long races. You know, I've probably got a few more good years left in me, and hopefully I can catch him and surpass him.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rory McIlroy wins 7th Race to Dubai; Matt Fitzpatrick takes DP World Tour Championship - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/1a9b08bb-af74-4d27-ae9e-503de3a9eebb/thumbnail/1200x675/a8437b1e6527d27e9b0c002e1da7db6f/matt-fitzpatrick-rory-mcilroy-dp-world-tour-dubai-g.jpg"
      ],
      "datePublished": "2025-11-16T20:20:32.000Z",
      "dateModified": "2025-11-16T20:20:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 FIFA World Cup qualified teams: Portugal clinch spot in tournament; Nigeria miss out once again - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/2026-fifa-world-cup-qualified-teams-portugal-join-argentina-brazi-spain-france/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/ec656dbe-afa0-4ee9-9463-7eaef3c736ad/thumbnail/1200x675/c3239ae327c9e7627b92031d89ba0d00/portugal.jpg",
    "tag": "Sports",
    "date": "2025-11-16T22:20:01.000Z",
    "description": "\n        The 2026 FIFA men's World Cup is approaching next year, and qualifying is well underway with more than half of the spots now accounted for. T",
    "body": "\n        The 2026 FIFA men's World Cup is approaching next year, and qualifying is well underway with more than half of the spots now accounted for. There are now 48 teams after FIFA decided to expand from the old 32-team format that had been in place since the 1998 World Cup. The 2026 edition will take place in the United States, Canada, and Mexico, kicking off on June 11, 2026, at Estadio Azteca in Mexico City, and will end on July 19 at MetLife Stadium in New York City.With the tournament's expansion, the European confederation (UEFA) is guaranteed 16 slots of the 48 teams, while the African confederation (CAF) has nine, and the Asian confederation (AFC) has eight. There will also be a minimum of six each from South America (CONMEBOL) and the Confederation of North, Central America and Caribbean Association Football (CONCACAF). On top of this, for the first time in history, the Oceania Football Confederation (OFC) has one guaranteed slot, while the remaining two spots will be decided through intercontinental playoffs.Three teams have already secured qualification to the first men's World Cup in their history. Uzbekistan, Jordan, and Cape Verde will all be at the World Cup for the first time, and more first-timers could join them as the dust settles. With a population of 524,877, Cape Verde became the second-smallest nation to ever qualify for the World Cup, behind only Iceland, which had a population of 350,000 when they qualified for the 2018 World Cup.Let's take a look at who has already booked their tickets to the World Cup:Already qualified for the 2026 World CupWorld Cup hostsSince the 2026 World Cup is co-hosted by three nations, they all receive an automatic qualifying spot in the tournament. United StatesMexicoCanadaAFC QualifiersIranUzbekistanSouth KoreaJordanAustraliaJapanQatarSaudi ArabiaOFC QualifierNew ZealandCONMEBOL Qualifiers\nArgentinaBrazilEcuadorParaguayUruguayCAF QualifiersMoroccoEgyptTunisiaGhanaCape VerdeAlgeriaSouth AfricaSenegalIvory CoastUEFA qualifiersEnglandFranceCroatiaPortugal Norway Chaos in UEFATeams such as England, Portugal, France and Croatia booked their place in the World Cup, as the winners of each qualifying group will head directly to the tournament. But the second-placed team in each group will head to a playoff phase, such as Italy that might miss their third World Cup in a row. Those 12 second-placed teams will be joined by the four best UEFA Nations League group winners.That second round will see 16 teams drawn into four paths with two rounds of single-match playoffs that will lead to a final with the four overall path winners heading to the World Cup. Due to that process, no UEFA teams will take part in the inter-confederation playoffs. These also won't conclude until March of 2026.Who makes the inter-confederation playoffs?The final World Cup participants won't be determined until March of 2026, following the draw for the World Cup groups. A playoff will take place in North America in March, including one team each from the following regions: AFC, CAF, CONMEBOL, OFC, alongside two from Concacaf to determine the final two places in the World Cup. The bottom four teams in the FIFA World Rankings will be drawn into two single-elimination matches, where the winner will advance to face the top two teams in the rankings, with the winners of those two matches qualifying for the World Cup. Currently in the inter-confederation playoffs\nCAF: DR CongoOFC: New CaledoniaCONMEBOL: BoliviaWhen is the World Cup draw?Paths to the World Cup final will be revealed on Dec. 5 in a ceremony taking place at the Kennedy Center in Washington, D.C.. At that time, teams will know what groups they will be drawn into, and while the final teams will still need to be determined, placeholders will be used for their spots in the draw.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 FIFA World Cup qualified teams: Portugal clinch spot in tournament; Nigeria miss out once again - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/ec656dbe-afa0-4ee9-9463-7eaef3c736ad/thumbnail/1200x675/c3239ae327c9e7627b92031d89ba0d00/portugal.jpg"
      ],
      "datePublished": "2025-11-16T22:20:01.000Z",
      "dateModified": "2025-11-16T22:20:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shedeur Sanders makes NFL debut: Former Colorado star QB enters for Dillon Gabriel - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/shedeur-sanders-nfl-debut-cleveland-browns-qb/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/5f24c63d-06b3-4ff1-b64b-2513a18c4683/thumbnail/1200x675/018a7cc7707a8214b4527e5b0cb69f3c/shedeur-sanders-browns.jpg",
    "tag": "Sports",
    "date": "2025-11-16T23:44:12.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a rollercoaster ride -- from the pre-draft p",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        After a rollercoaster ride -- from the pre-draft process to the draft slide to the preseason injuries and demotions to waiting behind several different quarterbacks -- Shedeur Sanders has made his NFL debut. The former Colorado star entered an NFL regular-season game for the first time in Week 11 for the Browns after Dillon Gabriel did not emerge from the locker room at halftime while in the concussion protocol, per the CBS Sports broadcast. Gabriel was initially ruled questionable to return but was then ruled out shortly thereafter.Sanders received a hero's welcome in Cleveland and immediately completed his first pass attempt, a 5-yard toss to Cedric Tillman. He also completed his second pass, a 7-yarder to David Njoku, but took a sack and fumbled (though a teammate recovered) on third down.\nHe also threw an interception on his second drive.\nA record-setting quarterback at Colorado, Sanders slipped all the way to the fifth round of the 2025 NFL Draft, where Cleveland selected him 144th overall. He was the sixth quarterback selected and the second selected by his own team; the Browns took Gabriel in the third round (94th overall).The Browns opened the season with Joe Flacco as their starter but traded him to the Bengals. Gabriel had started ever since.\nThe Browns led the Ravens 16-10 at halftime.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shedeur Sanders makes NFL debut: Former Colorado star QB enters for Dillon Gabriel - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/5f24c63d-06b3-4ff1-b64b-2513a18c4683/thumbnail/1200x675/018a7cc7707a8214b4527e5b0cb69f3c/shedeur-sanders-browns.jpg"
      ],
      "datePublished": "2025-11-16T23:44:12.000Z",
      "dateModified": "2025-11-16T23:44:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 11 winners, losers: Josh Allen plays Superman for Bills in win over Bucs - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-11-winners-and-losers-josh-allen-plays-superman-for-bills-as-bengals-falcons-flop-yet-again/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/ada94b64-7d4c-4408-8076-8a442365a700/thumbnail/1200x675/22e35d6e62f4c181a35676c5e0d2c078/josh-allen-imagn.jpg",
    "tag": "Sports",
    "date": "2025-11-17T00:56:02.000Z",
    "description": "\n        Another Sunday, another full slate of NFL action nearly in the books. And Week 11 has already produced lots of drama.The Miami Dolphins kicke",
    "body": "\n        Another Sunday, another full slate of NFL action nearly in the books. And Week 11 has already produced lots of drama.The Miami Dolphins kicked off the day overseas with an overtime win over the Washington Commanders in Spain, where former New England Patriots prospect Jack Jones came up with a critical takeaway. The Jacksonville Jaguars suddenly roared to life with a surprise blowout of the Los Angeles Chargers, who couldn't carry over momentum from a prime-time win. And the Pittsburgh Steelers routed the rival Cincinnati Bengals, but the win came at a cost, with Aaron Rodgers exiting due to a hand injury.That's not even accounting for the wildness of the Buffalo Bills' win over the Tampa Bay Buccaneers, in which Josh Allen scored six total touchdowns to outduel Baker Mayfield, or the Chicago Bears miraculously claiming their seventh win in eight weeks thanks to a walk-off field goal by Cairo Santos against the Minnesota Vikings.\n        \n            \n                NFL Week 11 overreactions: Chargers on verge of second-half collapse? Bench J.J. McCarthy?\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nWhich players, coaches and teams were the biggest winners and losers of Sunday's games? Here goes:\nWinner: BroncosOK, maybe it's time we take Denver seriously. The Broncos are dragging opposing teams into the mud rather than routing them with high-octane fireworks, but Sunday's tight-knit win over the reigning AFC champion Kansas City Chiefs was a statement victory. That makes eight straight for Sean Payton's squad, which might boast some of the most clutch performers in the league on both sides. Bo Nix remains a late-game fiend. And the defense, featuring the rangy Ja'Quan McMillian, is a terror.Loser: Sam DarnoldThe Seattle Seahawks gunslinger has had a rock-solid 2025 campaign, but he coughed up at least a bit of goodwill against the rival Los Angeles Rams, throwing four interceptions in a battle of first-place hopefuls in the NFC West. Granted, the Rams boast a persistent and physical defense, but Darnold too often looked frenetic in the pocket in Seattle's first loss since October. The Seahawks remain a force, but if that Darnold shows up late in the year, just like at the close of 2024 in Minnesota, look out.Winner: JaguarsJacksonville had lost three of its last four prior to Sunday's matchup with the Chargers. Then the Jaguars' entire defense got a confidence booster against Los Angeles' depleted offensive front, with Josh Hines-Allen and Co. swallowing up Justin Herbert to the tune of three sacks, five tackles for loss and a big-time pick. Jim Harbaugh's Bolts were rendered totally uncompetitive in the most impressive showing of Liam Coen's first season atop the Jaguars, suddenly reviving Jacksonville's playoff hopes.\nLoser: Raheem MorrisThe Atlanta Falcons coach might already be on the hot seat. If he wasn't before Sunday, however, he almost surely is now. Yes, Michael Penix Jr. was forced to leave the club's rematch with the Carolina Panthers, who previously blanked Atlanta in a 30-0 September meeting. But not even Kirk Cousins, the demoted man under center, could save the Falcons from their own defense. Morris' unit somehow managed to let Bryce Young, one of the NFL's most sluggish passers, air it out for 448 yards.Winner: Ben JohnsonAre the Bears playing clean, dominant football? Not necessarily. Are they playing winning football? There's no denying it. Chicago logged its seventh win in eight weeks on Sunday, and the conditions of the matchup weren't ideal for a Chi-Town win, with Brian Flores' Vikings defense playing host at U.S. Bank Stadium in Minneapolis. Still, Johnson produced another scrappy ground game (140 total yards) while his handpicked defensive coordinator, Dennis Allen, forced third-down stops basically all afternoon.Loser: BengalsThe stage was set for Cincinnati to embarrass the rival Steelers on the road on Sunday, with Aaron Rodgers leaving the contest due to a hand injury and Jalen Ramsey drawing an ejection for some extracurricular scuffling with Ja'Marr Chase. Instead, Zac Taylor's underachieving AFC North squad got basically no push from the Joe Flacco-led offense, with the aging fill-in quarterback finishing 23 of 40 with a pick, and video appeared to depict Chase spitting on Ramsey during their interactions. This is a sad, slumping team.\nWinner: Josh Allen's MVP oddsAllen had been enjoying a solid, if relatively unspectacular, season prior to Sunday. His Bills, after all, were more scrappy than special considering the high expectations they carried into 2025. But boy did the Superman version of Allen show up against the Buccaneers. Yes, there were hiccups, like off-kilter interceptions. But No. 17 put on his cape as a true dual threat to outlast Baker Mayfield's own heroics, accounting for six scores and almost 350 total yards while spreading the ball to 10 different receivers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 11 winners, losers: Josh Allen plays Superman for Bills in win over Bucs - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/ada94b64-7d4c-4408-8076-8a442365a700/thumbnail/1200x675/22e35d6e62f4c181a35676c5e0d2c078/josh-allen-imagn.jpg"
      ],
      "datePublished": "2025-11-17T00:56:02.000Z",
      "dateModified": "2025-11-17T00:56:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills' win over Bucs ends with final score that's never happened in NFL history - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-wild-win-over-buccaneers-ends-with-final-score-thats-never-happened-before-in-nfl-history/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/1756d49b-5dee-41fd-908f-0d742cfc1fa7/thumbnail/1200x675/76c80d8aedbac17d583091c7adc11f3f/bills-jpeg.jpg",
    "tag": "Sports",
    "date": "2025-11-16T21:49:45.000Z",
    "description": "\n        The Buffalo Bills and Tampa Bay Buccaneers played one of the wildest games of Week 11, and it ended with the two teams combining to make some",
    "body": "\n        The Buffalo Bills and Tampa Bay Buccaneers played one of the wildest games of Week 11, and it ended with the two teams combining to make some NFL history. The game ended with the Bills topping the Bucs, 44-32, a score that had never happened before in the 106-year history of the NFL.Yup, we got a scorigami. With just under three minutes left to play, it didn't look like the scorigami was going to happen. At that point, the Bills were leading 37-32, which is a score that has happened before. However, Josh Allen ended up clinching the scorigami when he scored on a nine-yard touchdown run with just 2:35 left to play to push the score to 44-32, which officially gave us the 1,095th unique final score in NFL history. \nThe score by Allen capped off an MVP-level performance by the Bills quarterback, who totaled SIX touchdowns in the game. Not only did he have three rushing touchdowns, but he also added three passing touchdowns, marking just the second time in NFL history that a QB has scored three rushing touchdowns and three passing touchdowns in a game. (Allen has the only other performance, and that came in 2024 against the Rams.) Allen totaled 357 yards with 317 of that coming through the air. To get a scorigami, you need a few crazy things to happen -- and this game certainly had those. There were NINE lead changes, which is tied for the second-most in a game in NFL history. One of those lead changes came after Sean Tucker scored on a six-yard run in the third quarter for the Buccaneers to put Tampa Bay up 26-21. At that point, the Bucs decided to go for two and didn't get it, which set the stage for the wonky final score. \nThis marks the second straight week that an NFL game has ended with a scorigami. In Week 10, the Texans beat the Jaguars 36-29 to give us the 1094th different final score in league history. This was the fourth scorigami of the 2025 season and the second by the Bills. Buffalo was also involved in a scorigami back in Week 1 when it beat the Baltimore Ravens, 41-40. As for the Buccaneers, this marked the first time they've been involved in a scorigami in two years. That last time it happened came in a 39-37 loss to the Texans back in November 2023. \nAlthough the Bills' win was the only scorigami of Week 11, there have been some rare final scores. The Pittsburgh Steelers' 34-12 win over the Cincinnati Bengals marked the first time in 13 years that a game has ended with that score. The Jaguars' 35-6 win over the Chargers was also a rarity. That score had not happened in the NFL since 2015 before Jacksonville's win. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills' win over Bucs ends with final score that's never happened in NFL history - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/1756d49b-5dee-41fd-908f-0d742cfc1fa7/thumbnail/1200x675/76c80d8aedbac17d583091c7adc11f3f/bills-jpeg.jpg"
      ],
      "datePublished": "2025-11-16T21:49:45.000Z",
      "dateModified": "2025-11-16T21:49:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS, Eagles vs. Lions: 'Sunday Night Football' daily Fantasy picks, lineups - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-eagles-lions-fanduel-draftkings-daily-fantasy-picks-lineups-advice-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/2245e1d7-aa90-4024-99ef-28e3025ef6ae/thumbnail/1200x675/43c5f873cb0c9a1ef4e7ff2b5c4152f6/jahmyr-gibbs-lions-imagn-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-17T00:24:02.000Z",
    "description": "\n        It'll be a loaded NFL DFS player pool when the Philadelphia Eagles host the Detroit Lions on 'Sunday Night Football' at 8:20 p.m. ET. Big nam",
    "body": "\n        It'll be a loaded NFL DFS player pool when the Philadelphia Eagles host the Detroit Lions on 'Sunday Night Football' at 8:20 p.m. ET. Big names like Jalen Hurts, Saquon Barkley, A.J. Brown, Jared Goff, Amon-Ra St. Brown and Jahmyr Gibbs will be popular NFL DFS picks. How much can you trust the Philadelphia offense, however, after the Eagles put up just 10 points at Green Bay last week? With Sam LaPorta (back) out for Detroit, which under-the-radar Lions pass catchers could step up?With an over/under of 46.5 points, a decent amount of offense is expected, so which sleeper should you target for NFL DFS lineups? Before making any NFL DFS picks for 'Sunday Night Football', be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to Lions vs. Eagles on 'Sunday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top NFL DFS picks for Eagles vs. LionsPart of McClure's NFL DFS strategy for 'Sunday Night Football' is Eagles running back Saquon Barkley. With the Philadelphia passing game struggling, Barkley is seeing a ton of work. He's averaged more than 20 touches per game in the past three weeks, and he should again be a big part of the offense as the Eagles look to get back on track in this one. See who else to roster at SportsLine.Another one of McClure's NFL DFS picks is Lions running back Jahmyr Gibbs, who is coming off a huge three-touchdown performance against the Commanders. The Eagles rank 20th in the NFL in Fantasy points given up to opposing running backs, opening the door for Gibbs to have another big day on 'Sunday Night Football.' See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set NFL DFS lineups for Lions vs. EaglesMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS, Eagles vs. Lions: 'Sunday Night Football' daily Fantasy picks, lineups - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/2245e1d7-aa90-4024-99ef-28e3025ef6ae/thumbnail/1200x675/43c5f873cb0c9a1ef4e7ff2b5c4152f6/jahmyr-gibbs-lions-imagn-cbs.jpg"
      ],
      "datePublished": "2025-11-17T00:24:02.000Z",
      "dateModified": "2025-11-17T00:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee to dismiss Boo Carter: Ongoing issues lead to star DB's departure - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/tennessee-dismisses-boo-carter-team-rules-violations/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/57d3d887-7f1e-4263-a90a-89bdaaa6bf25/thumbnail/1200x675/771e04d242a5483719d04fc65278f12e/boo-carter-tennessee.png",
    "tag": "Sports",
    "date": "2025-11-16T21:33:08.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tennessee and defensive back Boo Carter are expect",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Tennessee and defensive back Boo Carter are expected to part ways, multiple sources tell CBS Sports. Carter had numerous team rules violations dating back to the summer, and those continued issues contributed to his departure. The 5-foot-11, 200-pound defensive back did not appear in Tennessee's win Saturday over New Mexico State and was absent from the sideline.\"At the end of the day, there's a standard you've got to meet to be in that locker room,\" Heupel said after Tennessee's win. \"He was not out on the field with us.\"Carter entered his sophomore season expected to be one of Tennessee's key players in the secondary. He's been reasonably productive with 25 tackles and 4.5 tackles for loss. Carter hasn't started any games, however, failing to follow up on an excellent debut season as a freshman in 2024. \nCarter had a tumultuous offseason with the Vols. He missed numerous team activities over the summer and was at one point confronted by team leaders, which led to Carter stepping away from the team for a stretch in July. He did eventually return to the program with Heupel saying there were \"some things he's got to accomplish\" to get back out on the field with us. Even ahead of Carter's dismissal, the Vols considered Carter a likely candidate to transfer, sources told CBS Sports. The former four-star recruit could be a popular player in January depending on how teams evaluate his time in Knoxville. \nCarter finished his Tennessee career with 63 tackles, 7.5 tackles for loss and an interception. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee to dismiss Boo Carter: Ongoing issues lead to star DB's departure - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/57d3d887-7f1e-4263-a90a-89bdaaa6bf25/thumbnail/1200x675/771e04d242a5483719d04fc65278f12e/boo-carter-tennessee.png"
      ],
      "datePublished": "2025-11-16T21:33:08.000Z",
      "dateModified": "2025-11-16T21:33:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Did Bengals Ja'Marr Chase spitting at Steelers Jalen Ramsey prompt punch? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bengals-steelers-fight-jalen-ramsey-ejected-jamarr-chase-aaron-rodgers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/16/d584ca1a-8926-44a6-a54c-69161d71c7f5/thumbnail/1200x675/7911e11608fefc9c2c8a88f2b9beecb6/ramseychase.jpg",
    "tag": "Sports",
    "date": "2025-11-17T01:43:27.000Z",
    "description": "\n        Jalen Ramsey received an ejection from the Pittsburgh Steelers' Week 11 showdown with the Cincinnati Bengals following his altercation with w",
    "body": "\n        Jalen Ramsey received an ejection from the Pittsburgh Steelers' Week 11 showdown with the Cincinnati Bengals following his altercation with wideout Ja'Marr Chase early in the fourth quarter. Both players have differing accounts as to what led to the altercation. \"He spit on me,\" Ramsey said of Chase. \"I don't give a f--- after that, respectfully. I'm always gonna be all for trash talking, shit talking, stuff like that. I actually enjoy that part of the game.\"Chase denied spitting on Ramsey, who is hopeful that the NFL does its \"due diligence\" in terms of finding out what happened. \"I ain't ever open my mouth to that guy,\" Chase said. \"We were going back and forth the whole time, so I'm sure something got under his skin. ... I didn't spit on nobody.\" \nThe NFL will investigate Ramsey's claim that Chase spit on him, according to CBS Sports NFL insider Jonathan Jones. Specifically, the NFL will investigate to determine if Ramsey acted in self-defense or was the aggressor. \"If they determined that [Ramsey] was not the aggressor, but in fact he was reacting to being spit upon, I would anticipate that Jalen Ramsey would not get fined,\" Jones said. \"Instead, what will happen this upcoming week is that Ja'Marr Chase would be suspended for a game because they set the precedent with (Eagles defensive tackle) Jalen Carter in Week One when they ejected him for that entire game.\" \nRamsey and Chase had a scuffle earlier in the game, but that was mostly civil. Ramsey said that wasn't the case later in the game. \n\"As soon as he spit, it was f--- that,\" said Ramsey, who also accused Chase of trying to crack block him earlier in the game. \"I ain't gonna tolerate that part of it.\" When asked about it afterward, Steelers coach Mike Tomlin said that the reasoning behind Ramsey's punch and subsequent ejection was irrelevant. \"We gotta be smarter,\" Tomlin said. \"We gotta stay in football games, as individuals.\" \nReferee Bill Vinovich said afterward that he did not see Chase spit on Ramsey, who was ejected because he threw a punch. Field-level video of the sequence, however, reveals that Chase did indeed spit in Ramsey's direction. \nRamsey's ejection came with the Steelers protecting a 20-9 lead. Pittsburgh was also playing without starting quarterback Aaron Rodgers, who sustained a left hand injury just before halftime. Mason Rudolph led the Steelers' offense to a field goal during his first possession with Rodgers out at quarterback. Despite Ramsey's absence, the Steelers recorded a 34-12 win that included two defensive touchdowns. Pittsburgh is now 6-4 and remains in front of second-place Baltimore in the AFC North standings. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Did Bengals Ja'Marr Chase spitting at Steelers Jalen Ramsey prompt punch? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/16/d584ca1a-8926-44a6-a54c-69161d71c7f5/thumbnail/1200x675/7911e11608fefc9c2c8a88f2b9beecb6/ramseychase.jpg"
      ],
      "datePublished": "2025-11-17T01:43:27.000Z",
      "dateModified": "2025-11-17T01:43:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]