[
  {
    "title": "Magic vs. Grizzlies prediction, odds, spread, time: 2026 NBA London Game picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/magic-grizzlies-odds-prediction-line-time-2026-nba-london-game-picks-january-18/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/9cdfe26f-03d5-4bfc-9f48-b9c02d46a0ec/thumbnail/1200x675/a1db5f1352ff6e3b2d6c8f3717285d24/jaren-jackson-jr-grizzlies-cbs.jpg",
    "tag": "Sports",
    "date": "2026-01-18T15:38:30.000Z",
    "description": "\n        The NBA will play a regular-season game in London for the 10th time ever when the Orlando Magic and Memphis Grizzlies meet on Sunday. These t",
    "body": "\n        The NBA will play a regular-season game in London for the 10th time ever when the Orlando Magic and Memphis Grizzlies meet on Sunday. These teams played in Berlin on Thursday as Orlando won 118-111 and covered as a 5.5-point favorite. Orlando is 23-18 on the season and fifth in the Eastern Conference standings. Memphis is 17-23 and 11th in the West. Ja Morant (calf) is listed as probable for Memphis after missing the game in Berlin, while Jalen Suggs (knee) remains out for Orlando.Tipoff is at noon ET from the O2 Arena in London. Orlando is a 3.5-point favorite in the latest Magic vs. Grizzlies odds per DraftKings Sportsbook, while the over/under is 230.5 points. Before making any Grizzlies vs. Magic picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Magic vs. Grizzlies 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Grizzlies vs. Magic:Magic vs. Grizzlies spread:    Magic -3.5Magic vs. Grizzlies over/under:    230.5 pointsMagic vs. Grizzlies money line:    Magic -168, Grizzlies +140Magic vs. Grizzlies picks:    See picks at SportsLineMagic vs. Grizzlies streaming:Amazon PrimeNew users can check out the latest FanDuel promo code to get $300 in bonus bets if your initial $5 wager wins:How to make Grizzlies vs. Magic picksAfter 10,000 simulations of Magic vs. Grizzlies, SportsLine's model is going Under on the total (230.5 points). Both teams have seen three of their past five games go Under, and international travel could be a factor in slowing down the pace a bit on Sunday. Memphis has also seen 13 of its 20 games away from home this year hit the Under. SportsLine's model is projecting 229 combined points, as the Under hits 56% of the time.The model also says one side of the spread hits almost 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Magic vs. Grizzlies, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Magic vs. Grizzlies prediction, odds, spread, time: 2026 NBA London Game picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/9cdfe26f-03d5-4bfc-9f48-b9c02d46a0ec/thumbnail/1200x675/a1db5f1352ff6e3b2d6c8f3717285d24/jaren-jackson-jr-grizzlies-cbs.jpg"
      ],
      "datePublished": "2026-01-18T15:38:30.000Z",
      "dateModified": "2026-01-18T15:38:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL divisional round longshot parlay for Sunday from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-parlay-longshot-picks-bets-predictions-odds-player-props-divisional-round-playoffs-sunday-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/7b090d10-b0aa-4f2b-a6ab-0f25b2c567f2/thumbnail/1200x675/229e264993b23314e832c195b326d8c3/usatsi-27667202.jpg",
    "tag": "Sports",
    "date": "2026-01-18T15:00:48.000Z",
    "description": "\nThe 2026 NFL divisional round concludes on Sunday as the New England Patriots (-3.5) host the Houston Texans at 3 p.m. ET and the Chicago Bears (+4.5",
    "body": "\nThe 2026 NFL divisional round concludes on Sunday as the New England Patriots (-3.5) host the Houston Texans at 3 p.m. ET and the Chicago Bears (+4.5) host the Los Angeles Rams at 6:30 p.m. ET. Plenty of the betting action will center on the spread, money line and over/under, but bettors are also always looking to push the envelope to put together huge parlays. From NFL player props to alternate lines to exact score predictions, there are several plus-money NFL bets one could pursue in their playoff parlay for a shot at a massive return. Before making any divisional round NFL picks or parlays, you need to see the divisional round NFL longshot parlay from SportsLine's proven computer simulation that pays out $1.2 million on a $10 bet.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the divisional round NFL odds, it's locked in its betting picks to form a longshot NFL parlay that could pay out $1.2 million for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.Top divisional round NFL parlay picksFor the divisional round, one of the picks featured in the parlay is taking Rams tight end Colby Parkinson as an anytime touchdown scorer vs. the Bears. It's a player prop that returns +230, making it a great pick to take either individually or as part of a longshot parlay. Parkinson ranked 86th in the NFL regular season in receptions at 43, but he was extremely efficient in the red zone, scoring eight touchdowns, which tied for 11th in the NFL. After not scoring in the first six weeks of the season, he piled up his eight scores in nine weeks, and then followed that up with a score in the wild-card round last week. SportsLine's model has him scoring 36% of the time on Sunday, making it a great value at these odds. See the rest of the picks in the divisional round NFL parlay here, and you can bet Parkinson as an anytime TD scorer using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make NFL parlay picks for a payout of $1.2 millionThe parlay also includes several additional picks from the divisional round Sunday from SportsLine's computer model, including multiple touchdown props that returns +600 or higher. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for the divisional round that can be combined into a parlay that returns $1.2 million on just a $10 bet, and what optimal touchdown scorer bets should you be all over? Visit SportsLine now to see the top divisional round NFL picks from SportsLine's proven model that can be combined for a parlay that pays $1.2 million, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL divisional round longshot parlay for Sunday from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/7b090d10-b0aa-4f2b-a6ab-0f25b2c567f2/thumbnail/1200x675/229e264993b23314e832c195b326d8c3/usatsi-27667202.jpg"
      ],
      "datePublished": "2026-01-18T15:00:48.000Z",
      "dateModified": "2026-01-18T15:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana vs. Miami prediction, odds: 2026 CFP national championship game picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-miami-prediction-odds-time-2026-college-football-playoff-national-championship-game-picks-cfp-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/ae61004d-823c-487a-b38f-4f3a99abeb27/thumbnail/1200x675/9ab19579c12ecc1829b51a76c114d884/carson-beck.jpg",
    "tag": "Sports",
    "date": "2026-01-18T15:41:04.000Z",
    "description": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes i",
    "body": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes in the 2026 College Football Playoff National Championship Game on Monday, Jan. 19. Miami is coming off a 31-27 win over No. 6 Ole Miss, while Indiana dominated fifth-ranked Oregon 56-22 in the national semifinals. The Hurricanes (13-2, 6-2 ACC), who have won seven in a row, are looking to win their sixth national championship and first since 2001. The Hoosiers (15-0, 9-0 Big Ten), who have won three conference championships in over 125 years, are seeking their first-ever national title. Kickoff is at 7:30 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., which is the Hurricanes' home venue. The Hoosiers are 8.5-point favorites in the latest Miami vs. Indiana odds, as the line has held steady since opening. The over/under for total points scored is 47.5 via DraftKings Sportsbook. Indiana's team total is 28.5, with Miami's listed at 18.5. Before making any Indiana vs. Miami picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. \nNow, the model has set its sights on Miami vs. Indiana. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Indiana vs. Miami:Miami vs. Indiana                                                                                                                                                                                         spreadIndiana -8.5 at DraftKings SportsbookMiami vs. Indiana                                                                                                                                                                                     over/under47.5 pointsMiami vs. Indiana                                                                                                                                                                                                                                                                                                     money line Indiana -340, Miami +270Miami vs. Indiana                                                                                                                                                                                                                                                                                             picksSee picks at SportsLineMiami vs. Indiana                                                                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Indiana can coverJunior quarterback and Heisman Trophy winner Fernando Mendoza helps power the Hoosiers' offense. In 15 games, he has completed 73% of his passes for 3,349 yards and 41 touchdowns with just six interceptions. He also has rushed 83 times for 284 yards and six scores. In the national semifinal win over the Oregon Ducks, he completed 17 of 20 passes for 177 yards and five touchdowns. He also carried six times for 28 yards.Senior running back Roman Hemby leads the rushing attack. In 15 games, he has carried 211 times for 1,060 yards (5.0 average) and seven touchdowns. He also has 15 receptions for 160 yards, including a long of 26. In a 56-3 win at Purdue on Nov. 28, he rushed 12 times for 152 yards and a score. He had 18 carries for 89 yards and a score in a 38-3 win over No. 9 Alabama in the College Football Playoff quarterfinals. See which team to back at SportsLine.\nWhy Miami can cover Senior quarterback Carson Beck helps guide the Hurricanes. In 15 games, he has completed 73.3% of his passes for 3,581 yards and 29 touchdowns with 11 interceptions. He has also rushed for a pair of touchdowns. In the national semifinal win over Ole Miss, he completed 23 of 37 passes for 268 yards and two touchdowns with one interception.The Miami ground attack is led by junior running back Mark Fletcher Jr. In 13 games this season, he has carried 199 times for 1,080 yards (5.4 average) and 10 touchdowns. He also has caught 16 passes for 132 yards (8.3 average) and two touchdowns. In the win over Ole Miss, he rushed 22 times for 133 yards, including a long of 19. See which team to back at SportsLine.How to make Indiana vs. Miami picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.So who wins Indiana vs. Miami, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Miami vs. Indiana spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana vs. Miami prediction, odds: 2026 CFP national championship game picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/ae61004d-823c-487a-b38f-4f3a99abeb27/thumbnail/1200x675/9ab19579c12ecc1829b51a76c114d884/carson-beck.jpg"
      ],
      "datePublished": "2026-01-18T15:41:04.000Z",
      "dateModified": "2026-01-18T15:41:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, 2026 divisional round: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-daily-fantasy-football-lineups-fanduel-draftkings-2026-divisional-round-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/10/0b8effb1-4f58-43ca-93c0-d074816eb7bb/thumbnail/1200x675/9cf66ea43d8995dfc45fae2ce0c90933/stefon-diggs.jpg",
    "tag": "Sports",
    "date": "2026-01-18T14:55:16.000Z",
    "description": "\nThe 2026 NFL divisional round concludes on Sunday with two more games that will finalize the AFC and NFC Championship matchups. The Houston Texans, w",
    "body": "\nThe 2026 NFL divisional round concludes on Sunday with two more games that will finalize the AFC and NFC Championship matchups. The Houston Texans, without Nico Collins (concussion) will travel to take on the New England Patriots at 3 p.m. ET, while the Rams will go on the road against the Chicago Bears at 6:30 p.m. ET. Weather could especially be a factor in the late game with the wind chill in the single digits and wind and snow both in the forecast, which is a factor to remember when crafting NFL DFS lineups.  Who are the best NFL DFS picks for Sunday, and which sleepers can differentiate your NFL DFS lineups on sites like DraftKings and FanDuel? Before making any NFL daily Fantasy picks for the divisional round on Sunday, be sure to check out the NFL DFS advice, strategy and stacks from SportsLine daily Fantasy expert Mike McClure.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the NFL divisional round Sunday DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for the divisional round on SundayOne of McClure's top NFL DFS picks for Sunday is Patriots receiver Stefon Diggs. He had a quiet game in a low-scoring wild-card win over the Chargers, but he had some strong performances late in the regular season. That included a 9-138 receiving line against the Ravens in Week 17 and a 6-101-1 line against the Jets in Week 17. Revenge could be a factor as well for Diggs since he played for the Texans in 2024. See who else to roster at SportsLine, and bet Diggs to go Over 49.5 receiving yards at DraftKings:\nMcClure is also building around Rams tight end Tyler Higbee, who is a value pick after finishing the regular season strong and then recording 45 receiving yards in the wild-card round. He had five receptions for 91 yards and a score against the against the Cardinals in the regular-season finale, showing his upside despite being one of the cheaper players in the NFL DFS player pool for Sunday. See more NFL DFS picks at SportsLine, and bet Higbee to go Over 23.5 receiving yards at DraftKings:\nHow to set divisional round Sunday NFL DFS lineupsMcClure is targeting an undervalued player who could explode for huge numbers on Sunday. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Sunday, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, 2026 divisional round: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/10/0b8effb1-4f58-43ca-93c0-d074816eb7bb/thumbnail/1200x675/9cf66ea43d8995dfc45fae2ce0c90933/stefon-diggs.jpg"
      ],
      "datePublished": "2026-01-18T14:55:16.000Z",
      "dateModified": "2026-01-18T14:55:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL divisional round picks, AI-generated score predictions, best bets for every game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-divisional-round-2026-picks-ai-score-predictions-playoff-bets-today/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/508f5f92-006b-4d58-9c6c-f3a7b1dfabdb/thumbnail/1200x675/b7d9e82b57a26f5ebddfcd56f0b29991/c-j-stroud-houston-texans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-18T16:11:37.000Z",
    "description": "\nThe 2026 NFL divisional round schedule features two games on Sunday with Texans vs. Patriots (-3.5, 40.5) and Rams (-4.5, 48.5) vs. Bears. These are ",
    "body": "\nThe 2026 NFL divisional round schedule features two games on Sunday with Texans vs. Patriots (-3.5, 40.5) and Rams (-4.5, 48.5) vs. Bears. These are moderate NFL spreads and fall in between what the two games on Saturday had. Houston will look to prevail without the services of leading receiver Nico Collins (concussion), and him being ruled out moved the NFL from Patriots -3 to Patriots -3.5.Meanwhile, Bears vs. Rams has double-digit winds and snow in the forecast as single-digit temps are projected. Despite that, it has the highest over/under of any divisional round matchup. How should the elements affect your divisional round NFL bets and playoff predictions? Before making any 2026 NFL divisional round picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For 2026 NFL divisional round NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all four games. You can only see the AI predictions for the 2026 NFL divisional round schedule here.Top 2026 NFL divisional round AI picksAfter analyzing every game in the divisional round, SportsLine AI says the Texans (+3.5) cover in a tight, low-scoring matchup against the Patriots on Sunday at 3 p.m. ET.\nHouston was one of the most impressive teams on Wild Card Weekend, demolishing the Steelers 30-6 on Monday in an elite defensive effort. The offense still has some question marks coming into this matchup, but Houston's defense should be well-equipped to keep this game competitive. SportsLine AI is projecting the Pats to win 15.9-13.5 and says the Texans covering, which returns +100, is a B-rated pick. See its other 2026 NFL divisional round football predictions and football picks at SportsLine, and bet the Patriots at DraftKings here:\nHow to make 2026 NFL divisional round picksIn addition, the AI PickBot has generated three highly-coveted A+ picks for the 2026 NFL divisional round. You need to see the AI's NFL picks before making any 2026 Wild Card Weekend NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 NFL divisional round game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL divisional round picks, AI-generated score predictions, best bets for every game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/508f5f92-006b-4d58-9c6c-f3a7b1dfabdb/thumbnail/1200x675/b7d9e82b57a26f5ebddfcd56f0b29991/c-j-stroud-houston-texans-imagn-images.jpg"
      ],
      "datePublished": "2026-01-18T16:11:37.000Z",
      "dateModified": "2026-01-18T16:11:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Diamondbacks insist they're not trading Marte; Donovan talks continue - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-ketel-marte-diamondbacks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/94e0e4c9-d23f-4c87-8888-b987472ed26b/thumbnail/1200x675/e90d7cf7cef4809d109d11951d5fbeca/marte-getty.png",
    "tag": "Sports",
    "date": "2026-01-18T15:55:26.000Z",
    "description": "\n        Major League Baseball's offseason continues to wind down, with just over three weeks to go until pitchers and catchers report for camp across",
    "body": "\n        Major League Baseball's offseason continues to wind down, with just over three weeks to go until pitchers and catchers report for camp across sites in Florida and Arizona. There's still some business to be conducted during that interim period, with left-hander Framber Valdez, outfielder Cody Bellinger, and third baseman Eugenio Suárez standing out as the best remaining free agents. Below, CBS Sports has compiled all of Sunday's top murmurs and moves in one spot for your viewing convenience.D-backs reiterate no Marte tradeFewer than 10 days have passed since Diamondbacks executive Mike Hazen ruled out the possibility of trading All-Star infielder Ketel Marte. That hasn't stopped reporters from asking if Hazen could reconsider in light of infielders Alex Bregman and Bo Bichette finding new homes, but Hazen doesn't sound like someone who is entertaining the possibility.\n\"We've already engaged in that process. I said at the time that I set the deadline for a reason, to avoid this,\" Hazen told MLB.com.Marte, 32, is under contract through at least the 2030 season and has regularly been one of Arizona's most productive players. Yet he reportedly angered the clubhouse with his availability last summer, fueling speculation that he could be on the move this offseason. The D-backs were rumored to have interest in signing Bregman themselves (before he inked with the Cubs) and then trading Marte. With that option off the table, Hazen seems content to roll with Marte to begin the 2026 campaign.\nMariners, Giants among those interested in DonovanThe Cardinals have had a busy offseason under new top executive Chaim Bloom, trading away right-hander Sonny Gray, third baseman Nolan Arenado, and first baseman Willson Contreras.  Utility player Brendan Donovan figures to join that group at some point before Opening Day.\nIndeed, Donovan continues to draw interest from a collection of teams that includes the Mariners, Giants, Red Sox, and Royals, per the St. Louis Post-Dispatch.\nDonovan, 29, is a popular target thanks to his above-average stick (he's never posted an OPS+ below 114) and defensive versatility. He has an additional season of team control remaining, too, making him a potential multi-year fix for whichever team employs him.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Diamondbacks insist they're not trading Marte; Donovan talks continue - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/94e0e4c9-d23f-4c87-8888-b987472ed26b/thumbnail/1200x675/e90d7cf7cef4809d109d11951d5fbeca/marte-getty.png"
      ],
      "datePublished": "2026-01-18T15:55:26.000Z",
      "dateModified": "2026-01-18T15:55:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks this week, Vegas odds: 2026 divisional round expert predictions against the spread, parlay and props - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-picks-vegas-odds-2026-divisional-round-expert-predictions-spread-parlay-player-props-best-bets-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/af15d466-7a17-4aa3-abe4-99ee3023f0a7/thumbnail/1200x675/39decae563f755453fae6d95a6fc4e18/maye-and-diggs.jpg",
    "tag": "Sports",
    "date": "2026-01-18T13:45:28.000Z",
    "description": "\nThe 2026 NFL playoffs continue on Sunday with a pair of divisional round matchups to make NFL picks on. Sunday's contests are Patriots vs. Texans (+3",
    "body": "\nThe 2026 NFL playoffs continue on Sunday with a pair of divisional round matchups to make NFL picks on. Sunday's contests are Patriots vs. Texans (+3.5) at 3 p.m. ET and Rams vs. Bears (+4.5) at 6:30 p.m. ET. New England has won eight straight divisional round games, which is the longest streak in NFL history. So, should the Pats heavily factor into your NFL bets, player props or as part of a winning NFL parlay?Meanwhile, Chicago and Los Angeles both have six ATS defeats on the season, and each team has also failed to cover in two of its last three contests. When there is evidence to lean towards both sides with NFL predictions, consulting some NFL betting advice wouldn't be the worst idea. Before locking in any divisional round NFL picks or NFL prop bets, be sure to check out the divisional round NFL best bets and predictions from SportsLine's red-hot Vegas experts. SportsLine has more than 40 hand-picked Vegas experts who excel in multiple spots. The NFL, however, is a strength for the site as SportsLine currently has five total experts who are on NFL runs that have returned $1,000 or more for $100 players and one who has returned more than $1,500. Anybody following their NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, with the divisional round NFL schedule quickly approaching, SportsLine's top NFL experts are already locking in their picks. Go to SportsLine to see them all now.Top divisional round NFL expert picks from Sia NejadNejad, also known as the Counselor of Cash, is 26-16 (+741) over his last 42 NFL player props picks. For Patriots vs. Texans, Nejad is backing New England WR Stefon Diggs Under 50. receiving yards (-113).\"The Patriot receiver group has a tough matchup against the Texans and I think Diggs is likely to get plenty of attention from the Texans top two corners. The Patriots like to utilize all of their receiving weapons and that includes the likes of Chism, Williams, Douglas, Henry, Boutte and the running backs. With a tough matchup in mind and the fact that Maye is likely to spread it thin across his plethora of pass catchers, I don't see Diggs having enough big splash plays to hit this over.\" See all of Nejad's picks here, and new users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:\nTop NFL picks from Alex SelesnickAnother prop-bet specialist, Selesnick, who is better known as PropStarz, has returned nearly 45 units since joining SportsLine. He enters this weekend on a 61-42 roll on NFL player props that has returned nearly $1,100 for $100 players. This week, PropStarz is going Under 57.5 receiving yards for Bears tight end Colston Loveland \"This is a huge number for Loveland, who has been very good inside of a crowded Bears pass catching group,\" PropStarz said. \"Loveland, however, has failed to eclipse 55 yards in 11/16 regular season games. Rome Odunze returned to Chicago's lineup last week, giving Caleb Williams numerous options. Loveland has gobbled up 38 targets in his last three games and that is not sustainable. The Rams are also very good in coverage, particularly defending tight ends, having allowed the seventh fewest yards despite surrendering the 14th most targets to the position.\" See the rest of PropStarz's picks here, and bet the Under here:\nHow to make divisional round NFL picksSportsLine's team of experts also includes Brady Kannon, a former SuperContest winner who enters the divisional round on a sizzling 28-11 run (72%) on NFL spread picks, returning nearly $1,600 for $100 players. You can find out who his NFL picks are this weekend here. If you are looking for NFL picks, NFL props, or NFL best bets for the divisional round, SportsLine has you covered with its proven team of experts. Visit SportsLine now to see who which teams you should back in the divisional round, all from a staff that includes five experts who are on NFL runs that have returned $1,000 or more for $100 players.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks this week, Vegas odds: 2026 divisional round expert predictions against the spread, parlay and props - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/af15d466-7a17-4aa3-abe4-99ee3023f0a7/thumbnail/1200x675/39decae563f755453fae6d95a6fc4e18/maye-and-diggs.jpg"
      ],
      "datePublished": "2026-01-18T13:45:28.000Z",
      "dateModified": "2026-01-18T13:45:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami vs. Indiana expert picks: CFP National Championship predictions and odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-picks-predictions-spread-odds-betting-miami-indiana/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/6513e02a-968d-457b-a183-6859da1add4a/thumbnail/1200x675/1beb8e975e5680f8b418c7781877989d/hoosiers-tunnel-1.jpg",
    "tag": "Sports",
    "date": "2026-01-18T15:25:29.000Z",
    "description": "\nMonday night's College Football Playoff National Championship Game between No. 1 Indiana and No. 10 Miami shapes up as a grueling, physical battle be",
    "body": "\nMonday night's College Football Playoff National Championship Game between No. 1 Indiana and No. 10 Miami shapes up as a grueling, physical battle between two teams that have embraced that identity all season. The unbeaten Hoosiers are trying to become college football's first 16-0 national champion, but they must get past a resurgent Hurricanes team playing on its home field.Miami's path has been anything but easy. The Hurricanes knocked off No. 7 Texas A&M on the road, eliminated No. 2 Ohio State in the Cotton Bowl and outlasted No. 6 Ole Miss in the Fiesta Bowl to reach the title game. Powered by a massive offensive line, Miami has created running lanes for Mark Fletcher Jr. while quarterback Carson Beck distributes the ball to elite playmakers such as Malachi Toney, giving the Hurricanes a balanced, efficient attack.First-year defensive coordinator Corey Heatherman has elevated Miami's defense into one of the nation's best, bringing to life fourth-year coach Mario Cristobal's vision of a big, punishing roster. Still, the question remains whether that physicality is enough to test Indiana.The Hoosiers have overwhelmed everyone in their path, blasting No. 9 Alabama 38-3 in the Rose Bowl and dismantling No. 5 Oregon 56-22 in the Peach Bowl. With Heisman Trophy-winning quarterback Fernando Mendoza at the controls and no obvious weaknesses on the roster, Indiana enters as a more-than-touchdown favorite.Second-year coach Curt Cignetti has orchestrated one of the most remarkable turnarounds in college football history, putting Indiana on the brink of its first national championship.Keys to victory in CFP National Championship: How Indiana can win | How Miami can winWhere to watch Miami vs. IndianaDate: Monday, Jan. 19 | Time: 7:30 p.m. ETLocation: Hard Rock Stadium -- Miami Gardens, Fla. TV: ESPN | Live stream: Fubo (Try for free)Miami vs. Indiana picks for CFP National Championship \t \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            IND -8.5\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Fla.)\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Indiana\n                    \n    \n    Tom Fornelli: At what point does everybody start listening to what Indiana's been telling them all season? It has blown out Alabama and Oregon in consecutive playoff games and comes into the championship in much better shape than the Miami Hurricanes do health-wise. I don't expect we see a blowout along the lines of what the Rose and Peach Bowls provided, but I do expect the outcome will be clear before the fourth quarter starts. Pick: Indiana - 8.5 | Indiana 31, Miami 13Chip Patterson: I do think that Miami has the defense to be able to limit what Fernando Mendoza can do pushing the ball deep down the field and also a better rushing attack than Ohio State, which should help no bungling red zone opportunities like the Buckeyes did in the Big Ten title game. The Hoosiers' efficiency and effectiveness should keep them in control most of the game, but the playmaking potential should give Miami enough splash plays to keep it interesting. As long as Miami executes on its scoring chances, it will have a chance to win, but I've got Indiana (best TD% red zone defense in the country) winning those key plays to emerge as 16-0 national champions. Pick: Indiana -8.5 | Indiana 30, Miami 20Brandon Marcello: Miami is still the most physical, violent team remaining in the playoff. Indiana has been unbreakable all season, even in a pair of close calls against Penn State and Iowa, but this Hurricanes team is relentless along the offensive and defensive lines. The problem for Miami is that it still doesn't quite trust quarterback Carson Beck to throw deep, leading to more underneath throws. Even against Ole Miss, drives stalled in the second half when the Hurricanes pulled away from running the ball with Mark Fletcher Jr. Indiana's offense gets a lot of attention with Heisman winner Fernando Mendoza, but it's the defense that has won games. I trust both quarterbacks in 2-minute situations, but Mendoza protects the ball and Beck is a bit more unpredictable. This will be a slugfest at times, but Indiana will pull away to make this the eighth straight title game with the champion winning by double digits. Pick: Indiana -8.5 | Indiana 31, Miami 21John Talty: Indiana has been the best team all season long. They are elite offensively and defensively. They have America's best coaching staff. They have my favorite curmudgeon in the sport. I've been riding with the Hoosiers since the spring, and I'm not stopping now. What once felt unbelievable will become reality: Indiana as national champions. Pick: Indiana -8.5 | Indiana 34, Miami 20Shehan Jeyarajah: Indiana has been a perfect football team in 2025, and it will ultimately end with an elusive first national championship. It won't come easy. Miami's top-rated defensive line will force mistakes, including at least one turnover from Heisman winner Fernando Mendoza. However, Mendoza's legend will be cemented with a fourth-quarter touchdown to ice the game and deliver the Hoosiers an unlikely title. Pick: Indiana - 8.5 | Indiana 27, Miami 17David Cobb: Miami's offensive line is sturdy enough to prevent Indiana's defensive front from completely taking over, a necessity if the Hurricanes hope to stay within striking distance. On the other side, Miami has enough punch up front -- led by Rueben Bain Jr. and Akeem Mesidor -- to make the Hoosiers uncomfortable at times. Ultimately, Indiana looks like a team of destiny and should win outright. But Miami is capable of turning this into a fight. Pick: Miami +8.5 | Indiana 27, Miami 20Chris Hummer: Miami is playing a national championship game at home. What a story. What an opportunity. What a moment. The Hurricanes can't lose it, right? Well ... here comes Indiana. It feels ridiculous to type that with a 15-0 Indiana. It's Indiana! History tells us this isn't possible, but Curt Cignetti has created a monster in Bloomington. They're the most well-coached, most disciplined and best team in the country. Plus, they have a Heisman Trophy-winning QB and, if you talk to coaches around the sport, have a roster that athletically matches up with anyone. As crazy as it feels to write, I'm picking Indiana to win a national championship. How could I not? Maybe Miami finds a bit more magic at home. But this has been the season of Indiana. As long as Indiana's o-line can hold up on the edges, it wins this game. Pick: Miami +8.5 | Indiana 24, Miami 21Who will win and cover in Indiana vs. Miami? SportsLine's computer model just simulated the College Football Playoff National Championship Game 10,000 times and projects that one side will cover well over 50% of the time. Visit SportsLine to find out who it is.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami vs. Indiana expert picks: CFP National Championship predictions and odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/6513e02a-968d-457b-a183-6859da1add4a/thumbnail/1200x675/1beb8e975e5680f8b418c7781877989d/hoosiers-tunnel-1.jpg"
      ],
      "datePublished": "2026-01-18T15:25:29.000Z",
      "dateModified": "2026-01-18T15:25:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bears vs. Rams weather: Frigid temperatures, heavy winds and snow in forecast for playoff game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rams-bears-weather-forecast-chicago-nfl-playoffs-wind-snow/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/ddac79b5-552e-4510-988d-9015652aa23c/thumbnail/1200x675/1690525d1d2ca7f09db61a3e301928d0/stafford-snow.jpg",
    "tag": "Sports",
    "date": "2026-01-18T14:37:43.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Rams will face the Chicago Bears o",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Los Angeles Rams will face the Chicago Bears on Sunday evening in a fascinating NFL divisional round showdown that will feature even more intrigue due to the weather forecast in Chicago. The high in Chicago on Sunday is projected to be 21 degrees with the wind chill in the single digits at Soldier Field. On top of that, there's a 69% chance of light snow showers and 20 mph winds with gusts reaching 27 mph, per AccuWeather, as the Windy City will live up to its name. That will present a challenge for both teams, particularly in the passing game. Even with a pair of strong-armed quarterbacks in Matthew Stafford and Caleb Williams, throwing the ball down the field in 20-plus mph winds is exceedingly difficult. \n        \n            \n                Bears vs. Rams prediction: Can the Bears continue their magic by upsetting Matthew Stafford and the Rams?\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nThe Bears should at least be accustomed to playing in cold weather, even if it won't be ideal conditions for Williams, their second-year quarterback. The conditions figure to aid in their home field advantage against a Rams team from sunny Los Angeles that plays their home games indoors. \nLast year, the Rams lost 28-22 in the divisional round on a snowy evening in Philadelphia, and they may have to navigate similar cold and slick conditions on Sunday in Chicago. In that game, Matthew Stafford fumbled twice, losing one, and Kyren Williams also turned it over once with a fumble, with those two turnovers proving pivotal in a tight loss to the Philadelphia Eagles, the eventual Super Bowl champions. Ball security will be paramount once again in frigid temperatures and potentially snowy conditions, and Stafford and the Rams will have to make some improvements on last year in that area if they are going to get the win. \nLos Angeles is a 3.5-point favorite on the road even with the forecast calling for extreme cold and winds, with a point total of 48.5 at DraftKings Sportsbook. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bears vs. Rams weather: Frigid temperatures, heavy winds and snow in forecast for playoff game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/ddac79b5-552e-4510-988d-9015652aa23c/thumbnail/1200x675/1690525d1d2ca7f09db61a3e301928d0/stafford-snow.jpg"
      ],
      "datePublished": "2026-01-18T14:37:43.000Z",
      "dateModified": "2026-01-18T14:37:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morocco vs. Senegal live stream: How to watch AFCON 2026 final, start time, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/morocco-senegal-afcon-2026-final-live-stream-where-to-watch-odds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/49fd6b03-32a4-479f-b2bc-bb4a94ca9e12/thumbnail/1200x675/882b5373be5e11d5fc78fda409e06c4a/morocco.jpg",
    "tag": "Sports",
    "date": "2026-01-18T15:58:29.000Z",
    "description": "\n        The Africa Cup of Nations is set as Senegal will face Morocco on Sunday to determine the champion of the continent. Senegal were able to get ",
    "body": "\n        The Africa Cup of Nations is set as Senegal will face Morocco on Sunday to determine the champion of the continent. Senegal were able to get past Egypt in the semifinals, while it took a penalty shootout for Morocco to book their place in the final in front of their home fans. Morocco got past Nigeria, who had been the top scoring team at AFCON, and it will set up quite a final on Sunday as the Atlas Lions look to win the tournament for the first time since 1976. They've been an extremely successful side at World Cups, but Morocco haven't even been runners-up at AFCON since 2004, but that could all change Sunday.How to watch Senegal vs. Morocco, oddsDate: Sunday, Jan. 18 | Time: 2 p.m. ETLocation: Prince Moulay Abdellah Stadium -- Rabat, MoroccoTV: beIN Sports | Live stream: Fubo (Try for free)Odds: Senegal +270; Draw +180; Morocco +125How Senegal got hereAfter winning Group D by going undefeated during the group stage, Senegal had the joint best defensive record, allowing only one goal in group stage play. Pushing to the knockout stage, they were able to fend off Sudan before Mali's red card made advancing past the quarterfinals a breeze. Meeting Egypt, Senegal's defense were again strong, keeping Mohamed Salah in check en route to another shutout victory. Only allowing two goals at AFCON so far, keeper Edouard Mendy and the Senegal defense will be tough to break down as the nation look to secure their first AFCON title since 2021.How Morocco got hereLike Senegal, Morocco won Group A with an undefeated record, scoring six goals while only allowing one. Real Madrid man Brahim Diaz's goals were a large part of their success, but so was the return of Paris Saint-Germain right back Achraf Hakimi from injury, which has given them their leader back on the pitch. Called in without playing a minute of soccer for PSG this season, it was a risk bringing Hakimi, but he has hit the pitch as if he hasn't missed a step, which has been critical in the knockout stage for the Atlas Lions. They squeaked past Tanzania in the round of 16 before putting two goals past Cameroon. Coming up against Nigeria in the semifinals was quite a tall task for Morocco, but keeper Yassine Bounou was more than ready to play under pressure and secure their place in the final.Players to watchSenegal: All eyes will be on Sadio Mane, despite him being more of a creative presence during this tournament. When his team needed him most, Mane came up with a goal to defeat Egypt, but during the tournament as a whole, he has two goals and three assists. With Nicolas Jackson and Iliman Ndiaye being able to help pace the attack, less pressure has been on Mane to score in this tournament but he has been a critical part of the progression of Senegal's balanced attack. Facing Morocco in the final, while it will be a defense-first affair, this is a moment where stars like Mane will be looked upon.Morocco: Brahim Diaz will not only be looking to win AFCON, but he also enters as the leader in the Golden Boot race. With five goals so far in this tournament, it's clear where the Atlas Lions will look for their goals. He's gotten it done in plenty of different ways and will be looking to bounce back after Nigeria were able to keep him from making an impact in attack. Forward Ayoub El Kaabi of Olympiacos has been able to offer a secondary focus in the attack, but Diaz is still the first person that Morocco look to when they need a goal, and he'll need to be at his best to break down a stout Senegal defense. \nPredicted lineupsSenegal's defensive strength will be tested as suspensions will rear their heads in the final. Captain, starting center back, Kalidou Koulibaly, and midfielder Habib Diarra will both be suspended for the final due to yellow card accumulation, while Morocco will enter the final with everyone in the side available. Both teams have been able to rotate in the lead up to this match, but losing their captain for the final could be a step too much for Senegal to overcome.Senegal: Édouard Mendy, Malick Diouf, Moussa Niakhate, Mamadou Sarr, Krepin Diatta, Lamine Camara, Idrissa Gana Gueye, Pape Gueye, Iliman Ndiaye, Nicolas Jackson, Sadio ManéMorocco: Yassine Bounou, Noussair Mazraoui, Adam Masina, Nayef Aguerd, Achraf Hakimi, Ismael Saibari, Neil El Aynaoui, Bilal El Khannouss,  Abde Ezzalzouli, Ayoub El Kaabi, Brahim Diaz\nPredictionMaking it to their first final since 2004, this feels like Morocco's best chance to win AFCON. Their window isn't closing right now, but after a fourth-place finish at the 2022 World Cup, pressure is on the Atlas Lions to win it all while hosting this tournament in thier home country. That would crush most teams, but when Morocco have already had to deal with World Cup pressure, the experience will help them even with an entire nation cheering for them to bring AFCON glory home. With Senegal's defense shining, it will provide only just enough for Morocco to escape a tightly contested affair to win their first AFCON title since 1976. Score: Senegal 0, Morocco 1\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morocco vs. Senegal live stream: How to watch AFCON 2026 final, start time, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/49fd6b03-32a4-479f-b2bc-bb4a94ca9e12/thumbnail/1200x675/882b5373be5e11d5fc78fda409e06c4a/morocco.jpg"
      ],
      "datePublished": "2026-01-18T15:58:29.000Z",
      "dateModified": "2026-01-18T15:58:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bayern Munich destroy RB Leipzig behind second-half dominance - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/fc-bayern-munich-rb-leipzig-score-bundesliga-harry-kane/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/c3f78a6b-51d2-4d5d-b153-d696f7be021c/thumbnail/1200x675/a5036f4901c2e3f778e05bf72d2eb3a1/kane.jpg",
    "tag": "Sports",
    "date": "2026-01-18T14:07:52.000Z",
    "description": "\n        LEIPZIG, Germany – In the late morning hours on a sunny Saturday, the impressive Baroque buildings that make up Leipzig's city center welcome",
    "body": "\n        LEIPZIG, Germany – In the late morning hours on a sunny Saturday, the impressive Baroque buildings that make up Leipzig's city center welcomed a batch of locals who popped in and out of shops of their choice – and stopped in their tracks as they stumbled upon Bayern Munich's team buses. Some slowed down as they strolled past, many took out their phones to take a picture, while others stopped outside with seven hours to go until kickoff against RB Leipzig.Such is the oversized presence of Germany's record champions that even as Leipzig started the game in impressive fashion, asserting control over the match in almost no time at all, that the other shoe felt destined to drop.Leipzig were more than capable of inflicting damage on Bayern, Ole Werner's side on track to finish inside the UEFA Champions League berths with half a season to go. Christoph Baumgartner's shot in the third minute was a warning but Romulo's attempt two minutes later established a pattern – the hosts could work around Bayern's defense thanks to their trademark intense style. Yan Diomande, arguably the find of the Bundesliga season after Leipzig signed inexperienced 19-year-old from Leganes, was troubling Bayern left back Hiroki Ito and 20-year-old forward Antonio Nusa had more than his fair share of attempts on goal. Leipzig limited Bayern to their lowest expected goal tally in the first half of a Bundesliga match all season long with a tally of just 0.63, but there was just one problem. The hosts had not put their chances away, underperforming on the 2.03 expected goals they had generated along the way.\"First half was tough, to be honest,\" Bayern's Harry Kane said post-match. \"We expected them to come out with a lot of energy, a lot of intensity and that's exactly what happened. We just weren't quite good enough with the ball. I felt that we gave a lot of balls away, which gave them momentum.\"\nIt was the perfect set-up for a Bayern comeback that called back of their longstanding dominance, even as Vincent Kompany puts his own spin on things in his second season in charge of the team. Every single reminder of Bayern's ability to perform was on clear display in the second half, even as Leipzig remained competitive with the score at 2-1 in the visitors' favor heading into the final 10 minutes. Serge Gnabry and Harry Kane had Bayern ahead by the 70th minute, the form that makes them a contender for the Champions League title this season on full display.\"When a team likes to press like they do, sometimes I like to drop even into defensive areas to see if the center backs are fully committed to come all the way,\" Kane said about the team's style of play. \"It takes a lot for teams to really commit that way and I think that's why you sometimes see me in that kind of [No.] 6 position, that [No.] 8 position in the half-turn. In terms of in the final third, we don't really play with an out-and-out [No.] 9. We almost play with two [No.] 10s with wingers who come attack inside. … The center backs, maybe they're not quite sure to go in with me or to stay back.\"Then came the onslaught. Bayern went from a 2-1 lead in the 81st minute to a 5-1 win by the final whistle, generating 1.47 expected goals along the way. Michael Olise became the star of the show, following up an assist to Kane's goal with two more assists of his own and the game's final goal.\n\"Even when they went  2-1 up, we had some chances to come back into the game,\" Leipzig goalkeeper Peter Gulacsi said. \"After the third goal, we just opened up and it was unnecessary and a bit disappointing from our side to concede another two because I thought for a majority of the game, we played a really strong game.\"Leipzig's commitment to an attack-minded game plan was eventually their downfall, which eventually acted as a perfect invitation for Bayern.\"We lost a bit of control, our shape,\" Gulacsi said. \"We were maybe taking too much risks and this is a team that will punish you straight away on the counterattack and that's what happened. We were not closing, we were not marking them enough for the last two goals and they really punished us.\"\nBayern's late bust of goals came with the inarguable truths of Germany's top flight. Kane, who is currently chasing the Bundesliga's single season goalscoring record set by Robert Lewandowski when he scored 41 for Bayern during the 2020-21 campaign, is a cheat code in his own right. Kompany was able to bring Michael Olise into the game as a second half substitute, the France international putting on an impressive display with three assists and the final goal of the game. It is not exactly difficult to recall seasons where Bayern were second-best but year after year, the Bundesliga title is theirs to lose because of the financial and historical advantages that pave the way to build Germany's greatest squad over and over again.Leipzig, as a result, ended up on the wrong side of the Bayern Munich experience, feeling the brutal effects of the visitors' unrelenting ability.\"It's hard to keep your focus,\" Leipzig goalscorer Romulo said about the game state after Kane's go-ahead goal, \"and then they push. They always push and they have top players so they get chances and they score five. It's to not to turn off the mind.\"\nEven if Leipzig had quickly created a pattern of excellence in the first half, Bayern reverted to a familiar habit of their own to close out the game.\"We knew in the second half to be calm,\" Kane said. \"The spaces will open up as the game gets more stretched. The last 30 minutes, it's happened a lot this season, and that's exactly what happened. We took our moments when we needed to. Manu[el Neuer] made some incredible saves when we needed him, some good blocks from the center backs and then we just kind of grew into the game.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bayern Munich destroy RB Leipzig behind second-half dominance - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/c3f78a6b-51d2-4d5d-b153-d696f7be021c/thumbnail/1200x675/a5036f4901c2e3f778e05bf72d2eb3a1/kane.jpg"
      ],
      "datePublished": "2026-01-18T14:07:52.000Z",
      "dateModified": "2026-01-18T14:07:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Sony Open leaderboard: Davis Riley takes lead with Nick Taylor now chasing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/sony-open-leaderboard-2026-round-3-davis-riley-nick-taylor/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/84877062-ef4e-4685-a84c-47c5344fe4f1/thumbnail/1200x675/a1871554102b0438817df04ae2b858a9/riley.jpg",
    "tag": "Sports",
    "date": "2026-01-18T04:05:58.000Z",
    "description": "\n        The third round of the 2026 Sony Open saw players again challenged by windy conditions in Honolulu, Hawai'i, and with 18 holes left to play, ",
    "body": "\n        The third round of the 2026 Sony Open saw players again challenged by windy conditions in Honolulu, Hawai'i, and with 18 holes left to play, Davis Riley has taken the solo lead at Waialae Country Club. Riley was tied for the lead with three others after the second round, but on a difficult afternoon, his 3-under 67 was the best of the lead pack and moved him into first alone, two ahead of the field.Riley spoke after his strong second round about how his putter was carrying him, and that continued Saturday with another terrific effort with the flat stick, picking up 2.614 strokes on the field in the third round on the greens. He leads the field in strokes gained putting for the week, and if he can keep the putter warm on Sunday, he'll put himself in position to pick up his third career win. Leading the charge behind Riley on the leaderboard are Harry Hall and Chris Gotterup. Hall shot one of the best rounds of the day with a 4-under 66 to move to 10 under and get one back of the lead going into Sunday. Gotterup matched Riley's 68 to stay attached as he carries momentum from a strong close to 2025 into the start of his 2026 season, making clear his surge wasn't a fluke. The round of the day belonged to Corey Conners and Hideki Matsuyama, as two of the top-ranked players and best ball-strikers in the field handled the challenging conditions better than anyone else to post 5-under 65s and climb the leaderboard. \nHeading into the weekend, there are nine players within three shots of the lead and 19 players within five shots, setting up an intriguing final round where plenty of players will feel like they have a legitimate shot at the first PGA Tour title of the 2026 season. Leader1. Davis Riley (-12): Riley's hot putter has been the story of the week so far, but his ball-striking seems to be improving as the week goes on, which will be critical if he's going to convert a 54-hole lead into a victory. Saturday was the first round of the week Riley gained strokes both off the tee and approaching the green, and that part of his game will have to hold up under the final round nerves right alongside his putter. ContendersT2. Harry Hall, Chris Gotterup, Kevin Roy (-10)T5. Ryan Gerard, John Parry, Nick Taylor (-9)T8. Corey Conners, Adam Svensson, Patrick Rodgers (-8)T11. Si Woo Kim, S.H. Kim (-7)T13. Hideki Matsuyama, Jordan Spieth, Robert MacIntyre and three others (-6)\nThere is a sizable chase group, headlined by Hall and Gotterup, but Roy has been near the top of the leaderboard since Thursday and hasn't shown any indication he'll simply fade away on Sunday. Taylor is the defending champion, and while a stumble early on his back nine caused him to slip out of the lead for the first time all week, a closing birdie kept him in touch. He's still got to be considered a significant threat to go back-to-back at Waialae. The rest of the big names in the top 20 will need something rather spectacular to win, but the likes of Conners and Matsuyama showed on Saturday that they're capable of it. Spieth has been the most consistent player of the week, which is not normally an attribute we think of first with Spieth, but three consecutive rounds of 68 have him in the hunt for at least a top 10 in his first start to an extremely important season for him. 2026 Sony Open updated picks, oddsOdds via FanDuel SportsbookDavis Riley (23/10)Harry Hall (47/10)Chris Gotterup (5-1)Nick Taylor (10-1)Kevin Roy (11-1)Ryan Gerard (11-1)John Parry (14-1)Corey Conners (16-1)Riley's birdie at the last made him the clear favorite going into Sunday's final round. Of the chase group, Gotterup and Roy are intriguing. Gotterup proved his ability to close out a win last year and is a strong wind player. Roy has been impressive all week, and just two back at 11-1, he offers some value as long as he continues his level of play from the first 54 holes.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Sony Open leaderboard: Davis Riley takes lead with Nick Taylor now chasing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/84877062-ef4e-4685-a84c-47c5344fe4f1/thumbnail/1200x675/a1871554102b0438817df04ae2b858a9/riley.jpg"
      ],
      "datePublished": "2026-01-18T04:05:58.000Z",
      "dateModified": "2026-01-18T04:05:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bo Nix injury: Broncos QB suffers season-ending ankle injury in win over Bills - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bo-nix-injury-broncos-qb-ankle-fracture-jarrett-stidham/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/b725a2a6-01bd-4c99-b001-b6ec6b3b368a/thumbnail/1200x675/55ea4c5194af9bc3222631f3d23ee1e0/bo-nix-no-helmet-broncos.jpg",
    "tag": "Sports",
    "date": "2026-01-18T03:55:54.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Denver Broncos quarterback Bo Nix suffered a fract",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Denver Broncos quarterback Bo Nix suffered a fractured bone in his ankle late in the 33-30 overtime victory over the Buffalo Bills on Saturday and will have season-ending surgery. Backup quarterback Jarrett Stidham will start in Nix's place in the AFC Championship game against either the New England Patriots or Houston Texans. Broncos coach Sean Payton confirmed the injury after the game, saying it occurred on the second-to-last play of overtime. \"On the second to last play in overtime, Bo fractured a bone in his right ankle,\" Payton said. \"He's scheduled to have surgery Tuesday of this week, which will put him out for the rest of the season. [Stidham's] ready to go. Yeah it was the second to last play before he threw the pass to [Marvin] Mims.\"Payton saying the \"second to last play\" caused a bit of confusion, but if it was the play before the downfield pass attempt to Mims, that was a designed quarterback run by Nix that lost two yards. After that play, he threw a deep ball to Mims that drew a crucial pass interference penalty that gave the Broncos a first and goal. Nix then took a knee to set Wil Lutz up for the game-winning field goal. \nNix finished Saturday completing 26-of-46 passes for 279 yards, three touchdowns and one interception. He was also the Broncos' leading rusher with 29 yards on 12 carries. Jarrett Stidham has not thrown a pass in either of the last two regular seasons for the Broncos, as Nix took all of the snaps for the Broncos at quarterback in every game in the 2024 and 2025 seasons. Now he'll be thrust into the starting role in the biggest game of the season. Denver can lean on the fact that they get to host the AFC Championship Game and the defense has played outstanding down the stretch. The Broncos forced four turnovers of Bills QB Josh Allen on Saturday night.The Broncos were also a Super Bowl favorite heading into the weekend. However, with the news of Nix's injury, their odds have dropped down to +850 at DraftKings Sportsbook.\nStidham has started four career games with a 1-3 record -- two with the Raiders in 2022 and two with the Broncos in 2023. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bo Nix injury: Broncos QB suffers season-ending ankle injury in win over Bills - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/b725a2a6-01bd-4c99-b001-b6ec6b3b368a/thumbnail/1200x675/55ea4c5194af9bc3222631f3d23ee1e0/bo-nix-no-helmet-broncos.jpg"
      ],
      "datePublished": "2026-01-18T03:55:54.000Z",
      "dateModified": "2026-01-18T03:55:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, TV, live streaming, results for every round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/79655f39-3033-409b-8b8d-63e78353a883/thumbnail/1200x675/40169377e3226dd6b9f3b4f5d3432926/graphic-nflbracket-seadiv.jpg",
    "tag": "Sports",
    "date": "2026-01-18T04:17:51.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                      ",
    "body": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 17, 2026\n                            \n                    at\n    11:17 pm ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports Design\n            \n            \n    \n        The divisional round of the NFL playoffs is here and it started with a bang on Saturday. The Denver Broncos are headed to the AFC Championship game for the first time in 10 years after knocking off the Buffalo Bills, 33-30, in a wild game that went to overtime. The Broncos vaunted defense forced five turnovers and four of those came from Josh Allen, who threw two interceptions. The top-seeded Broncos will now host either the Patriots or Texans in the AFC title game next week, but they'll have to do it without Bo Nix, who suffered a season-ending ankle injury against Buffalo. Although the early game on Saturday was filled with drama, there none in the late game. Seattle jumped out to a 17-0 first-quarter lead and then rolled to a 41-6 win over the 49ers. The win by Seahawks means that they'll now get to host the Bears or the Rams in the NFC Championship game next week. The final two games of the divisional round will be played on Sunday and that will kick off with the Patriots hosting the Texans. That matchup will feature a Patriots offense that scored the second-most points in the NFL this year going up against a Texans defense that gave up the second-fewest. The Bears and Rams will close out the divisional round on Sunday night in what is expected to be frigid temperatures at Soldier Field. With that in mind, let's take a look at the full playoff schedule, including the dates and kickoff times for the divisional round.Divisional Round scheduleSaturday, Jan. 17(1) Broncos 33-30 over (6) Bills. The Broncos have had one of the best defenses in the NFL all year and Josh Allen found out firsthand why they're so good. The Bills turned the ball over five times with four of those coming from Allen. The Bills QB threw an interception in overtime that set up Denver's game-winning drive. Bo Nix also came up big for the Broncos, throwing for 279 yards and three touchdowns in the win. (1) Seahawks 41-6 over (6) 49ers. Rashid Shaheed returned the opening kickoff 95 yards for a touchdown and this game was essentially over after that. The Seahawks defense absolutely suffocated the 49ers, forcing three turnovers while sacking Brock Purdy twice. They also kept San Francisco out of the end zone for the second straight time after also holding the 49ers without a touchdown in Week 18. With Sa Darnold dealing with an oblique injury, the Seahawks put their offense in the hands of Kenneth Walker, who rushed for 116 yards and three touchdowns. Sunday, Jan. 18(5) Texans at (2) Patriots, 3 p.m. ET (ESPN/ABC; Fubo, try for free)(5) Rams at (2) Bears, 6:30 p.m. ET (NBC)Championship SundaySunday, Jan. 25AFC Championship\nPatriots/Texans at Broncos, 3 p.m. ET (CBS, Paramount+)NFC ChampionshipRams/Bears at Seahawks, 6:30 p.m. ET (Fox; Fubo, try for free)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)Wild Card resultsSaturday, Jan. 10(5) Rams 34-31 over (4) PanthersRams vs. Panthers recap: The Panthers almost pulled off the upset, but they couldn't stop Matthew Stafford with the game on the line. With the Rams trailing 31-27, Stafford engineered a 71-yard game-winning scoring drive that ended when he hit Colby Parkinson with a 19-yard touchdown with just 38 seconds left to play. Stafford threw for 304 yards and three touchdowns in the win. (2) Bears 31-27 over (7) PackersPackers vs. Bears recap: The Bears pulled off the third-largest fourth-quarter comeback in NFL history. Going into the final quarter, the Bears were trailing by 15 points, but they were able to erase that deficit during a miracle quarter where they outscored the Packers, 25-6. Caleb Williams threw for more yardage (184) in the fourth quarter than he did in the first three quarters combined (177). Williams capped things off with a 25-yard score to DJ Moore with just 1:43 left to win the game. Sunday, Jan. 11(6) Bills 27-24 over (3) JaguarsBills vs. Jaguars recap: For the first time in his career, Josh Allen led a game-winning drive in the fourth quarter of a playoff game. The Bills' franchise quarterback scored the game-winning touchdown on a 1-yard run with just one minute left to play. Allen also threw a 15-yard TD pass in the fourth quarter to help propel Buffalo to the win. Allen totaled 306 yards and three touchdowns in the win. For the Bills, it was their first road playoff win in 33 years. (6) 49ers 23-19 over (3) Eagles49ers vs. Eagles recap: The 49ers pulled off a shocker by going on the road and knocking off the Eagles. After losing George Kittle, the 49ers had some unlikely heroes, including Demarcus Robinson, who caught six passes for 111 yards and a touchdown. Christian McCaffrey also came up big with two touchdowns, including the game-winning score, which came on a 4-yard pass from Brock Purdy with just 2:54 left to play. (2) Patriots 16-3 over (7) ChargersChargers vs. Patriots recap: The Patriots defense took over and carried New England to the win. Justin Herbert was sacked six times as the Patriots kept the Chargers out of the end zone and held them to fewer than 210 total yards.The offense didn't light up the scoreboard, but Drake Maye was impressive in his first career postseason start, throwing for 268 yards and rushing for 66 more. The Patriots are headed to the divisional round for the first time since 2018.Monday, Jan. 12(5) Texans 30-6 over (4) Steelers\nTexans vs. Steelers recap. The Texans had the best defense in the NFL during the regular season, and that unit carried them to a win against Pittsburgh. The Texans defense sacked Aaron Rodgers four times, held the Steelers to just 175 yards and scored two touchdowns, which both came in the fourth quarter. The first one came on a 33-yard fumble return by Sheldon Rankins, and then Calen Bullock followed that up with a 50-yard pick six with just 2:39 left in the game. It was a defensive masterpiece by a Texans team that picked up its first road win in franchise history\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, TV, live streaming, results for every round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/79655f39-3033-409b-8b8d-63e78353a883/thumbnail/1200x675/40169377e3226dd6b9f3b4f5d3432926/graphic-nflbracket-seadiv.jpg"
      ],
      "datePublished": "2026-01-18T04:17:51.000Z",
      "dateModified": "2026-01-18T04:17:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons hire former Browns coach Kevin Stefanski to same role - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-kevin-stefanski-hire-browns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/8dc82d6f-ae53-4e69-b12d-ad0ea1a0ff1a/thumbnail/1200x675/b93701662f55255e9c6cc652bd1697c8/stefanski.jpg",
    "tag": "Sports",
    "date": "2026-01-18T02:59:16.000Z",
    "description": "\n        The Atlanta Falcons have hired Kevin Stefanski as their next coach, the team announced on Saturday. The addition of Stefanski is the first ma",
    "body": "\n        The Atlanta Falcons have hired Kevin Stefanski as their next coach, the team announced on Saturday. The addition of Stefanski is the first major move made by the Falcons since hiring franchise legend Matt Ryan as the president of football earlier this month. Stefanski, who replaces Raheem Morris, was fired Jan. 5 by the Cleveland Browns after six seasons. He posted a 45-56 record and two postseason appearances during that span. He won the AP Coach of the Year award twice in Cleveland, but was let go after going 8-26 combined over the last two seasons. Despite the recent struggles, he immediately became a hot commodity on the coaching market. \"We're thrilled to land a lead-by-example leader in Kevin Stefanski who brings a clear vision for his staff, our team and a closely aligned focus on building this team on fundamentals, toughness and active collaboration with every area of the football operation,\" Ryan said in a statement. \"Coach Stefanski is a team-first leader who puts a premium on accountability for everyone and a player-driven culture. \"His experience in Cleveland and Minnesota has given him a great understanding of the importance of working in sync with scouting, personnel and the rest of the football staff to maximize talent across the roster and in doing everything possible to put our players in the best position to succeed. Kevin's style of leadership, combined with the staff and infrastructure in place here in Atlanta, gives us confidence in our shared vision for the team and we are excited to have him as the leader of our football team.\"\nThe Falcons will hope Stefanski can help their offense improve from 2025 when they finished 24th in the NFL in scoring. The Browns' offense struggled in Stefanski's last two seasons, finishing in the bottom two in the NFL in scoring both years. However, the quarterback situation in Cleveland has been dire since Baker Mayfield's departure, as the Deshaun Watson signing turned into a disaster for the Browns and many around the league point to the quarterback rotation, not coaching, as the reason the Browns struggled. In Atlanta, Stefanski will have Michael Penix Jr. entering his third season in the NFL but coming off another ACL injury that ended his season in November. Penix completed 60.1% of his passes for 1,982 yards, nine touchdowns and three interceptions prior to his injury in the 10th game of the year. Kirk Cousins played well in his eight starts, including the final four wins that put Atlanta into a three-way tie atop the NFC South at 8-9 with the Carolina Panthers winning the tiebreaker. \nThe Falcons haven't won the division since 2016 when they went to the Super Bowl and haven't had a winning season since 2017. Stefanski certainly has experience taking a struggling franchise and quickly getting them to the playoffs, as he took the Browns to the playoffs in his first season in Cleveland, snapping a 17-year postseason drought. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons hire former Browns coach Kevin Stefanski to same role - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/8dc82d6f-ae53-4e69-b12d-ad0ea1a0ff1a/thumbnail/1200x675/b93701662f55255e9c6cc652bd1697c8/stefanski.jpg"
      ],
      "datePublished": "2026-01-18T02:59:16.000Z",
      "dateModified": "2026-01-18T02:59:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]