[
  {
    "title": "NFL DFS picks, 2026 divisional round: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-best-daily-fantasy-football-lineups-fanduel-draftkings-2026-divisional-round-sunday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/f1fa9893-2ec3-44de-83d8-bb6f47f2be28/thumbnail/1200x675/98dd912ccb0e90aa0e843eb261bcc719/stefon-diggs-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-18T00:03:10.000Z",
    "description": "\nThe 2026 NFL divisional round concludes on Sunday with two more games that will finalize the AFC and NFC Championship matchups. The Houston Texans wi",
    "body": "\nThe 2026 NFL divisional round concludes on Sunday with two more games that will finalize the AFC and NFC Championship matchups. The Houston Texans will travel to take on the New England Patriots at 3 p.m. ET, while the Rams will go on the road against the Chicago Bears at 6:30 p.m. ET. Weather could especially be a factor in the late game with the wind chill in the single digits and wind and snow both in the forecast, which is a factor to remember when crafting NFL DFS lineups.  Who are the best NFL DFS picks for Sunday, and which sleepers can differentiate your NFL DFS lineups on sites like DraftKings and FanDuel? Before making any NFL daily Fantasy picks for the divisional round on Sunday, be sure to check out the NFL DFS advice, strategy and stacks from SportsLine daily Fantasy expert Mike McClure.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the NFL divisional round Sunday DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for the divisional round on SundayOne of McClure's top NFL DFS picks for Sunday is Patriots receiver Stefon Diggs. He had a quiet game in a low-scoring wild-card win over the Chargers, but he had some strong performances late in the regular season. That included a 9-138 receiving line against the Ravens in Week 17 and a 6-101-1 line against the Jets in Week 17. Revenge could be a factor as well for Diggs since he played for the Texans in 2024. See who else to roster at SportsLine, and bet Diggs to go Over 49.5 receiving yards at DraftKings:\nMcClure is also building around Rams tight end Tyler Higbee, who is a value pick after finishing the regular season strong and then recording 45 receiving yards in the wild-card round. He had five receptions for 91 yards and a score against the against the Cardinals in the regular-season finale, showing his upside despite being one of the cheaper players in the NFL DFS player pool for Sunday. See more NFL DFS picks at SportsLine, and bet Higbee to go Over 23.5 receiving yards at DraftKings:\nHow to set divisional round Sunday NFL DFS lineupsMcClure is targeting an undervalued player who could explode for huge numbers on Sunday. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Sunday, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, 2026 divisional round: Sunday slate lineup advice for DraftKings and FanDuel - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/f1fa9893-2ec3-44de-83d8-bb6f47f2be28/thumbnail/1200x675/98dd912ccb0e90aa0e843eb261bcc719/stefon-diggs-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2026-01-18T00:03:10.000Z",
      "dateModified": "2026-01-18T00:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Seahawks prediction, odds: 2026 NFL divisional round picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-49ers-prediction-odds-line-spread-time-2026-nfl-divisional-round-saturday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-17T23:08:41.000Z",
    "description": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in the 2026 ",
    "body": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in the 2026 NFL divisional round on Saturday. San Francisco (12-5) advanced with a 23-19 wild-card win at Philadelphia, while Seattle (14-3) is coming off a bye after earning the NFC's top seed. These teams split their two head-to-head matchups in the regular season. Seattle quarterback Sam Darnold (oblique) is listed as questionable after getting hurt in practice this week. Niners receiver Ricky Pearsall (knee) is questionable, while tight end George Kittle is done for the year after injuring his Achilles last week. Kickoff from Lumen Field in Seattle is set for 8 p.m. ET. The Seahawks are 7-point favorites in the latest 49ers vs. Seahawks odds, while the over/under for total points scored is 44.5 via DraftKings Sportsbook. Before making any Seahawks vs. 49ers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.    Now, the model has set its sights on 49ers vs. Seahawks. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Seahawks vs. Niners:\n49ers vs. Seahawks                                                                                     spreadSeattle -7 at DraftKings Sportsbook49ers vs. Seahawks                                 over/under44.5 points49ers vs. Seahawks                                                                                                                                                                                                 money line Seattle -305, San Francisco +24549ers vs. Seahawks                                                                                                                                                                                         picksSee picks at SportsLine49ers vs. Seahawks                                                                                                                                                                                           streaming Fubo (Try for free)  Why the Seahawks can coverEighth-year veteran Sam Darnold helps power the Seattle offense. In 17 games, he has completed 67.7% of his passes for 4,048 yards and 25 touchdowns with 14 interceptions and a 99.1 rating. In a 13-3 win over the 49ers on Jan. 3, he completed 20 of 26 passes for 198 yards. In a 38-37 come-from-behind overtime win over the Los Angeles Rams on Dec. 18, he completed 22 of 34 passes for 270 yards and two touchdowns with two interceptions.His top target is third-year veteran wide receiver Jaxon Smith-Njigba. In 17 games, he caught 119 passes for 1,793 yards (15.1 average) and 10 touchdowns. He had 27 explosive plays of 20 yards or more, including a long of 63, with 528 yards after the catch and 79 first-down conversions. In two games against San   Francisco this season, he caught 15 passes for 208 yards. See which team to back at SportsLine. Why the 49ers can coverFourth-year veteran quarterback Brock Purdy is coming off a solid performance in the Wild Card win over Philadelphia. He completed 18 of 31 passes for 262 yards and two touchdowns with two interceptions. In nine regular-season games this year, he completed 69.4% of his passes for 2,167 yards and 20 touchdowns with 10 interceptions and a 100.5 rating. He also carried 33 times for 147 yards (4.5 average) and three scores.Veteran Christian McCaffrey was San Francisco's leading rusher and receiver during the regular season. In 17 games, he carried 311 times for 1,202 yards and 10 touchdowns. He also had 102 receptions for 924 yards (9.1 average) and seven touchdowns with seven explosive plays, including a long of 39, with 720 yards after the catch and 49 first-down conversions. In the Wild Card win at Philadelphia, he carried 15 times for 48 yards (3.2 average) and had six receptions for 66 yards and two touchdowns. See which team to back at SportsLine.How to make 49ers vs. Seahawks picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits more than 50% of the time. You can only get the pick at SportsLine. So who wins Seahawks vs. 49ers, and which side of the spread hits more than 50% of the time? Visit SportsLine now to see which side of the 49ers vs. Seahawks spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Seahawks prediction, odds: 2026 NFL divisional round picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/7a9d78d9-88e9-4b7e-ad17-e0ca53a3bd33/thumbnail/1200x675/232ada9190d0101d90598365443c7cc4/sam-darnold-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-17T23:08:41.000Z",
      "dateModified": "2026-01-17T23:08:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL divisional round predictions, odds: 49ers vs. Seahawks picks from expert on 19-4 roll - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/49ers-seahawks-prediction-odds-spread-time-2026-nfl-divisional-round-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/d9737c80-521a-420b-bbba-8d0c5db0babf/thumbnail/1200x675/f029c2c8aed0f0b9ace297152cbe60f2/brock-purdy-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-17T21:01:00.000Z",
    "description": "\nA divisional rivalry will, fittingly, resume in the 2026 NFL divisional round as the Seattle Seahawks (14-3) host the San Francisco 49ers (12-5) on S",
    "body": "\nA divisional rivalry will, fittingly, resume in the 2026 NFL divisional round as the Seattle Seahawks (14-3) host the San Francisco 49ers (12-5) on Saturday. These teams both began and ended the regular season versus one another with the Niners winning at Seattle in Week 1, while the Seahawks won at San Fran in Week 18. The latter contest notched the No. 1 seed in the 2026 NFL playoffs for the Seahawks in the NFC as they are coming off a bye. The Niners, meanwhile, are coming off a 23-19 road upset of Philadelphia in a Sunday Wild Card matchup. Sam Darnold (oblique) is listed as questionable for Seattle.Kickoff is at 8 p.m. ET from Lumen Field in Seattle. The Seahawks are 7-point favorites in the latest Seahawks vs. 49ers odds at DraftKings Sportsbook, while the over/under for total points scored is 44.5. Before you make any 49ers vs. Seahawks picks, make sure to check out the NFL playoff predictions from SportsLine NFL expert Micah Roberts.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins to bet on props like Jaxon Smith-Njigba as an anytime TD scorer:\nRoberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. Most importantly, Roberts has a read on the pulse of the 49ers. He is 19-4 (+1460) on his last 23 against-the-spread picks in games involving San Francisco. Anyone following could have seen huge returns. Now, Roberts has set his sights on Seahawks vs. 49ers and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for 49ers vs. Seahawks:\nSeahawks vs. 49ers                                         spreadSeattle -7 at DraftKings SportsbookSeahawks vs. 49ers                                               over/under44.5 pointsSeahawks vs. 49ers                                               money line Seattle -305, San   Francisco +245Seahawks vs. 49ers                                           picksSee picks at SportsLineSeahawks vs. 49ers                                               streaming Fubo (Try for free)  Why the 49ers can coverThe 49ers have gone into Seattle and walked out with victories in each of their last four trips, including Week 1 of this season. The Niners also covered in that contest, and Seattle has lost versus the spread in each of its last two home games as the Seahawks are 8-1 ATS on the road but just 4-4 ATS at home. The 49ers have a top 10 offense in both points scored and total yards, and they rank No. 1 in the all-critical third-down offense. They also have the turnover differential edge over Seattle, as the Seahawks' 28 giveaways were the second-most in the regular season. San Fran can also rely on proven postseason performer like Brock Purdy, who is 5-1 in postseason games he's started and finished, while Darnold had two turnovers and lost in his lone playoff game. See which team to back at SportsLine. Bet Brock Purdy to go Over 231.5 passing yards at DraftKings:\nWhy the Seahawks can coverOf the three previous times that Seattle earned a No. 1 seed, it advanced to the Super Bowl each time. That will bring it confidence, as will defeating San Francisco, 13-3, when it last took the field in Week 18. That tied for the fewest points by the Niners since Kyle Shanahan's debut season in 2017, and now San Fran will have to adjust to life without George Kittle (Achilles) while facing Seattle's No. 1 scoring defense. Additionally, the NFL schedule makers didn't do San Francisco any favors with giving it a short week after a Sunday Wild Card game on the other coast in Philadelphia. Teams are 5-10 in the playoffs since 2002 with a short week versus a team coming off a bye, and the Seahawks franchise is 10-1 over its last 11 home postseason games. See which team to back at SportsLine.Bet Darnold to go Over 1.5 passing touchdowns at DraftKings:\nHow to make 49ers vs. Seahawks picksRoberts has analyzed Seahawks vs. 49ers from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins 49ers vs. Seahawks, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Seahawks vs. 49ers spread you need to jump on, all from the expert that is 19-4 on his last 23 San Francisco 49ers picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL divisional round predictions, odds: 49ers vs. Seahawks picks from expert on 19-4 roll - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/d9737c80-521a-420b-bbba-8d0c5db0babf/thumbnail/1200x675/f029c2c8aed0f0b9ace297152cbe60f2/brock-purdy-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-17T21:01:00.000Z",
      "dateModified": "2026-01-17T21:01:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos vs. Bills: Denver becomes first NFL playoff team in 33 years to pull off this rare scoring feat - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-vs-bills-nfl-playoff-rare-scoring-feat/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/a861fb33-fba1-45a3-9064-f2f7329e9a12/thumbnail/1200x675/98f6a6ec42231dc57f6971c6e0e6d568/getty-frank-crum-broncos.jpg",
    "tag": "Sports",
    "date": "2026-01-17T23:49:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The end of the first half got pretty wild on Satur",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The end of the first half got pretty wild on Saturday with the Denver Broncos closing things out by pulling off a scoring feat that hadn't happened in the NFL playoffs in more than 30 years. The Broncos scored 10 points over the final 30 seconds of the first half, marking the first time since the 1993 season that a team scored that many points to end a first half. The scoring spree for the Broncos started when Bo Nix hit Lil'Jordan Humphrey for a 29-yard touchdown pass with just 22 seconds left to play in the first half. \nThe scoring play gave the Broncos a 17-10 lead. After the ensuing kickoff, the Bills took over on their own 30-yard line with just 16 seconds left in the second quarter, and at that point, it probably would have made sense to just let the half in, but instead, the Bills tried to make something happen. On a first-and-10 play, Josh Allen couldn't find an open receiver, so he decided to scramble and he ended up fumbling after taking a hit from Nik Bonitto. \nThe Broncos recovered the ball with two seconds left in the first half, which was just enough time for Wil Lutz to hit a 50-yard field goal. In a span of just 22 seconds, the divisional playoff game went from a 10-10 tie to the Broncos leading 20-10. There's only been one other instance in the Super Bowl era where a team scored 10 points in the final 30 seconds of the first half and that came in a divisional playoff game between the Cowboys and Packers back in January 1994. In that game, the Cowboys hit a 41-yard field goal with 28 seconds left in the half. The Packers then fumbled away the ensuing kickoff and Troy Aikman made them pay by throwing a 6-yard touchdown pass to Jay Novacek. The 10-point spurt gave the Cowboys a 17-3 lead at halftime in a game they ended up winning 27-17. As for the Bills-Broncos game, Allen has struggled with turnovers. Not only did he fumble at the end of the first half, but he also fumbled on Buffalo's opening drive of the second half. He also threw an interception in the third quarter and if you combine that with a James Cook fumble, the Bills have turned the ball over four times through three quarters. \nFor the latest updates from the game, including the score, be sure to check out our live blog here. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos vs. Bills: Denver becomes first NFL playoff team in 33 years to pull off this rare scoring feat - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/a861fb33-fba1-45a3-9064-f2f7329e9a12/thumbnail/1200x675/98f6a6ec42231dc57f6971c6e0e6d568/getty-frank-crum-broncos.jpg"
      ],
      "datePublished": "2026-01-17T23:49:55.000Z",
      "dateModified": "2026-01-17T23:49:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Sony Open leaderboard: Davis Riley takes lead with Nick Taylor now chasing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/sony-open-leaderboard-2026-round-3-davis-riley-nick-taylor/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/84877062-ef4e-4685-a84c-47c5344fe4f1/thumbnail/1200x675/a1871554102b0438817df04ae2b858a9/riley.jpg",
    "tag": "Sports",
    "date": "2026-01-18T04:05:58.000Z",
    "description": "\n        The third round of the 2026 Sony Open saw players again challenged by windy conditions in Honolulu, Hawai'i, and with 18 holes left to play, ",
    "body": "\n        The third round of the 2026 Sony Open saw players again challenged by windy conditions in Honolulu, Hawai'i, and with 18 holes left to play, Davis Riley has taken the solo lead at Waialae Country Club. Riley was tied for the lead with three others after the second round, but on a difficult afternoon, his 3-under 67 was the best of the lead pack and moved him into first alone, two ahead of the field.Riley spoke after his strong second round about how his putter was carrying him, and that continued Saturday with another terrific effort with the flat stick, picking up 2.614 strokes on the field in the third round on the greens. He leads the field in strokes gained putting for the week, and if he can keep the putter warm on Sunday, he'll put himself in position to pick up his third career win. Leading the charge behind Riley on the leaderboard are Harry Hall and Chris Gotterup. Hall shot one of the best rounds of the day with a 4-under 66 to move to 10 under and get one back of the lead going into Sunday. Gotterup matched Riley's 68 to stay attached as he carries momentum from a strong close to 2025 into the start of his 2026 season, making clear his surge wasn't a fluke. The round of the day belonged to Corey Conners and Hideki Matsuyama, as two of the top-ranked players and best ball-strikers in the field handled the challenging conditions better than anyone else to post 5-under 65s and climb the leaderboard. \nHeading into the weekend, there are nine players within three shots of the lead and 19 players within five shots, setting up an intriguing final round where plenty of players will feel like they have a legitimate shot at the first PGA Tour title of the 2026 season. Leader1. Davis Riley (-12): Riley's hot putter has been the story of the week so far, but his ball-striking seems to be improving as the week goes on, which will be critical if he's going to convert a 54-hole lead into a victory. Saturday was the first round of the week Riley gained strokes both off the tee and approaching the green, and that part of his game will have to hold up under the final round nerves right alongside his putter. ContendersT2. Harry Hall, Chris Gotterup, Kevin Roy (-10)T5. Ryan Gerard, John Parry, Nick Taylor (-9)T8. Corey Conners, Adam Svensson, Patrick Rodgers (-8)T11. Si Woo Kim, S.H. Kim (-7)T13. Hideki Matsuyama, Jordan Spieth, Robert MacIntyre and three others (-6)\nThere is a sizable chase group, headlined by Hall and Gotterup, but Roy has been near the top of the leaderboard since Thursday and hasn't shown any indication he'll simply fade away on Sunday. Taylor is the defending champion, and while a stumble early on his back nine caused him to slip out of the lead for the first time all week, a closing birdie kept him in touch. He's still got to be considered a significant threat to go back-to-back at Waialae. The rest of the big names in the top 20 will need something rather spectacular to win, but the likes of Conners and Matsuyama showed on Saturday that they're capable of it. Spieth has been the most consistent player of the week, which is not normally an attribute we think of first with Spieth, but three consecutive rounds of 68 have him in the hunt for at least a top 10 in his first start to an extremely important season for him. 2026 Sony Open updated picks, oddsOdds via FanDuel SportsbookDavis Riley (23/10)Harry Hall (47/10)Chris Gotterup (5-1)Nick Taylor (10-1)Kevin Roy (11-1)Ryan Gerard (11-1)John Parry (14-1)Corey Conners (16-1)Riley's birdie at the last made him the clear favorite going into Sunday's final round. Of the chase group, Gotterup and Roy are intriguing. Gotterup proved his ability to close out a win last year and is a strong wind player. Roy has been impressive all week, and just two back at 11-1, he offers some value as long as he continues his level of play from the first 54 holes.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Sony Open leaderboard: Davis Riley takes lead with Nick Taylor now chasing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/84877062-ef4e-4685-a84c-47c5344fe4f1/thumbnail/1200x675/a1871554102b0438817df04ae2b858a9/riley.jpg"
      ],
      "datePublished": "2026-01-18T04:05:58.000Z",
      "dateModified": "2026-01-18T04:05:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants finalize contract to make John Harbaugh their next coach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-to-finalize-deal-and-hire-john-harbaugh-next-coach-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/ebeac7f7-72df-4fdc-81eb-0cd11c2c67cf/thumbnail/1200x675/f2e0b9cf6e4142f3051c398f320d989d/johnn.jpg",
    "tag": "Sports",
    "date": "2026-01-18T02:14:44.000Z",
    "description": "\n        After a couple days of uncertainty, it is now a done deal. The New York Giants have finalized their contract with former Baltimore Ravens coa",
    "body": "\n        After a couple days of uncertainty, it is now a done deal. The New York Giants have finalized their contract with former Baltimore Ravens coach John Harbaugh to be their new lead man, the team announced on Saturday night.It was reported on Thursday evening that the Giants had reached an agreement with Harbaugh, but it took almost two full days for the deal to be finalized. According to Ian Rapoport of NFL Media, the two sides were debating a \"reporting structure,\" not money. Harbaugh told The Athletic that he will report directly to ownership, but is looking forward to forming a great partnership with general manager Joe Schoen. \"This is the New York Giants,\" Harbaugh told ESPN on Saturday afternoon. \"I'm proud and honored to the head coach of this historic franchise, and especially excited to work with the Mara and Tisch families. But most of all, I can't wait to get started with the great players on this football team to see what we can accomplish together.\"Harbaugh was fired by the Ravens on Jan. 6 following Baltimore's season-ending loss to the Pittsburgh Steelers. He was the winningest coach in franchise history, going 180-113 during his 18 seasons, won Super Bowl XLVII in 2013 and was named Coach of the Year in 2019.\nWhile Harbaugh won 10 playoff games in his first seven seasons with the Ravens, he won just three postseason matchups over the last 11 years. Harbaugh was reportedly confident he would return to Baltimore to chase a Lombardi Trophy in 2026, but the Ravens made the decision to search for another coach that can get the most out of two-time NFL MVP Lamar Jackson. \"We are proud to name John Harbaugh as the next head coach of the New York Giants,\" Giants president John Mara said in a statement. \"Joe Schoen presented us an outstanding group of candidates, which allowed us to be deliberate and confident in this decision. Through numerous conversations, John consistently stood out for his conviction and vision for leading a winning organization, and we welcome him and his family to the Giants.\"When the Ravens made the surprising decision to fire Harbaugh, his agent said he received calls from seven different teams expressing interest in his client 45 minutes after the news broke, per ESPN. There were only six other head coach openings at the time. Harbaugh formally interviewed with the Giants on Wednesday with team owners Mara and Steve Tisch reportedly in attendance, along with quarterback Jaxson Dart, per NFL Media.\nHarbaugh is set to replace Brian Daboll, who went 20-40-1 in his four seasons as lead man. The former Buffalo Bills offensive coordinator went 9-7-1 in his first season back in 2022, won NFL Coach of the Year and upset the Minnesota Vikings in the playoffs. However, the Giants took a step back the next season with a 6-11 record, and went 3-14 in 2024 before Daboll was finally fired 10 games into the 2025 season.Overall, the Giants have struggled ever since Tom Coughlin resigned following the 2015 season. All four full-time head coaches finished with losing records. The Giants have the second-worst record in the NFL (55-109-1) in the 10 seasons since the Coughlin era ended. Only the New York Jets have been worse.Giants' coaches since Tom Coughlin (2016)*denotes interimCoachYearsRecordMike Kafka*20252-5Brian Daboll2022-2520-40-1Joe Judge2020-2110-23Pat Shurmur2018-199-23Steve Spagnuolo*2017*1-3Ben McAdoo2016-1713-15For all of the struggles, the Giants were still considered to be one of the most attractive open jobs this offseason. New York owns the No. 5 pick in the 2026 NFL Draft, has a prospective franchise quarterback in Dart, a talented running back with Cam Skattebo, a star wideout in Malik Nabers and then plenty of talent on the defensive line with Brian Burns, Dexter Lawrence II and Abdul Carter. Now, they have new hope that comes in the form of an experienced coach that knows how to not only find success, but sustain it.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants finalize contract to make John Harbaugh their next coach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/ebeac7f7-72df-4fdc-81eb-0cd11c2c67cf/thumbnail/1200x675/f2e0b9cf6e4142f3051c398f320d989d/johnn.jpg"
      ],
      "datePublished": "2026-01-18T02:14:44.000Z",
      "dateModified": "2026-01-18T02:14:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kentucky stuns Tennessee as Comeback Cats pull off third straight double-digit rally - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kentucky-tennessee-score-analysis-game-recap/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/11486d0b-842d-4174-a57c-8fb5ffff0398/thumbnail/1200x675/ef2daa788f09726d7a0b6180eee985fb/usatsi-28027474-1.jpg",
    "tag": "Sports",
    "date": "2026-01-17T20:41:34.000Z",
    "description": "\n        Kentucky rallied from a 17-point deficit to stun No. 24 Tennessee 80-78 on the road Saturday, as the Wildcats completed their third straight ",
    "body": "\n        Kentucky rallied from a 17-point deficit to stun No. 24 Tennessee 80-78 on the road Saturday, as the Wildcats completed their third straight double-digit comeback in SEC play.Just as they did at LSU on Wednesday — when Kentucky rolled from 18 down to win at the buzzer — veteran guards Denzel Aberdeen and Otega Oweh led the charge against the Volunteers.Oweh's transition dunk with 34 seconds remaining gave UK (12-6, 3-2 SEC) its first lead of the game at 78-77 and prolonged a dreadful finishing stretch for the Volunteers (12-6, 2-3), who did not make a basket from the field over the final 5:38.The senior guard finished with 10 points and two steals in the second half. Aberdeen scored 18 of his 22 points in the second half including seven straight to open the second half as Kentucky narrowed a 13-point deficit to eight. While Kentucky's comeback win over Tennessee bore some uncanny resemblance to its wins over LSU and Mississippi State, which also required big rallies, it illuminated the play of some different characters.\nMo Dioubate came off the bench to play 27 minutes, which is more than he logged in the last two games combined. The physical Alabama transfer provided some desperately needed toughness on the glass for UK after the Wildcats grabbed just one offensive rebound in the first half.\nWith Dioubate playing all but three minutes in the second half, UK grabbed 10 offensive rebounds, which it converted into 17 points. Consequently, Kentucky attempted 36 shots in the second half compared to just 22 for Tennessee. Freshman guard Jasper Johnson also added 12 points for Kentucky.Johnson's contributionsThere is mounting evidence to suggest Kentucky is a better team with Johnson on the floor. With UK's offense reeling early, the slender lefty kept the Wildcats in it with eight points off the bench in a span of fewer than six minutes. He also chipped in a couple of jumpers over the last three minutes of the first half just as Tennessee's lead ballooned to 17 points. Johnson's late surge helped the Wildcats close the half on a 7-1 run and remain within striking distance.\nIn addition to his 5-of-6 shooting performance, Johnson finished with a team-high four assists. He leads the team in assists per 40 minutes and is the most natural passer on the team now that Jaland Lowe has been ruled out for the season. Even before the strong offensive performance from Johnson, data showed UK has tended to be better with him on the floor. \nIn games against high-major opposition, five of the Wildcats' 10 most-efficient 3-man combinations involved Johnson, per CBB Analytics. Yet, he's still been struggling to get steady minutes. That ought to change moving forward. If anyone can replace the passing and on-ball playmaking that Lowe provided before UK shut him down for the season, it's Johnson, and he proved it again on Saturday at Tennessee.Bracketology implicationsThe win marks a gold-plated Quad 1 victory for Kentucky and improves the Wildcats to 3-5 in Quad 1 opportunities, providing significant insulation for the Wildcats' at-large resume. The win will have little risk of slipping outside of Quad 1, as there is virtually no scenario in which Tennessee will fall outside the top 75 of the NET. As a result, the Wildcats are expected to solidify themselves as a No. 9 seed in CBS Sports Bracketology, which calculates seedings as if Selection Sunday were tomorrow.\nThe initial CBS Sports Bracketology projection calls for Tennessee to slip from a No. 6 seed to a No. 7 seed. For the moment, the loss is a Quad 2 defeat for the Volunteers, marking their first loss outside of Quad 1. However, if UK moves into the top 30 of the NET (the Wildcats were No. 34 before the win), then it will be a Quad 1 loss.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kentucky stuns Tennessee as Comeback Cats pull off third straight double-digit rally - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/11486d0b-842d-4174-a57c-8fb5ffff0398/thumbnail/1200x675/ef2daa788f09726d7a0b6180eee985fb/usatsi-28027474-1.jpg"
      ],
      "datePublished": "2026-01-17T20:41:34.000Z",
      "dateModified": "2026-01-17T20:41:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh Allen was his own worst enemy vs. Broncos, committing four turnovers in crushing loss - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-josh-allen-no-super-bowl-four-turnovers-playoff-loss-to-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/bc83927f-1e9b-4e5f-9599-c1ba8ac790a4/thumbnail/1200x675/e4ab77d1966c47f01cf79c5e08e794d5/template-pic.jpg",
    "tag": "Sports",
    "date": "2026-01-18T03:09:38.000Z",
    "description": "\n        For the seventh straight year, the Buffalo Bills reached the playoffs with Josh Allen, and for the seventh straight year, they didn't make it",
    "body": "\n        For the seventh straight year, the Buffalo Bills reached the playoffs with Josh Allen, and for the seventh straight year, they didn't make it to the Super Bowl. The Bills are the Sisyphus of the NFL: They roll the boulder up the mountain every year and just as they're about to get to the top, it rolls right back down on them. But this year was supposed to be different. There was no Patrick Mahomes in the playoffs. Allen was the best quarterback in the 14-team postseason field, and if there was any season where he was going to be able to carry his team to the Super Bowl, this felt like the year it was going to happen. Allen put on his Superman cape, only to be stopped by a very unexpected form of Kryptonite: Himself. That's right: Josh Allen was his own worst enemy on Saturday. The Bills star quarterback played like he knew he had the weight of the world on him. Allen was trying to carry a Bills team that didn't have quite as much talent as its had over the past few years, and that weight proved to be too much. Allen turned the ball over four times in a 33-30 overtime loss to Denver and three of those turnovers came because he was trying to make something happen in a situation where he didn't need to do that.\n        \n            \n                Bo Nix injury: Broncos QB suffers season-ending ankle fracture in win over Bills; Jarrett Stidham to start\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nLet's rewind to the end of the first half where Allen made what was easily the most inexcusable mistake of the game and possibly the most inexcusable mistake of his career. With just 16 seconds to go before halftime in a game Buffalo was trailing 17-10, the Bills decided they wanted to try and get some points. That decision turned into a disaster when Allen did this: \nThis was a mistake that was 100% on Allen. He was asking to be stripped on a play that just didn't need to happen. The Bills had no timeouts, so the half was going to end as soon as Allen was tackled. Instead, he fumbled the ball and it was recovered by the Broncos with two seconds left in the half. Denver ended up getting a field goal out of Allen's gaffe. Allen then opened the third quarter with another turnover on Buffalo's opening drive, but it's hard to blame this one on him. Broncos' star pass-rusher Nik Bonitto came in untouched from Allen's blindside and rocked him with a hit that caused a fumble. \nAfter turning the ball over twice, you'd think Allen would have been a little more protective with the football, but that wasn't the case. After the Bills defense picked off Bo Nix in the third quarter, the Buffalo offense was set up with good field position, but Allen threw that away with an interception that came on the second play after Buffalo got the ball back. \nThe Bills had the ball at Denver's 40 and were essentially already in field goal range when Allen's interception happened. After six years of playoff failures, you know that Allen was desperate to get to the AFC title game and it showed in overtime. On a third-and-11 play from his own 36-yard line, Allen went for the jugular and came up empty: He threw another interception. \nIf you watch the play, Cooks had several steps on his defender, but he had to slow up to try and make the catch. If he had come down with the ball, it would have been a spectacular catch, but instead, Ja'Quan McMillian made an even more spectacular interception. \nThere was some controversy involved on this play, because it looked like Brandin Cooks might have caught the ball and been down before Ja'Quan McMillian made the pick, but according to CBS Sports rules expert, Gene Steratore, the officials made the correct call on the field. \"I'm not sure that Cooks has possession coming to the ground,\" Steratore said.  \nAfter getting the interception, the Broncos drove 75 yards down the field for the game-winning field goal. \nWith his four turnovers, Allen became the first quarterback in 10 years to throw at least two interceptions while also losing at least two fumbles in a playoff game. The Broncos ended up getting nine points off of Allen's four turnovers, including the game-winning field goal from Wil Lutz. \"I feel like I let my teammates down tonight,\" an emotional Allen said after the game. \"Just missed opportunities throughout the game. It's been a long season. Hate how it ended. It's gonna stick with me for a long time.\"\nIt wasn't just the turnovers, though. Allen also missed several key throws, including one where he overthrew Dawson Knox on third down with under 20 seconds left to play that likely would have led to a game-winning touchdown. \nLet's be clear, Josh Allen is one of the best quarterbacks in the NFL. No one is disputing that. He had to deal with several big drops and the Bills wouldn't even have been in this game if not for Allen, who threw for 283 yards and three touchdowns to go along with his four turnovers. But on Saturday, Allen seemed to be playing with the weight of the world on his shoulders and that weight just got too heavy. The divisional round of the playoffs ended with a painful loss for a franchise that knows more about painful playoff losses than any other team in the NFL. For now, the Bills will continue to roll the boulder up the hill, but if it doesn't happen soon for Josh Allen, you certainly start to wonder if it ever will. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh Allen was his own worst enemy vs. Broncos, committing four turnovers in crushing loss - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/bc83927f-1e9b-4e5f-9599-c1ba8ac790a4/thumbnail/1200x675/e4ab77d1966c47f01cf79c5e08e794d5/template-pic.jpg"
      ],
      "datePublished": "2026-01-18T03:09:38.000Z",
      "dateModified": "2026-01-18T03:09:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Brewers still listening on Peralta, O's interested in Verlander - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-orioles-reds-elly-de-la-cruz/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/8c334bc2-78d9-42e0-b6f1-98cdce7e679b/thumbnail/1200x675/6340c05ffa0f110e576a176fbb0b0e17/freddy-peralta-brewers-g2.jpg",
    "tag": "Sports",
    "date": "2026-01-17T20:55:25.000Z",
    "description": "\n        The hot stove has finally begun to heat up. Within the last week Bo Bichette (Mets), Alex Bregman (Cubs), Ranger Suárez (Red Sox), Kyle Tucke",
    "body": "\n        The hot stove has finally begun to heat up. Within the last week Bo Bichette (Mets), Alex Bregman (Cubs), Ranger Suárez (Red Sox), Kyle Tucker (Dodgers), and others signed. Nolan Arenado (Diamondbacks) was finally traded as well. There are still more than a few top free agents available, however. Here now are Saturday's hot stove rumors.  Pressly announces retirement\nLongtime closer Ryan Pressly announced his retirement Saturday. \"The friendships -- from bullpen brothers to vets who mentored me along the way -- those bonds last a lifetime. I'll miss the banter in the 'pen, the inside jokes that kept us loose on those high-leverage nights. But I'm fired up for this next chapter with my family, and chasing whatever adventure comes next,\" he wrote.Pressly, 37, retires with 117 saves and a 3.33 ERA in parts of 13 big league seasons. He spent seven of those seasons with the Astros, where he was a two-time All-Star and the closer on their 2022 World Series team. Pressly is one of the greatest postseason relievers in history, owning 14 saves and a 2.78 ERA in 45 ⅓ career innings in October.\n                            \n    \n                                                \n                    \n    Brewers still listening on Peralta\nThe Brewers continue to field offers for ace right-hander Freddy Peralta, according to the New York Post. The Braves, Dodgers, Giants, Mets, and Yankees are among the interested teams. Peralta will make only $8 million in 2026, so he is affordable to every team, though he will be a free agent next offseason. Contenders are the most serious suitors in free agency on the horizon.\nNow 29, Peralta is one of only 11 pitchers to make at least 30 starts in each of the last three seasons. The Brewers have a history of trading their top pitchers one year before free agency (Corbin Burnes, Devin Williams, etc.), though Peralta's bargain salary makes him a viable option for the three-time defending NL Central champion Brewers.\n                            \n    \n                                                \n                    \n    Orioles interested in Verlander  \nThe Orioles are among the teams with interest in future Hall of Famer Justin Verlander, reports The Athletic. Verlander and O's president of baseball operations Mike Elias overlapped for several years with the Astros. It's possible Baltimore considers Verlander a fallback plan in case it doesn't land a higher upside arm. We ranked Verlander the 26th best free agent available this offseason.  Verlander, 43 next month, finished last season strong with the Giants, pitching to a 2.60 ERA with strong underlying numbers (3.36 FIP) in his final 13 starts. The O's added Shane Baz and re-signed Zach Eflin earlier this offseason, though there's still room in the rotation for one more quality arm. While no longer the ace he was in his prime, Verlander remains effective.  \n\n                            \n    \n                                                \n                    \n    Reds made De La Cruz record offer\nLast spring, the Reds offered star shortstop Elly De La Cruz the largest contract in franchise history, GM Nick Krall told MLB.com. \"We engaged in spring training of 2025 and presented an offer. The  offer would have been the largest contract in Reds history. We didn't  have any further conversations regarding the offer,\" Krall said. De La Cruz is a Scott Boras client.The largest contract in Reds history is the 10-year, $225 million extension Joey Votto signed in April 2012. The offer to De La Cruz would have easily been the largest contract for a player with between one and two years of service time, eclipsing Jackson Merrill's nine-year, $135 million deal with the Padres. De La Cruz, 24, can not become a free agent until after the 2029 season.\n                            \n    \n                                                \n                    \n     D-backs want to add bullpen arm  The Diamondbacks would like to add a proven late-inning arm, GM Mike Hazen told the Arizona Republic. He acknowledged it will not be easy this late in the offseason though. \"Would I like to have somebody that has a clear pedigree of pitching in  the eighth and ninth inning? That's an easier answer. I'm not sure what  we'll have access to in that way,\" Hazen said.  \nArizona's bullpen ranked 27th in ERA and 28th in WAR in 2025, and its only notable relief adds this offseason are righties Taylor Clarke and Jonathan Loáisiga. Loáisiga is coming off a flexor strain and may not be ready for Opening Day. As it stands, manager Torey Lovullo's late-inning group includes lefty Andrew Saalfrank and righties Kevin Ginkel and Ryan Thompson.  \n                            \n    \n                                                \n                    \n    Cardinals, Mets interested in Canning  \nCount the Cardinals and Mets among the teams with interest in free agent righty Griffin Canning, according to the New York Post. Canning made 16 mostly effective starts with the Mets last year before blowing out his Achilles taking an awkward step off the mound. He is expected to be ready around Opening Day, or shortly thereafter. Canning was not among our top 50 free agents.  St. Louis is in the early stages of a rebuild and is simply looking to add innings, preferably with upside that could potentially be flipped for prospects at the deadline. Canning qualifies. The Mets need a top flight starter more than another back-end innings guy, though options are limited at this point. Besides, they know Canning well and there's no such thing as too much pitching.  \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Brewers still listening on Peralta, O's interested in Verlander - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/8c334bc2-78d9-42e0-b6f1-98cdce7e679b/thumbnail/1200x675/6340c05ffa0f110e576a176fbb0b0e17/freddy-peralta-brewers-g2.jpg"
      ],
      "datePublished": "2026-01-17T20:55:25.000Z",
      "dateModified": "2026-01-17T20:55:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Virginia emerges as Duke's biggest ACC threat after road win over SMU - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/virginia-win-smu-dukes-biggest-threat-acc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/7c2779c4-68b9-4be9-9bbe-c8e68f8842b7/thumbnail/1200x675/da658ccc558285b4a04b33d67ceffe70/malik-thomas-uva.png",
    "tag": "Sports",
    "date": "2026-01-17T20:54:14.000Z",
    "description": "\n        There's joy in Hoo-ville again after No. 16 Virginia showcased this week that a good November and a mostly fun December was not a mirage. Tue",
    "body": "\n        There's joy in Hoo-ville again after No. 16 Virginia showcased this week that a good November and a mostly fun December was not a mirage. Tuesday's road win over Louisville was impressive, but it came with a caveat: Cardinals star freshman point guard Mikel Brown Jr. was still sidelined. There are no stipulations Saturday. Virginia walked into Dallas and knocked off a talented SMU club, 72-68, to notch its fourth true road victory of the season.Virginia (16-2 overall, 5-1 ACC) is all the way legitimate and looks every bit the part of a second-weekend team that can dream of a Final Four appearance. The same Virginia program that watched Tony Bennett abruptly retire and proceeded to finish outside the top-100 in KenPom last season for the first time since 2009 is once again an ACC powerhouse.Steady, first-year coach Ryan Odom won't celebrate yet, but he's got this Cavaliers squad absolutely rolling. Saturday's upset victory will be a jewel on Selection Sunday and also offer proof-of-concept that this Virginia team can hold serve against real-deal athletes. Virginia has used beautiful ball movement and a barrage of size and shooting to build an offense that rates inside the top-15 nationally, but few teams on Virginia's slate could match the speed, height and power that SMU presents.UVa was more than up to the fight. It was Virginia who rocked SMU on the glass for 16 offensive rebounds. It was Virginia who never panicked in late-clock scenarios and went 4-for-4 down the stretch at the charity stripe to salt out a road win. It was Virginia's big men, who won their individual matchups against a SMU front-line that went toe-to-toe with Duke's Cameron Boozer last week. \nTough teams earn roadkills, and Virginia has mixed street-fighter grit with a gorgeous, layered, unselfish offense that can beat you inside, outside and everywhere in between. How did this happenDeep-in-the-weeds hoop heads started to obsess about the potential of this Virginia club after two fortunate dominoes went its way. Virginia had to be patient and work hard to get San Francisco transfer Malik Thomas an extra year of eligibility. That came through. Virginia had to be patient and work hard to get Belgium's 22-year-old Thijs De Ridder cleared to play college basketball. That also came through after the Fourth of July.That potential has turned into production. Thomas (23 points, six treys and 11 rebounds) and De Ridder (17 points, six boards) were instrumental in Saturday's upset, road victory that will be a jewel on Selection Sunday.\nThomas and De Ridder operate as No. 1 and No. 1A of this Virginia club, but the beauty of Virginia is its depth. Toledo transfer Sam Lewis has added size and shot-making. BYU veteran transfer Dallin Hall didn't make a single shot on Saturday, but he dished out nine assists. UC Irvine transfer Devin Tillis stepped up off the bench to splash three treys and finish with 11 points. Much-maligned former Kentucky and Kansas State big man Ugonna Onyenso shined with nine points and a block in his 17 minutes off the bench. Onyenso and freshman Johann Grunloh combined to help shut down SMU at the rim, holding the Mustangs to a miserable 6-of-14 shooting at the rim. When Virginia needs speed, Chance Mallory comes blitzing into the runway, just itching to go.It's coalesced into a beautiful mix. Virginia has four big men who can stretch the floor and defend. It has five guards who can pass, dribble and shoot. Virginia isn't one-sided, either. Virginia's defense now rates No. 17 nationally to go along with its No. 14-rated offense. \nInside the numbersPredictive metrics are in love with this squad. Virginia is up to No. 14 on KenPom after opening the season No. 59 in college basketball's Bible. This resume is certainly impressive, too. Road wins over Texas, NC State, Louisville and now SMU have helped Virginia soar in Wins Above Bubble, the new resume-grading metric that has been added to the seeding committee's team sheet.Virginia has added approximately +1.5 to its WAB this week alone. +0.8 for the Louisville win and +0.7 for the SMU victory. Virginia will likely rank inside the top 15 nationally in WAB after Saturday's action concludes.The resume is good.The predictive metrics are good.The eye test is good.It's Virginia, not North Carolina, that looks like the unquestioned second-best team in the ACC, and it's in the range of potential outcomes that Virginia, not big, bad Duke, has the best chance to make a run in the NCAA Tournament. \nThat Duke-or-Virginia conversation alone solidifies maybe the most important thing: Virginia basketball is back.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Virginia emerges as Duke's biggest ACC threat after road win over SMU - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/7c2779c4-68b9-4be9-9bbe-c8e68f8842b7/thumbnail/1200x675/da658ccc558285b4a04b33d67ceffe70/malik-thomas-uva.png"
      ],
      "datePublished": "2026-01-17T20:54:14.000Z",
      "dateModified": "2026-01-17T20:54:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Irate Bills coach Sean McDermott reacts to Broncos' controversial OT interception - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sean-mcdermott-reacts-broncos-bills-controversial-overtime-interception/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/04097896-63c7-4108-abfc-e8df7ba1fbce/thumbnail/1200x675/a55a58c64bca00d4ae6c869eb7c0e9ac/broncos-int-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-18T03:51:35.000Z",
    "description": "\n        The Buffalo Bills suffered another painful playoff loss on Saturday, and to add to the pain, this loss came with some controversy. During Den",
    "body": "\n        The Buffalo Bills suffered another painful playoff loss on Saturday, and to add to the pain, this loss came with some controversy. During Denver's 33-30 overtime win, the Broncos' game-winning drive was set up by an interception that shouldn't have counted, according to Bills coach Sean McDermott. With just under eight minutes left to play in overtime, the Bills were facing a third-and-11 from their own 36-yard line, so Josh Allen decided to throw a deep pass to Brandin Cooks. On the play, Cooks appeared to catch the ball, but after rolling on the ground, it was Ja'Quan McMillian who came up with it. \nIf Cooks was ruled to have control of the ball when his knee hit the ground, then the play would be over, but the officials ruled that Cooks didn't maintain control of the pass as he hit the ground so the ball was still live when McMillian snatched it. After the game, McDermott was asked about the play and he was upset for two reasons. For one, he didn't feel like the officiating crew took enough time to review the play. \n\"It's hard for me to -- and I've had a chance to look at it -- it's hard for me to understand why it was ruled the way it was ruled,\" McDermott said. \"If it is ruled that way, then why wasn't it slowed down just to make sure that we have this right. That would have made a lot of sense to me, to make sure that we have this thing right, because that's a pivotal play in the game. We have the ball at the 20 and we may be kicking a game-winning field goal right there, so I'll just leave it at that.\"An irate McDermott had even more to say after giving his initial answer. \"I'm saying it because I'm standing up for Buffalo, damn it,\" the Bills coach said. \"I'm standing up for us. What went on, that is not how it should go down, in my estimation. These guys spent three hours out there playing football, pouring their guts out. To not even say, 'Hey, let's slow this thing down.' That's where I'm bothered.\"McDermott was then asked if he thought the play should have been ruled a catch and he didn't hide his opinion. \n\"In my eyes, it was, but even if it wasn't, the players are owed, to me, 'Hey let's stop it, let's slow it down, let's put the head referee and give him a chance to look at the monitor,'\" McDermott said. Following the game, referee Carl Cheffers was asked about the play and he explained why the call on the field was an interception. \"The receiver has to complete the process of the catch,\" Cheffers said in the pool report. \"He was going to the ground as part of the process of the catch and he lost possession of the ball when he hit the ground. The defender gained possession of it at that point. The defender is the one that completed the process of the catch, so the defender is awarded the ball.\"\nThe controversial interception was one of five turnovers by the Bills in the game. Allen was responsible for four of them with two interceptions and two lost fumbles. The pick by McMillian set up even more controversy: The Broncos ended up driving 75 yards for their game-winning field goal, but 47 yards of that total came on pass interference penalties. The Bills have had to do deal with some painful losses in franchise history and this is another one that will certainly be sticking with them for awhile. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Irate Bills coach Sean McDermott reacts to Broncos' controversial OT interception - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/04097896-63c7-4108-abfc-e8df7ba1fbce/thumbnail/1200x675/a55a58c64bca00d4ae6c869eb7c0e9ac/broncos-int-imagn.jpg"
      ],
      "datePublished": "2026-01-18T03:51:35.000Z",
      "dateModified": "2026-01-18T03:51:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL divisional round picks: Our experts face off on Bills-Broncos and more playoff games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-divisional-round-expert-picks-bills-broncos-49ers-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/43ad38bb-a68e-4feb-90bc-b24213c80bd4/thumbnail/1200x675/079e63317f272694ac6c44fad675582f/caleb-williams-chicago-bears-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-18T03:08:52.000Z",
    "description": "\n        The 2025 NFL postseason is off and running, and we were treated to one of the best wild-card weekends ever. We saw 12 fourth-quarter lead cha",
    "body": "\n        The 2025 NFL postseason is off and running, and we were treated to one of the best wild-card weekends ever. We saw 12 fourth-quarter lead changes, which are the most in a single postseason all time, plus four game-winning drives in the final three minutes of regulation. Caleb Williams and the Chicago Bears somehow pulled off another incredible comeback victory, while the Buffalo Bills upset what was one of the league's hottest teams in the Jacksonville Jaguars. Maybe this is the year for Josh Allen.This week in the divisional round, the San Francisco 49ers look to avenge their Week 18 loss to the Seattle Seahawks, Bo Nix faces off against Allen in the playoffs for the second time in as many years, Matthew Stafford will battle an old rival in Chicago, and the New England Patriots have their sights set on their first AFC Championship appearance since the 2018 season. Which teams should you pick in the divisional round, and which should you fade? CBS Sports writers Jordan Dajani and Jared Dubin are here to break down the biggest games of the weekend. For clarity, lines for these selections were taken on Jan. 14 over at DraftKings Sportsbook. Buffalo Bills at Denver Broncos (-1.5)Saturday, 4:30 p.m. ET on CBS (Stream on Paramount+)\nDajani (Broncos -1.5): Josh Allen and the Bills survived the Jaguars in Jacksonville, and their reward for doing so is a well-rested, voracious defense in Denver. Injuries have been a storyline for the Bills this week. Wide receiver Tyrell Shavers and Gabe Davis tore their ACLs last weekend, while Allen is dealing with foot, knee and finger issues. The Broncos set a franchise record with 68 sacks this season, and ranked in the top three in points per game (18.3), yards per game (278.2) and third down percentage (33.8%). The 'X factor' in this matchup is Bo Nix and the Broncos offense. They have been inconsistent for much of the season, but Nix's seven game-winning drives set a franchise record while the Broncos recorded 12 comeback wins in all. Josh Allen is a unicorn, yes, but I believe this line has already moved three full points for good reason. Give me the home team …  Prediction: Broncos 24, Bills 21\nDubin (Bills +1.5): Have I been picking against the Broncos pretty much all year? Yes. Has that been a wildly unsuccessful strategy? Also yes. Was one of the exceptions to that rule when I actually picked them against the Jaguars late in the season? Again, yes. Did I actually predict that it would be unsuccessful in that picks column itself? Well, yes. In other words, I have been getting the Broncos wrong all season, including when I picked them to win a big game. I'm going against them here because of my No. 1 playoff rule: Generally speaking, I want to take the team with the better quarterback to win the game. Here, that's very clearly the Bills. I'm just not going to bet against Josh Allen when he's playing Bo Nix -- even if the Broncos do have some matchup advantages here. … Prediction: Bills 23, Broncos 17San Francisco 49ers at Seattle Seahawks (-7)Saturday, 8 p.m. ET on Fox (Stream: Fubo -- try for free)\nDajani (49ers +7): The 49ers now have the longest Super Bowl odds among our 'Elite Eight,' which is a bit surprising considering they have defied the odds all season, and are continuing to do so in the postseason. San Francisco defeated the reigning Super Bowl champions last week, even after George Kittle went down with his Achilles injury. Kittle, of course, wasn't the only player San Francisco was missing. That laundry list includes Nick Bosa, Fred Warner, Mykel Williams, Tatum Bethune, Ricky Pearsall and Dee Winters. Still, Brock Purdy, Christian McCaffrey and Jauan Jennings found a way to come up clutch. This number seems large, especially when you consider the fact that the 49ers have won four straight meetings in Seattle. I'll take the Seahawks to win this game, but I'm not so sure it's a blowout … Prediction: Seahawks 26, 49ers 23Dubin (49ers +7): I know I just said that I generally want to take the team with the better quarterback to win the game, but there are some exceptions to that rule and I am taking the Seahawks to win here despite the fact that I think Brock Purdy is a better quarterback and playing at a higher level right now than is Sam Darnold. The 49ers are just too injured on both sides of the ball for me to predict that they'll win this game. Can they keep it relatively close, though? I think they can do that. It's tough to blow out an opponent in a divisional rematch in the playoffs. Kyle Shanahan's offense got shut down in the regular season finale against the Seahawks, but I expect him to have some more answers here than he did there. Just not quite enough of them to actually take out the favorites in their own building. … Prediction: Seahawks 24, 49ers 20\nHouston Texans at New England Patriots (-3)Sunday, 3 p.m. ET on ESPN (Stream: Fubo -- try for free)\nDajani (Patriots -3): Another game in which you should take the Under. I would like this number a lot more at NE -2, but I'll take NE -3. The Texans' defense has been a major storyline all year, but this Patriots defense had Justin Herbert seeing ghosts on every drop back. The Chargers converted just one third down last week, to go along with 207 total yards and three points. I have faith that Mike Vrabel can put enough pressure on C.J. Stroud, who was terrible on Monday night. His five fumbles tied an NFL postseason record, and he threw an interception as well. Additionally, star wideout Nico Collins suffered what appeared to be a nasty concussion. Will he be back in the lineup? We all knew at some point this Texans offense was going to let down this Super Bowl-caliber defense. That should be this week …  Prediction: Patriots 20, Texans 16Dubin (Patriots -3): I just flat out do not believe in the Texans' offense. Just not enough to pick them in an upset on the road. Like, not at all. And they may not even have their best offensive player for this game, if Nico Collins doesn't clear the concussion protocol in time. We already saw the Patriots' defense look quite good against a team with a limited offensive line in the opening round of the playoffs, and the Texans are similarly-constructed to the Chargers but without as many weapons. Drake Maye is likely going to have tough sledding against the Houston defense, but I don't believe the Texans have it in them to outscore New England.  … Prediction: Patriots 17, Texans 13Los Angeles Rams (-3.5) at Chicago BearsSunday, 6:30 p.m. ET on NBC\nDajani (Bears +3.5): The Rams were my preseason NFC champions pick, but I'm always going to be intrigued by the hook with the home underdog. Especially when you consider that this may be the coldest start of Matthew Stafford's incredible career. The Rams are 3-2 vs. the Bears in the Sean McVay era, but the home team has won all five matchups. Betting on the Bears defense -- especially vs. an offensive attack that includes Puka Nacua and Davante Adams -- is sketchy. They rank fourth-worst in total defense, allowing 361.7 yards per game, but of course led the league in takeaways in the regular season. Chicago didn't force a turnover vs. the Green Bay Packers last week, but Caleb Williams was still able to pull off the comeback. Keep an eye on rookie tight end Colston Loveland, who caught 8 of 15 targets for 137 yards in the wild-card round. Rams win this game, but could get caught on the hook  …  Prediction: Rams 23, Bears 21\nDubin (Rams -3.5): I picked the Rams to win the Super Bowl, so I'm obviously going to be picking them here. The Bears have been pulling rabbits out of their collective hats all season long, but I think that comes to an end against a team that looked like it was the best in the league for most of the year before stumbling a bit down the stretch. Chicago can't play as poorly as it often does for stretches of the game and expect to come away with a win against L.A. -- the Rams are too good on both sides of the ball for that, and we've seen that even if they do blow a lead, they have a trump card with Matthew Stafford and Co. In the end, I am again going to roll with the better quarterback's team to win. Especially in what should be a higher-scoring game. … Prediction: Rams 30, Bears 24\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL divisional round picks: Our experts face off on Bills-Broncos and more playoff games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/43ad38bb-a68e-4feb-90bc-b24213c80bd4/thumbnail/1200x675/079e63317f272694ac6c44fad675582f/caleb-williams-chicago-bears-imagn-images.jpg"
      ],
      "datePublished": "2026-01-18T03:08:52.000Z",
      "dateModified": "2026-01-18T03:08:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Darnold injury: Seahawks QB listed as active for divisional round vs. 49ers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/sam-darnold-injury-seahawks-qb-questionable-49ers-oblique/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/a80fd23f-a8da-4a2f-8670-1848fc0520c7/thumbnail/1200x675/c5f09a170484fdb31b814dbc0f25fab6/darnold-seahawks-getty.png",
    "tag": "Sports",
    "date": "2026-01-17T23:41:36.000Z",
    "description": "\n        There was some doubt about the status of Seattle Seahawks quarterback Sam Darnold for Saturday's divisional round playoff matchup with the Sa",
    "body": "\n        There was some doubt about the status of Seattle Seahawks quarterback Sam Darnold for Saturday's divisional round playoff matchup with the San Francisco 49ers. Darnold was listed as questionable after suffering an oblique injury while throwing during Thursday's practice, and ESPN reported Saturday morning that he hasn't thrown a football since. However, Darnold is officially active for the divisional-round showdown. Darnold said he felt some discomfort in his oblique on the left side and decided not to take any risks by continuing to throw during practice.\"Didn't wanna push it,\" he said Thursday. \"Wasn't the day to push it. That was it. Came inside, got some rehab, and feel like I'll be ready to go for Saturday.\"Darnold said that there is a \"very low percentage\" that he isn't on the field for Seattle's first playoff game. \"Probably closer to zero,\" he said with a slight smile. \n\n        \n            \n                Seahawks vs. 49ers prediction: Can San Francisco overcome injuries, short week at No. 1 seed Seattle?\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nDarnold, 28, has been a big key to Seattle's success this season under second-year coach Mike Macdonald. Following a Pro Bowl season with the Minnesota Vikings last year, Darnold was named to his second straight Pro Bowl this season after throwing for over 4,000 yards and 25 touchdowns in helping lead the 14-3 Seahawks to the NFC's No. 1 seed for the postseason. Darnold split his two starts this season against the 49ers, throwing for less than 200 yards in both games and not throwing a touchdown pass. He didn't throw any interceptions in those games either while completing 73.5% of his passes. \nIf Darnold isn't able to play, the Seahawks would turn to Drew Lock, who received reps with Seattle's first-team offense on Thursday and Friday. Lock, 29, is a former second-round pick who attempted just three passes during the regular season. He does have 28 career regular season starts under his belt that includes 13 starts in 2020, his second season with the Denver Broncos. The Seahawks third QB, rookie Jalen Milroe, is inactive for Saturday, expressing further confidence in Darnold being able to go.\"Drew's been really impressive throughout OTAs and training camp and in his role,\" Seahawks offensive coordinator Klint Kubiak said following Thursday's practice. \"Started a lot of football games, 28 games in the league. Lot of confidence in Drew. Brought him here for a reason.\" \nWhile Lock will have to be ready, Darnold has made it clear that he fully expects to be on the field to make his second career postseason start. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Darnold injury: Seahawks QB listed as active for divisional round vs. 49ers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/a80fd23f-a8da-4a2f-8670-1848fc0520c7/thumbnail/1200x675/c5f09a170484fdb31b814dbc0f25fab6/darnold-seahawks-getty.png"
      ],
      "datePublished": "2026-01-17T23:41:36.000Z",
      "dateModified": "2026-01-17T23:41:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Harbaugh to Giants grade: New York scores an 'A' for hiring top coach on market - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/john-harbaugh-hired-new-york-giants-head-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/c417c826-4822-4bc0-b81d-b56380eb4535/thumbnail/1200x675/00e7b958643c5c66ff4e9f0c72783153/john-harbaugh-ravens-g2.jpg",
    "tag": "Sports",
    "date": "2026-01-17T20:51:37.000Z",
    "description": "\n        The New York Giants made a massive move late Wednesday night, as they began working to finalize an agreement with former Baltimore Ravens hea",
    "body": "\n        The New York Giants made a massive move late Wednesday night, as they began working to finalize an agreement with former Baltimore Ravens head coach John Harbaugh to be their next head coach. It took longer than expected, but the New York Giants have finalized their contract with Harbaugh to be their new lead man, sources told CBS Sports' Jonathan Jones. NFL Media reports the deal is for five years. Harbaugh was immediately the most sought-after name on the market once he and the Ravens parted ways, and the Giants struck quickly to work on a deal with Harbaugh before he could take reported meetings with the Tennessee Titans and Atlanta Falcons this weekend. From the Giants' perspective, this has to be considered an excellent hire -- an \"A,\" if you will.\n        \n            \n                John Harbaugh's first 100 days: The blueprint to rebuild the Giants\n                \n                    Garrett Podell                \n            \n                            \n    \n                \n                    \n    \nHarbaugh was extremely successful with the Ravens, compiling a 180-113 regular-season record and making the playoffs 12 times in 18 seasons, going 13-11 in the postseason and winning a Super Bowl back in 2012. A CEO-style head coach who was a former special-teams coordinator, Harbaugh was nevertheless at the forefront of leaguewide trends like aggressive fourth-down decision-making and he showed the ability to adapt with the times and with the construction of his roster, repeatedly seeking out new ideas on both sides of the ball so that he could mold the system around his players rather than try to fit square pegs into round holes. \nHe'll bring immediate stability and competence to a Giants organization that has been desperate for it over at least the last decade, as it has cycled through coach after coach and disappointment after disappointment. He should also be able to bring with him a strong coaching staff, given the connections he has made over the years and the various coaches who have worked with him at one time or another. Reports have already circulated that he'll bring Todd Monken to New York as his offensive coordinator, which would be a very good hire as the Giants look to build their future around Jaxson Dart. Lamar Jackson was already a superstar before Monken got to Baltimore, but he certainly helped take Jackson's game to another level. If he can do the same for Dart, that would be extremely beneficial as the Giants look to improve after being one of the worst teams in the league. We don't yet know who Harbaugh would like to bring with him on the defensive side of the ball, but he's repeatedly found top defensive minds over the years. He's had coaches like Rex Ryan, Vic Fangio, Chuck Pagano, Dean Pees, Teryl Austin, Wink Martindale, Steve Spagnuolo, Mike Macdonald, Leslie Frazier, Jesse Minter, Zach Orr, Anthony Weaver and Dennard Wilson work under him as either coordinators or position coaches at one time or another over the last decade-plus, and the Ravens have routinely had one of the NFL's better defenses. A great deal of that obviously has to do with the talent they have been able to land on that side of the ball, thanks to an excellent front office, but Harbaugh has also brought in a bunch of strong defensive coaches, as mentioned.\nHarbaugh's age (he'll turn 64 early next season) and the Ravens' recent propensity for blowing leads are slight concerns here, but they're mitigated by his long track record of success and the Giants' desperate need for someone who can professionalize the organization. You can, of course, find that type of coach anywhere if you turn over the right stones, but the Giants obviously valued Harbaugh's pedigree highly, and they moved quickly to strike on the man many viewed as the top candidate available this cycle.What others are sayingCBS Sports senior NFL writer Pete Prisco was even more effusive in his praise of the Harbaugh hiring.\"For him, it's an 'A',\" Prisco said. \"It's the best job out there. And I said that when all the jobs opened up. And people say, 'What are you saying?' Well, it's the Giants. The New York Giants. You're in New York. \n\"And not only that, you have a lot of young talent on that team to build around. If you look at the NFL, what do you want? You want a quarterback and you want pass rushers. Well, they have it. If you believe in Jaxson Dart -- and I think he can be successful -- then you have the quarterback and the pass rushers, so it makes sense from that standpoint. So, from his standpoint, it's an A. \"From the Giants' standpoint, A+. You targeted him, you went and got him, and now it's all on you to make sure it works around him. I think this is a no-brainer hire for both sides. If I were John Harbaugh, that's the job I would want. If I were the New York Giants, John Harbaugh's the guy I would want.\"CBS Sports HQ NFL analyst Danny Kanell echoed many of those sentiments. \"I will give it an 'A+',\" Kanell said. \"This was the only coach that would come in and have us talking about this Giants organization as potentially a playoff team. And I don't think it'll only be me. With the young nucleus of talent that the Giants have on this roster, with the track record of success in building a winning culture, with the coordinator that he's most likely going to bring in with him, I think this is a home run hire for the Giants.\"\nYou're not going to find very many people out there who don't think this hiring is one of the better hirings of the cycle, no matter who lands the other available jobs. Harbaugh was sought after for a reason, and the Giants were able to land him before anyone else had a chance. Even if it doesn't work out, the process that led here was likely solid, even if it seemed somewhat predetermined that the Giants would zero in on Harbaugh if he ever became available.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Harbaugh to Giants grade: New York scores an 'A' for hiring top coach on market - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/c417c826-4822-4bc0-b81d-b56380eb4535/thumbnail/1200x675/00e7b958643c5c66ff4e9f0c72783153/john-harbaugh-ravens-g2.jpg"
      ],
      "datePublished": "2026-01-17T20:51:37.000Z",
      "dateModified": "2026-01-17T20:51:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Air Force basketball coach Joe Scott suspended amid investigation into treatment of players - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/joe-scott-air-force-basketball-coach-suspended-investigation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/42f6b5a4-82d7-4113-9c55-bbdf48200ae5/thumbnail/1200x675/864ecc6516612957cc9a59d3a14628be/untitled-design-162.png",
    "tag": "Sports",
    "date": "2026-01-17T20:35:43.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Air Force men's basketball coach Joe Scott has bee",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Air Force men's basketball coach Joe Scott has been suspended indefinitely pending an investigation into the treatment of cadet-athletes, the program announced on Saturday. No other details about the nature of the investigation -- or what prompted it -- were provided. In a statement, Scott said he will \"fully cooperate with the investigation.\"\"In response to today's action, I will fully cooperate with the investigation and look forward to a proper resolution of this matter,\" Scott said. \"I will not have any further comment until the matter is resolved.\"Air Force assistant Jon Jordan will serve as interim coach during Scott's absence, including later Saturday when the Falcons host Nevada. The Falcons are 3-14 (0-6 Mountain West) and riding a 10-game losing streak. The team's last win came against IU Indianapolis on Nov. 23. Scott, 60, has been at the helm at Air Force since 2020. It's his second stint leading the Falcons. He previously coached the program from 2000-04 and has a 97-183 overall record as the Air Force coach. \nScott also spent three seasons coaching Princeton (2000-03) before nine at Denver (2007-16). From there, he was an assistant at Holy Cross and Georgia before returning to Air Force. In all, Scott has a 281-360 record as a Division I head coach. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Air Force basketball coach Joe Scott suspended amid investigation into treatment of players - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/42f6b5a4-82d7-4113-9c55-bbdf48200ae5/thumbnail/1200x675/864ecc6516612957cc9a59d3a14628be/untitled-design-162.png"
      ],
      "datePublished": "2026-01-17T20:35:43.000Z",
      "dateModified": "2026-01-17T20:35:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]