[
  {
    "title": "Computer model reveals free NFL picks, best bets for Week 9 late afternoon games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-week-9-nfl-free-picks-betting-odds-best-bets-saints-bills-sunday-nov-2/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/26/45f49f30-1ed9-4803-8a4e-0e8ba0319bbd/thumbnail/1200x675/a4a3ceb07aa7011f9e651a0d27793f21/josh-allen-bills.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:16:52.000Z",
    "description": "\n        Sunday's NFL schedule features three games in the 4 p.m. ET window, including one of the matchups many NFL fans were most looking forward to ",
    "body": "\n        Sunday's NFL schedule features three games in the 4 p.m. ET window, including one of the matchups many NFL fans were most looking forward to when the 2025 NFL schedule was released, as the Buffalo Bills host the Kansas City Chiefs. It may come as a surprise since Josh Allen has never played in a Super Bowl and Patrick Mahomes has made five, but the Bills are 4-1 during the regular season in Allen vs. Mahomes contests. The SportsLine model expects that trend to continue, backing the Bills to beat the Chiefs despite being +110 underdogs in the latest Week 9 NFL odds. The Chiefs are favored by two points, while the over/under is set at 52.5 points. Kansas City is a -136 money line favorite (risk $136 to win $100), while Buffalo is a +113 underdog. The model's two other best bets for the late-afternoon window for NFL betting feature the Saints being competitive enough with the Rams to cover the spread as 14-point underdogs, and Under 44.5 total points for Jaguars vs. Ravens. Before locking in your Week 9 NFL picks, be sure to check out the top NFL betting picks from SportsLine's advanced computer model. New users can target the latest bet365 promo code, which gives new users $200 in bonus bets whether their first bet wins or loses: The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the DraftKings promo code, which gives new users $300 in bonus bets if your first $5 bet wins, plus three months of NBA League Pass free:Week 9 NFL best bets for Sunday, Nov. 2 (odds subject to change): Jaguars vs. Raiders: Under 44.5 total pointsSaints (+14) vs. RamsBills (+110) to defeat the ChiefsCombining the model's three picks into a Week 9 NFL parlay would result in a payout of +649 (risk $100 to win $649). Bet it now at DraftKings Sportsbook:Jaguars vs. Raiders: Under 44.5 total pointsThe Jaguars and Raiders have two of the bottom eight scoring offenses in the NFL, including Las Vegas with the second-worst scoring offense at 14.7 points per game. Geno Smith hasn't performed at the same level in Las Vegas as he did during his resurgence in Seattle. He has seven touchdowns compared to 10 interceptions this season and threw for just 67 yards against the Chiefs in Week 7 before their bye. The Jaguars have also been one of the surprisingly better defensive units in the NFL, ranking 15th in scoring defense at 22.1 ppg, but they rank 25th in scoring at 20.9 ppg. The model projects the Under to hit in 58% of simulations. Saints (+14) vs. RamsQuarterback Tyler Shough, a second-round pick in the 2025 NFL Draft out of Louisville, is set to make his first NFL start for New Orleans this week, and he draws a tough defense to make it against. Although he's a rookie, Shough has plenty of high-level football experience, playing in 42 games over seven years of college football. He entered in relief against Tampa Bay last week and completed 17 of 30 passes for 128 yards with no touchdowns and one interception, but with an entire week to prepare, he could have better results on Sunday. Despite a 1-7 record, New Orleans has only two losses by 14 points or fewer, and the model expects the Saints to stay within the margin on Sunday, projecting New Orleans to cover in 60% of simulations.Bills (+110) to defeat the ChiefsThe Bills host the Chiefs on Sunday, and Buffalo is 11-1 in Orchard Park since the start of last season. They've been a dominant home team, and the model expects them to continue with an upset victory on Sunday. Josh Allen is 4-1 over his regular-season career against Patrick Mahomes, including a 30-21 win last year in Buffalo. The Bills are coming off a dominant 40-9 win against the Panthers last week as they have the No. 4 scoring offense at 29.6 ppg this season. The model projects the Bills to win in 55% of simulations, despite being the underdogs.Want more Week 9 NFL picks?You've seen the model's Week 9 NFL best bets for Sunday. Now, get against the spread, total and money line picks for every Week 9 NFL game here, all from the model that's simulated every game 10,000 times. Finally, SportsLine expert RJ White, who is 83-70 (+1185) over his last 153 NFL picks, has locked in multiple Week 9 NFL picks. Visit SportsLine to see his best bets.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals free NFL picks, best bets for Week 9 late afternoon games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/26/45f49f30-1ed9-4803-8a4e-0e8ba0319bbd/thumbnail/1200x675/a4a3ceb07aa7011f9e651a0d27793f21/josh-allen-bills.jpg"
      ],
      "datePublished": "2025-11-02T18:16:52.000Z",
      "dateModified": "2025-11-02T18:16:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Seahawks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/best-betting-apps-nfl-sportsbooks-promos-sunday-night-football-bet-commanders-seahawks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/a386b0f2-b8ce-4f1a-a52e-d138c770e47a/thumbnail/1200x675/c1590c40270ae4eb43b5737be7a68c8e/seattle-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:27:06.000Z",
    "description": "\n        To cap off another busy NFL Sunday, the Washington Commanders will host the Seattle Seahawks on Sunday Night Football in Week 9. Washington i",
    "body": "\n        To cap off another busy NFL Sunday, the Washington Commanders will host the Seattle Seahawks on Sunday Night Football in Week 9. Washington is off to a disappointing 3-5 start after making the NFC Championship Game last season, but will have starting quarterback Jayden Daniels back from a hamstring injury after he missed last week's loss to the Chiefs. Meanwhile, Seattle is 5-2 and has had an extra week to prepare coming off a bye week, and will look to counter the Commanders' third-ranked rushing attack with the NFL's best run defense. The latest Week 9 NFL odds list the Seahawks as 3-point favorites on the road, and the over/under is 48.5 points.There are dozens of betting options if you're wondering how to bet on the NFL, or more specifically, Commanders vs. Seahawks. Here's a closer look at available sportsbook promos on some of the top NFL betting sites, as well as the best betting apps that are available for Seahawks vs. Commanders on Sunday Night Football, with instructions on how to claim each offer and where to bet NFL.Where to bet on Commanders vs. Seahawks on Sunday Night FootballBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets and 3 months of NBA League Pass free if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $300 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash Just click hereThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users either $200 in bonus bets with the placement of a $5+ bet, or up to a $1,000 first bet safety net. Users receive the $200 bonus whether the bet wins or loses.At DraftKings and FanDuel, you need to win your first bet to receive the bonus, but the reward is even greater. FanDuel offers new users $300 in bonus bets if their first bet of at least $5 wins. DraftKings also offers $300 in bonus bets with a winning wager of at least $5, but with the latest DraftKings promo code with the 2025-26 NBA season beginning, new users also receive three months of NBA League Pass free, on top of the $300 in bonus bets.The latest Fanatics Sportsbook promo code provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code is different than the aforementioned offers, providing profit boosts instead of bonus bets. At Caesars, new users can get 20 100% sportsbook profit boosts with a $1 bet. Bettors can use any of these promotions for Commanders vs. Seahawks for Sunday Night Football on Sunday, November 2.Seahawks vs. Commanders betting preview, picksSeahawks -3 vs. Commanders \"No hints of 2024 yet for the Commanders, yet to flash some of the magic and spark that we saw constantly a season ago. The status of Jayden Daniels (who missed Monday vs. the Chiefs with hamstring issues) is likely to be a go for Sunday night, but he'll be minus key target Terry McLaurin, back on the shelf,\" SportsLine handicapper Bruce Marshall said. \"Commanders have lost back-to-back games by 20+ points. Meanwhile, Seattle is well-rested off a bye, and has continued to excel on the road, where it has won all three of its starts this season, as well as five of six overall as Sam Darnold continues to prove a very worthwhile QB signing in the offseason, and at least a slight upgrade from Geno Smith.\"Under 48.5 pointsWashington's offensive numbers are undoubtedly skewed by the fact that Daniels has only finished four games this season, and having last year's NFL Offensive Rookie of the Year back should help. However, the Commanders only averaged 22.4 points in the five games that Daniels did start, and he'll also be without top receiver Terry McLaurin (quad). Washington has been incredibly dependent on its running game all season, and Seattle has the NFL's best run defense, as the Seahawks only allow 75.7 rushing yards per game and 3.3 yards per carry. With Cooper Kupp (heel) not expected to play on Sunday, Seattle will also be down a playmaker, and that is part of the reason why the model predicts that the Under hits in 53% of simulations.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Commanders vs. Seahawks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/a386b0f2-b8ce-4f1a-a52e-d138c770e47a/thumbnail/1200x675/c1590c40270ae4eb43b5737be7a68c8e/seattle-seahawks.jpg"
      ],
      "datePublished": "2025-11-02T18:27:06.000Z",
      "dateModified": "2025-11-02T18:27:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How JuJu Watkins is mentoring USC freshman Jazzy Davidson from the sidelines - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/ncaa-womens-basketball-juju-watkins-helping-usc-freshman-jazzy-davidson-spotlight/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/9a72b1d3-a25b-4aa1-b4fe-fba77d8c6f39/thumbnail/1200x675/0e2b6f975daf5eb728ebb304d0df4ae2/untitled-design-81.png",
    "tag": "Sports",
    "date": "2025-11-02T21:37:38.000Z",
    "description": "\n        USC freshman Jazzy Davidson, the No. 3 player in the class of 2025 according to 247Sports,  is naturally shy and reserved. But coach Lindsay ",
    "body": "\n        USC freshman Jazzy Davidson, the No. 3 player in the class of 2025 according to 247Sports,  is naturally shy and reserved. But coach Lindsay Gottlieb encourages her to have a relationship with junior JuJu Watkins because she sees a striking resemblance between the two Trojans. \"She and JuJu, to me, from my vantage point, having a unique relationship with each of them, there are a lot of similarities between the two of them,\" Gottlieb said. \"Natural introverts who live and die by the game of basketball. I do think JuJu was instrumental in Jazzy's recruitment, and I think Jazzy wanted to play with JuJu. \"Obviously, this year will look different in that Juju won't be on the court with her, but ... no one knows what Jazzy's about to go through as a high-profile freshman better than JuJu. So I think that relationship is important and it's a good one.\"Watkins, who has been one of the top players in the country the last two years, is sitting out this season due to a torn ACL. She arrived at USC as the No. 1 player in the class of 2023 and went on to crush the high expectations with a historic season in which she set a new NCAA freshman scoring record. The Trojans have to adjust without their top offensive player while also losing the veteran leadership of Kiki Iriafen, who is now in the WNBA. \nWhile nobody can replace Watkins, Davidson is a promising addition to a roster that was thrust into rebuilding mode. The 6-foot-1 forward averaged 28.5 points, 8.7 rebounds, 3.6 assists, 3.8 steals and 2 blocks per game during her senior year at Clackamas High School in Oregon. She was also a key member of Team USA during the FIBA U19 World Cup.\nDavidson got to know Watkins before she even committed to USC because Watkins was her host during a visit. She recently missed some practices with an illness but is good to go for the Trojans' season opener against New Mexico State on Nov. 4. While she was out, Davidson spent more time with Watkins on the sidelines.\n\"There was a day the other day when Jazzy wasn't going to be in what we were doing, the scrimmage or whatever, because she was still in her return to play,\" Gottlieb recalled. \"But I come out of somewhere and I see the two of them, and their sweatsuits getting ready to not play, and I'm going, 'This is an interesting sight, right? This much talent, sitting on the side.'\"But I also think it was good for them. Obviously, any time that they spend together, you know, iron sharpens iron. And I think JuJu will continue to be a good mentor for Jazzy. Both natural introverts and both real workers and just incredibly kind and humble kids who just happen to be really good at basketball.\"While Gottlieb has been vocal about Davidson's potential to impact the game on both sides of the court, one of the things she likes the most about the freshman is how hard she plays.\n\"Her effort level is very unique,\" the coach said. \"She never gives up on a play, defensively or offensively. And she has a skillset where she can be the alpha and try to get a bucket -- of course she shoots the ball very well -- but she also has a smoothness to her game where she can come off the ball and just draw defenses away and just let someone else have more space to score, or she can be an assist creator. I think she is someone who very naturally makes the game easier for others.\"USC has been on the rise and the Trojans are fresh off back-to-back appearances in the Elite Eight. Watkins got the spotlight on the program, but Gottlieb wants to make sure Davidson doesn't feel she needs to be perfect.\"That's another way I think JuJu can really help mentor her,\" Gottlieb said. \"JuJu had one of the most remarkable freshmen years I've ever seen, but that doesn't mean it's always linear. That doesn't mean it was perfect. It doesn't mean that there weren't struggles within. \n\"I think for great players and great athletes at any level, it's how you handle what's coming and respond when it isn't perfect vs. expecting it to be perfect. We (coaches) are trying to help her navigate whatever is coming, as are her teammates, and I think she'll be just fine with all of that.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How JuJu Watkins is mentoring USC freshman Jazzy Davidson from the sidelines - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/9a72b1d3-a25b-4aa1-b4fe-fba77d8c6f39/thumbnail/1200x675/0e2b6f975daf5eb728ebb304d0df4ae2/untitled-design-81.png"
      ],
      "datePublished": "2025-11-02T21:37:38.000Z",
      "dateModified": "2025-11-02T21:37:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nebraksa QB Dylan Raiola to miss rest of season after suffering broken tibula - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/dylan-raiola-to-miss-remainder-of-season-nebraska-star-qb-suffered-broken-fibula-in-loss-to-usc/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/1bbe106e-cd09-465d-b559-0ae8a638c8e1/thumbnail/1200x675/9554de764228d08cbe0fd5ed2aaecdfd/dylan-raiola-getty.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:33:16.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Nebraska quarterback Dylan Raiola will miss the re",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Nebraska quarterback Dylan Raiola will miss the remainder of the season after suffering a broken fibula in the third quarter of Saturday's game against USC, according to Brandon Marcello of CBS Sports.Raiola was sacked in the third quarter, fumbling the ball in the process and did not return to the game as the Cornhuskers lost the 21-17 to fall to 6-3 on the season.\"Thank y'all for your thoughts and prayers,\" Raiola wrote in a post on Instagram ahead of the announcement. \"God's vision and plan is so much greater than I can imagine!! Just a small bump in the road to a beautiful journey back to playing the game that I love!! Much love\"\n\nRaiola, a five-star quarterback from the 2024 recruiting cycle in the 247Sports rankings, was the key to a 6-2 start to the season for Nebraska. In Nebraska's first loss of the season, a close 30-27 defeat against Michigan, Raoila kept the Huskers in the game with 308 passing yards and three touchdowns through the air.At the time of Nebraska's loss to Michigan, the Wolverines were ranked No. 21 in the AP Poll. USC entered Saturday's game ranked No. 23. Those losses ran Nebraska's losing skid against AP-ranked teams to 29, a skid that dates back to 2016.\nCoach Matt Rhule stated after the loss to USC that Raiola wanted to go back in the game, but the quarterback was unable to run.\"I love you too much to ask you to play when you're hurt like this,\" Rhule told the media after the game of his conversation with his quarterback.Coming into the weekend, Raiola had thrown for 1,909 yards and 17 touchdowns to just six interceptions. He has thrown at least one touchdown pass in eight of Nebraska's nine games this season.\nTrue freshman TJ Lateef came into the game following Raiola's injury, completing five of seven passes for just seven yards. Lateef, who will remain under center for Nebraska, also rushed for 18 yards on seven carries.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nebraksa QB Dylan Raiola to miss rest of season after suffering broken tibula - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/1bbe106e-cd09-465d-b559-0ae8a638c8e1/thumbnail/1200x675/9554de764228d08cbe0fd5ed2aaecdfd/dylan-raiola-getty.jpg"
      ],
      "datePublished": "2025-11-02T20:33:16.000Z",
      "dateModified": "2025-11-02T20:33:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 9 breakouts: Parker Washington earns a role worth stashing in leagues now, plus more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-9-early-waiver-wire-breakouts/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2024/10/20/c8139aa2-be6e-44df-a439-d0373acdf3f1/thumbnail/1200x675/2310e462091695fc2876d3c61b586ff5/usatsi-parker-washington-jaguars-practice.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:20:46.000Z",
    "description": "\n        In Week 9, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and ",
    "body": "\n        In Week 9, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 10 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Terrell Jennings, RB, PatriotsWith Rhamondre Stevenson sidelined, Jennings played a key role in the Patriots rushing attack. He led the team in rushing attempts with 11 -- a good sign on his own -- and he got the red zone opportunity -- an even better sign. Jennings scored a touchdown with 35 yards on 11 carries. He also added a reception for nine yards. If Stevenson's injury lingers, Jennings has some intrigue as a Flex play with a lead on the red zone role in a high-octane scoring offense facing an easy schedule rest of season.Parker Washington, WR, JaguarsWith Travis Hunter placed on injured reserve, some expected Brian Thomas Jr. season would finally be upon us. That expetation made some sense from a raw talent standpoint, but it ignored the lack of rapport Trevor Lawrence and Thomas have shown together all season. Thomas' best games a a rookie cam with Mac Jones. Washington took over as Lawrence's lead target in the Jaguars' passing attack coming out of the bye week in a new-look pass attack. Washington finished with a team-high 77 yards receiving on eight targets (and seven catches). Thomas also left Week 9 with an ankle injury and after that the Jaguars leaned even more heavily on Washiongton. Washington will be mainstay in PPR leagues and could push into the WR2/3 discussion if he continues to get targeted at this rate. Demario Douglas, WR, PatriotsIt's never easy to figure out where the targets and production are going but we know for certain that production will be coming in this Patriots pass attack. Drake Maye is the truth and Josh McDaniels has maximized his skill set as a drive thrower with elite touch on the vertical plane. Douglas has the speed to win over the top in addition to creating underneath -- he just needed a quarterback like Maye to bring out this area of his game. Douglas is worth stashing in deeper leagues but will struggle to find consistency in a crowded pass game.\nAndrei Iosivas, WR, BengalsIosivas racked up five receptions for 66 yards and a touchdown in Week 9. He will benefit from game script and Joe Flacco as his quarterback. Flacco threw for 450+ in Week 9 as the Bengals defense continued to allow score after score. This led to a late-game scoring opportunity for Andrei who cashed in. He's an interesting stash. He won't find consistent Fantasy value unless Tee Higgins or Ja'Marr Chase get hurt -- but if they do he will be an every-week starter.RJ Harvey, RB, BroncosIt has been a disappointing rookie season for Harvey after coming in with major expectations in the Fantasy Football community, but he is starting to find his niche now. The Broncos are using him as an extension of their run game when their run game struggles to create early. This has been the case early and often for Denver, so they turn to Harvey. In this game, Harvey racked up another five receptions for 51 receiving yards and a score. Harvey has worked his way into the FLEX conversation in PPR leagues.\nBrian Robinson, RB, 49ersRobinson reminded us in Week 9 of what he's capable of when given opportunities. He finished with 53 yards rushing and a touchdown on just five carries. This is a reminder to all Fantasy Football managers that Robinson is the best handcuff stash in the game. If he's unrostered in your league, there's no higher-upside bench stash available. Sign him for your stretch run.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 9 breakouts: Parker Washington earns a role worth stashing in leagues now, plus more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2024/10/20/c8139aa2-be6e-44df-a439-d0373acdf3f1/thumbnail/1200x675/2310e462091695fc2876d3c61b586ff5/usatsi-parker-washington-jaguars-practice.jpg"
      ],
      "datePublished": "2025-11-03T00:20:46.000Z",
      "dateModified": "2025-11-03T00:20:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaguars' Travon Walker ejected vs. Raiders after throwing punch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jaguars-travon-walker-ejected-vs-raiders-after-throwing-punch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/67d2ce51-fc28-435f-a222-e62fb1707948/thumbnail/1200x675/db2c13ed73ef25a7051f2d8af39a8207/travon.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:55:33.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Jacksonville Jaguars will have to finish out t",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Jacksonville Jaguars will have to finish out their Week 9 matchup vs. the Las Vegas Raiders without former No. 1 overall pick Travon Walker, as he was ejected for throwing a punch in the third quarter.As Daniel Carlson knocked through a 24-yard field goal to give the Raiders a 9-6 lead, Walker threw a nasty punch at offensive linemen Stone Forsythe. It's unclear why, but both Walker and Forsythe were penalized for personal fouls. Walker, however, was also ejected.Check out what happened, here:\nWalker was fined $11,817 last year for fighting against the Minnesota Vikings, although he was not ejected. So far this season, the Georgia product has recorded 14 combined tackles, two sacks and five QB hits in six games played. \nLast month, we saw Detroit Lions defensive back Brian Branch receive a one-game suspension for sparking a melee following a prime-time loss to the Kansas City Chiefs. Walker could face some form of discipline for his actions on Sunday as well. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaguars' Travon Walker ejected vs. Raiders after throwing punch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/67d2ce51-fc28-435f-a222-e62fb1707948/thumbnail/1200x675/db2c13ed73ef25a7051f2d8af39a8207/travon.jpg"
      ],
      "datePublished": "2025-11-02T23:55:33.000Z",
      "dateModified": "2025-11-02T23:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Commanders props, 'Sunday Night Football' player projections from SportsLine AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-commanders-nfl-player-props-ai-picks-bets-jayden-daniels-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/cfb49fb5-b79d-4dbd-9404-47195e316f1f/thumbnail/1200x675/ac7437bd45e8a0294b046472bcee8dc8/jayden-daniels.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:31:39.000Z",
    "description": "\n        NFC teams with playoff aspirations clash when the Seattle Seahawks meet the Washington Commanders in NFL Week 9 'Sunday Night Football' at 8:",
    "body": "\n        NFC teams with playoff aspirations clash when the Seattle Seahawks meet the Washington Commanders in NFL Week 9 'Sunday Night Football' at 8:20 p.m. ET from Northwest Stadium in Landover, Md. The Seahawks (5-2) co-lead the NFC West, while the Commanders (3-5) are third in the NFC East. The game will showcase Seahawks quarterback Sam Darnold against Commanders quarterback Jayden Daniels, who missed last week and is returning from a hamstring injury. Both players figure into several NFL player props.Daniels has been solid, completing 61% of his passes for 1,031 yards and eight touchdowns while also rushing for 211 yards and one touchdown. Darnold, meanwhile, has been dominant. In seven games, he has completed 68.2% of his passes for 1,754 yards and 12 touchdowns. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Kenneth Walker III, Cooper Kupp and Jaxon Smith-Njigba of Seattle or Jacory Croskey-Merritt, Deebo Samuel and Zach Ertz of Washington. Before betting any Seahawks vs. Commanders props for Sunday Night Football, you need to see the Seahawks vs. Commanders prop predictions powered by SportsLine's Machine Learning Model AI.New users can also target the DraftKings promo code, which offers $300 in bonus bets instantly if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Seahawks vs. Commanders NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Commanders vs. Seahawks prop picks. You can only see the Machine Learning Model player prop predictions for Seahawks vs. Commanders here.Top NFL player prop bets for Seahawks vs. CommandersAfter analyzing the Seahawks vs. Commanders props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Commanders QB Daniels goes Under 227.5 passing yards (-114). Daniels is coming back from a hamstring injury and may have some limitations on Sunday. In five games, he has gone under 227.5 yards passing three times, including in a 44-22 loss at Dallas on Oct. 19, where he had just 156 yards passing. He will also be without wide receiver Terry McLaurin and facing a defense that ranks in the top five in both passer rating allowed and yards per completion given up.In a 25-24 loss to the Chicago Bears on Oct. 13, he completed 19 of 26 passes for 211 yards and three touchdowns with one interception. In 17 games last season, he threw for 227 or fewer yards in 10 games. In seven games this season, Seattle's defense has allowed 228 or fewer yards three times. The SportsLine Machine Learning Model projects Daniels to have 182 passing yards and gives this prop a 5-star prop rating. See more NFL props here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make NFL player prop bets for Seahawks vs. CommandersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has four additional NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Commanders vs. Seahawks prop bets for Sunday Night Football.Which Seahawks vs. Commanders prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Seahawks vs. Commanders props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Commanders props, 'Sunday Night Football' player projections from SportsLine AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/cfb49fb5-b79d-4dbd-9404-47195e316f1f/thumbnail/1200x675/ac7437bd45e8a0294b046472bcee8dc8/jayden-daniels.jpg"
      ],
      "datePublished": "2025-11-02T23:31:39.000Z",
      "dateModified": "2025-11-02T23:31:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Alt injury updates: Chargers' season hinges on star's high-ankle sprain - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/joe-alt-injury-updates-chargers-high-ankle-sprain-justin-herbert/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/11312767-b583-4a43-9542-5d5cd79a0f8d/thumbnail/1200x675/58132445255b6c0f09712f9637941443/joe-alt-chargers.jpg",
    "tag": "Sports",
    "date": "2025-11-02T23:16:16.000Z",
    "description": "\n        The Chargers held on for a 27-20 victory over the lowly Titans in Week 9, but the win came with a significant loss. Left tackle Joe Alt suffe",
    "body": "\n        The Chargers held on for a 27-20 victory over the lowly Titans in Week 9, but the win came with a significant loss. Left tackle Joe Alt suffered what is believed to be a right high-ankle sprain, his second such injury this season. This time, it is feared the high-ankle sprain may require surgery, according to ESPN.Alt missed three games earlier this season after suffering the same injury in Week 4, though a longer absence could be in store this time with a Monday MRI set to reveal an official strategy moving forward.Alt's presence -- or lack thereof -- protecting quarterback  Justin Herbert's blindside has been absolutely crucial for the Chargers this season.Chargers in 2025Joe Alt on the fieldJoe Alt off the fieldExpected points added per play0.10-0.03Net yards per attempt7.86.0Pressure rate43.5%38.4%The Chargers are 5-1 when Alt plays and 1-2 when he does not. Los Angeles has operated like one of the NFL's top five offenses when Alt is on the field, only to degrade to playing about as well as the Panthers -- the No. 22 offense in EPA per play -- when he is sidelined.Alt is playing left tackle because Rashawn Slater tore his patellar tendon in the preseason, shortly after becoming the highest-paid offensive lineman in NFL history.\nAustin Deculus, who previously started in Alt's place, suffered an ankle injury in Week 7 and was inactive this week despite not carrying an injury designation. Starting guard Mekhi Becton (hand) was also inactive, and right tackle Bobby Hart left with groin and ankle injuries.On Los Angeles' final offensive drive, the offensive line was, from left to right, Jamaree Salyer, Zion Johnson, Bradley Bozeman, Foster Sarell and Trey Pipkins. It was the first time this season Salyer played left tackle and Sarell's first start at right guard. Pipkins hadn't started since Week 6.Alt's absence could be the straw that breaks the camel's back. Herbert has taken 28 sacks this season, third-most in the NFL, and he has been contacted 80 times, most in the NFL.\nSunday, against a struggling Titans defense, Herbert was contacted 10 times. With the running backs struggling, he was the team's leading rusher with 57 yards and a touchdown.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Alt injury updates: Chargers' season hinges on star's high-ankle sprain - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/11312767-b583-4a43-9542-5d5cd79a0f8d/thumbnail/1200x675/58132445255b6c0f09712f9637941443/joe-alt-chargers.jpg"
      ],
      "datePublished": "2025-11-02T23:16:16.000Z",
      "dateModified": "2025-11-02T23:16:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 9 odds, predictions, bets: Chiefs vs. Bills picks from expert on 11-3 roll - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chiefs-bills-picks-odds-line-nfl-week-9-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/28/eaddf33b-9cbd-4b8a-8b9b-930419a1316f/thumbnail/1200x675/afe09b11f415586c93014ec4c5c51066/imagn-josh-allen-bills.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:11:37.000Z",
    "description": "\n        Teams looking to fight their way back to the top of their respective divisions meet when the nine-time defending AFC West champion Kansas Cit",
    "body": "\n        Teams looking to fight their way back to the top of their respective divisions meet when the nine-time defending AFC West champion Kansas City Chiefs take on the five-time defending AFC East champion Buffalo Bills on Sunday. Kansas City is coming off a 28-7 win over the Washington Commanders on Monday, while Buffalo defeated the Carolina Panthers 40-9 last Sunday. The Chiefs (5-3), who have won three in a row, are 1-2 on the road this season. The Bills (5-2), who have lost two of three, are 3-1 on their home field.Kickoff from Highmark Stadium in Orchard Park, N.Y., is set for 4:25 p.m. ET. Buffalo leads the all-time series 30-26-1, including wins in three of the last five meetings. Kansas City is a 2.5-point favorite in the latest Chiefs vs. Bills odds from SportsLine consensus, while the over-under for total points scored is 52.5. Kansas City is at -136 on the money line. Before making any Bills vs. Chiefs picks, make sure you check out what SportsLine expert, Josh Nagel, has to say. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Nagel is a Reno-based analyst and radio host who has worked in the sports handicapping industry for more than 20 years. SportsLine's assistant managing editor has covered the wagering industry on a variety of platforms, and has won numerous sports handicapping contests. He's an incredible 11-3-1 (+980) on his last 15 Buffalo Bills picks. Anyone who has followed him could be way up.Now, Nagel has zoned in on Chiefs vs. Bills. You can head to SportsLine now to see his picks. Here are several NFL betting lines and NFL odds for Bills vs. Chiefs:Chiefs vs. Bills                 spreadKansas City -2.5 at DraftKings SportsbookChiefs vs. Bills                   over/under52.5 pointsChiefs vs. Bills                   money line Kansas City -136, Buffalo +114Chiefs vs. Bills                   picksSee picks at SportsLineChiefs vs. Bills                   streaming Fubo (Try for free)  Why the Chiefs can coverVeteran quarterback Patrick Mahomes continues to play at an MVP-type level. He leads the Chiefs' passing attack, completing 189 of 282 passes (67%) for 2,099 yards and 17 touchdowns with just four interceptions and a rating of 103.1. He is also second on the team in rushing, carrying 46 times for 280 yards (6.1 average) and four touchdowns. In the win over Washington, he completed 25 of 34 passes (73.5%) for 299 yards and three touchdowns with two interceptions. One of those picks bounced off the hands of his receiver.Tight end Travis Kelce is once again one of Mahomes' favorite targets. In eight games, Kelce leads the Chiefs with 37 receptions for 474 yards and three touchdowns. He has five explosive plays of 20 or more yards, including a long of 44. He also has 260 yards after the catch and 25 first-down conversions. In the win over the Commanders, he caught six passes for 99 yards and one touchdown. See which team to back at SportsLine. Why Bills can coverLast year's MVP, quarterback Josh Allen, leads the Buffalo attack. In seven games, he has completed 134 of 197 passes (68%) for 1,560 yards and 12 touchdowns with four interceptions and a 103.6 rating. Allen is also a dual threat, and is second on the team in rushing with 261 yards and five touchdowns on 49 carries (5.3 average). In last week's win over the Panthers, he completed 12 of 19 passes for 163 yards and one touchdown. He also rushed for two other scores. Allen has thrown two or more touchdown passes in five of seven games this season.Powering the rushing attack is running back James Cook III. In seven games, he has carried 126 times for 753 yards (6.0 average) and seven touchdowns. He has had five explosive plays of 20 yards or more, including a long of 64 with 38 first-down conversions. He tore up the Carolina defense in Week 8, carrying 19 times for 216 yards (11.4 average) and two touchdowns. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Chiefs vs. Bills  picksFor Sunday's Chiefs vs. Bills matchup, Nagel is leaning over the total, but he also says a critical X-factor makes one side of the spread a must-back. See what it is at SportsLine.Who covers in Chiefs vs. Bills and what critical x-factor do you need to know about? Visit SportsLine now to see which side of the Chiefs vs. Bills spread you need to jump, all from the expert who returned $980 to $100 players over his last 15 Buffalo Bills picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 9 odds, predictions, bets: Chiefs vs. Bills picks from expert on 11-3 roll - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/28/eaddf33b-9cbd-4b8a-8b9b-930419a1316f/thumbnail/1200x675/afe09b11f415586c93014ec4c5c51066/imagn-josh-allen-bills.jpg"
      ],
      "datePublished": "2025-11-02T20:11:37.000Z",
      "dateModified": "2025-11-02T20:11:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How a 41-year-old tight end could pass Tom Brady in the NFL record book in Week 9 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/marcedes-lewis-pass-tom-brady-nfl-record-books-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/2fe6ddfb-d7a8-4c6e-8517-3835a556703a/thumbnail/1200x675/966110bce6e4a98a2257a6500bde53ef/mercedes-lewis.jpg",
    "tag": "Sports",
    "date": "2025-11-02T18:11:41.000Z",
    "description": "\n        After spending the first two months of the season as a free agent, Marcedes Lewis finally found a team to sign with this week when he made a ",
    "body": "\n        After spending the first two months of the season as a free agent, Marcedes Lewis finally found a team to sign with this week when he made a deal to join the Denver Broncos. Although Lewis was signed to the practice squad, the tight end was promoted to the active roster on Saturday, which means there's a good chance the 41-year-old could end up passing Tom Brady in the NFL record book on Sunday. And yes, you read that right: a tight end could end up passing Brady in the record book. During his 23-year career, Brady re-wrote the NFL record book at the quarterback position, but what you may not know is that he also has a spot in the record book as a pass-catcher. During the 2018 season, Brady caught one pass for 6 yards, which is notable, because it means he has the SECOND-MOST receiving yards in NFL history for a player over 40 years old. Let's take a look at the all-time list for receiving yards over the age of 40:1. Jerry Rice: 2,169 yards 2. Tom Brady: 6 yards 3. Marcedes Lewis: 2 yardsAs you can see, there are only three players in NFL history who have recorded any positive receiving yards after turning 40. If Lewis can total just five receiving yards on Sunday against the Houston Texans, he'll pass Brady. \n\"It's surreal, still trying to take it all in, but I'm really proud today,\" Lewis told Fox Sports on Sunday. Lewis recorded a total of 29 receiving yards as recently as 2023 while playing for the Chicago Bears, and if he can get near that total again, he'll blow past Brady in the record book. Lewis actually had a chance to pass during the 2024 season, but he only caught one pass for two yards during his 17 games with the Bears. The 41-year-old tight end has put himself in a position to pass Brady because of his longevity. Lewis has been in the NFL since 2006 when the Jaguars made him the 28th overall pick in the NFL Draft. That was so long ago that Lewis was in the same draft class as the head coach the Broncos will be facing on Sunday (DeMeco Ryans). Back in 2006, Lewis was actually selected five spots ahead of Ryans, who went 33rd overall to the Texans. The game against Houston will mark the start of Lewis' 20th season, which is the NFL record for most seasons played by a tight end. Lewis also holds the record for most games played by a tight end at 285. Jason Witten held the previous record at 271, but Lewis broke that during the 2024 season.   Lewis has actually played in the 19th most games of any player in NFL history. If he ends up playing in Denver's final nine games, that would put him at 294 games played for his career, which would be the 17th most in NFL history. \nLewis turned 41 on May 19, and by taking the field for Sunday's game, he became the second-oldest active player in the NFL behind only Aaron Rodgers. (Lewis is younger than the Steelers quarterback by five months.)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How a 41-year-old tight end could pass Tom Brady in the NFL record book in Week 9 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/2fe6ddfb-d7a8-4c6e-8517-3835a556703a/thumbnail/1200x675/966110bce6e4a98a2257a6500bde53ef/mercedes-lewis.jpg"
      ],
      "datePublished": "2025-11-02T18:11:41.000Z",
      "dateModified": "2025-11-02T18:11:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sunday Night Football NFL DFS picks, lineup advice for Seahawks vs. Commanders on FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-seahawks-commanders-fanduel-draftkings-daily-fantasy-picks-lineups-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:36:30.000Z",
    "description": "\n        The Seattle Seahawks cross the country to take on the Washington Commanders on 'Sunday Night Football' in the penultimate game on the Week 9 ",
    "body": "\n        The Seattle Seahawks cross the country to take on the Washington Commanders on 'Sunday Night Football' in the penultimate game on the Week 9 NFL schedule at 8:20 p.m. ET. Jayden Daniels (hamstring) is off the injury report, infusing more interest into this matchup for NFL DFS players. Should you build around him in your NFL DFS lineups despite his recent injury, or are others better options? Potential SNF DFS sleepers include Jeremy McNichols, AJ Barner and Luke McCaffrey.With an over/under of 48 points, offense should be aplenty in this matchup, so there are plenty of ways to go for NFL DFS picks. Before locking in any NFL DFS picks for Commanders vs. Seahawks on sites like DraftKings and FanDuel, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, which may include a play $5, get $100 offer:McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him is way up.Now, McClure has turned his attention to Sunday Night Football and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top NFL DFS picks for Seahawks vs. CommandersOne of McClure's top NFL DFS picks for Sunday Night Football is Seahawks quarterback Sam Darnold. Darnold has been among the most efficient quarterbacks in the league this season, completing 68.2% of his passes for 12 touchdowns and four interceptions and only taking nine sacks.Opposing quarterbacks have feasted against the Commanders, as they have given up the 28th most Fantasy points to the position. Each of the last two quarterbacks they've faced have had three touchdown passes, in addition to at least 270 total yards. In what should be a competitive, higher-scoring game, look for Darnold to return value against a porous secondary. See who else to roster here.Part of McClure's optimal NFL DFS strategy also includes stacking Darnold with wide receiver Jaxon Smith-Njigba in an effort to further capitalize on the matchup. Smith-Njigba has been the clear-cut No. 1 receiver in Seattle with a 50-819-4 receiving line this season. He's scored in three straight games and has averaged a whopping 13.5 targets over the past two weeks.The Commanders rank 22nd in the NFL in Fantasy points given up to opposing receivers. They've allowed wideouts to post games with 90-plus yards, and a touchdown, in back-to-back weeks, so McClure loves this NFL DFS stack on Sunday night. See who else to roster here.New users can see the latest FanDuel promo code to get $300 in bonus bets at FanDuel if your $5 bet wins:How to set NFL DFS lineups for Commanders vs. SeahawksMcClure is targeting another undervalued player who could explode for huge numbers on Sunday Night Football. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Sunday Night Football, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sunday Night Football NFL DFS picks, lineup advice for Seahawks vs. Commanders on FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/8e38d6ca-48f6-4919-a932-0bd153693f0f/thumbnail/1200x675/df46d6bc7a0fddb7128e1c064d012a07/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2025-11-03T00:36:30.000Z",
      "dateModified": "2025-11-03T00:36:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AP Top 25 poll: Texas leaps toward top 10,Tennessee sinks in Week 11 college football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ap-top-25-rankings-texas-vanderbilt-tennessee-sec-play/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/a9f846db-bdff-4bf6-ad4a-3b5803e2db9a/thumbnail/1200x675/39e524ca350f4138de2f833e867d4974/gettyimages-2244487743-2.jpg",
    "tag": "Sports",
    "date": "2025-11-02T19:18:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Chaos is inevitable in the college football, and t",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Chaos is inevitable in the college football, and that was the case again in Week 10. With a number of College Football Playoff hopefuls going down this week, that has shaken up the Week 11 AP Top 25 poll.Texas started Saturday afternoon in need of a big win, and it got one by taking down No. 9 Vanderbilt in Austin. Arch Manning had a massive day with 328 passing yards and three touchdowns, and he led the Longhorns to a 34-10 lead to start the fourth quarter. Things did get little hairy with the Commodores scoring 21 consecutive points down the stretch, but the Texas managed to hold on. That resulted helped the Horns fly all the way up to No. 13 in this week's poll.Other playoff contenders were not as fortunate as Texas. Miami suffered an inexplicable overtime loss to an SMU team that just lost to Wake Forest the week before. That knocked the Hurricanes down to No. 18, and their playoff chances are now on life support. The same can be said for Tennessee, which hosted Oklahoma for its \"Dark Mode\" game, but it was lights out for the Vols. Oklahoma pulled out a 33-27 win, and those two teams flip-flopped in the rankings. The Sooners are back up to No. 11 while the Vols are barely hanging around at No. 23.Elsewhere, previously undefeated Georgia Tech tumbled from No. 8 to No. 16 after losing to NC State, and previously No. 22 Houston got rolled by a West Virginia team that entered the weekend winless in Big 12 play.Below is the full AP Top 25 for Week 11. First-place votes are in parentheses.\nOhio State (54)Indiana (11)Texas A&M (1)AlabamaGeorgiaOregonOle MissBYUTexas TechNotre DameOklahomaVirginiaTexasLouisvilleVanderbiltGeorgia TechUtahMiamiMissouriUSCMichiganMemphisTennesseeWashingtonCincinnatiOthers receiving votes: Iowa 71, JMU 53, Pittsburgh 35, SDSU 30, North Texas 27, USF 23, SMU 7, Houston 6, Illinois 4, LSU 4, Arizona State 4\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AP Top 25 poll: Texas leaps toward top 10,Tennessee sinks in Week 11 college football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/a9f846db-bdff-4bf6-ad4a-3b5803e2db9a/thumbnail/1200x675/39e524ca350f4138de2f833e867d4974/gettyimages-2244487743-2.jpg"
      ],
      "datePublished": "2025-11-02T19:18:40.000Z",
      "dateModified": "2025-11-02T19:18:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bradley vs. St. Bonaventure prediction, odds: College basketball picks from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bradley-st-bonaventure-odds-prediction-college-basketball-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/aa932b9f-a643-4938-b0d4-c869d84f1d60/thumbnail/1200x675/318d63d9b67631a8ed3b0b8d643b791f/usatsi-27403575.jpg",
    "tag": "Sports",
    "date": "2025-11-03T00:55:02.000Z",
    "description": "\n        Monday marks the beginning of the 2025-26 college basketball season, with a pair of mid-majors taking part in one of the day's first contests",
    "body": "\n        Monday marks the beginning of the 2025-26 college basketball season, with a pair of mid-majors taking part in one of the day's first contests. The Bradley Braves will take on St. Bonaventure Bonnies in the 2025 Field of 68 Opening Day Marathon, which is an all-day six-game event. Last year saw Bradley go 28-9, finish second in the Mountain Valley Conference and advance to the NIT quarterfinals. Meanwhile, the Bonnies went 22-12 a year ago, placing seventh in the A-10 and losing in the first round of the NIT.Tip-off from the Rock Hill Sports & Events Center in Rock   Hill, S.C., is set for 11 a.m. ET. St. Bonaventure leads the all-time series, 3-2. The Braves are 2.5-point favorites in the latest Bradley vs. St. Bonaventure odds from SportsLine consensus, while the over/under for total points scored is 139.5. Before making any St. Bonaventure vs. Bradley picks, check out the college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every Division 1 college basketball game 10,000 times. It finished last season on a 229-169 roll (+1805) on all top-rated college basketball picks dating back to 2023. This model also ranks in the 99.5th percentile in a major bracket contest after correctly calling every Elite Eight and Final Four team last year. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Bradley vs. St. Bonaventure 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for St. Bonaventure vs. Bradley:Bradley vs. St. Bonaventure          spread:    Bradley -2.5 at DraftKings    Bradley vs. St. Bonaventure                        over/under:    139.5 pointsBradley vs. St. Bonaventure                        money line:    Bradley -137, St. Bonaventure +114Bradley vs. St. Bonaventure                        picks:    See picks at SportsLineBradley vs. St. Bonaventure                        streaming:Fubo (Try for free)    Why Bradley can coverHead coach Brian Wardle has established Bradley as one of the top teams in the MVC over the last few years as they're coming off three straight 20-win seasons. Last year, the team won 28 games, which is the fourth-most in program history, and the Braves were unparalleled from beyond the arc. Bradley led the nation with 39.8% from beyond the arc, and three players who shot at least 37% from downtown return from last year's squad.A newcomer in Alex Huibregtse fits right into the team's philosophy from deep after spending the last five years at Wright State. Huibregtse averaged 13.5 points a year ago and ranked third in the Horizon League in made 3-pointers (90). He scored in double figures in 25 of 32 games and went off for 31 points, including seven made 3-pointers in a double-overtime game versus PFW. See which team to back at SportsLine.Why St. Bonaventure  can coverThe Bonnies boasted one of the best defenses in college basketball last season, ranking 23rd in the nation in points allowed per game. Coach Mark Schmidt encourages his team to play fundamentally sound on that end of the court and avoiding unnecessary fouls, and as a result, just five teams in all of Division I allowed fewer free throw attempts per game than St. Bonaventure. Not giving up points from the charity stripe allows the Bonnies to always stay in games, as evident by their superb spread record.St. Bonaventure was 11-2 against the spread in non-conference games a year ago, with that 84.6% cover rate being the fourth-best in the nation. The team also went 4-1 ATS in neutral-site games and then landed Amar'e Marshall in the offseason from the transfer portal. He averaged 14 points last year with Albany, a season after garnering All-AEC honors with the Great Danes by averaging 16.7 points and 5.0 rebounds. See which team to back at SportsLine. New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make St. Bonaventure  vs. Bradley picksSportsLine's model has simulated Bradley vs. St. Bonaventure  10,000 times and is leaning Over the total, projecting 143 combined points. The model also says one side hits in nearly 70% of simulations. You can head to SportsLine to see the model's men's college basketball picks. So who wins St. Bonaventure vs. Bradley, and which side of the spread hits nearly 70% of simulations? Visit SportsLine now to see which side of the Bradley vs. St. Bonaventure spread to back, all from the advanced model that has returned over $1,800 on its college basketball picks last season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bradley vs. St. Bonaventure prediction, odds: College basketball picks from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/aa932b9f-a643-4938-b0d4-c869d84f1d60/thumbnail/1200x675/318d63d9b67631a8ed3b0b8d643b791f/usatsi-27403575.jpg"
      ],
      "datePublished": "2025-11-03T00:55:02.000Z",
      "dateModified": "2025-11-03T00:55:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seahawks vs. Commanders anytime touchdown scorer props, back Zach Charbonnet on SNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-commanders-anytime-touchdown-scorer-picks-odds-predictions-charbonnet-to-score-td-snf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/1a76a455-dbf6-4ea4-b034-069654b7243a/thumbnail/1200x675/44add1c221c2e67a624297562ed78f04/zach-charbonnet-seahawks.jpg",
    "tag": "Sports",
    "date": "2025-11-02T19:55:42.000Z",
    "description": "\n        The Washington Commanders will host the Seattle Seahawks on Sunday Night Football, and the Commanders have a chance to go from one of the big",
    "body": "\n        The Washington Commanders will host the Seattle Seahawks on Sunday Night Football, and the Commanders have a chance to go from one of the biggest surprises in the NFL to one of the biggest disappointments in one season. The Commanders are 3-5 this season after their surprising run to the NFC Championship Game last year, and they'll have Jayden Daniels back to possibly provide a spark to Washington's offense. Daniels' presence helps both the pass and the run game, as defensive coordinators need to account for his rushing ability, which then creates lanes for running backs, and Jacory Croskey-Merritt was taking advantage of those opportunities earlier this season. Despite that Washington rookie running back being held out of the end zone in each of the last three weeks, the SportsLine model sees value in that changing, backing Croskey-Merritt at +135 odds in its Sunday Night Football anytime touchdown scorer bets when online sports betting.The model is also backing a pair of Seattle playmakers in its Sunday Night Football anytime TD scorer bets, projecting value in running back Zach Charbonnet and tight end AJ Barner to score in primetime. Barner has three touchdowns over his last four games, and with odds at 2-1 or longer at various sportsbooks, the model sees the 6-foot-6 tight end as a valuable option for Week 9 Sunday Night Football anytime TD scorer bets. Before making any Commanders vs. Seahawks picks or anytime touchdown scorer props at sportsbooks, be sure to see the Week 9 NFL predictions from SportsLine's proven model and see the latest NFL odds. They can also help new users take advantage of sportsbook promos like the latest Fanatics Sportsbook promo code, which allows new users to bet and get up to $2,000 in No Sweat Bets in FanCash.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has revealed its top Commanders vs. Seahawks anytime TD scorer prop picks for Sunday Night Football: Best Week 9 Seahawks vs. Commanders anytime TD prop picks:Zach Charbonnet, Seahawks (+110)Jacory Croskey-Merritt, Commanders (+135) MGMAJ Barner, Seahawks (+205) CaesarsParlay these picks for +1300 odds with a DraftKings promo code (odds subject to change). New users receive $300 in bonus bets if your first $5 bet wins, plus three months of NBA League Pass free:Zach Charbonnet, Seahawks (+110)Charbonnet had two touchdowns in Seattle's 27-19 win over the Texans in Week 7 before its bye, as he has four touchdowns over his last four games. He's scored in three of those four contests as the 6-foot-1 back is often the runner the Seahawks turn to near the goal line. The Commanders allowed two rushing touchdowns inside the 2-yard line last week, which would likely be Charbonnet territory on Sunday Night Football. Click here to play Carbonnet in Week 9 Sunday Night Football anytime TD scorer bets at FanDuel, where new users receive $300 in bonus bets if their first $5 bet wins. Jacory Croskey-Merritt, Commanders (+135)Washington had enough confidence in the seventh-round rookie that it traded veteran and reliable running back Brian Robinson Jr. before the season. Croskey-Merritt showcased why, especially early. He scored in two of his first three games, and he had four touchdowns over his first five games. The rookie has gone three straight games without a score, but the Seahawks have allowed a touchdown to a running back in three of their last four games. Click here to bet on Croskey-Merritt as a Sunday Night Football anytime TD scorer with the latest BetMGM promo code, which gives new users up to $1,500 back in bonus bets if your first $5 bet loses:AJ Barner, Seahawks (+205)The 6-6 tight end is tied for the team lead with four receiving touchdowns, with his size making him a top red-zone target for Sam Darnold. Despite only 18 receptions, which is 32 fewer than Jaxon Smith-Njigba, Barner is utilized where you want an anytime TD scorer to be. He has three touchdowns over his last four games and the Commanders have allowed five touchdowns to opposing tight ends, which is tied for the fifth-most in the league.Click here to bet on Barner as a Sunday Night Football anytime TD scorer with the latest Caesars Sportsbook promo code CBS20X, which gives new users 20 100% profit boost tokens with their first $1 bet.Want more Week 9 NFL picks?You've seen the model's NFL anytime touchdown scorer prop picks for Seahawks vs. Commanders in Week 9 Sunday Night Football. Now, get NFL Week 9 projections for every NFL spread, total and player prop at SportsLine.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seahawks vs. Commanders anytime touchdown scorer props, back Zach Charbonnet on SNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/1a76a455-dbf6-4ea4-b034-069654b7243a/thumbnail/1200x675/44add1c221c2e67a624297562ed78f04/zach-charbonnet-seahawks.jpg"
      ],
      "datePublished": "2025-11-02T19:55:42.000Z",
      "dateModified": "2025-11-02T19:55:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hugh Freeze fired by Auburn amid 15-19 record in three seasons coaching Tigers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/auburn-fires-coach-hugh-freeze-tigers-end-disappointing-tenure-after-dropping-to-1-5-in-sec-play-this-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/747890ef-66ac-404d-b547-63a81ee3049b/thumbnail/1200x675/8bb160c58a973575a5edbd40299a68c9/adobe-express-file-58.jpg",
    "tag": "Sports",
    "date": "2025-11-02T20:16:12.000Z",
    "description": "\n        Auburn is firing coach Hugh Freeze just one day after the Tigers mustered three points in a disappointing home loss to Kentucky, the program'",
    "body": "\n        Auburn is firing coach Hugh Freeze just one day after the Tigers mustered three points in a disappointing home loss to Kentucky, the program's fifth setback in six games this season against SEC competition, CBS Sports' Brandon Marcello, Matt Zenitz and Richard Johnson report. \"I have informed Coach Freeze of my decision to make a change in leadership with the Auburn Football program,\" Auburn athletic director John Cohen said in a statement released by the school. \"Coach Freeze is a man of integrity, and we are appreciative of his investment in Auburn and his relentless work over the last three years in bolstering our roster. Our expectations for Auburn Football are to annually compete for championships and the search for the next leader of Auburn Football begins immediately.\"The Tigers dropped to 1-5 in conference play in the middle of Freeze's third season with bowl hopes hanging by a thread at 4-5 overall with games against Vanderbilt, Mercer and Alabama remaining. Auburn had won 19 of its previous 20 matchups with Kentucky dating back to 1967.Defensive coordinator DJ Durkin will serve as the team's interim coach, Marcello reports. \nThis will be the third time since 2020 that the Tigers will be searching for a new coach, which means Auburn will be footing the bill for another sizable buyout as well.Freeze's buyout at Auburn is $15.4 million, almost identical to the total the Tigers paid out to Bryan Harsin eight games into his second season in 2022 amid inner program failures and on-field struggles. Freeze signed a six-year deal that same year worth $39 million.Firing chants from the student section broke out during Auburn's loss to Kentucky and lingered even after the final whistle. The Wildcats notched seven sacks against a sputtering offense led by Stanford transfer Ashton Daniels, who made his first start for Auburn amid season-long issues with Jackson Arnold.\nIn short, Freeze's new-look offense infused with portal talent never got off the ground in 2025. After strong efforts on the recruiting trail in recent years, Auburn's 2026 efforts have been poor; what on Sunday was a 14-man class was tracking to be the school's worst in the 247Sports era (2010-). \"I wish I could ask for patience, but that's not really something people want to give in this day and time, but I understand that,\" Freeze said after the game in his plea to fans. \"I just know we're so dang close, and if we had a few things go our way earlier in the year, we're looking at a whole different deal. But it didn't, and that's life. And that's the game of football and it teaches us a lot of great things and a lot of tough things. We'll get up and go get ready for the next one.\"I'd love for their patience. But I understand that you're probably not getting patience from them, because they want to see a better product on the field and so do I. So, I understand it.\"\nAuburn lost at least four games during SEC play in each of Freeze's seasons, which set a new low mark for the program. Freeze leaves Auburn with a 15-19 overall record, including a 6-16 showing in conference play. That's the worst three-year start for an Auburn coach since 1951-53, when Ralph Jordan went 14-16-1. Jordan, a College Football Hall of Famer, showed progress in that third year with a 7-3-1 record, though, and led the Tigers until he retired following the 1975 season. Freeze is also the first Auburn coach since 1950 to last at least three seasons without a winning record against league opponents. \nFreeze's tenure as Auburn coach SeasonOverall recordSEC recordBowl20236-73-5Music City Bowl (13-31 vs. Maryland)20245-72-6No bowl20254-51-5--Auburn entered the 2025 season with lofty expectations thanks to Freeze's recruiting efforts and what appeared to be -- on paper, at least -- an improved offense. The Tigers boasted one of college football's deepest wide receiver rooms, highlighted by stars like Cam Coleman and top transfer addition Eric Singleton. They also took a big swing by landing former five-star prospect and Oklahoma starter Jackson Arnold at quarterback. Auburn even climbed as high as No. 22 in the AP Top 25 amid a 3-0 start in nonconference play, highlighted by an impressive road win against Baylor in which the Tigers scored 38 points. Then, they hit a wall. They failed to score 20 points in each of their first four SEC games. Arnold went three straight games, from Auburn's Sept. 27 loss to Texas A&M to its loss against Missouri, without a single passing touchdown. Arnold was also benched against Arkansas, as the Tigers turned to former Stanford transfer Ashton Daniels late in the first half. Auburn is the third SEC school to make a midseason coaching change in 2025, following in the footsteps of the Razorbacks, which moved on from Sam Pittman on Sept. 28, and Florida, which fired Billy Napier two weeks ago. High on Auburn's board? Jon SumrallSumrall is one of the fastest-rising coaches in college football after sensational coaching jobs at Troy and Tulane. He is high on the team's early hot board, according to CBS Sports' Brandon Marcello. The Huntsville, Alabama, native took over a Troy program coming off three straight losing seasons and quickly flipped them into a winner, posting a 23-4 record with two Sun Belt titles in two seasons. The next year, he went to Tulane and led the program to the American title game with a 8-5 record, including 7-1 in American play. The former Kentucky linebacker has deep experience in the SEC, working as defensive coordinator under Mark Stoops and linebackers coach at Ole Miss. He has built physical defensive teams that control games but has consistently found great offensive coordinators and players as a head coach, including quarterback Darian Mensah, running back Makhi Hughes and running back Kimani Vidal. -- Shehan JeyarajahWhat's next for Freeze?The 56-year-old is a controversial college football figure whose long track record of success feels more distant with each blunder he makes (coaches across the country still cannot figure out why Freeze refused to reevaluate a collaborative play-calling approach). Be skeptical there's much of a market for Freeze as a head coach moving forward -- and it's also unclear if Freeze will want to coach again any time soon. Freeze was diagnosed with prostate cancer in February and is currently undergoing treatment. Doctors caught it early and he opted against immediate surgery to have the mass removed. That's because the cancer was deemed low aggressive, per Freeze. He said back in the summer he planned to reevaluate his health in January.As for a potential future in coaching, maybe Freeze could emerge as a candidate at a G-5 program. He found outsized success in past stints at Arkansas State and Liberty. But checking with industry sources, it's hard to see Freeze making an immediate return as a Power Four head coach. He won't have the cachet of Franklin or a Kelly, and his baggage is immense. -- Chris Hummer\n    \n                                        \n    The Auburn Tigers are searching for their next head football coach following the dismissal of Hugh Freeze. AuburnUndercover has the most experienced experts and insiders covering the Tigers on the ground in Auburn. Know the news before it happens with this coaching search by signing up for a VIP membership today. In addition, you'll get team news, recruiting, transfer portal scoop, analysis and more along with interacting with the most dedicated community of Auburn fans. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hugh Freeze fired by Auburn amid 15-19 record in three seasons coaching Tigers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/747890ef-66ac-404d-b547-63a81ee3049b/thumbnail/1200x675/8bb160c58a973575a5edbd40299a68c9/adobe-express-file-58.jpg"
      ],
      "datePublished": "2025-11-02T20:16:12.000Z",
      "dateModified": "2025-11-02T20:16:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]