[
  {
    "title": "Computer model locks in 49ers vs. Eagles picks, score prediction, SGP - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-vs-49ers-where-to-watch-nfl-wild-card-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/f473b37b-014b-4b74-8484-fe92e1045001/thumbnail/1200x675/2e0420b47f4891e7b7859b429bc3711e/jalen-hurts-philadelphia-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-11T20:40:02.000Z",
    "description": "\nFamiliar foes meet on Super Wild Card Weekend on Sunday, Jan. 11, when the San Francisco 49ers visit the Philadelphia Eagles. The 49ers had a chance ",
    "body": "\nFamiliar foes meet on Super Wild Card Weekend on Sunday, Jan. 11, when the San Francisco 49ers visit the Philadelphia Eagles. The 49ers had a chance at the No. 1 seed in the conference but lost to the Seahawks in Week 18 and are now the No. 6 seed. The Eagles, who are defending Super Bowl champions, could've been the No. 2 seed if they won in Week 18 but chose to rest their starters instead and are now the No. 3 seed. The Eagles won this matchup in the playoffs in 2022 thanks in part to Brock Purdy's in-game injury, which pushed the NFL to change rules to now require teams to carry an emergency quarterback.Kickoff from Lincoln Financial Field in Philadelphia is set for 4:30 p.m. ET. The Eagles are 5.5-point favorites in the latest 49ers vs. Eagles odds on DraftKings Sportsbook, and the total comes in at 43.5. Before making any Eagles vs. 49ers picks of your own, you have to see the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch 49ers vs. Eagles on SundayWhen: Sunday, Jan. 11Time: 4:30 p.m. ETTV: FOXFollow along: CBS Sports App49ers vs. Eagles betting previewOdds: Eagles -5.5, over/under 43.5The Eagles were just 8-7 ATS as favorites this season and 4-4 ATS at home. The 49ers finished 10-6-1 ATS but were 2-4 ATS as underdogs and 1-2 ATS as road underdogs. Philadelphia was 7-10 to the Over while San Francisco was 10-6-1 to the Over.49ers vs. Eagles SGPEagles -5.5Over 43.5Saquon Barkley anytime touchdown scorerBet it at DraftKings:\nModel's 49ers vs. Eagles score prediction, picksThe SportsLine Projection Model has the 49ers covering the spread in 51% of simulations, and says the 49ers offer value on the money line as they win in 37% of simulations as +215 underdogs. The Over hits in 54% of simulations on 44.5.49ers vs. Eagles score prediction: Eagles 27, 49ers 21\nWant more NFL playoff picks?You've seen the model's best bets for San Francisco 49ers vs. Philadelphia Eagles. Now, get against the spread, total and money-line picks for every NFL playoff game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in 49ers vs. Eagles picks, score prediction, SGP - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/f473b37b-014b-4b74-8484-fe92e1045001/thumbnail/1200x675/2e0420b47f4891e7b7859b429bc3711e/jalen-hurts-philadelphia-eagles-imagn-images.jpg"
      ],
      "datePublished": "2026-01-11T20:40:02.000Z",
      "dateModified": "2026-01-11T20:40:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. 49ers prediction, odds, time: 2026 Wild Card NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-49ers-prediction-odds-spread-time-nfl-wild-card-sunday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/2a54d926-522b-476e-9805-ac382c2c54dd/thumbnail/1200x675/58a947ba81adef4f8e3da4f32af7908a/brock-purdy-49ers.jpg",
    "tag": "Sports",
    "date": "2026-01-11T20:13:21.000Z",
    "description": "\nThe Philadelphia Eagles will host the San Francisco 49ers on NFL Wild Card Sunday, with both teams having aspirations of, again, making deep postseas",
    "body": "\nThe Philadelphia Eagles will host the San Francisco 49ers on NFL Wild Card Sunday, with both teams having aspirations of, again, making deep postseason runs. These two have combined for five Super Bowl trips over the last eight years, including representing the NFC in each of the last three seasons. Philly (11-6) is the No. 3 seed after claiming the NFC East, and the Eagles have won four straight playoff games under Jalen Hurts. San Fran (12-5) is the 6-seed and saw a six-game win streak end with a defeat to Seattle last Saturday. The Over is 6-3 for San Fran over its last nine games, while the Under is 7-2 over the last nine Philadelphia contests.Kickoff is at 4:30 p.m. ET from Lincoln Financial Field in Philadelphia. The Niners won the last matchup, which came in the 2023 season. The latest 49ers vs. Eagles odds from DraftKings Sportsbook list Philadelphia as a 5.5-point favorite, an increase from Philly opening as 3.5-point favorites. Meanwhile, the over/under for total points is 44.5. San Fran is 11-6 against the spread this season, while Philly is 10-7 versus the line. Before making any Eagles vs. 49ers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on 49ers vs. Eagles. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Eagles vs. Niners:\n49ers vs. Eagles                                                                    spreadEagles -5.5 at DraftKings Sportsbook49ers vs. Eagles                over/under44.5 points49ers vs. Eagles                                                                                                                                                                                money line Eagles -253, 49ers +20549ers vs. Eagles                                                                                                                                                                       picksSee picks at SportsLine49ers vs. Eagles                                                                                                                                                                          streaming Fubo (Try for free)   Why the 49ers can coverSan Fran last played on Saturday, giving it an extra day of rest which is pertinent as the Niners played on short weeks in both Weeks 17 and 18. Coming off a season finale loss to Seattle should also motivate San Francisco, which is 4-0 ATS following a loss this season, as well as 7-2 ATS on the road. When Sunday's game kicks off, the 49ers will have the better offense on the field as they lead the NFL in third-down offense, with additional top 10 rankings in points, total yards and redzone scoring. Brock Purdy elevates his game in the postseason, with seven total TDs versus just one interception in his playoffs career, while Christian McCaffrey is coming off the third 2,000-scrimmage yard season of his career and gets to face an Eagles defense which ranks No. 22 versus the run. See which team to back at SportsLine. Why the Eagles can coverHome field has certainly been an advantage for the Eagles who have won five straight postseason contests at Lincoln Financial Field, with 14 takeaways versus zero giveaways over this run. The turnover battle just happens to be San Francisco's biggest weakness, as it is -6 on the season, which is the worst turnover differential of any playoff team. The Eagles are also 6-2 ATS in home postseason games over the last decade, and the defense is playing its best at the most important point of the season. Not counting Week 18 when they rested their starters, the Eagles have allowed just 10 points per game over their last three, holding opponents to only 3.6 yards per rush and not allowing a single passing TD over this stretch. The Niners' offense, meanwhile, is one-dimensional as it ranks 30th in the league in yards per carry. See which team to back at SportsLine.How to make Eagles vs. 49ers   picksSportsLine's model has simulated 49ers vs. Eagles 10,000 times and is going Over on the total, projecting 48 combined points. It also says one side of the spread has all of the value. You can only get the pick at SportsLine. So who wins Eagles vs. 49ers, and which side of the spread has all of the value? Visit SportsLine now to see which side of the 49ers vs. Eagles spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. 49ers prediction, odds, time: 2026 Wild Card NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/2a54d926-522b-476e-9805-ac382c2c54dd/thumbnail/1200x675/58a947ba81adef4f8e3da4f32af7908a/brock-purdy-49ers.jpg"
      ],
      "datePublished": "2026-01-11T20:13:21.000Z",
      "dateModified": "2026-01-11T20:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chargers vs. Patriots prediction, odds: 2026 Wild Card Weekend NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-chargers-prediction-odds-2026-nfl-wild-card-spread-sunday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/af15d466-7a17-4aa3-abe4-99ee3023f0a7/thumbnail/1200x675/39decae563f755453fae6d95a6fc4e18/maye-and-diggs.jpg",
    "tag": "Sports",
    "date": "2026-01-11T23:56:47.000Z",
    "description": "\nThe seventh-seeded Los Angeles Chargers battle the second-seeded New England Patriots in a 2026 Wild Card Weekend matchup on 'Sunday Night Football.'",
    "body": "\nThe seventh-seeded Los Angeles Chargers battle the second-seeded New England Patriots in a 2026 Wild Card Weekend matchup on 'Sunday Night Football.' Los Angeles is coming off a 19-3 loss at Denver in Week 18, while New England cruised to a 38-10 win over the Miami Dolphins. The Chargers (11-6), who finished second in the AFC West, are 5-3 on the road this season. The Patriots (14-3), who were champions of the AFC East, are 6-3 on their home field. Omarion Hampton (ankle) is active for Los Angeles, as is Kayshon Boutte (hamstring) for New England.Kickoff from Gillette Stadium in Foxborough, Mass., is set for 8 p.m. ET. The Pats lead the all-time series 27-17-2, including a 3-1 edge in the postseason. The Patriots are 3.5-point favorites in the latest Chargers vs. Patriots odds, while the over/under for total points scored is 45.5 via DraftKings Sportsbooks. New England is at -198 on the money line (risk $198 to win $100), with L.A. priced at +164 (risk $100 to win $164). Before making any Patriots vs. Chargers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.    Now, the model has set its sights on Chargers vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Patriots vs. Chargers:\nChargers vs. Patriots                                                                                         spreadNew England -3.5 at DraftKings SportsbookChargers vs. Patriots                                     over/under45.5 pointsChargers vs. Patriots                                                                                                                                                                                                     money line New England -198, Chargers +164Chargers vs. Patriots                                                                                                                                                                                             picksSee picks at SportsLineChargers vs. Patriots                                                                                                                                                                                               streaming Fubo (Try for free)  Why the Patriots can coverNew England is led by second-year quarterback Drake Maye. The third pick in the 2024 NFL Draft played in 17 games this season, completing 72% of his passes for 4,394 yards and 31 touchdowns with eight interceptions and a 113.5 rating. He also rushed 103 times for 450 yards and four touchdowns. In a 28-24 win at Baltimore on Dec. 21, he completed 31 of 44 passes for 380 yards and two touchdowns with one interception. He also rushed 10 times for 25 yards.His top target was veteran wide receiver Stefon Diggs. In 17 games, Diggs caught 85 passes for 1,013 yards (11.9 average) and four touchdowns. He had 17 explosive plays of 20 yards or more, including a long of 34, with 354 yards after the catch and 51 first-down conversions. In a 42-10 win over the New York Jets on Dec. 28, he caught six passes for 101 yards and a score. The veteran has 909 receiving yards across his 14-game postseason career. See which team to back at SportsLine. Why the Chargers can coverVeteran quarterback Justin Herbert leads the Los   Angeles offense. In 16 games this season, he completed 66.4% of his passes for 3,727 yards and 26 touchdowns with 13 interceptions and a 94.1 rating. He also rushed 83 times for 498 yards and two touchdowns. In a 34-17 win at Dallas on Dec. 21, he completed 23 of 29 passes for 300 yards and two scores.Among his top targets is second-year veteran Ladd McConkey. In 16 games this season, he caught 66 passes for 789 yards (12.0 average) and six touchdowns. He had eight explosive plays of 20 yards or more, including a long of 58, with 310 yards after the catch and 35 first-down conversions. In the win at Dallas, he caught four passes for 43 yards and a score. McConkey also had a highly impressive postseason debut last year, posting a 9-197-1 stat line in his lone game. See which team to back at SportsLine.How to make Chargers vs. Patriots picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can only get the pick at SportsLine. So who wins Patriots vs. Chargers, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Chargers vs. Patriots spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chargers vs. Patriots prediction, odds: 2026 Wild Card Weekend NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/af15d466-7a17-4aa3-abe4-99ee3023f0a7/thumbnail/1200x675/39decae563f755453fae6d95a6fc4e18/maye-and-diggs.jpg"
      ],
      "datePublished": "2026-01-11T23:56:47.000Z",
      "dateModified": "2026-01-11T23:56:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the LSU Tigers rebounded from bad SEC start to ruin Texas' undefeated season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/lsu-womens-basketball-upset-texas-end-longhorns-undefeated-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/8acc9858-d2ef-4544-9ab4-4179e3bff5db/thumbnail/1200x675/22169155fd97aed453ce62a61c276816/lsu-texas-mikaylah-williams.png",
    "tag": "Sports",
    "date": "2026-01-12T00:24:39.000Z",
    "description": "\n        After a 0-2 start in SEC play, the No. 12 LSU Tigers shook off all doubts with a statement 70-65 victory over No. 2 Texas on Sunday. This was",
    "body": "\n        After a 0-2 start in SEC play, the No. 12 LSU Tigers shook off all doubts with a statement 70-65 victory over No. 2 Texas on Sunday. This was the Longhorns' first loss of the season, and also LSU's first win over an AP top two team since 2008.\"I'm sure you've heard, but coach (Kim) Mulkey says she wants us to be tough,\" Mikaylah Williams said in her postgame broadcast interview. \"And I think that's something we've really taken pride in after those first two losses. Being tough, sticking together and playing hard. That's something that we've done and that's something we've been successful at so far.\"The sold-out crowd in Baton Rouge was electric all 40 minutes, but they exploded when Williams practically sealed the deal with a three-pointer that made it a three-possession game with just 1:18 remaining. This was just another example of the impact she had on Sunday. She had a complete performance that included 20 points, 7 rebounds, 4 assists and 5 steals.\nHere is a closer look at how LSU upset Texas:A stifling defense that shut down Rori HarmonThe Tigers got off to a rough start offensively as they went just 7 of 26 from the field, but their defense made sure Texas didn't get hot either. \nLSU held the Longhorns to 25 points in the first two quarters, which is their lowest scoring half this season. Although Texas has one of the top assists/turnover ratios in the country, the team finished Sunday with a season-high 17 turnovers and just 9 assists.Jordan Lee has been one of the most consistent players for Texas, but she only made three field goals all day. Meanwhile, point guard Rori Harmon had just two points, going 1 of 7 from the field. Harmon sat out the entire fourth quarter after Vic Schaefer decided to go with Bryanna Preston.\nLimiting Madison Booker, especially in the first halfBooker was the spark for a Texas comeback attempt in the fourth quarter, but despite finishing the day with 24 points on 10 of 16 shooting, those stats don't tell the whole story. LSU's defense, with Williams being a key part of it, limited Booker to just four points and three turnovers in the first half. She also had two fouls in those first two quarters and was dangerously close to fouling out as she picked up her fourth early in the fourth quarter.\nDespite the loss, Booker is already thinking about how to lock in and bounce back when the Longhorns take on South Carolina.\"Coach said it, we are not ready for Thursday,\" Booker said postgame. \"We are still going to come no matter what, but we have to get ready. We have to prepare again and we have to try to fix our mistakes.\"Fighting for reboundsLSU no longer has Angel Reese or Aneesah Morrow to take over in the rebounding category. Kim Mulkey has been talking all season about how she wants the whole team to make a conscious effort in this area, and they did just that against Texas. LSU won the battle on the boards 44-35, which means the Tigers' grueling practices have paid off.\n\"We've had practices with a rebound bubble on, so the ball can't go in so you have to rebound,\" Williams said postgame. \"If you didn't get it, there was running involved. \"I'm proud of how we rebounded today.\"\nShowcasing depth, with five players scored in double digitsWilliams was the star of the show on Sunday, but there were multiple Tigers who stepped up during big moments. Four other LSU players joined her in the double-digit club with 10 points each, including Jada Richard, who hit a stunning buzzer-beater at the end of the second quarter following a steal and dime from Williams.\nFlau'jae Johnson was coming off her highest scoring game of the season in the win against Georgia. She only made four field goals against Texas but her impact was still felt throughout the game. When the Longhorns were working on a comeback, Johnson got an and-one with 7:15 remaining to keep injecting energy into her team and the crowd. The 5-foot-10 guard also got the crowd going with a block against 6-foot-6 center Kyla Oldacre later in the fourth quarter.\nMaLaysia Fulwiley is still cleaning up aspects of her games, but her moves also make the game exciting. Another key bench player is ZaKiyah Johnson, who Richard described her as a \"dog\" postgame.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the LSU Tigers rebounded from bad SEC start to ruin Texas' undefeated season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/8acc9858-d2ef-4544-9ab4-4179e3bff5db/thumbnail/1200x675/22169155fd97aed453ce62a61c276816/lsu-texas-mikaylah-williams.png"
      ],
      "datePublished": "2026-01-12T00:24:39.000Z",
      "dateModified": "2026-01-12T00:24:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Yankees at 'impasse' with Bellinger; Red Sox likely to pivot to Bichette - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-yankees-cody-bellinger-red-sox-alex-bregman-bo-bichette/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/3a9e22ce-4c03-4f5b-a96b-c0e7e68327e5/thumbnail/1200x675/dc2899a77df5682ceb110a2331f8b32e/bellinger-getty-2.png",
    "tag": "Sports",
    "date": "2026-01-11T20:51:28.000Z",
    "description": "\n        The Cubs and Alex Bregman have agreed to a five-year, $175 million deal. Still, three of the top four free agents and seven of the top 14 rem",
    "body": "\n        The Cubs and Alex Bregman have agreed to a five-year, $175 million deal. Still, three of the top four free agents and seven of the top 14 remain unsigned, meaning there's plenty of work for the Major League Baseball offseason. Given that we're staring down the middle of January, that's a bit late. Let's hit up that rumor mill on this fine Sunday, right? Yankees, Bellinger at impasseAny contract negotiations between the Yankees and All-Star outfielder Cody Bellinger are \"at an impasse,\" reports ESPN. Perhaps more importantly, the Yankees, who were previously of the mindset that Bellinger was attainable, are now reportedly  looking toward 2026 under the belief that they won't have Bellinger. The Yankees have reportedly offered Bellinger a five-year deal worth at least $150 million. He is still searching for longer terms.In 152 games for the Yankees last season, Bellinger hit .272/.334/.480 (125 OPS+) with 29 homers, 98 RBI and 5.1 WAR. Red Sox turn focus to BichetteThrough much of the offseason, we've heard that the top priority for the Red Sox was retaining Bregman. Now that he's signed elsewhere, the spotlight shines on the Red Sox. The Athletic points out that the five-year deal he took with the Cubs \"ffurther highlighted the club's aversion to long-term deals for players over the age of 30.\" \nSomeone who is under 30? Bo Bichette. The 27-year-old infielder is \"likely to be their primary target,\" in the wake of Bregman signing elsewhere, per The Athletic. Ditto from the Boston Globe, which says, again, Bichette is likely to be their primary target. It's safe to say we'll see plenty of Bichette/Red Sox rumors in the next few days. They won't be alone, though, as Bregman is off the board and the Diamondbacks are no longer expected to trade Ketel Marte. There is now one All Star-caliber infielder available on the free-agent market and it's Bichette.In 139 regular-season games last year, Bichette hit .311/.357/.483 (129 OPS+) with 44 doubles, 18 homers, 94 RBI and 3.5 WAR.\nReds sign relieverThe Reds have agreed to terms with free-agent reliever Pierce Johnson, according to The Athletic. Johnson, a 34-year-old right-hander, had a 3.05 ERA and 1.20 WHIP with 59 strikeouts in 59 innings last season for the Braves. He'll likely serve as one of the setup men for closer Emilio Pagán.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Yankees at 'impasse' with Bellinger; Red Sox likely to pivot to Bichette - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/3a9e22ce-4c03-4f5b-a96b-c0e7e68327e5/thumbnail/1200x675/dc2899a77df5682ceb110a2331f8b32e/bellinger-getty-2.png"
      ],
      "datePublished": "2026-01-11T20:51:28.000Z",
      "dateModified": "2026-01-11T20:51:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Matt Ryan addresses new role of Falcons' president of football, says goodbye to CBS Sports - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/matt-ryan-addresses-new-role-of-falcons-president-of-football-says-goodbye-to-cbs-sports/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/46ed5735-a324-4cea-b4b0-907620f765ed/thumbnail/1200x675/0aadb853979836c4229cfaa67fe45667/matt.jpg",
    "tag": "Sports",
    "date": "2026-01-11T20:09:14.000Z",
    "description": "\n        In his final appearance on \"The NFL Today,\" outgoing CBS Sports NFL analyst and former quarterback Matt Ryan spoke about his desire to reshap",
    "body": "\n        In his final appearance on \"The NFL Today,\" outgoing CBS Sports NFL analyst and former quarterback Matt Ryan spoke about his desire to reshape the Atlanta Falcons into a contender after accepting the franchise's new position of president of football.Atlanta hasn't made the playoffs since the 2017 season -- when Ryan was still quarterbacking. The Falcons say that Ryan will \"oversee all aspects of football for the organization,\" and that both the head coach and general manager, when hired, will report to him.\"You want to be in the mix, in the playoffs, and it's been too long there,\" Ryan said on Sunday's show. \"We're going to work really hard and find the right people to get us back into that position to be successful. You guys know it, football is about the people. The building is about the people, there's a lot of really good people in that building that are already there. It starts at the top with Arthur Blank and I'm fortunate to be in this position, excited about the opportunity and ready to get started.\"\nThe former NFL MVP served as a game analyst for one season with CBS Sports before transitioning to the studio on \"The NFL Today\" for the last two years. It's nearly impossible to decline a \"President of Football\" gig, but at the same time it wasn't easy for Ryan to walk away from his current role.\nRyan said that when he retired following the 2023 season there was a void that was created by leaving the game and no longer having teammates or that sense of belonging. Ryan spoke from the heart about the difficulty that can take place in filling that space, but Ryan expressed gratitude for having a new set of teammates at the network over the last three years. \"When I left [the Falcons] I was so lucky to be given the opportunity by [CBS Sports president] David Berson and by CBS to become a part of this team.\"\nRyan played 15 NFL seasons, 14 with the Falcons and one with the Indianapolis Colts. He is the Falcons' all-time leader in passing yards (59,735), passing touchdowns (367) and games won (120). Ryan made four Pro Bowls, and was named NFL MVP in 2016 after throwing for 4,944 yards, 38 touchdowns and seven interceptions.\n\"Throughout his remarkable 14-year career in Atlanta, Matt's leadership, attention to detail, knowledge of the game and unrelenting drive to win made him the most successful player in our franchise's history,\" team owner Arthur Blank said in a statement. \"I am confident those same qualities will be a tremendous benefit to our organization as he steps into this new role. From his playing days to his time as an analyst at CBS, Matt has always been a student of the game, and he brings an astute understanding of today's NFL, as well as unique knowledge of our organization and this market. I have full confidence and trust in Matt as we strive to deliver a championship caliber team for Atlanta and Falcons fans everywhere.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Matt Ryan addresses new role of Falcons' president of football, says goodbye to CBS Sports - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/46ed5735-a324-4cea-b4b0-907620f765ed/thumbnail/1200x675/0aadb853979836c4229cfaa67fe45667/matt.jpg"
      ],
      "datePublished": "2026-01-11T20:09:14.000Z",
      "dateModified": "2026-01-11T20:09:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hornets' runaway romp leads to a historically bad stat for Jazz' Cody Williams - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/how-historic-was-the-hornets-beatdown-of-the-jazz-this-one-stat-shows-just-how-eye-popping-the-win-was/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/80d452bd-9d7a-4f6c-8107-ded28acfd10e/thumbnail/1200x675/d9c4245fb9c49cdb20fef0f4e7774cc9/charlotte-hornets.jpg",
    "tag": "Sports",
    "date": "2026-01-12T01:23:14.000Z",
    "description": "\n        The Charlotte Hornets handed out a demoralizing 150-95 beatdown to the Utah Jazz Saturday night, which even if there weren't NFL playoff game",
    "body": "\n        The Charlotte Hornets handed out a demoralizing 150-95 beatdown to the Utah Jazz Saturday night, which even if there weren't NFL playoff games going on still probably wouldn't garnered a ton of attention. Given both teams have losing records and likely will be headed back to the draft lottery again in the spring, there's not going to be a ton of interest in a matchup between these two squads.But the final score is enough to want to dig into things and ask, \"Wow, what happened?\" In short, the Hornets were just automatic on offense. They took 59 3s and and made 40% of them. They shot 52.5% from the floor over the entire game. It wasn't a case of a single player going off for a massive stat line, no every member of the Hornets who played -- which was literally every active player on the roster -- put up points. Nine players scored in double figures for the Hornets, with only one player, Tre Mann, eclipsing the 20-point mark. Meanwhile, the Jazz couldn't buy a bucket from beyond the arc, shooting an abysmal 22.6% from deep. And when you're trading 2s for 3s on the other end, things can get out of hand quickly.But the final score doesn't really do it justice for how jaw-dropping this win was for the Hornets. To give it even more context, second-year forward Cody Williams, who played 33 minutes for the Jazz, finished the game with a plus-minus of -60. For those unaware, plus-minus tells us how a team does when that specific player is on the floor. So a positive number signals that the team is outscoring their opponent by that much when that player is on the court, a negative number means their team is getting outscored by that amount. Williams played the most of any other player for Utah, so with him on the floor the Jazz were basically getting outscored by 60 points.With the final score being what it was, yep, that's pretty accurate. Williams' terrible feat makes it the worst single game plus-minus in NBA history, beating the previous record of -58, which was held by both Jeremiah Robinson-Earl and Scoot Henderson. \nPlayerDate+/-Cody Williams (Utah Jazz)1/10/2026-60Jeremiah Robinson-Earl (New Orleans Pelicans)4/11/2025-58Scoot Henderson (Portland Trail Blazers)3/29/2024-58Manny Harris (Cleveland Cavaliers)1/11/2011-57Keion Brooks Jr. (New Orleans Pelicans)4/11/2025-56The NBA didn't start tracking play-by-play data until the 1996-97 season, so it certainly leaves room for there to be an even worse mark prior to that. But Williams now holds the new record in the play-by-play era, a record no player wants to hold.As bad as the Jazz played defensively, though, because there was no single player who took over on offense for the Hornets, there's no record setting plus-minus number on Charlotte's side. The highest plus-minus is from Moussa Diabate who had a +38 plus-minus. But that doesn't come close to the single game all-time record. That feat goes to Luc Mbah a Moute during the 2017-18 season, when he recorded a +57 plus-minus after playing 26 minutes and putting up 13 points, four rebounds and four steals. PlayerDate+/-Luc Mbah a Moute (Houston Rockets)11/22/2017+57Gary Trent Jr. (Toronto Raptors)4/2/2021+54Oso Ighodaro (Phoenix Suns)11/13/2025+52Santi Aldama (Memphis Grizzlies)12/2/2021+52Joe Smith (Minnesota Timberwolves)11/8/2001+52That may come as a surprise to many who might've expected someone like Nikola Jokic or another ultra efficient offensive engine to hold that record, but plus-minus goes far beyond just counting stats. It takes into account things that don't show up on a boxscore, like well-timed screens that lead to a bucket, making the right reads defensively or making the extra pass to set up a teammate on offense. It shows which players make the most impact on both ends of the floor beyond just scoring, grabbing rebounds or dishing out assists.\nUnfortunately for Williams, despite putting up 15 points in the loss, he wasn't helping the Jazz in other areas that translated to winning. But no one on Utah's team was, so while he will hold the record, every member of the Jazz should wear this badge of dishonor and let it motivate them to ensure a performance like this never happens again. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hornets' runaway romp leads to a historically bad stat for Jazz' Cody Williams - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/80d452bd-9d7a-4f6c-8107-ded28acfd10e/thumbnail/1200x675/d9c4245fb9c49cdb20fef0f4e7774cc9/charlotte-hornets.jpg"
      ],
      "datePublished": "2026-01-12T01:23:14.000Z",
      "dateModified": "2026-01-12T01:23:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USMNT's Josh Sargent reportedly in talks to join Toronto FC from Norwich - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/usmnt-josh-sargent-transfer-toronto-fc-mls-norwich-city/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/a286dc9d-4582-4648-aaea-db2828605f97/thumbnail/1200x675/3ab0dbb46dbf072a36f8cfcbb9e22bb0/norwich.jpg",
    "tag": "Sports",
    "date": "2026-01-11T19:30:24.000Z",
    "description": "\n        Forward Josh Sargent is nearing a transfer to MLS' Toronto FC after a four-and-a-half-year spell in England with Norwich City in a move that ",
    "body": "\n        Forward Josh Sargent is nearing a transfer to MLS' Toronto FC after a four-and-a-half-year spell in England with Norwich City in a move that could be notable as the race to crack the U.S. men's national team's World Cup squad enters its final months, according to reports.Toronto sent a bid worth $18 million to Norwich for Sargent's services, per Fabrizio Romano, with negotiations currently underway for a transfer. Sargent missed the Canaries' 5-1 win against Walsall in the FA Cup on Sunday in a decision of his own making – manager Philippe Clement said post-match that Sargent texted him on Saturday evening to rule himself out of the match as the transfer process gets underway.\"Josh sent me a message [on Saturday] evening saying he would not be available because of transfer things in his head,\" Clement said. \"This is obviously not something we want, and will have consequences. It is something we need to speak about inside the club, but the club has made it really clear to Josh and his agent that he will not be leaving during this transfer window.\"Sargent was previously the subject of a move to Wolfsburg over the summer but the 25-year-old went on to turn the German club down, per The Athletic.The American has been a meaningful member of Norwich's attack since joining from Werder Bremen ahead of the 2021-22 season, currently boasting 56 goals in 156 appearances across all competitions for the club. He scored four goals in his debut season for the club, during which they were relegated from the Premier League, but has since scored double-digit goals in each season for Canaries. He currently has eight goals this campaign and is the team's second-leading goalscorer in the Championship, where they are currently in the midst of a relegation battle and sit one point out of safety.\nSargent's World Cup chancesFor many of the last several years, Sargent has been a fixture for the USMNT but he has battled some long-term ankle injuries during that time that have limited his availability. Coupled with fitness issues, though, Sargent's national team tenure is starting to become defined by a dry spell – he has not scored for the USMNT since 2019, a stretch that includes a goalless run at the 2022 World Cup where he played in each of the team's group stage matches.He has had his opportunities to impress head coach Mauricio Pochettino, who took charge of his first match in Oct. 2024, but has seen his chances come and go. Sargent started twice for the USMNT since Pochettino took the helm,  a period in which he has taken just three shots in total and has not managed more than 19 touches in a match. The head coach also left Sargent off the 2025 Concacaf Gold Cup squad in what he described as a sporting decision, instead calling up lesser-experienced players like Patrick Agyemang, Paxten Aaronson, Damion Downs and Brian White as he explored the wider player pool.Where Sargent fits into the picture as the World Cup approaches is unclear. Pochettino seems to have settled on Folarin Balogun, Haji Wright and Ricardo Pepi as his preferred forwards and there may be room for more players but Sargent could have an opening. Pepi broke his arm in PSV's 5-1 win over Excelsior on Saturday and will spend two months on the sidelines, which could create an opening for Sargent to at least crack the U.S. roster in March for friendlies against Portugal and Belgium, for which Pepi might be unavailable.\nSargent will not be disadvantaged by a move to MLS, a league he will be playing in for the first time, since Pochettino has frequently pulled from the North American division's pool of talent. If Pepi is unavailable for the USMNT, though, that opening is not only Sargent's to take – Agyemang has emerged as a contender after making his national team debut at the start of 2025 and though he is not the highest up the depth chart, he has taken advantage of his opportunities with the national team in a way Sargent has not.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USMNT's Josh Sargent reportedly in talks to join Toronto FC from Norwich - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/a286dc9d-4582-4648-aaea-db2828605f97/thumbnail/1200x675/3ab0dbb46dbf072a36f8cfcbb9e22bb0/norwich.jpg"
      ],
      "datePublished": "2026-01-11T19:30:24.000Z",
      "dateModified": "2026-01-11T19:30:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wild Inter vs. Napoli match highlighted just how open Serie A race is - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nter-vs-napoli-game-score-serie-a-race-milan-juventus-roma-antonio-conte/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/8879a6e4-52e9-45f6-9b31-86c05394fa88/thumbnail/1200x675/4ba00a5bbe1793b88fe9149c332ab414/napoli.jpg",
    "tag": "Sports",
    "date": "2026-01-11T23:12:12.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If Sunday's Serie A clash between Inter and Napoli",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        If Sunday's Serie A clash between Inter and Napoli was meant to clarify who the frontrunner for the title is, it did the opposite. In fact, the eventful game that took place at San Siro showed us all the best skills of both sides, but also their issues. Inter weren't able to keep their advantage twice during the game, after scoring the opening goal of the night with Federico Dimarco before Scott McTominay's equalizer, and then again in the second half when the Scottish midfielder scored his second goal of the game after the penalty of Hakan Calhanoglu. It turned out to be a weekend that didn't change much for the title race as Cristian Chivu's team kept the three point advantage on AC Milan, which drew 1-1 at Fiorentina earlier on Sunday, and the four-point gap on Antonio Conte's side. We can now expect all three to compete until the very end of the season, and don't forget about AS Roma, just four points off the top. \nThe match between Inter and Napoli highlighted the Nerazzurri's struggles against Conte's side. Manuel Akanji was unable to contain Rasmus Højlund, and Inter's defense was particularly culpable for Napoli's second goal, when Akanji, Luis Henrique and Yann Bisseck all stood still and failed to react. Failing to protect their lead on two occasions was not what Chivu wanted, and the series of individual mistakes suggested Inter were maybe too nervous to see out such a crucial match, especially given their struggles against top opponents.There is no match between Inter and Napoli without Conte involved, as he received a red card in the second half after the penalty awarded to the home team. Conte was furious with the decision of the VAR to call the referee for a penalty, but his reaction showed again that this game will never be one like others for the former Inter manager. \nNapoli were able to play one of their best games of the season despite the injuries that are deeply affecting the roster, lastly the one of David Neres who couldn't travel to Milan on Sunday while Inter confirmed again their issues this season against the big teams, as they failed to win against Napoli both times (one draw, one defeat) and lost to AC Milan and Juventus in the first part of the season. AC Milan, meanwhile, drew twice over the past week but remain close to the top of the table and could benefit from the return of the Champions League next week, as both Inter and Napoli will play the final two matches of the league phase later this month. It's predictable that the two teams will lose some points in the coming weeks, and this is why their little margin can become a big factor in the near future. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild Inter vs. Napoli match highlighted just how open Serie A race is - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/8879a6e4-52e9-45f6-9b31-86c05394fa88/thumbnail/1200x675/4ba00a5bbe1793b88fe9149c332ab414/napoli.jpg"
      ],
      "datePublished": "2026-01-11T23:12:12.000Z",
      "dateModified": "2026-01-11T23:12:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eagles vs. 49ers where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eagles-vs-49ers-where-to-watch-pick-odds-prediction-nfc-wild-card/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/03/ceda6f4e-6530-49bb-9ba0-b07ca365aa27/thumbnail/1200x675/045e64aafaa681e1fb83a948841c44b5/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-11T19:20:33.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    The reigning champions open their playoff title defense against a familiar foe\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 11, 2026\n                            \n                    at\n    2:20 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Eagles and the 49ers have combined to represent the NFC in the last three (and five of the last eight) Super Bowls. Sunday, they'll face off against one another in a Wild Card Weekend clash in Philadelphia.The Eagles (No. 3 seed, 11-6) became the NFC East's first repeat champion in over two decades, but it was hardly a straightforward path getting there. Despite an even start offensively and a slow start defensively, Philadelphia reached 8-2 before three straight losses. The Eagles, though, got back on track with three straight wins before resting their starters in Week 18. The Eagles rank just 19th in points per game and are yet to get all their stars -- Jalen Hurts, Saquon Barkley, A.J. Brown and DeVonta Smith -- rolling at the same time. But the defense has been one of the NFL's best across the back half of the year, putting Nick Sirianni's team in strong position to defend its title.The 49ers (No. 6 seed, 12-5) have overcome injuries to just about every part of their roster to return to the playoffs after a one-year hiatus. Brock Purdy appeared in just nine games but has been terrific at times, including five total touchdowns in back-to-back games in Weeks 16 and 17 to help San Francisco clinch a playoff berth. Christian McCaffrey has been an absolute workhorse and one of the few stars who hasn't been injured: He recorded 2,126 yards from scrimmage on an NFL-high 413 touches this season and played in all 17 games for the first time since 2022. The 49ers defense is without Fred Warner, Nick Bosa and a host of others, leaving it in a shaky position, but the offense was one of the NFL's top units. Since Week 9, only the Los Angeles Rams' and Jacksonville Jaguars' offenses are averaging more points.\n\n        \n            \n                NFL Wild Card Weekend odds, predictions, expert picks: Best bets, where to watch, NFL playoffs, stream, more\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nThe 49ers will be looking to avenge a 31-7 NFC Championship game loss in Philadelphia three years ago. In that game, Purdy -- already San Francisco's third-string quarterback -- left with an injury, and journeyman Josh Johnson did the same shortly thereafter, forcing Purdy back into the game to simply hand the ball off. The 49ers won the teams' only other postseason meeting, a 14-0 affair back in 1996.Here's how to watch this game as well as betting information, keys to the matchup and a prediction.\nWhere to watch Eagles vs. 49ers liveDate: Sunday, Jan. 11 | Time: 4:30 p.m. ETLocation: Lincoln Financial Field -- Philadelphia, PennsylvaniaTV: Fox | Stream: Fubo (Try for free)Follow: CBS Sports AppOdds: Eagles -5.5, O/U 44.5 (via DraftKings)\nEagles vs. 49ers: Need to knowEagles defense shining. Entering their Week 9 bye, the Eagles defense had been struggling to stop the run and looking for answers at the outside cornerback spot opposite Quinyon Mitchell. Since then, though, they have been one of the best defenses in the league: seven in expected points added per play, success rate and explosive play rate. Philadelphia has been especially good on fourth down (32% conversion rate allowed) and goal-to-go efficiency (63% touchdown rate allowed) over that span, too. It starts up front with the Jalen Carter, Jordan Davis, Jalyx Hunt and Moro Ojomo, and behind them is a pair of terrific linebackers in Zack Baun and Nakobe Dean. Mitchell and slot cornerback Cooper DeJean have been excellent.Can 49ers get stops against inconsistent Eagles offense? The 49ers' defense is by far the weakest unit in this matchup. San Francisco is last in defensive success rate and defensive rushing success rate. It is dead last in sacks and tied for the second-fewest interceptions in the NFL. One would think that gives the Eagles' star-studded offense a major advantage, but Philadelphia's offense is just 24th in success rate and 25th in rushing success rate. The entire operation can get stagnant, and if that happens again Sunday, the 49ers might be able to string together some stops.Where will Kyle Shanahan attack? Shanahan does a tremendous job finding opportunities when it might at first look like there are none. Though the Eagles were better down the stretch, the defense is just 30th in rushing success rate; if the defense can keep it close, expect a heavy, heavy dose of McCaffrey. Also expect Shanahan to try to lean on George Kittle in the passing game, especially when he gets matched up on linebackers or safeties. Eagles defensive coordinator Vic Fangio can throw a curveball here or there, too.Eagles vs. 49ers pick, prediction\nThese are both teams with clear, major flaws. Interestingly their strengths (49ers' offense, Eagles' defense) and their weaknesses (Eagles' offense, 49ers' defense) will match up. Ultimately, though, Philadelphia has more than enough firepower -- even if it's inconsistent -- to get the job done against an undermanned San Francisco defense. Pick: Eagles -5.5, Over 44.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eagles vs. 49ers where to watch, live stream, kickoff time, prediction, odds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/03/ceda6f4e-6530-49bb-9ba0-b07ca365aa27/thumbnail/1200x675/045e64aafaa681e1fb83a948841c44b5/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-11T19:20:33.000Z",
      "dateModified": "2026-01-11T19:20:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Draft order: How Eagles, Packers playoff losses shake up first round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-draft-order-updated-top-picks-team-needs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/12/6ec3f706-7f4f-4854-bda0-5a28fc54f986/thumbnail/1200x675/28b10e7afc85c509c1c314138414ad23/a-j-brown.jpg",
    "tag": "Sports",
    "date": "2026-01-12T04:20:26.000Z",
    "description": "\n        The wild card round of the NFL Playoffs are underway. By Monday morning, three-quarters of the first round draft order will be known. It is j",
    "body": "\n        The wild card round of the NFL Playoffs are underway. By Monday morning, three-quarters of the first round draft order will be known. It is just one of two anticipated draft-related developments this week. Wednesday, Jan. 14 is the deadline for underclassmen not participating in the College Football Playoffs to declare for the 2026 NFL Draft. One of the biggest remaining questions is whether or not Oregon quarterback Dante Moore will declare.  The pieces are starting to come together and the 2026 NFL Draft is only a little more than three months away. Collegiate All-Star games will also begin late later this month. Invitations are going out to NFL Combine participants, but an official list will not be revealed until mid-February.     As a reminder, there are four teams -- Atlanta, Green Bay, Indianapolis and Jacksonville -- without a first-round pick in 2026 as a result of draft-day trades and the Micah Parsons and Sauce Gardner deals. \nHere is the current 2026 NFL Draft order (via Tankathon):1. Las Vegas Raiders (3-14)Las Vegas over-extended last offseason by drafting a running back in the top-10 and trading for a 35-year-old quarterback despite having one of the league's worst rosters. As a result, they fired head coach Pete Carroll after one season and are now picking even earlier in the draft. 2. New York Jets (3-14)The Jets finished with one of the worst records in the league, but at least they have a plan and put themselves in a position to change the course of their franchise. Over the next two years, New York has five first-round picks. 3. Arizona Cardinals (3-14)Arizona made the decision to part with head coach Jonathan Gannon. It would not be a surprise if they moved on from Kyler Murray as well. The problem is that there are not a wealth of options to replace Murray.\n4. Tennessee Titans (3-14)The positive momentum Tennessee had built over the past month came to a frustrating end in the season finale. Still, Cam Ward's strong finish to the 2025 campaign should give Titans fans hope.5. New York Giants (4-13)There are reasons to be optimistic about Jaxson Dart's future with the franchise. He brought life to an offense that could have easily wallowed in self-pity following the Malik Nabers and Andrew Thomas injuries. If they get the head coach hire right, then maybe the a bounce back will happen sooner than most would expect.   6. Cleveland Browns (5-12)The Browns made the decision to part with head coach Kevin Stefanski after six seasons. He did lead the franchise to its first playoff win post-expansion, but may not be any closer to identifying the quarterback of the future. \n7. Washington Commanders (5-12)Next season is an easy sell for Washington. If Jayden Daniels returns healthy, then they will be competitive once again, but there are a lot of needs on that roster. An attempt to microwave those weaknesses last offseason did not work out. 8. New Orleans Saints (6-11)The Saints' season ended just as fans were clamoring for more of Tyler Shough. He looks like the clear favorite to open next season as the starting quarterback, bringing a level of optimism that simply didn't exist earlier in the year.9. Kansas City Chiefs (6-11)Kansas City will enter next season in unfamiliar territory: the hungry underdog. Assuming Patrick Mahomes' full health, there is no reason to believe the Chiefs will not be in the mix again next season. They do have a deteriorating roster that desperately needs a youthful infusion. \n10. Cincinnati Bengals (6-11)Joe Burrow made a notable attempt to get the Bengals into the playoffs after succumbing to an injury early in the season, but ultimately fell short. The offense will be in a spot to compete next season, but can the defense improve enough this offseason to get them enough stops?\n        \n            \n                Renner's 2026 NFL mock draft 6.0: Raiders, Jets take QBs; Cowboys spend both top-20 picks on defense\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \n11. Miami Dolphins (7-10)Fans can say what they want about the Mike McDaniel era in Miami, but few had such a recognizable aesthetic as the Dolphins' former coach. It is a fresh start for the organization with a new general manager, new head coach and presumably a new quarterback.12. Dallas Cowboys (7-9-1)Dallas is once again searching for answers this offseason. Dak Prescott was healthy and the team still failed to reach the playoffs with a new head coach. \n13. Los Angeles Rams via Atlanta Falcons (8-9)Atlanta fired Raheem Morris as head coach for a second time. They sent their first round pick to Los Angeles as part of the trade up for James Pearce Jr. 14. Baltimore Ravens (8-9)For the first time since 2007, the Ravens will have a new head coach after firing John Harbaugh. It sounds as though the franchise chose Lamar Jackson -- who turned 29-years-old one day after Harbaugh's firing -- over the veteran coach. 15. Tampa Bay Buccaneers (8-9)Other organizations have been quick to make a head coaching change, but the Buccaneers are going down the path of firing coordinators rather than a change at the top. \n16. New York Jets via Indianapolis Colts (8-9)Cornerback Sauce Gardner struggled to stay healthy and the Colts' pick being sent to New York rose precipitously by the week. 17. Detroit Lions (9-8)The coaching drain that took place after last season's run was likely understated in the moment given the presence Dan Campbell has over that organization, but that, along with a few veteran offensive line departures, led to a much more tumultuous season.18. Minnesota Vikings (9-8)J.J. McCarthy's season was volatile, which was once the expectation for a young quarterback. Recent rookie performances from Jayden Daniels and C.J. Stroud set unrealistic expectations for the majority. Caleb Williams is proof that situation matters. \n19. Carolina Panthers (8-9)The team with the worst record in the NFL Playoffs, but also a home game, was the first punted from the postseason. Although not a desirable conclusion, the Panthers have to be pleased with how the season played out. 20. Dallas Cowboys via Green Bay Packers (9-7-1)The team with the second worst record in the NFL Playoffs was also dispatched after building a 21-3 lead over the division rival Bears. It is going to be an interesting offseason for the Packers. 21. Pittsburgh Steelers (10-7)The Steelers needed a Week 18 victory over the rival Ravens to get into the dance, but will have an opportunity to keep their season alive against Houston. \n22. Los Angeles Chargers (11-6)The Chargers are headed home for the season after falling to the Patriots in the wild card round.23. Philadelphia Eagles (11-6)A frustrating season, for fans and receivers alike, came to an end Sunday against the 49ers. The Eagles will be doing some soul searching this offseason. 24. Cleveland Browns via Jacksonville Jaguars (13-4)The Jaguars have every reason to celebrate their accomplishments this season. Yes, they lost in the wild card round as the home team, but a year ago, they were making preparations for the No. 5 overall pick. The future is bright for a team who played most of this season without No. 2 overall selection Travis Hunter.\n25. Chicago Bears (11-6)Chicago came back from an 18-point deficit to beat the rival Packers for the second time this season. Ben Johnson advances to the divisional round in his first season as head coach. 26. Buffalo Bills (12-5)Buffalo was the road team everyone in the AFC wanted to avoid, because Josh Allen has been battle tested in the playoffs. The Bills demonstrated why many felt that way Sunday.27. San Francisco 49ers (12-5)San Francisco overcame an injury to tight end George Kittle and enacted revenge over the Eagles for the NFC Championship game two years ago. 28. Houston Texans (12-5)Houston is one of the hottest teams in the NFL entering the postseason. It will put its nine-game win streak to the test against the Steelers. 29. Los Angeles Rams (12-5)The Rams took care of business on the road against the Panthers in the wild card round. 30. New England Patriots (14-3)The Patriots and Chargers have the \"Sunday Night Football\" game in the wild card round.31. Denver Broncos (14-3)The Broncos earned the No. 1 seed in the AFC West and a first-round bye with a victory over the Trey Lance-led Chargers in Week 18.32. Seattle Seahawks (14-3)Seattle clinched the NFC West crown and the top seed last week.The 2026 NFL Draft will take place April 23–25 in Pittsburgh. More draft coverage can be found at CBSSports.com, including weekly mock drafts and regular updates on eligible prospects.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Draft order: How Eagles, Packers playoff losses shake up first round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/12/6ec3f706-7f4f-4854-bda0-5a28fc54f986/thumbnail/1200x675/28b10e7afc85c509c1c314138414ad23/a-j-brown.jpg"
      ],
      "datePublished": "2026-01-12T04:20:26.000Z",
      "dateModified": "2026-01-12T04:20:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tomorrow's Top 25 college basketball rankings prediction: Iowa State moves up - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-projection-ap-top-25-iowa-state-uconn-michigan-arizona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/a38bc4e1-e541-46cb-8c16-8f19ec3ae6d6/thumbnail/1200x675/6f6c668d1aa0291ce744406fd11da22a/iowastatetop25.jpg",
    "tag": "Sports",
    "date": "2026-01-12T00:13:28.000Z",
    "description": "\n\n\n    \n                                    Iowa State and UConn stand to benefit from Michigan's first loss of the season in Monday's AP poll\n       ",
    "body": "\n\n\n    \n                                    Iowa State and UConn stand to benefit from Michigan's first loss of the season in Monday's AP poll\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 11, 2026\n                            \n                    at\n    7:13 pm ET\n                        \n                •\n            \n            6 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        A week of chaos in college basketball -- during which we saw 11 ranked teams suffer at least one loss and three teams suffer two losses -- guarantees that Monday's AP Top 25 poll will bring with it plenty of upheaval. The only sure thing going into Monday: No. 1 Arizona will remain No. 1, and it also might have the strongest grip on the ranking for any No. 1 team all season, to boot.Arizona's share of first-place votes has fallen each of the last three weeks -- from 42 to 38 to 32 last week -- as No. 2 Michigan made its case for No. 1 and ate into its hold on the spot. But Michigan's first loss of the season Saturday at home to Wisconsin as 19.5-point favorites means the runway is clear for the Wildcats to seize full control at No. 1. The most first-place votes a team has gotten this season was Purdue's 46 in Week 4. Arizona could and likely will enter that territory Monday.\nMichigan's loss also clears the way for undefeated Iowa State to move up one spot to No. 2 -- which would mark not just its highest ranking of the season but also tie its highest standing in the AP poll in program history. Only once has ISU ranked No. 2 in the poll -- and that came Week 11 of last season.\n        \n            \n                College basketball scores, winners, losers: Michigan loses first game, Nebraska tops Indiana, remains unbeaten\n                \n                    Kyle Boone                \n            \n                            \n    \n                \n                    \n    \nAs you can tell, Michigan's loss is the precipitating event that will cause this inevitable commotion Monday, and how AP voters handle the Wolverines in the poll is a mystery. My guess, however, is that Michigan -- 14-1 overall and still leading the sport in scoring margin -- will settle in ballots and remain somewhere inside the top five.\nIn fact, that's hardly the toughest decision for voters this week as they prep their ballots. Ten teams ranked 13th or worse suffered at least one loss this week. There is going to be plenty of shuffling in that area, and also perhaps some new teams enter the rankings because of it. Let's get to my projections below. 1\n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    Monday will be the fifth consecutive week for Arizona at No. 1 in the AP poll. It won twice vs. Big 12 foes by double figures this week to improve to 16-0 on the season.  Previous: 12\n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    Iowa State will move to No. 2 Monday, tying for its highest ranking in the AP poll in program history. It defeated  Oklahoma State  at home on Saturday 83-71 and is 16-0 on the season.  Previous: 33\n                            \n    \n                                                \n                    \n    \n        \n                            UConn\n                    \n    \n    Every AP Top 25 poll this season has included  UConn  in the top five -- and that won't change Monday. I have the Huskies moving up one spot to No. 3 this week, benefiting from Michigan's loss.  Previous: 44\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan\n                    \n    \n    Wisconsin made 15 3s in Ann Arbor Saturday and buried Michigan in a dazzling shooting performance. But it's Michigan's first loss of the season and it still has arguably the best overall resume in college hoops. Voters won't move Michigan past No. 5, and I have them settling at No. 4. Previous: 25\n                            \n    \n                                                \n                    \n    \n        \n                            Purdue\n                    \n    \n    Purdue could move up one spot if voters plunge Michigan an extra spot but I have the Boilermakers standing pat at No. 5 for a third-straight week. They beat  Washington  and  Penn State  at home to move to 15-1 this week. Previous: 56\n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    Wins over  Louisville  and  SMU  this week kept  Duke  perfect (4-0) in ACC play as it improved to 15-1 on the season overall. It isn't likely to break into the top five this week, though. I have voters keeping Duke at No. 6. Previous: 67\n                            \n    \n                                                \n                    \n    \n        \n                            Houston\n                    \n    \n    Houston  moved up one spot in last week's AP poll but is likely to stay put at No. 7 because of the gap between Duke, Purdue and others above it. It is knocking on the door to move up after another strong week with wins over  Texas Tech  and  Baylor. Previous: 78\n                            \n    \n                                                \n                    \n    \n        \n                            Gonzaga\n                    \n    \n    Now 17-1 on the season and riding a 10-game winning streak,  Gonzaga  -- top-10 in the poll for each of the last four updates -- will once again be in the top 10 Monday. Previous: 89\n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    With only one top-10 team losing this week,  BYU  -- despite a 12-game winning streak -- is likely staying put at No. 9 for another week. It has been top-10 in every poll this season but never been higher than No. 7. Previous: 910\n                            \n    \n                                                \n                    \n    \n        \n                            Nebraska\n                    \n    \n    Nebraska  erased a 16-point second-half deficit and beat  Indiana  on the road Saturday to keep its undefeated season (16-0) alive. Its top-10 status could be in jeopardy with  Vanderbilt's  strong week putting it in contention to leap the Cornhuskers. Previous: 1011\n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    I have Vanderbilt staying put at No. 11 but voters might flip it with Nebraska and put it at No. 10 after it beat No. 13  Alabama  on Wednesday and then downed  LSU  by 11 on Saturday. The Commodores are 16-0 -- matching their best start to a season in program history. Previous: 1112\n                            \n    \n                                                \n                    \n    \n        \n                            Michigan St.\n                    \n    \n    I have Michigan State staying put at No. 12 this week. There should be a lot of shuffling in the teens this week but the Spartans are safe here. Previous: 1213\n                            \n    \n                                                \n                    \n    \n        \n                            Illinois\n                    \n    \n    There should be a nice bump in line for  Illinois  in the poll after its perfect week wrapped with a road win over No. 19  Iowa , 75-69, on Sunday. Previous: 1614\n                            \n    \n                                                \n                    \n    \n        \n                            N. Carolina\n                    \n    \n    North Carolina  played just once this week and took care of business at home vs.  Wake Forest . It is 14-2 overall and should jump back into the top-15. Previous: 1715\n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    A close home loss to a top-10 Houston team and a road win over  Colorado  might cost Texas Tech a spot or two -- but I don't expect it falls far. I have it dropping one spot this week. Previous: 1416\n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    Arkansas  went 1-1 this week with a nice road win over  Ole Miss  and an ugly, lopsided road loss at  Auburn . It is 12-4 with wins over Texas Tech and  Tennessee , among others, in the last month, which should keep the Razorbacks comfortably in the top-20. Previous: 1517\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    There's a real chance Alabama falls as much as any ranked team last week in this week's poll. It went 0-2 this week with losses to Vandy and  Texas. Previous: 1318\n                            \n    \n                                                \n                    \n    \n        \n                            Virginia\n                    \n    \n    Because of losses by nearly every team ranked No. 18 or worse in last week's poll,  Virginia  is primed to make a big leap Monday. Now 14-2, the Cavaliers have won 9 of their last 10. Previous: 2319\n                            \n    \n                                                \n                    \n    \n        \n                            Seton Hall\n                    \n    \n    Seton Hall  was receiving votes but unranked last week -- and that changes this week. Shaheen Holloway's club is 14-2 overall and 4-1 in Big East play with three-straight wins over  Marquette ,  Creighton  and  Georgetown . UConn is up next Tuesday. Previous: NR20\n                            \n    \n                                                \n                    \n    \n        \n                            Georgia\n                    \n    \n    The SEC schedule was unkind to  Georgia  this week with two road tests vs.  Florida  and  South Carolina . The Bulldogs went 1-1 in that stretch -- headlined by a 92-77 loss at Florida on Tuesday. Previous: 1821\n                            \n    \n                                                \n                    \n    \n        \n                            Louisville\n                    \n    \n    Despite losing two of its last three, and despite  Boston College  giving Louisville a bit more of a scare than it should have, Louisville should remain in the rankings this week. It is 12-4 overall and 2-2 in ACC action. Previous: 2022\n                            \n    \n                                                \n                    \n    \n        \n                            Iowa\n                    \n    \n    Iowa's in jeopardy of dropping out of the rankings this week after consecutive Big Ten losses to  Minnesota  and Illinois. I have the Hawkeyes hanging just inside the top 25 at No. 22 -- which would be a three-spot drop from last week. Previous: 1923\n                            \n    \n                                                \n                    \n    \n        \n                            Utah St.\n                    \n    \n    Road wins over  Air Force  and  Boise State  this week moved  Utah State  to 14-1 on the season and 5-0 in MWC play. The Aggies have not been ranked yet this season, but that should change. Previous: NR24\n                            \n    \n                                                \n                    \n    \n        \n                            Miami (Ohio)\n                    \n    \n    Miami (Ohio)  is one of five undefeated teams remaining in college basketball and it has been receiving votes for four consecutive poll updates. This might be the week it cracks the rankings. It'd be the first time since 1998-99 the RedHawks are a top-25 team. Previous: NR25\n                            \n    \n                                                \n                    \n    \n        \n                            Clemson\n                    \n    \n    Brad Brownell's  Clemson  club has won seven consecutive games and is 14-3 after a 15-point road win Saturday over  Notre Dame . The Tigers are one of only three ACC teams still unbeaten in conference play. Previous: NR\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tomorrow's Top 25 college basketball rankings prediction: Iowa State moves up - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/a38bc4e1-e541-46cb-8c16-8f19ec3ae6d6/thumbnail/1200x675/6f6c668d1aa0291ce744406fd11da22a/iowastatetop25.jpg"
      ],
      "datePublished": "2026-01-12T00:13:28.000Z",
      "dateModified": "2026-01-12T00:13:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texans vs. Steelers prediction, odds, NFL playoff predictions: 2026 Wild Card Weekend picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/texans-steelers-prediction-odds-time-nfl-2026-wild-card-monday-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/8b1534fb-fd25-4589-bce5-eb5315cf9aa7/thumbnail/1200x675/7d2d6428ee4f9502af3f16f8590bdc9b/aaron-rodgers-steelers.jpg",
    "tag": "Sports",
    "date": "2026-01-12T01:45:33.000Z",
    "description": "\nThe fifth-seeded Houston Texans face the fourth-seeded Pittsburgh Steelers in a 2026 Wild Card Weekend matchup on Monday Night Football. Houston is c",
    "body": "\nThe fifth-seeded Houston Texans face the fourth-seeded Pittsburgh Steelers in a 2026 Wild Card Weekend matchup on Monday Night Football. Houston is coming off a 38-30 Week 18 win over the Indianapolis Colts, while Pittsburgh held off Baltimore 26-24. The Texans (12-5), who finished second in the AFC South, are 5-3 on the road this season. The Steelers (10-7), the champions of the AFC North, are 6-3 on their home field. Pittsburgh will welcome the return of wide receiver DK Metcalf (suspension).Kickoff from Acrisure Stadium in Pittsburgh is set for 8:15 p.m. ET. The Steelers lead the all-time series 5-3. The Texans are 3-point favorites in the latest Steelers vs. Texans odds, while the over/under for total points scored is 38.5 via DraftKings Sportsbook. Before making any Texans vs. Steelers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.    Now, the model has set its sights on Texans vs. Steelers. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Steelers vs. Texans:\nTexans vs. Steelers                                                                                             spreadHouston -3 at DraftKings SportsbookTexans vs. Steelers                                         over/under38.5 pointsTexans vs. Steelers                                                                                                                                                                                                         money line Houston -155, Pittsburgh +130Texans vs. Steelers                                                                                                                                                                                                 picksSee picks at SportsLineTexans vs. Steelers                                                                                                                                                                                                   streaming Fubo (Try for free)  Why the Texans can coverThird-year quarterback C.J. Stroud powers the Houston offense. In 14 games this season, he has completed 64.5% of his passes for 3,041 yards and 19 touchdowns with eight interceptions and a 92.9 rating. He has also rushed 48 times for 209 yards (4.4 average) and one touchdowns. In a 40-20 win over Arizona on Dec. 14, he completed 22 of 29 passes for 260 yards and three touchdowns.One of his top targets is fifth-year wide receiver Nico Collins. In 15 games, he has 71 receptions for 1,117 yards and six touchdowns. He has 18 explosive plays of 20 or more yards, including a long of 57, with 324 yards after the catch and 48 first-down conversions. In a 20-10 win over Kansas City on Dec. 7, he caught four passes for 121 yards, including a long of 53. See which team to back at SportsLine. Why the Steelers can coverVeteran quarterback and future Hall of Famer Aaron Rodgers leads the Pittsburgh attack. In 16 games this season, he has completed 65.7% of his passes for 3,322 yards and 24 touchdowns with seven interceptions and a 94.8 rating. He has also rushed for one score. In the Week 18 win over Baltimore, Rodgers completed 31 of 47 passes for 294 yards and one touchdown. He also rushed once for 20 yards. Metcalf will be back and gives Rodgers more options. In 15 games this season, Metcalf has 59 receptions for 850 yards (14.4 average) and six touchdowns. He has had 15 explosive plays of 20 yards or more, including a long of 80, with 414 yards after the catch and 37 first-down conversions. In a 27-22 win at Baltimore on Dec. 7, he had seven receptions for 148 yards, including a long of 52. See which team to back at SportsLine.How to make Texans vs. Steelers picksSportsLine's model is going Over on the total, projecting 41 combined points. It also says one side of the spread hits in over 50% of simulations. You can only get the pick at SportsLine. So who wins Steelers vs. Texans, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Texans vs. Steelers spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texans vs. Steelers prediction, odds, NFL playoff predictions: 2026 Wild Card Weekend picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/8b1534fb-fd25-4589-bce5-eb5315cf9aa7/thumbnail/1200x675/7d2d6428ee4f9502af3f16f8590bdc9b/aaron-rodgers-steelers.jpg"
      ],
      "datePublished": "2026-01-12T01:45:33.000Z",
      "dateModified": "2026-01-12T01:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chargers vs. Patriots props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chargers-patriots-nfl-player-props-sgp-sunday-night-football-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/21/8cee35a8-c3f9-4e91-b5ca-0044f0ccd3f2/thumbnail/1200x675/34c76856d4676e8266b4c266c92dc08a/usatsi-27139526-justin-herbert-chargers-qb-1q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2026-01-12T00:05:21.000Z",
    "description": "\nThe Los Angeles Chargers clash with the New England Patriots in an AFC Wild Card Weekend matchup on 'Sunday Night Football' at 8 p.m. ET from Gillett",
    "body": "\nThe Los Angeles Chargers clash with the New England Patriots in an AFC Wild Card Weekend matchup on 'Sunday Night Football' at 8 p.m. ET from Gillette Stadium in Foxborough, Mass. The Chargers (11-6), the seventh seed, placed second in the AFC West, while the Patriots (14-3), who are the second seed, won the AFC East. The matchup will feature Chargers quarterback Justin Herbert and Patriots quarterback Drake Maye. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which New England is favored by 3.5 points. Bet the game at DraftKings:\nHerbert has had a solid season, completing 66.4% of his passes for 3,727 yards and 26 touchdowns with 13 interceptions. Maye, meanwhile, is one of the favorites to win the league MVP. In 17 games, he completed 72% of his passes for 4,394 yards and 31 touchdowns with eight interceptions and a 113.5 rating. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like Ladd McConkey, Oronde Gadsden II and Quentin Johnston of the Chargers, and Stefon Diggs, Hunter Henry and Rhamondre Stevenson of the Patriots. Before betting any Chargers vs. Patriots props for Sunday Night Football, you need to see the Chargers vs. Patriots prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Stefon Diggs anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Chargers vs. Patriots NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Patriots vs. Chargers prop picks. You can only see the Machine Learning Model player prop predictions for Chargers vs. Patriots here.Top NFL player prop bets for Chargers vs. PatriotsAfter analyzing the Chargers vs. Patriots props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Chargers quarterback Justin Herbert goes under 31.5 passing attempts (-108). Herbert has thrown under 31 times in seven of his last nine games. Additionally, New England has the ninth-best passing defense in the league.In 16 games this season, Herbert has thrown 31 or fewer passes nine times. The SportsLine Machine Learning Model projects Herbert to have 28.4 passing attempts and gives this prop a 4 out of 5-star prop rating. See more NFL props here. Bet Herbert to go Under 31.5 pass attempts at DraftKings:\nHow to make NFL player prop bets for Chargers vs. PatriotsIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has five other NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Chargers vs. Patriots prop bets for Sunday Night Football.Which Patriots vs. Chargers prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Chargers vs. Patriots props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chargers vs. Patriots props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/21/8cee35a8-c3f9-4e91-b5ca-0044f0ccd3f2/thumbnail/1200x675/34c76856d4676e8266b4c266c92dc08a/usatsi-27139526-justin-herbert-chargers-qb-1q-2025-1920.jpg"
      ],
      "datePublished": "2026-01-12T00:05:21.000Z",
      "dateModified": "2026-01-12T00:05:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/\n                    ",
    "image": "https://sportsfly.cbsistatic.com/fly-375/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "tag": "Sports",
    "date": "2026-01-11T19:13:08.000Z",
    "description": "\n                \n                    Analysis\n                \n                \n                                            After posting a rare winn",
    "body": "\n                \n                    Analysis\n                \n                \n                                            After posting a rare winning mark for a MEAC entry in non-league play, the Bison confounded regional pundits by dropping their first two league games. Both of those, however, were on the road, and now the Bison are back home in D.C., just a 15-or-so minute walk up U Street from Ben's Chili Bowl. After missing most of last season, smooth G Bryce Harris (17.6 ppg) is back and looking like a possible MEAC MVP. The other attraction tonight is going against DSU, whose strategy of slowing the tempo vs. better foes has resulted in scorelines of 43 (vs Temple), 41 (vs. Miami), 51 (vs. St Joe's), and 50 (vs Rutgers), and at 60.4 ppg  the second lowest-scoring offense in the country. Play Howard   \n                                    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
      "image": [
        "https://sportsfly.cbsistatic.com/fly-375/bundles/sportsmediacss/images/fantasy/default-article-image-large.png"
      ],
      "datePublished": "2026-01-11T19:13:08.000Z",
      "dateModified": "2026-01-11T19:13:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]