[
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by backing Vikings-Chargers, Thunder-Pacers, Warriors-Nuggets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-fanduel-promo-code-get-300-bonus-bets-vikings-chargers-thunder-pacers-warriors-nuggets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-23T20:02:20.000Z",
    "description": "\n        Two NBA games are on Thursday's sports calendar, and Thursday Night Football returns in the NFL with Vikings vs. Chargers at 8:15 p.m. ET, pr",
    "body": "\n        Two NBA games are on Thursday's sports calendar, and Thursday Night Football returns in the NFL with Vikings vs. Chargers at 8:15 p.m. ET, providing bettors an opportunity to take advantage of the latest FanDuel promo code, which offers new users $300 in bonus bets if their first wager of $5 or more wins. According to the latest NFL odds, the Chargers are favored by 3.5 points at home, while the over/under for total points scored is 44.5. In the NBA, the Indiana Pacers (0-0) will host the Oklahoma City Thunder (1-0) at 7:30 p.m. ET in an NBA Finals rematch. Later in the evening, the Golden State Warriors (1-0) and Denver Nuggets (0-0) will battle at 10 p.m. ET.SportsLine's model has the Vikings covering the spread (+3.5) against the Los Angeles Chargers in 53% of simulations of the NFL odds. The model's best bets also include the Thunder covering the spread (-7.5) against the Indiana Pacers in 53% of simulations. Meanwhile, SportsLine's model is backing the Nuggets to cover the spread (+2) on the road against the Golden State Warriors in 56% of simulations. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven seasons. The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Best Thursday picksVikings (+3.5) vs. Chargers (-120)Thunder (-7.5) vs. Pacers (-110)Nuggets (+2) vs. Warriors (-110)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +568 (risk $100 to win $568). Bet it at FanDuel here:\nVikings (+3.5) vs. Chargers (-120)The Vikings are 2-0 ATS following a loss, as they fell 28-22 to the Philadelphia Eagles last week. Minnesota is also 3-1 ATS when they get equal rest as their opponent and 2-1 ATS in non-conference games. Meanwhile, the Chargers are 1-4-1 ATS as the favorite and 0-2-1 ATS as the home favorite. Minnesota's defense is also ninth in the NFL in yards allowed (301.7) and ninth in scoring defense (20.8). SportsLine's model has the Vikings covering the spread in 52% of simulations. Bet Vikings to cover at FanDuel Sportsbook:Thunder (-7.5) vs. Pacers (-110)This is a rematch of last year's NBA Finals, but the Pacers are looking different this season. Tyrese Haliburton is rehabbing from a torn Achilles, and Myles Turner left in free agency. Meanwhile, the Thunder have their same core and secured a win over the Houston Rockets in double overtime on Tuesday. Last regular season, OKC swept the season series, including a six-point win in Indiana. Without Haliburton, OKC should take care of business, as SportsLine's model has them covering in 53% of simulations. Bet Thunder to cover at FanDuel Sportsbook:Nuggets (+2) vs. Warriors (-110)Denver is 8-1 in their last nine games against Golden State. All eight wins have been by at least two points, and the Nuggets are making their debut and should be well rested. Nuggets center Nikola Jokic averaged 31.3 points, 12.7 rebounds, and 9.4 assists in his last 10 games against Golden State. Denver is also 3-1 in their past four games at the Chase Center. SportsLine's model has the Nuggets covering the spread in 56% of simulations. Bet Nuggets to cover at FanDuel Sportsbook:\nWant more NBA picks?You've seen the model's best bets for Thursday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by backing Vikings-Chargers, Thunder-Pacers, Warriors-Nuggets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-23T20:02:20.000Z",
      "dateModified": "2025-10-23T20:02:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dallas Wings hire Jose Fernandez: Former USF coach makes leap to WNBA to lead Paige Bueckers' team, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wnba/news/dallas-wings-hire-jose-fernandez-former-usf-coach-makes-leap-to-wnba-to-lead-paige-bueckers-team-per-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/846e713d-37fc-4816-ab2a-288bb91152c4/thumbnail/1200x675/876d2805aa8e825a809ac20301fbbd58/jose-fernandez.jpg",
    "tag": "Sports",
    "date": "2025-10-23T20:00:02.000Z",
    "description": "\n        The Dallas Wings were among the many WNBA franchises to enter the coaching carousel this offseason, firing Chris Koclanes after just one seas",
    "body": "\n        The Dallas Wings were among the many WNBA franchises to enter the coaching carousel this offseason, firing Chris Koclanes after just one season at the helm as they looked for someone new to take over a team featuring Rookie of the Year Paige Bueckers. On Thursday, word broke that they were hiring USF coach Jose Fernandez to make the leap from the college ranks after 25 years coaching the Bulls, per ESPN's Alexa Philippou. Fernandez went 485-317 in his 25 years in Tampa, leading USF to 10 NCAA Tournaments, including in eight of the last 11 seasons. USF released a statement from CEO of athletics Rob Higgins confirming Fernandez's departure and thanking Fernandez for his 25 years in Tampa, building USF into a consistent contender for the NCAA Tournament. \"Women's basketball head coach Jose Fernandez has informed me of his decision to pursue an opportunity to coach at the next level in the WNBA,\" Higgins said. \"While this is a bittersweet moment for our program, it is a well-deserved opportunity for Jose to realize a professional dream, and we are incredibly proud of him.\" Higgins also announced USF would elevate Michele Woods-Baxter to head coach. \n\n        \n            \n                Tempo to hire Sandy Brondello: Former Liberty coach will lead Toronto's WNBA expansion franchise, per report\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nFor Fernandez, he'll take over a Wings team that has talent, most notably Bueckers and Arike Ogunbowale, but struggled to a 10-34 record in 2025. His chief task will be building a contender around Bueckers and getting the most out of the talented young star. Helping Fernandez to get quick buy-in from his star player will be his close relationship with UConn coach Geno Auriemma, who coached Bueckers at the college level. \"I think he's a tremendous coach, obviously, as everybody knows, but he cares deeply about the game itself,\" Auriemma said of Fernandez earlier this year. \"He puts in the time and effort.\" \nWhat the exact roster Fernandez will have to work with around Bueckers will be determined this offseason. The Wings, like every other team in the WNBA, have a large number of players hitting free agency, as most players in the league timed up their most recent contracts to end in anticipation of pay bumps under the new CBA. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dallas Wings hire Jose Fernandez: Former USF coach makes leap to WNBA to lead Paige Bueckers' team, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/846e713d-37fc-4816-ab2a-288bb91152c4/thumbnail/1200x675/876d2805aa8e825a809ac20301fbbd58/jose-fernandez.jpg"
      ],
      "datePublished": "2025-10-23T20:00:02.000Z",
      "dateModified": "2025-10-23T20:00:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Augusta National chairman Fred Ridley explains why national open winners are integral to Masters competition - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/augusta-national-chairman-fred-ridley-explains-why-national-open-winners-are-integral-to-masters-competition/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/c64423f9-e3cb-491d-b2a9-867510f6798b/thumbnail/1200x675/e2a75de2fcfa16cd664cfc296f1cf942/fred-ridley-augusta-national-g.jpg",
    "tag": "Sports",
    "date": "2025-10-23T18:24:58.000Z",
    "description": "\n        An invitation to the 2026 Masters is on the line this week in Dubai as amateurs compete in the 2025 Asia Pacific Amateur Championship at Emir",
    "body": "\n        An invitation to the 2026 Masters is on the line this week in Dubai as amateurs compete in the 2025 Asia Pacific Amateur Championship at Emirates Golf Club. An avenue through which players can access the Masters and The Open through victory, the tournament has been a critical cog in showcasing international talent in both major championship.That is why it was no surprise when Augusta National Golf Club and the R&A released a joint statement in August announcing an alignment of their invitation criteria centered around national opens. Inviting the winners of the Scottish Open, Spanish Open, Japan Open, Hong Kong Open, Australian Open and South African Open into their majors, the parties heightened the importance of already historic tournaments. Augusta National chairman Fred Ridley discussed the importance of this change while speaking ahead of the Asia Pacific Amateur.\"These six opens [are] historical championships around the world that we and the R&A recognized in a joint statement recently,\" Ridley said. \"International competition has always been a big part of the Masters Tournament. That representation internationally has grown over the years to where it's pretty much 50/50, and maybe even a few more, international players. So, we thought it was appropriate to sort of carry on that tradition and the culture that we've established at the Masters.\"Some invitations have already been awarded to England's Marco Penge, winner of the Spanish Open, and Japan's Naoyuki Kataoka, who reigned at the Japan Open. Kataoka entered the week of his win at No. 500 in the Official World Golf Rankings\n Similar to wins during the PGA Tour's regular season, these triumphs come with a one-year invitation into the championships.\"Golf is a global game, and I think we always want to recognize that,\" Ridley said. \"We felt that not only were we living true to our values, but we also were hopefully maybe just as this championship has inspired young amateurs around the Asia-Pacific region, we hope that that incentive of awarding the winners an invitation, a spot in the Masters Tournament as well as The Open Championship, would also generate additional interest in those countries. I know that in Japan recently that was the case. I think it will be the case in all these countries. So we are very excited about that change in our qualifications.\"Following this week's tournament in Dubai, the next invitation will be awarded when the Hong Kong Open concludes next week. This is the penultimate national open on the invitation criteria that will take place in 2025 as the Australian Open is set for the beginning of December, while the South African Open will take place in March 2026, one month before the Masters.\n\"These are really some historical championships that have been around for quite some time and have meant a lot in their countries,\" Ridley said. \"There are some great golfers that have come from a number of those countries, and we just felt that those six championships were appropriate to award invitations to the Masters.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Augusta National chairman Fred Ridley explains why national open winners are integral to Masters competition - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/c64423f9-e3cb-491d-b2a9-867510f6798b/thumbnail/1200x675/e2a75de2fcfa16cd664cfc296f1cf942/fred-ridley-augusta-national-g.jpg"
      ],
      "datePublished": "2025-10-23T18:24:58.000Z",
      "dateModified": "2025-10-23T18:24:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blazers name Tiago Splitter interim coach in wake of Chauncey Billups' gambling arrest, suspension - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/trail-blazers-tiago-splitter-interim-coach-chauncey-billups-arrest/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/836ef3b3-77dd-45e2-91db-75183ac640df/thumbnail/1200x675/5b4c766ff90ab8bdc004b3e0e39a22e8/tiago-splitter.jpg",
    "tag": "Sports",
    "date": "2025-10-23T18:57:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Portland Trail Blazers named Tiago Splitter as",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Portland Trail Blazers named Tiago Splitter as interim coach Thursday, following the arrest of coach Chauncey Billups Thursday morning in connection to an illegal betting operation. Billups was arrested in Portland on Wednesday night, accused of money laundering and wire fraud for allegedly taking part in illegal high-stakes poker games operated by organized crime. The Hall of Famer is expected to make an initial court appearance later on Thursday in Portland.In response to Billups' arrest, and the arrest of Miami Heat player Terry Rozier who is being charged in a separate case, the NBA announced that both are being placed on immediate leave.\"We are in the process of reviewing the federal indictments announced today. Terry Rozier and Chauncey Billups are being placed on immediate leave from their teams, and we will continue to cooperate with the relevant authorities.  We take these allegations with the utmost seriousness, and the integrity of our game remains our top priority.\"Billups' role in the operation was to lure high net-worth individuals to illegal poker games where technology was used to rig the games in favor of the hosts and anyone else involved in the scheme. Rigged shuffle machines, X-ray tables that could read face down cards and special contact lenses and eyeglasses that could read premarked cards were used in this elaborate plan to defraud people out of tens of millions of dollars. Per the indictment, the illegal games goes back to at least 2019. Billups and former NBA player Damon Jones -- the latter of whom is also being charged -- were used to bring in targets. It's unclear how long Splitter would have to serve in the interim coach role. The Blazers are coming off a 118-114 loss to the Minnesota Timberwolves in their season opener. \nIncluding Splitter, four of Portland's six assistant coaches are in their first year with the team, with James Posey and Ronnie Burrell as the only two who have been there for two years.Despite the lack of experience with the team, Splitter does have head coaching experience outside of the NBA. He was the coach of Paris Basketball Club during the 2024-25 season, where he led the team to a French Basketball Cup championship and to the EuroLeague playoffs. Before that, Splitter served as an assistant in the NBA for the Houston Rockets and Brooklyn Nets.\nSplitter played seven years in the NBA, most of which came with the Spurs after being drafted 28th overall in the 2007 NBA Draft. He was a key role player in San Antonio's 2014 championship run and has a lengthy international basketball career as well.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blazers name Tiago Splitter interim coach in wake of Chauncey Billups' gambling arrest, suspension - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/836ef3b3-77dd-45e2-91db-75183ac640df/thumbnail/1200x675/5b4c766ff90ab8bdc004b3e0e39a22e8/tiago-splitter.jpg"
      ],
      "datePublished": "2025-10-23T18:57:00.000Z",
      "dateModified": "2025-10-23T18:57:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lionel Messi signs Inter Miami extension through 2028 as club uses clever strategy in announcing move - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/lionel-messi-signs-inter-miami-extension-through-2028-as-club-uses-clever-strategy-in-announcing-move/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/56d3f4f1-f951-4675-a967-b7fed51ff04f/thumbnail/1200x675/6ec34998b773ae4b8057b074463b8b66/messi-3.jpg",
    "tag": "Sports",
    "date": "2025-10-23T16:54:54.000Z",
    "description": "\n        Ahead of Inter Miami kicking off the MLS Cup Playoffs against Nashville SC on Friday, good news is on the way. The club has released a video ",
    "body": "\n        Ahead of Inter Miami kicking off the MLS Cup Playoffs against Nashville SC on Friday, good news is on the way. The club has released a video of Lionel Messi signing a contract extension at the home of their new stadium, Miami Freedom Park, which is set to open ahead of the 2026 season. Messi's contract was set to expire at the end of the current MLS season, but both parties were hopeful of coming to an extension. The extension, which as been officially announced, will run through 2028, keeping the Argentine number 10 in pink well after the 2026 World Cup, which will be taking place in the United States, Canada, and Mexico.\nThe choice of how Miami announced Messi's extension is a significant one. The Argentine has ushered in a new era at the club, turning them into MLS Cup contenders, becoming the leading scorer in club history, and also securing the first trophy in club history. This extension comes at a time when Miami will begin to enter another era, one that will be a transitional one alongside Messi. The opening of Miami Freedom Park will officially move the Herons into Miami proper, bringing the club to a new level with a fully imagined soccer-specific complex. They've already done an impressive job in recruitment and development in their current stadium with players such as Diego Gomez and Benjaman Cremaschi turning success at Miami into European success, and this complex can help ensure that any success will be sustainable in a world without Messi. It wouldn't feel right to kick off the opening of a new stadium without Messi, and Inter Miami managing owner Jorge Mas has ensured that won't happen with the video showcasing just how instrumental Messi has been to everything at the club. It's also fitting that a club created by a quirk in co-owner David Beckham's Los Angeles Galaxy contract has been thrown into a new era by another global icon.\"It makes me really happy to stay here and to continue with this project that, besides being a dream, has become a beautiful reality — playing in this stadium, at Miami Freedom Park. Since I arrived in Miami, I've been very happy, so I'm truly glad to keep going here.\n\"We're all really excited about the moment when we can finally play at Miami Freedom Park. We can't wait for it to be finished — to experience it from the inside, in our new home, and for the fans to enjoy it as well. It's going to be something very special to play at home in such a spectacular stadium,\" said Messi from the new stadium site in a club statement.\"Looking aheadThere's still more to be done this season with the playoffs underway. After Miami were knocked out of the playoffs in the first round by Atlanta United last season, they'll now be able to put that behind them if Javier Mascherano can lead the club past Nashville SC. Messi just completed one of the best MLS regular season campaigns in club history with 29 goals and 19 assists (including secondary assists), showing that he still has plenty to give to the Herons, and this news is quite a boon ahead of their playoff run. With Jordi Alba and Sergio Busquets retiring at the end of the season, things will look a little different at the club when Miami Freedom Park opens next campaign, but as long as Messi is on the roster, they'll compete for silverware around the league.\nMessi has already won the 2023 Leagues Cup and the 2024 Supporters' Shield with Miami, and he can keep up an annual tradition of winning a trophy with the club if he can lead the Herons to the first MLS Cup title in their history.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lionel Messi signs Inter Miami extension through 2028 as club uses clever strategy in announcing move - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/56d3f4f1-f951-4675-a967-b7fed51ff04f/thumbnail/1200x675/6ec34998b773ae4b8057b074463b8b66/messi-3.jpg"
      ],
      "datePublished": "2025-10-23T16:54:54.000Z",
      "dateModified": "2025-10-23T16:54:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA gambling investigation: Damon Jones allegedly sold information about LeBron James, Lakers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-gambling-investigation-damon-jones-allegedly-sold-information-about-lebron-james-lakers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/8208c9c9-b2a3-4577-9a70-4e762ab13d0f/thumbnail/1200x675/767945151d1852ff8a3a5e6b2e741d15/untitled-design-2025-10-23t104959-092.png",
    "tag": "Sports",
    "date": "2025-10-23T17:54:55.000Z",
    "description": "\n        Former NBA guard and assistant coach Damon Jones was arrested Thursday by the FBI as part of a wide-ranging investigation into illegal sports",
    "body": "\n        Former NBA guard and assistant coach Damon Jones was arrested Thursday by the FBI as part of a wide-ranging investigation into illegal sports betting and rigged card games, which also involves Portland Trail Blazers coach Chauncey Billups and Miami Heat guard Terry Rozier. According to the indictment against Jones, he and his fellow co-conspirators \"participated in a scheme to defraud the Betting Companies by providing, obtaining and using non-public information relating to NBA games to place and cause others to place fraudulent sports wagers for profit, and to launder the proceeds thereof.\" Notably, the Department of Justice highlighted two Los Angeles Lakers games on Feb. 9, 2023 and Jan. 15, 2024, and alleged that Jones was selling information relating to the injury status of \"Player 3\" and \"Player 4.\" While the indictment does not name those players, the context points to \"Player 3\" being LeBron James and \"Player 4\" being Anthony Davis. Via the indictment, which was obtained by The New York Times:\"The defendant DAMON JONES was a former NBA player and assistant coach. JONES played in the NBA from approximately 1999 through 2008, including as a member of the Cavaliers from approximately 2005 through 2008. JONES was an assistant coach on the Cavaliers from approximately 2014 through 2018. JONES was also an unofficial assistant coach on the Los Angeles Lakers during the 2022-23 NBA season. During many of those years, JONES was a teammate or coach of a prominent NBA player (\"Player 3\"), an individual whose identity is known to the Grand Jury.\"...\"Player 4, an individual whose identity is known to the Grand Jury, was one of the Lakers' best players during the 2023-24 NBA season.\"Jones allegedly used his connection to James to sell non-public information for profit. Ahead of the Lakers' game against the Milwaukee Bucks on Feb. 9, 2023, Jones texted his co-conspirators \"Get a big bet on Milwaukee tonight before the information is out! [Player 3] is out tonight. Bet enough so Djones can eat to [sic] now!!!\"\nAt the time of Jones' text, James was not listed on the injury report. James ended up sitting out of the game -- which came two days after he broke the NBA's all-time scoring record -- due to ankle soreness. The Lakers would go on to lose, 115-106. A little under a year later, ahead of the Lakers' Jan. 15, 2024 game against the Oklahoma City Thunder, Jones is said to have told his co-defendants that a trainer for James and Davis informed him that Davis was injured and was going to play limited minutes and/or his performance would be affected because of the injury. Jones' co-defendants allegedly paid him $2,500 for the information through an intermediary, and then placed multiple bets against the Lakers, including one for $100,000. Davis was later listed as probable due to an ankle injury and played in the game. He finished with 27 points, 15 rebounds and five assists in 38 minutes, and helped the Lakers win, 112-105. Following the game, one of Jones' co-defendants asked him to repay the $2,500 fee, but Jones maintained that his information had been credible. According to Dan Woike of The Athletic, James had no knowledge that Jones was selling information about his injury status. \nJones and his co-defendants have been charged with conspiracy to commit wire fraud and conspiracy to commit money laundering. U.S. attorney for the Eastern District of New York Joseph Nocella Jr. called the situation \"one of the most brazen sports corruption schemes since online sports betting became widely legalized in the United States.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA gambling investigation: Damon Jones allegedly sold information about LeBron James, Lakers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/8208c9c9-b2a3-4577-9a70-4e762ab13d0f/thumbnail/1200x675/767945151d1852ff8a3a5e6b2e741d15/untitled-design-2025-10-23t104959-092.png"
      ],
      "datePublished": "2025-10-23T17:54:55.000Z",
      "dateModified": "2025-10-23T17:54:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 World Series: Dodgers to start Blake Snell in Game 1, Blue Jays' Trey Yesavage takes mound Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2025-world-series-dodgers-to-start-blake-snell-in-game-1-blue-jays-trey-yesavage-takes-mound-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/0e130292-87ea-433d-bc55-4d411bd19938/thumbnail/1200x675/29b07586335fdcde731dbfb3765d443e/yesavage-snell-getty.png",
    "tag": "Sports",
    "date": "2025-10-23T19:33:41.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        On Thursday, the Los Angeles Dodgers and the Toron",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        On Thursday, the Los Angeles Dodgers and the Toronto Blue Jays named their starting pitchers for Friday's Game 1 of the 2025 World Series at Rogers Centre. The visiting Dodgers will start lefty ace Blake Snell, and he'll oppose Blue Jays right-hander Trey Yesavage. First pitch is scheduled for 8 p.m. ET. Snell, 32, will be making his fourth start of the 2025 postseason. Over the previous three starts, he's pitched to an ERA of 0.86 with 28 strikeouts and five unintentional walks in 21 innings. Those numbers include an eight-inning gem against the Milwaukee Brewers in Game 1 of the National League Championship Series in which Snell struck out 10 with no walks and only one hit allowed. During the regular season, his first with the Dodgers after signing a five-year free-agent pact, Snell was limited to just 11 starts because of shoulder inflammation. Over those 61 ⅓ innings, however, Snell thrived with a 2.35 ERA (177 ERA+) and an FIP of 2.70. In all, Snell in the playoffs has an ERA of 2.58 over 13 starts and two relief appearances.\nYesavage at 22 years and 88 days old will become the second-youngest Game 1 starter in World Series history. As Sarah Langs notes, only Ralph Branca of the 1947 Brookyn Dodgers was younger.\nThis season, Yesavage made just three major-league starts in the regular season following his mid-September call-up. In those three starts, he put up a 3.21 ERA with 16 strikeouts and seven unintentional walks in 14 innings. After that, he made three starts in the playoffs, including two against the Seattle Mariners in the ALCS. Over those three starts, Yesavage had an ERA of 4.20 with 22 strikeouts and six unintentional walks in 15 combined innings.\"It's something I never even would have dreamed of, but I'm here now and I'm embracing it fully and I'm so happy to be here,\" the rookie said Thursday.\nYesavage comes into Friday's Game 1 start on the standard four days of rest. Snell, meantime, will be making his first start since Oct. 13. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 World Series: Dodgers to start Blake Snell in Game 1, Blue Jays' Trey Yesavage takes mound Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/0e130292-87ea-433d-bc55-4d411bd19938/thumbnail/1200x675/29b07586335fdcde731dbfb3765d443e/yesavage-snell-getty.png"
      ],
      "datePublished": "2025-10-23T19:33:41.000Z",
      "dateModified": "2025-10-23T19:33:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 8 picks, Vikings-Chargers preview and records that could fall - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-8-picks-vikings-chargers-predictions-trade-candidates/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/06/b86443a2-f39d-4648-b70b-32e5a3742433/thumbnail/1200x675/43bbf7a9265e97bf510d111f30bccd79/justin-jefferson-vikings-imagn.jpg",
    "tag": "Sports",
    "date": "2025-10-23T17:02:03.000Z",
    "description": "\n        Welcome to the Thursday edition of the Pick Six newsletter!We have Week 8 kicking off tonight in Los Angeles with the Chargers hosting Minnes",
    "body": "\n        Welcome to the Thursday edition of the Pick Six newsletter!We have Week 8 kicking off tonight in Los Angeles with the Chargers hosting Minnesota. Before this game starts, the Vikings might want to send a complaint to the NFL scheduling department for making them fly two time zones west on a short week. Although that might not sound like much, it's the closest thing to a guaranteed loss that a team can be given on its schedule. Since the return of \"Thursday Night Football\" in 2006, there have been 21 instances of a Central/Eastern time zone team flying at least two time zones west for a Thursday game, and those teams have combined to go 4-17 straight up and 4-15-2 ATS. Will that trend hold up? In today's newsletter, we'll be making some picks for the game, plus we'll be taking a look at five NFL records that could get broken before the end of the season. As always, here's your reminder to tell all your friends to sign up for the newsletter. Let's get to the rundown. \n1. Thursday night preview: Picks and best bets for Vikings at Chargers\n                                                                    USATSI\n                                                            For the fifth time this season, the Vikings will be turning their offense over to Carson Wentz, who will be Minnesota's starting quarterback in Los Angeles. J.J. McCarthy practiced this week, but head coach Kevin O'Connell didn't quite feel like he was ready to go. The upside for the Vikings is that Wentz is 7-0 all-time in Thursday games, which is the second-best record in NFL history, trailing only Josh Allen, who is 8-0 on Thursdays in his career. One potential problem for Wentz? Both of his starting tackles are questionable for this game (Christian Darrisaw and Brian O'Neill). Not to be outdone, both of the Chargers' starting tackles (Joe Alt and Trey Pipkins) are also questionable, so it could be a long night for both quarterbacks. Here's one reason why each team should be feeling confident going into the game:Why the Vikings can win: The Vikings are 2-0 this year when they rush for at least 120 yards, so they'll definitely want to get their rushing attack going tonight. The good news for the Vikings is that the Chargers have struggled to stop the run over the past few weeks. The Chargers have lost three of their past four, and in that span, they've given up an average of 145.3 yards per game on the ground. If the Vikings hit that number, there's a good chance they'll win. Vikings running back Aaron Jones (hamstring) is questionable, and if he can't go, Jordan Mason will likely be the workhorse in the backfield for Minnesota. Why the Chargers can win: The Chargers are 3-0 this year when Herbert has a passer rating of 100 or higher, which bodes well for Los Angeles, because the Vikings have given up an average passer rating of 101 to opposing quarterbacks this year. In Minnesota's Week 7 loss to Philadelphia, Jalen Hurts had a perfect passer rating of 158.3. If the Chargers' offensive line can give Justin Herbert time to throw, he should be able to pick apart the Vikings' defense, but based on the health of the offensive line, that's a big \"if.\"You can get a full preview of the game from Jared Dubin.If you're thinking about betting on the game, here are a couple of props (odds via BetMGM):\nONE RECEIVING PROP I LIKE: Keenan Allen over 4.5 receptions (-150): The Chargers have played seven games this year and Allen has gone over this total in six of them, including a Week 7 loss to the Colts where he caught a season-high 11 passes. Allen has been especially good at home: In his four games at SoFi, he's averaged 7.5 receptions per game. ONE KICKING PROP I LIKE: Will Reichard OVER 7.5 points (+100): This game is being played indoors, which I'm only pointing out because Reichard has been a scoring machine this year when playing indoors. Heading into Week 8, the Vikings have played three indoor games and Reichard has averaged 11.3 points in those games. The Chargers are also surrendering an average of 8.1 points per game to opposing kickers this year, which makes me feel pretty confident about this bet. If you're wondering how my props are doing this year, I'm 17-15 (7-7 on kicker props and 10-8 on all other props). And now, it's time for some picks. PICKS FOR 'TNF'Jared Dubin's pick: Chargers 24-20 over VikingsPete Prisco's pick: Chargers 28-23 over VikingsTyler Sullivan's pick: Vikings 24-21 over ChargersJordan Dajani's pick: Chargers 24-21 over VikingsMy pick: Chargers 31-24 over VikingsWe've got some more picks over on our CBSSports.com predictions page. 2. NFL trade deadline is coming: Players who could benefit from a change of sceneryThe NFL trade deadline is officially less than two weeks away. It's coming on Nov. 4, and since it's right around the corner, Cody Benjamin decided to make a list of nine players who would benefit from a change of scenery. These are players who could definitely get traded over the next 12 days. \nLet's check out three names on his list along with their possible landing spots: Jets RB Breece HallPossible landing spots: Bengals, Chargers, Chiefs, TexansCody's take: Whereas Alvin Kamara is older and committed to the organization that drafted him, Hall feels much likelier to be on the move as a one-time ascending talent on an expiring deal. And that's good news for him, because the Jets' offense has been an absolute slog for most of his New York tenure. Even a half-season of service elsewhere could help him rebuild his market for 2026.Ravens TE Mark AndrewsPossible landing spots: Buccaneers, Commanders, Panthers, RamsCody's take: Baltimore might prefer to retain every proven weapon in hopes of salvaging an injury-ravaged season, but Andrews is no longer the steady playmaker that he once was, and Isaiah Likely is already here as the future at tight end.\nRaiders WR Jakobi MeyersPossible landing spots: Falcons, 49ers, Panthers, SteelersCody's take: If there's one pass catcher set to change teams before the deadline, it's probably Meyers, who sought a trade even before the Raiders sunk to 2-5 on the season. He may not be a massive needle mover as a possession receiver, but he still offers valuable depth and solid hands.If you want to see Benjamin's full list of players, we've got that here. We also took a look at what teams should be buyers and which teams should be sellers at the trade deadline, and you can check out our full story on that here. 3. NFL Week 8 picks: Eagles get revenge on Giants\n                                                                    USATSI\n                                                            Welcome to the part of the newsletter where we hand out picks. Every week, Pete Prisco, Jordan Dajani, Tyler Sullivan and I make them give me their picks. Last week, Jordan and I put the other two to shame by going 13-2 (Prisco and Sullivan fell asleep at the wheel and went 10-5). \nAnyway, if you're new here, here's how things work: I'll give you one Week 8 pick from each writer and then link you to the rest of their picks for the week. That way, if you like their pick, you can click over and check out all their Week 8 selections. If you hate it, you can ignore the rest and move on with your life.Pete Prisco -- Eagles (-7) 30-17 over Giants. \"The Giants upset the Eagles two weeks ago, but this will be a much tougher task. They are playing consecutive road games, which is tough. And they have the Eagles' attention after the upset. Look for Philadelphia to continue to play well on offense like they did in beating the Vikings on Sunday as they get revenge for the last meeting. Eagles take it.\" Prisco's full Week 8 picks are here. Tyler Sullivan -- Falcons (-7) 30-20 over Dolphins. \"The Dolphins are allowing the most rushing yards per game (159.3) in the NFL, and now have to face Bijan Robinson. It could be another eye-popping statistical day for the Falcons' backfield en route to a win and cover.\" Sullivan's full Week 8 picks are here. Jordan Dajani -- 49ers (+1.5) 23-17 over Texans. \"Did you watch that Texans' loss to the Seahawks on Monday night? What a pathetic showing from that offense. Seattle kept giving Houston chances to come back and win the game, but C.J. Stroud just couldn't do anything. DeMeco Ryans as a head coach and a former linebacker had to be pulling his non-existent hair out.\" Dajani's full slate of picks will be released Friday, but here's an early preview of his predictions.John Breech -- Steelers (+3) 27-24 over Packers. \"When this game kicks off, it will have been 2,012 days since the Packers drafted Jordan Love and Rodgers has definitely spent every second of every one of those days plotting his revenge. There is no game Aaron Rodgers has ever wanted to win more than this one, so I'm going to say he wins it.\" You can find the rest of my Week 8 picks here. For more Week 8 NFL picks, you can check out our CBSSports.com picks page. 4. Five NFL records that could go down before the end of the seasonWith the NFL season headed into Week 8, that means we're about halfway through the year, which makes right now a good time to check in and see if there are any big NFL records that could go down this year. Jeff Kerr found a few that could be in danger of being broken. Record: Most receiving yards in a seasonRecord-holder: Calvin Johnson with 1,964 in 2012Possible record-breaker: Jaxon Smith-Njigba. Smith-Njigba is on a historic pace heading into Seattle's bye week, as the Seahawks receiver leads the league with 819 receiving yards. ... He's on pace for 1,989 receiving yards, which would surpass Johnson's mark by 25. Five 100-yard games and an average of 10 targets per game have certainly helped.\nRecord: Highest completion percentage in a season Record-holder: Drew Brees with 74.4% in 2018Possible record-breakers: Drake Maye or Jared Goff. This one will be tough to break, but both Maye and Goff are within range. Maye leads the NFL in completion percentage (75.2%), the third-highest mark through seven games in league history. Goff is second in the league (74.9%). It's still early in the season, and one bad game could drop either passer behind Brees' mark, but both have gotten off to historically efficient starts.Kerr took a look at a total of five records that could go down, and you can check out his full list here. 5. Aaron Rodgers could become fifth QB in NFL history to beat all 32 teams\n                                                                    Getty Images\n                                                            Aaron Rodgers claims he's not out for revenge this week when the Steelers face the Packers, but he could make some NFL history. \nOver the course of his career, Rodgers has beaten 31 of the NFL's 32 teams. There's only one team left for Rodgers to take down and that's the Packers. If Rodgers can lead the Steelers to a win over Green Bay, he'll join Tom Brady, Peyton Manning, Drew Brees and Brett Favre as the only quarterbacks in NFL history who have beaten all 32 teams. It's among the most exclusive clubs that a quarterback can join, and Rodgers could have his membership by the end of the weekend. Rodgers is one of four active quarterbacks who has beaten 31 of the NFL's 32 teams. Here's a quick look at the other three: Patrick Mahomes (hasn't beaten the Chiefs). Mahomes won't be able to join the club unless he leaves Kansas City. Russell Wilson (hasn't beaten the Seahawks). With Wilson getting benched in New York, it seems unlikely that he'll ever take down the Seahawks unless he can find a starting job somewhere else next year. Matthew Stafford (hasn't beaten the Steelers). The Rams aren't scheduled to face the Steelers this year, so the only way he'll get to 32 this season is if the Rams face (and beat) Pittsburgh in the Super Bowl.As for Rodgers, he was asked about facing his former team in his weekly press conference.\n\"I don't have any animosity toward the organization,\" Rodgers said Wednesday. \"Obviously, I wish that things had been better in our last year there, but I have a great relationship with a lot of people still in that organization, and this is not a revenge game for me. I'm just excited to see some of those guys and be on 'Sunday Night Football.'\" Rodgers can try to say it's not a revenge game this week, but it's definitely a revenge game. Rodgers also said Pittsburgh's Week 1 game against the Jets wasn't a revenge game, but then after Pittsburgh won, it was pretty clear that there was some revenge involved. I fully expect to see a similar reaction if the Steelers win on Sunday night. 6. Extra points: Jayden Daniels out against ChiefsIt's been a busy 24 hours in the NFL, and since it's nearly impossible to keep track of everything that happened, I went ahead and put together a roundup for you. \nJayden Daniels out for Week 8 showdown. The Commanders QB, who has been dealing with a hamstring injury, has been ruled out of Monday's game against the Chiefs. Marcus Mariota will start in his place. This will mark the third time this season that Daniels has missed a game, and the Commanders have gone 1-1 without him this year. You can read more about his injury here. Lamar Jackson returns to practice. After missing two games, Lamar Jackson has finally returned to practice, which is a good sign that he might be able to play this week against the Bears. Jackson has been out since injuring his hamstring in a Week 4 loss to the Chiefs. At 1-5, the Ravens have their work cut out for them if they want to get back in the playoff race, but with Jackson on the field, that will certainly be possible. We've got more details on his return here. Pro Bowl Games will be part of Super Bowl week. The Pro Bowl is returning this year, and it will be held in the Bay Area. The Pro Bowl Games will be headlined by an AFC vs. NFC flag football game that will take place in San Francisco on Tuesday, Feb. 3, which is five days before the kickoff of Super Bowl LX at Levi's Stadium. You can read more about the Pro Bowl here. Pro Football Hall of Fame trims candidate list down to 52. The Hall of Fame's initial nominee list of 128 players has been trimmed down to 52. Eli Manning and Drew Brees are some of the big names who could be inducted. The list will be cut down to just 25 semifinalists in five weeks. There are four players who will automatically advance to the final 15 after being named finalists last year and those four are: Willie Anderson, Torry Holt, Luke Kuechly and Adam Vinatieri. You can check out the full list here. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 8 picks, Vikings-Chargers preview and records that could fall - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/06/b86443a2-f39d-4648-b70b-32e5a3742433/thumbnail/1200x675/43bbf7a9265e97bf510d111f30bccd79/justin-jefferson-vikings-imagn.jpg"
      ],
      "datePublished": "2025-10-23T17:02:03.000Z",
      "dateModified": "2025-10-23T17:02:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iowa vs. Minnesota prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/iowa-minnesota-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/dfae3e56-d2b3-46e2-a802-c36f54aec8a2/thumbnail/1200x675/4a20bc759fcf5413cff7ccc2cb3f7580/iowa-1.jpg",
    "tag": "Sports",
    "date": "2025-10-23T19:53:09.000Z",
    "description": "\n        The stage is set for another chapter in one of the Big Ten's oldest rivalries as Minnesota (5-2) travels to Kinnick Stadium to face Iowa (5-2",
    "body": "\n        The stage is set for another chapter in one of the Big Ten's oldest rivalries as Minnesota (5-2) travels to Kinnick Stadium to face Iowa (5-2) in B1G action on CBS on Saturday at 3:30 p.m. ET. This marks the 119th meeting between the two programs, a series steeped in history and tradition, including the famed \"Floyd of Rosedale\" trophy.Both teams rank among the top-30 in FBS scoring defense. Iowa allows just 14.6 points per game, while Minnesota gives up 19.0. The Golden Gophers have struggled on the road, dropping games at California and Ohio State. The Hawkeyes, meanwhile, have an edge at home, with their only loss at Kinnick Stadium this season coming against current No. 2 Indiana -- a matchup where they gave the Hoosiers their toughest test of the season.Minnesota and Iowa find themselves in a six-way tie for third place in the Big Ten at 3-1 in conference play. Both are looking to separate themselves in the standings, and this matchup could be decisive in shaping the middle of the conference race.The matchup also features the Big Ten's two longest-tenured active coaches, Kirk Ferentz (Iowa) and P.J. Fleck (Minnesota), adding another layer of intrigue to a rivalry that typically produces closely contested games.\n  Iowa vs. Minnesota: Need to know  Key playmakers: Minnesota's Darius Taylor leads all active FBS players with 10 career games with at least 150 yards from scrimmage. He got his first rushing touchdown of the season last week against Nebraska, rushing for a season-high 148 yards. Iowa counters with transfer quarterback Mark Gronowski, who has 10 rushing touchdowns -- tied for most among FBS quarterbacks -- and recently set the NCAA record for most career wins (54) by a starting quarterback. The former South Dakota State star won two FCS national championships.What is Floyd of Rosedale?: The Iowa-Minnesota rivalry features one of college football's most unique traditions: the Floyd of Rosedale trophy. It dates back to 1935, after a controversial 1934 game where tempers ran high due to the treatment of Iowa running back Ozzie Simmons, one of the few black players in college football. To ease tensions, the governors of Minnesota and Iowa made a friendly wager involving prize pigs. Minnesota won 13-6, and the pig -- named Floyd after Minnesota governor Floyd Olson -- was later immortalized as a bronze trophy awarded annually to the winner.Penalty discipline: These Big Ten rivals are among the most disciplined teams in college football this season. The Hawkeyes lead the nation with just 2.3 penalties per game, while the Golden Gophers rank fifth in FBS, averaging only 3.6 per contest. Minimizing mistakes has been key for both teams' success, and in a close, physical rivalry game like this, staying disciplined could be a deciding factor. Iowa is 9-1 in its last 10 meetings against Minnesota with 14 fewer accepted penalties and a plus-three turnover margin.\n  How to watch Iowa vs. Minnesota live  Date: Saturday, Oct. 25  | Time: 3:30 p.m. ET  Location: Kinnick Stadium -- Iowa City, IowaTV: CBS | Live stream: CBSSports.com, CBS Sports App, Paramount+ PremiumIowa vs. Minnesota prediction, picks  \nIt might seem risky to rely on Iowa's offense to put up enough points, but these rivals have opposite trends ATS this season, with Iowa at 4-1-1 and Minnesota at 1-4-1. The Hawkeyes giving up more than a touchdown is a bit rare, with seven of the last 10 meetings decided by seven points or fewer. While Minnesota found its rushing attack against Nebraska with 186 yards -- up from a combined 133 in the previous three Big Ten games -- Iowa's stout run defense, allowing just 2.8 yards per carry and roughly 92 yards per game, should keep the Golden Gophers in check. That defensive advantage, combined with Iowa's consistency ATS in the series (7-2-1 since 2015), makes the Hawkeyes a comfortable pick. Pick: Iowa -8.5SportsLine's proven computer model has simulated every Week 9 college football game 10,000 times. Visit SportsLine now to see all the picks, all from the model that is 42-30 since the beginning of last season on top-rated money-line and over/under picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iowa vs. Minnesota prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/dfae3e56-d2b3-46e2-a802-c36f54aec8a2/thumbnail/1200x675/4a20bc759fcf5413cff7ccc2cb3f7580/iowa-1.jpg"
      ],
      "datePublished": "2025-10-23T19:53:09.000Z",
      "dateModified": "2025-10-23T19:53:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fernando Mendoza emerging as legit No. 1 pick contender in 2026 NFL Draft - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/fernando-mendoza-2026-nfl-draft-scouting-report/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/23/030ec9f4-fa0a-4b00-9acd-1797bcbf889e/thumbnail/1200x675/07a6dc8dcc86ed21742bf449030ba900/fernando-mendoza.jpg",
    "tag": "Sports",
    "date": "2025-10-23T18:45:16.000Z",
    "description": "\n        When writing up newly transferred Indiana quarterback Fernando Mendoza in the preseason, I highlighted how high his floor was already. Given ",
    "body": "\n        When writing up newly transferred Indiana quarterback Fernando Mendoza in the preseason, I highlighted how high his floor was already. Given how well he was able to overcome a porous offensive line and talent-starved receiver room to still produce at a high level for California in 2024, it felt like the difficulty leap to the NFL would at least not overwhelm him. What was unknown to everyone was how high his ceiling could push when he had open receivers consistently and time to throw. With two NFL-caliber receivers catching passes for him this fall and a couple more NFL-caliber linemen blocking for him, Mendoza's sky-high ceiling has been on display on a near-weekly basis. Entering Week 9 of the college football season, Mendoza is the currently the second favorite to be the No. 1 overall pick -- behind only Alabama's Ty Simpson -- at +300, according to FanDuel Sportsbook. He's completing 72.7% of his passes, averaging 9.6 yards per attempt and has a 21-to-2 touchdown-to-interception ratio for the No. 2-ranked Hoosiers. The Mendoza hype train has shown no signs of braking.No. 1 overall pick odds PlayerSchoolPositionOddsTy SimpsonAlabamaQB+200Fernando MendozaIndianaQB+300LaNorris SellersSouth CarolinaQB+600Rueben Bain Jr.Miami (Fla.)EDGE+750Dante MooreOregonQB+750So, how did we get here with a player who was only ranked the fourth-best transfer portal quarterback by 247Sports last offseason? And could be actually end up as the No. 1 overall pick given what he already put on tape for a talent-starved California offense in 2024?\nThe answer to both lies in the mitigation of his two biggest weaknesses from last fall. The pros on tape last season at Cal were obvious. He got the ball out of his hands quickly (2.59-second average time to throw), his ball placement was tremendous, he was willing to stand in to deliver downfield passes while getting hit, and he possessed the arm plus the willingness to consistently drive throws through tight windows over the middle of the field. Those things haven't changed at Indiana. His cons were a little more subtle. He played a conservative brand of football with fewer special NFL throws on tape compared to top prospects of the past. He also showed an obliviousness to pressure at times that led to the fourth-most sacks taken in the FBS (40). A conservative quarterback with a high-sack rate is a non-starter in the NFL. Something had to change, and it very much has this fall. He's still not a hyper-aggressive downfield passer, but the \"wow\" throws have come far more frequently. Take the hole shot or seam strike while getting crunched, both against Iowa.\nOr this past week when he put it on Elijah Sarratt's face mask on a go-ball vs. tight coverage.\nThose are throws I'd describe as \"NFL open,\" and if they aren't littered on your tape, you have no chance of going No. 1 overall.While the more frequent NFL throws are a must, it's his performance under pressure that has me more confident he's got staying power in the No. 1 overall pick conversation. Mendoza has not only averaged less than one sack a game (six so far this season), but he's also done it by being more aggressive under pressure. Mendoza is no check-down Charlie; he's averaging 9.0 yards per attempt under pressure (fourth-best in the FBS). That's what you want a No. 1 overall pick to look like. \nIf you know anything about Mendoza's game, you know those numbers aren't being inflated by him breaking the pocket and exploiting busted coverages. The lack of those second-reaction plays is still his biggest sticking point with NFL evaluators. He's hanging in collapsing pockets to the bitter end and still producing a yards-per-attempt figure that matches Oregon quarterback Dante Moore's yards per attempt on all throws. \n        \n            \n                Renner's 2026 NFL mock draft 3.0: Jets and Raiders take QBs in top 5 amid stronger WR and defensive classes\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \nIf you are a believer in Mendoza's talents, I'd recommend betting that number now because the odds are only going down. He has a nice soft landing through the end of the regular season; UCLA, Maryland, Penn State, Wisconsin and Purdue shouldn't offer much in the way of cold water for the red-hot Hoosiers quarterback. Evaluators will have to wait for the penciled-in Big Ten Championship against Ohio State and Indiana's likely subsequent playoff matchup. If he can pass those tests with flying colors -- even if Indiana loses -- he's your No. 1 overall pick come April. \nBet 2026 NFL Draft props and other NFL action at FanDuel Sportsbook, where new users get $300 in bonus bets with a winning $5 wager.Fernando Mendoza NFL Draft profile\nNFL comparison: Carson PalmerLike Palmer, Mendoza has an ideal frame with an NFL-caliber arm and some real speed. Also like Palmer, you'll never confuse Mendoza for a running quarterback. He thrives on quick processing and consistent accuracy at the underneath and intermediate levels of the field.StrengthsQuick decision-makerKnows where to miss when throwing into tight windowsWilling to deliver strikes under heavy pressureConsistently plus ball placementWeaknessesCan run, but not an evasive athletePocket awareness comes and goes. Will miss defendersAnticipation shows mainly on pre-snap determined routesFernando Mendoza college stats SeasonGGSCompAttComp%Passing YardsTDINTPass Yards/AttQB Rating2025 (at Indiana)7713318173.5%1,7552129.7191.02024 (at Cal)111126538668.7%3,0041667.8144.62023 (at Cal)9815324363.0%1,70814107.0132.8Career272655181067.9%6,46751188.0151.4Fernando Mendoza 247Sports profileHigh school: Marcus (Columbus, Miami)Class: 2022Rating: ⭐️⭐️⭐️ (82)\nQB: 134 | Florida: 250Check out Fernando Mendoza's full 247Sports profile, here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fernando Mendoza emerging as legit No. 1 pick contender in 2026 NFL Draft - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/23/030ec9f4-fa0a-4b00-9acd-1797bcbf889e/thumbnail/1200x675/07a6dc8dcc86ed21742bf449030ba900/fernando-mendoza.jpg"
      ],
      "datePublished": "2025-10-23T18:45:16.000Z",
      "dateModified": "2025-10-23T18:45:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, Week 8 against the spread, money-line, over/under best bets from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-spread-over-under-money-line-picks-week-8-2025-ai-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/c683bdf3-e99c-4034-8858-9ae0d919d2f8/thumbnail/1200x675/e95d5d593d7d32d1b8c8999b1866b184/daniel-jones-pic.jpg",
    "tag": "Sports",
    "date": "2025-10-23T16:59:18.000Z",
    "description": "\n        Aaron Rodgers spent the first 18 years of his future Hall of Fame career with the Green Bay Packers. His career comes full circle in NFL Week",
    "body": "\n        Aaron Rodgers spent the first 18 years of his future Hall of Fame career with the Green Bay Packers. His career comes full circle in NFL Week 8 when his Pittsburgh Steelers take on the Packers in Pittsburgh. It will be the first time he has faced the team that drafted him in the first round of the 2005 NFL Draft. The Packers (4-1-1) lead the NFC North, while the Steelers (4-2) are on top of the AFC North. Green Bay enters as a 3-point favorite. Another matchup involving contenders sees the Buffalo Bills (4-2) visiting the Carolina Panthers (4-3). The Bills are -7.5 favorites, one of five games with spreads of -7 or more. The largest spread is Tennessee at Indianapolis (-14), followed by Chiefs (-12.5) vs. Commanders as Jayden Daniels (hamstring) is expected to be out, making it tough for Washington to end its eight-game losing streak to Kansas City.How should you handle those NFL games and optimize what to bet on NFL in Week 8? Before making any Week 8 NFL picks or Week 8 NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 8 NFL betting, the AI PickBot has evaluated the NFL odds and provided NFL betting picks for all 13 games. You can only see the AI predictions for the Week 8 NFL schedule here.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 8 NFL AI picksAfter analyzing every game in Week 8, the AI says the Colts (-14, 47) cover comfortably against the Titans. Daniel Jones has dominated in his first year with Indianapolis. In seven starts with the Colts, he has completed 152 of 214 passes (71%) for 1,790 yards and 10 touchdowns with just three interceptions. He has also rushed 29 times for 83 yards and four scores.Jones had spent his first six seasons with the New York Giants. He was released late last November and signed as a free agent with the Minnesota Vikings, but did not see the field. This offseason, he joined the Colts as a free agent. He has thrown for 225 or more yards in five of seven games. In a 29-28 win over the Denver Broncos on Sept. 14, he completed 23 of 34 passes for 316 yards and one touchdown. He also rushed for a score.SportsLine AI rates a Colts spread cover as an A pick and also predicts a 36-18 win on average. See its other Week 8 football predictions and football picks at SportsLine.How to make Week 8 NFL picksIn addition, the AI PickBot has generated well over 20 highly-coveted A+ picks for Week 8. You need to see the AI's NFL picks before making any Week 8 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 8 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, Week 8 against the spread, money-line, over/under best bets from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/c683bdf3-e99c-4034-8858-9ae0d919d2f8/thumbnail/1200x675/e95d5d593d7d32d1b8c8999b1866b184/daniel-jones-pic.jpg"
      ],
      "datePublished": "2025-10-23T16:59:18.000Z",
      "dateModified": "2025-10-23T16:59:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chargers vs. Vikings odds, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/vikings-chargers-prediction-odds-time-spread-2025-nfl-week-8-thursday-night-football-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/789ed9ce-d29a-4cde-9f25-e6cb2efc85d9/thumbnail/1200x675/7d20cf31b5160c0da217d5ca37a1aa7b/justin-jefferson-catch.jpg",
    "tag": "Sports",
    "date": "2025-10-23T19:55:28.000Z",
    "description": "\n        After five straight weeks of divisional contests on 'Thursday Night Football', an interconference matchup will kick off NFL Week 8 as the Los",
    "body": "\n        After five straight weeks of divisional contests on 'Thursday Night Football', an interconference matchup will kick off NFL Week 8 as the Los Angeles Chargers host the Minnesota Vikings. Both teams are coming off losses, with the Chargers (4-3) falling 38-24 to Indianapolis on Sunday, as L.A. has dropped three of its last four. Meanwhile, the Vikings (3-3) were defeated by Philadelphia, 28-22, in Week 7 as Minnesota has alternated wins and losses. Both teams played in primetime in both Weeks 1 and 2, and haven't since then, with the Chargers going 2-0 and the Vikings going 1-1. With J.J. McCarthy (ankle) still recovering, Carson Wentz is set to start again for the Vikings. RB Aaron Jones (hamstring) is questionable for Minnesota, while OT Joe Alt (ankle) is questionable for Los Angeles.Kickoff is at 8:15 p.m. ET from SoFi Stadium in Inglewood, Calif. Minnesota leads the all-time series, 8-7, though the Chargers won the last matchup in 2023. The latest Vikings vs. Chargers odds have Los Angeles as the 3.5-point favorite. The over/under for total points is 44.5. Los Angeles is at -179 on the money line (risk $179 to win $100). Before making any Chargers vs. Vikings picks, be sure to see what the SportsLine projection model has to say. New users can also target the DraftKings promo code, which offers $300 in bonus bets if your $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 43-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Now, the model has zeroed in on Minnesota vs. Los Angeles. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Chargers vs. Vikings:Vikings vs. Chargers       spreadLos Angeles -3.5 at DraftKings SportsbookVikings vs. Chargers     over/under44.5 pointsVikings vs. Chargers           money line Los Angeles -179, Minnesota +150Vikings vs. Chargers          picksSee picks at SportsLineVikings vs. Chargers   streaming Amazon PrimeWhy the Vikings can coverMinnesota hangs its hat on defense, as it boasts a top-10 scoring unit on that side of the ball in addition to elite metrics in critical situations. The Vikings rank second in third-down defense and fourth in red-zone defense as nearly 70% of their defensive possessions don't end up in them allowing points, which is the second-best mark in the league. A relentless pass rush is a big reason for that as Minnesota is third in hurry percentage and fourth in sack percentage.On offense, Jordan Mason has averaged 70.5 rushing yards over his four starts -- all coming in the last four games -- and he has four touchdowns over this stretch. Out wide, Justin Jefferson continues to produce regardless of who is throwing him passes as he's fourth in the league with 88 receiving yards per game this year. No. 2 wideout, Jordan Addison, has also hit the ground running since coming off his suspension with at least 114 receiving yards or a touchdown in all three of his games in 2025. See which team to back at SportsLine. Why the Chargers can coverLos Angeles has the league's leading passer in Justin Herbert (1,913 yards), who is also on pace for a career-high of 452 rushing yards. Herbert leads the No. 3 passing attack in the NFL, and he has a bevy of options at his disposal. Keenan Allen, Ladd McConkey and Quentin Johnston all have at least 380 receiving yards, while L.A. found a steal in the fifth round of the draft in rookie tight end Oronde Gadsden II. The son of a former NFL receiver, Gadsden II had a 7-164-1 stat line on Sunday, with the yardage being the fourth-most by a rookie tight end since 1960.The Chargers defense is getting healthier as nine-time Pro Bowler Khalil Mack returned last week after missing a month and notched his second sack of the season. Even with Mack missing most of the year, only one team has allowed fewer passing touchdowns than Los Angeles, and it's a defense which may not be on the field that often on Thursday. That's because Minnesota's defense has logged lots of snaps as of late as the Vikings haven't forced a turnover in three straight games. See which team to back at SportsLine. New users can also check out the latest FanDuel promo code to get $300 in bonus bets after placing a $5 wager:How to make Chargers vs. Vikings picksFor the NFL Week 8 'Thursday Night Football' game of Vikings vs. Chargers, the model is leaning Over the total, projecting 45 total points. It also says one side of the spread hits over 50% of the time. See what it is at SportsLine.Who wins Chargers vs. Vikings, and which side of the spread hits in over 50% of simulations? Visit SportsLine now to see which side of the Vikings vs. Chargers spread you need to jump, all from the model that is 43-28 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chargers vs. Vikings odds, picks, 'Thursday Night Football' prediction, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/789ed9ce-d29a-4cde-9f25-e6cb2efc85d9/thumbnail/1200x675/7d20cf31b5160c0da217d5ca37a1aa7b/justin-jefferson-catch.jpg"
      ],
      "datePublished": "2025-10-23T19:55:28.000Z",
      "dateModified": "2025-10-23T19:55:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Player prop picks for Chargers vs. Vikings on 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/chargers-vikings-nfl-player-props-carson-wentz-thursday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/06/a261f9b9-8312-4863-bdf0-39e5505dfc4b/thumbnail/1200x675/46a43d9e8d61119ee56fd8e8a6c47457/wentz.jpg",
    "tag": "Sports",
    "date": "2025-10-23T17:14:36.000Z",
    "description": "\n        A cross-conference battle kicks off NFL Week 8 as the Los Angeles Chargers host the Minnesota Vikings on 'Thursday Night Football' at 8:15 p.",
    "body": "\n        A cross-conference battle kicks off NFL Week 8 as the Los Angeles Chargers host the Minnesota Vikings on 'Thursday Night Football' at 8:15 p.m. ET. NFL player props figure to center on the passing games, with both teams dealing with injuries to their running backs, and there's no shortage of quality receivers to use in 'Thursday Night Football' props. Justin Jefferson, Jordan Addison, Keenan Allen, Ladd McConkey and Quentin Johnston all had at least 67 yards or a touchdown on Sunday. Justin Herbert, who leads the league with 1,913 passing yards has a passing touchdown prop bar of 1.5, which is the same as Carson Wentz, who continues to start in place of J.J. McCarthy (ankle)The NFL prop odds, however, differ for the quarterbacks in regard to passing touchdowns. Herbert is at -172 to hit the Over, while Wentz having multiple touchdown passes would return a payout of +102. Your NFL prop bet strategy should take into account multiple factors, including recent performances, the opposing defense and even weather conditions. Before betting any Vikings vs. Chargers props for Thursday Night Football, you need to see the Chargers vs. Vikings prop predictions powered by SportsLine's Machine Learning AI.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Vikings vs. Chargers NFL betting on 'Thursday Night Football,' the Machine Learning Model  has evaluated the NFL player prop odds and provided Chargers vs. Vikings prop picks. You can only see the Machine Learning Model player prop predictions for Minnesota vs. Los Angeles here.Top NFL player prop bets for Vikings vs. ChargersAfter analyzing the Chargers vs. Vikings props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning Model  says Wentz goes Over 222.5 passing yards (-114 at FanDuel). Through four starts, Wentz is averaging 268 passing yards, which is fourth-most in the NFL. He has a pair of 300-plus passing yard games over his last three starts as Minnesota is leaning on him rather than a run game without Aaron Jones. Wentz has averaged 40.7 pass attempts over the last three games, and for comparison, Herbert, who leads the NFL in pass attempts in 2025, is averaging 38.7 attempts on the season.Los Angeles just allowed a season-high in passing yards on Sunday, giving up 288 to Daniel Jones. The Chargers' defense gets a little lax at home, as it's given up 70.3 more passing yards at SoFi Stadium than in road games, and that doesn't even take into account the Chargers allowing 249 passing yards in the Brazil contest. The AI model projects Wentz to have 250.7 passing yards, giving this NFL prop bet a 4-star rating. See more NFL props here.New users can also target the FanDuel promo code, which offers new users $300 in bonus bets if their first $5 bet wins:How to make NFL player prop bets for Vikings vs. ChargersIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has four additional NFL props that are rated four stars or better. You need to see the Machine Learning Model analysis before making any Chargers vs. Vikings prop bets for 'Thursday Night Football.'Which Vikings vs. Chargers prop bets should you target for 'Thursday Night Football?' Visit SportsLine now to see the top Chargers vs. Vikings props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Player prop picks for Chargers vs. Vikings on 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/06/a261f9b9-8312-4863-bdf0-39e5505dfc4b/thumbnail/1200x675/46a43d9e8d61119ee56fd8e8a6c47457/wentz.jpg"
      ],
      "datePublished": "2025-10-23T17:14:36.000Z",
      "dateModified": "2025-10-23T17:14:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oklahoma vs. Ole Miss prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oklahoma-ole-miss-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/05701722-cc0b-44ef-b684-b3974918ddd6/thumbnail/1200x675/db0667a9193c30017460e1742ded18ff/john-mateer-oklahoma-vs-south-carolina.jpg",
    "tag": "Sports",
    "date": "2025-10-23T19:50:19.000Z",
    "description": "\n        Oklahoma is hosting Ole Miss for the first time ever on Saturday, as the No. 13 Sooners welcome the No. 8 Rebels to Memorial Stadium for a cr",
    "body": "\n        Oklahoma is hosting Ole Miss for the first time ever on Saturday, as the No. 13 Sooners welcome the No. 8 Rebels to Memorial Stadium for a critical battle between one-loss SEC teams. After taking a 43-35 loss at Georgia last week, this marks the end of a brutally tough two-game road swing for Ole Miss.For Oklahoma, it's only the beginning of a five-game stretch against top-20 SEC foes to close the season. If the Sooners are going to reach the College Football Playoff, they'll have to survive the forthcoming gauntlet, and that begins with limiting the Ole Miss offense.Ole Miss coach Lane Kiffin's unit scored touchdowns on its first five possessions of last week's loss to the Bulldogs before quarterback Trinidad Chambliss finally went cold in the fourth quarter. Oklahoma leads the SEC in total defense and has produced more sacks (28) than any other Power Four team. It makes for a compelling matchup between Kiffin and counterpart Brent Venables, OU's defensive-minded coach. Four of the Sooners' seven opponents have scored seven points or fewer. The Rebels are averaging 37.4. What will give?\nIf Chambliss is cooking, it will put some pressure on the Oklahoma offense to deliver. So far, Washington State transfer John Mateer has been a game-changer at quarterback for the Sooners, but it's the season's finishing stretch that will ultimately define his 2025 campaign.Oklahoma vs. Ole Miss: Need to know  Ole Miss defense must produce: Ole Miss coach Lane Kiffin likened quarterback Trinidad Chambliss' performance in last week's loss at Georgia to a pitcher throwing \"almost no-hit ball\" for six or seven innings. The Rebels hit a wall in the fourth quarter, however. But if you take a step back, the Rebels' loss to Georgia was less about the offense struggling late and more about the fact that the defense didn't produce a single stop. Georgia scored on every possession until it was time to take a knee and run out the clock. If the Rebels are going to beat Oklahoma, their defense will need to be significantly better.Blaylock's breakthrough: Oklahoma finally seemed to get some traction on the ground during last week's win at South Carolina. Running back Tory Blaylock earned SEC Freshman of the Week honors for totaling 101 yards and a touchdown on 19 carries. It was a welcome sight for the Sooners, who hadn't previously averaged four yards per carry in a game against against a Power Four opponent. The Ole Miss run defense has been vulnerable this season with all but one opponent averaging 4.5 yards or more per attempt. The door is open for Blaylock to stack consecutive strong performances.\nPermanent opponents: Ole Miss and Oklahoma are set to play annually from 2026-29. Among the criteria in determining the three annual opponents for each SEC team were traditional rivalries, competitive fairness and geography. Ole Miss and Oklahoma are not particularly close to each other, and they had not played in the 21st century until last season. Nevertheless, the Rebels and Sooners will become quite familiar with each other in the years ahead. Ole Miss coach Lane Kiffin noted after the announcement that the pairing \"doesn't make any sense at all.\"  Where to watch Oklahoma vs. Ole Miss live  Date: Saturday, Oct. 25 | Time: 12 p.m. ET  Location: Memorial Stadium -- Norman, Oklahoma  TV: ABC | Live stream: Fubo (Try for free)Oklahoma vs. Ole Miss prediction, picks  \nWith quarterback John Mateer closer to 100% healthy now than he was for a loss to Texas two weeks ago, Oklahoma is becoming a complete team again. The Sooners have the best defense Ole Miss has faced this season, and a healthy Mateer makes them a well-rounded group. The Washington State transfer has enough playmaking ability and the weapons around him to expose the weaknesses in the Rebels' defense after Georgia found plenty of them last week. Defensively, the Sooners are elite and the rare unit capable of slowing Ole Miss down. Look for Oklahoma to pull away for a big win in front of its home crowd. Pick: Oklahoma -5.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            OU -4.5\n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Oklahoma\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ole Miss\n                    \n    \n    SportsLine's proven computer model has simulated every Week 9 college football game 10,000 times. Visit SportsLine now to see all the picks, all from the model that is 42-30 since the beginning of last season on top-rated money-line and over/under picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oklahoma vs. Ole Miss prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/05701722-cc0b-44ef-b684-b3974918ddd6/thumbnail/1200x675/db0667a9193c30017460e1742ded18ff/john-mateer-oklahoma-vs-south-carolina.jpg"
      ],
      "datePublished": "2025-10-23T19:50:19.000Z",
      "dateModified": "2025-10-23T19:50:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Missouri vs. Vanderbilt prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/missouri-vanderbilt-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/8126851f-15be-4cd4-a8ac-4b76edb388ea/thumbnail/1200x675/54cd9780132fab566f39f425a0f63ac9/eli-stowers-vanderbilt-vs-missouri.jpg",
    "tag": "Sports",
    "date": "2025-10-23T19:51:46.000Z",
    "description": "\n        No. 10 Vanderbilt hosts No. 15 Missouri Saturday afternoon in a game with major implications for both the SEC and the College Football Playof",
    "body": "\n        No. 10 Vanderbilt hosts No. 15 Missouri Saturday afternoon in a game with major implications for both the SEC and the College Football Playoff races. This will be the 17th meeting all-time between the two former SEC East foes and the last between the two until 2027 when the SEC expands to nine conference games. Missouri holds a 12-4-1 all-time record against Vanderbilt. The Tigers have not lost to the Commodores since 2019 and have won three of the last five matchups by at least two possessions. But this is a different Vanderbilt team. The Commodores took Missouri to two overtimes last season and they're favored as they return home to Nashville. They're coming off of a 31-24 win against LSU, which was their second triumph against a top-15 team -- LSU ranked 10th entering the Week 8 slate -- this season. Vanderbilt is also undefeated at home. Missouri, meanwhile, faced one of its biggest tests of the season in Week 8. The Tigers triumphed in overtime at Auburn, avoiding a disastrous loss to an unranked opponent and keeping both their SEC and playoff hopes alive in the process. Saturday marks just the second away game Missouri has played all season, as the Tigers went 5-1 in a six-game homestand to open the year. \nMissouri vs. Vanderbilt: Need to know  Vanderbilt continues making history: There are no doubts about it -- this Vanderbilt team is legit. Not only are the Commodores good, but they continue setting new bars of historical success under coach Clark Lea. Vanderbilt is seeking its third win against an AP top-15 opponent this season. This is already the first time that the Commodores have defeated multiple top-15 foes in the same year. Their own No. 10 ranking is the highest they've ascended in the AP poll since Week 2 of the 1947 season. Not to be outdone, Vanderbilt's 6-1 record is its best seven-game start since 1950. Missouri finding success on both sides of the ball: Missouri is a complete football team. The Tigers are one of just three FBS programs to rank top-10 nationally in both total offense (486.6 yards per game) and total defense (243 ypg). The others? No. 2 Indiana and No. 6 Oregon. Missouri is also allowing just 16.7 points per game while scoring 39 on average. The Tigers have an elite rushing attack to thank for most of their offensive success. Star running back Ahmad Hardy is leading the way in a ground game that's tallied 840 yards rushing this season, which is third-most in the FBS. Third downs will be crucial: Third downs are always important, but Saturday's clash pits two of the best third-down teams against one another. Vanderbilt ranks second in the FBS with a 55.7% conversion rate on third downs. Commodores quarterback Diego Pavia is particularly excellent in crucial situations with his ability to improvise. He'll have his hands full against a Missouri defense that allows other teams to convert on just 27.5% of first downs, which is seventh in the FBS. \n  Where to watch Missouri vs. Vanderbilt live  Date: Saturday, Oct. 25 | Time: 3:30 p.m. ET  Location: FirstBank Stadium -- Nashville, Tennessee  TV: ESPN | Live stream: Fubo (Try for free)Missouri vs. Vanderbilt prediction, picks  \nThis will be a very tightly contested game. Missouri and Vanderbilt are fairly even in most metrics. Both have play-making quarterbacks that can cause nightmares for a defense. Both have defenses that rank in the upper half of a tough SEC. That's especially impressive for a Vanderbilt team that has played three top-15 teams thus far. The Commodores get homefield advantage in an improved FirstBank Stadium and they'll pull out a thrilling win to continue on their march toward the College Football Playoff. Pick: Vanderbilt -2.5 (-118) \n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            Vandy -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Missouri\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Missouri\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Missouri\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Vanderbilt\n                    \n    \n    SportsLine's proven computer model has simulated every Week 9 college football game 10,000 times. Visit SportsLine now to see all the picks, all from the model that is 42-30 since the beginning of last season on top-rated money-line and over/under picks. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Missouri vs. Vanderbilt prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/8126851f-15be-4cd4-a8ac-4b76edb388ea/thumbnail/1200x675/54cd9780132fab566f39f425a0f63ac9/eli-stowers-vanderbilt-vs-missouri.jpg"
      ],
      "datePublished": "2025-10-23T19:51:46.000Z",
      "dateModified": "2025-10-23T19:51:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]