[
  {
    "title": "Commanders losing command: Daron Payne ejection for punching Lions' Amon-Ra St. Brown is latest adversity - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/commanders-daron-payne-ejected-for-punching-lions-wr-amon-ra-st-brown/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/c6a72822-e673-4594-a469-c628e0769765/thumbnail/1200x675/578b1da17ee7f06c4fc56c6428a4693a/daron.jpg",
    "tag": "Sports",
    "date": "2025-11-10T03:39:54.000Z",
    "description": "\n        The Washington Commanders' downward spiral appears to have no end in sight. During their fifth consecutive loss, a 44-22 blowout by the Detro",
    "body": "\n        The Washington Commanders' downward spiral appears to have no end in sight. During their fifth consecutive loss, a 44-22 blowout by the Detroit Lions, which is also Washington's fourth straight defeat by at least 20 points, it appears that frustrations have reached the boiling point. In the second quarter, Lions running back Jahmyr Gibbs rushed for a 13-yard touchdown to extend Detroit's lead to 17 points. After the play, Commanders defensive lineman Daron Payne turned around and punched Lions wideout Amon-Ra St. Brown in the face. Payne was subsequently ejected from the game.Check out what happened, here:\nThe penalty gave the Lions an even shorter field to attempt a two-point conversion. David Montgomery punched in the two-pointer to extend the lead to 19 points, and that's when another Commander lost his cool, as Javon Kinlaw was given a 15-yard unsportsmanlike conduct penalty for making contact with an official. \nNot much has gone right for the Commanders this season. After a thrilling win over the Los Angeles Chargers in Jayden Daniels' \"homecoming\" game on Oct. 5 not much has gone right for Washington. The Commanders have been outscored by 88 points in their last four games. Remember, this is a franchise that was looking for even bigger things in 2025 after last season's magical 12-5 campaign that ended with a loss to the Eagles in the NFC Championship just 10 months ago. \nSo why has Washington's season been a disaster? There are a couple of different reasons. Jayden Daniels' availabilityIt was clear last year that Washington found a franchise quarterback in Daniels. However, even as an NFL prospect, his durability was a question mark. The No. 2 overall pick in the 2024 NFL Draft didn't miss a single start as a rookie, but missed three contests through the first eight weeks of this season. That number is going to increase with Daniels suffering a dislocated elbow last week in the loss to the Seattle Seahawks.Any team missing its starting quarterback is going to struggle. That's especially true when we're talking about a talent like Daniels -- who almost took a struggling franchise to the Super Bowl in his first season. When Daniels suffered a hamstring injury in the Week 7 loss to the Dallas Cowboys, Daniels' mother took to social media to ask fans to stop \"manifesting\" Robert Griffin III on her son. Unfortunately, those comparisons exist for a reason. \nThe defenseDaniels' availability is not the only reason why Washington has struggled this year. In fact, you could make the argument the defense has been much more of a factor why Washington has gone from NFC contender to afterthought. The Commanders entered this week allowing an average of 377.8 yards per game (fifth-worst in the NFL), 253.6 passing yards per game (fourth-worst in the NFL) and 26.2 points per game (10th-worst in the NFL). This Dan Quinn defense allowed 33 of 35 completions for 492 passing yards and seven touchdowns in a four-quarter span from the second half of Week 8 at the Kansas City Chiefs, to the first half against Seattle last Sunday night. Things won't get any better for Washington either, as they just lost starting cornerback Marshon Lattimore for the remainder of the season due to a torn ACL.To put it bluntly, the Commanders are struggling on both sides of the ball, and that's why they won't be making the playoffs this year. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Commanders losing command: Daron Payne ejection for punching Lions' Amon-Ra St. Brown is latest adversity - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/c6a72822-e673-4594-a469-c628e0769765/thumbnail/1200x675/578b1da17ee7f06c4fc56c6428a4693a/daron.jpg"
      ],
      "datePublished": "2025-11-10T03:39:54.000Z",
      "dateModified": "2025-11-10T03:39:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use FanDuel promo code, get $150 bonus bets by betting Seahawks-Cardinals, Chargers-Steelers, Commanders-Lions - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-fanduel-promo-code-get-150-bonus-bets-betting-seahawks-cardinals-chargers-steelers-commanders-lions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg",
    "tag": "Sports",
    "date": "2025-11-09T19:48:42.000Z",
    "description": "\n        NFL Sunday is an ideal time to use the latest FanDuel promo code offering new users $150 in bonus bets if their first $5 bet wins. The Week 1",
    "body": "\n        NFL Sunday is an ideal time to use the latest FanDuel promo code offering new users $150 in bonus bets if their first $5 bet wins. The Week 10 NFL schedule is loaded with must-see matchups, including the first-place Seahawks against the Cardinals, a rematch of a postseason matchup last season in Commanders vs. Lions, and Chargers vs. Steelers on Sunday Night Football.Picks from all three of those games will be among our Sunday NFL best bets from SportsLine's team of experts and the SportsLine Projection Model. Claim the latest FanDuel promo code, where new users get $150 in bonus bets if your first $5 bet wins: Check out our FanDuel promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 10 on a sizzling 47-29 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Sunday NFL best bets at FanDuel SportsbookOver 44.5 points in Seahawks vs. Cardinals (-114)Lions -7.5 vs. Commanders (-115)Steelers +2.5 vs. Chargers (-102)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +595 (risk $100 to win $595). Bet it at FanDuel here:\nOver 44.5 points in Seahawks vs. Cardinals (-114)\"The Seahawks are 3-1 to the Over at home this season, and have scored 27+ points in 5/8 games. The Cardinals offense has been far more efficient with backup QB Jacoby Brissett at the helm,\" SportsLine NFL expert Daniel Vithlani said. \"Both defenses will be missing a number of starters- Arizona is down starting CBs Max Melton & Will Johnson, along with LBs Mack Wilson & B.J Ojulari. The Seahawks will likely be without LB Ernest Jones and CB Josh Jobe. I expect a competitive game that goes over the total with a 27-24 type of score.\" Back the Over at FanDuel Sportsbook:Lions -7.5 vs. Commanders (-115)The Washington Commanders (3-6) will host the Detroit Lions (5-3) in Week 10 and it's a rematch from the NFC divisional round last season. Washington won that playoff matchup 45-31 as an 8-point underdog in Detroit, but will be without Jayden Daniels (elbow) and Terry McLaurin (quad) this time around. Meanwhile, the Lions are coming off a disappointing 27-24 loss at home to the Vikings last week and have now lost two of three. Back Detroit at FanDuel Sportsbook:Steelers +2.5 vs. Chargers (-102)The Chargers are 6-3 overall, but they've failed to cover the spread in five of their last six games. The Steelers, on the other hand, have covered the spread in four of their last five games and should be riding high after knocking off the Colts as underdogs last week. The Los Angeles offensive line has been decimated by injuries, with Joe Alt and Rashawn Slater both suffering season-ending injuries. T.J. Watt should feast and that's a big reason why the model predicts that the Steelers cover in 53% of simulations. Back Pittsburgh at FanDuel Sportsbook:\nWant more Sunday NFL picks?You've seen some of the model's best bets for Sunday. Now, get against the spread, total and money-line picks for NFL, NBA, college football, college basketball and more here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $150 bonus bets by betting Seahawks-Cardinals, Chargers-Steelers, Commanders-Lions - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/02/fe95932b-5da0-4e2c-9789-0ca8252ef0e5/thumbnail/1200x675/798fe24d9a1a597377ee33abf2c20d5b/fanduel-nfl-1.jpg"
      ],
      "datePublished": "2025-11-09T19:48:42.000Z",
      "dateModified": "2025-11-09T19:48:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USC women's basketball stuns No. 9 NC State, shows potential without JuJu Watkins - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/womens-college-basketball/news/usc-womens-basketball-potential-without-juju-watkins-top-10-win-nc-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/3f6f8c8a-886f-4ec9-b190-6eec5fc58c77/thumbnail/1200x675/5fe422f844e4c812166fa222453b00e2/usc-ally-tipoff-charlotte.png",
    "tag": "Sports",
    "date": "2025-11-10T02:43:53.000Z",
    "description": "\n        The No. 18 USC Trojans are playing this season without star JuJu Watkins, who tore her ACL in the NCAA tournament last spring, but their firs",
    "body": "\n        The No. 18 USC Trojans are playing this season without star JuJu Watkins, who tore her ACL in the NCAA tournament last spring, but their first big test resulted in a gusty 69-68 win against No. 9 NC State on Sunday. The game was by no means perfect, but it showed the potential of Lindsay Gottlieb's squad and could be a confidence builder as USC takes on South Carolina next weekend.The Wolfpack is a very young group with no seniors on the roster, but it came into the 2025 Ally Tipoff game against USC on the coattails of an 80-77 win over No. 8 Tennessee in its season opener on Tuesday. Gottlieb knows the Trojans are still adjusting to the absence of Watkins and other key players from last season. However, the coach likes what she sees from her players so far.\"Everybody's sort of in a new role,\" Gottlieb said on Sunday. \"We just think it's a great opportunity for others. This is the way we want to play. We want to play fast and fluid. We're trying to play a more open, pro-style offense, where there's a lot of reads and options and putting people in different spots. We're always going to play hard and tenaciously on the defensive end and want to play fast and all the different things. \n\"And I think that's what the players bought into. But there's also different people in new roles and opportunities and that's a lot to take on. From someone in their first college game, to someone in their first time in a USC uniform being asked to take on a lot more, which is a great, awesome opportunity. I love coaching us, but I think we've got a lot of growing to do as well, which is exciting.\"After an 87-48 win against New Mexico State in their season opener and the AP Top 10 win over NC State, the Trojans are 2-0. This might not be a team ready to compete for a national championship yet, but there are some good things we have seen from the Trojans so far.Jazzy Davidson is as good as advertisedDavidson, the No. 3 player of the class of 2025, arrived in Los Angeles with high expectations due to her high basketball IQ, quickness and versatility. She has the skills of a guard, while her 6-foot-1 height helps her as a defender on the perimeter.\nShe went just 5 of 26 from the field in her first three halves as a Trojan. However, she continued helping in other ways while her shots were not falling. She properly introduced herself to college basketball in the second half against NC State, when she started 4 of 4 from the field while still maintaining her defensive intensity. The freshman, who is mentored by Watkins, did a little bit of everything in the Trojans' win against the Wolfpack. She scored a team-high 21 points, along with four rebounds, four assists, three steals and five blocks. \"I'm just blessed with amazing coaches and teammates,\" Davidson said on Sunday. \"They really keep me grounded in situations like that, when my shots are not falling as much as I'd like it to, and I'm just really grateful for them.\"\nLondynn Jones might be an X factorX factor, spark, call it whatever you want. The fact is that UCLA transfer Londynn Jones has been impactful in her first two games as a Trojan. Against NMSU, Jones went 0 for 3 from beyond the arc but still shot over 54% from the field to contribute 16 points. On Sunday, she scored 19 points while being the spark that kept USC competitive in the first half when hardly anybody else could buy a shot.Jones was a starter with the Bruins but has so far come off the bench for the Trojans. During the 2023-24 season, Jones set UCLA's single-season record for 3-pointers made with 87. She hasn't been the most efficient shooter in her college career --- she hasn't had a season in which she shoots over 37% from the field or averaged more than 12 points per game -- but the potential for her to make a significant impact on this roster is certainly there. \"I think practice is never enough,\" the senior said on Sunday. \"I think that what you do in practice, you kind of see what you can work on, what you need to get better at. I think just film, we have a lot of film sessions, so just understanding that he work that's being put in. When you're putting it in work, getting the reps, it comes naturally and you don't really have to think about it.\"\nKennedy Smith is still impactful Smith started 28 games for the Trojans last season and was expected to be the team's key returner in this rebuilding year. She shot over 41% from the field as a freshman while averaging 9.5 points per game and leading the team in steals. The shots haven't been falling for her early in her sophomore year, as she has gone 7 of 26 in the first two games. Despite those struggles, she was still one of the top contributors on Sunday with 10 points and 8 rebounds. She made back-to-back layups halfway through the fourth quarter while USC was coming back from a double-digit deficit. She also got the assist for Davidson's game winner. \"I think what makes Kennedy such an elite player is that she can impact the game without scoring,\" Gottlieb said. \"We know she's capable of scoring, and I think she had a couple of really critical buckets down the stretch. But she's unique in that she makes other elite players better. She could have the ball in her hands and feel the defense and spray it. \n\"She can score inside and out and we know she's capable of making shots, and those shots will fall. But she's taking on a lot more in only her sophomore year, trying to get the ball to be a playmaker and a shot distributor and scorer. But she's elite defensively, she's all over the boards. And just a competitiveness about her that I think other people are like, 'okay, we can get a stop. We can make a play no matter what's happening on the offensive end.'\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USC women's basketball stuns No. 9 NC State, shows potential without JuJu Watkins - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/3f6f8c8a-886f-4ec9-b190-6eec5fc58c77/thumbnail/1200x675/5fe422f844e4c812166fa222453b00e2/usc-ally-tipoff-charlotte.png"
      ],
      "datePublished": "2025-11-10T02:43:53.000Z",
      "dateModified": "2025-11-10T02:43:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dan Campbell addresses taking over as offensive play-caller for Lions vs. Commanders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dan-campbell-addresses-taking-over-as-offensive-play-caller-for-lions-vs-commanders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/813529e0-d569-4b4b-9b72-46ccfa605585/thumbnail/1200x675/433bcab780256a9ee839dcc32b8ecff3/dan-c.jpg",
    "tag": "Sports",
    "date": "2025-11-10T02:01:26.000Z",
    "description": "\n        The Detroit Lions had a new offensive play-caller for their Week 10, 44-22 victory against the Washington Commanders, as coach Dan Campbell c",
    "body": "\n        The Detroit Lions had a new offensive play-caller for their Week 10, 44-22 victory against the Washington Commanders, as coach Dan Campbell confirmed postgame that he took over duties from offensive coordinator John Morton.It was something seemingly everyone, from fans to members of the broadcast, were speculating about. Campbell was seen wearing reading glasses, holding a play sheet and speaking into the headset in between plays. Campbell said afterwards he wanted to change things up a bit to find a rhythm, and emphasized that it was still a collaborative effort. \"It was just, let's try something a little different,\" Campbell said in his postgame press conference. \"Look, I know what I want to do, I know how I want to do it. Now, that being said, this is a collaborative effort. I was taking input from John Morton that whole time, and the other coaches ...\" Campbell said Morton was \"all team\" and \"outstanding today.\" While Washington's defense is not exactly the '85 Bears, the Lions racked up 546 yards of total offense, 30 first downs and did not punt once. \nThe Lions' offense has not been terrible this season. They entered Sunday ranked No. 11 in the NFL (350.8 total yards per game) and No. 2 in scoring offense (29.9 points per game). This unit also averaged 2.8 plays of 25 or more yards per game through nine weeks, which ranked second in the NFL. However, Detroit did suffer a surprising 27-24 loss to the Minnesota Vikings in Week 9. It was surprising for several reasons, as Detroit was coming off a bye week and favored by around nine points as the Vikings reintroduced quarterback J.J. McCarthy to the starting lineup. That loss marked the Lions' first at home this season.In that Week 9 loss, the Lions offense went 5 of 17 on third downs, and recorded 15 first downs to go along with 305 yards of total offense. There were a couple things that stood out: Quarterback Jared Goff was under considerable pressure, as his offensive line allowed five sacks for first time since 2023. Plus, star running back Jahmyr Gibbs recorded a career-low 28 yards from scrimmage. This Sunday, he had 172 yards from scrimmage and three total touchdowns. Morton, who was hired away by the Lions from the Denver Broncos after serving as their passing game coordinator for the past two seasons, replaced Ben Johnson as offensive coordinator this season. He has worked under Campbell before, serving as Detroit's senior offensive assistant for the 2022 season before leaving for Denver.\nIt would appear Campbell is going to remain the Lions' offensive play-caller moving forward, but he made it clear this is a task that he's not taking on alone. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dan Campbell addresses taking over as offensive play-caller for Lions vs. Commanders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/813529e0-d569-4b4b-9b72-46ccfa605585/thumbnail/1200x675/433bcab780256a9ee839dcc32b8ecff3/dan-c.jpg"
      ],
      "datePublished": "2025-11-10T02:01:26.000Z",
      "dateModified": "2025-11-10T02:01:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aaron Rai wins in Abu Dhabi playoff as Rory McIlroy extends Race to Dubai lead - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/aaron-rai-edges-tommy-fleetwood-in-2025-abu-dhabi-championship-rory-mcilroy-extends-race-to-dubai-lead/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/e0814448-9871-4f3b-9206-4ba4fb352eb6/thumbnail/1200x675/f6ad1abbaf65d3c02027e44621cfb560/aaron-rai-abu-dhabi-g.jpg",
    "tag": "Sports",
    "date": "2025-11-09T23:42:55.000Z",
    "description": "\n        ABU DHABI, United Arab Emirates (AP) -- Aaron Rai of England overcame a shocking short miss with a pair of late birdies for a 5-under 67 and ",
    "body": "\n        ABU DHABI, United Arab Emirates (AP) -- Aaron Rai of England overcame a shocking short miss with a pair of late birdies for a 5-under 67 and defeated Tommy Fleetwood on the first playoff hole with a 10-foot birdie putt to win the Abu Dhabi Championship on Sunday.Rai returned from a two-month break to win for the first time this year and pick up his third European tour title -- his first on the tour since defeating Fleetwood in the 2020 Scottish Open. He won the Wyndham Championship in August 2004 for his first PGA Tour title.Rory McIlroy started the back nine at Yas Links with five straight birdies and closed with a 62, matching his low score on the European tour. He wound up one shot behind, but expanded his lead in the Race to Dubai that concludes next week.Fleetwood was aiming for a third title worldwide in what already has been a memorable season that included a 4-1 record in a winning Europe Ryder Cup team. He holed a 15-foot birdie putt on the 16th and made a 15-foot par putt to stay tied with Rai on the 17th.\nBoth narrowly missed birdie chances in regulation on the par-5 18th. Fleetwood shot 66 to join Rai on 25-under 263.They finished one shot ahead of McIlroy and Nicolai Hjogaard of Denmark, who just missed a 15-foot eagle putt on the final hole to join the playoff. He closed with a 66.\"It's hard to put into words how this feels,\" Rai said. \"It's amazing to be here.\"\nIt was a tight battle on a day for low scoring, and the 30-year-old Rai fell out of the lead when his 3-foot par putt on the 14th spun hard out of the cup. Then, he had to scramble for par on the 15th, making a 6-foot putt.But he hit 5-iron to 8 feet on the 16th for birdie to stay within one shot of Fleetwood, who holed a 15-foot birdie. Rai made from 18 feet on the par-3 17th to reach 25 under, and Fleetwood had to make his 15-foot putt for par to stay tied.The playoff became a pitch-and-putt contest as neither had the length to reach the 616-yard in two shots. Fleetwood's birdie chance missed to the right, and Rai converted.\nRai came into the week at No. 55 in the Race to Dubai and the victory moved him to No. 9 to qualify for the season-ending DP World Tour Championship next week in Dubai for the top 50. Matthew Jordan tied for 15th to earn the 50th spot.McIlroy, the defending champion next week, will be going for his seventh title as Europe's No. 1 and created a bigger cushion with his runner-up finish in Abu Dhabi.Marco Penge of England closed with a 63 to tie for ninth, but he is now 767 points behind, with 2,000 points to the winner in Dubai.\n\"I just tried to keep my foot down and make as many birdies as possible knowing that, OK, I'm trying to win this tournament but also give myself the biggest cushion possible going into Dubai next week, as well,\" McIlroy said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aaron Rai wins in Abu Dhabi playoff as Rory McIlroy extends Race to Dubai lead - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/e0814448-9871-4f3b-9206-4ba4fb352eb6/thumbnail/1200x675/f6ad1abbaf65d3c02027e44621cfb560/aaron-rai-abu-dhabi-g.jpg"
      ],
      "datePublished": "2025-11-09T23:42:55.000Z",
      "dateModified": "2025-11-09T23:42:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Griffin joins Scottie Scheffler, Rory McIlroy with third win of 2025 season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/world-wide-technology-championship-leaderboard-ben-griffin-2025-pga-tour/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/3cb9d535-e961-4a70-b847-a8f140da3236/thumbnail/1200x675/e7fd3186a3dba8a2b63fe1e1bc0e6bf0/ben-griffin-wwt-g.jpg",
    "tag": "Sports",
    "date": "2025-11-09T23:48:00.000Z",
    "description": "\n        LOS CABOS, Mexico (AP) -- Ben Griffin avoided the mistakes that slowed his two challengers Sunday and rolled in three long birdie putts for a",
    "body": "\n        LOS CABOS, Mexico (AP) -- Ben Griffin avoided the mistakes that slowed his two challengers Sunday and rolled in three long birdie putts for a 9-under 63 to win the World Wide Technology Championship for his third PGA Tour title of the season.Griffin two-putted for birdie on the par-5 18th at El Cardonal at Diamante for a two-shot victory. He joined Scottie Scheffler and Rory McIlroy as the only players with at least three wins, with one of those for Griffin a team event in New Orleans.Griffin, playing for the second time since his Ryder Cup debut, ran off five straight birdies starting at No. 8. That included a 40-foot putt on the par-3 11th to tie the lead, a 25-foot putt on the 12th for his first lead and a 25-foot putt on the par-3 16th that all but sealed it.He made birdie on all four of the par 3s.\"After making a few birdies early, I kind of pushed myself a little bit harder than the past few weeks when I was in contention to kind of keep the pedal down,\" Griffin said. \"Fortunately, the putter heated up, made a lot of putts on the back nine. It was fun feeling the nerves down the stretch trying to hold things off. It was nice to make a couple down the stretch.\"\nGriffin moves to a career-best No. 9 in the world ranking.Sami Valimaki (64) and Chad Ramey (65) tied for second and picked up a valuable consolation. Valimaki started the week at No. 103 in the FedEx Cup and moved to No. 76, assuring a full card for next year. Ramey went from No. 123 to No. 89 and is likely safe to keep his card.Two tournaments remain before the top 100 in the FedEx Cup keep full status for 2026.\"These last three tournaments, only goal was to kind of keep the playing rights for the next year, so I think they should be a done deal with this finish,\" Valimaki said.\nGriffin's biggest challenge came from Garrick Higgo and Carson Young, who shared the lead going to the back nine on another day of virtually no wind.Higgo's came undone with a tee shot into a bush on No. 12 that required him to take a penalty for an unplayable lie, leading to a double bogey. He shot 68 and finished three behind.Young made a 15-foot birdie putt on the 12th and was tied with Griffin at 27 under.\nBut his approach on the 13th went left down a slope, across a cart path and into the native area. He made bogey, hit a pedestrian pitch on the par-5 14th that kept him from a good look at birdie, and then three-putt for bogey on the 15th. He shot 68 and tie for sixth.Griffin had no such issues aside from a three-putt bogey on the fifth hole. He was rock solid from there and finished at 29-under 259.And his year is not over. He is getting married next month to Dana Myeroff.\"Crazy, three wins and getting married in the same year, hard to beat,\" Griffin said.\nHiggo moved to No. 52 in the FedEx Cup, which at least locks up a spot for him to play Pebble Beach and Riviera early next season, both $20 million signature events. He has finished no worse that a tie for seventh in his four starts during the FedEx Cup Fall.\"A lot of good stuff,\" Higgo said. \"I've been in contention the last four events, so I'm just going to keep doing what I'm doing.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Griffin joins Scottie Scheffler, Rory McIlroy with third win of 2025 season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/3cb9d535-e961-4a70-b847-a8f140da3236/thumbnail/1200x675/e7fd3186a3dba8a2b63fe1e1bc0e6bf0/ben-griffin-wwt-g.jpg"
      ],
      "datePublished": "2025-11-09T23:48:00.000Z",
      "dateModified": "2025-11-09T23:48:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Week 11 breakouts: Early waiver wire options - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-week-10-breakouts-early-waiver-wire/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/105c98ff-1606-4be5-8b3e-0cf84d0443ad/thumbnail/1200x675/b9a2b4d199176970657bb02e9733a269/gettyimages-2244680595.jpg",
    "tag": "Sports",
    "date": "2025-11-10T00:28:06.000Z",
    "description": "\n        In Week 10, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and",
    "body": "\n        In Week 10, several players jumped on the Fantasy Football radar. This could be the start of something special for some of these players, and you'll want to get well ahead of your Week 11 Fantasy Football waiver wire by putting these players on your radar. For more on every player we discuss below, you'll want to make sure to check out Jamey Eisenberg's in-depth waiver wire column on Monday afternoon.Jalen Nailor, WR,  VikingsWith J.J. McCarthy at quarterback, the Vikings pass attack has a brand new look and feel. That hasn't meant good things for Justin Jefferson so far. Or Jordan Addison. But McCarthy has had no trouble getting to Nailor on those rail routes. Nailor was one of the most productive Fantasy Football wide receivers in Week 10. He racked up 124 receiving yards on five receptions and scored a touchdown. He also saw six targets. Keep an eye on McCarthy's developing rapport with Nailor as McCarthy is set to be the starting quarterback for the rest of the season. Nailor has flashed in the past on waiver wires but has not developed a consistency to stick.Kyle Williams, WR, PatriotsWilliams was a Beyond the Boxscore favorite for both Jacob Gibbs and me as we couldn't get enough of his college tape at Washington State. Williams was viewed by some NFL circles as a slot-only receiver option, causing him to fall slightly in the draft, but his 4.4 speed is real. He can threaten defenses vertically in addition to creating separation with plus route running, quickness, and lateral agility. Earlier this week, the Patriots coaching staff confirmed Williams would get more opportunities in Week 10 with Kayshon Boutte out. Williams saw just two targets but he turned one of them into a 72-yard touchdown on a deep over route crossing across the middle. He showed off speed and explosiveness that might make the Patriots coaching staff second guess taking him off the field in the second half of the 2025 season.Luther Burden, WR, BearsThe Bears drafted Burden to be a playmaker in their offense and there were some Fantasy Football analysts who projected he might take the Amon-Ra St. Brown role in Ben Johnson's offense. He hasn't been able to find steady playing time just yet, but with another dropped pass from Olamide Zaccheaus, Burden might be inching closer to taking over his role in the Bears offense. Burden is an explosive weapon who turned his three targets in Week 10 into 51 yards receiving on three receptions. \nTyler Shough, QB, SaintsWell that was unexpected! Shough found a rhythm in Week 10 and showed off an impressive ability to operate Kellen Moore's offense. He averaged over 10 yards per attempt (10.4) -- pheonemal for any quarterback let alone a rookie. He developed a rapport and found rhythm throwing to his No. 1 receiver that he struggled to get on the same page with last week in Chris Olave. Shough and Olave connected on five-of-eight targets for 104 yards and a touchdown. This included a beautiful 62-yard shot play to Olave. After losing Rashid Shaheeh (trade), Shough was able to lean on Olave and Juwan Johnson to the tune of 196 yards combine. Shough finished with 282 passing yards, two touchdowns and no interceptions.Tyler Allgeier, RB, FalconsAll Allgeier does is convert touchdowns, run hard and put together productive gains when given opportunities. At this point it's not an abberation -- it's a trend -- Allgeier is the red zone back. He continues to outtouch Bijan Robinson in red zone situations. And he converts. Allgeir is worth stashing on your bench in all leagues. \nMack Hollins, WR, PatriotsHollins continues to play a larger role in the Patriots offense tahn just about anyone projected. In Week 10, he led all Patriots receivers with a whopping 10 targets. His size on the outside is a massive plus for New England in their run game so I expect he'll continue to earn the majority of snaps as one of the two boundary receivers in this scheme. Hollins turned his 10 targets into 106 receiving yards on six receptions. An 100-yard receiving game is nothing to overlook.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Week 11 breakouts: Early waiver wire options - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/105c98ff-1606-4be5-8b3e-0cf84d0443ad/thumbnail/1200x675/b9a2b4d199176970657bb02e9733a269/gettyimages-2244680595.jpg"
      ],
      "datePublished": "2025-11-10T00:28:06.000Z",
      "dateModified": "2025-11-10T00:28:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WATCH: Texans secure comeback win with walkoff big-man touchdown by DL Sheldon Rankins - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/watch-texans-secure-comeback-win-cover-spread-with-walkoff-big-man-touchdown-by-dl-sheldon-rankins/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/7bc7566c-a613-4fad-803d-bfe32d3eacc7/thumbnail/1200x675/744ea6b8e7fd3fca3f9837f7d70810a2/sheldon-rankins-texans.jpg",
    "tag": "Sports",
    "date": "2025-11-09T23:46:57.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Not only did the Texans, backup quarterback and al",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Not only did the Texans, backup quarterback and all, manage to overcome a 29-10 fourth-quarter deficit to beat the Jaguars, 36-29, but they capped the comeback with a memorable moment.Through three quarters without C.J. Stroud (concussion), Davis Mills and company were struggling, and the Jaguars were cruising; Mills had been intercepted on the third play from scrimmage, and after Travis Etienne punched in a 6-yard touchdown late in the third quarter, it looked like it would be a straightforward win for Jacksonville.Then the tides turned. Mills threw touchdowns to Jayden Higgins and Dalton Schultz, and the Texans forced three and outs following both drives. Down 29-24, Mills produced a 14-yard touchdown run to give the hosts an improbable 30-29 lead. It was his first touchdown run since 2022.Things got even crazier. The Jaguars got the ball back with 31 seconds left, and Trevor Lawrence appeared to move Jacksonville into field goal range with a completion to Parker Washington inside Houston territory. But Chuma Edoga was called for hands to the face, putting the visitors in true dire straits: at their own 35-yard line with seven seconds left.Then this happened:\nRankins is the only player 300+ pounds to score a touchdown in franchise history, and he's now done so twice; he also had a scoop and score with Houston in 2023.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WATCH: Texans secure comeback win with walkoff big-man touchdown by DL Sheldon Rankins - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/7bc7566c-a613-4fad-803d-bfe32d3eacc7/thumbnail/1200x675/744ea6b8e7fd3fca3f9837f7d70810a2/sheldon-rankins-texans.jpg"
      ],
      "datePublished": "2025-11-09T23:46:57.000Z",
      "dateModified": "2025-11-09T23:46:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool's Premier League title defense may already be over after loss at Man City - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/liverpool-lose-man-city-premier-league-chances-take-hit/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/78cecd0b-5f1e-4949-89c4-4eb2c8d2005f/thumbnail/1200x675/a39031e6bdecccff1f781377bad5dd49/liverpool-manchester-city.jpg",
    "tag": "Sports",
    "date": "2025-11-09T19:20:00.000Z",
    "description": "\n        MANCHESTER -- Maybe it won't click for Liverpool. At the very least, it is hard to see how it is not too late for this season to coalesce int",
    "body": "\n        MANCHESTER -- Maybe it won't click for Liverpool. At the very least, it is hard to see how it is not too late for this season to coalesce into a sustained defense of the Premier League crown. It isn't just the eight-point deficit to the league leaders, a gap only one less than that which looked unbridgeable for Arsenal at this stage of last season. That isn't even the half of it.The profound problem for Arne Slot now, even after a 3-0 loss at Manchester City, is that the early-season skirmishes are over, the time to work oneself into the season long since past. Most of his squad will jet off to Europe and beyond for the final international window of 2025. When they return, they will do so to a team that has not addressed the issues that have been apparent since the Community Shield. This team cannot defend its flanks. If Mohamed Salah does not play well, neither do Liverpool, who spent $100 million-plus on three attacking players to ready themselves for a new era. From front to back, those who have kept to the standards established last season number in the minority.It would be easy for Slot to point to the decisions that went against his side, chief among them the baffling decision to disallow Virgil van Dijk's well-placed header because Andrew Robertson had been making what PGMOL termed \"an obvious action\" in Gianluigi Donnarumma's vicinity. He might also ponder how different this game would have been if Cody Gakpo had turned in at the back post five minutes before Jeremy Doku got the goal this performance of the season deserved.To do so would be to focus on the discolored leaves on one tree while around him the forest burns. This game might have been different if Liverpool scored their best chance or if Michael OIiver had had a different view of Robertson's positioning. It might have been worse if Erling Haaland had taken a bit more time over an early penalty, if Doku's leg had been a little longer to meet Nico O'Reilly's peach of a cross. Four or more wouldn't have flattered City, even if the expected goals suggest otherwise. \nScrub out the missed penalty and this game looks even in xG terms. It didn't feel it in the slightest, even in a second half where Pep Guardiola was far less impressed. The hosts might not have padded out their shot stats with the Haaland and Nico Gonzalez goals, but they were breezing into the penalty box in the first half, 10 entries to Liverpool's four. A late chance for Salah might have balanced out the xG but the game had long since tilted away from this shadow of their best selves.\n                                                                    TruMedia\n                                                            And yes, Liverpool had looked like the team of old on Tuesday night in a deserved win over Real Madrid. Perhaps, in retrospect, that game would have looked very different if Conor Bradley hadn't played out of his skin or if Vinicius Junior had been a little more purposeful in his attacking. It was Bradley's misfortune Sunday to run into Doku at his most devastating, the City No. 11 completing seven take-ons (it felt like more) in the 74 minutes before Guardiola opted to call time on the bully ball. Liverpool ended this match with four.The problem wasn't Bradley. There are maybe a handful of fullbacks in world football who could have dealt with Doku in his current form. Liverpool threw two at him, but Dominik Szoboszlai was no more effective a shield. On the rare occasions where Salah did track back, you could see why Slot was so prepared to let him shade the defending last season.\nThat came with a presumption of output that can probably be parked for now. Like Liverpool as a whole, he seemed to be whirring back into life with dribble-heavy games against Aston Villa and Real Madrid, but after this match, it is still worth asking if those are the exceptions rather than the norm. Salah wasn't bad per se, he ended this game with a hand in six of Liverpool's seven shots and 0.44 of a meager 0.71 xG. He just wasn't the best footballer on the planet. That has been a problem for Slot ever since the Champions League elimination at Paris Saint-Germain's hands.He is not the only one to have dropped off. It was clear on Tuesday how effective the old midfield of Szoboszlai, Ryan Gravenberch and Alexis Mac Allister can be when all three were humming, but it only took Mac Allister looking leggy again for the center to lose its hold on proceedings. Meanwhile, Ibrahima Konate is not exactly having a Salah-esque contract year. If his mind has already begun drifting to the Bernabeu, he might want to consider that Real Madrid will be watching his performances this season.This, then, was a lot. And it was a lot that should be familiar to Liverpool. Opponents flying in behind their fullbacks had been a game-by-game occurrence before those back-to-back wins. Eighteen games into the season, though, those controlled and authoritative performances look like the exception, rather than the rule. They are a sign that this team can reach heights to match the best in Europe, as they could last year. What has changed in their title defense season is their ability to plumb depths no contender should be able to reach. If they are to have even a scintilla of a shot at the Premier League, this cannot happen again. The problem is, however, that it keeps on happening right now.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool's Premier League title defense may already be over after loss at Man City - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/78cecd0b-5f1e-4949-89c4-4eb2c8d2005f/thumbnail/1200x675/a39031e6bdecccff1f781377bad5dd49/liverpool-manchester-city.jpg"
      ],
      "datePublished": "2025-11-09T19:20:00.000Z",
      "dateModified": "2025-11-09T19:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL playoffs schedule, results, scores: K.C. Current nab top seed, host Gotham - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-playoffs-schedule-scores-results/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/ae8022f9-ec2d-45a1-9868-2acf04f6161f/thumbnail/1200x675/862a7ae02c046c941b056454ed1ab954/untitled-design-2025-11-03t155726-584.png",
    "tag": "Sports",
    "date": "2025-11-09T22:20:03.000Z",
    "description": "\nA mix of familiar faces and newcomers make up the latest batch of playoff teams in the NWSL, the last teams standing officially targeting a spot in t",
    "body": "\nA mix of familiar faces and newcomers make up the latest batch of playoff teams in the NWSL, the last teams standing officially targeting a spot in the NWSL Championship on Nov. 22.Five teams from last season's playoffs are back for another stab at the league's top prize, including each of the NWSL's last four champions – the Orlando Pride, Gotham FC, the Portland Thorns and the Washington Spirit. Joining the list of top-tier contenders are the Kansas City Current, who were the runaway winners of the Shield in 2025 and ended the regular season with a 21 point advantage over second place, arguably making them the favorites to win the NWSL Championship for the first time in club history.The San Diego Wave and 2023 Championship finalists Seattle Reign are back after a one year absence from the postseason, while Racing Louisville are in the playoffs for the first time in club history after booking the final berth with a win on Decision Day.All paths eventually lead to the NWSL Championship on Nov. 22, which will take place at San Jose's PayPal Park. The match kicks off at 8 p.m. and will be broadcast on CBS and Paramount+.2025 NWSL Playoffs bracket\n2025 NWSL Playoffs scheduleAll times U.S./EasternQuarterfinalsFriday, Nov. 7Orlando Pride 1, Seattle Reign 0Saturday, Nov. 8Washington Spirit 1, Racing Louisville 1 (Spirit win on PKs, 3-1)Sunday, Nov. 9Gotham FC 2, Kansas City Current 1Portland Thorns vs. San Diego Wave, 3 p.m. (ABC)SemifinalsMatches to take place during the weekend of Nov. 15 and 16Kansas City Current/Gotham FC vs. Orlando Pride/Seattle Reign, time TBAWashington Spirit/Racing Louisville vs. Portland Thorns/San Diego Wave, time TBAFinalSaturday, Nov. 22Teams TBD, 8 p.m. (CBS. Paramount+)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL playoffs schedule, results, scores: K.C. Current nab top seed, host Gotham - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/ae8022f9-ec2d-45a1-9868-2acf04f6161f/thumbnail/1200x675/862a7ae02c046c941b056454ed1ab954/untitled-design-2025-11-03t155726-584.png"
      ],
      "datePublished": "2025-11-09T22:20:03.000Z",
      "dateModified": "2025-11-09T22:20:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL Playoffs favorites KC Current stunned by Gotham FC in quarterfinals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-playoffs-2025-gotham-fc-beat-kansas-city-current-upset/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/0974066d-6e8c-45d2-be78-c06e71fcd64a/thumbnail/1200x675/d8aeda3b244b68b4453988c1d8befac3/gothamfc.jpg",
    "tag": "Sports",
    "date": "2025-11-09T21:54:32.000Z",
    "description": "\n        There are favorites and then there are the Kansas City Current, whose championship credentials make up a very long list. They were not only t",
    "body": "\n        There are favorites and then there are the Kansas City Current, whose championship credentials make up a very long list. They were not only the No. 1 seed in the postseason, becoming the NWSL's newest Shield winners in the process. The Current were far and away the best team in the regular season, winning the Shield in record time and finishing 21 points above the second-place Washington Spirit. They have also hoarded an impressive batch of attacking talent, a fail-safe that should be enough to overcome any challenge, especially a quarterfinal match against the lowest-seeded team in the postseason.Playoffs by nature, though, adhere to a different set of rules. Only in the playoffs would the Current be forced to prove their worth against an out-of-form Gotham FC side that had slid all the way down to eighth place on Decision Day – and only in the playoffs would their hopes of winning their first-ever NWSL Championship over on the very day their quest began. The very same Gotham that took part in a dispiriting defeat to the North Carolina Courage a week ago delivered the first upset of the NWSL playoffs in dramatic fashion, scoring in the 121st minute to eliminate the Current on Sunday.There will be some asterisks next to the Current's defeat, naturally. The No. 1 vs. No. 8 tag was a bit of a misnomer here, Gotham's Jaedyn Shaw indicating as much post-match when she said, \"Underdog my ass. We're not underdogs.\" The Current were also without the golden boot winner and last season's MVP Temwa Chawinga, as well as rising U.S. women's national team star Michelle Cooper while starter Bia Zaneratto played with a sprained MCL. Gotham, too, were without 2023 Women's World Cup winner Esther Gonzalez, who scored around 40% of the team's goals this season. The conditions were imperfect for both sides and made for an imperfect match, but one that tested both teams' game-planning as a result.In a frigid Kansas City, quality shots were few and far between for much of the game, neither side mustering more than 0.7 expected goals each until the game's opening goal. Shaw's strike ended up coming from a rare defensive lapse from the Current – Emily Sonnett pinged a ball from the midfield line towards Shaw, the Current defense out of sorts in a rare moment. Shaw then went for goal and managed to get the shot off despite having a body on her, giving her side the lead.\nShaw's goal marked a sign of Gotham's progress during an inconsistent season, especially in attack. The 2023 NWSL champions have been overly reliant on Gonzalez, their attack unable to replace the output of the departed Lynn Biyendolo and Yazmeen Ryan for much of the season. Shaw's arrival in September, though, has added another gear to an unfinished attack and allows head coach Juan Carlos Amoros to at least temporarily solve some problems ahead of what could be an important offseason regardless of postseason results.Gotham then paid the price for their time-wasting efforts down the stretch and in the end, a surprise error from goalkeeper Ann-Katrin Berger proved costly. The Current found an equalizer in the sixth minute of stoppage time courtesy of surprise hero Ellie Wheeler, finding a sliver of space that goalkeeper Ann-Katrin Berger left unoccupied by the post and slotting the ball past her to ensure the teams would play a round of extra time.\nWheeler's goal offered the Current plenty of momentum, Berger making up for her error with a big save on Zaneatoo's attempt in the first half of extra time. As the game wore on, though, things were much more evenly contested. The two teams jointly generated just 0.61 expected goals, the game ready to break for either side by the finest of margins. Things eventually tilted in Gotham's favor – just as the fourth official indicated there would be two minutes of stoppage time before a penalty shootout proved to do the trick, Berger launched the ball from the halfway line and it eventually led to Katie Stengel scoring from close range. It was not the first time Stengel managed such a feat – she scored in extra time in Gotham's semifinal win over the Portland Thorns in 2023, en route to the game's win in the Championship.\nGotham have now reached the semifinals for a third season in a row and will face the Orlando Pride on Sunday. Both sides target a return to the NWSL Championship on Nov. 22, which will take place at San Jose's PayPal Park.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL Playoffs favorites KC Current stunned by Gotham FC in quarterfinals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/0974066d-6e8c-45d2-be78-c06e71fcd64a/thumbnail/1200x675/d8aeda3b244b68b4453988c1d8befac3/gothamfc.jpg"
      ],
      "datePublished": "2025-11-09T21:54:32.000Z",
      "dateModified": "2025-11-09T21:54:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brian Daboll to be fired? Giants coaching candidates; one big name not interested - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-fire-daboll-coaching-rumors-candidates-lane-kiffin/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/180b2cfd-eb48-4472-b397-0dc97033479a/thumbnail/1200x675/f72e252def32075f1618dedbe6f4a380/brian-daboll.jpg",
    "tag": "Sports",
    "date": "2025-11-09T21:50:39.000Z",
    "description": "\n        If you were hoping for another Ole Miss Rebel to head north and become the next head coach of the New York Giants, you might be out of luck. ",
    "body": "\n        If you were hoping for another Ole Miss Rebel to head north and become the next head coach of the New York Giants, you might be out of luck. As current coach Brian Daboll currently stands on shaky ground in East Rutherford, there has been a natural question as to who could fill his shoes if New York (2-8) were to part ways with him. Given the emergence of rookie sensation Jaxson Dart as a franchise cornerstone at quarterback, folks have drawn the logical line to giving Lane Kiffin a call to see if he'd want to reunite with his former quarterback and return to the NFL. While it makes sense on paper, judging by what Brandon Dart, Jaxson's father, had to say about that possible reunion, it doesn't sound like a realistic option. \"As we were texting on our Kiffin-Dart family text thread, because I think Boomer Esiason had said something in the media today that maybe they should throw out a potential coaching (offer) to Kiffin, and he just sent it over with a smirk and just said, 'It's too cold in New York for me.' It's just kind of funny,\" Brandon Dart told the \"Bleav in Ole Miss\" podcast, via the New York Post. \n\"But we have our weekly interactions with him and his family, and Jaxson holds high regard. I think Kiffin is one of his most trusted allies, and I think he uses him for advice in a lot of different ways, so there's constant communication between them, even today, and there's a lot of that between our families. I don't think we could have asked for a more special coach relationship between our family and our son, so we're very, very grateful for coach Kiff.\"\nKiffin coached Dart for three years at Ole Miss, which included a stellar senior season in 2024 with the quarterback throwing for 4,279 yards and 29 touchdowns while completing 69.3% of his throws. That tutelage helped him become a first-round pick at the 2025 NFL Draft, and, given the close ties they share, it would make sense for New York to see if he'd be interested in the job. While weather might be a factor for Kiffin, so is the current landscape in college football. There are a number of high-profile jobs open, including at LSU, Penn State, and Florida, where he could be a leading candidate. He could also simply stay put at Ole Miss, where he currently has the Rebels in contention for the College Football Playoff. \nEven with Kiffin as a long shot, the mere fact that this is a conversation highlights how hot the seat is under Daboll at the moment. New York finds itself after Week 10 dead last in the NFC East at 2-8, and the club is currently on a four-game losing streak. That streak includes a 33-32 loss to the Broncos in Week 7, where the Giants allowed Denver to score all of those points in a frantic fourth-quarter comeback. If Daboll, who is 20-40-1 in his 61 regular-season games as head coach of the Giants, doesn't show signs of turning it around between now and the end of the season, it could force owner John Mara's hand to make a change. And if that change isn't toward someone like Kiffin, let's highlight three other possible options. \nJesse MinterCurrent role: Defensive coordinator, Los Angeles ChargersOwnership and fans alike may want an offensive-minded head coach to further cater to Dart's development, but don't sleep on a guy like Jesse Minter, either. New York has invested heavily along the defensive line by acquiring the likes of Brian Burns, signing Dexter Lawrence to a big-money extension, and drafting Abdul Carter and Kayvon Thibodeaux inside the top five of the NFL Draft in recent years. That unit has the potential to be among the best in the NFL, and could reach that with someone like Minter at the helm, which would, in turn, help Dart and the offense. Minter, who was the defensive coordinator at the University of Michigan and followed Jim Harbaugh to the Los Angeles Chargers in the same role, has presided over some dominant defenses. In 2024, the Chargers ranked No. 1 in points allowed and are No. 6 in the league in yards allowed in 2025 (entering Week 10). Kliff KingsburyCurrent role: Offensive coordinator, Washington CommandersLast offseason, we saw former Lions offensive coordinator Ben Johnson accept a head coaching job in the division with Chicago, so maybe Kingsbury could be the latest to follow that track. Kingsbury has done wonders for the Commanders offense with a young Jayden Daniels, and could bring a similar boost to Dart's development in New York. On top of being one of the top offensive minds in the NFL, he also comes with prior head coaching experience, leading the Arizona Cardinals from 2019 to 2022. Kingsbury went just 28-37-1 over that tenure, but it did include an 11-6 record in 2021. \nKlint KubiakCurrent role: Offensive coordinator, Seattle SeahawksKubiak is expected to be a popular name this upcoming hiring cycle, especially after he has turned the Seattle Seahawks offense into one of the best in the league. Entering Week 10, Sam Darnold is playing at an MVP level and averaging 9.6 yards per attempt. Meanwhile, Jaxon Smith-Njigba currently leads the NFL with 948 yards receiving and is on pace to be the league's first 2,000-yard receiver. Could he work similar magic with Dart and a healthy Malik Nabers with the Giants? \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brian Daboll to be fired? Giants coaching candidates; one big name not interested - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/180b2cfd-eb48-4472-b397-0dc97033479a/thumbnail/1200x675/f72e252def32075f1618dedbe6f4a380/brian-daboll.jpg"
      ],
      "datePublished": "2025-11-09T21:50:39.000Z",
      "dateModified": "2025-11-09T21:50:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ravens' Derrick Henry passes Hall of Famers Thurman Thomas, Franco Harris on NFL's all-time rushing list - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ravens-derrick-henry-passes-hall-of-famers-thurman-thomas-franco-harris-on-nfls-all-time-rushing-list/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/9b1d50e2-0a2e-4087-ba17-91afc86892bc/thumbnail/1200x675/46a9e94e5a5a2443f7f1d9d9187b476f/henryvikings.jpg",
    "tag": "Sports",
    "date": "2025-11-09T21:29:52.000Z",
    "description": "\n\n\n    \n                                    Henry has passed two more notable players on the career rushing list\n        \n                            ",
    "body": "\n\n\n    \n                                    Henry has passed two more notable players on the career rushing list\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 9, 2025\n                            \n                    at\n    4:29 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Another game, another milestone for Derrick Henry. During the second half of Sunday's game against the Vikings, the Ravens' All-Pro running back passed Hall of Famers Thurman Thomas and Franco Harris on the NFL's career rushing list. His 75 yards on the day moved him into 15th on the all-time rushing list. Henry recently became only the 17th player of the 12,000-yard club, which is especially notable as every eligible member of that club is in the Pro Football Hall of Fame. He also recently passed Hall of Famer Walter Payton for fifth all-time in career touchdown runs. NFL's all-time career rushing list PlayerYards1. Emmitt Smith**18,3552. Walter Payton**16,7263. Frank Gore16,0004. Barry Sanders**15,2695. Adrian Peterson14,9186. Curtis Martin**14,1017. LaDainian Tomlinson**13,6848. Jerome Bettis**13,6629. Eric Dickerson**13,25910. Tony Dorsett**12,73911. Jim Brown**12,31212. Marshall Faulk**12,27913. Edgerrin James**12,24614. Marcus Allen**12,24315. Derrick Henry12,12416. Franco Harris**12,12017. Thurman Thomas**12,07418. Fred Taylor11,69519. Steven Jackson11,43820. John Riggins**11,352** -- Pro Football Hall of Fame members The backs that Henry just past are two of the most accomplished running backs of all-time, especially when it comes to the playoffs. \nThomas is third all-time in career postseason rushing yards (1,442) and is sixth on the Super Bowl career rushing list. The majority of Thomas' 204 yards in Super Bowls came in his first one in 1991 when he ran for 135 yards and a score (in addition to catching five passes for 55 yards) and would have been the MVP had the Bills defeated the Giants in Super Bowl XXV. Unfortunately for Thomas, the Bills lost what remains the only Super Bowl that has been decided by a single point. \nLike Thomas, Harris also played in four Super Bowls. But while Thomas' Bills squads went 0-4, Harris' Steelers were 4-0. Harris was a big reason for Pittsburgh's success in those games as he remains the Super Bowl career leader with 354 yards. He ran for a then-Super Bowl record 158 yards and a score in Pittsburgh's first Super Bowl, a 16-6 win over the Vikings in Super Bowl IX. Harris, who retired as the third-leading rusher in NFL history, also retired with the most postseason rushing yards (1,586) in history. Only Emmitt Smith has rushed for most postseason yards than Harris, who remains the only starting running back in history to win four Super Bowls. \nHenry is now less than 200 yards away from passing NFL icon Jim Brown for 11th on the career rushing list. Brown, who is a constant fixture in any discussion of the greatest running backs of all-time, held the career rushing record for 21 years before Payton passed him during the 1984 season. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ravens' Derrick Henry passes Hall of Famers Thurman Thomas, Franco Harris on NFL's all-time rushing list - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/9b1d50e2-0a2e-4087-ba17-91afc86892bc/thumbnail/1200x675/46a9e94e5a5a2443f7f1d9d9187b476f/henryvikings.jpg"
      ],
      "datePublished": "2025-11-09T21:29:52.000Z",
      "dateModified": "2025-11-09T21:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaxson Dart injury update: Giants QB exits Bears game with concussion - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/jaxson-dart-injury-updates-giants-qb-bears-game-head-injury-russell-wilson/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/f57d5991-2362-4c69-8899-3d17642ace58/thumbnail/1200x675/a648dffd4e69ab08c88a1bfaa73850be/dartnyg.jpg",
    "tag": "Sports",
    "date": "2025-11-10T03:49:35.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jaxson Dart exited the Week 10 New York Giants gam",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jaxson Dart exited the Week 10 New York Giants game against the Chicago Bears after he sustained a concussion on a running play during the second half.  Then, midway through the fourth quarter, he was ruled out for the remainder of the game.Just moments after Dart's exit, 10-time Pro Bowl quarterback Russell Wilson completed a 41-yard pass to running back Devin Singletary that helped New York extend its lead to 20-10 was just over 10 minutes left in regulation. Without Dart, however, the Giants ultimately lost the game after Bears quarterback Caleb Williams scored two touchdowns in the game's final four minutes. The loss dropped the Giants to 2-8 on the season that includes an 0-6 record on the road. Dart went 19 of 29 for 242 yards against the Bears prior to leaving the game. He also made NFL history on Sunday, becoming the first quarterback to ever rush for a touchdown in five consecutive games. He ran for 66 yards and two scores prior to getting hurt. \nThe 25th overall pick in April's draft, Dart entered Sunday's game with 10 touchdown passes against just three interceptions this season. He's won two of his six starts for the Giants since replacing Wilson in the starting lineup. \nDart left Sunday's game with the Giants ahead, 17-10. The lead swelled to 10 points before the Bears rallied behind Williams, whose game-winning score came on a 17-yard touchdown run with 1:47 left.\nThe Giants lost when the offense turned it over on downs following four straight incomplete passes from Wilson, who went 3 of 7 for 45 yards in relief of Dart. He was also sacked twice as the Giants' offense gained just seven yards during Wilson's three full series of work. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaxson Dart injury update: Giants QB exits Bears game with concussion - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/f57d5991-2362-4c69-8899-3d17642ace58/thumbnail/1200x675/a648dffd4e69ab08c88a1bfaa73850be/dartnyg.jpg"
      ],
      "datePublished": "2025-11-10T03:49:35.000Z",
      "dateModified": "2025-11-10T03:49:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB betting scandal: Guardians pitchers Emmanuel Clase, Luis L. Ortiz indicted - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-betting-scandal-emmanuel-clase-luis-l-ortiz-pitch-rigging-doj-indictment/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/15/62ad01b6-f670-4c35-a504-207693fef860/thumbnail/1200x675/d8519e06ac29b2e3d8cfc0b48a89914c/clase-getty.png",
    "tag": "Sports",
    "date": "2025-11-09T22:34:56.000Z",
    "description": "\n        Cleveland Guardians closer Emmanuel Clase and right-handed starter Luis L. Ortiz have been indicted on charges stemming from alleged gambling",
    "body": "\n        Cleveland Guardians closer Emmanuel Clase and right-handed starter Luis L. Ortiz have been indicted on charges stemming from alleged gambling misconduct -- specifically manipulating bets on individual pitches. The U.S. Attorney's Office for the Eastern District of New York announced the charges on Sunday and unsealed the indictment at the federal courthouse in Brooklyn. Ortiz has already been arrested in Boston, while Clase is not in custody. The Department of Justice has charged the pair with wire fraud conspiracy, honest services wire fraud conspiracy, conspiracy to influence sporting contests by bribery, and money laundering conspiracy. Clase's alleged actions date back to May of 2023, while Oritz's began in June of 2025. Furthermore, Clase's actions are alleged to have benefitted bettors by a sum of $700,000, while Ortiz's accrued to the benefit of co-conspiring gamblers by a sum of $60,000. Overall, bettors conspiring with the pair made at least $450,000 from betting platforms, prosecutors allege. Clase is alleged to have communicated with bettors via text messages during games. The pair could face up to 65 years in prison if convicted on all charges. The indictment reads: \"The charges in the indictment are allegations and the defendants are presumed innocent unless and until proven guilty.  If convicted, each defendant faces a maximum sentence of 20 years' imprisonment on the wire fraud conspiracy count, 20 years' imprisonment on the honest services wire fraud conspiracy count, five years' imprisonment on the conspiracy to influence sporting contests by bribery count, and 20 years' imprisonment on the money laundering conspiracy count.\"Clase, 27, was one of two Guardians pitchers placed on administrative leave over the summer while the league investigated potential misdoing. Ortiz was also placed on leave several weeks earlier. Both Clase and Ortiz had their leaves extended in late August through the rest of the 2025 regular season. \"MLB contacted federal law enforcement at the outset of its investigation and has fully cooperated throughout the process,\" the league said in a statement to ESPN. \"We are aware of the indictment and today's arrest, and our investigation is ongoing.\"\nThe Guardians said they will \"continue to fully cooperate with both law enforcement and Major League Baseball as their investigations continue.\"\n        \n            \n                How can MLB address prop betting problem? Five possible solutions amid Guardians' gambling scandal\n                \n                    Matt Snyder                \n            \n                            \n    \n                \n                    \n    \nAccording to the Department of Justice, both pitchers \"agreed in advance with their co-conspirators to throw specific types of pitches and speeds of pitches.\" Said co-conspirators then allegedly used that inside information to place bets.\"In some instances, the defendants received bribes and kickback payments ... in exchange for rigging pitches,\" prosecutors wrote.\nThe indictment chronicles specific instances in which the pitchers are alleged to have manipulated outcomes in collaboration with bettors: On or around May 19, 2023: Bettors allegedly made roughly $27,000 on a Clase pitch that was faster than 94.95 mph.On or around June 3, 2023: Bettors allegedly made roughly $38,000 on a Clase pitch that was slower than 94.95 mph and called a ball.On or around June 7, 2023: Bettors allegedly made roughly $68,000 on a Clase pitch that was slower than 94.95 and called a ball.On or around April 12, 2025: Bettors allegedly won $15,000 on a Clase pitch that was slower than 98.45 mph and called a ball. The next day, Clase is alleged to have asked one of the co-conspiring bettors to who won money on the April 12 pitch to \"send some of it to DR,\" seemingly referring to Clase's home country of the Dominican Republic, \"for repairs at the country house.\" April 26, 2025: Bettors allegedly won approximately $11,000 on a Clase pitch that was clocked slower than 97.95 mph. May 11, 2025: Bettors allegedly won approximately $11,000 on a Clase pitch that was called a ball.May 13, 2025: Bettors allegedly won approximately $3,500 on a Clase pitch that was a ball and was slower than 99.45 mph. May 17, 2025: This is one of the games in which Clase is alleged to have used his cell phone to coordinate with one or more bettors during the game. Bettors on this date are alleged to have won roughly $10,000 on a Clase pitch that was clocked slower then 97.95 mph and called a ball.On or about May 20, 2025: Clase is alleged to have directed a co-conspiring bettor to communicate with an associate, who subsequently directed the bettor to send $2,000 to an individual in the Dominican Republic. On or about May 28, 2025: Bettors wagered roughly $4,000 that a specific pitch by Clase would be a ball. The pitch did indeed appear to be out of the strike zone, but the batter swung and missed for a strike. The indictment reads: \"Approximately 20 minutes after Bettor-I lost the wager on May 28, 2025, Bettor-I sent a text message to the defendant EMMANUEL CLASE DE LA CRUZ-a .gif image of a man hanging himself with toilet paper. Even though the Cleveland Guardians won the game, approximately 10 minutes later, CLASE responded to Bettor-I with a .gif image of a sad puppy dog face.\"Ortiz is alleged to have joined Clase's scheme in June of 2025. Some of Ortiz's specific actions highlighted by the debate include: On or about June 15, 2025: Ortiz is alleged to have agreed to throw his first pitch of the second inning for a ball in exchange for $5,000 from Clase. This made approximately $26,000 for two co-conspiring bettors. On or about June 27, 2025: Ortiz agreed to throw his first pitch of the third inning for a ball in exchange for approximately $7,000. Bettors are alleged to have made about $37,000 off the pitch. Ortiz has denied all allegations against him and claimed he \"has never, and would never, improperly influence a game -- not for anyone and not for anything.\"\n\"Luis is and always has been a fierce competitor. He has always given his best effort in every inning of every game. Those who have played with him know this. And the government's investigation, including discussions with Luis' teammates, supports this as well,\" his lawyer told CBS Sports in a statement. \"...There is no credible evidence Luis knowingly did anything other than try to win games, with every pitch and in every inning. Luis looks forward to fighting these charges in court. The government's case is weak and circumstantial. He will defend himself, and he will be prevail.\"Ortiz's lawyer also said that all payments and money transfers were \"for lawful activities.\"Clase, who did not pitch after July 26, appeared in 48 games prior to the deactivation. He had amassed a 3.23 ERA (130 ERA+) and a 3.92 strikeout-to-walk ratio. His contributions had been worth an estimated 0.7 Wins Above Replacement, according to Baseball Reference's calculations. Ortiz made 16 starts before his suspension, going 4-9 with a 4.36 ERA.\n\"Professional athletes, like Luis Leandro Ortiz and Emmanuel Clase de la Cruz hold a position of trust-not only with their teammates and their professional leagues, but with fans who believe in fair play,\" United States Attorney Joseph Nocella, Jr. said in a statement. \"As alleged, the defendants sold that trust to gamblers by fixing pitches.  In doing so, the defendants deprived the Cleveland Guardians and Major League Baseball of their honest services.  They defrauded the online betting platforms where the bets were placed.  And they betrayed America's pastime.  Integrity, honesty and fair play are part of the DNA of professional sports. When corruption infiltrates the sport, it brings disgrace not only to the participants but damages the public trust in an institution that is vital and dear to all of us.  Today's charges make clear that our Office will continue to vigorously prosecute those who corrupt sports through illegal means.\"As with all such proceedings, defendants are presumed innocent unless and until proven guilty. \nThe indictment comes just weeks after Miami Heat guard Terry Rozier was arrested as part of an NBA betting scandal. Rozier and his co-conspirators allegedly obtained insider information about games, including which players were healthy and active, and passed it along to bettors. More than $200,000 in bets were placed on Rozier's \"under\" line across multiple prop bets during a March 23, 2023, game in which he left after playing less than 10 minutes. Damon Jones, a former NBA player, was also indicted and accused of passing along inside information, including about LeBron James.While sports gambling has been legalized across the country, MLB (and other leagues) have rules that prohibit certain behavior. MLB, for example, does not allow players to gamble on diamond sports, even of other teams. In 2024, MLB banned former San Diego Padres infielder Tucupita Marcano for life and suspended four other players -- Athletics righty Michael Kelly, Padres lefty Jay Groome, Philadelphia Phillies infielder José Rodriguez, and Arizona Diamondbacks lefty Andrew Saalfrank -- after they were discovered to have bet on baseball games not involving their teams.Back in May, commissioner Rob Manfred reinstated several of the most notorious gambling-related rule violaters in league history -- Pete Rose and several members of the 1919 Black Sox -- from MLB's permanently ineligible list on the grounds that the lifetime bans ended with the player's death. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB betting scandal: Guardians pitchers Emmanuel Clase, Luis L. Ortiz indicted - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/15/62ad01b6-f670-4c35-a504-207693fef860/thumbnail/1200x675/d8519e06ac29b2e3d8cfc0b48a89914c/clase-getty.png"
      ],
      "datePublished": "2025-11-09T22:34:56.000Z",
      "dateModified": "2025-11-09T22:34:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]