[
  {
    "title": "Oregon State fires longtime basketball coach Wayne Tinkle before Pac-12 relaunch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/oregon-state-fires-basketball-coach-wayne-tinkle-pac-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/f2699430-5947-45c9-bd28-dc7bbb2f48ce/thumbnail/1200x675/bb8bc8aebaa1d6dcc233cb869288db33/gettyimages-2209885765-1.jpg",
    "tag": "Sports",
    "date": "2026-02-26T20:48:31.000Z",
    "description": "\n        Oregon State men's basketball coach Wayne Tinkle will not return after the 2025-26 season, the school announced Thursday. Tinkle has the opti",
    "body": "\n        Oregon State men's basketball coach Wayne Tinkle will not return after the 2025-26 season, the school announced Thursday. Tinkle has the option to finish the campaign before departing from his post, but has not yet decided whether to see the season out, according to John Canzano. The Beavers are 16-14 this season and 9-8 in West Coast Conference play.Tinkle's exit comes after a 12-year run with the Beavers that featured some of the program's highest highs and lowest lows. It also coincides with Oregon State's move from the WCC back into the Pac-12, which debuts as a reconstructed conference beginning next season.Oregon State never finished higher than fourth in the Pac-12 during Tinkle's decade in the conference and concluded its first year in the WCC with a fifth-place finish. Tinkle has a 175-204 overall record for his tenure, with an 82-141 mark in conference games\"We are grateful to Wayne for his dedication to Oregon State and for the leadership he has provided our men's basketball program,\" athletic director Scott Barnes said in a statement. \"He has represented Beaver Nation with integrity and commitment. As we approach the dawn of the new Pac-12 era, we believe it is in the best interest of our men's basketball program to transition to its next chapter. These decisions are never easy, but we are focused on positioning our program for sustained success in a rapidly evolving collegiate athletics landscape.\"\nThe Tinkle era at Oregon State will be most remembered for the program's miraculous run to the 2021 Elite Eight. The Beavers entered the NCAA Tournament that season as a No. 12 seed and pulled off upsets of No. 5 Tennessee, No. 4 Oklahoma State and No. 8 Loyola Chicago before falling to eventual national runner-up No. 2 Houston. It was one of two NCAA Tournament appearances for the Beavers during Tinkle's 12 years at the helm.While the Beavers reached the postseason three times, including a trip to the College Basketball Crown last season, they also logged two of the worst seasons in program history under Tinkle's leadership. The year directly following the Elite Eight run, Oregon State went 3-28 and posted the worst winning percentage (.097) of any Beavers squad in 125 years. Tinkle also oversaw a 5-27 team in 2016-17.Oregon State making changes ahead of Pac-12 relaunchWhen the Pac-12 returns as a full conference this summer, Oregon State will be under new leadership in both football and men's basketball. The Beavers fired football coach Trent Bray midway through the 2025 season and hired Alabama co-offensive coordinator JaMarcus Shephard as his replacement.\nThe overhaul is part of the Beavers' efforts to establish themselves as top-tier contenders in the new-look league. Oregon State was long a bottom-half athletic department in the old Pac-12, but it enters the conference's new era as a potential leader across the board given its status as a recent Power Five member.\n        \n            \n                2026 Pac-12 football schedule: 'Flex week' provides unique advantage in College Football Playoff race\n                \n                    Carter Bahns                \n            \n                            \n    \n                \n                    \n    \nThe Pac-12 has the opportunity to thrive as a top-six basketball conference with the addition of Gonzaga as a basketball-only member, as well as prominent former Mountain West schools. For the 2026-27 basketball season, the Pac-12 will operate as a nine-member league featuring Boise State, Colorado State, Fresno State, Gonzaga, Oregon State, San Diego State, Texas State, Utah State and Washington State.It also projects as a potential Group of Six leader in football and could see its champion clinch a spot in the College Football Playoff on a regular basis.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon State fires longtime basketball coach Wayne Tinkle before Pac-12 relaunch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/f2699430-5947-45c9-bd28-dc7bbb2f48ce/thumbnail/1200x675/bb8bc8aebaa1d6dcc233cb869288db33/gettyimages-2209885765-1.jpg"
      ],
      "datePublished": "2026-02-26T20:48:31.000Z",
      "dateModified": "2026-02-26T20:48:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFLPA report cards: Dolphins reportedly rank first, Steelers last in annual survey - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nflpa-report-cards-dolphins-steelers-annual-team-surveys/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/c51e7ac3-2f55-40a4-ad9a-b27f828e044f/thumbnail/1200x675/ecd7916fb1efec0488b853e4cf2c19da/nflpalogo.png",
    "tag": "Sports",
    "date": "2026-02-26T21:24:58.000Z",
    "description": "\n        The Pittsburgh Steelers did not fare well in the NFL Players Association's annual team report cards. For the first time, the Steelers came in",
    "body": "\n        The Pittsburgh Steelers did not fare well in the NFL Players Association's annual team report cards. For the first time, the Steelers came in last place, according to ESPN, which obtained the survey results after the league won a grievance to stop the NFLPA from making the report cards public.The survey -- based on responses from 1,759 players -- had the Miami Dolphins ranked first, the Minnesota Vikings second and the Washington Commanders third. For a second straight year, the Cleveland Browns ranked 30th among the NFL's 32 teams. Miami reportedly ranked fourth overall in home field due to the quality of the natural grass at Hard Rock Stadium. Former Dolphins coach Mike McDaniel (now the offensive coordinator for the Los Angeles Chargers) received a B grade a year after getting an A+ in the survey. \"Players identify scheduling, communication, and leadership as key areas for head coaching improvement, presenting an opportunity for [new head coach Jeff] Hafley next season,\" the survey said of the Dolphins' coaching situation. \n\n        \n            \n                NFL wins grievance against NFLPA, putting an end to public yearly team report cards\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nElsewhere, the Steelers reportedly received low grades in several categories, including having the lowest-rated home field in the NFL \"by a wide margin.\" Pittsburgh shares its home field with the University of Pittsburgh and plays on a field that hosts high school playoff games. All of that activity typically leads to less-than-ideal playing surfaces for the Steelers and their opponents. The Steelers' locker room received an F, as players stated that it \"has only five bathroom stalls for the entire team.\" Steelers president Art Rooney ranked last in the league for \"willingness to invest in facilities, a trend reflected in the Steelers' poor facility ratings across the board.\" \nIn the past, Rooney has downplayed the NFLPA's annual survey. \"It doesn't get presented to us, it gets presented to the media, so as far as I'm concerned it's a media opportunity for the players association as opposed to a serious effort of constructive criticism,\" Rooney said in 2024. In its grievance, the NFL stated that the survey violated the collective bargaining agreement. An arbitrator agreed while stating that the report cards violated the CBA by \"disparaging NFL clubs and individuals.\" The NFLPA said it would continue to collect responses from the report cards even if it was unable to publish them. A spokesperson for the NFLPA declined to comment to ESPN. An NFL spokesperson also declined to comment while stating that, like the last four years of the NFLPA's report cards, the league had no knowledge of the survey.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFLPA report cards: Dolphins reportedly rank first, Steelers last in annual survey - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/c51e7ac3-2f55-40a4-ad9a-b27f828e044f/thumbnail/1200x675/ecd7916fb1efec0488b853e4cf2c19da/nflpalogo.png"
      ],
      "datePublished": "2026-02-26T21:24:58.000Z",
      "dateModified": "2026-02-26T21:24:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brady Tkachuk decries White House's AI-altered video, denies making anti-Canada comments - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/brady-tkachuk-white-house-ai-video-olympics-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/3c669c2c-12b5-48fe-bf9a-96adf340eb98/thumbnail/1200x675/d34a9b2fd12be0413a182a876ca09306/gettyimages-2261666300-1.jpg",
    "tag": "Sports",
    "date": "2026-02-26T22:05:42.000Z",
    "description": "\n        Team USA men's hockey star Brady Tkachuk is not fond of an AI-altered video the White House posted this week to its official TikTok account d",
    "body": "\n        Team USA men's hockey star Brady Tkachuk is not fond of an AI-altered video the White House posted this week to its official TikTok account depicting him belittling Canadians. Tkachuk, who helped guide Team USA to a gold medal in the 2026 Milano Cortina Winter Olympics, said the disparaging remarks in the clip would \"never come out of my mouth.\"The White House's post came after President Donald Trump made what Hilary Knight, the captain of the U.S. women's hockey team, called a \"distasteful\" joke about the women's team, which also defeated Canada to win the gold in Italy.The video shows Tkachuk at a press conference at the 2025 4 Nations Face-Off and references Canadian fans booing the United States national anthem at the tournament. Tensions between the two countries were high during last February's event after Trump announced he would impose tariffs against Canada.\"They booed our national anthem, so I had to come out and teach those maple syrup-eating f---s a lesson,\" Tkachuk was made to say in the doctored video. \"Canada, we own you, little bro.\"\nCanada defeated the United States in the 4 Nations Face-Off final.\"It's clearly fake, because it's not my voice and not my lips moving,\" Tkachuk said Thursday at an Ottawa Senators media availability. \"I'm not in control of any of those accounts. I know that those words would never come out of my mouth. Can't do anything about it.\"\n        \n            \n                U.S. women's hockey team captain Hilary Knight responds to President Trump's 'distasteful' joke\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nTkachuk plays professionally in Canada and said the thought of not playing north of the border has never crossed his mind. He has spent the first seven years of his NHL career in Ottawa after the Senators selected him with the No. 4 overall pick in the 2018 draft.A reporter asked Tkachuk if he liked the White House's video.\"It's not my voice, not what I was saying,\" Tkachuk said. \"I would never say that. That's not who I am. So I guess I don't like that video because that just would never come out of my mouth. Never thought. I'll leave it at that.\"\nTkachuk also denied that he was the individual who told Trump to \"close the northern border\" when the President called the men's hockey team after its win over Canada in Sunday's Olympic final.\"I've been seeing stuff that people think it's me, but if you watch the video, that's not my voice and something that I'd never say,\" Tkachuk said. \"I don't really know how that kind of took a storm on its own when I play here and give everything I have here. I just think that's something that never a thought would happen in my head and especially would never say it. It's crazy when things go on social media, how fast they go. Of course, I would never say anything like that.\"The men's hockey team attended the State of the Union address on Tuesday after receiving an invitation from Trump. The women's team declined its invitation.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brady Tkachuk decries White House's AI-altered video, denies making anti-Canada comments - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/3c669c2c-12b5-48fe-bf9a-96adf340eb98/thumbnail/1200x675/d34a9b2fd12be0413a182a876ca09306/gettyimages-2261666300-1.jpg"
      ],
      "datePublished": "2026-02-26T22:05:42.000Z",
      "dateModified": "2026-02-26T22:05:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kayvon Thibodeaux trade rumors: Best landing spots for Giants pass rusher - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/kayvon-thibodeaux-trade-rumors-giants-landing-spots/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/af810575-6fb7-4a07-80e2-6fe414cfc773/thumbnail/1200x675/02d0ad0099b11d0b1d4e7848a72c7ca9/kayvon.jpg",
    "tag": "Sports",
    "date": "2026-02-26T22:37:46.000Z",
    "description": "\n        The New York Giants could be preparing to part ways with a former first-round pick. The team is listening to offers for edge rusher Kayvon Th",
    "body": "\n        The New York Giants could be preparing to part ways with a former first-round pick. The team is listening to offers for edge rusher Kayvon Thibodeaux, and the belief among teams at the NFL Scouting Combine is that Thibodeaux will get dealt, according to SNY.Thibodeaux, 25, is coming off a season during which he recorded just 2.5 sacks, five tackles for loss and nine quarterback hits while playing in only 10 of 17 games. He has fallen off precipitously over the last two years after he posted an 11.5-sack season in 2023, his second year in the NFL.But even that 11.5-sack total was not really representative of his level of play that year. Thibodeaux ranked 12th in the NFL in sacks that season but checked in just 67th in pressures and 107th in pressure rate out of the 145 players who rushed the passer 250 times or more. He just happened to have a sack-to-pressure ratio that was an outlier and looks nothing like the one he has posted in the other three seasons of his career. During that 2023 season, 26.7% of Thibodeaux's pressures resulted in sacks. He has otherwise been at 10% (2022), 14.5% (2024) and 7.8% (2025). It's no surprise, then, that he's totaled only 12 sacks in his three non-2023 seasons.\nThat subpar performance could lead to a reduced market for Thibodeau's services. There's also the matter of his fully guaranteed salary of around $14.8 million in 2026, which could even further limit said market. Still, as a 25-year-old former first-round pick, there are teams out there that could be interested. Let's take a look at a few that might make some sense, if the price is right.\n                            \n    \n                                                \n                    \n    San Francisco 49ersOnly two teams generated pressure at a lower rate during the 2025 regular season than the 49ers, according to Tru Media. (That would be the Jets and the Panthers.) San Francisco losing Nick Bosa and Mykel Williams to injury during the season played a role, but the Niners still need more help on the edge even after you account for getting those guys back. \n\n                            \n    \n                                                \n                    \n    Buffalo BillsThe Bills are seemingly on the hunt for help on the edges every offseason, and this one could be no different. They had a solid pressure rate during the regular season, but in the playoffs it dropped to just 32.5% -- and 28% in the loss to the Broncos in the divisional round. Buffalo has other needs and might be turned off by price, but if it's low enough, it could get interested.\n                            \n    \n                                                \n                    \n    New York JetsThe Jets are one of those aforementioned teams that did an even worse job of getting after the quarterback than the 49ers. They could use all they help they can get, so you might as well throw them in the mix here. That's especially true after they traded Jermaine Johnson II to the Titans. They also have plenty of cap space, so they could likely make something happen if they wanted.\n                            \n    \n                                                \n                    \n    Los Angeles ChargersKhalil Mack and Odafe Oweh will hit free agency this offseason, and the Chargers might not be able to bring both of them back. They are scheduled to have over $80 million in cap room, though, so if they wanted to get in on the action for Thibodeaux, they could probably do so at a lower cost than other teams that might want the Giants to absorb some of his cap hit.\n\n                            \n    \n                                                \n                    \n    Indianapolis ColtsThe Colts ranked just 23rd in pressure rate during the 2025 season, according to Tru Media. They need someone to rush the passer opposite Laiatu Latu, who collected 8.5 sacks this past year. They've been looking for pass rush help for a while, and they could be interested in buying low here -- especially if the Giants are willing to eat some of the salary.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kayvon Thibodeaux trade rumors: Best landing spots for Giants pass rusher - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/af810575-6fb7-4a07-80e2-6fe414cfc773/thumbnail/1200x675/02d0ad0099b11d0b1d4e7848a72c7ca9/kayvon.jpg"
      ],
      "datePublished": "2026-02-26T22:37:46.000Z",
      "dateModified": "2026-02-26T22:37:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Baseball Classic: Every previous champion ahead of 2026 tournament - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/world-baseball-classic-champions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2023/03/22/d5d92616-d376-4435-9893-56f9573cf79f/thumbnail/1200x675/37a60bbfacf41598af6166c2130ffaf1/ohtani-celly-getty.png",
    "tag": "Sports",
    "date": "2026-02-26T22:06:40.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 World Baseball Classic is about to get un",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 World Baseball Classic is about to get underway with a star-studded Team USA, a Japanese team once again led by Shohei Ohtani, a Dominican Republic roster looking for revenge and more international clubs full of talent. We won't know the winner until March 17, but there's plenty of history to look back on. Team Japan held off the United States in the championship game of the 2023 tournament, securing its third WBC title. Japan went unbeaten in the tournament, coming from behind to beat Mexico in the semifinals before a 3-2 win over the U.S. in the final on Tuesday.\nThis year's WBC was the fifth installment of the tournament, and Japan has now won 60% of WBC titles. Here's a full list of the event's winners, the runner-up and tournament MVP. (Note: The 2021 World Baseball Classic was pushed back to this year due to the COVID-19 pandemic.)List of World Baseball Classic winners2006Winner: JapanRunner-up: CubaWorld Baseball Classic MVP: Daisuke MatsuzakaDaisuke Matsuzaka led Japan to the inaugural WBC title in 2006. \n                                                                    Getty Images\n                                                            2009Winner: JapanRunner-up: South KoreaWorld Baseball Classic MVP: Daisuke Matsuzaka2013Winner: Dominican RepublicRunner-up: Puerto RicoWorld Baseball Classic MVP: Robinson CanóRobinson Canó was tournament MVP for the Dominican Republic in 2013. \n                                                                    Getty Images\n                                                            2017Winner: United StatesRunner-up: Puerto RicoWorld Baseball Classic MVP: Marcus Stroman2023Winner: JapanRunner-up: United StatesWorld Baseball Classic MVP: Shohei OhtaniCountryNumber of World Baseball Classic titlesJapan3 (2006, 2009, 2023)Dominican Republic1 (2013)United States1 (2017)\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Baseball Classic: Every previous champion ahead of 2026 tournament - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2023/03/22/d5d92616-d376-4435-9893-56f9573cf79f/thumbnail/1200x675/37a60bbfacf41598af6166c2130ffaf1/ohtani-celly-getty.png"
      ],
      "datePublished": "2026-02-26T22:06:40.000Z",
      "dateModified": "2026-02-26T22:06:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Cognizant Classic leaderboard: Austin Smotherman leads, Brooks Koepka struggles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/cognizant-classic-leaderboard-2026-austin-smotherman-brooks-koepka/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/3606f8dc-26f5-477d-acc0-704dc4c1742f/thumbnail/1200x675/a53c98322b9f2058b6020eb5d6c73373/austin-smotherman-cognizant-g.jpg",
    "tag": "Sports",
    "date": "2026-02-27T00:17:51.000Z",
    "description": "\n        The first round of the Florida Swing produced a little bit of everything. Numerous players attempted shots from water hazards, a worrying wit",
    "body": "\n        The first round of the Florida Swing produced a little bit of everything. Numerous players attempted shots from water hazards, a worrying withdrawal came from one of the game's more popular figures, and even a bird was clipped by the pre-tournament favorite. Unaffected by all of it was none other than Austin Smotherman, who opened his 2026 Cognizant Classic with a sensational 9-under 62 to command the first-round lead by a single stroke over Nico Echavarria.\"Two weeks off, I come out here today excited to play,\" Smotherman said. \"I'm glad I was an early tee time today, too, not having to wait around and maybe see other guys doing what they're doing. But I just wanted to get on the golf course. Felt like the game was in a good spot. \"To be honest, I didn't play a ton when I was home -- just took the rest when I could, knowing I'm about to play as many weeks as I can until my wife is due with our third child here March 23rd. Figuring things out on the road solo this week, and the game kind of followed. It was a pretty easy round on a golf course that shouldn't be this easy. It felt pretty good.\"Smotherman started his tournament with a couple of birdies in his first five holes before he caught fire around the turn. He made six birdies in a row from Nos. 7-12 to catapult himself into a share of the lead. A birdie on the par-5 finisher made it so his name was the one to finish Thursday alone at the top.\nWhile Smotherman and some of his peers enjoyed calm conditions in the morning, five-time major champion Brooks Koepka and those off in the afternoon faced a different challenge. With wind picking up as the day progressed, players were tasked with navigating a more difficult PGA National, albeit still a relatively tame one historically.Experiencing two frustrating tournaments on the West Coast courtesy of some serious putting woes, Koepka came into the Cognizant Classic with some renewed enthusiasm on the greens. However, continuing to wield the TaylorMade Spider putter, he continued to see the same results.The Florida native turned in a round of 3 over, hindered by both his play on the greens and the manner in which he finished. Koepka's most noteworthy connection came from 36 feet on the par-4 6th for the first of two birdies. Unfortunately, his second-longest putt from 5 feet, 5 inches came on the par-3 17th for a double-bogey five, which was sandwiched in between two other fives on the scorecard.\n\"He shot 3 over, so I don't think he played his best,\" Daniel Berger said of Koepka. \"Obviously had a difficult time on 17, but if there's one thing I know, it's he can turn it around in an instant. I expect him to come out tomorrow and play well.\"\nLeader1. Austin Smotherman (-9): If you're going to shoot 62 at PGA National, you are going to make your fair share of putts, and that is exactly what Smotherman did. The 31-year-old made 132 feet of putts, gained over three strokes with the flat stick in hand and did so while 17 greens in regulation. The latter will be the most important on Friday as he goes off in the afternoon when conditions are expected to freshen.\"I felt like I just wanted to hit good putts on the high line all day and just very freeing,\" Smotherman said. \"I'm using no line on the golf ball this week for the first time in a while, but I felt like it kind of just helps with these greens. There's so much movement and the pace that they are, and then with the wind, not to be adjusting and so conscientious of that line, so I felt like that was pretty freeing. \n\"The length of putts that I was making was nice to see, but I also felt like I hit a lot of good putts. The par save on 15 to kind of keep things going, a par save as well on 6 after a bad lag putt, that kind of kept things going. So having those things happen and then a long putt goes in, you're stealing them, and then you hit one close, and you just keep building those holes. Before you know it, you're finished, and here we are.\"\nContenders2. Nico Echavarria (-8)T3. Taylor Moore, Jackson Suber, Daniel Berger, Kevin Roy, Kristoffer Reitan (-4)T8. Keith Mitchell, Joel Dahmen, Michael Brennan, Aaron Rai and nine others (-3)It was not Smotherman who led the field in strokes gained putting on Thursday but rather Echavarria. The two-time PGA Tour winner has missed four cuts in five starts to begin his 2026 season with his lone weekend appearance coming as a top 10 finish at Pebble Beach. Despite the volatility, Echavarria insisted that his game was close, and Thursday was proof of that as he too went around PGA National without a dropped shot.\n\"It wasn't the best start of the year, but I did play very, very well in Pebble, and those signature events give you a lot of points, so I'm happy with that,\" Echavarria said. \"The golf hasn't been that far off, and I could tell today that having patience and just enjoying it out there was going to be the key for the day, and we did that.\"\nHow players are reacting to PGA NationalFrom 2006-23, 11 golfers shot 10 under or better at PGA National. In 2025, 38 players accomplished the feat with Jake Knapp even shooting 59. Now, there were some changes between those two periods, including the golf course being overseeded and the par-4 10th getting changed to a par 5, which adjusts a player's score to par. Still, though, if last year (and Thursday) was any indication of the difficulty of this golf course, it may be fair to say that this is officially not your father's PGA National. So, why is that? Just ask Billy Horschel, a Florida native who has been vocal about what has transpired at the venue.\n\"I talked about it last year. This is a really good golf course. It's a very fair golf course. When it blows hard, it's a challenge, and when it's sort of benign like it is today, it's gettable,\" Horschel explained. \"A few years ago, the rough was longer and then they started cutting it down and then they overseeded the golf course. Listen, I think the Tour gets a bad rap, and it's not anything against the owners of PGA National. I understand where they would want to overseed. …This isn't just PGA National; it goes to a lot of courses that we play throughout the years.\"\nWorrying withdrawal from Will ZalatorisWell, at least it is not his back, but a withdrawal shortly before his Round 1 tee time has some worrying about Zalatoris. According to the PGA Tour, Zalatoris' exit was due to a left ankle injury as the wiry right-hander was on the practice facilities at PGA National, gearing up for first-round action before pulling his name off the tee sheet.Zalatoris opened his season with a top-20 finish at The American Express before he missed the cut at the Farmers Insurance Open. Once a consistent contender in major championships, Zalatoris has dropped to No. 252 in the Official World Golf Rankings and is not qualified for any of the four major championships for the 2026 season.\n2026 Cognizant Classic updated odds, picksOdds via DraftKings SportsbookNico Echavarria: 9/2Austin Smotherman: 5-1Daniel Berger: 12-1Kristoffer Reitan: 12-1Keith Mitchell: 20-1Rasmus Højgaard: 24-1Kevin Roy: 24-1The morning should play easier on Friday once again, which will create an opportunity for someone like Michael Brennan to inch towards the lead. The PGA Tour rookie is listed at 35-1 after an opening 68 during which he hit 12 of 14 fairways to complement his jaw-dropping length off the tee. The short game was a little sloppy, but if he cleans that up, he will have a chance heading into the weekend.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Cognizant Classic leaderboard: Austin Smotherman leads, Brooks Koepka struggles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/3606f8dc-26f5-477d-acc0-704dc4c1742f/thumbnail/1200x675/a53c98322b9f2058b6020eb5d6c73373/austin-smotherman-cognizant-g.jpg"
      ],
      "datePublished": "2026-02-27T00:17:51.000Z",
      "dateModified": "2026-02-27T00:17:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL combine results: Measurements, 40 times, biggest takeaways - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/draft/news/2026-nfl-combine-results-full-list-measurements-40-times/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/ae5c8051-61b4-420a-bc25-f569005f6017/thumbnail/1200x675/5a1825841cc4d23ed32e162472523c6d/nfl-combine.jpg",
    "tag": "Sports",
    "date": "2026-02-27T00:56:53.000Z",
    "description": "\n\n\n    \n                                    Official measurements and testing numbers by position, updated throughout combine week in Indianapolis\n   ",
    "body": "\n\n\n    \n                                    Official measurements and testing numbers by position, updated throughout combine week in Indianapolis\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 26, 2026\n                            \n                    at\n    7:51 pm ET\n                        \n                •\n            \n            6 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        INDIANAPOLIS -- It's Thursday of NFL combine week, which means prospect measurements and on-field workouts are officially underway. The schedule is as follows:Thursday: EDGE, DL and LBFriday: TE and DBSaturday: QB, RB and WRSunday: OLIn the morning, players will log official measurements, including height, weight, wingspan, arm length and hand size. In the afternoon, they'll participate in on-field testing -- including the 40-yard dash, vertical and broad jumps and bench press -- before wrapping up with positional drills inside Lucas Oil Stadium.As in past years, not every prospect will participate. Indiana QB Fernando Mendoza, widely viewed as the No. 1 pick in the 2026 NFL Draft, said he won't throw in Indianapolis, opting instead to do so at Indiana's pro day on April 1. Miami EDGE Rueben Bain Jr. -- the No. 2 prospect in CBS Sports draft analyst Mike Renner's rankings -- also did not work out.There has been some positive news on the participation front, however. The following top prospects are expected to compete in some capacity: Ohio State EDGE Arvell Reese (No. 3 in Renner's rankings), Ohio State LB Sonny Styles (No. 10), Notre Dame RB Jeremiyah Love (No. 16) and Texas Tech EDGE David Bailey (No. 19).From arm length to 40 times, we've got you covered with every official measurement and testing number as they come in from Indianapolis.EDGE measurementsPlayerSchoolHeightWeightHandArmWingspanRueben Bain Jr.Miami6-2 ¼2639⅛30⅞77⅜Arvell ReeseOhio State6-4 ⅛2419½32½79½David BaileyTexas Tech6-3 ½25110¼33⅝79⅝Cashius HowellTexas A&M6-2 ½2539¼30¼74¼Akheem MesidorMiami6-32591032⅛78⅝R Mason ThomasOklahoma6-2 ¼2418⅞31⅝78⅛T.J. ParkerClemson6-3 ½2639½33⅛79Anthony LucasUSC6-5 ½25610¼33⅜--Malachi LawrenceUCF6-42539¼33⅝--Gabe JacasIllinois6-42601033--Joshua JosephsTennessee6-32421034¼--Zion YoungMissouri6-62629½33--Romello HeightTexas Tech6-32399½32¼--Keyron CrawfordAuburn6-4253932--Derrick MooreMichigan6-42559⅛33⅜--Dani Dennis-SuttonPenn State6-625610⅛33⅜--Nadame TuckerWestern Michigan6-2247931⅜--Tyreak SappFlorida6-22739½32--Wesley WilliamsDuke6-42569½31⅞--Caden CurryOhio State6-32579⅜30⅛--Quintayvious HutchinsBoston College6-32339½32⅝--Trey MooreTexas6-224310½31⅝--Vincent Anthony Jr.Duke6-62581034⅛--Logan FanoUtah6-52579⅜31⅜--Max LlewellynIowa6-6258932¼--George Gumbs Jr.Florida6-4245933⅝--Patrick PaytonLSU6-52601033⅜--Aidan HubbardNorthwestern6-4 ⅝2609⅛32--Jack PyburnLSU6-42581030⅞--Marvin Jones Jr.Oklahoma6-52459¼33⅛--Nyjalik KellyUCF6-525610⅜35⅛--Mason ReigerWisconsin6-525110⅜32⅝--EDGE measurement takeawaysConcernsWe knew Rueben Bain Jr.'s arms were going to measure short, but his 30⅞-inch arms rank as the fourth-shortest among edge rushers since 1999, per MockDraftable. His 77⅜-inch wingspan isn't ideal, either; only 19 edge rushers in the MockDraftable database (since 1999) have measured shorter. Bain will still be a first-round pick -- likely in the top 10 — but teams with strict length thresholds could be wary of those numbers.Cashius Howell, Mike Renner's No. 24 prospect in this class, has even shorter arms than Bain at 30¼ inches -- the shortest of any edge rusher since 1999, per MockDraftable. However, the reigning SEC Defensive Player of the Year doesn't believe his historically short arms will prevent him from being productive in the NFL. \"Those are just the cards that I've been dealt,\" Howell said during Wednesday's podium session. \"I'm going to do everything in my power to perfect my technique and perfect my craft in whatever way possible.\"\n        \n            \n                Can star Miami edge rusher Rueben Bain Jr. overcome physical limitations?\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \nEDGE testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Rueben Bain Jr.Miami (FL)------------Arvell ReeseOhio State4.461.58--------David BaileyTexas Tech4.501.623510-9----Cashius HowellTexas A&M4.591.5832.59-7----Akheem MesidorMiami (FL)------------R Mason ThomasOklahoma4.671.63--------T.J. ParkerClemson4.681.613410-0----Anthony LucasUSC------------Malachi LawrenceUCF4.521.594010-10----Gabe JacasIllinois------------Joshua JosephsTennessee------------Zion YoungMissouri------------Romello HeightTexas Tech4.641.633910-5----Keyron CrawfordAuburn------------Derrick MooreMichigan------------Dani Dennis-SuttonPenn State4.631.6339.510-116.90--Nadame TuckerWestern Michigan4.731.6333.59-11----Tyreak SappFlorida------------Wesley WilliamsDuke4.891.6835.510-0----Caden CurryOhio State------------Quintayvious HutchinsBoston College4.741.7337------Trey MooreTexas4.541.6038.510-0--4.43Vincent Anthony Jr.Duke4.841.6732.510-3----Logan FanoUtah------------Max LlewellynIowa4.811.6432.59-7----George GumbsFlorida4.661.674110-17.00--Patrick PaytonLSU------------Aidan HubbardNorthwestern------------Jack PyburnLSU------------Marvin Jones Jr.Oklahoma4.691.65--------Nyjalik KellyUCF4.881.69379-11----Mason ReigerWisconsin4.781.614010-5----DL measurementsPlayerSchoolHeightWeightHandArmWingspanPeter WoodsClemson6-2 ½2989⅛31¼76⅝Lee HunterTexas Tech6-3 ½3189¼33¼80⅝Kayden McDonaldOhio State6-2 ⅛3269⅝32¼78⅛Keldric FaulkAuburn6-5 ⅞2769¾34⅜82¼Christen MillerGeorgia6-3 ¾321103380⅛Caleb BanksFlorida6-6 ¼32710⅞3585¾Jaishawn BarhamMichigan6-3 ½24010¼34⅛--Chris McClellanMissouri6-43131134--Rayshaun BennyMichigan6-32989¼33⅜--Domonique OrangeIowa State6-232210¼33⅜--Dontae CorleoneCincinnati6-0 ⅝3409½31⅞--Nick BarrettSouth Carolina6-33121033⅜--Darrell Jackson Jr.Florida State6-5 ⅝3151134¾--LT OvertonAlabama6-327410⅝33¼--Kaleb ProctorSoutheastern Louisiana6-22919½33--Tim KeenanAlabama6-13278⅝30½--Zxavian HarrisOle Miss6-83301034⅝--Skyler Gill-HowardTexas Tech6-12809¼30⅝--Gracen HaltonOklahoma6-2 ⅝2931031⅛77¾DeMonte CapehartClemson6-531310¼33⅞--Albert RegisTexas A&M6-12959⅝31⅝--Tyler OnyedimTexas A&M6-3 ½29210⅛34⅛--Bryson EasonTennessee6-23231033⅛--David GustaKentucky6-23081031⅛--Brandon ClevelandNC State6-33079¼32⅜--Zane DurantPenn State6-129010⅝31⅞--Damonic WilliamsOklahoma6-23051033⅛--Gary Smith IIIUCLA6-13199⅝32⅝--Cameron BallArkansas6-43109½33--Bobby Jamison-TravisAuburn6-33289⅝34¼--Deven EasternMinnesota6-53151034--Jackie MarshallBaylor6-2 ½2939½32--DL measurement takeawaysWinnersFlorida's Caleb Banks is having a heck of a pre-draft process after being limited to just three games last season because of a broken foot. He reminded everyone of his NFL potential with a strong showing at the Senior Bowl, then followed that up with impressive combine measurables, including an 85¾-inch wingspan — the longest among combine defensive tackles since 1999. He also posted 98th percentile height (6-foot-6 ¼), 89th percentile weight (327 pounds), 94th percentile hand size (10⅞ inches) and 94th percentile arm length (35 inches). Banks has a good chance to go in the back half of Round 1.\nFlorida State's Darrell Jackson Jr. has 11-inch hands, tied for the largest at the combine since at least 2014.ConcernsClemson's Peter Woods entered the 2025 season as a potential top-five pick, but an inconsistent fall -- despite earning first-team All-ACC honors -- pushed him out of that conversation. While Woods remains a first-round talent, some of his measurables disappointed, including fourth-percentile arm length (31¼ inches) and 10th-percentile wingspan (76⅜ inches). Woods also did not participate in on-field drills at the combine. He'll look to show off his skill set at Clemson's pro day on March 12.DL testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Peter WoodsClemson------------Lee HunterTexas Tech5.181.7921.58-4----Kayden McDonaldOhio State------------Keldric FaulkAuburn359-9----Christen MillerGeorgia------------Caleb BanksFlorida5.051.76329-6----Jaishawn BarhamMichigan4.641.613310-3----Chris McClellanMissouri5.051.8029.59-0----Rayshaun BennyMichigan------------Domonique OrangeIowa State------------Dontay CorleoneCincinnati------------Nick BarrettSouth Carolina5.101.7031.59-0--4.91Darrell Jackson Jr.Florida State------------LT OvertonAlabama4.871.70--------Kaleb ProctorSE Louisiana4.791.69339-5--4.71Tim KeenanAlabama5.311.84308-4----Zxavian HarrisOle Miss------------Skyler Gill-HowardTexas Tech------------Gracen HaltonOklahoma4.821.7036.59-6--4.79DeMonte CapehartClemson4.851.7233.58-11----Albert RegisTexas A&M4.881.72349-8--4.85Tyler OnyedimTexas A&M----329-3--Bryson EasonTennessee5.091.7830.59-4--5.00Brandon ClevelandNC State5.121.78--------David GustaKentucky4.881.6832------Zane DurantPenn State4.751.6633.59-4----Damonic WilliamsOklahoma------------Gary Smith IIIUCLA----28------Cameron BallArkansas5.131.79329-1--4.76Bobby Jamison-TravisAuburn------------Deven EasternMinnesota----27.59-4----Jackie MarshallBaylor4.881.69------4.68LB measurementsPlayerSchoolHeightWeightHandArmWingspanSonny StylesOhio State6-52441032⅞80⅞Anthony HillTexas6-22389⅝32⅜79Jake GoldayCincinnati6-4 ½2399½31⅞76⅞Josiah TrotterMissouri6-223710¼32¼--CJ AllenGeorgia6-0 ¾23010⅛31½75½Kyle LouisPittsburgh6-02209½31¼--Jacob RodriguezTexas Tech6-12319¼30⅞--Lander BartonUtah6-52339½32¼--Harold Perkins Jr.LSU6-12238⅛31⅜--Red MurdockBuffalo6-223210⅜31--Keyshaun ElliottArizona State6-22319¼31¼--Deontae LawsonAlabama6-32269¼31⅞--Bryce BoettcherOregon6-1233930⅝--Taurean YorkTexas A&M5-112268⅜30--Jimmy RolderMichigan6-2 ½2389⅝30½--Aiden FisherIndiana6-12329½31⅛--Wade WoodazClemson6-32361032⅝--Jack KellyBYU6-22409⅛31⅛--Kaleb Elarms-OrrTCU6-2234931½--Scooby WilliamsTexas A&M6-22319¼32--Justin JeffersonAlabama6-02231031⅝--Xavian SoreyArkansas6-22289⅝31⅝--Namdi ObiazorTCU6-322910½30⅝--Owen HeineckeOklahoma6-1 ½2279⅝30⅛--Kendal DanielsOklahoma6-52429½32⅝--Eric GentryUSC6-722110½35--Karson ShararIowa6-1 ⅝23110⅛31⅛--Wesley BissaintheMiami6-22259⅝31⅞--LB testing numbersNameSchool40-yard dash10-yard splitVertical (in)Broad (ft-in)3-coneShuttleBench (reps)Sonny StylesOhio State4.461.5643.511-2Anthony HillTexas4.511.583710-5Jake GoldayCincinnati4.621.603910-5Josiah TrotterMissouri----CJ AllenGeorgia----Kyle LouisPittsburgh4.531.5839.510-9Jacob RodriguezTexas Tech4.571.6038.510-1Lander BartonUtah----Harold Perkins Jr.LSU----Red MurdockBuffalo----Keyshaun ElliottArizona State----3810-5Deontae LawsonAlabama----Bryce BoettcherOregon----Taurean YorkTexas A&M----Jimmy RolderMichigan----369-11Aiden FisherIndiana----Wade WoodazClemson----Jack KellyBYU4.571.613710-5Kaleb Elarms-OrrTCU4.471.594010-4Scooby WilliamsTexas A&M----Justin JeffersonAlabama4.571.6038.510-5Xavian SoreyArkansas4.631.6637.510Namdi ObiazorTCU4.531.56379-11Owen HeineckeOklahoma4.621.6234.59-11Kendal DanielsOklahoma----Eric GentryUSC----Karson ShararIowa4.561.594010-3Wesley BissaintheMiami--Friday: TE and DB measurements and testing numbersResults will be added here as testing begins.Saturday: QB, RB and WR measurements and testing numbersResults will be added here as testing begins.\nSunday: OL measurements and testing numbersResults will be added here as testing begins.\n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL combine results: Measurements, 40 times, biggest takeaways - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/ae5c8051-61b4-420a-bc25-f569005f6017/thumbnail/1200x675/5a1825841cc4d23ed32e162472523c6d/nfl-combine.jpg"
      ],
      "datePublished": "2026-02-27T00:56:53.000Z",
      "dateModified": "2026-02-27T00:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan State vs. Purdue prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/michigan-state-purdue-odds-prediction-time-2026-college-basketball-picks-february-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/07/b7716f1c-ae69-4f03-af55-555a7f3d4266/thumbnail/1200x675/2a892b379e36a7207b95d1ce2fd744b2/purdue-oregon.jpg",
    "tag": "Sports",
    "date": "2026-02-26T22:21:18.000Z",
    "description": "\n        The 13th-ranked Michigan State Spartans meet the eighth-seeded Purdue Boilermakers on Thursday night in a battle for seeding for the upcoming",
    "body": "\n        The 13th-ranked Michigan State Spartans meet the eighth-seeded Purdue Boilermakers on Thursday night in a battle for seeding for the upcoming Big Ten Conference Tournament. Michigan State is coming off a 66-60 win over Ohio State on Sunday, while Purdue downed Indiana 93-64 on Friday. The Spartans (22-5, 12-4 Big Ten), who are 4-3 against ranked opponents, are 4-3 on the road this season. The Boilermakers (22-5, 12-4 Big Ten), who are also 4-3 against ranked foes, are 12-3 on their home court.Tip-off from Mackey Arena in West Lafayette, Ind., is set for 8 p.m. ET. Purdue leads the all-time series 77-57, including a 47-18 edge in games played at West Lafayette. Purdue is a 6.5-point favorite in the latest Purdue vs. Michigan State odds from DraftKings Sportsbook, while the over/under for total points scored is 142.5. Before making any Michigan  State vs. Purdue picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your first $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it entered Week 17 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on a 20-11 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Michigan State vs. Purdue 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Purdue vs. Michigan State:Michigan State vs. Purdue                                                                                                                         spread:    Purdue -6.5     at DraftKings SportsbookMichigan State vs. Purdue                                                                                                                                                                                                                                                                                                       over/under:    142.5 pointsMichigan State vs. Purdue                                                                                                                                                                                 money line:    Michigan State +254, Purdue -319Michigan State vs. Purdue                                                                                                                                                                                                                                                                                                                                    picks:    See picks at SportsLineMichigan State vs. Purdue                                                                                                                                                                                                                                                                                                                                     streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code CBSSPORTS2, good for $75 in fantasy bonus entries when you play $5 in select states.Top Michigan State vs. Purdue predictionsSportsLine's model is going Over on the total (142.5 points). The Over has hit in four of the last eight head-to-head meetings between the schools. The Over has hit in six of the last seven Michigan State games, and in five of the last eight Purdue games. Michigan  State is 5-5 against the spread in its last 10 games. Purdue, meanwhile, is 4-6 ATS in its last 10.The model projects the Spartans to have four players score 10 points or more, including Jeremy Fears Jr.'s projected 14.3 points. The Boilermakers are projected to have four players score 11.7 or more points, led by Braden Smith, who is projected to score 16 points. The model is projecting 151 combined points as the Over clears in over 70% of simulations.How to make Purdue vs. Michigan State picksThe model also says one side of the spread hits over 50% of the time. You can only see that pick at SportsLine.So who wins Michigan State vs. Purdue and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Michigan State vs. Purdue spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan State vs. Purdue prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/07/b7716f1c-ae69-4f03-af55-555a7f3d4266/thumbnail/1200x675/2a892b379e36a7207b95d1ce2fd744b2/purdue-oregon.jpg"
      ],
      "datePublished": "2026-02-26T22:21:18.000Z",
      "dateModified": "2026-02-26T22:21:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Champions League draw: Live stream, potential matchups, dates - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-draw-where-to-watch-live-stream-teams-seeds-potential-matchups/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/d2093d38-8806-4334-b48e-47d539e09d3f/thumbnail/1200x675/46e9b26abcbeb2289120cf9fedbd2111/real-madrid.jpg",
    "tag": "Sports",
    "date": "2026-02-27T00:20:54.000Z",
    "description": "\n        The 2025-26 Champions League is now entering its key phase after the end of the league phase and the playoffs, which saw some big surprises. ",
    "body": "\n        The 2025-26 Champions League is now entering its key phase after the end of the league phase and the playoffs, which saw some big surprises. Italian giants Inter and Juventus were both eliminated from the tournament after two disappointing defeats against Bodo/Glimt and Galatasaray, while Real Madrid knocked Jose Mourinho's Benfica out of the tournament after a much-discussed two-legged playoff.The teams that finished from ninth through 24th in the league phase took part in the playoffs, where a spot in the round of 16 against the top eight was on the line. Heading into Friday's draw, the list of potential opponents for each team is clear, but the exact matchups will finally be determined. The round of 16 will kick off on March 10 across Europe as the road to the May 30 final in Budapest gains steam. Here's what you need to know before tuning in, and don't forget, you can watch all the Champions League action live on Paramount+.Get ready for the Knockout Stage like never before with the UEFA Champions League Bracket Games! Create a pool to compete against friends or enter our Bracket Challenge for a chance to win a dream trip to London, including 2 UCL tickets and a tour of the UCL Today set! Plus, see how you stack up against UCL Today's own Jamie and Micah. Sign up now before brackets are unlocked after the Round of 16 Draw. Visit *tracked link* or play on the CBS Sports App!How to watchDate: Friday, Feb. 27 | Time: 6 a.m. ETLocation: House of European Football -- Nyon, SwitzerlandWatch: CBS Sports Golazo NetworkWhich teams are in the draw?Seeded (league phase top eight, ordered by league phase ranking)Arsenal Bayern MunichLiverpool TottenhamBarcelonaChelseaSporting CPManchester CityUnseeded (knockout phase playoff winners)Real Madrid PSGNewcastleAtletico MadridAtalantaBayer LeverkusenGalatasaray Bodo/GlimtUEFA Champions League bracket\nWhat does the path look like for the round of 16?The top eight teams in the league phase will be seeded in this round after securing a direct passageway to the last 16. Here is each team's list of potential opponents for the round of 16:\nArsenal's possible opponents: Atalanta, Bayer LeverkusenBayern Munich's possible opponents: Atalanta, Bayer LeverkusenLiverpool's possible opponents: Atletico Madrid, GalatasarayTottenham's possible opponents: Atletico Madrid, GalatasarayBarcelona's possible opponents: PSG, NewcastleChelsea's possible opponents: PSG, NewcastleSporting CP's possible opponents: Real Madrid, Bodo/GlimtManchester City's possible opponents: Real Madrid, Bodo/GlimtWhat are the rules for the knockout stages?The rest of the tournament will take place over a two-legged series, minus the final, with teams advancing to the next round based on aggregate scores. The away goals rule will not apply, with teams advancing to extra time and, if needed, penalties, if they are tied. Key Champions League datesFeb. 27: Draw for the round of 16, quarterfinals, semifinals, and finalMarch 10-18: Round of 16April 7-15: QuarterfinalsApril 28-May 6: SemifinalsMay 30: Final\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League draw: Live stream, potential matchups, dates - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/d2093d38-8806-4334-b48e-47d539e09d3f/thumbnail/1200x675/46e9b26abcbeb2289120cf9fedbd2111/real-madrid.jpg"
      ],
      "datePublished": "2026-02-27T00:20:54.000Z",
      "dateModified": "2026-02-27T00:20:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Hall of Famer Chris Bosh details 'terrifying' health scare: 'Lucky to be alive' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-hall-of-famer-chris-bosh-health-scare/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/dd415df2-2e79-446f-996a-5e5de2f44e5a/thumbnail/1200x675/ae60b5aee69275537410251b0761afd2/chris-bosh.jpg",
    "tag": "Sports",
    "date": "2026-02-26T23:14:16.000Z",
    "description": "\n        NBA Hall of Famer and Miami Heat legend Chris Bosh said he's \"lucky to be alive\" after a recent health scare. Bosh revealed Wednesday in a vi",
    "body": "\n        NBA Hall of Famer and Miami Heat legend Chris Bosh said he's \"lucky to be alive\" after a recent health scare. Bosh revealed Wednesday in a video posted to social media that he woke up covered in his own blood. Bosh, who is still recovering from the ordeal, said the incident occurred when he was getting ready for a date with his wife.\"Next thing you know, I was on the ground,\" Bosh said. Bosh doesn't remember anything other than waking up covered in his own blood. He declined to offer specifics about what exactly caused the medical event, but did go into further detail on his Substack, \"The Last Chip.\"\"I was walking from my closet into the bathroom, getting ready for an evening out, when my body turned on me,\" Bosh wrote. \"A numbing sensation shot down my left leg, that sharp, electric feeling you get when you bump your funny bone. Before I knew it, I was on the floor. I slowly came to in a pool of my own blood while my wife frantically spoke with 911. I tried to move my body the way I always had, and it didn't respond.\"\nBosh explained how the \"terrifying\" moment helped change his outlook on life.\n\"After coming back from the darkness, there was no euphoric clarity,\" Bosh wrote. \"... What did change was an immediate outlook on life that was simpler and more honest.\"Bosh retired from the NBA in 2019 after not having played since 2016 due to another health-related issue. Bosh suffered from recurring blood clots that cut his career short. It was first discovered in 2015, when a blood clot that started in his leg and traveled to one of his lungs ended his season after just 44 games. He returned the following season (2015-16), but a second blood clot was found, forcing him to miss the remainder of the season after playing 53 games.After several medical evaluations, Heat team doctors failed Bosh on his physical ahead of the 2016-17 decision despite his desire to play. It was determined that it would be too dangerous for him to continue his basketball career. He retired at 31, having won two championships with the Heat and earning 11 All-Star selections. In 2019, the Heat retired his jersey after playing six of his 13 years with the team. Bosh was inducted into the Naismith Basketball Hall of Fame in 2021.Bosh said he's \"lucky to be alive\" and plans to use this moment to share his experiences with others.\n\"This experience motivated me to start writing again, to share my experiences and stories in the hope that we can get something out of it and grow together,\" Bosh wrote.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Hall of Famer Chris Bosh details 'terrifying' health scare: 'Lucky to be alive' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/dd415df2-2e79-446f-996a-5e5de2f44e5a/thumbnail/1200x675/ae60b5aee69275537410251b0761afd2/chris-bosh.jpg"
      ],
      "datePublished": "2026-02-26T23:14:16.000Z",
      "dateModified": "2026-02-26T23:14:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy baseball rankings 2026: Optimal sleepers from 10,000 model simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-rankings-2026-sleepers-prediction-model-that-called-randy-arozarenas-amazing-year/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/18/91bcc65f-4dd0-4a45-bb33-7f5d524ae141/thumbnail/1200x675/e242c9108fa413e9f09796c18335f574/usatsi-26374269.jpg",
    "tag": "Sports",
    "date": "2026-02-26T22:16:29.000Z",
    "description": "\nMLB Spring Training is now several days in, meaning the start of the season is around the corner. That also means that 2026 Fantasy baseball drafts a",
    "body": "\nMLB Spring Training is now several days in, meaning the start of the season is around the corner. That also means that 2026 Fantasy baseball drafts are heating up, with owners looking to hit a home run on mid-to-late round Fantasy baseball sleepers. The likes of Mookie Betts, Yordan Alvarez, Oneil Cruz and Sandy Alcantara saw their production plummet last year due to various reasons. However, them now being a bit under the radar in Fantasy baseball draft rankings could result in them also being steals per their Fantasy baseball ADP.Identifying who you want to construct your 2026 Fantasy baseball strategy around is one thing, but then knowing when it's most advantageous to draft them is another. That's when having Fantasy advice comes in handy as it often takes into account factors which often go overlooked. Before finalizing your 2026 Fantasy baseball draft prep, be sure to see the 2026 Fantasy baseball rankings and cheat sheets from the proven computer model at SportsLine.Last season, SportsLine's Projection Model identified several top Fantasy baseball sleepers, breakouts and busts, including Mariners outfielder Randy Arozarena.A 2023 All-Star, Arozarena then posted career lows in both batting average and OPS the next year as he was traded from Tampa to Seattle. However, the model anticipated a full offseason with the Mariners would do the outfielder good, and he responded with the best year of his career. Arozarena had 27 homers, 76 RBI and 31 stolen bases as one of just six outfielders to have a 25/25 season as he was again an All-Star. Arozarena's Fantasy baseball ADP was just 154.50 last year -- 34th amongst outfielders -- but he responded by finishing 11th at the position in Fantasy points, thus rewarding anyone who took him in Fantasy baseball drafts.The SportsLine model is engineered by the same people who powered projections for all three major Fantasy sites. And that same group is sharing its 2026 Fantasy baseball rankings and cheat sheets over at SportsLine, helping you find Fantasy baseball sleepers, breakouts and busts long before your competition. Their cheat sheets, available for leagues on many major sites, are updated multiple times every day.Any time more MLB news comes out about free agency signings, trades or Fantasy baseball injuries, the team at SportsLine updates its projections. Go to SportsLine now to see these proven Fantasy baseball cheat sheets.Top 2026 Fantasy baseball sleepersOne of the Fantasy baseball sleepers 2026 the model is high on: Mets outfielder Luis Robert Jr. He was among the best all-around players in baseball in 2023 with 38 home runs, 80 RBI and 20 stolen bases while with the White Sox. However, injuries have both kept him out of the lineup and limited his on-field production the last two years, as he was traded to New York this offseason.Robert is just 28, and his speed is still there as he set a career high of 33 stolen bases last year. His 14 homers from a year ago should see a jump in going from Chicago's Rate Field, which is the 18th-best for hitting homers, per park factors, to New York's Citi Field, which is 10th-best. He'll also have much more protection behind him in New York's lineup, compared to Chicago which was last in the AL in slugging last year. Robert's ADP of 165 slots him outside the top 10 centerfielders and as the OF29, but the model projects him as a the No. 7 Fantasy centerfielder in its rankings.Another of the 2026 Fantasy baseball sleepers the model advises targeting: Cubs SP Matthew Boyd. After a decade in the majors, Boyd finally put it all together in 2025, winning 14 games and becoming a first-time All-Star at 34 years old. He had just 12 combined wins over his four previous season, which came with three different teams. Many Fantasy owners are seeing last year as an outlier for Boyd, as he's not even among the top 40 starting pitchers per his 2026 Fantasy baseball ADP, going off the board at No. 148 overall.But sometimes just working with a new organization can do wonders for a player as last year was Boyd's first in Chicago. He threw his sinker and slider at much lower rates than at previous stops, while utilizing his changeup more often. That's something that can carry over to this season, and the Cubs upgraded both offensively and defensively by adding Alex Bregman. The model loves Boyd as a Fantasy sleeper and puts him within the top 10 starting pitchers in the Fantasy baseball rankings 2026. See more sleepers at SportsLine.How to find proven 2026 Fantasy baseball rankingsSportsLine's model is also high on a surprising third baseman who bounces back with his new team to finish in the top eight of its positional rankings. This player is going well outside the top 200 picks but is projected to outperform third baseman like Alec Bohm and Isaac Paredes, who are being drafted over 100 spots earlier on average. This pick could be the difference in winning your league or going home with nothing. You can only see who it is here.So which 2026 Fantasy sleepers should you target in your upcoming drafts? Visit SportsLine now to get 2026 Fantasy baseball rankings for every single position, all from the model that called Randy Arozarena's big season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy baseball rankings 2026: Optimal sleepers from 10,000 model simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/18/91bcc65f-4dd0-4a45-bb33-7f5d524ae141/thumbnail/1200x675/e242c9108fa413e9f09796c18335f574/usatsi-26374269.jpg"
      ],
      "datePublished": "2026-02-26T22:16:29.000Z",
      "dateModified": "2026-02-26T22:16:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Free Kalshi NBA picks, predictions: Target Jalen Green, Josh Giddey on Thursday with promo code CBSSPORTS - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/free-kalshi-nba-picks-predictions-jalen-green-josh-giddey-on-thursday-promo-code-cbssports/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/8ce041f8-6c46-4c0d-92e4-c834b8dfe5b5/thumbnail/1200x675/a9a6b0e99f5f00de64bbfbe890656d2f/jalen-green-phoenix-suns.jpg",
    "tag": "Sports",
    "date": "2026-02-26T21:49:29.000Z",
    "description": "\n        There is a 10-game NBA schedule on Thursday night, perfect for claiming the newest Kalshi promo code CBSSPORTS, which offers new users a $10 ",
    "body": "\n        There is a 10-game NBA schedule on Thursday night, perfect for claiming the newest Kalshi promo code CBSSPORTS, which offers new users a $10 cash bonus after $10 in trades. One of the biggest games of the day is Suns vs. Lakers in a Western Conference showdown at 9 p.m. ET. Phoenix is without its top two scorers due to injury, giving other players an opportunity to step up. One of those players is shooting guard Jalen Green, who is still trying to find his role after missing most of the season thus far. SportsLine's proven computer model has Green scoring nearly 25 points on Thursday, and he is available at $0.58 per share to score 20-plus points at Kalshi. The model has also locked in NBA prop picks for Miles Bridges and Josh Giddey. Claim your $10 cash bonus after $10 in trades at Kalshi here with the Kalshi promo code CBSSPORTS:For the full terms and conditions and how to claim the promo, read our Kalshi promo code review.How to claim the Kalshi promo codeNew users can use the Kalshi promo code to claim this offer. For those who haven't used Kalshi and want a $10 bonus, follow these steps below. Here's how to sign up.Click \"CLAIM BONUS\" on this page or click here.Sign up for a Kalshi account and make a minimum $1 deposit.Trade at least $10 in event contracts.Receive your $10 bonus regardless of the trade outcomes.After making the first $10 in trades with the Kalshi promo code, new users will be given a $10 cash bonus after $10 in trades:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 19 on a sizzling 38-18 roll on top-rated NBA picks dating back to last season. Anyone following its advice could have seen huge returns.Best NBA player props on Thursday for Kalshi:Jalen Green, Suns, 20+ pointsMiles Bridges, Hornets, 6+ reboundsJosh Giddey, Bulls, 6+ assistsClaim your $10 cash bonus after $10 in trades at Kalshi here with the Kalshi promo code CBSSPORTS:Jalen Green, Suns, 20 points or more ($0.58 per share)Phoenix is currently playing without its top two scorers in Devin Booker and Dillon Brooks, who are averaging a combined 45 points per game. This has created a huge opportunity for Green, who has finally been able to get healthy after missing extensive time over the last few months. He has played in four straight games after playing in just seven other games this season. Green averaged 21 points per game for Houston last year before landing in Phoenix, and he will be relied upon heavily on Thursday night. SportsLine's model has Green finishing with 24.4 points in its latest simulations, providing cushion at this price. Back Green with the latest Kalshi promo code, which gives new users a a $10 bonus after $10 in trades:Miles Bridges, Hornets, 6 or more rebounds ($0.56 per share)Bridges has been Charlotte's second-leading rebounder this season, averaging 6.1 boards per game. He also plays a team-high 32 minutes per game and is coming off a 7-rebound performance against Chicago on Tuesday. Bridges only played 22 minutes in his return from a suspension, but he made a significant impact. His minutes should be significantly higher against Indiana on Thursday night, and the model has Bridges finishing with 7.2 rebounds.   Back Bridges with the latest Kalshi promo code, which gives new users a a $10 bonus after $10 in trades:Josh Giddey, Bulls, 6 or more assists ($0.64 per share)Giddey is averaging a team-high 8.4 assists per game for Chicago this season, sitting well ahead of teammate Tre Jones (5.4 apg). This is a chance to expect positive regression for Giddey after he finished with six assists or fewer in each of his last four games after returning from a hamstring injury. He was on a minutes' restriction in those outings, playing 27 minutes or fewer. The model has Giddey playing 28 minutes and recording 7.0 assists on Thursday night against Portland.  Back Giddey with the latest Kalshi promo code, which gives new users a a $10 bonus after $10 in trades:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Free Kalshi NBA picks, predictions: Target Jalen Green, Josh Giddey on Thursday with promo code CBSSPORTS - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/8ce041f8-6c46-4c0d-92e4-c834b8dfe5b5/thumbnail/1200x675/a9a6b0e99f5f00de64bbfbe890656d2f/jalen-green-phoenix-suns.jpg"
      ],
      "datePublished": "2026-02-26T21:49:29.000Z",
      "dateModified": "2026-02-26T21:49:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/\n                    ",
    "image": "https://sportsfly.cbsistatic.com/fly-467/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "tag": "Sports",
    "date": "2026-02-26T20:34:20.000Z",
    "description": "\n                \n                    Analysis\n                \n                \n                                            Chattanooga is only 6-10 ",
    "body": "\n                \n                    Analysis\n                \n                \n                                            Chattanooga is only 6-10 in the Southern Conference, with Greensboro right above them, sitting at 8-8, but I like the Moccasins at home tonight. I like them mostly because of what they did last Thursday at Mercer, as a 9.5-point underdog, and they won 94-90. They shot better than they had all season from the field, three-point range, and the free-throw line, and only turned the ball over five times. Then they won their next game at The Citadel, and now they get Greensboro, which has lost two in a row. Chattanooga has turned the corner, shooting 61% in its last two games, and the season's almost over. They get the job done tonight and cover.\n                                    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBS Sports - News, Live Scores, Schedules, Fantasy Games, Video and more. - CBS Sports",
      "image": [
        "https://sportsfly.cbsistatic.com/fly-467/bundles/sportsmediacss/images/fantasy/default-article-image-large.png"
      ],
      "datePublished": "2026-02-26T20:34:20.000Z",
      "dateModified": "2026-02-26T20:34:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Rockets-Magic, Michigan State-Purdue on Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-draftkings-promo-code-to-get-200-bonus-bets-rockets-magic-michigan-state-purdue-thursday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg",
    "tag": "Sports",
    "date": "2026-02-26T20:06:25.000Z",
    "description": "\n        Thursday features a top-15 college basketball Big Ten battle when No. 8 Purdue hosts No. 13 Michigan State, along with 10 NBA games, perfect ",
    "body": "\n        Thursday features a top-15 college basketball Big Ten battle when No. 8 Purdue hosts No. 13 Michigan State, along with 10 NBA games, perfect for claiming the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5+ bet wins. Purdue has won seven straight at home against Michigan State, but rather than backing a side, the SportsLine Projection Model finds the best value in taking Over 142.5 total points scored in an 8 p.m. ET matchup as one of its Thursday NBA best bets at DraftKings. Michigan State has gone Over in six of its last seven games. The model is also backing the Houston Rockets to cover as 1.5-point favorites on the road against the Orlando Magic for Thursday NBA best bets. One of SportsLine's top experts has also locked in a college basketball pick on South Dakota State vs. Kansas City at 8 p.m. ET. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5+ bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model entered Week 19 on a sizzling 38-18 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Thursday best bets at DraftKings SportsbookRockets (-1.5) vs. Magic (-115)Michigan State vs. Purdue: Over 142.5 total points (-105)South Dakota State (-11.5) vs. Kansas City (-110)Combining the three picks into a Thursday parlay at DraftKings would result in a payout of +596 (risk $100 to win $596, odds subject to change). Bet it at DraftKings here:Rockets (-1.5) vs. Magic (-115)The Rockets are coming off back-to-back wins by at least 20 points, defeating the Jazz and Kings and scoring at least 125 points in each contest. Although the Magic are a significantly tougher team than these two, Houston's offensive success could carry over on Thursday in Orlando. The Magic are 25-32 against the spread this season, and the Rockets are 36-21 overall entering a contest where they only need to win by two points to cover the number. Houston center Alperen Sengun had a triple-double with 26 points, 13 rebounds and 11 assists on Wednesday, and he'll be a matchup nightmare against for Orlando, which returns home after a cross-country flight and a 110-109 win over the Lakers on Tuesday. The model projects the Rockets to cover in 65% of simulations. Back the Rockets at DraftKings here:Michigan State vs. Purdue: Over 142.5 total points (-105)The Over has hit in six of the last seven Michigan State games and in three of the last four Purdue contests, including back-to-back games, entering Thursday. Five of Michigan State's last seven games have gone Over 142.5 total points as well, and all three of Purdue's recent Overs had at least 143 combined points scored. These are trends the model projects to continue on Thursday as these top-15 ranked teams go head-to-head, with the Over hitting in 77% of simulations. Back the Over at DraftKings here:South Dakota State (-11.5) vs. Kansas City (-110)\"It's one thing to be 4-24 and on a 12-game losing streak as Kansas City is, but the truth is that they haven't covered in any of those 12 games,\" SportsLine expert Eric Cohen said. \"KenPom ranks the Roos 355th, 11th-worst in the country, but it's hard to imagine that this sad team would beat anyone below them. At 13-16, South Dakota State isn't all that great, but they did beat UMKC by 28 in mid-January. Expect another 20+ point blowout as we'll continue to ride the trend of fading Kansas City.\" Back South Dakota at DraftKings here:Want more NBA and college basketball picks on Thursday?You've seen some of the model's Thursday best bets. Now, get against the spread, total and money-line picks for all games, including the NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Rockets-Magic, Michigan State-Purdue on Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg"
      ],
      "datePublished": "2026-02-26T20:06:25.000Z",
      "dateModified": "2026-02-26T20:06:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giancarlo Stanton injury: How Yankees plan to manage his playing time in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/giancarlo-stanton-injury-yankees-playing-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/1a777829-4fce-4801-a355-31d166e8584e/thumbnail/1200x675/5accd521be88a8fb12f58aaa528db05c/stanton-getty.png",
    "tag": "Sports",
    "date": "2026-02-26T16:00:17.000Z",
    "description": "\n        Yankees hulking designated hitter Giancarlo Stanton has dealt with plenty of injuries in his career. He didn't make his season debut in 2025 ",
    "body": "\n        Yankees hulking designated hitter Giancarlo Stanton has dealt with plenty of injuries in his career. He didn't make his season debut in 2025 until June 16 due to dealing with tennis elbow -- in both elbows. And yet Stanton, who turned 36 over the offseason, is looking to avoid the injured list in 2026. He seems to have accepted that he'll be in pain and can't do things many of us take for granted as normal, so long as he can keep taking swings. Asked if his elbow injuries have healed, Stanton told NJ.com \"that'll never be the case.\"Never?\"Not while I'm in this line of work,\" he said. \"You have your good days and bad days, just like your mood and everything.\"---\"I can't open a bottle,\" Stanton said. \"I can't open a bag of chips … a bag of anything. That's the way it is.\"Despite that, Stanton says he's still eyeing a full season. He and the Yankees are slow-playing things this spring, as he hasn't yet seen game action (he's expected to start his first game on March 3) but is getting in his work in the batting cages. During the regular season, the expectation is that he'll get regular playing time and also rest on occasion. \"No doubt, no doubt,\" Yankees manager Aaron Boone told NJ.com. \"We did that last year. There were days he was playing where it was tough for him, but he wanted in there. There are other days he wanted to be in there and I'd say, 'We have to stay disciplined to this because you're so critical to us.'\"Stanton played in just 77 games last season, but he's still capable of being a one-man wrecking crew. He hit .273/.350/.594, good for a huge 158 OPS+ and clubbed 24 homers with 66 RBI -- again, that's in less than half a season. In the last five seasons with the Yankees, Stanton has averaged 28.2 home runs and 108 games per season. The hope he and the Yankees have this season is he'll play a lot more than 108 games. If he does, we might well see 40 homers. The active leader in career homers, Stanton has 453 to his credit. He's signed through 2027 with a club option for 2028. Lovers of baseball history will note that it looks like there's a good chance Stanton gets to 500 career home runs. For the Yankees and Stanton, they'll just look to see him in the lineup this season for something like 135 games. \nWhen Stanton is in there, the Yankees have one of the more powerful lineups in the league. Trent Grisham hit 34 home runs last season and Jazz Chisholm had 31. Ben Rice hit 26 in only 467 at-bats, Cody Bellinger had 29 and then there are Judge and Stanton. That's six prolific power hitters before you even get to a catcher who hit 21 last season in Austin Wells.The Yankees went 94-68 last season, tying them for the best American League record, but they lost a tiebreaker to the Blue Jays and had to settle for a wild card. They were knocked out of the playoffs by the Jays in the ALDS.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giancarlo Stanton injury: How Yankees plan to manage his playing time in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/1a777829-4fce-4801-a355-31d166e8584e/thumbnail/1200x675/5accd521be88a8fb12f58aaa528db05c/stanton-getty.png"
      ],
      "datePublished": "2026-02-26T16:00:17.000Z",
      "dateModified": "2026-02-26T16:00:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]