[
  {
    "title": "Thunder vs. Timberwolves prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/thunder-timberwolves-odds-prediction-time-2026-nba-picks-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/0409b89c-cdba-4896-b9e5-bfb931fef474/thumbnail/1200x675/811476f6e1750a69a42235e4f22d9ad9/sga-okc-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-29T16:27:31.000Z",
    "description": "\n        The two teams who met in last season's Western Conference Finals will get reacquainted on Thursday's NBA schedule as the Oklahoma City Thunde",
    "body": "\n        The two teams who met in last season's Western Conference Finals will get reacquainted on Thursday's NBA schedule as the Oklahoma City Thunder visit the Minnesota Timberwolves. OKC (38-10) won that West Finals series in five games and is coming off a 104-95 victory over New Orleans on Tuesday. Minnesota (29-19) has won back-to-back outings, most recently defeating Dallas, 118-105, on Wednesday. Guard Jalen Williams (hamstring) is out for Oklahoma City. Tipoff is at 9:30 p.m. ET from the Target Center in Minneapolis. These teams have alternated wins and losses over their last eight regular-season matchups, with the Wolves prevailing in the last meeting. The latest Timberwolves vs. Thunder odds have OKC as 7.5-point favorites per DraftKings Sportsbook, while the over/under for total points scored is 224.5. Before making any Thunder vs. Timberwolves picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   Now, the model has simulated Timberwolves vs. Thunder 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Thunder vs. Timberwolves:Timberwolves vs. Thunder                                                                                                        spread:    Oklahoma City -7.5 at DraftKings    Timberwolves vs. Thunder                                                                                                                       over/under:    224.5 pointsTimberwolves vs. Thunder                                                                                                                       money line:    Thunder -275, Timberwolves +221Timberwolves vs. Thunder                                                                                                                       picks:See picks at SportsLineTimberwolves vs. Thunder                                                                                                                      streaming:Prime VideoNew users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:\nHow to make Thunder vs. Timberwolves picksAfter 10,000 simulations of Wolves vs. Thunder, SportsLine's model is going Over on the total (224.5). Three of their last four matchups in Minnesota have gone Over, and these are two of the most potent offenses in the NBA. The Thunder lead the league in scoring and rank among the top three in field goal percentage, 2-point percentage and free throw percentage. As for the Wolves, they own the No. 5 scoring offense and also boast top-5 rankings in field goal percentage and 3-point percentage.OKC will be without defensive ace Alex Caruso (adductor) and All-Defensive member in Jalen Williams, while Cason Wallace (hip), who ranks second in the NBA with 2.1 steals per game, is questionable. That's lots of firepower on the defensive end for the Thunder, which is why the model projects them to allow nearly 5 more points than their regular season average. With that, the teams are projected to combine for 228 points as the Over hits 51.8% of the time.It has also generated an against-the-spread pick that hits over 50% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Thunder vs. Wolves, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Timberwolves vs. Thunder spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thunder vs. Timberwolves prediction, odds, time: 2026 NBA picks for Thursday, Jan. 29 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/0409b89c-cdba-4896-b9e5-bfb931fef474/thumbnail/1200x675/811476f6e1750a69a42235e4f22d9ad9/sga-okc-imagn.jpg"
      ],
      "datePublished": "2026-01-29T16:27:31.000Z",
      "dateModified": "2026-01-29T16:27:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting 76ers-Kings, Suns-Pistons on Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-200-bonus-bets-76ers-kings-suns-pistons-thursday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-29T16:17:32.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Thursday's sports sc",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, and Thursday's sports schedule brings a loaded slate of college basketball and NBA games. There are eight NBA games, including a showdown between the Pistons and Suns at 9 p.m. ET. Detroit scored 139 points against Sacramento on Sunday, but the over/under for Thursday's matchup against Phoenix is just 214.5. SportsLine's proven computer model is taking the Over as one of its Thursday NBA best bets and also revealed a pick for 76ers vs. Kings. Additionally, SportsLine expert Matt Severance has a college basketball best bet for Thursday. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. It also enters Week 13 of college basketball on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season, and it is on a 6-0 roll on college basketball side picks. Anybody following its college basketball betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Thursday's top picks, best betsDrexel -161 vs. Hampton Kings +11.5 vs. 76ers (-110)Over 214.5 in Pistons vs. Suns (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +491 (risk $100 to win $491). Bet it at bet365 here:Drexel -161 vs. Hampton\"Pair of teams sitting 10-11 overall and 4-4 in CAA play, but Drexel is trending up having won four of five while Hampton has dropped four of six,\" SportsLine expert Matt Severance said. \"The Pirates also have lost four in a row away. Could be a rock fight as the Dragons limit opponents to a conference-best 66.7 points while the Pirates yield 67.8 points. Hampton and Drexel have allowed the fewest field goals in the CAA and the fewest 3-pointers. Hampton has averaged just 63.3 ppg in the past four matchups with Drexel and scored 52 there in a loss last season. One of the Pirates' best players, Michael Eley, is slumping while playing through a toe injury with just 11 combined points in the past two.\" Back Drexel at bet365 here:\nKings +11.5 vs. 76ers (-110)Philadelphia is coming off a 139-122 win over Milwaukee on Tuesday, but that was the 76ers' first win by double digits since Jan. 12. They have lost five of their eight games since then, with three of those setbacks coming at home. Sacramento is on a six-game skid, but it has played several close games during that stretch, including a 123-118 loss at Cleveland last Friday as a 13-point underdog. SportsLine's model expects a similar result on Thursday, as the Kings are covering in 67% of the model's simulations. Back the Kings at bet365 here:Over 214.5 in Pistons vs. Suns (-110)Detroit is tied for tenth in the NBA in points per game (117.2) this season, scoring 139 points against the Kings on Sunday. The Pistons are led by one of the NBA's premier scorers in Cade Cunningham, who is averaging 25.3 points per game. They also rank inside the top half of the league in possessions per game, so this is a low total given the moderate tempo that the game should be played at. These teams have both been trending Under, creating value on the Over due to the low total. The model has the Over cashing 61% of the time, as they combine for 224 points in the latest simulations. Back the Over at bet365 here:\nLooking for NBA and college basketball picks?You've seen the model's best bets for Thursday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $200 bonus bets by targeting 76ers-Kings, Suns-Pistons on Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-29T16:17:32.000Z",
      "dateModified": "2026-01-29T16:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA DFS picks, Thursday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-dfs-draftkings-fanduel-daily-fantasy-basketball-picks-january-29/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/bdba9cc5-7f3f-400f-9f77-68d8d1830d36/thumbnail/1200x675/e1718614e03145f10f8edf4f0acf9384/matas-buzelis-bulls-cbs.jpg",
    "tag": "Sports",
    "date": "2026-01-29T18:02:18.000Z",
    "description": "\n        Thursday's NBA slate features eight games, which begins at 7 p.m. ET, and has the last tip at 9:30 p.m. ET.     There are a number of high qu",
    "body": "\n        Thursday's NBA slate features eight games, which begins at 7 p.m. ET, and has the last tip at 9:30 p.m. ET.     There are a number of high quality options in the NBA DFS player pool to build your daily Fantasy basketball lineups around. Stars like Shai Gilgeous-Alexander, Cade Cunningham, Anthony Edwards, Kevin Durant, Tyrese Maxey, Jalen Johnson and Alperen Sengun are in action, so you certainly have plenty of directions to go with NBA DFS picks. Finding someone who can outperform his price tags on sites like FanDuel and DraftKings is key to that and to constructing a winning NBA DFS strategy.  Among those who are out for tonight include Donte DiVincenzo (toe), Ajay Mitchell (hip), Tari Eason (ankle) and Aaron Gordon (hamstring). That means there are several players who could make a difference in their absences. Who should find their way into your daily Fantasy basketball lineups? Before making any NBA DFS picks, be sure to check out the NBA DFS advice, player rankings, stacks, and top daily Fantasy basketball picks from SportsLine's Mike McClure.New users can also target the DraftKings promo code, which offers $300 in bonus bets if your initial $5 bet wins:\nMcClure is a DFS professional with more than $2 million in career winnings. He's also a predictive data engineer at SportsLine who uses a powerful prediction model that simulates every minute of every game 10,000 times, taking factors like matchups, statistical trends and injuries into account. This allows him to find the best NBA DFS values on sites like DraftKings and FanDuel and create optimal lineups that he shares only over at SportsLine. They're a must-see for any NBA DFS player.McClure has turned his attention to NBA action on Thursday and locked in his top daily Fantasy basketball picks. You can only see them by heading to SportsLine.Top NBA DFS picks for Thursday, January 29For Thursday, one of McClure's top NBA DFS picks is Bulls guard Ayo Dosunmu. He's also stacking Dosunmu with power forward Matas Buzelis, who is coming off a 20-point, eight-rebound effort in a 113-110 loss at Indiana on Wednesday. Buzelis had 21 points, four assists, two blocks and two rebounds in a 138-110 win over the Los Angeles Clippers on Jan. 20.      \nChicago has won four of its last six games in part because of Buzelis' play. In 47 games this season, all starts, he is averaging 14.9 points, 5.3 rebounds, two assists and 1.4 blocks in 27.9 minutes. He is connecting on 47.9% of his field goals, including 36.5% of his 3-pointers, and 77.9% of his free throws. New users can see the latest FanDuel promo code to get $200 in bonus bets at FanDuel if your $5 bet wins:As for Dosunmu, the fifth-year veteran is averaging 14.6 points in 41 games played, including seven starts. He had 19 points, four rebounds and four assists in a 113-110 loss at Indiana on Wednesday. \nIn a 129-118 loss to the Los Angeles Lakers on Monday, he scored 20 points and added three rebounds and two assists in 25 minutes. The Bulls have a favorable matchup with the Miami Heat, who have the 24th ranked scoring defense, which allows 118.4 points per game. See McClure's other NBA DFS picks right here.How to set your NBA DFS lineups for Thursday, Jan. 29McClure is also targeting a player who could go off for massive numbers on Thursday because of an optimal matchup. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is here.Who is DFS pro Mike McClure putting in his optimal NBA DFS lineups for Thursday? Visit SportsLine now to see optimal NBA DFS picks, rankings, advice, and stacks, all from a professional DFS player who has over $2 million in career winnings, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA DFS picks, Thursday lineup advice from daily Fantasy professional who's won $2 million - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/bdba9cc5-7f3f-400f-9f77-68d8d1830d36/thumbnail/1200x675/e1718614e03145f10f8edf4f0acf9384/matas-buzelis-bulls-cbs.jpg"
      ],
      "datePublished": "2026-01-29T18:02:18.000Z",
      "dateModified": "2026-01-29T18:02:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Seahawks prediction, odds, date, line: 2026 Super Bowl picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-seahawks-prediction-odds-spread-date-2026-super-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/ff0ccc51-3fd3-4475-9f58-a42b1e8c9c1e/thumbnail/1200x675/6747b43dc4305d92293521c35cabe796/jaxon.jpg",
    "tag": "Sports",
    "date": "2026-01-29T16:21:28.000Z",
    "description": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks. For the first time in the history of The Big Game",
    "body": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks. For the first time in the history of The Big Game, each team ranks in the top four in both scoring offense and scoring defense, providing a balanced Super Bowl 60 matchup. New England (14-3) went on the road to defeat Denver, 10-7, in the AFC Championship Game, while Seattle (14-3) held off the Rams, 31-27, to claim the NFC Title Game. The 2026 Super Bowl is a rematch from 11 years ago when the Pats prevailed 28-24 to win Super Bowl XLIX.Kickoff is at 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. The Seahawks are 11-9 all-time versus New England. Seattle is the 4.5-point favorite in the latest Seahawks vs. Patriots   odds from DraftKings Sportsbook, while the over/under for total points is 45.5. Before making any Patriots vs. Seahawks picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Seahawks vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Patriots vs. Seahawks:\nSeahawks vs. Patriots spreadSeattle -4.5 (-115) at DraftKings SportsbookSeahawks vs. Patriots                 over/under45.5 pointsSeahawks vs. Patriots                                                                                                                                                                                  money line Seahawks -234, Patriots +194Seahawks vs. Patriots                                                                                                                                                                         picksSee picks at SportsLineSeahawks vs. Patriots                                                                                                                                                                            streaming Fubo (try for free)Why the Patriots can coverThe Pats shook off talk about their weak strength of schedule by defeating three playoff teams that had 11-plus wins in the regular season. They enter Super Bowl LX with a 16-1 record over their last 17 games, which is not a record that even Seattle can measure up to. New England has incredible balance, ranking second in points scored and fourth in points allowed, with the offense specifically standing out. Drake Maye combines both efficiency with a big-play ability as he leads the league in both completion percentage and yards per pass attempt. Meanwhile, the defense is playing its best entering Super Bowl Sunday as New England has given up one or fewer touchdowns in each of its last five games. See which team to back at SportsLine. Why the Seahawks can coverIt's hard to find any holes with Seattle, including in regard to the spread, as it has both the most covers and the best cover percentage of the regular plus postseason. The Seahawks are the only NFL team to rank in the top three in both scoring offense and scoring defense, and just five teams had more takeaways in the regular season. Mike Macdonald's crew also boasts top-10 rankings on both the ground and thru the air, but the defense is the star of this team. Seattle leads the NFL in points allowed, third-down defense, yards per rush allowed and yards per pass attempt allowed while ranking second in yards per play given up and rushing touchdowns allowed. No. 1 scoring defenses, like what Seattle has, also have a great history in this game, with a 14-4 all-time Super Bowl record. See which team to back at SportsLine.How to make Seahawks vs. Patriots picksSportsLine's model has simulated Patriots vs. Seahawks 10,000 times and is going Under on the total, projecting 44 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Seahawks vs. Patriots, and which side of the Super Bowl spread is the better value? Visit SportsLine now to see which side of the Patriots vs. Seahawks spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks prediction, odds, date, line: 2026 Super Bowl picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/ff0ccc51-3fd3-4475-9f58-a42b1e8c9c1e/thumbnail/1200x675/6747b43dc4305d92293521c35cabe796/jaxon.jpg"
      ],
      "datePublished": "2026-01-29T16:21:28.000Z",
      "dateModified": "2026-01-29T16:21:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Rockets-Hawks, Rangers-Islanders on Thursday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-300-bonus-bets-rockets-hawks-rangers-islanders-thursday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-01-29T16:20:35.000Z",
    "description": "\n        Regardless of your go-to winter sport, the Thursday sports calendar has you covered, and the current DraftKings promo code gives new users $3",
    "body": "\n        Regardless of your go-to winter sport, the Thursday sports calendar has you covered, and the current DraftKings promo code gives new users $300 in bonus bets if your first $5 bet wins as one of the best ways to begin online sports betting. With 30 of the 32 NHL teams in action, plus an eight-game NBA schedule and heavy college basketball slate, sports bettors have plenty of  Thursday options. The SportsLine Projection Model is targeting a New York vs. New York rivalry matchup for one of its Thursday best bets at DraftKings Sportsbook, backing the Islanders to defeat the Rangers at -142 odds.The model has also locked in its NBA best bets, taking Over 224.5 points in Rockets vs. Hawks. One of SportsLine's top experts has locked in a college basketball bet on Oral Roberts vs. South Dakota State at 8 p.m. ET. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Thursday best bets at DraftKings SportsbookIslanders (-142) vs. RangersRockets vs. Hawks: Over 224.5 total points (-112)South Dakota (-4.5) vs. Oral Roberts (-112)Combining the three picks into a Thursday parlay at DraftKings would result in a payout of +510 (risk $100 to win $510). Bet it at DraftKings here: (Odds subject to change)\nIslanders (-142) vs. RangersThe Islanders may be the perceived \"little brother\" in this New York rivalry, but little brother is dominating big brother this year. The Islanders are 3-0 against the Rangers this season, outscoring the Rangers 12-2 in those contests. The Islanders defeated the Rangers, 5-2, at home on Wednesday and will travel to Madison Square Garden on Thursday, but home ice has't exactly been an advantage for the Rangers this season. They are 6-13-4 at home this season, while the Islanders are 14-10-3 on the road. The Islanders have a 13-point lead on the Rangers (63-50) in the standings, and the model projects value in the Islanders at these odds for Thursday NHL bets. The model projects the Islanders to win in 63% of simulations, compared to the implied odds of 58.7%. Bet the Islanders to win at DraftKings here:Rockets vs. Hawks: Over 224.5 total points (-112)The Rockets and Hawks are both playing in the second half of a back-to-back, and fatigue can favor the offense, with teams sometimes playing with lackluster defensive intensity on tired legs. The Hawks are seventh in the NBA in scoring (117.7 points per game) and 25th in team defense (118.4 ppg allowed), which has resulted in the Over hitting in 25 of 49 games. The Rockets are 15th in scoring at 116.3 ppg, and with a superstar like Kevin Durant in the lineup, they are always capable of a high scoring total. The model projects the Over to hit in 62.6% of simulations. Bet the Over to cover at DraftKings here:South Dakota (-4.5) vs. Oral Roberts (-112)\"They could use another miracle at Oral Roberts as this season has gone off the rails and the Big Dance bids under Paul Mills seem like a dream,\" legendary SportsLine expert Bruce Marshall said. \"Mills, of course, headed off to Wichita State a few years ago, and the Golden Eagles have since sunk to the bottom of the Summit, and not within single digits in their last five losses. Among the many problems is ranking a poor 306th in rebound margin. Meanwhile, the host Coyotes have at least won some games in the Summit, and even minus top scorer Isaac Bruns beat Omaha and pushed top contender St Thomas last week, with EKU transfer guard Jordan Crawford assuming go-to duties, scoring at a 24.3 pg clip the past three.\" Bet South Dakota to cover at DraftKings here:\nWant more NBA, college basketball and NHL picks for Thursday?You've seen some of the model's Thursday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Rockets-Hawks, Rangers-Islanders on Thursday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-01-29T16:20:35.000Z",
      "dateModified": "2026-01-29T16:20:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA player props, picks, odds: Joel Embiid among Thursday best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-player-props-picks-odds-best-bets-thursday-january-29-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/2fbc3213-afec-46f1-9a09-1556deff5f6e/thumbnail/1200x675/df5885a79b551a9b2160f00eb0541b8f/joel-embiid-76ers.jpg",
    "tag": "Sports",
    "date": "2026-01-29T15:50:11.000Z",
    "description": "\n        There are eight games on the NBA schedule on Thursday, and hundreds of NBA player props to choose from, but 76ers center Joel Embiid presents",
    "body": "\n        There are eight games on the NBA schedule on Thursday, and hundreds of NBA player props to choose from, but 76ers center Joel Embiid presents an interesting opportunity for NBA bettors. The former NBA MVP is being heavily limited given his injury history, and he's expected to play for the second time in three days on Thursday against the Kings. The latest NBA odds list Embiid's over/under for total rebounds at 9.5, but he's averaging only 7.5 rebounds per game this season and has a daunting matchup with Domantas Sabonis ahead. The SportsLine Projection Model predicts Embiid will finish with only 7.2 rebounds on average and recommends Michael Porter Jr. Over 25.5 points and Dyson Daniels Under 6.5 assists among its best NBA player props.Targeting NBA player props will be a popular way to approach Thursday's NBA betting at online sports betting sites. With NBA odds available for almost every player in every game at sportsbooks, the model can help you find value to add to your Thursday NBA picks at various sportsbooks. They can also help new users take advantage of sportsbook promos like the DraftKings promo code, where new users can bet $5, and get $300 in bonus bets if your first bet of at least $5 wins: The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 15 of the 2025-26 NBA season on a sizzling 37-16 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Best NBA player prop picks on Thursday:Michael Porter Jr., Nets, Over 25.5 pointsJoel Embiid, 76ers, Under 9.5 reboundsDyson Daniels, Hawks, Under 6.5 assistsClick here to play these NBA props with the latest FanDuel promo code, which gives new users $200 in bonus bets if your first $5 wager wins:\nMichael Porter Jr., Nets, Over 25.5 points (-110)After seven seasons in Denver, Porter landed in Brooklyn and has become the primary scoring option for the Nets. He's averaging 25.2 points per game this season, but has scored 30 or more in two of his last three games. On Thursday, he'll take on his former team -- the Nuggets -- and he dropped 27 points against them earlier this season. Denver will be without Nikola Jokic (knee) and Aaron Gordon (hamstring) tonight, and that's a big reason why the model predicts 28.6 points on average.Bet on Porter with the latest FanDuel promo code, which gives new users $200 in bonus bets if their first $5 wager wins:Joel Embiid, 76ers, Under 9.5 rebounds (-120)There's plus-money available at 8.5 on FanDuel (+104), and that's helping juice our parlay, but he's cleared that hurdle in each of his last four games. However, he's been Under 9.5 rebounds seven of the last nine times that he's suited up, and it's worth the squeeze as a single play. He's got a tough rebounding matchup on Thursday night, and the model is predicting that he finishes with 7.2 rebounds on average.\nBet on Embiid with the latest bet365 bonus code CBSBET365, which gives new users $200 in bonus bets instantly after their first $5 wager:Dyson Daniels, Hawks, Under 6.5 assists (-112)Daniels has evolved into one of the league's elite defenders, and his length as a guard has also turned him into an incredibly capable playmaker. He's cleared this number in four of his last five games. However, he's only averaging 6.3 assists per game this season and has been Under 6.5 assists in 25 of the 47 games that he's played this season. The Rockets rank fourth in the NBA in points allowed per game (110.5), and the model is predicting that Daniels only manages 5.4 assists on average.Bet on Daniels with the latest FanDuel promo code, which gives new users $200 in bonus bets if their first $5 wager wins:\nWant more Thursday NBA picks?You've seen the model's NBA picks for some popular NBA player props for Thursday. Now, get against the spread, total and money line picks for every game here, all from the model that's simulated every game 10,000 times. Also at SportsLine:NBA expert Prop Bet Guy is 65-43 (+1532) in his last 108 NBA player prop picks this season. See his latest NBA predictions here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA player props, picks, odds: Joel Embiid among Thursday best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/2fbc3213-afec-46f1-9a09-1556deff5f6e/thumbnail/1200x675/df5885a79b551a9b2160f00eb0541b8f/joel-embiid-76ers.jpg"
      ],
      "datePublished": "2026-01-29T15:50:11.000Z",
      "dateModified": "2026-01-29T15:50:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots are just fourth Super Bowl team with this stunning distinction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-patriots-make-history-shocking-result/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/27/c1037a99-8672-4624-8bda-98f397bf9072/thumbnail/1200x675/13a0635d766e4c916a18e7d096ece8ad/new-england-patriots.jpg",
    "tag": "Sports",
    "date": "2026-01-29T18:49:41.000Z",
    "description": "\n\n\n    \n                                    Looking back on it, this might have been the most shocking result of the 2025 season\n        \n            ",
    "body": "\n\n\n    \n                                    Looking back on it, this might have been the most shocking result of the 2025 season\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 29, 2026\n                            \n                    at\n    1:49 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        In just 10 days, the New England Patriots will be playing in Super Bowl LX, but when the season started, the Patriots definitely didn't look like a team that was going to eventually be playing for the Lombardi Trophy. Back in Week 1, the Patriots lost to the Raiders in what now looks like the most shocking result of the entire regular season. The Patriots defense carried New England through the playoffs, but the unit didn't show up for the season opener, a game where Geno Smith threw for 362 yards and a touchdown in a 20-13 win for the Raiders. In the loss to the Raiders, the Patriots were plagued by mistakes in the game: Drake Maye threw an interception and Andy Borregales missed a short field goal (40 yards), which would end up being the only field goal attempt he would miss through the first 10 weeks of the season. One reason the eventual outcome now looks so shocking is because the Raiders ended up with the worst record in the NFL. They ended up finishing 3-14, which clinched the No. 1 overall pick in the 2026 NFL Draft. The Pete Carroll era got off to a hot start with the win over New England and it looked like the Raiders might be a force in 2025, but instead, Carroll was fired and Las Vegas ended up with the worst record in the NFL. \n        \n            \n                2026 Super Bowl uniforms revealed: Patriots to debut new big-game look, Seahawks wearing jersey they're 0-2 in\n                \n                    John Breech                \n            \n                            \n    \n                \n                    \n    \nIn the 60 years of the Super Bowl era, there have only been three previous instances in history where a Super Bowl team lost to the team that ended up clinching the No. 1 overall pick (via the AP). Let's check those out: \n1968: Bills 37-35 over Jets. In 1968, the Bills only won a ONE game and it came against a Jets team that would eventually win Super Bowl III. Joe Namath, who would lead the Jets to a stunning upset win over the Colts in the Super Bowl, threw five interceptions in this Week 4 loss to the Bills, who would eventually finish 1-12-1. They earned the No. 1 overall pick for 1969, which they ended up using on O.J. Simpson. 1987: Atlanta 21-20 over Washington. Gerald Riggs scored a fourth-quarter touchdown for the Falcons that ended up providing the game-winning points in this Week 2 win. The loss clearly sparked Washington, a team that would end up destroying the Broncos, 42-10, in Super Bowl XXII. As for the Falcons, who went 3-12 in 1987, they ended up with the No. 1 overall pick in 1988 and they used it on Audray Bruce. He never became a household name, but he did last 11 seasons in the NFL. 1997: Colts 41-38 over Packers. The Colts were a 13.5-point underdog in this game, but they managed to pull off the upset when Cary Blanchard hit a 20-yard field goal to give Indy the win on the final play of the game. Colts' QB Paul Justin (340 yards) outdueled Brett Favre, who threw two interceptions. The Packers ended up getting to the Super Bowl XXXII, where they would lose to the Broncos, 31-24. As for the Colts, who finished the season 3-13, they ended getting the No. 1 overall pick in 1998 and they used it on someone named Peyton Manning. If the Patriots beat the Seahawks in Super Bowl LX, they'd become the first team in 39 years to win a Lombardi Trophy in the same season where they lost to the team with the worst record in the NFL. The Patriots finished 14-3 during the regular season and the fact that one of those three losses came to the Raiders definitely qualifies as one of the biggest surprises of the regular season. \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots are just fourth Super Bowl team with this stunning distinction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/27/c1037a99-8672-4624-8bda-98f397bf9072/thumbnail/1200x675/13a0635d766e4c916a18e7d096ece8ad/new-england-patriots.jpg"
      ],
      "datePublished": "2026-01-29T18:49:41.000Z",
      "dateModified": "2026-01-29T18:49:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Josh Allen injury: Bills QB reveals he finished season with broken foot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/josh-allen-injury-bills-qb-broken-foot-surgery/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/5e49f733-2117-4467-bee7-de9b9266f994/thumbnail/1200x675/feb01f4a1cd604f3c3e49ecaf5ab7c05/allenden.png",
    "tag": "Sports",
    "date": "2026-01-29T19:41:04.000Z",
    "description": "\n        Buffalo Bills quarterback Josh Allen recently underwent surgery after playing with a broken bone in his right foot during the final weeks of ",
    "body": "\n        Buffalo Bills quarterback Josh Allen recently underwent surgery after playing with a broken bone in his right foot during the final weeks of the 2025 season. Allen described it Thursday as an older injury that he aggravated during the Bills' Week 16 win over the Cleveland Browns. Specifically, the procedure repaired Allen's fifth metatarsal avulsion. The projected timetable for his recovery is 8-10 weeks, which means that Allen should be fine by voluntary offseason workouts in the spring. Buffalo went 2-2 over the span of Allen's injury. That included a wild-card playoff win over the Jacksonville Jaguars and a season-ending loss to the Denver Broncos in the divisional round. \"Obviously, not an ideal situation,\" Allen said. \"Painful throughout the weeks, but again, on game day, [it's a] different story, just being able to put that to the side and just go out there and play football.\" \nAllen entered the press conference with the aid of crutches and a walking boot. \nIn Denver, Allen and his teammates suffered yet another excruciating playoff loss, compelling the Bills to fire coach Sean McDermott and promote offensive coordinator Joe Brady to the lead role. \"If I make one more play in Denver, we're not sitting here right now having this press conference,\" Allen said. \"We're probably getting ready to play another game.\"\nWhile he said McDermott's firing was \"very emotional,\" Allen is excited to continue working with Brady, who has been on Buffalo's staff since 2022. \"He is in the building dang near all day,\" Allen said of Brady. \"And that's not going to stop. He's going to continue to keep working hard and trying to find ways for our team to be put in successful positions. And he's very much driven by that. And when he says he loves to work, he truly loves to work. He loves to work. He loves football, he loves this game, he loves the players, and that's very evident in our meetings. \"I think, when he's in front of our defense and our special teams players as well as our offense, people are going to understand that the love is real, and that the want to win and the want to bring a trophy here to Western New York is real. So, yeah, I'm looking forward to it.\" \nAllen, who was part of Buffalo's head coach interview process, was also asked about Keon Coleman after Bills owner Terry Pegula essentially blamed McDermott for the team drafting him back in 2024. \"I'm not going to give up on (him),\" Allen said. \"He's got too much ability. I will not give up on him. We're gonna we're gonna work tirelessly, him and me as everybody else in this building, to make sure that whenever we step foot on the field, that we're going to we're going to find ways to win football games, and he's going to be a part of that.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Josh Allen injury: Bills QB reveals he finished season with broken foot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/5e49f733-2117-4467-bee7-de9b9266f994/thumbnail/1200x675/feb01f4a1cd604f3c3e49ecaf5ab7c05/allenden.png"
      ],
      "datePublished": "2026-01-29T19:41:04.000Z",
      "dateModified": "2026-01-29T19:41:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Super Bowl uniforms revealed: Patriots going all white, Seahawks in Navy blue jersey - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-super-bowl-uniforms-revealed-patriots-debut-new-look-seahawks-jersey/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/ddd0acfc-36d8-4d69-b85c-51ea06c3e964/thumbnail/1200x675/bf5e90ae96c5a9a894f65b8eae4a603d/patriots-sb-uniform.png",
    "tag": "Sports",
    "date": "2026-01-29T18:46:55.000Z",
    "description": "\n        The uniforms for Super Bowl LX have finally been unveiled and both teams will be wearing something new in the form of a special patch. The tw",
    "body": "\n        The uniforms for Super Bowl LX have finally been unveiled and both teams will be wearing something new in the form of a special patch. The two teams will be wearing a special \"USA 250\" patch to celebrate the 250th anniversary of the United States. NFL commissioner Roger Goodell had announced in November that the league would be celebrating the country's 250th birthday throughout 2026 and that will start on Super Bowl Sunday. The patch won't be the only new thing for the New England Patriots. For their 12th Super Bowl appearance, the Patriots have decided to wear a uniform combination that they've never worn in the big game. As the home team in Super Bowl LX, the Patriots got to make the first choice on which uniform to wear and they've decided to go with their white jersey over white pants. \nThe Patriots have worn white before in the Super Bowl, but they've never gone with an all-white look. This will mark the sixth time in their record-setting 12 Super Bowl appearances that the Patriots have worn a white jersey. In five of those games, they paired their white jersey with blue pants, and in one game, they paired their white jersey with silver pants. Overall, the Patriots are 4-2 in the Super Bowl with their white jerseys and that includes a win over the Seahawks back in Super Bowl XLIX. \nHere's a breakdown of the six previous times that New England wore white in the Super Bowl: \nPatriots: Four wins in white -- Super Bowl XXXIX (Patriots 24-21 over Eagles), Super Bowl XLIX (Patriots 28-24 over Seahawks), Super Bowl LI (Patriots 34-28 over Falcons), Super Bowl LIII (Patriots 13-3 over Rams)Patriots: Two losses in white -- Super Bowl XXXII (Packers 35-21 over Patriots), Super Bowl LII (Eagles 41-33 over Patriots)This will mark the first time in five years that the \"home\" team in the Super Bowl has worn white (the AFC is the home team in even-numbered games, while the NFC is the home team in odd-numbered games). The last time it happened came in 2020 when Tom Brady's Buccaneers chose to wear white for their Super Bowl win over the Chiefs. Speaking of Brady, it wouldn't be surprising if he's in attendance on Super Bowl Sunday at Levi's Stadium to watch his old team in action. Brady won six Super Bowls in New England, with the most recent one coming in 2018. For the Patriots, it makes a lot of sense to wear white and that's because they went undefeated in their white uniforms this season. The Patriots wore their white jerseys in six games this year and went 6-0, including their 10-7 win over the Broncos in the AFC Championship game. Out of those six wins, they wore the white-on-white combination in five of those games. White has been a solid color for any team to wear in the Super Bowl over the past two decades. Over the past 21 years, the team wearing white has gone 16-5. That said, the team in white has lost two straight Super Bowls, which could be good news for the Seahawks, who are expected to wear their Navy blue jerseys, although they haven't made an official announcement yet. \nThis will be Seattle's fourth time in the NFL's biggest game. The Seahawks wore Navy blue in two of their previous three Super Bowls and lost both times.   Seahawks: 0-2 in Navy blue -- Super Bowl XL (Steelers 21-10 over Seahawks), Super Bowl XLIX (Patriots 28-24 over Seahawks)The Seahawks wore blue pants in both of their Super Bowl losses, so they could change things up by wearing their grey pants. The Seahawks' only Super Bowl win in franchise history came in a game in which they wore their white jerseys. In Super Bowl XLIX against the Patriots, the Seahawks were the home team and they could have opted to wear white, but instead, they decided to go with their Navy blue jersey. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Super Bowl uniforms revealed: Patriots going all white, Seahawks in Navy blue jersey - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/ddd0acfc-36d8-4d69-b85c-51ea06c3e964/thumbnail/1200x675/bf5e90ae96c5a9a894f65b8eae4a603d/patriots-sb-uniform.png"
      ],
      "datePublished": "2026-01-29T18:46:55.000Z",
      "dateModified": "2026-01-29T18:46:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yankees GM Brian Cashman pushes back against 'running it back' narrative after quiet offseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/yankees-brian-cashman-running-it-back-narrative/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/5f2f9a03-fba4-4ce8-a8c2-6a2f6f75cc0b/thumbnail/1200x675/1237677d6af6ad674ba50aca6922893e/brian-cashman-getty-4.png",
    "tag": "Sports",
    "date": "2026-01-29T18:19:24.000Z",
    "description": "\n        The 2025 Yankees won 94 games in 2025 and advanced to the ALDS, but there they were eliminated by the eventual AL champion Blue Jays. This of",
    "body": "\n        The 2025 Yankees won 94 games in 2025 and advanced to the ALDS, but there they were eliminated by the eventual AL champion Blue Jays. This offseason, the Yankees have mostly tinkered at the margins of the roster while bringing back Trent Grisham (via the qualifying offer) and Cody Bellinger (on a five-year deal) while otherwise making seemingly minor additions like lefty starter Ryan Weathers. Wednesday, Yankees general manager Brian Cashman defended an offseason that many Yankees fans would call lackluster, especially in light of no World Series titles since 2009 while the Blue Jays, Dodgers and Mets, among plenty of others, have been more aggressive in outside-organization additions. \"First, we have really good players, a collection of really talented players. It's not the same roster,\" Cashman said (via the New York Daily News). \"I would differ there. We have some players, at some point, returning from the IL that are important players, Gerrit Cole being one of them. But we had some additions from the second half that got their feet wet with the Yankees, some with failures or success. But they'll now be in a position to join us with their feet on the ground and getting their sea legs under them – with a manager, too, learning how to utilize these guys, where they slot, and everything else.\"\"So I disagree it's the same team running it back,\" Cashman continued. \"It's going to be some differences, and the competition is going to be different, too. In some cases, some teams got better. In other cases, some teams, you could argue, maybe got a little worse. Our division is the best in baseball. But long story short, one [playoff] series, make or break, is not going to define what we think our capabilities are.\"\nIt's certainly possible the Yankees as currently constructed end up a lot better in 2026 than 2025. Cashman mentioned Cole, and his ace is looking to return from Tommy John after missing all of last season. He won't open the season in the rotation, but he could be back before June and it's possible he's back in prime form by the end of the season. There was also the emergence of young starter Cam Schlittler last season and the Yankees traded for third baseman Ryan McMahon in front of the trade deadline. Closer David Bednar was also acquired at the deadline and could well firm up the ninth inning. There's always the hope that Giancarlo Stanton will play a lot more than 77 games, too. Of course, there are some things that will go wrong as well. \nStill, the Yankees look like a playoff team again. The matter for the locals will be how things unfold in October. If the Yankees fail to secure that now-elusive World Series title, perhaps some of these words will end up being used against Cashman in the court of public opinion. Because while he's right that there are reasons to be better, the Yankees are pretty much just \"running it back.\" \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yankees GM Brian Cashman pushes back against 'running it back' narrative after quiet offseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/5f2f9a03-fba4-4ce8-a8c2-6a2f6f75cc0b/thumbnail/1200x675/1237677d6af6ad674ba50aca6922893e/brian-cashman-getty-4.png"
      ],
      "datePublished": "2026-01-29T18:19:24.000Z",
      "dateModified": "2026-01-29T18:19:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics' Jayson Tatum says he doesn't know if he'll come back this season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-jayson-tatum-injury-update-return-timeline/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/aed0531c-255b-4a24-9003-2afdc2b46363/thumbnail/1200x675/fba4ab0679784c8a3607f76bd8971c12/jayson-tatum-getty-11.png",
    "tag": "Sports",
    "date": "2026-01-29T17:51:25.000Z",
    "description": "\n        Jayson Tatum might not come back this season after all. On Wednesday, the Boston Celtics star, who tore his Achilles last May, told ESPN's Ra",
    "body": "\n        Jayson Tatum might not come back this season after all. On Wednesday, the Boston Celtics star, who tore his Achilles last May, told ESPN's Ramona Shelburne that he has not made up his mind about a potential return.Tatum told ESPN that he's making good progress in his rehabilitation, but he \"wants to get it right the first time, so it's just a lot to think about.\"This followed Chris Haynes reporting on NBA TV that Tatum is reevaluating the situation. It also followed Tatum's appearance on The Pivot, published Wednesday, in which he said he was thinking about the logistics of getting back in the mix.\"If or when I do come back this season, they would have played 50-some-odd games without me, right?\" he said on the podcast. \"So they have an identity this year, or things that they've felt has clicked for them. And it's been successful, right? You know, third, second team in the East up to this point. So there is a thought in my head, like: How does that work? Or how does that look? With me integrating myself off of an injury and 50, 60 games into a season, [there] obviously could be some challenges. It is a thought. Like, damn, do I come back? Or should I wait? It's something that I honestly, recently, in the last like two weeks or so, just kind of contemplated every single day.\"\nBoston is 29-18 -- tied with the New York Knicks for the second-best record in the East -- and the team has the third-best net rating in the entire league. The Celtics have never put an official timetable on his return, but, before this, it was widely assumed that he'd be back this season, barring a setback. On Jan. 19, he got some work in at shootaround with media present: \nWill Tatum's uncertainty affect Boston's plans at the trade deadline? It doesn't have to. Last month, team president Brad Stevens said that the Celtics would pursue upgrades, \"but it all has to be within good deals and it all has to be within the ultimate goal, which is the North Star of retooling so we're in a position to compete for what we want to compete for.\" They didn't shed as much salary as they did last summer just so they could do something shortsighted now.This doesn't necessarily make Boston more likely to duck the luxury tax, either. Stevens has maintained since last offseason that the team will not cut into its asset base (i.e. give up a first-round pick) simply to get out of the tax. According to HoopsHype's Michael Scotto, the the Celtics turned down the Chicago Bulls' offer of big man Nikola Vučević for Anfernee Simons and a first-round pick, a deal that would cut their tax bill in half but not get them under the threshold. They could wind up moving Simons, but he's been a valuable source of offense for what has turned out to be an elite team. If they don't like their options on the trade market, they don't have to do anything at all.\nWithout Tatum, Boston has reimagined its offense and been even more efficient than it was last season. If he comes back, he could give the team a boost, but he'll also have to figure out how to fit in. The Celtics have been so good in his absence that his decision shouldn't have any bearing on whether they trade for another big man, whether they duck the tax and whether they keep Simons. With or without him, they have the same short-term strengths and weaknesses. With or without him, they'll be dealing from a position of strength.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics' Jayson Tatum says he doesn't know if he'll come back this season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/aed0531c-255b-4a24-9003-2afdc2b46363/thumbnail/1200x675/fba4ab0679784c8a3607f76bd8971c12/jayson-tatum-getty-11.png"
      ],
      "datePublished": "2026-01-29T17:51:25.000Z",
      "dateModified": "2026-01-29T17:51:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UCL contenders and pretenders: Arsenal favorites; Barca not at Bayern's level - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/champions-league-contenders-pretenders-arsenal-real-madrid-barcelona-bayern-liverpool/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/05537904-7dd0-47d0-b02b-f20205908e8a/thumbnail/1200x675/c4cc72a57d1f9982842676bd098ce052/arsenal-champions-league.jpg",
    "tag": "Sports",
    "date": "2026-01-29T18:58:33.000Z",
    "description": "\n        And then there were 24 teams remaining. A wild finish to the Champions League league phase has set the bracket for the knockouts, and Jose Mo",
    "body": "\n        And then there were 24 teams remaining. A wild finish to the Champions League league phase has set the bracket for the knockouts, and Jose Mourinho's Benfica have snuck in to cause chaos. Arsenal became the first team to finish the league phase a perfect eight for eight, as the Gunners have risen to become the favorites to win the entire tournament. But after Arenal, who has the next best shot at taking home a European crown?That means it's time to take on the unenviable task of combing through a lot of similar teams to build out tiers of contention, so let's get rolling:The one true contenderArsenalAs the first team to finish with a perfect eight wins from eight in the league phase, Arsenal belong in a tier of their own when ranking the contenders for the Champions League crown. While a rotated side did concede two goals to Kairat Almaty on the final day of league phase play, the Gunners still finished with the best defensive record, allowing only four goals in eight games. Arsenal have been able to adapt their style to compete in various match scenarios, which is a credit to both Mikel Arteta's management and the depth of a strong squad.In a tier of their ownBayern MunichWhile Bayern didn't get a chance to face Arsenal in Champions League play, this squad is not to be overlooked. They may have lost their undefeated record in the Bundesliga, but they also got Jamal Musiala back from injury to add to their loaded attack. Harry Kane has been one of the best forwards in the world, but alongside Serge Gnabry and Michael Olise, Vincent Kompany is spoiled for riches in setting up his side. He even has depth in midfield, while the defense has done just enough to keep things ticking over. Bayern are more of a 1A and 1B contender scenario with Arsenal \nWith some help, it could happenLiverpool, Chelsea, Real Madrid, Barcelona, Inter, PSG, Manchester CityNow we get to the groups, and this tier is one where each team has questions to answer if they're to win the Champions League. Liverpool have been excellent in this competition, but it feels like their Premier League woes will start to catch up to them sooner than later. Chelsea have improved under Liam Rosenior, and with a healthy Cole Palmer, no one will want to face the Blues in the knockouts. Barcelona haven't been able to get things going until they fall behind in games. Alvaro Arbeloa's Real Madrid are very much a work in progress. Inter have lost some of their magic. Injuries and playing so much soccer last season seems to be catching up to PSG, and Manchester City's hopes rest in Marc Guehi steadying their defense. Any of these things can be fixed by February, giving these teams a chance at winning it all, but there's a reason why eight teams ended with between 14 - 16 points in the league phase. After the top two, things are very much fluid.Not a top team but on the right trackNewcastle UnitedI didn't know what to make of the Magpies. They had one of the toughest schedules of any team in the league phase and will be tested after losing to Barcelona and drawing PSG, but it also feels like they're missing a top gear. If they didn't drop points to Marseille and Bayer Leverkusen, this is a top-eight team instead of a team taking part in the playoffs. Defensively, they only conceded seven goals, and if a match ends up in a penalty shootout, being able to lean on Nick Pope in net is a massive advantage.Who even are they?TottenhamIf it weren't for Tottenham already being in the round of 16 and having won the Europa League last season, they'd probably be further down these rankings. We don't even know if Thomas Frank will be managing the squad when they take the pitch again in the Champions League due to their Premier League struggles, but they were able to control most of their Champions League fixtures. Tottenham may not have had the most difficult path to get here, but you can only play the teams who are in front of you, and they did just that to rise up the table as the Premier League teams put on quite a showing during the league phase.\nIf they're perfect, sureAtletico Madrid, Sporting CP, Juventus, Atalanta, Borussia DortmundUnlike our first group of flawed sides, this group feels out of their depth in the knockouts. Atletico Madrid have lost their ability to control matches as they lean into being an attacking side. Sporting have a chance, but they can't have Luis Suarez get marked out of a game in their most important fixtures. Juventus and Atalanta can almost be combined here; they have the players to go on a run, but a spot in the last eight feels like their ceiling. And for Dortmund, this squad has fallen quite far since they made the Champions League final in 2024. While they fell to Real Madrid there, this current squad lacks the creativity that they need to really make something happen.Can cause an upset but probably are up against itBodo/Glimt, Benfica Alright, now this is a fun group. Tasked with facing either Real Madrid or Inter in the round of 16, the deck is already stacked against Bodo/Glimt and Benfica, but if you said that either would be in the knockouts a few weeks ago, I wouldn't have believed you. Bodo has gone through Manchester City and Atletico Madrid to get here, while Benfica needed a stoppage-time goal by a goalkeeper. Through Jose Mourinho, all things are possible, especially while he's coaching a true underdog. The knockouts are usually where underdogs go to fall, but in the case of these two sides, they've been counted out during the entire tournament, so not believing that they can net at least another win now could be a fool's errand.Happy to be hereMonaco, Bayer Leverkusen, Galatasaray, Qarabag, Club Brugge, OlympiacosGalatasaray may be the standout team here because any team traveling to Rams Park in Turkiye will be in for a fight, but overall, these are sides that will be happy to have made the knockout stage. Each may win a game, but going further than the round of 16 seems a step too far unless they draw Tottenham there in the case of Brugge or Galatasaray.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UCL contenders and pretenders: Arsenal favorites; Barca not at Bayern's level - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/05537904-7dd0-47d0-b02b-f20205908e8a/thumbnail/1200x675/c4cc72a57d1f9982842676bd098ce052/arsenal-champions-league.jpg"
      ],
      "datePublished": "2026-01-29T18:58:33.000Z",
      "dateModified": "2026-01-29T18:58:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bronny James shares Cleveland memories after Lakers loss to Cavaliers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/bronny-james-cleveland-lakers-lebron/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/9fee446f-a32c-4d71-af27-eeb4c93cd185/thumbnail/1200x675/cc81ad67cc0fb8ba2a91dc276e47fee9/bronny.png",
    "tag": "Sports",
    "date": "2026-01-29T15:57:57.000Z",
    "description": "\n        The Cleveland Cavaliers spoiled the homecoming party  for LeBron James and family, running away from the Los Angeles Lakers, 129-99. James, h",
    "body": "\n        The Cleveland Cavaliers spoiled the homecoming party  for LeBron James and family, running away from the Los Angeles Lakers, 129-99. James, however, got emotional during an in-game video tribute and was especially overcome with thoughts and feelings watching Bronny James play on the same court that he once dominated during the second half.\"We want Bronny\" chants erupted from the Cavaliers' home faithful before he received a loud applause upon entering the game in the third quarter, his first appearance in JJ Redick's lineup since Jan. 18.\"It's literally my entire life,\" Bronny James said of Cleveland, via The Los Angeles Times. \"So just really appreciative of all the people that show some love. I just remember being a kid and being here pretty much every day after school. It's a bunch of nostalgia coming back and being here.\"By the time Bronny James checked into the game, the home crowd got what it wanted after he dunked in transition. It was his first points since Jan. 12 for the Lakers. He finished with eight points in eight minutes, connecting on both of his 3-point attempts.\"I was just excited to go out there and play,\" Bronny James said. \"I'm always ready to go out and play, whether that's when the entire arena is saying 'We want Bronny' or no one is. I was just really, really grateful that they put me in at that time and I was able to go out and get a few buckets.\"\nLeBron James said it was \"surreal\" seeing his son playing in Cleveland and his mother, Gloria, watching them both inside the arena. The 41-year-old Akron, Ohio native began his NBA career with the Cavaliers as the No. 1 overall pick in the 2003 NBA Draft.\"It obviously means a little bit more for me personally, growing up 35 minutes south of here,\" LeBron James said. \"It was pretty cool sitting over there and watching (Bronny) continue to live out his dream. To see him get that fast break dunk, hit a couple shots and get that ovation from the fans. Pretty cool moment for him, for us as a family, for my wife and his siblings.\"Super cool. My mom is here watching her son and her grand son, I don't even know how to wrap that in my brain. So weird, so cool.\"\nThe Lakers selected Bronny James with the No. 55 overall pick in the 2024 draft and the two became the first father-son duo to play in the NBA at the same. In 25 games played as a second-year pro, Bronny James averages 6.9 minutes per game and shooting 37.1% from the floor in limited playing time.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bronny James shares Cleveland memories after Lakers loss to Cavaliers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/9fee446f-a32c-4d71-af27-eeb4c93cd185/thumbnail/1200x675/cc81ad67cc0fb8ba2a91dc276e47fee9/bronny.png"
      ],
      "datePublished": "2026-01-29T15:57:57.000Z",
      "dateModified": "2026-01-29T15:57:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football transfer portal: Auburn's Alex Golesh comments on tampering - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-transfer-portal-auburn-alex-golesh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/63feec8b-739f-416a-a389-5cabd60afcf8/thumbnail/1200x675/5d55f41fac5253f1c99b70d198fc5da4/golsh.png",
    "tag": "Sports",
    "date": "2026-01-29T17:29:43.000Z",
    "description": "\n        New Auburn football coach Alex Golesh said there are no differences in SEC recruiting compared to his previous Group of Five stop, South Flor",
    "body": "\n        New Auburn football coach Alex Golesh said there are no differences in SEC recruiting compared to his previous Group of Five stop, South Florida, when you consider transfer portal tampering shenanigans.\"(Tampering's) been going on for a really long time, this portal era amplified it in every imaginable way,\" Golesh said. \"There eventually needs to be guardrails on this thing. I think we all want to know the rules in which you can operate in ... the truth is, right now, there aren't any, so you operate ethically with what you feel like is right.\"Is it right to call a kid that's on somebody else's roster to go get them? It's not. I think in a lot of way, what goes around comes around. I'm a strong believer in the football gods finding you at some point. Generally, they'll find you at the end of a game or on fourth-and-1. You've got to do things the right way.\"Auburn's transfer class ranks 13th nationally per 247Sports with 39 signees, including 13 of his former players from USF. Quarterback Byrum Brown is the biggest splash, rated as the ninth-best quarterback after throwing for 3,158 yards and 28 touchdowns along with 1,008 yards rushing and 14 scores.\nClemson coach Dabo Swinney recently ripped the Band-Aid off by after exposing conversations Ole Miss and Rebels coach Pete Golding engaged in with LLuke Ferrelli.Duke and former Blue Devils quarterback Darian Mensah reached a settlement in their saga, which included the university trying to block his intention of entering the portal en route to signing with Miami.There was the Demond Williams situation, too, after the Washington quarterback signed with the Huskies for the 2026 season before attempting to get out of that executed agreement and land elsewhere.\nRules enforcement is supposed to be top priority for the NCAA.\"The pressure to win is great and people feel it in different ways,\" Golesh said. \"I'm not here to judge anybody else's decisions on how they operate, but you'd love to have some guardrails within the system. I think maybe as I establish myself within this conference, I'l have more vocal opinions but I'm just the new guy on  the block trying to build a program here at Auburn and do it the right way.\"Auburn lost several of its top players to transfer, including wideouts Eric Singleton Jr. (Florida), Cam Coleman (Texas), Perry Thompson (Minnesota) and three quarterbacks.In October, the NCAA altered its transfer rules after coaching changes within college football. The second alteration centered on transfer exceptions, shortening the decision window to 15 days after a coaching decision and beginning five days after a new coach is hired or announced.\nEx-Auburn coach Hugh Freeze said after his first season on the Plains the prevalence of tampering would be impossible to eliminate unless the NCAA reverted back to old eligibility rules, which made players sit out a year after leaving.There are no rules against family members, NIL representatives or rogue agents reaching out to coaching staffs on their client's behalf, a way to back-channel potential interest prior to transferring.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football transfer portal: Auburn's Alex Golesh comments on tampering - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/63feec8b-739f-416a-a389-5cabd60afcf8/thumbnail/1200x675/5d55f41fac5253f1c99b70d198fc5da4/golsh.png"
      ],
      "datePublished": "2026-01-29T17:29:43.000Z",
      "dateModified": "2026-01-29T17:29:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "USWNT's versatile World Cup winner Crystal Dunn announces retirement - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/uswnt-world-cup-winner-crystal-dunn-veteran-retirement-announcement-12-year-career/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/29/dcac0b5e-b7ef-44a0-8974-d4a2c7659e17/thumbnail/1200x675/18991b8dfb702ac5489d3d3297492f87/crystal-dunn.jpg",
    "tag": "Sports",
    "date": "2026-01-29T17:31:14.000Z",
    "description": "\n        Crystal Dunn, a member of the U.S. women's national team's 2019 Women's World Cup-winning squad, announced her retirement on Thursday, bringi",
    "body": "\n        Crystal Dunn, a member of the U.S. women's national team's 2019 Women's World Cup-winning squad, announced her retirement on Thursday, bringing an end to her decorated 12-year professional career.Dunn was a fixture on the national team from 2016 through 2024, taking part in two World Cups and three Olympic Games. She played six matches en route to the World Cup-winning run in France in 2019 and was also a regular starter during the team's gold medal-winning run at the Olympics in Paris in 2024. The 33-year-old was also an accomplished player in the NWSL and was a three-time champion in the league, notching two titles with the North Carolina Courage and a third with the Portland Thorns.She also played for Gotham FC and Chelsea, where she won a WSL title in 2017 under current USWNT head coach Emma Hayes. She was last under contract with Paris Saint-Germain.\"This decision has not come easily, but I am at peace and deeply fulfilled with all that I have accomplished. I've achieved nearly everything I dreamed of in this sport and gave all I had to give,\" Dunn wrote in part in a post on Instagram. \" I'm ready to embrace the life that awaits me on the other side. I look forward to spending more time with my family and being a more present mom. This was not a decision made lightly, but was one made with immense gratitude for everything I've experienced as a professional soccer player. \"A native of New York state, Dunn was a talented youth player, winning an NCAA title with the University of North Carolina in 2012 and the U-20 Women's World Cup the same year, a member of the last U.S. team to win that title. She made her senior team debut the following year, and in 2014, she was drafted by the Washington Spirit.\nShe truly burst onto the scene as an attack-minded phenom in her second season with the Spirit, scoring 15 goals in 20 games and winning the league's golden boot award and MVP honors. Her uptick in form, though, came after she was left off of Jill Ellis' roster for the 2015 Women's World Cup, thrusting her back into the national team conversation following the snub. The USWNT's historic depth in attack, though, meant she was converted to left back and spent much of her national team career there.Dunn matched her accomplishments with an unmatched ability as a versatile player who was amongst the elites, regardless of what position she played. She brought her attacking attributes to her play as a left back and had a brief comeback as a forward with the USWNT in between the 2023 Women's World Cup and 2024 Olympics, but also deputized as a No. 10 at times during her three years with the Thorns.In the late stages of her career, Dunn was one of a handful of USWNT players who balanced motherhood with life as a professional athlete after welcoming her son in 2022. She was one of the beneficiaries of the USWNT's 2022 equal pay settlement with U.S. Soccer which, among other things, guaranteed child care for all national team players regardless of gender, and was previously one of the many players who were plaintiffs in a lawsuit against the federation.\nDunn made the last of her 160 appearances for the USWNT in May of last year, playing 90 minutes in a 3-0 win against China. She played her final game in September, playing a half for PSG in a 3-0 win at Lens in the Premiere Ligue.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "USWNT's versatile World Cup winner Crystal Dunn announces retirement - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/29/dcac0b5e-b7ef-44a0-8974-d4a2c7659e17/thumbnail/1200x675/18991b8dfb702ac5489d3d3297492f87/crystal-dunn.jpg"
      ],
      "datePublished": "2026-01-29T17:31:14.000Z",
      "dateModified": "2026-01-29T17:31:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]