[
  {
    "title": "California vs. Hawaii prediction, odds, spread, time: 2025 Hawaii Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/hawaii-vs-california-prediction-odds-start-time-2025-hawaii-bowl-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/1e7da307-dee5-49f0-8b7f-862eaac04ddb/thumbnail/1200x675/135d2e4dd0faf42d11ed55d57d170306/jaron-keawe-sagapolutele-california-golden-bears.jpg",
    "tag": "Sports",
    "date": "2025-12-24T15:29:42.000Z",
    "description": "\n        The 2025-26 college football bowl schedule features just one game on Christmas Eve, and it takes place in the Aloha State. The Sheraton Hawai",
    "body": "\n        The 2025-26 college football bowl schedule features just one game on Christmas Eve, and it takes place in the Aloha State. The Sheraton Hawaii Bowl 2025 will see the California Golden Bears facing the Hawaii Rainbow Warriors. Cal (7-5) is coming off a 38-35 win over SMU but has lost three straight bowl games. Hawaii (8-4) enters in off a 27-7 victory over Wyoming and is 5-4 all-time in its namesake bowl. The Golden Bears enter the 2025 Hawaii Bowl leading the all-time series between the programs, 2-1. Star Hawaii receiver Jackson Harris, who had nearly 1,000 yards receiving this year, is in the transfer portal. Nick Rolovich, who was Hawaii's head coach from 2016-19, will serve as the interim head coach for Cal in this one.Kickoff is at 8 p.m. ET from the Clarence T. C. Ching Athletics Complex in Honolulu. The Rainbow Warriors are 1.5-point favorites in the latest Cal vs. Hawaii odds from DraftKings Sportsbook. The over/under for total points is 50.5. Before making any Hawaii vs. Cal picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, the model has set its sights on Cal vs. Hawaii. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Hawaii vs. Cal:Cal vs. Hawaii spreadHawaii -1.5 at DraftKings SportsbookCal vs. Hawaii over/under50.5 pointsCal vs. Hawaii money line Hawaii -113, Cal -105Cal vs. Hawaii picksSee picks at SportsLineCal vs. Hawaii streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Hawaii vs. Cal   picksAfter simulating California vs. Hawaii 10,000 times, SportsLine's model is going Over on the total (50.5 points).Something about the Rainbow Warriors appearing in this bowl game seems to light up the scoreboard for both teams. Of Hawaii's nine prior appearances in the Hawaii Bowl, eight of them have seen at least 60 total points, with five of those seeing at least 70 combined points. As for Cal, its games have eclipsed the total in two of the last three, and the Golden Bears' starting QB, Jaron-Keawe Sagapolutele, is a native Hawaiian and will want to put on a show in his return.Coming off a 330-yard, 4-TD performance, Sagapolutele is forecasted to top 300 yards again with multiple total touchdowns. His counterpart, Micah Alejado, leads the Mountain West in passing yards per game and has 3 passing scores in five of his last seven games. With the explosiveness of both passing games, the model is projecting 53 combined points as the Over hits more than 50% of the time.The model also says one side of the spread hits over 60% of the time. You can see the model's pick at SportsLine.  So who wins Hawaii vs. California, and which side of the spread hits over 60% of the time? Visit SportsLine now to see which side of the Cal vs. Hawaii spread to jump on, all from the advanced model that's up on its top-ranked money-line picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "California vs. Hawaii prediction, odds, spread, time: 2025 Hawaii Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/1e7da307-dee5-49f0-8b7f-862eaac04ddb/thumbnail/1200x675/135d2e4dd0faf42d11ed55d57d170306/jaron-keawe-sagapolutele-california-golden-bears.jpg"
      ],
      "datePublished": "2025-12-24T15:29:42.000Z",
      "dateModified": "2025-12-24T15:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cavaliers vs. Knicks prediction, odds, time: 2025 NBA Christmas Day picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-cavaliers-odds-prediction-line-time-2025-nba-christmas-day-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/bb6f7da3-9bb2-42f6-8c9c-cbd55e2d8e37/thumbnail/1200x675/1e95442d8e2734919dc3be002ea27def/jalen-brunson-new-york-knicks-imagn-images-3.jpg",
    "tag": "Sports",
    "date": "2025-12-24T15:18:33.000Z",
    "description": "\n        The New York Knicks look to continue their home supremacy when they battle the Cleveland Cavaliers in an Eastern Conference matchup on the 20",
    "body": "\n        The New York Knicks look to continue their home supremacy when they battle the Cleveland Cavaliers in an Eastern Conference matchup on the 2025 NBA Christmas Day schedule. Cleveland is coming off a 141-118 win over New Orleans on Tuesday, while New  York dropped a 115-104 decision at Minnesota that same night. The Cavaliers (17-14), who are second in the Central Division, are 6-6 on the road this season. The Knicks (20-9), who are first in the Atlantic Division, are 14-2 on their home court. Evan Mobley (calf) is not expected to play for Cleveland.Tipoff from Madison Square Garden in New York is set for noon ET. The Knicks lead the all-time series 122-109, but the Cavaliers have won four of the past five meetings. New   York is a 6.5-point favorite in the latest Cavaliers vs. Knicks odds from SportsLine consensus, while the over/under for total points scored is 239.5. Before making any Knicks vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 10 of the 2025-26 NBA season on a sizzling 30-14 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Cavaliers vs. Knicks 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Knicks vs. Cavs:Cavaliers vs. Knicks                         spread:    New York -6.5 at DraftKings    Cavaliers vs. Knicks                                       over/under:    239.5 pointsCavaliers vs. Knicks                                       money line:    New   York -243, Cleveland +199Cavaliers vs. Knicks                                       picks:    See picks at SportsLineCavaliers vs. Knicks                                       streaming:Fubo (Try for free) New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Cavaliers vs. Knicks picksSportsLine's model is going Over on the total (239.5 points). The total has gone over in each of the past three Cleveland games, and in four of the past six New   York games. The SportsLine model is projecting Cleveland's Donovan Mitchell to score 26.4 points on average and be one of five Cavaliers players to score 12.4 or more points. New   York's Jalen Brunson, meanwhile, is projected to have 28.3 points as six Knicks players score 10.5 points or more.It has also generated an against-the-spread pick that hits in over 60% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Cavaliers, and which side of the spread hits over 60% of the time? Visit SportsLine now to see which side of the Cavaliers vs. Knicks spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. Knicks prediction, odds, time: 2025 NBA Christmas Day picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/bb6f7da3-9bb2-42f6-8c9c-cbd55e2d8e37/thumbnail/1200x675/1e95442d8e2734919dc3be002ea27def/jalen-brunson-new-york-knicks-imagn-images-3.jpg"
      ],
      "datePublished": "2025-12-24T15:18:33.000Z",
      "dateModified": "2025-12-24T15:18:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, best bets, player props: This Christmas Day parlay returns 9-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-picks-player-props-bets-christmas-day-football-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/18/c50cc3aa-5262-4d20-bce1-86558ed38326/thumbnail/1200x675/d6e3e1a0cf06ba4f26f483beb93fcb24/dak-imagn.jpg",
    "tag": "Sports",
    "date": "2025-12-24T14:31:41.000Z",
    "description": "\nThe NFL Christmas Day tradition is a relatively new one, but most fans won't complain about spending another holiday watching football. One could mak",
    "body": "\nThe NFL Christmas Day tradition is a relatively new one, but most fans won't complain about spending another holiday watching football. One could make a Christmas NFL parlay from the three games on this year's slate, featuring Cowboys vs. Commanders (+7 at DraftKings) at 1 p.m. ET, Lions vs. Vikings (+7.5) at 4:30 p.m. ET and Chiefs vs. Broncos (-13.5) at 8:15 p.m. ET. A football parlay could consist of NFL player props, spread picks, over/under bets, money line predictions, or some combination of those. Players one could target with anytime touchdown NFL props include CeeDee Lamb (+115), Jahmyr Gibbs (-195), Justin Jefferson (+140) and RJ Harvey (-120).The Chiefs are used to being favored by double-digits rather than underdogs, but that's their reality with backup quarterback, Gardner Minshew, now out after injuring his knee a week after Patrick Mahomes did the same. Underdogs of 13-plus points are 1-10 straight up this season but are 7-4 against the spread. Thus, making NFL bets that back the Broncos to win but the Chiefs to cover could be two legs of your NFL Christmas Day parlay. Before locking in any Christmas NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins, on picks like Lamb as an anytime touchdown scorer. Bet it at DraftKings right here:\nThe model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 17 NFL odds and locked in four confident NFL best bets for Christmas Day. If you successfully parlay its picks, you'd be looking at a massive payout of well over 9-1. You can only see the model's Christmas NFL parlay picks at SportsLine.Top Christmas NFL parlay picksAfter simulating every game 10,000 times, the model is backing the Over (50.5) to hit in Cowboys vs. Commanders at 1 p.m. ET. No team has eclipsed the total quite like Dallas this season as the Over is 11-4 for the team, the best Over percentage in the league. The Cowboys have gone over in each of their last four games, while four of their last five matchups with Washington have also gone over. That includes their Week 7 contest, which was one of the highest-scoring games of the season with 66 total points.The Commanders have also leaned over this year, as it's gone 5-2 over their last seven games. The Over is also 4-0 when the Commanders are home underdogs in 2025. The simulations forecast the teams combining for nearly 60 points. Thus, the Over hits well over 60% of the time. See which other NFL parlay picks to make here, and bet the Over at to hit at DraftKings:How to make Christmas NFL parlaysThe model also jumped on three other NFL picks, including a player prop that returns plus money. You can only see the model's Christmas NFL best bets and NFL parlay at SportsLine.What are the model's top NFL picks, and which Christmas Day NFL bets should you target for an epic 9-1 payout? Visit SportsLine now to see the Christmas NFL best bets from a model on a 53-37 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, best bets, player props: This Christmas Day parlay returns 9-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/18/c50cc3aa-5262-4d20-bce1-86558ed38326/thumbnail/1200x675/d6e3e1a0cf06ba4f26f483beb93fcb24/dak-imagn.jpg"
      ],
      "datePublished": "2025-12-24T14:31:41.000Z",
      "dateModified": "2025-12-24T14:31:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 17 odds, betting lines, spreads: Picks, predictions, best bets today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-17-nfl-odds-lines-spreads-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/15/4d620c2e-f9a9-4fb1-9f7f-fca6b7657e06/thumbnail/1200x675/43540fcda746542b59f7711956d018e4/aaron-rodgers-pittsburgh-steelers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2025-12-24T14:16:53.000Z",
    "description": "\nMaking NFL picks always carries a bit more excitement when there's something on the line, and that's the case with the Week 17 NFL schedule. No less ",
    "body": "\nMaking NFL picks always carries a bit more excitement when there's something on the line, and that's the case with the Week 17 NFL schedule. No less than half a dozen matchups carry postseason implications for both teams, making them ideal ones to target with Week 17 NFL bets. Among those are Texans vs. Chargers (-2.5 at DraftKings Sportsbook) and Ravens vs. Packers (-3) on Saturday, then Jaguars vs. Colts (+6.5), Seahawks vs. Panthers (+7) and Eagles vs. Bills (-1.5) on Sunday afternoon.Then on Sunday night, the 49ers are 3-point home favorites over the Bears, per the Week 17 NFL odds. If a rest edge matters to you, then you may want to back the Bears with Week 17 NFL predictions as Chicago's coming off a Saturday game, while San Fran is coming off a Monday game. All of the updated Week 17 NFL lines are listed below, and SportsLine's advanced computer model has all the NFL betting advice and NFL predictions you need to make the best Week 17 NFL picks now.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, it has turned its attention to the latest Week 17 NFL odds and NFL betting lines and locked in betting picks for every NFL matchup. Head here to see every pick. Top Week 17 NFL predictionsWe can tell you one of the model's strongest Week 17 NFL picks is that the Steelers (-3, 33.5) cover versus Cleveland on Sunday at 1 p.m. ET. Pittsburgh has rolled off three straight wins -- and three straight covers -- to control its own destiny to claim the AFC North. Meanwhile, Cleveland fought valiantly in its loss to the Bills on Sunday, but the Browns are now 0-4 straight-up and 1-3 ATS over the last month. Shedeur Sanders has brought excitement to the Browns but not necessarily many winning plays as no player has more turnovers (seven) than Sanders since he became starter in Week 12. Pittsburgh capitalizes off taking the ball away as the Steelers have covered in six straight games this season when winning the turnover battle. The model has Pittsburgh prevailing versus the spread nearly 60% of the time. See which other teams to pick here, and bet the Steelers using the DraftKings promo code, which offers $200 in bonus bets if your bet wins right here:\nAnother one of its Week 17 NFL predictions: the Bengals (-7, 53.5) cover against the Cardinals in a 1 p.m. ET kick on Sunday. Both teams are out of the playoff picture, but Cincinnati is in much better form overall. The Bengals have won two of their past four and have covered in four of their past five. The Cardinals, meanwhile, have dropped seven straight and are just 1-6 against the spread during that span. In addition to backing the Broncos, the model also says the Over hits nearly 60% of the time. See which other teams to pick here, and bet the Bengals to cover at DraftKings:\nHow to make Week 17 NFL picksThe model has also made the call on who wins and covers in every other game on the Week 17 NFL schedule and just revealed seven teams that outright win nearly 70% of the time, or more, potentially giving you a huge payday. You can only get every pick for every game at SportsLine.So what Week 17 NFL picks can you make with confidence, and which seven picks should you lock in now? Check out the latest NFL odds below, then visit SportsLine to see which teams win and cover the spread, all from a proven computer model that has returned well over $7,000, and find out.Week 17 NFL betting odds, lines, live spreads, scoresGet Week 17 NFL picks at SportsLineGameSpreadTotalPicksCowboys at Commanders (Thursday)DAL -750.5SEE  PICKS HERELions at Vikings (Thursday)DET -7.543.5SEE  PICKS HEREBroncos at Chiefs (Thursday)DEN -13.536.5SEE  PICKS HERETexans at Chargers (Saturday)LAC -2.539.5SEE  PICKS HERERavens at Packers (Saturday)GB -340.5SEE  PICKS HERESeahawks at PanthersSEA -742.5SEE  PICKS HERECardinals at BengalsCIN -753.5SEE  PICKS HERESteelers at BrownsPIT -333.5SEE  PICKS HEREJaguars at ColtsJAX -6.548.5SEE  PICKS HEREBuccaneers at DolphinsTB -5.545.5SEE  PICKS HEREPatriots at JetsNE -13.542.5SEE  PICKS HERESaints at TitansNO -2.539.5SEE  PICKS HEREGiants at RaidersLV -1.541.5SEE  PICKS HEREEagles at BillsBUF -1.543.5SEE  PICKS HEREBears at 49ersSF -352.5SEE  PICKS HERERams at Falcons (Monday)LAR -849.5SEE  PICKS HERE\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 17 odds, betting lines, spreads: Picks, predictions, best bets today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/15/4d620c2e-f9a9-4fb1-9f7f-fca6b7657e06/thumbnail/1200x675/43540fcda746542b59f7711956d018e4/aaron-rodgers-pittsburgh-steelers-imagn-images-1.jpg"
      ],
      "datePublished": "2025-12-24T14:16:53.000Z",
      "dateModified": "2025-12-24T14:16:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Christmas Day: Top daily Fantasy lineups for FanDuel, DraftKings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-picks-fanduel-draftkings-lineup-advice-projections-values-christmas-day-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/ac308d58-b06c-4f77-aaa9-41c2dbe42b3c/thumbnail/1200x675/ac606af060f189d0cd86b1b55d208eab/georgie-pickens-dallas-cowboys-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-24T14:24:29.000Z",
    "description": "\nThe 2025 NFL Christmas Day tripleheader kicks off with Cowboys vs. Commanders at 1 p.m. ET, followed by Lions vs. Vikings at 4:30 p.m. ET, with Chief",
    "body": "\nThe 2025 NFL Christmas Day tripleheader kicks off with Cowboys vs. Commanders at 1 p.m. ET, followed by Lions vs. Vikings at 4:30 p.m. ET, with Chiefs vs. Broncos wrapping things up at 8:15 p.m. ET. Even with some notable quarterback injuries removing notable names like Patrick Mahomes and J.J. McCarthy from the NFL DFS player pool, the slate is still loaded with high-quality options to target for NFL DFS lineups. Dak Prescott, CeeDee Lamb, Jahmyr Gibbs, Justin Jefferson and Travis Kelce are just some of the stars you could consider for your daily Fantasy football lineups.Big names, however, come equipped with big price tags, so you'll have to find balance with more affordable players as well. Those aforementioned QB injuries could make the likes of Chris Oladokun or Max Brosmer value-based Christmas NFL DFS picks. Before making any NFL DFS picks for Christmas, be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure.You can also bet props like Prescott going over 1.5 passing touchdowns using the latest DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the Christmas NFL DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Christmas DayPart of McClure's NFL DFS strategy for Christmas is rostering Lions running back Jahmyr Gibbs at $8,300 on DraftKings and $9,400 on FanDuel. Gibbs ranks third amongst all running backs in Fantasy points for the second straight season. He ranks eighth in scrimmage yards (1,662) and second in total touchdowns (17) ahead of a matchup with a team he has historically dominated. Gibbs has nine touchdowns in five career games versus Minnesota while averaging 97.6 scrimmage yards. The Vikings have also been unable to stop any RBs from hitting paydirt recently as each of the last six offensive TDs that Minnesota has allowed have been to running backs. See who else to roster at SportsLine.You can also bet on Gibbs to go Over 113.5 rushing + receiving yards at DraftKings:\nAnother one of McClure's NFL DFS picks is Cowboys wideout George Pickens ($8,800 on FanDuel, $7,300 on DraftKings), who is coming off a 7-130-1 stat line and ranks third in the NFL with 1,342 receiving yards on the season. He's been as consistent as any receiver and has at least 78 yards or a touchdown in 12 of 15 games. He also has a salivating matchup against Washington, which has the No. 26 passing defense, and just two teams have allowed more passing touchdowns. Pickens had 82 yards against the Commanders earlier this year after having 91 yards and a score versus them last season. See more NFL DFS picks at SportsLine.Bet Pickens to go Over 79.5 receiving yards at DraftKings:\nHow to set Christmas Day NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on Christmas. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for Christmas Day, and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Christmas Day: Top daily Fantasy lineups for FanDuel, DraftKings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/ac308d58-b06c-4f77-aaa9-41c2dbe42b3c/thumbnail/1200x675/ac606af060f189d0cd86b1b55d208eab/georgie-pickens-dallas-cowboys-imagn-images.jpg"
      ],
      "datePublished": "2025-12-24T14:24:29.000Z",
      "dateModified": "2025-12-24T14:24:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks for Week 17, score predictions, best bets today from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-17-picks-ai-score-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/199b5e13-22b1-4334-9332-9ffd17debbff/thumbnail/1200x675/6569b964d098c992fcbe970b425ed4e9/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-24T13:57:39.000Z",
    "description": "\nThe NFL Week 17 schedule features a full slate of games, including 10 on Sunday, several of which have a direct bearing on the NFL playoffs and seedi",
    "body": "\nThe NFL Week 17 schedule features a full slate of games, including 10 on Sunday, several of which have a direct bearing on the NFL playoffs and seeding. In the NFC, the NFC West-leading Seattle Seahawks take on the NFC South-leading Carolina Panthers. Seattle enters as a 7-point favorite at DraftKings Sportsbook. In the AFC South, the division-leading Jacksonville Jaguars take on the Indianapolis Colts. The Jaguars are favored by 6.5 points. Sunday's largest spread is Patriots (-13.5) vs. Jets, while another larger spread is on 'Monday Night Football,' with the Rams (-8) vs. Falcons. The smallest spreads Sunday include Giants vs. Raiders (-1.5), Saints (-2.5) vs. Titans, Eagles vs. Bills (-1.5) and Bears vs. 49ers (-3) on 'Sunday Night Football.' Seattle entered the weekend as the NFC's top seed, while Denver was first in the AFC. Before making any Week 17 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 17 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 16 games. You can only see the AI predictions for the Week 17 NFL schedule here.Top Week 17 NFL AI picksAfter analyzing every game in Week 17, the AI says the Steelers (-3, 33.5), who have won three in a row, cover comfortably against the Browns. \nThe Steelers have gone over in two of their last three games, while the over has hit in six of the past 10 Browns games. Bet the Over 34.5 in the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nPittsburgh is looking to win its first AFC North title since 2020 and is expected to win comfortably over the division-rival Browns. A win would be their third in a row over Cleveland. SportsLine AI rates the Steelers as an A+ spread pick and also predicts a 24-15 win on average. See its other Week 17 football predictions and football picks at SportsLine, and bet the Steelers at DraftKings here:\nHow to make Week 17 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 17. You need to see the AI's NFL picks before making any Week 17 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 17 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 17, score predictions, best bets today from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/199b5e13-22b1-4334-9332-9ffd17debbff/thumbnail/1200x675/6569b964d098c992fcbe970b425ed4e9/aaron-rodgers-pittsburgh-steelers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-24T13:57:39.000Z",
      "dateModified": "2025-12-24T13:57:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions vs. Vikings prediction, odds, spread: 2025 Christmas Day NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-vikings-prediction-odds-time-2025-christmas-day-nfl-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/20/6179140d-7359-4a20-ae75-c9db612f26b4/thumbnail/1200x675/761ca209f776f29a85a3bdc83b4b39ad/jahmyr-gibbs-detroit-lions-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-24T13:26:33.000Z",
    "description": "\nThe NFL Week 17 schedule begins with a Christmas Day tripleheader, with the middle matchup seeing the Detroit Lions visiting the Minnesota Vikings. D",
    "body": "\nThe NFL Week 17 schedule begins with a Christmas Day tripleheader, with the middle matchup seeing the Detroit Lions visiting the Minnesota Vikings. Detroit (8-7) has dropped two in a row and must now win out, plus get some help, in order to make the postseason. Minnesota (7-8) has won three in a row and is coming off a 16-13 victory over the New York Giants. The Vikings have been eliminated from postseason contention. J.J. McCarthy (hand) will not play, per coach Kevin O'Connell. Max Brosmer will make his second career start. Kickoff from U.S. Bank Stadium in Minneapolis is set for 4:30 p.m. ET. The latest Vikings vs. Lions odds have Detroit favored by 7.5 points, while the over/under for total points scored is 43.5 via DraftKings Sportsbook. Before making any Lions vs. Vikings picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 17 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Vikings vs. Lions. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Lions vs. Vikings:Vikings vs. Lions                                                                       spreadDetroit -6 at DraftKings SportsbookVikings vs. Lions                   over/under43.5 pointsVikings vs. Lions                                                                                                                                                                                   money line Detroit -362, Minnesota +288Vikings vs. Lions                                                                                                                                                                           picksSee picks at SportsLineVikings vs. Lions                                                                                                                                                                            streaming Netflix\nWhy the Lions can coverDetroit is facing a must-win scenario to have any chance at the postseason, so it has the clear motivational edge over Minnesota, which has already been knocked out of playoff contention. The Lions have won five of the last six matchups, but their spread success goes back beyond that. Detroit sports a 9-1 ATS record versus Minnesota over their last 10 meetings. Additionally, there's no greater discrepancy between these teams than what's arguably the most important statistic in football, and that's turnovers. The Lions have the fewest giveaways (eight) in the NFL, while the Vikings have the most (29). See which team to back at SportsLine. Why the Vikings can coverMinnesota has found its groove as it has both outright won and covered in three straight games. The defense has been the catalyst as it had a season-high-tying of five sacks in Sunday's win over New York. Minnesota's defense also didn't allow a touchdown in that game, which came two weeks after pitching a shutout of Atlanta. The Vikings are on an amazing run of six straight games without giving up a passing score, and Justin Jefferson finally got going to help out the offense. He's coming off an 85-yard game, which is as many yards that he had over his previous four games combined and is his most yards since Week 5. His success could continue versus Detroit's No. 25 pass defense that has given up the fourth-most passing TDs. See which team to back at SportsLine.How to make Lions vs. Vikings picksSportsLine's model has simulated Vikings vs. Lions 10,000 times and is going Over on the total, projecting 46 combined points. It also says one side of the spread is the better value.         You can only get the pick at SportsLine. So who wins Lions vs. Vikings, and which side of the spread is the better value? Visit SportsLine now to see which side of the Vikings vs. Lions spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions vs. Vikings prediction, odds, spread: 2025 Christmas Day NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/20/6179140d-7359-4a20-ae75-c9db612f26b4/thumbnail/1200x675/761ca209f776f29a85a3bdc83b4b39ad/jahmyr-gibbs-detroit-lions-imagn-images.jpg"
      ],
      "datePublished": "2025-12-24T13:26:33.000Z",
      "dateModified": "2025-12-24T13:26:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball's depth at top best in decade-plus; Inside Dybanta's December - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-news-2025-26-season-has-great-teams-aj-dybantsa-making-poty-push/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/27968105-126a-4cbe-bb91-66c0f018152e/thumbnail/1200x675/7158c7a98435371c455340f083875af1/ajdybantsabyu.jpg",
    "tag": "Sports",
    "date": "2025-12-24T15:51:12.000Z",
    "description": "\n        Welcome back to the Court Report, Matt Norlander's in-season college basketball notebook feature that provides insider information and a deep",
    "body": "\n        Welcome back to the Court Report, Matt Norlander's in-season college basketball notebook feature that provides insider information and a deeper look at the trends and things to know around the sport. Consider this edition a bonus present under your proverbial college hoops tree, especially amid a light week for games. Merry Christmas! The further we get into this spectacular season, the more I'm convinced the quality at the top of men's college basketball is deeper and more impressive than any season in the past decade, if not more.It's easy to get that impression when you see Michigan routinely dismantling teams by 30, if not 40 points; or Iowa State handing a robust Purdue team the program's worst home loss ever; or Arizona becoming the only squad in history to win five of its first nine games against ranked competition; or Duke and BYU combining to go 23-2 behind the phenoms who might be the top two picks off the board in the 2026 NBA Draft. I'll keep going.There's Gonzaga's return to supremacy with its 12-1 run out of the gate, a 12-1 introduction matched by UConn's restoration to elite-level play with its own 12-1 start. North Carolina is also 12-1 heading into 2026, putting on its best nonconference showing since the 2008-09 team won the national title -- and doing so with Caleb Wilson, its best freshman since Cole Anthony. \nHouston? Very much good enough to win it all after falling one shot short in April. Speaking of teams making recent Final Fours, Purdue getting back for the second time in three years wouldn't shock anyone who's paying attention. Also in the Big Ten: Michigan State sits at 11-1 and has one of the three best point guards in college basketball, Jeremy Fears. Vanderbilt and Nebraska -- Vanderbilt! And Nebraska! -- are undefeated and look headed toward special campaigns as well.\n        \n            \n                Norlander's Court Report: Fred Hoiberg's Huskers the feel-good story of season; Boozer-Yax NPOY race heats up\n                \n                    Matt Norlander                \n            \n                            \n    \n                \n                    \n    \nThere's been a conspicuous lack of upsets, but the exchange for that is a run on high-end teams that might give us the most competitive season in recent history. As Christmas arrives, there are six undefeated teams and 20 more one-loss teams still on the books. In addition to the attractiveness of so much winning from so many interesting teams over the past seven weeks, there's data to back up the idea that we're in the midst of an unusually strong season at the top of college basketball.  \nAs of Christmas, seven teams boast an adjusted efficiency margin of 30.00 or better at KenPom.com (with two more, Vanderbilt and Illinois, clearing the 29.00 threshold). And while intra-conference play promises to shave off some of the sweetness on some of these teams over the next 10 weeks, there's still a realistic chance that 2025-26 will yield the strongest group of national title contenders since at least 2014-15. That's when Kentucky made it to the Final Four undefeated and the Wisconsin team that upset Kentucky fell to Duke in the NCAA title game. Those three teams in addition to 33-3 Villanova, 34-4 Arizona and 30-4 Virginia all wound up above +30.00 in adjusted efficiency margin. Kentucky's undefeated push into April overshadowed the fact that all six were viable national title contenders.This season looks primed to produce even more. For reference, here's how many teams finished above +30.00 in adjusted efficiency margin at KenPom since '14-15. 2014-15: 62015-16: 12016-17: 12017-18: 12018-19: 52019-20: 12020-21: 22021-22: 12022-23: 02023-24: 32024-25: 62025-26: 7 as of Christmas; TBD by AprilLast season was the mighty SEC's doing as much as anything, and you can make the case that this year is merely competing with what we saw a season ago in terms of might at the top ... until you realize this season is outpacing 2024-25's impressive output. \nOn Christmas Day in 2024, the top 10 teams in the AP poll weren't winning as much or by more on average than this season's cream of the crop. Right now, the collective record for the AP's top 10 teams -- Arizona, Michigan, Iowa State, UConn, Purdue, Duke, Gonzaga, Houston, Michigan State and BYU -- is 113-7. A year ago at this time the AP's top 10 were 105-13, a win percentage difference of .53 points. And a year ago on Christmas there were four teams at +30.00 in efficiency margin, not seven, and only five at +29.00 or better instead of the nine we've got as of today. Going all the way back to the start of this century, here's how the top 10 teams in the AP poll aggregated in wins and losses after seven full weeks/at the start of Week 8 in each of their respective seasons. This year has provided the fourth-most wins to this point in the calendar by the top 10 AP teams since 2000-01.\n                                                                    CBS Sports research\n                                                            Losses are sure to come in steady doses for the top teams, but every indication to this point is that we can and will have more than just two or three \"great\" groups. A common and lazy lament in many recent seasons was to suggest college basketball lacked any great teams; now we've seem to have been gifted a bevy of them.\nI have more good news: Beyond the strength at the top, college basketball also has a chance to have its best offensive season ever. The sport's 365 teams are combining to average 78 points per game, a number that will naturally drop over the next three months. Conference play leads to fewer possessions and tighter whistles, which will bring down scoring. This happen every season. Still, the scoring record is in sight, as is efficiency. Teams are pacing to score more points per possession this season than ever before. It's been a dream start so far. I think — I hope! — the patterns persist in the second half of the season. As we ready for league play, I think the list of schools that can win a national championship — teams truly capable of winning six games in the Big Dance, a massive ask — is validated at 12, an abnormally high number for this time of year. That figure could whittle by four or five come March, and it easily could see three or four candidates not on my list now vault into the discussion before long. But heading into 2026, my dozen-deep ranking of title contenders reads: Michigan, Arizona, Iowa State, UConn, Purdue, Duke, Houston, Gonzaga, Michigan State, Illinois, BYU and North Carolina. \nThose 12 are a combined 132-11. A remarkable group. You'll notice there's not an SEC team in there. At least not yet. I'm just as surprised as you are. So let's talk about that next.  After epic '24-25, the SEC has taken big step backThe SEC falls behind the Big 12, Big Ten and ACC in wins vs. ranked competition this season. \n                                                                    Eakin Howard / Getty Images\n                                                            The SEC's collective 2024-25 season was so impressive, it almost definitely cannot be matched in the decades to come. The league sent 14 of its 16 teams to the NCAA Tournament, in addition to having two No. 1 seeds; it put seven teams in the Sweet 16; saw its two 1-seeds (Auburn, Florida) make the Final Four; and Florida won the national championship. That kind of run is almost impossible to duplicate. And the grandiosity of it all is what's making this season's SEC look so down in comparison.\nMissouri's humiliating no-show loss Monday night to Illinois (91-48, the largest margin in the history of that rivalry) in the annual Braggin' Rights game was the league's 50th nonconference defeat through the first 49 days of the season. Last season, the SEC lost 23 non-con games total -- including all postseason play -- leading to a staggering 185-23 record and an .889 win percentage. We will never see a league-wide success rate like that again. This season, the SEC has a .742 win percentage (144-50 overall) and its impotency against ranked teams and fellow high-major schools is worrying evidence against the league's chances of getting more than eight or nine into the field come March. A year ago, the SEC finished with 73 wins against high-major opponents. This year, the SEC's record vs. the other four Power Five leagues sits at 35-47. When you filter through for games vs. AP Top 25 teams at the times of those games, the SEC is in fifth in win percentage. Here's how the high-majors stack up in ranked-on-ranked outcomes:\nBig 12: 13-13 (.500)ACC: 10-19 (.345)Big Ten: 13-26 (.333)Big East: 5-13 (.278)SEC: 9-26 (.257)In Quad 1 games, the SEC is an ugly 15-36, even falling behind the ACC's 16-31 mark through Christmas week. Undefeated Vanderbilt is the only team above .500 against Q1 competition (3-0). And as for 12-0 Vandy, it has to be rated as the best SEC squad so far. But the Commodores haven't been given top-10 respect yet because they're yet to defeat a top-30 team. At KenPom, their non-con SOS is 86th. Far from awful, but also far from the high end of toughest schedules in the sport. The irony of the SEC clearly going through league-wide regression is KenPom nevertheless still rating the league No. 1. Here's why: Predictive models have preseason biases still having some (but not that much) influence seven weeks into the season. We call those \"priors,\" and in a month, they'll be phased out. When you filter the results purely based on win expectancy at Torvik, the SEC comes in at No. 3, slightly ahead of the ACC, thanks to not having any outright terrible teams.The biggest knock on the league right now is, unlike the other four power conferences, I don't know who is a true national title contender at this stage. A year ago, you could've made a case for five or six. Now ... pick one? Vanderbilt, Florida, Arkansas, Alabama, Kentucky -- would you take any of them right now to win at least four games in the NCAA Tournament, let alone six? I'm fascinated to see how this league plays out over the next nine weeks. \nI do think at least one SEC team emerges as a legitimate national title contender by the end of January. Dybantsa's dynamite December  A week ago, right here at the Court Report, I laid out the compelling case Michigan's Yaxel Lendeborg was building to compete with Duke's Cam Boozer for national player of the year. Well, BYU stud freshman AJ Dybantsa is now also officially in the mix after an outstanding December that ended in exclamation-point fashion Monday night (BYU's next game is Jan. 3 at Kansas State). Dybantsa became the first freshman this century to post a triple double with at least 30 points after he finished with 33 points, 10 rebounds, 10 assists and a pair of steals against lowly Eastern Washington, which 1-11 vs. D-I teams.  Even despite the awful competition, Dybantsa's performance was fitting after he vaulted himself to non-negotiable First Team All-American status over the past six games. BYU general manager Justin Young tweeted Dybantsa's December stats, which are the best of any player in the sport this month. Dybantsa's averages in the past six games: 27.8 points, 8.0 rebounds, 5.7 assists, 2.3 steals, 65.9 FG%, 78.0 FT%, 2.5 turnovers, 29.4 3-pt% and just one foul in 193 minutes (!!) on the floor. \nAccording to Opta Stats, Dybantsa is \"the only Division I or NBA player in the last 30 seasons to have a calendar month\" with a minimum of five games played to average at least 25.0 points, 5.0 rebounds and shooting 65.0% or better from the field, all while not losing a game. Dybantsa is turning into the most dangerous scorer in college basketball. \n                                                                    Chris Gardner / Getty Images\n                                                            His talent and potential were obvious more than two years ago, when he was a rising junior who led the EYBL in scoring. He is delivering -- exceeding, actually -- on the hype. I caught Dybantsa in person earlier this month after BYU set a program record by overcoming a 22-point halftime deficit to beat Clemson at MSG. That was his official coming-out party for college basketball. Now he's positioning himself to jockey with Boozer, Lendeborg and anyone else (Joshua Jefferson, Caleb Wilson, Braden Smith, JT Toppin) that wants to join the party for NPOY. The one stat that's not yet getting enough attention, but will if it remains true by mid-January, is Boozer (23.3 ppg) and Dybantsa (23.1) are now 1-2 in scoring. Yes, nationally. That's a great development for the marketability of college basketball, especially since both players are vying for No. 1 overall pick status on teams capable of winning the national title.  I can't get enough of this season and the megawatt star power it's providing.   Norlander's news + nuggets  • Wrote above on Dybantsa, but another player who had a huge December for a national title contender was Gonzaga's Braden Huff. In five games, including three vs. power-conference teams, he averaged 24.4 points and 5.4 rebounds on absurd shooting splits: 53-of-74 (71.6%). He dropped a career-high 37 against Campbell on Dec. 17. If Huff is going to move into 15-plus points every night no matter what, then he and Graham Ike will be the best big man duo in college hoops.  • Best non-Gonzaga team outside the power-conference structure is Utah State. The Aggies are 10-1 and fall between 18th and 31 in every NCAA teamsheet metric. The 100-58 bludgeoning of a solid Colorado State team was a signal that this group is good enough to push for a legitimate seed (the 4-6 range) in March.   • Another mid-major to watch for that's quietly getting it done is Tulsa. Eric Konkol's group finished non-con at 12-1, its lone loss by one point at Kansas State. This is the best team in the American, and a big year is overdue; Tulsa hasn't won an NCAA Tournament game since 2003.  • Did you know: Not only are Iowa State, Vanderbilt and Nebraska flawless in men's hoops so far, but they're the only three schools with undefeated records in both men's and women's hoops? The four programs are a combined 73-0. I do wonder if this is the first time we've ever had three schools in men's and women's hoops all make it to Christmas without losing a game. • A tragic story over the weekend: Austin Peay canceled its game against UMKC after the team bus driver died during pre-game meal. The Govs will now go 20 days between games against a Division I opponent, the longest gap of the season -- and the longest since the 2020-21 COVID-impacted season. • Bill Self says out loud what most presumed was the case: Darryn Peterson's family is dictating when he'll return again. I know KU fans are growing tired of the waiting game, but my guess is he plays for the Jayhawks in their next game (Jan. 3 Big 12 opener at UCF). • On Monday, the Kansas City Chiefs announced approved plans for their new covered football stadium, with the debut set for 2031. I hate how the NFL is trying to make open-air stadiums outdated concepts. There is a college basketball angle to this, though: I can almost guarantee you that we'll have a Final Four at this stadium no later than 2035. • Speaking of new sports arenas, North Carolina is still not sure where its basketball teams will play in the 2030s and beyond. There is a debate over whether to refurbish the Dean Dome or build a shiny new arena that would be off-campus. More than 100 former players have signed a letter that, among other things, states, \"We further wish to honor Dean Smith's request that our cherished basketball brand and legacy always remain on campus.\" • I grew up reading Andy Katz's work at ESPN.com and I love that he's tapping back into that spirit more and more by writing for Seth Davis' HoopsHQ site. Here's his latest, on Indiana State coach Matthew Graves' return to coaching after having triple bypass heart surgery in October.• I was on hand in Jersey on Saturday to see Houston humble Arkansas, and my biggest regret on this Christmas Eve is not knowing only a few days ago that the commercial below existed. A friend texted me this on Tuesday; I only wish that I could have asked Kelvin Sampson and John Calipari about it. The two have coached close more than 2,200 games, but only twice against each other. Yet, in 1995, they were highlighted in a commercial for Degree deodorant. I need this commercial recreated in 2026 -- with Sampson and Calipari, for sure, but let's also toss in Dan Hurley, Scott Drew and Sean Miller. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball's depth at top best in decade-plus; Inside Dybanta's December - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/27968105-126a-4cbe-bb91-66c0f018152e/thumbnail/1200x675/7158c7a98435371c455340f083875af1/ajdybantsabyu.jpg"
      ],
      "datePublished": "2025-12-24T15:51:12.000Z",
      "dateModified": "2025-12-24T15:51:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL playoff picture 2025: Projected 14-team bracket with two weeks left - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-playoff-picture-2025-projected-14-team-bracket-simulation/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/c4371b7a-4022-4c4c-a942-01eabbbbc5ee/thumbnail/1200x675/c2b6b86e54869940662304b39c3d85ba/sam-darnold.jpg",
    "tag": "Sports",
    "date": "2025-12-24T14:46:31.000Z",
    "description": "\n        It's Christmas week in the NFL, and several teams around the league hope Santa delivers them a playoff berth. Heading into Week 16, only two ",
    "body": "\n        It's Christmas week in the NFL, and several teams around the league hope Santa delivers them a playoff berth. Heading into Week 16, only two playoff spots had been clinched in the NFL, but that number has now shot up to 10, which means there are still four spots up for grabs as the season heads into Week 17. On top of that, there's also a wide-open race to clinch the No. 1 overall seed in both the NFC and AFC. With just two weeks left to play, there are still SIX teams that could earn the top seed in the AFC and four teams that are still mathematically alive to earn the No. 1 seed in the NFC. With just 32 games left on the regular-season schedule, it should be a wild finish, with several teams soon hoping to celebrate a Merry Clinchmas. So what's the playoff field going to look like? Glad you asked. We had Stephen Oh of SportsLine simulate the rest of the season so we could figure out who's going to make the playoffs. Not only did Oh project all 14 teams that will make the playoffs, but he also projected the seed each team will end up getting. \nRemember, this is just a projection. If you want to see the actual playoff picture, we've got that here. If your favorite team has already been eliminated from postseason contention, then you might be more interested in reading a mock draft, and if that's the case, we have one of those for you right here.  Alright, let's get to the projections. z-clinched division titlex-clinched playoff berthAFC playoff projectionProjections via SportsLine\n                            \n    \n                                                \n                    \n    1. x-Denver Broncos (AFC West champion)Remaining schedule: at Chiefs, ChargersThere are SIX teams still alive for the top seed in the AFC, and the computer thinks Denver will eventually clinch it. The Broncos (12-3) have a 47.5% chance of landing the No. 1 overall seed, which puts them well ahead of the Patriots, who are the next best team at 27.2%. One thing working in Denver's favor is that the Broncos will be getting an easier than expected Week 17 game against the Chiefs. With both Patrick Mahomes and Gardner Minshew out, the Chiefs will be down to their third-string QB for their Christmas game against Denver. \n                            \n    \n                                                \n                    \n    2. x-New England Patriots (AFC East champion)Remaining schedule: at Jets, DolphinsThe Patriots (12-3) can clinch the AFC East as early this week with a win over the Jets combined with a Bills loss to Philadelphia. Even if that doesn't happen, the computer is still pretty convinced that New England will end up winning the division. The Patriots have a 71.1% chance of taking home the division title, compared to just 28.9% for Buffalo.  \n\n                            \n    \n                                                \n                    \n    3. x-Jacksonville Jaguars (AFC South champion)Remaining schedule: at Colts, TitansThe Jaguars (11-4) pulled off a huge win over the Broncos in Week 16, and that has opened the door for them to possibly steal the top seed. For that to happen, Jacksonville would have to win out and then the Patriots and Broncos would both have to lose one of their final two games. It's a long shot scenario, which is why the Jags have just a 9.5% chance of getting the top seed. Even if they don't get the No. 1 seed, they can still clinch the AFC South title as soon as this week with a win over the Colts combined with a Houston loss to the Chargers. \n                            \n    \n                                                \n                    \n    4. Pittsburgh Steelers (AFC North champion)Remaining schedule: at Browns, RavensThe Steelers (9-6) are now in the driver's seat to win the AFC North after pulling off an upset over the Lions on Sunday. The Steelers could win the division before they even take the field this week if Baltimore loses to Green Bay on Saturday night. If the Ravens win, then the Steelers can clinch the division by beating the Browns on Sunday. Of course, if the Ravens win and the Steelers lose, that will set up a Week 18 showdown between Baltimore and Pittsburgh for the AFC North title.  \n                            \n    \n                                                \n                    \n    5. x-Buffalo Bills (wild card 1)Remaining schedule: Eagles, JetsThe Bills (11-4) can still win the AFC East title if they win out and the Patriots lose at least one of their final two games. However, the computer doesn't see that happening, which is why the Bills are locked into the first wild card spot. \n\n                            \n    \n                                                \n                    \n    6. x-Los Angeles Chargers (wild card 2)Remaining schedule: Texans, at DenverThe Chargers (11-4) have a very simple path to winning the AFC West: If they win their final two games, they'll take home the division title. Unfortunately for the Chargers, the computer doesn't think they're going to go 2-0. The good news for the Chargers is that they've already clinched a playoff berth, so even if they lose their final two games, they'll still be a part of the postseason. \n                            \n    \n                                                \n                    \n    7. Houston Texans (wild card 3)Remaining schedule: at Chargers, ColtsThe Texans (10-5) can officially clinch a playoff berth on Saturday if they can beat the Chargers. Not only that, but Houston is actually still alive to win the AFC South and clinch the No. 1 overall seed in the AFC. The Texans will take the division title if they win out and the Jaguars lose at least one game. To clinch the top seed, the Texans would need a lot of help, which is why they have just a 0.1% chance of that happening.Other playoff chances: Ravens (6.8%), Colts (1.8%)Teams eliminated: Chiefs, Bengals, Dolphins, Browns, Jets, Raiders, TitansAFC wild card round projection(7) Texans at (2) Patriots (6) Chargers at (3) Jaguars (5) Bills at (4) Steelers Bye: Broncos\nNFC playoff projectionProjections via SportsLine\n                            \n    \n                                                \n                    \n    1. x-Seattle Seahawks (NFC West champion)Remaining schedule: at Panthers, at 49ers The race for the No. 1 seed is going to go down the wire, and right now, the computer views the Seahawks (12-3) as the heavy favorite. Seattle has a 44.7% chance of getting the top seed, which is well ahead of the next closest team (the 49ers are at 25.1%). If the Seahawks win their final two games, they'll take home the top seed and the NFC West crown.\n                            \n    \n                                                \n                    \n    2. x-Chicago Bears (NFC North champion)Remaining schedule: at 49ers, LionsThe surging Bears (11-4) can clinch the NFC North title by winning one of their final two games. They can also get the top seed in the NFC if they go 2-0 down the stretch and Seattle loses at least one of its final two games.  \n                            \n    \n                                                \n                    \n    3. z-Philadelphia Eagles (NFC East champion)Remaining schedule: at Bills, CommandersWith the 49ers' win on Monday night, the Eagles (10-5) were officially eliminated from earning the No. 1 seed. That means Philadelphia is almost certainly going to end up with the second or third seed, and right now, the computer has them heading into the postseason at No. 3 overall. (The Eagles could also get the fourth seed, but that won't be possible after Sunday if they beat the Bills OR if the Panthers lose to the Seahawks.)\n\n                            \n    \n                                                \n                    \n    4. Carolina Panthers (NFC South champion) Remaining schedule: Seahawks, at Buccaneers The computer basically views the NFC South race as a coin toss: The Panthers (8-7) have a 53.5% chance of winning compared to the Buccaneers, who are at 46.5%. The Panthers can clinch the division title this week with a win over Seattle plus a Bucs' loss to the Dolphins. However, if the Panthers lose to the Seahawks, then the division title will be on the line in Week 18 in Tampa Bay. \n                            \n    \n                                                \n                    \n    5. x-Los Angeles Rams (wild card 1)Remaining schedule: at Falcons, Cardinals The Rams (11-4) lost a heartbreaker on Thursday against the Seahawks, which is likely going to cost them a shot at the No. 1 overall seed. The Rams can still get the top seed, but they would have to win out and also have the Bears, 49ers and Seahawks all lose one of their final two games. \n                            \n    \n                                                \n                    \n    6. x-San Francisco 49ers (wild card 2)Remaining schedule: Bears, SeahawksThe 49ers (11-4) will be an interesting team to watch over the next two weeks because they control their own path when it comes to winning the NFC West and clinching the No. 1 overall seed in the NFC. If the 49ers win their final two games, they'll go into the playoffs as the NFC's top seed. Unfortunately for San Francisco, the computer doesn't see that happening. \n\n                            \n    \n                                                \n                    \n    7. Green Bay Packers (wild card 3)Remaining schedule: Ravens, at Vikings The Packers (9-5-1) can officially clinch a playoff berth on Saturday if they beat the Ravens. The Packers also have an outside shot at the division title, but they would need to win their final two games and the Bears would have to lose their final two games. The Packers could actually clinch a playoff spot before they even take the field on Saturday if the Lions lose to the Vikings on Christmas. Other playoff chances: Buccaneers (46.5%), Lions (5.1%)Teams eliminated: Cowboys, Falcons, Vikings, Commanders, Cardinals, Saints, GiantsNFC wild card round projection(7) Packers at (2) Bears (6) 49ers at (3) Eagles (5) Rams at (4) Panthers Bye: Seahawks\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL playoff picture 2025: Projected 14-team bracket with two weeks left - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/c4371b7a-4022-4c4c-a942-01eabbbbc5ee/thumbnail/1200x675/c2b6b86e54869940662304b39c3d85ba/sam-darnold.jpg"
      ],
      "datePublished": "2025-12-24T14:46:31.000Z",
      "dateModified": "2025-12-24T14:46:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff odds, picks, predictions for remaining bowl games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-odds-picks-predictions-miami-ohio-state-oregon-texas-tech-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/495b8294-b5c2-4164-9aec-8e8ba8d8a8d9/thumbnail/1200x675/6c16d95ad615edfea1d5718a7c6df99d/buckeyes.png",
    "tag": "Sports",
    "date": "2025-12-24T14:44:40.000Z",
    "description": "\n        We're down to eight teams remaining in the 2025 College Football Playoff, with the top four seeds set to take the field for the first time si",
    "body": "\n        We're down to eight teams remaining in the 2025 College Football Playoff, with the top four seeds set to take the field for the first time since conference championship weekend. 'Tis the season for a robust slate of bowl games as well, so there's no shortage of picks and predictions to get to while you wrap up your final online shopping decisions.Does anyone else hold a perfect playoff bracket through the first round? I won't pat myself on the back for too long with several seismic quarterfinal matchups looming -- including a couple that would send a national tremor if underdogs prevail. One of the most intriguing tilts remaining features Indiana's Curt Cignetti, who plans to lean on lessons learned from Nick Saban as he tries to thwart Alabama.In addition to the CFP's Cotton, Orange, Sugar and Rose bowls next weekend, there are 24 additional bowl games scheduled through Jan. 2. The Holiday Bowl between Arizona and SMU is the final postseason game before the playoff semifinals at the Fiesta and Peach bowls on Jan. 8-9, with the winners advancing to the national championship game on Jan. 19 in Miami.College Football Playoff quarterfinalsCotton Bowl: Miami vs. Ohio State -9.5 (Dec. 31)\nHummer (Miami +9.5): I'm not going to pick Miami to upset my national title pick. But that's a very appealing line for a Miami cover. Ohio State can usually suffocate opponents with its line play and speed on the outside. That's not going to happen with Miami, a team with one of the best o-lines and pass rush groups in the FBS. I certainly trust Ohio State's offense a bit more in this matchup, but even that unit has a question mark associated with it after the way it struggled against Indiana. This will be a rock fight for most of the day, but the Buckeyes pull away in the second half. … Ohio State 27, Miami 20.\nCrawford (Miami +9.5): Should I stay with the Hurricanes after taking Miami on the moneyline at Texas A&M? I'm not ready to pick against my national championship selection just yet, but Mario Cristobal's defense could present a number of problems for Julian Sayin and the Buckeyes' passing game. Miami stymied the Aggies with a variety of looks and consistently frustrated Marcel Reed — film that Ryan Day and his staff will study closely ahead of this matchup. Outside of a potential rematch with Indiana in the national championship game, this may be the toughest test Ohio State faces in the bracket. This one could look a lot like the Big Ten Championship Game, a 12-round slugfest dictated by defense and timely stops. ... Ohio State 20, Miami 14.Orange Bowl: Oregon -1.5 vs. Texas Tech (Jan. 1)Hummer (Texas Tech +1.5): The most interesting matchup of the semifinals, at least to me. This game pits Texas Tech's elite front seven against Oregon's blazing speed. It'll also be interesting to see how Texas Tech adjusts to a different quality of opponent than they've seen week to week in the Big 12. On paper, these teams are evenly matched. They're one-two nationally in explosive plays of 20-plus yards. They're also tied for fourth nationally in defending them. There are four future draft picks on Texas Tech's d-line. There are multiple future draft picks on Oregon's o-line. Expect Oregon to get the ball out of Dante Moore's hands quickly to try to take advantage of playmakers in space. Expect Texas Tech to do the same. This game is going to be close. But I'm going with the Red Raiders. I think they're slightly better in the trenches and make enough big plays to pull it out. … Texas Tech 21, Oregon 20.Crawford (Texas Tech +1.5): After going 4-0 in the opening round, my only bracket change from my pre-playoff fill-out comes in this quarterfinal between Oregon and Texas Tech. With Joey McGuire and the Red Raiders afforded nearly a month to prepare for Oregon's offense, we could see one of the nation's top defenses operating at its peak at AT&T Stadium. There's always some concern that Behren Morton could struggle in a high-leverage moment, given the number of blowouts Texas Tech enjoyed against Big 12 competition this season, but the Red Raiders are built to beat a team like Oregon. That second-half performance against James Madison should have been a wake-up call for the Ducks. Another showing like that against an elite opponent such as Texas Tech could lead to a lopsided final. ... Texas Tech 30, Oregon 24.\nRose Bowl: Alabama vs. Indiana -6.5\nHummer (Alabama +6.5):Imagine explaining this line to someone three years ago, before Nick Saban retired. But as Curt Cignetti would tell you: \"Google me.\" Indiana is the justified favorite entering this matchup, and as is always the case with Alabama, it largely hinges on how Ty Simpson plays. The Tide can struggle to run the ball -- ranking 72nd nationally in success rate -- and Indiana owns a top-10 run defense. That means Simpson will have to carry the load. He's capable of that, but Indiana is also an excellent pass defense and fields one of the nation's most efficient offenses. It's a brutal matchup for Alabama, which will need to play near-perfect football -- something it hasn't done consistently this season. It still feels strange to write, but give me the Hoosiers. They've been the most consistent team all year, and that matters. … Indiana 27, Alabama 24.Crawford (Indiana -6.5): If there's a chance of another playoff runaway in the quarterfinals, it could come here for the Crimson Tide. There's no matchup an Alabama fan should view as favorable in this spot against the Heisman winner and a strong defensive group, but perhaps Kalen DeBoer can thrive again in the underdog role. His teams have consistently responded to adversity, and the distraction surrounding the Michigan rumors appears to be settling, which helps. Alabama spotted Oklahoma 17 points in its last outing, and a repeat of that would mean a long flight home to Tuscaloosa. As the unblemished top seed, there's pressure on Indiana as well. Oregon fell in a similar spot last fall at the Rose Bowl after Ohio State won its first-round matchup with Tennessee. ... Indiana 31, Alabama 17.Sugar Bowl: Ole Miss vs. Georgia -7.5\nHummer (Georgia -7.5):  Two regular-season rematches in a row for Ole Miss is an interesting wrinkle of the 12-team era. Georgia won the first meeting, storming back late in a game it outgained the Rebels by 159 yards. The issue for Ole Miss this time is that it's a worse team now than it was then. The rosters are largely the same, but the coaching staff has been in constant flux. Meanwhile, Georgia is playing its best football of the season after finding its footing defensively, allowing just 26 total points over its last three games against Power Four competition -- Texas, Georgia Tech and Alabama. The Bulldogs head to Louisiana and secure a decisive win.… Georgia 34, Ole Miss 24.\nCrawford (Ole Miss +7.5): You have to believe you can slay a giant before actually doing so, and Ole Miss carries that confidence into New Orleans. The Rebels produced a near-perfect game plan against Georgia in an October loss, scoring touchdowns on their first five possessions in a 43-35 defeat. Georgia answered by scoring 17 points in the fourth quarter to erase a nine-point deficit. Trinidad Chambliss committed no turnovers in that matchup, but a pair of fourth-quarter three-and-outs proved costly, particularly with the defense unable to get stops. Ole Miss will need significantly better play on that side of the ball to knock off the SEC champions and advance to the semifinals. ... Georgia 27, Ole Miss 20.Remaining bowl games (Dec. 24-Jan. 2)With all non-playoff bowl game wagers, be sure to study the rosters and coaching staffs each team brings into its postseason matchup. Several two-deeps have been decimated by player opt-outs and transfer portal departures, with more than a dozen programs also navigating leadership changes.Motivation always matters, too. How many of these teams truly want to be there and are looking to finish the season on a high note heading into 2026? Like most insiders, oddsmakers are making educated guesses on many of these lines. Play accordingly -- and smart.\nHawaii Bowl: Cal vs. Hawaii -1.5Hummer: California +1.5Crawford: Hawaii -1.5GameAbove Sports Bowl: Central Michigan vs. Northwestern -10.5Hummer: Northwestern -10.5Crawford: Central Michigan +10.5Rate Bowl: New Mexico vs. Minnesota -2.5Hummer: Minnesota -2.5Crawford: Minnesota -2.5First Responder Bowl: FIU vs. UTSA -6.5Hummer: UTSA -6.5Crawford: UTSA -6.5Military Bowl: ECU vs. Pittsburgh -9.5Hummer: ECU +9.5Crawford: Pitt -9.5Pinstripe Bowl: Penn State vs. Clemson -3.5Hummer: Clemson -3.5Crawford: Penn State +3.5Fenway Bowl: UConn vs. Army -8.5Hummer: UConn +8.5Crawford: Army -8.5\nPop-Tarts Bowl: Georgia Tech vs. BYU -4.5Hummer: Georgia Tech +4.5Crawford: Georgia Tech +4.5Arizona Bowl: Miami (Ohio) vs. Fresno St -4.5\nHummer: Fresno St -4.5Crawford: Fresno State -4.5New Mexico Bowl: North Texas -3.5 vs. San Diego StateHummer: North Texas -3.5Crawford: North Texas -3.5\nGator Bowl: Virginia vs. Missouri -4.5Hummer: Virginia +4.5Crawford: Missouri -4.5Texas Bowl: LSU vs. Houston -2.5\nHummer: LSU +2.5Crawford: Houston -2.5Birmingham Bowl: Georgia Southern -7.5 vs. Appalachian StateHummer: Appalachian State +7.5Crawford: Appalachian State +7.5\nIndependence Bowl: Coastal Carolina vs. La. Tech -8.5Hummer: Louisiana Tech -8.5Crawford: Coastal Carolina +8.5Music City Bowl: Tennessee -2.5 vs. IllinoisHummer: Illinois +2.5Crawford: Tennessee -2.5Alamo Bowl: USC -6.5 vs. TCUHummer: USC -6.5Crawford: USC -6.5ReliaQuest Bowl: Iowa vs. Vanderbilt -5.5Hummer: Vanderbilt -5.5Crawford: Vanderbilt -5.5Sun Bowl: Arizona State vs. Duke -2.5Hummer: Duke -2.5Crawford: Duke -2.5Citrus Bowl: Michigan vs. Texas -7.5Hummer: Texas -7.5Crawford: Texas -7.5Las Vegas Bowl: Nebraska vs. Utah -15.5Hummer: Nebraska +15.5Crawford: Nebraska +15.5Armed Forces Bowl: Rice vs. Texas State -8.5Hummer: Texas State -8.5Crawford: Texas State -8.5Liberty Bowl: Navy -6.5 vs CincinnatiHummer: Cincinnati +6.5Crawford: Navy -6.5Mayo Bowl: Wake Forest vs. Miss St. -4.5Hummer: Wake Forest +4.5Crawford: Wake Forest +4.5Holiday Bowl: Arizona -2.5 vs. SMU Hummer: SMU +2.5Crawford: SMU +2.5\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff odds, picks, predictions for remaining bowl games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/495b8294-b5c2-4164-9aec-8e8ba8d8a8d9/thumbnail/1200x675/6c16d95ad615edfea1d5718a7c6df99d/buckeyes.png"
      ],
      "datePublished": "2025-12-24T14:44:40.000Z",
      "dateModified": "2025-12-24T14:44:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Commanders prediction, odds, spread: Week 17 NFL Christmas Day picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-commanders-prediction-odds-start-time-week-17-nfl-christmas-day-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/27/34063cfe-519d-40c4-adf6-7c4bd23a7968/thumbnail/1200x675/69ae4dcf073065e58840192f7c416da9/imagn-dak-prescott-cowboys-pregame.jpg",
    "tag": "Sports",
    "date": "2025-12-24T13:12:37.000Z",
    "description": "\nNFC East rivals looking to finish out disappointing seasons meet when the Dallas Cowboys take on the Washington Commanders on Christmas Day. Dallas i",
    "body": "\nNFC East rivals looking to finish out disappointing seasons meet when the Dallas Cowboys take on the Washington Commanders on Christmas Day. Dallas is coming off a 34-17 loss to the Los Angeles Chargers on Sunday, while Washington dropped a 29-18 decision to the Philadelphia Eagles on Saturday. The Cowboys (6-8-1), who have lost three in a row, are 2-5 on the road this season. Both teams have been eliminated from playoff contention. The Commanders (4-11), who have lost nine of 10, are 2-5 on their home field. It's uncertain who Washington will start at quarterback with Jayden Daniels (elbow) shut down for the season and Marcus Mariota (hand/quad) missing practice on Monday and Tuesdsay. Kickoff from Northwest Stadium in Landover, Md., is set for 1 p.m. ET. The Cowboys are 7-point favorites in the latest Cowboys vs. Commanders odds, while the over/under for total points scored is 50.5 via DraftKings Sportsbook. Before making any Commanders vs. Cowboys picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Cowboys vs. Commanders. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Cowboys vs. Commanders:Cowboys vs. Commanders                                                                         spreadDallas -7 at DraftKings SportsbookCowboys vs. Commanders                     over/under50.5 pointsCowboys vs. Commanders                                                                                                                                                                                     money line Dallas -3336, Washington +266Cowboys vs. Commanders                                                                                                                                                                             picksSee picks at SportsLineCowboys vs. Commanders                                                                                                                                                                               streaming Netflix \nWhat you need to know about the CowboysVeteran quarterback Dak Prescott powers the Dallas offense. In 15 games this season, he has completed 68.5% of his passes for 4,175 yards and 28 touchdowns with 10 interceptions and a 100.0 rating. He has also carried 47 times for 154 yards (3.3 average) and two touchdowns. In Sunday's loss to the Chargers, Prescott completed 21 of 30 passes for 244 yards and two touchdowns. He also rushed twice for 14 yards.Wide receiver George Pickens is one of Prescott's top targets. In 15 games, he has 88 receptions for 1,342 yards (15.3 average) and nine touchdowns. He has 21 explosive plays of 20 yards or more, including a long of 45, with 426 yards after the catch and 69 first-down conversions. In the loss to the Chargers, he caught seven passes for 130 yards (18.6 average) and one touchdown. See which team to back at SportsLine. What you need to know about the CommandersWith quarterbacks options dwindling, Washington might turn to veteran journeyman Josh Johnson. In three games, Johnson has completed 55.6% of his passes for 43 yards and one interception. Washington also signed Jeff Driskel this week to provide depth. Among Washington's top receivers is veteran wide receiver Deebo Samuel. In 14 games, he has 68 receptions for 639 yards (9.4 average) and five touchdowns. He has eight explosive plays of 20 yards or more, including a long of 38, with 384 yards after the catch and 29 first-down conversions. In a 16-13 loss against Miami on Nov. 16, he caught seven passes for 74 yards and one touchdown. See which team to back at SportsLine.How to make Cowboys vs. Commanders picksSportsLine's model is going Over on the total, projecting 57 combined points. It also says one side of the spread hits well over 50% of the time.         You can only get the pick at SportsLine. So who wins Cowboys vs. Commanders, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Cowboys vs. Commanders spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Commanders prediction, odds, spread: Week 17 NFL Christmas Day picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/27/34063cfe-519d-40c4-adf6-7c4bd23a7968/thumbnail/1200x675/69ae4dcf073065e58840192f7c416da9/imagn-dak-prescott-cowboys-pregame.jpg"
      ],
      "datePublished": "2025-12-24T13:12:37.000Z",
      "dateModified": "2025-12-24T13:12:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA Christmas Day schedule: Bold predictions for all five games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-christmas-day-schedule-bold-predictions-spurs-thunder/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/22eb1629-efd0-4d68-87bf-533c885ec587/thumbnail/1200x675/97fd8e044fad177734280e0c8ac09272/spurs-thunder-usatsi.png",
    "tag": "Sports",
    "date": "2025-12-24T15:11:53.000Z",
    "description": "\n        The NBA's Christmas Day tradition continues this year with a five-game slate featuring some of the best teams and players in the league, incl",
    "body": "\n        The NBA's Christmas Day tradition continues this year with a five-game slate featuring some of the best teams and players in the league, including the reigning champion Oklahoma City Thunder and reigning MVP Shai Gilgeous-Alexander trying to avenge some recent losses against the up-and-coming San Antonio Spurs, led by Victor Wembanyama. Donovan Mitchell, Jalen Brunson, Karl-Anthony Towns, De'Aaron Fox, Jalen Williams, Stephen Curry, Anthony Davis, Cooper Flagg, LeBron James, Luka Dončić, Kevin Durant, Nikola Jokić and Anthony Edwards are some of the other stars who will be in action throughout the day. The action will tip off with a Madison Square Garden matinee featuring the New York Knicks and Cleveland Cavaliers, and conclude with a Mile High matchup between the Minnesota Timberwolves and Denver Nuggets. Before you settle in for 12 hours of hoops, let's take a closer look at the slate with an X-factor to keep an eye on and a bold prediction for each game. \n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Cleveland Cavaliers at New York KnicksTime: 12 p.m. ETWatch: ABC/ESPN/fubo (Try for free) Odds: Knicks -6 | O/U: 238.5 (via FanDuel)X-factor: Jaylon TysonTyson didn't play much as a rookie, but he's quietly become an important piece for the Cavs this season. He's averaging 13 points, 5.4 rebounds and two assists on 52.4/45/78.4 shooting splits in 19 starts. He's fourth on the team in minutes and has been their best 3-point shooter thus far. \nDuring this chaotic season in Cleveland, Tyson has been one of the few constants. He's also been unafraid to speak his mind, and called out the team earlier in the season for a lack of effort. \"We're not hungry enough,\" Tyson said after their loss to the Celtics on Nov. 30. \"I feel like teams want it more than us, there's a target on a lot of our guys' backs, and it's everyone's job to say, 'you wanna come at us, let's go.'\"Tyson and the Cavaliers will have a chance to respond on Christmas. Bold prediction: The Cavaliers will winIt's crazy that this qualifies as a bold prediction, but the Cavaliers have been the most disappointing team in the league. After winning 64 games last season, they're just 17-14 and stuck in seventh place in the Eastern Conference. While they've had major injury issues, poor health doesn't explain everything that's gone on in Cleveland this season. This remains one of the most talented rosters in the league, and the Cavs are only two games back of the No. 3 seed in the crowded middle of the pack in the East. Their Christmas showdown with the Knicks is the perfect opportunity to snap out of their funk, pick up a signature win and start climbing back up the standings. They'll enter the game off the back of consecutive victories (albeit against the Charlotte Hornets and New Orleans Pelicans) where they put up 139 and 141 points, respectively, which should give them a real confidence boost. \n\n        \n            \n                Can the Cavaliers -- the NBA's most expensive team -- snap out of their funk?\n                \n                    John Gonzalez                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    San Antonio Spurs at Oklahoma City ThunderTime: 2:30 p.m. ETWatch: ABC/ESPN/fubo (Try for free)  Odds: Thunder -9.5 | O/U: 233.5X-factor: Luke KornetThe Spurs gave Kornet a four-year deal in free agency to steal him away from the Boston Celtics and shore up their frontcourt situation behind Victor Wembanyama. That was hailed as a smart move in the offseason, and looks even better now. Kornet slid into the starting lineup while Wembanyama was out with a calf injury, and has remained in that role as the Spurs work the French phenom back slowly. Kornet is averaging career-highs of 8.2 points, 6.7 rebounds, two assists and 1.4 blocks per game, while shooting 63.5% from the field. He doesn't put up huge numbers, but he's always in the right spot and making smart, connective plays. Somehow, he also seems to be good for one highlight reel play each night. In the Spurs' win over the Thunder on Tuesday, he threw down an alley-oop over Chet Holmgren. \nBold prediction: There will be multiple technical foulsFamiliarity breeds contempt, as the saying goes, and this will be the third matchup between these teams in the last two weeks. The first two have been competitive, physical affairs won by the up-and-coming Spurs. There's also some real animosity between Wembanyama and Chet Holmgren. \nThe Thunder are going to be back at home on national TV looking for revenge and to snap their first skid (2-3 in their last five games) of the season. It would not be a surprise to see some emotions boil over on Christmas. \n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Dallas Mavericks at Golden State WarriorsTime: 5 p.m. ETWatch: ABC/ESPN/fubo (Try for free)  Odds: Warriors -8 | O/U: 227.5X-factor: Ryan NembhardRyan Nembhard, the younger brother of Pacers point guard Andrew Nembhard, went undrafted this year despite leading the NCAA in assists last season. It hasn't taken him long to prove that every single team besides the Mavericks made a mistake by passing on him. After playing sparingly early in the season, he earned the starting point guard role the day after Thanksgiving and hasn't given it back. He's averaging 10.9 points and seven assists on 51.5 shooting, including 48.6% from 3-point range as a starter, and is coming off an 11-point, seven-assist effort in the Mavericks' victory over the Thunder, during which he played all but eight seconds of the fourth quarter. \nBold prediction: Stephen Curry scores 40 pointsIt's unbelievable that Curry is still carrying such a burden for the Warriors and scoring so efficiently while doing so. In NBA history only four other players -- Michael Jordan, LeBron James, Kobe Bryant and Alex English -- have averaged at least 20 shots per game after turning 35. None of them have been as efficient as Curry, who is shooting 39.8% on 12.3 3-point attempts per game, and boasts a 64.2% true shooting percentage.Curry has always had the ultimate green light, but this season, in particular, he can do whatever he wants. Jimmy Butler doesn't seem super interested in shooting, Brandin Podziemski is their third-leading scorer at 12.4 points per game and Draymond Green has more turnovers (75) than made baskets (72). Curry already has four 40-point games this season, and a showcase game on Christmas against the No. 1 pick is a perfect time to add another one. He's certainly going to take enough shots to get there. \n\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Houston Rockets at Los Angeles LakersTime: 8 p.m. ETWatch: ABC/ESPN/fubo (Try for free)  Odds: Rockets -3.5 | O/U: 229.5X-factor: Reed SheppardAfter a strong start to the season, the Rockets have lost four of their last five games to fall to 17-10 and sixth place in the Western Conference. Their lone win during that skid came against the Nuggets when Reed Sheppard hit a career-high six 3-pointers en route to 28 points, his second-highest scoring game of the season. \nSheppard, the No. 3 pick in last year's draft, barely played as a rookie, but has been thrust into a big role this season due to Fred VanVleet's injury. Boasting extreme confidence in his shot, Sheppard has been lighting it up from behind the arc. He's making 43.5% of his 6.3 3-point attempts per game, and leads the Rockets with 73 makes from long distance. In fact, he's made nearly a quarter of their 3s on the season. The Rockets are dead last in 3-point attempts per game (30.2), and are perhaps overly reliant on Sheppard to provide an outside threat that opponents have to respect. Despite some inconsistent production from the second-year man, Houston has a 121.9 offensive rating with Sheppard on the floor and a 115.7 offensive rating when he sits. The Rockets are 5-2 when Sheppard scores more than 15 points and 12-8 when he does not. If they want to beat the high-powered Lakers, they may need a big night from Sheppard. \nBold prediction: This is the last time LeBron plays on ChristmasNo one has played on Christmas Day more often than LeBron James, who is making his 20th appearance on the holiday. Earlier this month, he made it clear that he's had enough of the occasion. \"I'd much rather be at home with my family,\" James said earlier this week. \"But I mean, it's the game, it's the game I love. It's the game I watched when I was a kid on Christmas Day, watching a lot of the greatest play the game on Christmas. It's always been an honor to play it. Obviously, I'm gonna be completely honest, I would like to be home on the couch with my family all throughout the day. But my number is called -- our number is called, so we have to go out and perform and I look forward to it.\"James has not announced any retirement plans, but given his age (he'll turn 41 next week), growing injury issues due to sciatica and these comments, it's fair to wonder if this is the last time we'll see him suit up on Christmas. \n\n                            \n    \n                                                \n                    \n    \n                            \n    \n                                                \n                    \n    Minnesota Timberwolves at Denver NuggetsTime: 10:30 p.m. ETWatch: ABC/ESPN/fubo (Try for free)  Spread: Nuggets -4 | O/U: 238.5X-factor: Tim Hardaway Jr. Hardaway was one of the Nuggets' many veteran additions during the offseason, and has been a perfect fit alongside Nikola Jokić. He's shooting a career-high 41.7% from 3-point range on six attempts per game, is the team's leading scorer off the bench and has appeared in every game this season. Hardaway has been a constant source of production for the Nuggets while Aaron Gordon and Christian Braun have been sidelined, and has helped the team maintain a 21-8 record, which is good for third place in the Western Conference. If they want to get back on track and take down the Timberwolves after a narrow loss to the Mavericks on Tuesday, they'll need another strong showing from Hardaway, who has had at least 20 points and six 3s in each of his last two games. Bold prediction: Anthony Edwards is going to put someone on a posterEdwards said earlier this month that he doesn't consider himself a superstar. \"I don't think it's no pressure. I don't think I'm under a spotlight. I don't really think I'm a superstar,\" Edwards said. \"I think to some people I may be. But to myself, I'm really not. So I don't really put no pressure on myself. They got other guys in the league for that.\"\nHowever he categorizes himself, he's one of the game's best players and thrives under the bright lights. He'll be eager to put on a show on Christmas, especially against another Western Conference contender. Don't be surprised if he tries to put someone on a poster in the process. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA Christmas Day schedule: Bold predictions for all five games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/22eb1629-efd0-4d68-87bf-533c885ec587/thumbnail/1200x675/97fd8e044fad177734280e0c8ac09272/spurs-thunder-usatsi.png"
      ],
      "datePublished": "2025-12-24T15:11:53.000Z",
      "dateModified": "2025-12-24T15:11:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025-26 college football bowl confidence picks, predictions, computer rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-26-college-football-bowl-confidence-pool-picks-rankings-playoff-quarterfinal-predictions-projections/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/8505b91e-dcaa-405d-9239-5067e9ee4a42/thumbnail/1200x675/77e9454ab891f198f7479444afd0cd25/lincoln-riley-usc-trojans-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-24T13:08:10.000Z",
    "description": "\n        Eleven 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries ",
    "body": "\n        Eleven 2025-26 college football bowl games and four playoff matchup are in the books, but some bowl confidence pools remain open for entries or modifications as there are around 30 matchups remaining to make college football bowl picks on before the curtain closes on this season. The biggest remaining college football spread has Utah as a 15.5-point favorite over Nebraska in the Las Vegas Bowl on Wednesday, Dec. 31 as Kyle Whittingham will coach his final game for the Utes. While putting faith in big favorites is a part of just about everyone's college football bowl confidence strategy, correctly predicting a couple upsets can give you a big edge in any football pools. Anticipated matchups outside of the CFP include Penn State vs. Clemson (-3), Vanderbilt (-5.5) vs. Iowa, Georgia Tech vs. BYU (-4.5), Tennessee vs. Illinois (+2.5) and Michigan vs. Texas (-7.5). Before making any college football predictions for bowl season, be sure to see the latest college football bowl confidence picks from SportsLine's proven model.New users can also target the latest Underdog promo code, good for $75 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. Now, it has turned its attention to the latest college football odds and 2025-26 bowl season college football betting for confidence pools. Head here to see every pick. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top 2025-26 college football bowl confidence picks  One of the model's most confident picks is that No. 16 USC (-6.5), who will have quarterback Jayden Maiava, gets a comfortable win over TCU in the Alamo Bowl on Dec. 30. USC went 9-3 in the regular season, with all three defeats coming versus ranked teams. TCU found itself in the Top 25 once -- back in September -- before having a pedestrian run through the Big 12 schedule, finishing 5-4. Even with the Horned Frogs playing in the easier conference than the Trojans, USC both averaged more points and allowed fewer points per game. USC sports a 32-9 (78%) straight-up record when favored since Lincoln Riley came aboard in 2022, as it is projected to easily take care of business in San Antonio. SportsLine's model has the Trojans prevailing 70% of the time. See all of the model's college football bowl confidence picks here.Another one of the bowl confidence predictions the model is high on: Northwestern (-10.5) handles Central Michigan in the GameAbove Sports Bowl on Dec. 26. Central Michigan struggled mightily against Power 4 opponents this year, losing 63-3 to Michigan and 45-17 to Pittsburgh. Northwestern went just 6-6 this year, but that was largely thanks to a very tough Big Ten schedule that included Oregon, Michigan, USC and Illinois. For comparison, Northwestern lost to Michigan by two points on a last-second field goal. The model has Northwestern winning nearly 80% of the time, making the Wildcats the clear side to back. See the rest of the college football bowl confidence predictions here. How to make college football bowl confidence picksThe model has also made the call on who wins every other bowl game. There are 11 teams that win at least 70% of the time, so you need to go big on those matchups, as well as plenty of underdogs that win outright. You can get all the model's picks at SportsLine.So who wins every college football bowl game, and which matchups should you assign the most confidence points to? Check out the college football bowl schedule below, then visit SportsLine to see which teams to pick, all from a proven computer model that has simulated each bowl game 10,000 times, and find out.College football bowl schedule See every college football bowl game pick hereWednesday, Dec. 24 Hawaii Bowl: Cal vs. Hawaii, 8 p.m. ET  Friday, Dec. 26 GameAbove Sports Bowl: Central Michigan vs. Northwestern, 1 p.m. ET Rate Bowl: New Mexico vs. Minnesota, 4:30 p.m. ET First Responder Bowl: FIU vs. UTSA, 8 p.m. ET  Saturday, Dec. 27 Military Bowl: Pitt vs. East Carolina, 11 a.m. ET Pinstripe Bowl: Penn State vs. Clemson, noon ET Fenway Bowl: UConn vs. Army, 2:15 p.m. ET Pop-Tarts Bowl: Georgia Tech vs. BYU, 3:30 p.m. ET Arizona Bowl: Miami (OH) vs. Fresno State, 4:30 p.m. ET New Mexico Bowl: North Texas vs. San Diego State, 5:45 p.m. ET Gator Bowl: Virginia vs. Missouri, 7:30 p.m. ET Texas Bowl: LSU vs. Houston, 9:15 p.m. ET  Monday, Dec. 29 Birmingham Bowl: Georgia Southern vs. App. State, 2 p.m. ET  Tuesday, Dec. 30 Independence Bowl: Coastal Carolina vs. Louisiana Tech, 2 p.m. ET Music City Bowl: Tennessee vs. Illinois, 5:30 p.m. ET Alamo Bowl: USC vs. TCU, 9 p.m. ET  Wednesday, Dec. 31 ReliaQuest Bowl: Iowa vs. Vanderbilt, noon ET Sun Bowl: Arizona State vs. Duke, 2 p.m. ET Citrus Bowl: Michigan vs. Texas, 3 p.m. ET Las Vegas Bowl: Nebraska vs. Utah, 3:30 p.m. ET CFP quarterfinals/Cotton Bowl: Miami vs. Ohio State, 7:30 p.m. ETThursday, Jan. 1 CFP quarterfinals/Orange Bowl: Texas Tech vs. Oregon, noon ETCFP quarterfinals/Rose Bowl: Alabama vs. Indiana, 4 p.m. ETCFP quarterfinals/Sugar bowl: Ole Miss vs. Georgia, 8 p.m. ET Friday, Jan. 2 Armed Forces Bowl: Rice vs. Texas State, 1 p.m. ET Liberty Bowl: Navy vs. Cincinnati, 4:30 p.m. ET Holiday Bowl: Arizona vs. SMU, 8 p.m. ET Duke's Mayo Bowl: Wake Forest vs. Mississippi State, 8 p.m. ET\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025-26 college football bowl confidence picks, predictions, computer rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/8505b91e-dcaa-405d-9239-5067e9ee4a42/thumbnail/1200x675/77e9454ab891f198f7479444afd0cd25/lincoln-riley-usc-trojans-imagn-images.jpg"
      ],
      "datePublished": "2025-12-24T13:08:10.000Z",
      "dateModified": "2025-12-24T13:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL, NBA load up with Christmas action; J.J. McCarthy out with broken hand - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-nba-christmas-j-j-mccarthy-broken-hand/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/24/c8710f51-2400-4426-91cd-148e676c3e30/thumbnail/1200x675/0fe50ef064b3d162c58f74d219dd629e/gettyimages-2242076600-1.jpg",
    "tag": "Sports",
    "date": "2025-12-24T14:12:56.000Z",
    "description": "\n\n\n    \n                                    Plus, is your favorite NFL team on the nice list or naughty list?\n        \n                               ",
    "body": "\n\n\n    \n                                    Plus, is your favorite NFL team on the nice list or naughty list?\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 24, 2025\n                            \n                    at\n    9:01 am ET\n                        \n                •\n            \n            6 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        This is an article version of the CBS Sports HQ AM Newsletter, the ultimate guide to every day in sports. You can sign up to get it in your inbox every weekday morning here. \nGood morning and Merry Christmas Eve! Carter Bahns with you as the holiday season continues to ramp up. We have the Hawaii Bowl to look forward to tonight and a slate of NBA and NFL action set for tomorrow. We'll preview all of that action in today's newsletter, take a quick break on Christmas Day and return to our regularly scheduled programming on Dec. 26 with a look ahead to the weekend. Let's go!  🎄 Five things to know Wednesday NFL Week 17 opens with a Christmas tripleheader. Things could get lopsided on Thursday as the Cowboys, Lions and Broncos are favored over their respective opponents by at least a touchdown. The sizable spreads are unsurprising considering the Commanders, Vikings and Chiefs have all been eliminated from playoff contention and will be rolling with backup quarterbacks. Speaking of the playoffs, the Packers can clinch a spot in the postseason even though they do not play until Saturday. A Lions loss or tie would secure a playoff berth for Green Bay.The NBA's Christmas schedule features five marquee matchups. The matinee between the Spurs and Thunder headlines the slate, but there is not a bad game on the schedule as projected playoff teams and hopefuls go head-to-head over 10 nonstop hours of basketball. LeBron James makes his 20th Christmas game appearance when the Lakers host the Rockets, and three other showdowns round out the day: Knicks vs. Cavaliers, Warriors vs. Mavericks and Nuggets vs. Timberwolves.Travis Kelce headlines the 2026 NFL Pro Bowl Games rosters. The Chiefs tight end led the fan vote for the second consecutive season and earned his 11th career Pro Bowl nod. The Broncos, Ravens, 49ers and Seahawks tied for the league lead with six selections apiece while the Jets, Vikings and Saints did not have any players picked. See the full rosters for the event, which for the first time takes place at the site of the Super Bowl and is set for Tuesday, Feb. 3.J.J. McCarthy will miss Week 17 with a broken hand. The Vikings quarterback sustained a hairline fracture on his throwing hand, which will keep him out of the Christmas Day matchup against the Lions. Max Brosmer is in line to make his second career start and first since Week 13 when the Vikings lost in shutout fashion to the Seahawks. McCarthy already missed six games this season with a high ankle sprain and concussion and missed his entire rookie year with a torn meniscus.The Hawai'i Bowl is on deck after Tuesday's three-game slate. Louisville opened a bowl season tripleheader with a victory in the Boca Raton Bowl, Western Kentucky won the New Orleans Bowl and Ohio put a bow on the Tuesday action with a Frisco Bowl triumph. The Hawai'i Bowl is next up and is the only major sporting event scheduled for Wednesday, so we'll have our attention locked on California and Hawai'i as they square off in Honolulu. 🎅 Do not miss this: Naughty or nice? Sorting out the projected NFL playoff teams as Super Bowl pretenders or contenders \n                                                                    Getty Images\n                                                            Not all of the 14 projected NFL playoff teams are actually capable of winning the Super Bowl. In fact, there is a very good chance that not all of them even make the postseason. While most of the current top seven teams in both conferences are legitimate contenders -- they have winning records for a reason -- some have major flaws that will stand in the way of the Vince Lombardi Trophy. Zach Pereles put that into festive terms for us, categorizing the contenders and pretenders by their status on Santa Claus' nice list and naughty list: \nNice: Broncos, Patriots, Jaguars, Chargers, Bills, Texans, Seahawks, 49ers, Rams, PackersNaughty: Steelers, Bears, Eagles, PanthersThe Super Bowl pretenders can expect lumps of coal in their stockings. Sorry, Eagles, not everyone can receive presents two years in a row.  📈📉 Pete Prisco's Week 17 NFL Power Rankings \n                                                                    Getty Images\n                                                            The Jaguars' convincing victory over the Broncos precipitated a significant shakeup in the upper echelon of Pete Prisco's NFL Power Rankings, including the introduction of a new No. 1 team to fill Denver's spot. No team fell further than Sean Payton's group (down five spots to No. 6) on the heels of that two-touchdown loss, and the Seahawks are one of eight teams to move up two places with their surge to the top. On the Seahawks: \"Rallying to beat the Rams has the Seahawks as the top seed in the NFC with two weeks to go. They face a tough road game with the Panthers this week.\"On the Broncos: \"The vaunted defense got shredded by the Jaguars, which was a shock. They have to flush it quickly since they play at Kansas City on Thursday.\"Here are the top 10 teams in Prisco's power rankings: Seahawks (last week: 3)Patriots (4)Jaguars (5)Bears (6)Rams (2)Broncos (1)49ers (7)Texans (8)Bills (9)Eagles (12) 👍👎 The best (and not-so-best) of the rest \n                                                                    Getty Images\n                                                            Merry Christmas! From custom golf carts to luxury watches, this is how star athletes like Josh Allen, Jared Goff, Patrick Mahomes, Kryie Irving and Luka Dončić do holiday gifts for teammates.Brooks Koepka announced he will leave LIV Golf. It remains to be seen whether he will attempt a return to the PGA Tour.Justin Fields landed on season-ending injured reserve, prompting questions about his status with the Jets for 2026.The NBA is reportedly discussing potential steps to curb tanking. Each of the solutions would bring changes to how the draft lottery order is determined.The Browns will not activate Deshaun Watson this season despite having opened his 21-day practice window.Wizards forward Cam Whitmore is out indefinitely as the latest NBA player to be diagnosed with deep-vein thrombosis.United States men's national team star Chris Richards was stretchered out of a match for Crystal Palace, adding to USMNT's injury woes.Bryce Harper is the latest star to join Team USA for the 2026 World Baseball Classic.Terry Rozier filed a motion to dismiss the charges he faces as part of the federal investigation into illegal gambling.When will Darryn Peterson return to the Kansas lineup? Bill Self said the potential No. 1 pick's family will have a say.Alexander Isak will miss \"a couple of months\" after undergoing surgery on a broken leg. Might Liverpool search for a replacement striker during the January transfer window?Missouri edge rusher Damon Wilson II sued Georgia and its NIL collective for allegedly penalizing him for entering the transfer portal.Draymond Green explained why he left the Warriors' Monday win over the Magic 20 minutes early following a heated argument with Steve Kerr.The wave of stay-or-go announcements ahead of the transfer portal window is not sitting well with Kirby Smart.Alex Noren, Michael Kim and Min Woo Lee are among the 13 players to earn 2026 Masters invitations with their top-50 Official World Golf Rankings status.The NWSL introduced the new \"High-Impact Player\" rule, which allows teams to spend an additional $1 million above the salary cap.Ben Simmons is still in search of an NBA comeback. But professional fishing also has his attention, as he became an owner of the Sport Fishing Championship league's Florida Sails. 📺 What we're watching on Christmas Eve and Christmas  Wednesday 🏈 Hawaii Bowl: California vs. Hawaii, 8 p.m. on ESPN \n Thursday 🏀 Cavaliers at Knicks, Noon on ABC/ESPN 🏈 Cowboys at Commanders, 1 p.m. on Netflix 🏀 Spurs at Thunder, 2:30 p.m. on ABC/ESPN 🏈 Lions at Vikings, 4:30 p.m. on Netflix 🏀 Mavericks at Warriors, 5 p.m. on ABC/ESPN 🏀 Rockets at Lakers, 8 p.m. on ABC/ESPN 🏈 Broncos at Chiefs, 8:15 p.m. on Prime Video 🏀 Timberwolves at Nuggets, 10:30 p.m. on ABC/ESPN \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL, NBA load up with Christmas action; J.J. McCarthy out with broken hand - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/24/c8710f51-2400-4426-91cd-148e676c3e30/thumbnail/1200x675/0fe50ef064b3d162c58f74d219dd629e/gettyimages-2242076600-1.jpg"
      ],
      "datePublished": "2025-12-24T14:12:56.000Z",
      "dateModified": "2025-12-24T14:12:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All the scores and results from the 2025-26 college football postseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-bowl-schedule-scores-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/06/05/26e80b32-0f14-4b20-a9dc-f390a93fe891/thumbnail/1200x675/be898d509aa7443229d5effb3c6e8523/pop-tarts-bowl.jpg",
    "tag": "Sports",
    "date": "2025-12-24T05:12:00.000Z",
    "description": "\n\n\n    \n                                    Follow along with all the scores from every college football bowl game for the 2025-26 postseason\n        ",
    "body": "\n\n\n    \n                                    Follow along with all the scores from every college football bowl game for the 2025-26 postseason\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 24, 2025\n                            \n                    at\n    12:11 am ET\n                        \n                •\n            \n            4 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The holiday season has arrived, which means so has one of the most exciting time of the year for college football games as we are treated to an all-you-can-watch buffet of bowl game action. The schedule is stacked once again this year as fanbases are afforded the opportunity to see their teams in action one more time before the attention turns to the 2026 season. The bowl schedule kicked off Saturday, Dec. 13 and goes all the way until Jan. 2. The College Football Playoff carries us from there to Jan. 19, when two teams will vie for a national championship in Miami Gardens, Florida. CBS will once again broadcast the Tony the Tiger Sun Bowl. Kick is set for 2 p.m. on Dec. 31 in El Paso, Texas. Additionally, Dec. 27 is one of the most stacked days of the year as eight bowl games will take place on that day, including the Pop-Tarts Bowl, Texas Bowl and Snoop Dogg Arizona Bowl Presented By Gin & Juice By Dre and Snoop (yes, that's its official name). \n\n        \n            \n                College Football Playoff bracket: Indiana, Ohio State, Georgia, Texas Tech earn byes; Miami in over Notre Dame\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nBelow is a detailed look at the complete schedule for the 2025-26 college football bowl season, including dates, locations and TV channels. All times are Eastern.  College Football Playoff                                       DateBowlTime (TV)MatchupJan. 19 (Monday)College Football Playoff National ChampionshipMiami Gardens, Florida7:30 (ESPN)Semifinal winners \t\t\t\tJan. 9 (Friday)Peach (CFP Semifinal)Atlanta, Georgia7:30 p.m. (ESPN)TBA vs. TBA \t\t\t\tJan. 8 (Thursday)Fiesta (CFP Semifinal)Glendale, Arizona7:30 p.m. (ESPN)TBA vs. TBA \t\t\t\tJan. 1 (Thursday)Sugar (CFP Quarterfinal) New Orleans, Louisiana8:00 p.m. (ESPN)(3) Georgia vs. (6) Ole MissJan. 1 (Thursday)Rose (CFP Quarterfinal) Pasadena, California4 p.m. (ESPN(1) Indiana vs. (9) AlabamaJan. 1 (Thursday)Orange (CFP Quarterfinal) Miami Gardens, Florida12 p.m. (ESPN)(4) Texas Tech vs. (5) OregonDec. 31 (Wednesday)Cotton (CFP Quarterfinal) Arlington, Texas7:30 p.m. (ESPN)(2) Ohio State vs. (10) MiamiDec. 20 (Saturday)CFP First Round Game7:30 p.m. (TNT)(5) Oregon 51, (12) James Madison 24Dec. 20 (Saturday)CFP First Round Game3:30 p.m. (TNT)(6) Ole Miss 41, (11) Tulane 10Dec. 20 (Saturday)CFP First Round Game12 p.m. (ABC)(10) Miami 10, (7) Texas A&M 3Dec. 19 (Friday)CFP First Round Game8 p.m. (ABC)(9) Alabama 34, (8) Oklahoma 24  Other bowl games                                       DateTime (TV channel)BowlLocationMatchupDec. 13 (Saturday)12 p.m. ABCCricket Celebration BowlMercedes-Benz Stadium Atlanta, GeorgiaSouth Carolina State 40, Prairie View A&M 38 (4OT)Dec. 13 (Saturday)8 p.m. ESPNLA Bowl Hosted By GronkSoFi Stadium Inglewood, CaliforniaWashington 38, Boise State 10Dec. 16 (Tuesday)9 p.m. ESPNSalute to Veterans BowlCramton Bowl Montgomery, AlabamaJacksonville State 17, Troy 13Dec. 17 (Wednesday)5 p.m. ESPNCure BowlCamping World Stadium Orlando, FloridaOld Dominion 24, South Florida 10Dec. 17 (Wednesday)8:30 p.m. ESPN68 Ventures BowlHancock White Stadium Mobile, AlabamaDelaware 20, Louisiana 13Dec. 18 (Thursday)9 p.m. ESPN2Xbox BowlFord CenterFrisco, TexasArkansas State 34, Missouri State 28Dec. 19 (Friday)11 a.m. ESPNMyrtle Beach BowlBrooks Stadium Conway, South CarolinaWestern Michigan 41, Kennesaw State 6Dec. 19 (Friday)2:30 p.m. ESPNGasparilla BowlRaymond James Stadium Tampa, FloridaNC State 31, Memphis 7 Dec. 22 (Monday)2 p.m. ESPNFamous Idaho Potato BowlAlbertsons Stadium Boise, IdahoWashington State 34, Utah State 21Dec. 23 (Tuesday)2 p.m. ESPNBoca Raton BowlFlagler Credit Union Stadium Boca Raton, FloridaLouisville 27, Toledo 22Dec. 23 (Tuesday)5:30 p.m. ESPNNew Orleans BowlCaesars Superdome New Orleans, LouisianaWestern Kentucky 27, Southern Miss 16Dec. 23 (Tuesday)9 p.m. ESPNFrisco BowlFord Center at The StarFrisco, TexasOhio 17, UNLV 10Dec. 24 (Wednesday)8 p.m. ESPNHawai'i BowlClarence T.C. Ching Athletics Complex Honolulu, HawaiiCal vs. Hawai'iDec. 26 (Friday)1 p.m. ESPNGameAbove Sports BowlFord FieldDetroit, Mich.Central Michigan vs. NorthwesternDec. 26 (Friday)4:30 p.m.  ESPNRate BowlChase FieldPhoenix, Ariz.New Mexico vs. MinnesotaDec. 26 (Friday)8 p.m.  ESPNFirst Responder BowlGerald J. Ford Stadium Dallas, TexasFIU vs. UTSADec. 27 (Saturday)11 a.m. ESPNMilitary BowlNavy-Marine Corps Memorial Stadium Annapolis, MarylandPittsburgh vs. East CarolinaDec. 27 (Saturday)12 p.m. ABCPinstripe BowlYankee Stadium Bronx, New YorkPenn State vs. ClemsonDec. 27 (Saturday)2:15 p.m. ESPNFenway BowlFenway Park Boston, MassachusettsUConn vs. ArmyDec. 27 (Saturday)3:30 p.m. ABCPop-Tarts BowlCamping World Stadium Orlando, FloridaGeorgia Tech vs. BYUDec. 27 (Saturday)4:30 p.m. The CWSnoop Dogg Arizona Bowl Presented By Gin & Juice By Dre and SnoopArizona Stadium Tucson, ArizonaFresno State vs. Miami (OH)Dec. 27 (Saturday)5:45 p.m. ESPNNew Mexico BowlBranch Field at University Stadium Albuquerque, New MexicoNorth Texas vs. San Diego StateDec. 27 (Saturday)7:30 p.m.  ABCGator BowlEverBank Stadium Jacksonville, FloridaMissouri vs. VirginiaDec. 27 (Saturday)9:15 p.m. ESPNTexas BowlNRG Stadium Houston, TexasLSU vs. HoustonDec. 29 (Monday)2 p.m. ESPNBirmingham BowlProtective Stadium Birmingham, AlabamaGeorgia Southern vs. Appalachian StateDec. 30 (Tuesday)2 p.m. ESPNIndependence BowlIndependence Stadium Shreveport, LouisianaCoastal Carolina vs. Louisiana TechDec. 30 (Tuesday)5:30 p.m. ESPNMusic City BowlNissan Stadium Nashville, TennesseeTennessee vs. IllinoisDec. 30 (Tuesday)9 p.m. ESPNAlamo BowlAlamodome San Antonio, TexasUSC vs. TCUDec. 31 (Wednesday)12 p.m. ESPNReliaQuest BowlRaymond James Stadium Tampa, FloridaVanderbilt vs. IowaDec. 31 (Wednesday)2 p.m. CBSTony the Tiger Sun BowlSun Bowl Stadium El Paso, TexasDuke vs. Arizona StateDec. 31 (Wednesday)3 p.m. ABCCitrus BowlCamping World Stadium Orlando, FloridaMichigan vs. TexasDec. 31 (Wednesday)3:30 p.m. ESPNLas Vegas BowlAllegiant Stadium Las Vegas, NevadaNebraska vs. UtahJan. 2 (Friday)1 p.m. ESPNArmed Forces BowlAmon Carter Stadium Fort Worth, TexasTexas State vs. RiceJan. 2 (Friday)4:30 p.m. ESPNLiberty BowlSimmons Bank Liberty Stadium Memphis, TennesseeNavy vs. CincinnatiJan. 2 (Friday)8 p.m. ESPNMayo BowlBank of America Stadium Charlotte, North CarolinaMississippi State vs. Wake ForestJan. 2 (Friday)8 p.m. FOXHoliday BowlSnapdragon Stadium San Diego, CaliforniaArizona vs. SMU\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All the scores and results from the 2025-26 college football postseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/06/05/26e80b32-0f14-4b20-a9dc-f390a93fe891/thumbnail/1200x675/be898d509aa7443229d5effb3c6e8523/pop-tarts-bowl.jpg"
      ],
      "datePublished": "2025-12-24T05:12:00.000Z",
      "dateModified": "2025-12-24T05:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]