[
  {
    "title": "Patriots vs. Seahawks score prediction: Model projects exact score for Big Game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-patriots-score-prediction-picks-exact-score-big-game-nfl-betting-apps/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/1216b699-e9bd-4168-b21d-c716bb10e673/thumbnail/1200x675/6ee9979de41753cf6d8628cb63f9ae13/new-england-patriots.jpg",
    "tag": "Sports",
    "date": "2026-02-03T19:10:32.000Z",
    "description": "\n        The Seattle Seahawks will take on the New England Patriots in the 2026 Big Game at Levi's Stadium on Sunday, February 8. One option for a pot",
    "body": "\n        The Seattle Seahawks will take on the New England Patriots in the 2026 Big Game at Levi's Stadium on Sunday, February 8. One option for a potentially massive payout is a Seahawks vs. Patriots score prediction. Both teams went 14-3, won their divisions, and then had to survive hard-fought conference championship games. The Seahawks beat the Rams, 31-27, to win the NFC Championship Game, while the Patriots earned a 10-7 win over the Broncos on the road in a defensive struggle that ended with a surprise blizzard.The latest Patriots vs. Seahawks odds list Seattle as a 4.5-point favorite, while the over/under is 45.5, both unchanged from the opening line. The Seahawks are -238 money line favorites (risk $238 to win $100), while the Patriots are +195 underdogs. You can use these sportsbook promos to bet those lines or any of the numerous NFL props available. The SportsLine Projection Model is predicting that the Seahawks come away with a 24-20 win, an exact score prediction that pays as high as +15000 on some of the best sports betting apps. You can also boost your bankroll for the Big Game even further by capitalizing on some of the best Big Game promo codes.SportsLine's model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting apps could have seen strong returns.  Best Big Game Sportsbook offersBrandPromoCBS promo codeDraftKingsBet $5, get $300 in bonus bets if your first bet winsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $200 in bonus bets instantlyCBSBET365CaesarsFirst bet matched up to $250 as bonus bets, win or loseCBSSPORTS250BMFanDuelBet $5, get $200 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $1,000 in No Sweat Bets FanCash CBSFANThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users $200 in bonus bets with the placement of a $5+ bet, whether the bet wins or loses. At DraftKings and FanDuel, you need to win your first bet to receive the bonus. DraftKings offers new users $300 in bonus bets if their first bet of at least $5 wins while FanDuel is offering $200 if the first $5 wager cashes.The latest Fanatics Sportsbook promo code CBSFAN provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $100 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code CBSSPORTS250BM matches your first bet up to $250 in bonus bets, whether it wins or loses. So, although you have to risk more to get a larger portion of the reward, you have the chance to essentially double your first bet's winnings if you win, plus have the safety net of bonus bets whether it wins or loses.Seahawks vs. Patriots odds, betting lines\nSeahawks vs. Patriots spreadSeattle -4.5 at DraftKings SportsbookSeahawks vs. Patriots over/under45.5 pointsSeahawks vs. Patriots money line Seahawks -238, Patriots +195Seahawks vs. Patriots picksSee picks at SportsLineSeahawks vs. Patriots streaming Fubo (try for free)Patriots vs. Seahawks exact score prediction, betting previewIn a season where the playoff picture was crowded from start to finish, both the Seahawks and Patriots established themselves as upper echelon by the midway point of the season. Seattle loss its opener to San Francisco and fell to 3-2 after a Week 5 loss to Tampa Bay, but ripped off wins in 13 of the next 14 wins to earn its way into the Big Game. Meanwhile, New England lost two of its first three but has won 16 of its last 17.Sam Darnold and Drake Maye both looked like NFL MVP candidates at points throughout the season, though they'll likely fall short to Rams quarterback Matthew Stafford. Darnold has rejuvenated his career by throwing 60 touchdown passes in the last two seasons and Maye became the youngest player in NFL history to lead the league in completion percentage (72.0%).Both teams were top five in the NFL in scoring offense and scoring defense and the SportsLine Projection Model is predicting thin margins against the spread and with the over/under. It's slightly leaning towards Seattle to cover against the spread based on the percentages and also projects that the Under hits in 59% of its 10,000 simulations of the Big Game, higher than the implied odds of 52.2%.Exact score prediction: Seattle Seahawks 24, New England Patriots 20 (best odds +15000 at BetMGM):Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks score prediction: Model projects exact score for Big Game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/1216b699-e9bd-4168-b21d-c716bb10e673/thumbnail/1200x675/6ee9979de41753cf6d8628cb63f9ae13/new-england-patriots.jpg"
      ],
      "datePublished": "2026-02-03T19:10:32.000Z",
      "dateModified": "2026-02-03T19:10:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Seahawks prediction, odds, date, spread: 2026 Super Bowl picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-seahawks-prediction-odds-line-spread-game-date-2026-super-bowl-60-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/d64d8ca8-0c04-4903-a65f-63e6aac733e4/thumbnail/1200x675/b177cc93b5ee2dc1c9ae20ea44bef09f/christian-gonzalez-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:38:27.000Z",
    "description": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks on Sunday, Feb. 8. For the first time in the histo",
    "body": "\nThe matchup for Super Bowl LX is set, with the New England Patriots taking on the Seattle Seahawks on Sunday, Feb. 8. For the first time in the history of The Big Game, each team ranks in the top four in both scoring offense and scoring defense, providing a balanced Super Bowl 60 matchup. New England (14-3) went on the road to defeat Denver, 10-7, in the AFC Championship Game, while Seattle (14-3) held off the Rams, 31-27, to claim the NFC Title Game. The 2026 Super Bowl is a rematch from 11 years ago when the Pats prevailed 28-24 to win Super Bowl XLIX. Kickoff is at 6:30 p.m. ET from Levi's Stadium in Santa Clara, Calif. Seattle is the 4.5-point favorite in the latest Seahawks vs. Patriots   odds from DraftKings Sportsbook, while the over/under for total points is 45.5, with the Over slightly favored at -115 and the Under at -105. Before making any Patriots vs. Seahawks picks, check out the NFL predictions from the SportsLine Projection Model. \nThe model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the 2026 Super Bowl on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Seahawks vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Patriots vs. Seahawks:Seahawks vs. Patriots spreadSeattle -4.5 (-115) at DraftKings SportsbookSeahawks vs. Patriots                 over/under45.5 pointsSeahawks vs. Patriots                                                                                                                                                                                  money line Seahawks -238, Patriots +195Seahawks vs. Patriots                                                                                                                                                                         picksSee picks at SportsLineSeahawks vs. Patriots                                                                                                                                                                            streaming Fubo (try for free)Why the Patriots can coverThe Pats shook off talk about their weak strength of schedule by defeating three playoff teams that had 11-plus wins in the regular season. They enter Super Bowl LX with a 16-1 record over their last 17 games, which is not a record that even Seattle can measure up to. New England has incredible balance, ranking second in points scored and fourth in points allowed, with the offense specifically standing out. Drake Maye combines both efficiency with a big-play ability as he leads the league in both completion percentage and yards per pass attempt. Meanwhile, the defense is playing its best entering Super Bowl Sunday as New England has given up one or fewer touchdowns in each of its last five games. See which team to back at SportsLine. Why the Seahawks can coverIt's hard to find any holes with Seattle, including in regard to the spread, as it has both the most covers and the best cover percentage of the regular plus postseason. The Seahawks are the only NFL team to rank in the top three in both scoring offense and scoring defense, and just five teams had more takeaways in the regular season. Mike Macdonald's crew also boasts top-10 rankings on both the ground and thru the air, but the defense is the star of this team. Seattle leads the NFL in points allowed, third-down defense, yards per rush allowed and yards per pass attempt allowed while ranking second in yards per play given up and rushing touchdowns allowed. No. 1 scoring defenses, like what Seattle has, also have a great history in this game, with a 14-4 all-time Super Bowl record. See which team to back at SportsLine.How to make Seahawks vs. Patriots picksSportsLine's model has simulated Patriots vs. Seahawks 10,000 times and is going Under on the total, projecting 44 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Seahawks vs. Patriots, and which side of the Super Bowl spread is the better value? Visit SportsLine now to see which side of the Patriots vs. Seahawks spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Seahawks prediction, odds, date, spread: 2026 Super Bowl picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/d64d8ca8-0c04-4903-a65f-63e6aac733e4/thumbnail/1200x675/b177cc93b5ee2dc1c9ae20ea44bef09f/christian-gonzalez-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2026-02-03T16:38:27.000Z",
      "dateModified": "2026-02-03T16:38:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Super Bowl anytime touchdown scorer picks, back Smith-Njigba to score - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-anytime-touchdown-scorer-picks-odds-model-locks-in-best-bets-for-seahawks-vs-patriots/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/28/113ad346-2f92-41b4-8c5d-7e8fc8945478/thumbnail/1200x675/5085513dc4f5c95b2b6f36013a2642f6/jaxon-smith-njigba-seattle-seahawks-imagn-images-3.jpg",
    "tag": "Sports",
    "date": "2026-02-03T17:38:40.000Z",
    "description": "\nThe Super Bowl is one of the most exciting annual sports days on the calendar, and millions of Americans watch football for the touchdowns. With onli",
    "body": "\nThe Super Bowl is one of the most exciting annual sports days on the calendar, and millions of Americans watch football for the touchdowns. With online sports betting becoming legalized in more states, anytime touchdown scorer bets have become among the most popular bets you can make on any NFL Sunday, especially for Super Bowl Sunday. The 2026 Super Bowl features the Seattle Seahawks against the New England Patriots from Levi's Stadium in Santa Clara, Calif., on Sunday, Feb. 8 at 6:30 p.m. ET, and Seattle and New England both had top-10 scoring offenses, which could lead to plenty of potential winning Super Bowl 60 anytime touchdown scorer bets. The SportsLine Projection Model has simulated Super Bowl 60 10,000 times, and found multiple players with value to cash 2026 Super Bowl anytime TD scorer bets. One of the model's top picks is Seahawks star wide receiver Jaxon Smith-Njigba, who has scored a touchdown in each of Seattle's first two playoff games. \nThe model projects that to continue, locking in Smith-Njigba as one of its best bets for Super Bowl 2026 anytime touchdown scorer picks. The model is also backing a pair of Patriots, projecting value in both New England running back Rhamondre Stevenson and wide receiver Kayshon Boutte to score in Super Bowl 60. Targeting anytime touchdown bets is one way to approach Super Bowl betting at online sports betting sites. With NFL props available for almost every player in Super Bowl 60 at DraftKings, the SportsLine Projection Model can help you find value to add to your 2026 Super Bowl picks. Super Bowl 60 anytime touchdown picks:Jaxon Smith-Njigba, Seahawks (-110)Rhamondre Stevenson, Patriots (+160)Kayshon Boutte, Patriots (+295)\nJaxon Smith-Njigba, Seahawks (-110)\nThe third-year receiver is staking his claim as the best wideout in the NFL. He led the league with 1,793 receiving yards this season, while finishing fourth in receptions (119) and tied for sixth with 10 touchdowns. Smith-Njigba was nearly unstoppable against the Rams last week, posting 10 receptions for 153 yards and a touchdown on 12 targets. He's scored in both playoff games, as, despite teams knowing he's going to be the focal point of the offense, Seattle still finds ways to scheme him open while other teams can't stop him, even with multiple defenders. The model projects the 23-year-old to score in 65% of simulations, compared to his implied probability of 52.4%.Rhamondre Stevenson, Patriots (+160)\nThe 27-year-old running back appeared to be being pushed out of the top spot in the backfield toward the end of the regular season, with rookie TreVeyon Henderson playing more snaps as the season progressed, but New England has made it clear which back it trusts more for the postseason run. Stevenson outsnapped Henderson 60-4 last week, with the veteran playing 94% of snaps against the Broncos. Stevenson has played at least 62% of snaps in all three playoff games, with Henderson's snaps never totaling more than 41%. Stevenson had at least one rushing touchdown in each of New England's final three regular-season games, and the model projects him to score in 53% of simulations, compared to his implied odds of 38.5%.Kayshon Boutte, Patriots (+295)\nBoutte leads the Patriots with 147 receiving yards this postseason, and he's one of four New England pass catchers with a touchdown during the playoffs (no Patriot has more than one). He is second behind Stefon Diggs in receptions (eight) and targets (15), yet he's only third among Patriots pass catchers in anytime touchdown odds and eighth for all players at DraftKings. During the regular season, he was second on the Patriots in touchdown receptions (six), which doubled his touchdown total over the first two years of his career. The model projects him to score in 31% of simulations, which shows strong value for a player priced at nearly 3-1 odds. Want more Super Bowl NFL picks? You've seen the best model Super Bowl 60 anytime touchdown picks. Now, get Super Bowl betting advice before locking in your Super Bowl 60 picks: Visit SportsLine now to see expert Matt Severance's best bet for Patriots vs. Seahawks, all from the expert on a 10-3 roll on 13 NFL picks, returning $842.5 for $100 bettors. Want to go even bigger on your Super Bowl parlay? Visit SportsLine to see its model longshot parlay that returns $15,000 on a $10 bet. SportsLine's resident NFL props experts, Alex 'PropStarz' Selesnick just locked in his top plays as well. Visit SportsLine to get prop picks from the expert who is 62-44 (+916.5) over his last 106 NFL player props.SportsLine's AI PickBot has also locked in its top player props for NFL prop picks, involving stars like Jaxon Smith-Njigba, Kenneth Walker III, Drake Maye and Stefon Diggs. Get its top-rated picks now. Visit SportsLine now to see the top 2026 Super Bowl props.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Super Bowl anytime touchdown scorer picks, back Smith-Njigba to score - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/28/113ad346-2f92-41b4-8c5d-7e8fc8945478/thumbnail/1200x675/5085513dc4f5c95b2b6f36013a2642f6/jaxon-smith-njigba-seattle-seahawks-imagn-images-3.jpg"
      ],
      "datePublished": "2026-02-03T17:38:40.000Z",
      "dateModified": "2026-02-03T17:38:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CSC takes no action against LSU after investigation into unreported NIL deals - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/general/news/college-sports-commission-lsu-investigation-no-disciplinary-action/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/98c80af6-47fe-466e-8403-7c6ba962044f/thumbnail/1200x675/5a3960808beda6ce933d4c924dc4b810/lsu.png",
    "tag": "Sports",
    "date": "2026-02-03T16:30:15.000Z",
    "description": "\n        LSU has cleared its NIL reporting inquiry from the College Sports Commission with no disciplinary action taken against the Tigers, the school",
    "body": "\n        LSU has cleared its NIL reporting inquiry from the College Sports Commission with no disciplinary action taken against the Tigers, the school said in a statement this week. The CSC was investigating LSU, and others, for unreported NIL agreements which must be filed on the NIL Go platform within five days of becoming final.LSU was one of several college football programs to receive a letter of inquiry asking for further details on various NIL contracts.\"The CSC inquiry into non-reporting has been resolved with no disciplinary action, and any deals that require submission to NIL Go have been submitted,\" LSU wrote in a statement Monday. \"We appreciate the CSC's prompt review and resolution.\"The Athletic was first to report last month that LSU received an email sent on Jan. 15 from the CSC's head of investigations, Katie B. Medearis, addressed to athletic director Verge Ausberry. The note was to inform LSU that the CSC was investigating whether they \"failed to report one or more third-party Name, Image, and Likeness (NIL) deals.\"At the time, the CSC requested a phone call with Ausberry or the LSU compliance staff, per The Athletic.\nNOLA.com reported the investigation was not related to the football program, despite first-year coach Lane Kiffin and the Tigers signing the nation's top-ranked transfer portal class. That includes sizable agreements with many of this cycle's top-available players, including former Arizona State quarterback Sam Leavitt, whom LSU wrestled away from various other suitors.The CSC was formed by power conferences last year to govern revenue sharing and verify NIL deals under the new rules set by the House settlement in 2024. In November, the CSC sent a \"participation agreement\" to all four major conferences within college football that allows the CSC to enforce agreed upon rules, prevents schools from circumventing the system to sue over enforcement decisions and requires annual audits of all schools that spent 75% or more of the annual revenue share number, among other measures.The creation of the CSC is meant to bring stability within college athletics during an era that's suddenly filled with lawsuits, which make the enforcement of NCAA rules nearly impossible.\nNIL Go is an online portal for how third-party NIL deals are reported and later evaluated for compliance. NIL Go determines the validity of contracts for a \"valid business purpose\" and ensures they \"do not exceed a reasonable range of compensation.\" After agreed upon NIL deals are reviewed, NIL Go offers student-athletes the opportunity to revise terms and resubmit, cancel the deal or appeal to neutral arbitration if the terms are flagged.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CSC takes no action against LSU after investigation into unreported NIL deals - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/98c80af6-47fe-466e-8403-7c6ba962044f/thumbnail/1200x675/5a3960808beda6ce933d4c924dc4b810/lsu.png"
      ],
      "datePublished": "2026-02-03T16:30:15.000Z",
      "dateModified": "2026-02-03T16:30:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaren Jackson trade: Memphis moves star big man to Utah for three first-round picks, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/jaren-jackson-jr-trade-grizzlies-jazz-for-walter-clayton-jr/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/49e871de-523f-44cc-8943-540159fdfe52/thumbnail/1200x675/bec0029d14d0efae6d3413727db6f05e/jaren-jackson-jr-grizzlies.jpg",
    "tag": "Sports",
    "date": "2026-02-03T19:55:19.000Z",
    "description": "\n        The Memphis Grizzlies kicked off the trade deadline madness by sending Defensive Player of the Year Jaren Jackson Jr. John Konchar, Jock Land",
    "body": "\n        The Memphis Grizzlies kicked off the trade deadline madness by sending Defensive Player of the Year Jaren Jackson Jr. John Konchar, Jock Landale and Vince Williams Jr. to the Utah Jazz for Walter Clayton Jr., Kyle Anderson, Taylor Hendricks, Georges Niang and three future first-round picks, according to ESPN.The Jazz are trading their most favorable 2027 first-round pick between Cleveland, Minnesota and Utah, a Lakers 2027 first-round pick and Phoenix's 2031 first-round pick to Memphis, according to Jake Fischer.It's a shocking move considering most of the noise surrounding the Grizzlies was centered on All-Star guard Ja Morant getting moved. However, Jackson Jr. was viewed as being easier to move, and as a result the Grizzlies stockpiled future first-round picks.Going forward, Memphis holds 13 first-round picks over the next seven seasons. That treasure trove of assets now ties them with the Oklahoma City Thunder and Brooklyn Nets for the most first-round picks in the league.\nAssuming Morant is the next player out the door in Memphis, this now turns the Grizzlies' focus to their stable of young players in rookie Cedric Coward, Jaylen Wells and Zach Edey. Coward is having a standout rookie season, and if it weren't for the tandem of Cooper Flagg and Kon Knueppel leading the Rookie of the Year discussion, Coward would certainly be more in the mix in any other year.Memphis already has several quality young players, and with a 19-29 record, their first-round pick in the 2026 draft will certainly land somewhere in the top-10, perhaps the top-5 now by prioritizing their future. If they manage to land one of the most coveted players at the top of the draft board, the Grizzlies' rebuild could be a short one. It's a smart plan given the Grizzlies have not lived up to the expectations many people had for them after finishing the 2021-22 season with a 56-26 record, and claiming the No. 2 spot in the Western Conference. In actuality, that ended up being the peak of the Jackson Jr. - Morant era, as injuries and off-court issues derailed this team since.\nFor Utah, who may not be done dealing before Thursday's deadline, according to The Athletic, this move signals that they're ready to compete next season after several years of rebuilding. Adding Jackson Jr. to a frontcourt that already features Lauri Markkanen and Walker Kessler means that the Jazz are going to have perhaps the best rim protection in the league going forward. And if they get lucky this summer in the draft lottery, they could add a generational star to fast track this rebuild even more.However, it's fair to wonder how far this core can actually go in a stacked Western Conference that just keeps getting more difficult to compete in. Is Jackson Jr. really the guy they wanted to trade in some of their draft capital for? Will he and Markkanen work well in the frontcourt together? By trading Clayton, the Jazz are betting big on Ace Bailey, who so far hasn't gotten the opportunity most top-5 picks get.It's a bit of a confusing trade on the surface for the Jazz, but if more moves are on the horizon for them, then more clarity will come with it. But for now what's for certain is that Utah is not planning on tanking much longer.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaren Jackson trade: Memphis moves star big man to Utah for three first-round picks, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/49e871de-523f-44cc-8943-540159fdfe52/thumbnail/1200x675/bec0029d14d0efae6d3413727db6f05e/jaren-jackson-jr-grizzlies.jpg"
      ],
      "datePublished": "2026-02-03T19:55:19.000Z",
      "dateModified": "2026-02-03T19:55:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff schedule: Dates for 2026-2028 games announced - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-playoff-schedule-dates-2026-2027/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/e45e3ba8-ed1b-4523-996d-481b0ebd9a87/thumbnail/1200x675/b302a4b46f936d39fd1297a398a5aed8/gettyimages-2254204464-1.jpg",
    "tag": "Sports",
    "date": "2026-02-03T19:56:41.000Z",
    "description": "\n\n\n    \n                                    We now know when the next two College Football Playoffs will occur\n        \n                              ",
    "body": "\n\n\n    \n                                    We now know when the next two College Football Playoffs will occur\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Feb 3, 2026\n                            \n                    at\n    2:56 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The College Football Playoff unveiled the dates and host sites for its quarterfinal and semifinal rounds over the next two seasons on Tuesday. This comes not long after the CFP Management Committee announced that the 2026-27 playoff will remain at 12 teams as the conferences have continued discussions about further expansion. There are a couple of notable changes to the future CFP schedule. The 2026-27 playoff's first quarterfinal game will be played on Dec. 30, rather than the traditional Dec. 31 New Year's Eve game. That's likely because New Year's Eve falls on a Thursday in 2026, which means that the CFP would be competing with the NFL for views. The Rose Bowl was granted its preferred Jan. 1 timeslot, so it will not host a semifinal game over the next two seasons. There will also be two weeks between the quarterfinal and semifinal rounds in 2026-27 and 2027-28 instead of just one week. That means at least 24 days will pass between the first round of the 2026-27 CFP and the semifinal round. Here's a look at the dates and the host sites for the College Football Playoff in the 2026 and 2027 seasons. 2026-27 College Football Playoff schedule College Football Playoff Quarterfinals Wednesday, Dec. 30, 2026 Fiesta Bowl (State Farm Stadium -- Glendale, Arizona) Friday, Jan. 1, 2027 Cotton Bowl (AT&T Stadium -- Arlington, Texas) Peach Bowl (Mercedes-Benz Stadium -- Atlanta, Georgia) Rose Bowl (Rose Bowl -- Pasadena, California) College Football Playoff Semifinals Thursday, Jan. 14, 2027 Orange Bowl (Hard Rock Stadium -- Miami Gardens, Florida) Friday, Jan. 15, 2027 Sugar Bowl (Caesars Superdome -- New Orleans, Louisiana) 2027-28 College Football Playoff schedule College Football Playoff Quarterfinals Friday, Dec. 31, 2027 Sugar Bowl (Caesars Superdome -- New Orleans, Louisiana)  Saturday, Jan. 1, 2027 Fiesta Bowl (State Farm Stadium -- Glendale, Arizona)  Peach Bowl (Mercedes-Benz Stadium -- Atlanta, Georgia)  Rose Bowl (Rose Bowl -- Pasadena, California) College Football Playoff Semifinals Thursday, Jan. 13, 2028 \n Orange Bowl (Hard Rock Stadium -- Miami Gardens, Florida)  Friday, Jan. 14, 2028 Cotton Bowl (AT&T Stadium -- Arlington, Texas)  \n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff schedule: Dates for 2026-2028 games announced - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/e45e3ba8-ed1b-4523-996d-481b0ebd9a87/thumbnail/1200x675/b302a4b46f936d39fd1297a398a5aed8/gettyimages-2254204464-1.jpg"
      ],
      "datePublished": "2026-02-03T19:56:41.000Z",
      "dateModified": "2026-02-03T19:56:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to watch Seahawks vs. Patriots: Ways to live stream Super Bowl 60 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/super-bowl-2026-streaming-seahawks-patriots/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/02/1e4327ea-bf90-4167-aee8-84aa4df8dbf7/thumbnail/1200x675/7306dd685e9e1a591ab2e9e558ee930b/gettyimages-2258765818.jpg",
    "tag": "Sports",
    "date": "2026-02-03T19:30:02.000Z",
    "description": "\n        The week leading up to Super Bowl LX has finally arrived, and kickoff between the AFC champion New England Patriots and the NFC champion Seat",
    "body": "\n        The week leading up to Super Bowl LX has finally arrived, and kickoff between the AFC champion New England Patriots and the NFC champion Seattle Seahawks is only five days away from one of the most fresh-faced Super Bowls ever. Super Bowl LX is the first Super Bowl showdown ever in which both teams' starting quarterbacks -- the Patriots' Drake Maye and the Seahawks' Sam Darnold -- and head coaches -- the Patriots' Mike Vrabel and the Seahawks Mike Macdonald -- are in either their first or second season with that team, per CBS Sports Research. It's a matchup of two teams who weren't expected to still be standing at the end of the season: Patriots vs. Seahawks is also the first Super Bowl matchup since 1981 between teams who had preseason Super Bowl odds of 50-1 or longer, according to CBS Sports Research. This year's big game featuring New England and Seattle will kick off at 6:30 p.m. ET. NBC will have the linear/traditional broadcast of the Super Bowl, and the network will stream the game on Tubi, which is one of the many ways you can watch the game on an OTT device. Tubi is a free, over-the-top (OTT), ad-supported streaming service that provides movies, live TV and TV shows. Consumers do not have to pay a cent to watch content on their app here. \nAn OTT device is any device that isn't a laptop, mobile phone or laptop that is used to consume over-the-top content. Examples of such devices include Apple TVs, Smart TVs, Amazon Fire sticks, Chromecast, Xbox, PlayStation, Pluto TV (owned by Paramount) and more. For those who have cable, the game can be streamed on all live TV streaming services that carry NBC as a channel. For non-cable users, watching the Super Bowl online through TV streaming services that offer NBC like YouTube TV, DirectTV Stream and Tubi will work. Tubi is available to be streamed on many supported devices including iPhones, iPads, Apple TVs, Fire TVs, Playstations, Roku TVs, Google TVs and Xboxs. \n\n        \n            \n                Where to watch Super Bowl 2026: Seahawks vs. Patriots kickoff time, TV channel, live stream and prediction\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nWhere to watchDate: Sunday, Feb. 8 | Time: 6:30 p.m. ETLocation: Levi's Stadium (Santa Clara, California)TV: NBC | Stream: Tubi Follow: CBS Sports App \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to watch Seahawks vs. Patriots: Ways to live stream Super Bowl 60 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/02/1e4327ea-bf90-4167-aee8-84aa4df8dbf7/thumbnail/1200x675/7306dd685e9e1a591ab2e9e558ee930b/gettyimages-2258765818.jpg"
      ],
      "datePublished": "2026-02-03T19:30:02.000Z",
      "dateModified": "2026-02-03T19:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boxing schedule for 2026: Ryan Garcia vs. Mario Barrios on tap to start year - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/boxing-schedule-for-2026-dates-location-fights-teofimo-lopez-shakur-stevenson-canelo-alvarez-oleksandr-usyk/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/8f839459-e0d2-4c37-b3b3-2b7d566f5065/thumbnail/1200x675/bd8a5e3ee82bc8be6f030b967f34b3af/barrios-garcia-presser.jpg",
    "tag": "Sports",
    "date": "2026-02-03T16:47:59.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The start of a new calendar year often means a slo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The start of a new calendar year often means a slowdown for the sport of boxing. That is not the case for 2026, as the schedule is loaded with intriguing fights in January and February.The early highlight of the schedule was Shakur Stevenson's domination of Teofimo Lopez Jr. to win the WBO junior welterweight championship. It was a true pound-for-pound performance from Stevenson, who won nearly every second of a fight against the most dangerous foe of his career.We're now looking ahead to some intriguing fights in February, starting with Nick Ball defending his WBA featherweight championship against former world champion Brandon Figueroa on Feb. 7. Also, on Feb. 15, Zuffa Boxing returns for the third card in promotion history. In the main event, Efe Ajagba will battle former heavyweight champion Charles Martin.Then near the end of the month, a DAZN PPV is set with a terrific welterweight title main event. Champion Mario Barrios is set to defend his belt against Ryan Garcia in a fight sure to deliver on action.There are many other title fights, featuring top fighters, which have created a very intriguing kickoff to the sport for 2026.Take a look at the calendar for 2026 below.\nNote: This will be updated constantly with changes and additions. Upcoming boxing schedule for 2026DateLocationMain eventWeightclass/titleNetworkFeb. 7Liverpool, EnglandNick Ball (c) vs. Brandon FigueroaWBA featherweight titleDAZNFeb. 15Las Vegas Zuffa Boxing 03: Efe Ajagba vs. Charles MartinHeavyweightsParamount+ (subscribe now)Feb. 21Las VegasMario Barrios (c) vs. Ryan GarciaWBC welterweight titleDAZN PPVFeb. 21Nottingham, EnglandJosh Warrington vs. Leigh WoodJunior lightweightsDAZNFeb. 22DetroitClaressa Shields (c) vs. Franchon Crews-DezurnUndisputed heavyweight titleDAZNFeb. 28Glendale, ArizonaEmanuel Navarrete (c) vs. Eduardo Nunez (c)Unified junior lightweight titleDAZNMarch 8Las VegasZuffa Boxing 04: Jai Opetaia (c) vs. TBAIBF cruiserweight titleParamount+March 15Yokohama, JapanKnockout CP Freshmart (c) vs. Shokichi IwataWBC junior flyweight titleTBAMarch 28Las VegasSebastian Fundora (c) vs. Keith ThurmanWBC junior middleweight titlePrime Video PPVMarch 28Manchester, EnglandMoses Itauma vs. Jermaine Franklin Jr.HeavyweightsDAZNApril 4LondonDeontay Wilder vs. Derek ChisoraHeavyweightsDAZNApril 11TBATyson Fury vs. Arslanbek MakhmudovHeavyweightsNetflixMay 2Las VegasGilberto Ramirez (c) vs. David BenavidezUnified cruiserweight titleDAZN\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boxing schedule for 2026: Ryan Garcia vs. Mario Barrios on tap to start year - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/8f839459-e0d2-4c37-b3b3-2b7d566f5065/thumbnail/1200x675/bd8a5e3ee82bc8be6f030b967f34b3af/barrios-garcia-presser.jpg"
      ],
      "datePublished": "2026-02-03T16:47:59.000Z",
      "dateModified": "2026-02-03T16:47:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When is Super Bowl 2026? Date, kickoff time, TV, live stream for Seahawks vs. Patriots - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/when-is-super-bowl-2026-preview-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/20/bfe08d17-5cce-4643-a405-3645fdb1bbe6/thumbnail/1200x675/bc32dc88ec854b4bffe4774454466978/super-bowl-lx.jpg",
    "tag": "Sports",
    "date": "2026-02-03T17:45:09.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The most-watched game in American sports is always",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The most-watched game in American sports is always the Super Bowl and we are just five days away from knowing who will win the 60th edition of the NFL's championship game.n. This year the game will be played at Levi's Stadium in Santa Clara, California, home of the San Francisco 49ers.Super Bowl LX will be played on Sunday, Feb. 8, with kickoff scheduled for 6:30 p.m. ET. The game will be broadcast by NBC. The New England Patriots will represent the AFC and it will be the Seattle Seahawks representing the NFC.The Patriots and Seahawks are the main attraction, but the roster of singers on Super Bowl Sunday are all stars in their own right. In addition to the announcement of Bad Bunny being named the featured halftime performer earlier this season, we know that Charlie Puth, Brandi Carlile and Coco Jones have been added to the list of singers for the big game next February.\nWhere to watch 2026 Super Bowl?Date: Sunday, Feb. 8 | Time: 6:30 p.m. ETLocation: Levi's Stadium -- Santa Clara, CaliforniaTV: NBC, streaming on PeacockFollow: CBS Sports App\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When is Super Bowl 2026? Date, kickoff time, TV, live stream for Seahawks vs. Patriots - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/20/bfe08d17-5cce-4643-a405-3645fdb1bbe6/thumbnail/1200x675/bc32dc88ec854b4bffe4774454466978/super-bowl-lx.jpg"
      ],
      "datePublished": "2026-02-03T17:45:09.000Z",
      "dateModified": "2026-02-03T17:45:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why soccer at the L.A. Olympics will be played in New York, Nashville, more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/2028-olympics-los-angeles-soccer-u-s-new-york-nashville-columbus/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/786ba90d-61db-45a6-9205-0e25b08cb1d5/thumbnail/1200x675/ca99f24f6aa01abc9ab37c9626039dec/untitled-design-2026-02-03t190039-734.png",
    "tag": "Sports",
    "date": "2026-02-03T18:03:46.000Z",
    "description": "\n        The men's and women's soccer tournaments during the 2028 Olympics in Los Angeles will be spread out across the United States, event organizer",
    "body": "\n        The men's and women's soccer tournaments during the 2028 Olympics in Los Angeles will be spread out across the United States, event organizers announced on Tuesday, including in venues as far east as New York and Nashville.Both tournaments will take place across seven venues in total, nearly all of them stadiums that host MLS or NWSL teams. Only three – PayPal Park in the San Francisco area, Snapdragon Stadium in San Diego and the Rose Bowl in Pasadena – will be in California. The other venues are stadiums that have opened in the last decade, including ScottsMiracle-Gro Field in Columbus, Energize Park in St. Louis and Geodis Park in Nashville. Etihad Park, located next to the New York Mets' home of CitiField, is currently under construction and is scheduled to open in 2027.The men's and women's competitions will move from east to west, progressively getting closer to the Olympics' host city as each tournament progresses. The Rose Bowl will host both the men's and women's gold medal matches in late July.For 2028, the women's competition will expand to 16 teams while the men's competition, which is contested by U-23 teams, will be reduced to 12 teams.2028 Olympics soccer venuesEnergizer Park, St. LouisEtihad Park, New YorkGeodis Park, NashvillePayPal Park, San JoseRose Bowl, PasadenaScottsMiracle-Gro Field, ColumbusSnapdragon Stadium, San DiegoSoccer at the 2028 Olympics: key datesWomen's soccer\nGroup stage: July 13 - July 19Quarterfinals: July 22Semifinals: July 25Bronze medal match: July 28Gold medal match: July 29Men's soccerGroup stage: July 12 - July 18Quarterfinals: July 21Semifinals: July 24Bronze medal match: July 27Gold medal match: July 28A familiar footprint for Olympic soccerThe Olympic soccer tournaments are usually spread out across an entire host nation, the width of the geographic footprint often depending on the size of the country the competition takes place in that year. Six of the seven venues used during the 2024 Games in Paris, for example, were outside France's capital, while five of the six stadiums used during the pandemic-delayed 2020 Games were outside of Tokyo. The U.S.' geographic footprint, though, is more similar to Brazil, where five of the seven stadiums were outside of Rio de Janeiro.Unlike the last three editions of the Games, though, the 2028 tournaments will not have any group stage games near the host city of Los Angeles. The metropolitan area is home to three professional soccer teams and two stadiums – BMO Stadium, located in Los Angeles and home of MLS' LAFC and the NWSL's Angel City, and Dignity Health Sports Park, home of MLS' LA Galaxy. Neither venue will be available to host soccer matches for the 2028 Olympics, though – event organizers confirmed last year that BMO Stadium will be used for flag football and lacrosse, while Dignity Health Sports Park's main stadium will host rugby sevens and archery.\nThe later stages of both the men's and women's soccer tournament, though, will convene at the Rose Bowl in Pasadena, a site with a history of hosting some of the sport's most important matches. It is the only stadium to host the final of the men's soccer tournament at the Olympics and the final of the men's and women's World Cups – a U-23 France team won Olympic gold at the Rose Bowl in 1984, while Brazil won the men's World Cup there in 1994 and the U.S. women's national team won its second World Cup at the stadium in 1999.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why soccer at the L.A. Olympics will be played in New York, Nashville, more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/786ba90d-61db-45a6-9205-0e25b08cb1d5/thumbnail/1200x675/ca99f24f6aa01abc9ab37c9626039dec/untitled-design-2026-02-03t190039-734.png"
      ],
      "datePublished": "2026-02-03T18:03:46.000Z",
      "dateModified": "2026-02-03T18:03:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where is Super Bowl 2026? Date, time, location, TV channel, streaming for Seahawks vs. Patriots - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-is-super-bowl-2026-preview-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/cd5049b3-1d81-44b9-bc56-341add992311/thumbnail/1200x675/8ffa47bd1e4551519f085b995ad56358/levis.jpg",
    "tag": "Sports",
    "date": "2026-02-03T17:46:10.000Z",
    "description": "\n        Somehow another NFL season is almost complete and in just a few days a champion will be crowned. Super Bowl 60 will be played at Levi's Stadi",
    "body": "\n        Somehow another NFL season is almost complete and in just a few days a champion will be crowned. Super Bowl 60 will be played at Levi's Stadium in Santa Clara, California, home of the San Francisco 49ers. The big game, known as Super Bowl LX for the purists, will take place on Sunday, Feb. 8, with kickoff scheduled for 6:30 p.m. ET.Levi's Stadium officially opened in July of 2014 and has a capacity of 68,500. The stadium has hosted numerous events including WrestleMania, their highest attended event, concerts, NFL games, MLS games, College Football Playoff contests and more.The New England Patriots will represent the AFC and it will be the Seattle Seahawks representing the NFC.Super Bowl LX will be the third Super Bowl in the San Francisco Bay Area and is the second at Levi's Stadium. The Broncos are the last team to win a Super Bowl at Levi's Stadium, doing so against the Carolina Panthers in Super Bowl 50 in 2016. \nThe other NFL championship in the area was Super Bowl XIX, which took place in 1985 at Stanford Stadium in Stanford, California. That year, the 49ers defeated the Miami Dolphins, 38-16.California is about to host its 14th Super Bowl -- second to Florida's 17 -- which includes Super Bowl I in 1967. The Green Bay Packers defeated the Kansas City Chiefs, 35-10, in the game at the Los Angeles Coliseum. The most recent game in California was at SoFi Stadium in Inglewood between the Rams and Cincinnati Bengals at the end of the 2021 season. And Super Bowl LXI will return to SoFi Stadium, home of the Chargers and Rams, next season. The game, scheduled for Sunday, Feb. 14, 2027 -- Valentine's Day -- will be the latest championship ever played.\nWhere to watch 2026 Super Bowl?Date: Sunday, Feb. 8 | Time: 6:30 p.m. ETLocation: Levi's Stadium -- Santa Clara, CaliforniaTV: NBC, streaming on PeacockFollow: CBS Sports App\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where is Super Bowl 2026? Date, time, location, TV channel, streaming for Seahawks vs. Patriots - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/cd5049b3-1d81-44b9-bc56-341add992311/thumbnail/1200x675/8ffa47bd1e4551519f085b995ad56358/levis.jpg"
      ],
      "datePublished": "2026-02-03T17:46:10.000Z",
      "dateModified": "2026-02-03T17:46:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The case for the Clippers also trading Kawhi Leonard, plus possible landing spots - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/clippers-kawhi-leonard-trade-james-harden/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/24d3f558-fb23-4fe1-9630-a9abe0ad3f4d/thumbnail/1200x675/ddf6907e684eaf30742101c1b2154180/kawhi-harden-imagn.png",
    "tag": "Sports",
    "date": "2026-02-03T19:13:10.000Z",
    "description": "\n        The Los Angeles Clippers seem like they're going to trade James Harden. It hasn't happened yet, but rarely does reporting like what came out ",
    "body": "\n        The Los Angeles Clippers seem like they're going to trade James Harden. It hasn't happened yet, but rarely does reporting like what came out on Monday night pass without a deal following. ESPN reported that Harden is working with the Clippers on finding a deal. Sports Illustrated says they've had advanced conversations with the Cavaliers. One way or another, it certainly seems like this is happening.And if it does? Well, that signals one thing: the Clippers are punting on the 2025-26 season. Say they make the rumored swap for Darius Garland. Aside from being a worse player than Harden currently, Garland is currently out dealing with a toe injury. That injury has bothered him all year. It bothered him last year too. At 26 years old, he would be one of the new long-term pillars for the Clippers. They would presumably treat him with caution for the rest of this season as they chart a new course.\n        \n            \n                James Harden trade landing spots: Cavaliers have compelling offer, but what about Rockets reunion?\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nThe Clippers started the season 6-21. Harden was their only consistent positive at that point in the year. He has been one of the two pillars of their 17-5 run ever since. The other is Kawhi Leonard. So I'm going to ask a simple question: if the Clippers are trading Harden, what exactly is the point of keeping Leonard?Leonard is 34 years old. He has been, despite the absolutely bonkers decision by Western Conference coaches to leave him off of the All-Star roster, no worse than a top-10 player in the NBA over the past two months. He is also among the most injury-prone stars in NBA history. He is currently being investigated for possible salary cap circumvention. In September, Baxter Holmes reported for ESPN that one staffer said that \"they're done building around\" Kawhi after his contract expires following the 2026-27 season.\nThe motivation for keeping Leonard would, essentially, be optics. The Clippers don't want to send the Thunder an embarrassingly high lottery pick this year or next, though having ascended into the Western Conference Play-In bracket, that likely won't be an issue at least in 2026. The bottom five teams in the West (the Grizzlies, Mavericks, Jazz, Pelicans and Kings) all appear to be moving toward a tank. Perhaps keeping Leonard could make next year's team better, but nobody in this building should have illusions about contention. The Clippers are devoid of assets and waiting for cap space. If they can trade Leonard for any sort of positive value now, while he's still healthy and playing at a star level, they should probably do it. What do they really have to tangibly gain by winning a few more games next season?A Leonard trade would be an enormously complicated endeavor. He's owed $50 million this season, and he only really makes sense for win-now teams. How many teams like that have $50 million lying around to match money for him? Hanging over all of this is that impending Aspiration investigation. No team is trading for Leonard if there's any risk that his contract is voided. They would have to get assurances that the league office may not be equipped to make. Perhaps an arrangement could be made in which any draft picks traded for Leonard get returned if the Clippers are punished in that investigation. We're in uncharted waters here. The league would likely act cautiously, but we truly don't know what's going on behind the scenes.But where there's risk, there's opportunity. Players this productive are practically never available, and when they are, they're attached to an onerous contract. Sure, someone could probably go swipe Joel Embiid right now, but nobody is risking paying him through 2029. Leonard only has one guaranteed season left on his contract. Worst-case scenario, a trade goes south this year and he's a big expiring deal to be dangled at next year's deadline. The risk, at least depending on the cost of the deal, would be minimal.\nWe know what the reward looks like. The Raptors traded for Leonard on an expiring contract in 2018 and won the championship in 2019. If you can just squeeze six healthy months out of him, he is absolutely still good enough to swing the 2026 title. The question here is... for whom?Potential Leonard landing spotsWe'll start with Leonard's likely preference: the Lakers. He's made it perfectly clear he wants to be in Los Angeles, after all, and the Lakers can accommodate. There's virtually no chance the Lakers give up meaningful draft pick value for Leonard. Perhaps the Clippers could finagle a single first-round swap, but the Lakers have been planning for 2026 cap space and have thus far resisted taking on contracts that extend beyond this season at the deadline. Leonard is good enough to warrant an exception. The Lakers have $40 million in easily movable expiring salaries in Rui Hachimura, Maxi Kleber and Gabe Vincent. If the Clippers want to emphasize 2026 cap space, the Lakers can help.How about a return to the Raptors? The money is the hardest part to figure out. The Raptors would either have to give up multiple starters -- all on longer deals than the Clippers would probably prefer -- or this would have to be a severely unbalanced trade. Still, the Raptors could use more offensive punch. They've been linked to every big name under the sun this deadline cycle. If they can get Leonard, they go from plucky regular-season upstarts to genuine Finals threats.\nHow aggressive does Houston want to be at this deadline? The Rockets could pursue a reunion with Harden ... or they could swing for the better Clipper in Leonard. The Rockets have $38 million in money owed to plays out for the season in Fred VanVleet and Steven Adams. Throw in Dorian Finney-Smith and they have the contracts to reach Leonard. They also have picks to entice the Clippers if need be. VanVleet has the right to veto any trade, but he'd likely welcome a trade to the Clippers just because of all of their impending cap flexibility. They'd likely be open to a longer-term extension. Leonard once tried to recruit Durant to join him with the Clippers. Put them together on the Rockets with these athletes and defenders and they'd be a nightmare for the rest of the Western Conference. The Rockets probably need a point guard more than a shotmaker ... but man is it tempting.The Timberwolves could match money with Julius Randle, Mike Conley, Rob Dillingham and Bones Hyland, provided the Clippers want to take a look at Dillingham's upside or view Randle as a possible fit alongside Ivica Zubac and whoever they get for Garland. Good luck scoring on a team that starts Leonard, Jaden McDaniels, Rudy Gobert and Anthony Edwards, and Leonard and Edwards would form a lethal scoring duo late in games.The Pistons have been linked to Michael Porter Jr. at this year's deadline. What is Leonard if not the ultimate version of Porter? Is he not exactly the shotmaker they're looking for? Would he not slot perfectly within their ferocious defense?\nWe could frankly do this all day. Kawhi Leonard, the basketball player, fits on basically any roster. Just not the revamped one the Clippers are seemingly pivoting toward. There are a million possible complications here. His contract could squash a deal. The Clippers could get greedy on assets. The league office might step in based on whatever's happening in the Aspiration investigation. Leonard himself may squash any trade that sends him to an undesirable location.But the inevitable Harden trade makes plain what we've known for months: this era of Clippers basketball is ending. Why fight it? If there's any positive value out there for Leonard, the Clippers have no good reason not to take.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The case for the Clippers also trading Kawhi Leonard, plus possible landing spots - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/24d3f558-fb23-4fe1-9630-a9abe0ad3f4d/thumbnail/1200x675/ddf6907e684eaf30742101c1b2154180/kawhi-harden-imagn.png"
      ],
      "datePublished": "2026-02-03T19:13:10.000Z",
      "dateModified": "2026-02-03T19:13:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Pickens contract: Cowboys WR seeks mutually beneficial deal in free agency - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/george-pickens-contract-cowboys-wr-free-agency/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/8397c283-5c0e-40c6-9ba3-a99ff9e21e9a/thumbnail/1200x675/c76d089cd4044513fec9e3c19c6591a5/pickens.jpg",
    "tag": "Sports",
    "date": "2026-02-03T17:30:11.000Z",
    "description": "\n        In a twist no one saw coming, Dallas Cowboys wide receiver George Pickens established himself as the top free agent in the NFL. After the Pit",
    "body": "\n        In a twist no one saw coming, Dallas Cowboys wide receiver George Pickens established himself as the top free agent in the NFL. After the Pittsburgh Steelers traded him to Dallas last offseason, Pickens put up career numbers across the board, catching 93 passes for 1,429 yards and nine touchdowns. It earned him Second Team All-Pro honors, and his first Pro Bowl appearance as well. Pickens' 1,429 yards receiving ranked third in the NFL this season, and were the fourth-most recorded in a single season in Cowboys franchise history. Only CeeDee Lamb and Michael Irvin have recorded more receiving yards in a season. Pickens is set to cash in this offseason, but where?Pickens recently told the Cowboys' official website that he would \"love\" to remain in Dallas for years to come, but understands there are a lot of different factors when it comes to this decision. He said that the team has not reached out to him personally, and isn't sure if Jerry Jones has spoken to his agent.\"No, not me personally,\" Pickens said. \"Definitely probably my agent. He doesn't tell me who he calls all the time, so definitely just kind of wait it out and hope for the best.\"\n So what is Pickens hoping for in his new deal? The \"ultimate\" contract that can benefit both parties.\"Just the ultimate best deal when it helps everybody…\" Pickens said. \"If it's the best thing for both parties, then I'm willing to do anything. But like I said, I can't control it, so I just kind of chill.\"Spotrac predicts Pickens could sign a four-year, $122,425,436 contract that carries an AAV of $30.6 million. If we go off of the highest-paid wide receivers from 2025, that hypothetical contract would make Pickens the No. 7 highest-paid wideout in the NFL. Keep in mind that the Cowboys already have the No. 1 highest-paid quarterback in Dak Prescott, No. 3 highest-paid wide receiver in Lamb and the highest-paid offensive guard in Tyler Smith. \nPrescott has called striking a deal with Pickens \"vital,\" while Jones has expressed a desire to keep Pickens as well. After failing to extend Micah Parsons last year, all eyes will be on the Cowboys' front office when it comes to this notable contract situation.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Pickens contract: Cowboys WR seeks mutually beneficial deal in free agency - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/8397c283-5c0e-40c6-9ba3-a99ff9e21e9a/thumbnail/1200x675/c76d089cd4044513fec9e3c19c6591a5/pickens.jpg"
      ],
      "datePublished": "2026-02-03T17:30:11.000Z",
      "dateModified": "2026-02-03T17:30:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mountain West extends CBS Sports partnership as part of new media rights package - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/mountain-west-conference-media-rights-deal-cbs-sports/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/03/6700bbc1-15be-4a9d-9b5b-50ff0796a8c7/thumbnail/1200x675/0bf7eb834fbd24c48f72b37dd4812c1c/mountain-west.png",
    "tag": "Sports",
    "date": "2026-02-03T18:44:08.000Z",
    "description": "\n        The Mountain West Conference has agreed to a new media rights agreement with CBS Sports that will extend through the 2031-32 season. The leag",
    "body": "\n        The Mountain West Conference has agreed to a new media rights agreement with CBS Sports that will extend through the 2031-32 season. The league will also have six-year partnerships with FOX Sports and Kiswe, along with a five-year agreement with the CW Network. The conference's agreement with CBS Sports guarantees the league 15 regular-season Mountain West football games will be broadcast across CBS platforms, including CBS, CBS Sports Network and streaming on Paramount+ Premium. Additionally, 18 Mountain West men's basketball games will appear on CBS Sports Network, along with the the MW men's basketball tournament. The championship game will be broadcast on CBS. Additionally, at least two regular-season women's basketball games will also appear on CBS Sports Network, along with the women's basketball conference title game. \"The Mountain West has been a valued partner for more than two decades, and we're proud that CBS Sports will continue to showcase the conference's marquee games across our platforms, including the MW Basketball Championships,\" said Dan Weinberg, executive vice president of programming at CBS Sports. \"This new agreement further elevates our multiplatform college football portfolio and adds even more depth to our robust college basketball lineup.\" \nCBS Sports has been home to the Mountain West for more than 20 years. CBS Sports Network will get top selection of football and both men's and women's basketball. \"By extending our partnerships across broadcast, cable, and streaming, this agreement elevates the Mountain West's national profile while ensuring long-term stability,\" MWC commissioner Gloria Nevarez said in a statement. \"We're grateful for the opportunity to continue to work with trusted partners CBS and FOX and are eager to begin our new affiliations with The CW and Kiswe.\"The partnership with streaming company Kiswe is a new addition to the league. The Mountain West will launch a direct-to-consumer app and streaming service through Kiswe to broadcast all 21 sports the conference offers that otherwise are not part of the league's television contracts. \nThe new media rights package comes as the league undergoes a major membership shift in 2026. Longtime members Boise Sate, Fresno State, Colorado State, San Diego State and Utah State are set to depart for the Pac-12. In their place, the league will add UTEP, transition UC Davis up from FCS and add Hawaii as a full member. Northern Illinois will also participate as a football-only member. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mountain West extends CBS Sports partnership as part of new media rights package - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/03/6700bbc1-15be-4a9d-9b5b-50ff0796a8c7/thumbnail/1200x675/0bf7eb834fbd24c48f72b37dd4812c1c/mountain-west.png"
      ],
      "datePublished": "2026-02-03T18:44:08.000Z",
      "dateModified": "2026-02-03T18:44:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB prospect rankings: Evaluating the best and worst farm systems - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-prospect-ranking-best-worst-farm-systems/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/11/cadea207-4884-427b-a480-fa80fd8b8163/thumbnail/1200x675/cfcc7bf98c38dabc436a4d35c48b919d/hope-getty.png",
    "tag": "Sports",
    "date": "2026-02-03T17:15:15.000Z",
    "description": "\n        Earlier this week, we here at CBS Sports published our ranking of the 100 best prospects in Major League Baseball. That exercise was focused ",
    "body": "\n        Earlier this week, we here at CBS Sports published our ranking of the 100 best prospects in Major League Baseball. That exercise was focused on the individual, on which players look positioned to have the most promising careers. Today, we want to approach minor-league prospects from a different angle by asking which organizations have the best and worst farm systems. Mind you, this is a subjective matter. Some people will argue that the organizations with the top overall prospects are the best, regardless of how the rest of their coffers stack up. Others will put forth the idea that depth matters, especially quality depth. We tend to fall in between. High-end quality is tough to beat, but there's something to be said about a team that has an overwhelming number of top 100 prospects.\n        \n            \n                Ranking the top 100 MLB prospects: Kevin McGonigle, Jesús Made, Konnor Griffin lead top young talent\n                \n                    R.J. Anderson                \n            \n                            \n    \n                \n                    \n    \nBelow, then, you'll find our ranking of the three best and worst farm systems in the sport. Player development is an ongoing dynamic. The rankings you see below will probably be out of date in a matter of weeks as players report to camp and show off newfound strength or altered swings and arsenals. That's life for you. Take this for what it is, a snapshot in time, and you'll save yourself some stress. The best\n                            \n    \n                                                \n                    \n    1. Los Angeles DodgersBecause the Dodgers needed to be the best at something else, right? Realistically, they might have the most impressive player development machine in the sport's history. They never make \"sell\" trades or pick high in the draft -- their luxury tax status often means their first pick is 10 spots lower than it would be otherwise -- and yet they reliably turn out good players. Executives with other teams have pointed to the Dodgers' staff size and their ability to individualize development plans for each player (as opposed to relying on a one-for-all approach) as keys to their success in this area. Anyway, their current crop includes both high-end quality (outfielders Josue De Paula, Eduardo Quintero, and Zyhir Hope) and an impressive amount of depth. There's no reason to think they're going away. \n                            \n    \n                                                \n                    \n    2. Seattle MarinersThe Mariners had the most top-100 prospects, with seven of their players making the cut. They're second in these rankings because the Dodgers have a slight edge in top-end quality. That isn't a knock on Seattle's farm. Infielder Colt Emerson is a promising lefty bat who could stick at shortstop and the Mariners have a stable of quality arms en route to Seattle (Kade Anderson, Ryan Sloan, and Jurrangelo Cijntje) -- a testament to their status as one of the best teams in the majors when it comes to pitching development. Factor in a few boom-or-bust types, like outfielders Lazaro Montes and Jonny Farmelo, and this is an impressive group on the whole.\n                            \n    \n                                                \n                    \n    3. Milwaukee Brewers\nThere were a number of other compelling teams who could've slotted in here, including the Pittsburgh Pirates, Cleveland Guardians, and New York Mets. I went with the Brewers because they have both a good amount of depth and a couple of infielders with sky-high ceilings -- Jesús Made might be the No. 1 prospect by this time next year and Luis Peña could continue his climb as well. Infielder/outfielder Jett Williams, right-hander Logan Henderson, and catcher Jeferson Quero also made the top 100, giving Milwaukee five in total. That's without accounting for near-misses -- think infielder Cooper Pratt and right-handers Bishop Letson and Brandon Sproat, among others.The worst\n                            \n    \n                                                \n                    \n    1. Houston AstrosThe Astros were the only team without a top-100 entrant. They've arrived at this position honestly, having spent most of the past decade making win-now trades or picking later in the draft. (To wit, earlier this winter they dealt arguably their two best prospects, outfielder Jacob Melton and right-hander Anderson Brito, to land fellow righty Mike Burrows from the Pirates.) The Astros, to their credit, have shown a real capacity for unearthing contributors at the pro level. This ranking indicates that they'll have to continue to do that in order to provide their big-league team with depth.\n                            \n    \n                                                \n                    \n    2. Colorado RockiesThe Rockies had two players make the top 100, but each ranked lower than you'd expect for someone drafted in the top five over the last two years. First baseman Charlie Condon has disappointed since draft night, while shortstop/third baseman Ethan Holliday has a lot of questions left to answer about his game and whether his swing-and-miss tendencies will undercut his power and patience. The Rockies now have a new brain trust in place and it's worth giving them a chance to overhaul the player development department. This ranking suggests that's overdue. \n                            \n    \n                                                \n                    \n    3. Kansas City Royals\nA few teams had just one player on the top 100 list. The Royals were among those, and they happened to have the lowest ranked individual of the group. Logic, then, dictates they get this spot. The Royals do have some promising arms on their farm system that could lift their standing -- think Kendry Chourio and David Shields. Plus, they've spent the past few years graduating players to the majors, with outfielder Jac Caglianone and lefty Noah Cameron as the most notable in 2025.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB prospect rankings: Evaluating the best and worst farm systems - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/11/cadea207-4884-427b-a480-fa80fd8b8163/thumbnail/1200x675/cfcc7bf98c38dabc436a4d35c48b919d/hope-getty.png"
      ],
      "datePublished": "2026-02-03T17:15:15.000Z",
      "dateModified": "2026-02-03T17:15:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]