[
  {
    "title": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/suns-mavericks-odds-prediction-time-spread-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:12:03.000Z",
    "description": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in th",
    "body": "\n        A Western Conference showdown on Tuesday's NBA schedule has the Phoenix Suns hosting the Dallas Mavericks. The Suns (31-22) are seventh in the conference and coming off back-to-back losses, including a 109-103 defeat to Philadelphia on Saturday. The Mavs (19-33) are the No. 11 seed and have lost each of their last seven games, most recently falling, 138-125, to San Antonio on Feb. 7. Klay Thompson (rest) is listed as questionable for Dallas.Tipoff is at 9 p.m. ET from Mortgage Matchup Center in Phoenix. The Suns have won four of the last five matchups, including the lone meeting earlier this season. The latest Mavericks vs. Suns odds list Phoenix as the 8.5-point favorite, with the over/under at 227.5. Before making any Suns vs. Mavericks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Mavericks vs. Suns 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Suns vs. Mavs:Mavericks vs. Suns   spread                                                                     Suns -8.5 at DraftKingsMavericks vs. Suns   over/under:    227.5 pointsMavericks vs. Suns  money line:    Suns -309, Mavericks +246Mavericks vs. Suns   picks: See picks at SportsLineMavericks vs. Suns   streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make Suns vs. Mavericks picksSportsLine's model has simulated Mavs vs. Suns 10,000 times and is going Over on the total (227.5 points). These teams have met twice since the start of 2025, with both contests eclipsing the total. Each of the last two Mavs games have also gone over, and the team is coming off allowing 138 points in its last contest, which is the most Dallas has given up in a non-overtime game all season.With those defensive struggles for Dallas, the Suns are projected to score 7 points more than their season average. Even with that, the Mavericks are forecasted to have more double-digit scorers (six) than Phoenix (five). The model calls for the total to be surpassed with points to spare, with the Over hitting in 51% of simulations.It also says one side of the spread hits over 60% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Suns vs. Mavs, and which side of the spread hits over 60% of the time? Visit SportsLine now to see which side of the Mavericks vs. Suns spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suns vs. Mavericks prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/6a2060c8-a8c4-4014-9559-4cdf31acdfaf/thumbnail/1200x675/79cd80d260241eae5b28836c49e89d50/cooper-flagg-dallas-mavericks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-11T01:12:03.000Z",
      "dateModified": "2026-02-11T01:12:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-to-get-150-bonus-bets-clippers-rockets-nebraska-purdue-tuesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:59:07.000Z",
    "description": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bet",
    "body": "\n        All eyes will be on No. 7 Nebraska vs. No. 13 Purdue on Tuesday, and the latest bet365 bonus code CBSBET365 gives new users $150 in bonus bets after placing a first wager of $5 or more. The Cornhuskers and Boilermakers rely on their perimeter shooting, so SportsLine's proven computer model is taking the Over (147.5) in that game. According to the latest college basketball odds, Nebraska is favored by 1.5 points at home. It also likes Iowa State (-6.5) to cover against TCU, along with the Over (209.5) in Rockets vs. Clippers in its NBA best bets. Claim the latest bet365 bonus code CBSSPORTS here:Check out our bet365 bonus code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns. Bet games at bet365 here:Tuesday's top picks, best betsNebraska vs. Purdue: Over 147.5 (-119)Iowa State (-6.5) vs. TCURockets vs. Clippers: Over 209.5 Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +712 (risk $100 to win $712). Bet it at bet365 here:Over 147.5 in Nebraska vs. Purdue\nPurdue avoided an upset loss against Oregon on Saturday when Fletcher Loyer hit a clutch 3-pointer with less than one minute remaining, and he is 10 of 14 from 3-point range over his last two games. The Boilermakers are shooting nearly 40% from downtown this season, while Nebraska takes more than half of its shots from the perimeter. Nebraska junior Pryce Sandfort leads the Big Ten with 80 3-pointers, shooting 40.6% from distance. The model has these teams combining for 156 points, as the Over hits in 74% of simulations. Back the Over at bet365 here:Iowa State -6.5 vs. TCUTCU has struggled against the top teams on its schedule this season, going just 3-6 against Quad 1 opponents. The Horned Frogs recently lost to then-No. 10 Houston by nine points at home before getting crushed by unranked Colorado in an 87-61 final on Feb. 1. Iowa State is riding a five-game winning streak, with four of those wins coming by 13-plus points. The Cyclones have won and covered the spread in six straight head-to-head meetings between these teams, and the model has them covering 66% of the time on Tuesday night. Back Iowa State at bet365 here:Over 209.5 in Rockets vs. ClippersThe Rockets and Clippers have gone Over the total in five straight meetings, and the over/under was 219.5 when they met on Dec. 23. They combined for 236 points in that contest, shooting a combined 29 of 67 from 3-point range. The Clippers have gone Over in four of their last six games, and their last four games have featured totals of 219 or higher. The model thinks this total is too low, as it projects 222 points to help the Over cash 68% of the time. Back the Over at bet365 here:\nLooking for more NBA and college basketball picks?You've seen the model's best bets for Tuesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365 to get $150 bonus bets by targeting Clippers-Rockets, Nebraska-Purdue Tuesday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/7c8359f9-8d44-474c-ab39-8ae2b0376576/thumbnail/1200x675/d504408eb61e4162451338c431e07e97/bet365-150-promo-1.jpg"
      ],
      "datePublished": "2026-02-10T21:59:07.000Z",
      "dateModified": "2026-02-10T21:59:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-pacers-odds-prediction-spread-time-2026-nba-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:24:41.000Z",
    "description": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The P",
    "body": "\n        It'll be worst vs. nearly first in the NBA Eastern Conference when the Indiana Pacers travel to take on the New York Knicks on Tuesday. The Pacers are at the bottom of the East with a 13-40 mark overall, while New York is second in the conference at 35-19. The Knicks have won nine of their last 10. Indiana has dropped four straight as it has primarily set its focus on the future. Tipoff is set for 7:30 p.m. ET at Madison Square Garden. New York is an 11.5-point favorite in the latest Knicks vs. Pacers odds, while the over/under is 225.5. Before making any Pacers vs. Knicks picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters the week before the NBA All-Star break on a sizzling 38-17 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Knicks vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Knicks: Knicks vs. Pacers spread                                                                     Knicks -11.5Knicks vs. Pacers over/under:    225.5 pointsKnicks vs. Pacers money line:    Knicks -588, Pacers +428Knicks vs. Pacers picks: See picks at SportsLineKnicks vs. Pacers streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Pacers vs. Knicks picksSportsLine's model has simulated Knicks vs. Pacers 10,000 times and is going Over on the total (225.5 points). New York won 114-113 when these teams met in December, and the Over hit in that matchup.This time around, the model is projecting Pascal Siakam to lead the Pacers with 21.6 points, while Jalen Brunson paces New York with 26.7 points in the simulations. The teams combine for 229 points as the Over hits 51% of the time. The model also says one side of the spread hits nearly 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Pacers, and which side of the spread hits nearly 70% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Pacers prediction, odds, line, time: 2026 NBA picks for Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/06/cb1b312a-3850-45e3-ac2f-7960f4b3b0e0/thumbnail/1200x675/200ea92871b663ee378700e51204b859/jalen-brunson-new-york-knicks-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:24:41.000Z",
      "dateModified": "2026-02-10T21:24:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Purdue vs. Nebraska prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/purdue-nebraska-odds-prediction-spread-time-2026-college-basketball-picks-tuesday-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/06/ddfa900a-2926-4a27-97fc-81ba4be974f8/thumbnail/1200x675/f23498d9970c0476c5f2a0e86d709820/braden-smith-purdue-boilermakers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:14:43.000Z",
    "description": "\n        The 12th-ranked Purdue Boilermakers battle the ninth-ranked Nebraska Cornhuskers in a key Big Ten matchup on Tuesday night. Purdue is coming ",
    "body": "\n        The 12th-ranked Purdue Boilermakers battle the ninth-ranked Nebraska Cornhuskers in a key Big Ten matchup on Tuesday night. Purdue is coming off a 68-64 win over Oregon on Saturday, while Nebraska defeated Rutgers 80-68 that same day. The Boilermakers (19-4), who are 3-2 against ranked opponents this season, are 5-2 on the road. The Cornhuskers (21-2), who are 2-2 against ranked foes, are 12-1 on their home court.Tipoff from Pinnacle Bank Arena in Lincoln, Neb., is set for 7 p.m. ET. Purdue leads the all-time series 21-7. Nebraska is a 1.5-point favorite in the latest Purdue vs. Nebraska odds from DraftKings Sportsbook, while the over/under for total points scored is 147.5. Before making any Nebraska vs. Purdue picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 15 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on an 11-5 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.\nNow, the model has simulated Purdue vs. Nebraska 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Nebraska vs. Purdue:Purdue vs. Nebraska                 spread:    Nebraska -1.5 at DraftKings SportsbookPurdue vs. Nebraska                                                                                                                                                                                               over/under:    147.5 pointsPurdue vs. Nebraska                                                                         money line:    Nebraska -114, Purdue -106Purdue vs. Nebraska                                                                                                                                                                                                                            picks:    See picks at SportsLinePurdue vs. Nebraska                                                                                                                                                                                                                             streaming:Fubo (Try for free)  New users can also target the latest Underdog promo code, good for $75 in fantasy bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.How to make Purdue vs. Nebraska picksSportsLine's model is going Over on the total (147.5 points). The Over has hit in five of the last nine head-to-head meetings between the schools. The Over has also hit in two of the last four Purdue games, and in the last Nebraska game. The model projects the Boilermakers to have four players score 12.1 points or more, including Braden Smith's projected 15.9 points. The Cornhuskers, meanwhile, are projected to have five players score 11.9 or more points, led by Ugnius Jarusevicius, who is projected to score 17.8 points. The Over clears in well over 70% of simulations. The model also says one side of the spread hits more than 50% of the time. You can only see that pick at SportsLine.So who wins Purdue vs. Nebraska, and which side of the spread hits over 50% of the time? Visit SportsLine now to see which side of the Purdue vs. Nebraska spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Purdue vs. Nebraska prediction, odds, spread, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/06/ddfa900a-2926-4a27-97fc-81ba4be974f8/thumbnail/1200x675/f23498d9970c0476c5f2a0e86d709820/braden-smith-purdue-boilermakers-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:14:43.000Z",
      "dateModified": "2026-02-10T21:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Where to watch Chloe Kim go for gold on Wednesday, Feb. 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-schedule-where-to-watch/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/69c0f92d-66f5-4b55-b971-5d0c3aae7009/thumbnail/1200x675/b8d84157edd88df72dfd9a8818ac3a91/untitled-design-2026-02-10t160342-316.png",
    "tag": "Sports",
    "date": "2026-02-11T00:13:05.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics are in full swing and eve",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The 2026 Winter Olympics are in full swing and every day brings exciting competition and thrilling medal events. Wednesday marks Day 5 of the Milan Cortina Games, and the competition thus far has not lacked for drama.Chloe Kim is chasing history, looking to be the first halfpipe snowboarder to three-peat. She was the youngest woman to win an Olympic snowboard medal at 17 at the 2018 PyeongChang Games and won again in Beijing in 2022. Dealing with a torn labrum, she will compete with 23 others on Wednesday in the halfpipe qualifying rounds for a spot in Thursday's medal event.Over on the ice, Madison Chock and Evan Bates will have a crucial day ahead of them, as they compete for a medal in ice dance, possibly at their last Olympics. Chock and Bates earned gold in team events at the 2022 Beijing Games and in these games and the married couple, representing the United States, are looking to add a free dance medal to their extensive trophy shelf.\nWednesday will also begin the men's ice hockey competition, however, Team USA doesn't skate until Thursday with a 3:10 p.m. ET game against Latvia.The Milan Cortina Games will run through Sunday, Feb. 22, and in total of 119 events will take place with 245 medals handed out to the athletes. Fans can find the action on NBC and their streaming service Peacock, with an account or a cable login.\nThe Winter Games have eight main sports, with 16 disciplines. With so many events to keep up with, it can get overwhelming, but that's where we step in with the overall medal tracker and daily schedule.Winter Olympics schedule for Wednesday, Feb. 11SportEvent(s)TimeMedal event?Nordic CombinedNormal Hill Jump & 10 km Cross-Country4 a.m. & 7:45 a.m.YesSnowboardingWomen's Halfpipe Qualification Runs 1 & 24:30 a.m.NoFreestyle SkiingWomen's Moguls Qualification 25 a.m.NoAlpine SkiingMen's Super-G5:30 a.m.YesSkeletonMen Official Training Heats 5 & 66:30 a.m.NoBiathlonWomen's 15km Individual8:15 a.m.YesFreestyle SkiingWomen's Moguls Final 1 & 28:15 a.m.YesIce HockeyMen's Preliminary, Slovakia vs. Finland10:40 a.m.NoLugeMen's and Women's Double's Runs 1 & 211 a.m. - 1:44 p.m.YesSpeed SkatingMen's 1000m12:30 p.m.YesCurlingMen's Round Robin, United States vs. Czech Republic1:05 p.m.NoSnowboardingMen's Halfpipe Qualification Runs 1 & 21:30 p.m.NoFigure SkatingIce Dance -- Free Dance1:30 p.m. - 5:05 p.m.YesIce HockeyMen's Preliminary, Sweden vs. Italy3:10 p.m.No \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Where to watch Chloe Kim go for gold on Wednesday, Feb. 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/69c0f92d-66f5-4b55-b971-5d0c3aae7009/thumbnail/1200x675/b8d84157edd88df72dfd9a8818ac3a91/untitled-design-2026-02-10t160342-316.png"
      ],
      "datePublished": "2026-02-11T00:13:05.000Z",
      "dateModified": "2026-02-11T00:13:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/olympics/news/2026-winter-olympics-norway-norweigan-biathlete-interview/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:52:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after wi",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Olympians are often overcome with emotion after winning a medal at the Games, but it's typically tears of joy, not sadness, that accompany the highlight of their athletic lives. However, after winning bronze in the men's 20km biathlon, Norwegian skiier Sturla Holm Lægreid broke down for a much different reason. In an interview with the Norwegian Broadcasting Corporation, he confessed to cheating on his now ex-girlfriend and pleaded with her to take him back. \n\"I told her a week ago. And it's been the worst week of my life,\" Lægreid said, via NBC. \"I had a gold medal in life, and there's probably a lot of people out there who look at me differently now, but I only have eyes for her. Sports has taken a bit of a back seat these past couple of days. Yeah, I wish I could share this with her.\"\nLægreid's partner broke up with him after he informed her he'd been unfaithful, but hoped his public confession and act of contrition would convince her to take him back. \"I'm not ready to give up. I hope that committing social suicide might show her how much I love her,\" Lægreid said. \"I accept the consequences of what I've done. I regret it with all my heart. Maybe I'm dumb as a rock. I'm a member of Mensa, but I still do stupid stuff.\"\nHe added that he wanted to \"put it all on the table\" in hopes she might take him back, although this plan could backfire spectacularly as not everyone would take kindly to this kind of admission and airing of laundry on a national (and now international, after the interview went viral) scale. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Norwegian skiier breaks down, admits to cheating in bizarre interview - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/43f25ed3-f7d2-473c-add7-d83b855bc68c/thumbnail/1200x675/f8f12db62711ffe2ad38eae81673d494/skiier.jpg"
      ],
      "datePublished": "2026-02-10T21:52:46.000Z",
      "dateModified": "2026-02-10T21:52:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Carolina vs. Miami prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/north-carolina-miami-odds-prediction-time-2026-college-basketball-picks-february-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/f6ae2cde-9d71-4b01-9b98-e85a7d817a5f/thumbnail/1200x675/8b06aeda33a8d7b89010d2993154afff/caleb-wilson-north-carolina-tar-heels-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:05:31.000Z",
    "description": "\n        ACC squads with matching conference records will collide on Tuesday's college basketball schedule as the North Carolina Tar Heels visit the M",
    "body": "\n        ACC squads with matching conference records will collide on Tuesday's college basketball schedule as the North Carolina Tar Heels visit the Miami Hurricanes. No. 11 UNC (19-4, 7-3 ACC) is on a five-game win streak, with the most recent of those being when it knocked off Duke, 71-68, on a last-second shot on Saturday. Miami (18-5, 7-3 ACC) has won three of its last four and is coming off a Saturday victory over Boston College, 74-68. The Tar Heels are 25-10, all-time, versus the Canes.Tipoff is at 7 p.m. ET from the Watsco Center in Coral Gables, Fla. The Tar Heels are 1.5-point favorites per the latest Miami vs. North Carolina odds from DraftKings Sportsbook, while the over/under for total points scored is 156.5. Before making any North Carolina vs. Miami picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 15 on a sizzling 11-1 run on its top-rated over/under college basketball picks dating back to last season, and is on an 11-5 run on top-rated CBB side picks. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns.Now, the model has simulated Miami vs. North Carolina 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for North Carolina vs. Miami:\nMiami vs. North Carolina                                                                                                                                                                 spread:    UNC -1.5 at DraftKings SportsbookMiami vs. North Carolina                                                                                                                                                 over/under:    156.5 pointsMiami vs. North Carolina                          money line:    UNC -117, Miami -102Miami vs. North Carolina                                                                                                                                                                               picks:    See picks at SportsLineMiami vs. North Carolina                                                                                                                                                                               streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $150 in bonus bets after placing a $5 bet:How to make North Carolina vs. Miami picksSportsLine's model has simulated Miami vs. North Carolina 10,000 times and is going Over on the total (156.5 points). These teams have trended to the Over recently with four straight Miami games clearing the total, and eight of the past nine UNC games also going Over. This time around the model is projecting 158 combined points as the Over hits more than 50% of the time.The model also says one side of the spread hits 60% of the time. You can only see that pick at SportsLine.\nSo who wins Miami vs. UNC, and which side of the spread hits 60% of the time? Visit SportsLine now to see which side of the UNC vs. Miami spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Carolina vs. Miami prediction, odds, time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/f6ae2cde-9d71-4b01-9b98-e85a7d817a5f/thumbnail/1200x675/8b06aeda33a8d7b89010d2993154afff/caleb-wilson-north-carolina-tar-heels-imagn-images.jpg"
      ],
      "datePublished": "2026-02-10T21:05:31.000Z",
      "dateModified": "2026-02-10T21:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Holy hoops! Villanova and Notre Dame finalizing plans to tip 2026-27 college basketball season in Rome, Italy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/villanova-notre-dame-2026-27-college-basketball-season-rome-italy/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/fff549e8-9d61-427c-9eb2-9beab14c4b22/thumbnail/1200x675/90e0adc535922f4100c30fa2e04b036f/novapopend.jpg",
    "tag": "Sports",
    "date": "2026-02-11T01:34:19.000Z",
    "description": "\n        Villanova and Notre Dame are in the final stages of solidifying a monumental scheduling sacrament to begin the 2026-27 college basketball sea",
    "body": "\n        Villanova and Notre Dame are in the final stages of solidifying a monumental scheduling sacrament to begin the 2026-27 college basketball season. The Wildcats and Fighting Irish's men's and women's basketball teams have been given special clearance by the NCAA to open next season in Rome for a doubleheader on Sunday, Nov. 1, sources told CBS Sports. College basketball's official start to the season is Monday, Nov. 2, but the NCAA quietly approved a waiver in January to allow the teams a one-day head start, given the historic precedent of the games.The motivation for the overseas twinbill happens to be one of the most famous people on the planet: Pope Leo XIV.The two universities are prominent private Catholic schools with connections to the Pope. For Villanova, an obvious one: Robert Francis Prevost is a 1977 alumnus. The Notre Dame piece is tied to the school's massive global brand. Notre Dame is regarded as the most prominent Catholic institution of higher learning in the world. It also has an outpost in Rome. An avowed sports fan, the Pope also grew up in Chicago, which has a significant Notre Dame fan presence given its proximity to nearby South Bend, Indiana. (Soon after Prevost was named the most powerful man in the Catholic Church, online detectives went back and found he appeared on television during the White Sox's 2005 World Series run.)\nNotre Dame's women's program is a powerhouse with two national titles and nine Final Fours. Since 2020, Niele Ivey has been the coach. Villanova owns three national titles in men's basketball and has made the Final Four seven times, most recently in 2022 under Jay Wright. It's now coached by Kevin Willard.Villanova and Notre Dame worked in concert on arranging the game for months, sources said, with talks seriously materializing in the early fall. Paperwork has not been finalized, but both schools are moving forward with the expectation that one of college basketball's most ambitious scheduling ideas in recent memory will transpire on the first day of November.Fox is on board to broadcast both games, per sources, with the doubleheader scheduled to play out in the afternoon in Rome. That means breakfast-time basketball in the United States. While final details are still being worked through, the general plan is to have Villanova-Notre Dame lead into NFL coverage on Fox in the United States on that Sunday. The women's game is planned to air afterward on Fox Sports 1. \nStarting a season in a foreign country isn't unprecedented: Women's college basketball opened this past season in Paris with Duke playing Baylor. On the men's side, Villanova and Notre Dame is believed to be the first season-opener on foreign soil and the first regular season Division I basketball competition in Italy.The teams will play the doubleheader at the Palazzetto dello Sport, known more colloquially as the PalaTiziano. The arena seats 3,500 people for basketball games and has existed since the late 1950s. It was built in the lead-up to Rome's hosting of the 1960 Olympics. The PalaTiziano underwent significant renovations from 2018-2023 and is approximately 30 minutes from the Pope's residence in Vatican City. The Pope's involvement in the event — if any — is unclear and very much to be determined, according to sources, though officials from both schools have been in contact with the Pope and people around the Holy See. Notre Dame's president and others had a private meeting with the Supreme Pontiff in November, while Villanova had officials fly to the Vatican last May to see Pope Leo's inaugural mass. Villanova's president, Rev. Peter M. Donohue, was not in the same class as Prevost in the 1970s, but the two did overlap as undergrads at VU.\nThe schools intend to make the trip not just about basketball, but a huge educational experience as well. Rome, which surrounds Vatican City, is a destination for millions of devout Catholics and tourists every year. And come November, should all go to plan, it will play host to a global American sporting event.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Holy hoops! Villanova and Notre Dame finalizing plans to tip 2026-27 college basketball season in Rome, Italy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/fff549e8-9d61-427c-9eb2-9beab14c4b22/thumbnail/1200x675/90e0adc535922f4100c30fa2e04b036f/novapopend.jpg"
      ],
      "datePublished": "2026-02-11T01:34:19.000Z",
      "dateModified": "2026-02-11T01:34:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Justin Thomas injury update: Cleared to resume golf activity while eyeing return - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/justin-thomas-injury-update-back-pga-tour-return/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/15/00feb83c-91ed-48a0-ac4a-919640d396c6/thumbnail/1200x675/8f296f147d23e7730d0ad74aa6c3d97a/justin-thomas-imagn.jpg",
    "tag": "Sports",
    "date": "2026-02-10T23:57:32.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Justin Thomas has been cleared to resume all golf ",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Justin Thomas has been cleared to resume all golf activity, the two-time major champion announced on Tuesday via social media. Thomas is eying the Florida Swing as possible timing for a PGA Tour return after undergoing a microdiscectomy in the middle of November 2025, just a few weeks after competing for the U.S. Ryder Cup team at Bethpage Black.\"After some follow-up imaging and meeting with my Dr and team, I'm officially cleared for all golf activity,\" Thomas wrote on Instagram. \"It feels great to be swinging freely again and getting some reps in on the course. I'm working hard to build up my strength and stamina to get back into golf shape before competing on the PGA Tour. Can't wait to get out there with the guys!\"Thomas' last PGA Tour start came at the 2025 Procore Championship, a FedEx Cup Fall event utilized by Ryder Cup captain Keegan Bradley to sharpen up his team before it competed against the Europeans.\nThe 16-time PGA Tour winner is coming off a 2025 season in which he broke a winless drought that stretched back to the 2022 PGA Championship. Thomas defeated Andrew Novak in a playoff at the RBC Heritage to claim the signature event one week after the Masters. He is currently ranked No. 12 in the Official World Golf Rankings.\"Recovery has gone well,\" Thomas shared on X in January. \"I'm slowly building back my strength and conditioning in the gym, and also hitting wedges/short irons. Little victories and patience have been the biggest part of the process. Taking it slow and listening to how I'm feeling each day!\n\"I'm looking to come back competitively at some point during the Florida swing. I know how important it is to get this injury behind me so that I'm only looking forward over the course of the season.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Justin Thomas injury update: Cleared to resume golf activity while eyeing return - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/07/15/00feb83c-91ed-48a0-ac4a-919640d396c6/thumbnail/1200x675/8f296f147d23e7730d0ad74aa6c3d97a/justin-thomas-imagn.jpg"
      ],
      "datePublished": "2026-02-10T23:57:32.000Z",
      "dateModified": "2026-02-10T23:57:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James' 21-season All-NBA streak officially ends, and his mark will probably never be broken - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lebron-james-all-nba-streak-ends-lakers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/74c05335-a85b-44b7-8052-a65592c173a9/thumbnail/1200x675/b5105e64a1844208f507b99447198216/lebron-getty-20.png",
    "tag": "Sports",
    "date": "2026-02-10T22:20:04.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        LeBron James will miss out on making an All-NBA te",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        LeBron James will miss out on making an All-NBA team for the first time since his rookie year, snapping a streak of 21 straight seasons with the Lakers superstar on an All-NBA team. James will miss his 18th game of the season on Tuesday night against the Spurs, as the 41-year-old will not play in a back-to-back due to left foot arthritis. That 18th absence for James, who didn't make his season debut until Nov. 18, means he cannot reach the NBA's 65-game minimum for awards and All-NBA voting consideration. While it would've been questionable whether James would make it this year on merit based on his current production -- 21.8 points, 6.9 assists and 5.7 rebounds per game -- his regular absences in his 23rd season will prevent even a strong second half of the season from getting him into the conversation. His 21-year All-NBA streak seems like it'll stand the test of time for a variety of reasons. For one, it's rare to have a player reach All-NBA status as quickly as James did in his career, making his first All-NBA team as a second-year player. It's even more rare for a player to remain at that level deep into their 30s, much less as a 40-year-old as James did last year. \n\n        \n            \n                LeBron James offers blunt assessment of Lakers after loss to Thunder: 'That's a championship team, we're not'\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nThe closest streak to James all-time is Kobe Bryant with 15 straight All-NBA nods, offering a good representation of how incredible LeBron's run has been. No one has ever sniffed the 20-year mark in NBA history, and it'll only get more difficult going forward. Beyond the requirement of consistent greatness for more than two decades, the same 65-game threshold that officially ended any hopes James had at a 22nd All-NBA selection makes it even more difficult for stars to maintain streaks of their own. Giannis Antetokounmpo has the longest active streak with nine straight selections, but he will also miss out this season due to too many games missed. Nikola Jokić is next with seven straight All-NBA appearances, but is also perilously close to being ineligible for voting this year after missing 16 games already this season. \nLongest All-NBA streaksPlayerSeasonsDatesLeBron James212005-2025Kobe Bryant151999-2013Karl Malone141988-2001Tim Duncan131998-2010Shaquille O'Neal131994-2006Between the rules governing eligibility and the amount of talent across the league, it's difficult to see anyone coming close to matching James' mark. Records, as they say, are meant to be broken, but it would take a truly unbelievable career for anyone to top James' All-NBA streak. That officially comes to an end and is the latest reminder that the end of the James era is nearly upon us. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James' 21-season All-NBA streak officially ends, and his mark will probably never be broken - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/74c05335-a85b-44b7-8052-a65592c173a9/thumbnail/1200x675/b5105e64a1844208f507b99447198216/lebron-getty-20.png"
      ],
      "datePublished": "2026-02-10T22:20:04.000Z",
      "dateModified": "2026-02-10T22:20:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tottenham fire Frank: Spurs axe manager after two wins in 17 PL matches - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/tottenham-fire-thomas-frank-spurs-two-wins-17-premier-league-matches/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/11/c26d8a90-0913-49c3-ad1d-9629726f7725/thumbnail/1200x675/b70586504f490029dbb75bf4c536ae10/untitled-design-2026-02-11t113948-981.png",
    "tag": "Sports",
    "date": "2026-02-11T11:59:42.000Z",
    "description": "\n        Tottenham have sacked their coach Thomas Frank after a disappointing half season. The English team is currently sitting in 14th place in the ",
    "body": "\n        Tottenham have sacked their coach Thomas Frank after a disappointing half season. The English team is currently sitting in 14th place in the Premier League standings only five points above the relegation zone and with only two wins in their last 17 games played in the domestic league. Despite a positive Champions League spell, where Spurs ended up in the top eight and advanced to the Round of 16 of the tournament, the club decided to sack the manager who was appointed in the summer 2025 to replace Ange Postecoglou. Last season Tottenham ended up in the 17th place in the Premier League, but at the same time managed to win the UEFA Europa League, beating Manchester United in the final, and despite the summer signings and the managerial change things haven't improved. Get ready for the Knockout Stage like never before with the UEFA Champions League Bracket Games! Create a pool to compete against friends or enter our Bracket Challenge for a chance to win a dream trip to London, including 2 UCL tickets and a tour of the UCL Today set! Plus, see how you stack up against UCL Today's own Jamie and Micah. Sign up now before brackets are unlocked after the Round of 16 Draw, or play on the CBS Sports App!On Wednesday, Tottenham announced the departure of their head coach.\"The Club has taken the decision to make a change in the Men's Head Coach position and Thomas Frank will leave today.  Thomas was appointed in June 2025, and we have been determined to give him the time and support needed to build for the future together.  However, results and performances have led the Board to conclude that a change at this point in the season is necessary.  Throughout his time at the Club, Thomas has conducted himself with unwavering commitment, giving everything in his efforts to move the Club forward. We would like to thank him for his contribution and wish him every success in the future.\"\nWhat's gone wrong this season? It has been a challenging season for Frank and Tottenham as the Danish manager was appointed after an intense year which ended with the European trophy. However, the numbers speak for themselves when looking at what went under his management in the Premier League. After 26 Premier League games, Tottenham only won seven, drew eight and lost 11 matches with 36 goals scored and 37 conceded. A negative one goal difference might not be so concerning on its own, but if we look at their expected goals numbers, things are even more worrying as it turns out Tottenham are currently over performing with 27.5xG and only 98 shots on target in total (less than four per game) and 1.4 goals conceded per game (11th team in the Premier League). As you can see below Spurs have basically struggled despite running good compared to what they might expect.\n                                                                    CBS Sports\n                                                            Their numbers in the UEFA Champions League league phase are not significantly different. They scored 17 goals in eight matches from 13.9 expected goals (xG) and recorded nine assists from 9.6 expected assists (xA). This suggests they performed slightly better outside their domestic competitions, though the difference is minimal, and it also reflects the varying quality of opposition faced. Tottenham lost only once in the league phase, a 5–3 away defeat to PSG. They secured wins against Villarreal, Copenhagen, Slavia Prague, Borussia Dortmund and Eintracht Frankfurt, while drawing with Bodø/Glimt and AS Monaco. If we take a closer look at the Champions League fixtures, they have always over performed their expected goals, even in their loss, when they scored three goals against PSG (1.7xG) and when they scored two against Eintracht Frankfurt in the latest win of their league phase campaign (1.2 xG). \nIf things didn't work out for Frank this season, it has also to do with what happened off the pitch at Tottenham. The Danish manager, who previously coached Brentford from 2018 to 2025, is the latest departure for an English side in upheaval. This challenging season has already been marked by two big changes as both former chairman Daniel Levy and head of football Fabio Paratici left the team. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tottenham fire Frank: Spurs axe manager after two wins in 17 PL matches - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/11/c26d8a90-0913-49c3-ad1d-9629726f7725/thumbnail/1200x675/b70586504f490029dbb75bf4c536ae10/untitled-design-2026-02-11t113948-981.png"
      ],
      "datePublished": "2026-02-11T11:59:42.000Z",
      "dateModified": "2026-02-11T11:59:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alabama coach Nate Oats reacts to Charles Bediako's NCAA ineligibility ruling - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/alabama-coach-nate-oats-charles-bediako-ineligible/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/7cee5db9-b9ba-4b48-9853-0522169ea0f1/thumbnail/1200x675/8c014f117ae8d1f48b8352076895e056/untitled-design-199.png",
    "tag": "Sports",
    "date": "2026-02-10T23:50:47.000Z",
    "description": "\n        Alabama will play the remainder of the 2025-26 season without big man Charles Bediako after a judge denied his motion seeking a preliminary i",
    "body": "\n        Alabama will play the remainder of the 2025-26 season without big man Charles Bediako after a judge denied his motion seeking a preliminary injunction against NCAA eligibility rules. Bediako, who returned to Alabama after signing an NBA contract and playing in the G League, appeared in five games for the Crimson Tide.Speaking for the first time since the ruling on Monday, Alabama coach Nate Oats weighed in on the decision.\"Super disappointed in the ruling for Charles,\" Oats said on Tuesday. \"Regardless of the ruling, we are going to continue to support him anyway we possibly can here. With the team, we have to move forward. We played 18 games before he got here. Some real quality wins without him. ... Sad situation for him, but we have to move forward and continue to help him however we can.\"Bediako, who played for the Crimson Tide for two seasons before declaring for the 2023 NBA Draft, averaged 10.0 points. 4.6 rebounds and 2.0 blocks in his second stint with the team. Before joining the Crimson Tide, he was a fixture in the G League, playing for the Austin Spurs (San Antonio's G League affiliate), Grand Rapids Gold, and, most recently, the Motor City Cruise. \n        \n            \n                Charles Bediako ineligible after judge's ruling: Why 7-footer's journey from G League back to Alabama is over\n                \n                    Matt Norlander                \n            \n                            \n    \n                \n                    \n    \nWith Bediako in the rotation, Alabama went 3-2 with wins over Auburn, Texas A&M and Missouri. Oats defended and doubled down on the decision when asked if it was worth bringing him back to Alabama, despite him playing in just five games.\n\"There was an opportunity to help one of our former players out,\" Oats said. \"He was within his five-year window. He's trying to get his degree. Here's the thing too. My job as a head coach is to try to do the right thing by our guys. Charles is one of our guys. That was the right thing to do by one of our guys. ... We're going to continue to help his basketball development. We're going to continue to help his development as a student, as a student-athlete. 100% it was worth it. I would do the same thing 100 times out of 100 for any of our guys.\"With Bediako out, Alabama could rely on Bucknell transfer Noah Williamson for more minutes at the center position. Williamson has appeared in 21 games this season and is averaging just under nine minutes per game. Oats also mentioned the possibility of going with smaller lineups, with Taylor Bol Bowen at center.\"He's going to need to get back to playing hard and giving us great effort,\" Oats said of Williamson. \"You look back to what he was able to do in the Kentucky game, when big Aidan [Sherrell] went out with the injury. He's going to have to give us those types of minutes moving forward. We can also go small.\"\nAlabama will play its first game without Bediako since the ruling on Wednesday against Ole Miss. The Crimson Tide are on the No. 4 seed line in CBS Sports' latest Bracketology projections.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alabama coach Nate Oats reacts to Charles Bediako's NCAA ineligibility ruling - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/7cee5db9-b9ba-4b48-9853-0522169ea0f1/thumbnail/1200x675/8c014f117ae8d1f48b8352076895e056/untitled-design-199.png"
      ],
      "datePublished": "2026-02-10T23:50:47.000Z",
      "dateModified": "2026-02-10T23:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arsenal vs. Brentford prediction, odds, best bets for EPL match - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/arsenal-vs-brentford-prediction-odds-picks-best-bets-for-premier-league-match-on-thursday-feb-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/c265ddc3-eca4-4e84-b9db-6665f4255386/thumbnail/1200x675/0fb44e30041361b7b9cfbfd62d85fbb0/havertz.jpg",
    "tag": "Sports",
    "date": "2026-02-11T12:00:58.000Z",
    "description": "\nArsenal will try to extend their win streak to five games in all competitions and maintain their English Premier League lead when they visit Brentfor",
    "body": "\nArsenal will try to extend their win streak to five games in all competitions and maintain their English Premier League lead when they visit Brentford on Thursday. The Gunners (17-5-3) have a six-point lead over Manchester City in the EPL table after cruising to a 3-0 home victory on Saturday. The Bees (12-3-10) are seventh in the Premier League table and won 3-2 at Newcastle following a big 1-0 victory against top-four Aston Villa the previous weekend.     Kickoff from Gtech Community Stadium in Brentford, England is set for 3 p.m. ET. Arsenal are -140 favorites on the money line in the latest Arsenal vs. Brentford odds at DraftKings Sportsbook, Brentford are +390 and a draw is priced at +295. The total for match goals is set at 2.5 (Over -115, Under -110). Go to SportsLine to see the latest on Brentford vs. Arsenal, including the SportsLine Projection Model picks, and make sure you read what expert Martin Green is betting for the contest.After working in the sports betting industry for several years, Green became a professional sports writer and handicapper and has covered the game worldwide. Last year, Green was profitable in multiple areas on his soccer betting picks, including Euro qualifying (+6.30 units), EFL Cup (+4.47), FA Cup (+3.07) and Champions League (+3.05), among others. Anyone who follows him could be way up.    Here are Green's best bets and analysis for Arsenal vs. Brentford on Wednesday, Feb. 11.Arsenal vs. Brentford best betsArsenal to Win and Under 4.5 goals -110 (1 unit)Arsenal to Keep a Clean Sheet +137 (0.5 units)Arsenal will try to tighten their grip on the Premier League title race when they take on Brentford at the Gtech Community Stadium on Thursday. The Gunners remain six points clear of title rivals Man City at the top of the table after beating Sunderland 3-0 at the weekend. They're on a four-game winning streak in all competitions, so they'll carry a great deal of momentum into this game.Arsenal have the best away record in the league this season, with seven wins, three draws and just two defeats from 12 games. However, Brentford's home record is identical -- seven victories, three draws and two losses from 12 at Gtech. The Bees have the sixth-best home record in the division and are full of confidence right now. It promises to be a tight game and could be decided by a set piece or a moment of individual brilliance.Arsenal Dominate Head-to-HeadsBrentford secured promotion to the Premier League in 2021, ending a 74-year exile from England's top division. Their first Premier League game was against Arsenal, and they earned a famous 2-0 win in front of their jubilant home fans.That was a joyous occasion for Brentford, but their record against Arsenal has been dismal in the ensuing years. Since then, Arsenal have picked up seven wins and two draws from nine games against Brentford.Their latest clash took place at Arsenal's Emirates Stadium two months ago. Goals from Mikel Merino and Bukayo Saka earned the Gunners a deserved 2-0 victory. They had 64% of the possession, and Brentford didn't manage a single shot on target in the game.The Gunners have also won their last four away games against Brentford, scoring 11 goals and conceding just once. They've absolutely dominated the Bees in recent years, which should give them confidence as they travel to the Gtech.Arsenal's players could be feeling a little jittery, as they're bidding to win the Premier League title for the first time in 22 years. They're the -600 favorites to win the league with most sportsbooks, but they've choked several times over the past few years.However, they looked supremely composed in their 4-0 away win against Leeds on Jan. 31 and followed it up with a 1-0 win against Chelsea. They earned a third consecutive clean sheet when beating Sunderland 3-0 on Saturday, and their defense looks rock-solid right now.Arsenal have kept 13 clean sheets in 25 league games this season and have only conceded 0.68 goals per game, so they could thwart Brentford's attack.Brentford are Flying HighBrentford will be on a high after beating Newcastle 3-2 at St. James' Park on Saturday. The Bees have won their last two league games and are up to seventh in the league table, level on points with reigning champions Liverpool.Most pundits expected Brentford to be in a relegation battle this season. After all, manager Thomas Frank moved to Tottenham in the summer. They also lost their two best forwards, as Bryan Mbeumo moved to Man United and Yoan Wissa joined Newcastle.They've defied all expectations, so new manager Keith Andrews deserves a great deal of credit. This is a strong, athletic Brentford team, with a powerful spine. Nathan Collins and Sepp van den Berg are solid at the back, veteran Jordan Henderson patrols the midfield, and Igor Thiago and Dango Outtara have been very prolific in attack.They have no major injury concerns right now, although winger Kevin Schade is suspended. Meanwhile, Arsenal are missing Saka and Merino through injury. Captain Martin Ødegaard, and winger Leandro Trossard could also miss this game.Yet the Gunners have strength in depth. They're playing Wigan in the FA Cup at the weekend, so they can afford to play their best XI in this game then rest key players against Wigan. We could see a front three of Gabriel Martinelli, Viktor Gyökeres, and Noni Madueke, which would give Arsenal pace on the counter-attack. The Gunners have a world-class midfield and are always dangerous at set pieces.They can also call upon the likes of Kai Havertz, Eberechi Eze, and Gabriel Jesus, and that strength in depth could ultimately prove decisive, allowing them to secure a narrow away win. The last 10 games between these teams have seen Under 4.5 goals, so combining Arsenal to Win with Under 4.5 Goals looks appealing.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arsenal vs. Brentford prediction, odds, best bets for EPL match - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/c265ddc3-eca4-4e84-b9db-6665f4255386/thumbnail/1200x675/0fb44e30041361b7b9cfbfd62d85fbb0/havertz.jpg"
      ],
      "datePublished": "2026-02-11T12:00:58.000Z",
      "dateModified": "2026-02-11T12:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best bets for Clippers-Rockets, Duke-Pittsburgh and more on Tuesday, Feb. 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-clippers-vs-rockets-duke-vs-pittsburgh-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/17d7b04e-8655-4af3-8d2a-9baf0af75327/thumbnail/1200x675/be0c62b528dfff9e726201a3e847a331/kevin-durant.jpg",
    "tag": "Sports",
    "date": "2026-02-10T20:30:42.000Z",
    "description": "\nThe Houston Rockets went deep into January with one of the best home records in the NBA as they won 16 of their first 19 games on their own court. Th",
    "body": "\nThe Houston Rockets went deep into January with one of the best home records in the NBA as they won 16 of their first 19 games on their own court. They've suddenly hit a wall, however, losing three of their last four contests at the Toyota Center.Houston (32-19) has a chance to right the ship with two games against the same opponent, and it hosts the Los Angeles Clippers (25-27) on Tuesday at 8 p.m. ET. It's the first of two meetings between the teams in as many days. The Rockets, who lost at home to the Boston Celtics and Charlotte Hornets last week, have won three straight meetings with the Clippers in Houston -- including a 115-113 triumph in December.The Clippers began a four-game road trip with victories against the Sacramento Kings and Minnesota Timberwolves, giving them four wins in their last five away games. However, Los Angeles hasn't won in Houston since posting a 122-116 triumph on March 6, 2024.Only three other games are on Tuesday's NBA schedule, one of which is a matchup between the Indiana Pacers (13-40) and New York Knicks (34-19) at 7:30 p.m. ET at Madison Square Garden. The Knicks have won nine of their last 10 contests, while the Pacers have lost four straight and dropped a 114-113 decision to New York at home earlier this season.There are 22 games on the college basketball slate, including an ACC showdown between fourth-ranked Duke (21-2) and host Pittsburgh (9-15) at 9 p.m. ET at the Petersen Events Center. The Blue Devils are looking to bounce back from a 71-68 setback against then-No. 14 North Carolina on Saturday that ended their 10-game winning streak.Another key contest is a Big 12 Conference clash that has No. 22 BYU (17-6) visiting Foster Pavilion in Waco, Texas to take on Baylor (13-10) at 7 p.m. ET. The Cougars are hoping to halt a slide that reached four games with Saturday's 77-66 loss to then-No. 8 Houston.The Rockets are 7.5-point favorites against the Clippers in the latest consensus NBA odds, while the Knicks are 12.5-point favorites over the Pacers. Duke is a 17.5-point favorite versus Pittsburgh and BYU is a 3.5-point favorite against Baylor.Below is a snapshot of what to watch and bet for Tuesday, Feb. 10. All times EasternNBA best bets, where to watchPacers at KnicksTime: 7:30 p.m. | Location: New York | TV: NBA League Pass | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 225.5 (-108) | Expert: Jose Alvarado Over 10.5 Points + Assists (-114, PropBetGuy)When these teams met in Indiana on Dec. 18, they combined for 227 points. The Knicks are ninth in the NBA in scoring with an average of 117.3 points, while the Pacers are allowing 118.5 per game to rank 24th in the league. Six of Indiana's last eight contests went Over the projected total for this matchup, and the SportsLine Projection Model feels the trend will continue as the Over hits in almost 56% of its simulations. Jose Alvarado had a solid performance against Boston in his Knicks debut after being acquired from the New Orleans Hornets last week, recording 12 points and two assists, and SportsLine props expert PropBetGuy (+1126 on his last 152 NBA player prop picks) thinks he'll try to put up even better numbers in his first home game with the club.Clippers at RocketsTime: 8 p.m. | Location: Houston | TV: NBA TV | Stream: Fubo (Try for free)\nSportsLine pick -- Model: Over 212.5 (-112)Both teams rank in the bottom half of the NBA offensively and are among the top nine defensive clubs in the league. But 12 of Los Angeles' last 14 games went Over the projected total for Tuesday's clash and three of Houston's past five did the same. The Clippers and Rockets combined for 228 and 236 points in their first two meetings this season, and the SportsLine Projection Model sees them having another high-scoring affair as its simulations say the Over hits well over 67% of the time.CBB best bets, where to watchBYU at BaylorTime: 7 p.m. | Location: Waco, Texas | TV: ESPN2 | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Baylor +3.5 (-110) | Expert: Over 160.5 (-110, Chip Patterson)The Bears are 0-5 against ranked opponents this season, with each of their first four losses being by double digits. However, they held their own versus then-No. 7 Iowa State last Saturday as they were defeated by only three points. The SportsLine Projection Model believes the Bears will keep it close against the Cougars, as they cover the spread in 56% of its simulations. SportsLine expert Chip Patterson likes the Over in this contest as BYU hasn't performed particularly well defensively during conference play, allowing at least 76 points in eight of its 10 Big 12 games.Duke at PittsburghTime: 9 p.m. | Location: Pittsburgh | TV: ESPN | Stream: Fubo (Try for free)\nSportsLine picks -- Model: Over 136.5 (-109) | Expert: Duke -15.5 (-110, Thomas Casale)The Blue Devils are sixth in the ACC in scoring with an average of 83.4 points and Cameron Boozer is second in the nation at 23.3 per game. The Panthers are 10th in the conference in points allowed (71.5) and have surrendered at least 76 in three of their last five contests. Taking all of this into account, the SportsLine Projection Model doesn't think points will be scarce in this matchup as its simulations say the Over hits well over 75% of the time. SportsLine expert Thomas Casale (25-14, +823 on his last 39 college basketball against-the-spread picks) believes Duke, which is coming off its first loss in 11 outings, will take out its frustrations against a Pittsburgh squad that lost both of its last two games by at least 19 points.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best bets for Clippers-Rockets, Duke-Pittsburgh and more on Tuesday, Feb. 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/17d7b04e-8655-4af3-8d2a-9baf0af75327/thumbnail/1200x675/be0c62b528dfff9e726201a3e847a331/kevin-durant.jpg"
      ],
      "datePublished": "2026-02-10T20:30:42.000Z",
      "dateModified": "2026-02-10T20:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rob Havenstein retires: Rams OL ending career after 11 years in NFL - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/rob-havenstein-retires-rams/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/eac43a57-5f30-4e89-a84c-7be2f31d4d4e/thumbnail/1200x675/328058f4073984ce2eacd73d786b181f/gettyimages-2194943278-1.jpg",
    "tag": "Sports",
    "date": "2026-02-10T21:46:46.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Rams starting offensive lineman Rob Ha",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Los Angeles Rams starting offensive lineman Rob Havenstein announced his retirement after 11 seasons in the NFL. Havenstein, who missed several games in 2025 due to injury, spent his entire career with the Rams, who selected him in the second round of the 2015 NFL Draft. \"Thank you to all my teammates, coaches, and fans who have supported me and helped me over these past 11 years,\" Havenstein wrote on social media. \"I have had the time of my life with the Los Angeles Rams (formerly known as the St. Louis Rams) and can't thank the whole organization enough for giving me a shot back in 2015... As this chapter ends, I couldn't be more grateful, hopeful and excited to see what comes next!\" Havenstein, a product of Wisconsin, started 13 games at right tackle as a rookie -- while the Rams were still located in St. Louis -- and held that spot for the majority of his career. He was a member of the PFWA All-Rookie Team while blocking for former Rams running back Todd Gurley, who earned 2015 NFL Offensive Rookie of the Year honors. \nHavenstein maintained his spot at right tackle in 2017 when the Rams hired coach Sean McVay, who took Los Angeles to its first of two consecutive NFL playoff appearances in his first season with the franchise. With McVay leading the charge, Havenstein was a starter for the Los Angeles teams that won four NFC West titles, two NFC Championships, and one Super Bowl. He was in the lineup for Los Angeles' first seven games in 2025 but was placed on injured reserve in November due to knee and ankle bursitis. Havenstein was on the last year of a three-year, $34.5 million contract extension during the 2025 season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rob Havenstein retires: Rams OL ending career after 11 years in NFL - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/eac43a57-5f30-4e89-a84c-7be2f31d4d4e/thumbnail/1200x675/328058f4073984ce2eacd73d786b181f/gettyimages-2194943278-1.jpg"
      ],
      "datePublished": "2026-02-10T21:46:46.000Z",
      "dateModified": "2026-02-10T21:46:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]