[
  {
    "title": "Snyder's Soapbox: Don't let voter fatigue invalidate this MLB awards season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/snyders-soapbox-dont-let-voter-fatigue-invalidate-this-mlb-awards-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/8b362836-f43c-4240-90d6-f6f0e7711681/thumbnail/1200x675/b04bec931bdb9518141e939ea97aa854/judge-getty.png",
    "tag": "Sports",
    "date": "2025-11-11T17:19:23.000Z",
    "description": "\n        Welcome to Snyder's Soapbox! Here, I pontificate about matters related to Major League Baseball on a weekly basis. Some of the topics will be",
    "body": "\n        Welcome to Snyder's Soapbox! Here, I pontificate about matters related to Major League Baseball on a weekly basis. Some of the topics will be pressing matters, some might seem insignificant in the grand scheme of things, and most will be somewhere in between. The good thing about this website is that it's free, and you are allowed to click away. If you stay, you'll get smarter, though. That's a money-back guarantee. Let's get to it.It's awards week, so we'll run with an awards-themed soapbox. The job today is to tsk, tsk at voter fatigue. In other words, we're talking about people getting tired of a certain player winning awards and then finding a way to give the plaque to an inferior player. By no means is this baseball-specific. I immediately thought about Karl Malone winning NBA MVP over Michael Jordan in 1997. We could argue the merits of both players, but we could also ask a simple question: Had Jordan never won MVP before, would the outcome of the vote have been the same? Hmm ...Anyway, we'll stick to baseball. We can trace the origins of voter fatigue all the way back to one of the first iterations of MVP. In 1922, the American League created an award for \"the baseball player who is of the greatest all-around service to his club.\" Prior award winners were ineligible. How stupid is that? The player who is of greatest all-around service to his team, unless he's won the award before, is the winner? C'mon. This is why Babe Ruth famously only won one MVP. \nFortunately, when the BBWAA launched the current MVP awards in 1931, there was no such stipulation. Still, fatigue can be found. In 1951, Stan Musial had already won three MVPs and Jackie Robinson had one. Dodgers catcher Roy Campanella won the MVP, but both Musial and Robinson were noticeably better. Mickey Mantle and Willie Mays should have won more MVPs than they did. More recently, how about Jeff Kent over Barry Bonds in 2000? This might've been partially due to which team made the playoffs -- but fatigue can talk people into arguments like that! -- but Ryan Howard over Albert Pujols in 2006 doesn't look great and that was when Pujols only had one MVP. There's a case for Pujols in 2010 too. There was a craze with voters and closers for a bit over a decade, but Roger Clemens finishing third in 1992 AL Cy Young voting is a bit ridiculous. Dennis Eckersley won -- again, the closer thing -- but Jack McDowell finished second and Clemens was third. Clemens led the league in ERA, 0.77 better than McDowell's while he only won two fewer games. Greg Maddux's fourth-place finish in 1998 just screams fatigue, as does Rick Porcello over Justin Verlander in 2016. \nIt isn't the biggest deal in the world, but it still bothers me. Is the MVP for the most valuable player or for the most valuable player we're not tired of seeing win the award? Is the Cy Young for the best pitcher or the best pitcher who hasn't won it too many times? This is a concern moving forward with Aaron Judge and Shohei Ohtani. Judge might win his third MVP in four years this season, but voter fatigue in part might cost him. Ohtani is in line to win his fourth MVP in the last five years and it's possible he'll be fighting voter fatigue in future years. We need to guard against this. Bonds is the only player ever with more than three MVPs and Ohtani has a chance to catch him at seven. Maybe he falls short on merit, but merit should be the only consideration. We can always strive to be better and to learn from past mistakes. Even if the best players pile up seven MVPs like Bonds -- he should've won nine or even 10, by the way -- that shouldn't affect future voting. The best player should win MVP just like the best pitcher should win Cy Young. We don't need to spread these things around like participation trophies.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snyder's Soapbox: Don't let voter fatigue invalidate this MLB awards season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/8b362836-f43c-4240-90d6-f6f0e7711681/thumbnail/1200x675/b04bec931bdb9518141e939ea97aa854/judge-getty.png"
      ],
      "datePublished": "2025-11-11T17:19:23.000Z",
      "dateModified": "2025-11-11T17:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavs owner Patrick Dumont pens letter to Dallas fans after Nico Harrison firing - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/mavericks-owner-patrick-dumont-nico-harrison-fired-luka-doncic-trade/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/32801bc0-a261-4bda-976a-a46abcf8cf39/thumbnail/1200x675/b36d026237beb95dfb6272e74a27dcfa/dumont-nico.jpg",
    "tag": "Sports",
    "date": "2025-11-11T18:26:36.000Z",
    "description": "\n        Nine months after trading Luka Dončić to the Lakers in what has an argument for being the worst trade in NBA history, general manager Nico Ha",
    "body": "\n        Nine months after trading Luka Dončić to the Lakers in what has an argument for being the worst trade in NBA history, general manager Nico Harrison was fired by the Dallas Mavericks on Tuesday.Ever since the shocking trade, Mavs fans have been in open revolt against Harrison, chanting \"Fire Nico\" at every opportunity. Ultimately, the Mavericks acquiesced to that request after a disastrous 3-8 start to the 2025-26 season. In an unusual move for a front office firing, Mavericks owner Patrick Dumont penned a letter to fans explaining his decision to fire Harrison and effectively pleading with them to come back and continue supporting the team. Dear Mavs Family, On May 30, 2024, the Mavericks won the Western Conference championship. We came up short in the NBA Finals, but we all agreed our future was bright. As fans of this franchise, you have every right to demand a commitment to success from us. No one associated with the Mavericks organization is happy with the start of what we all believed would be a promising season. You have high expectations for the Mavericks, and I share them with you. When the results don't meet expectations, it's my responsibility to act. I've made the decision to part ways with general manager Nico Harrison. Though the majority of the 2025-26 season remains to be played, I know our players are deeplly committed to a winning culture, this decision was critical to moving our franchise forward in a positive direction. I understand the profound impact these difficult last several months have had. Please know that I'm fully committed to the success of the Mavericks. Thank you for your support, thank you for holding us accountable, and thank you to your passion and for your patience. You deserve transparency and a team that reflects your spirit. our goal is to return winning basketball to Dallas and win championships. Our family is committed to that mission and to continuing to invest in Dallas and the Mavericks' future. Please join me in continuing to cheer on our players and supporting all of those who work to make this organization the best it can be. Go Mavs!Thank you, PatrickDumont's letter doesn't reference Luka by name, but it is implied by the reference to the \"difficult last several months.\" It should be noted that all of this happened after the Mavs failed to sell out a home game for the first time in 24 years on Saturday when they hosted the Wizards. It's one thing to show up to games and chant, but once the ever-loyal Mavericks fans proved they wouldn't simply show up for anything, the organization decided to make a move.\nFew expected Harrison's removal this quickly, particularly after Cooper Flagg fell into his lap with the No. 1 overall pick, but even Flagg's arrival did little to take away from Mavs' fans furor at Harrison's betrayal in trading Dončić. The fact that they did little to address the glaring hole at point guard coming into the season with Kyrie Irving out with a torn ACL accelerated those frustrations, as Flagg was put in the uncomfortable position of starting at point guard. That has led to some expected struggles from the highly touted prospect and while that is partially a coaching decision from Jason Kidd, it's also the product of how Harrison built this roster. Harrison's failure to create a coherent roster that could stay afloat until Irving's return prevented him from building any goodwill with the organization or fans after landing Flagg. Instead, Dallas' struggles amplified calls for Harrison's job and made it hard for ownership to back him, particularly while watching Dončić dominate in L.A. from afar. \nThe problem for Dumont is the blood isn't just on Harrison's hands from the Dončić trade, and while he can express his regret for the deal, the decision to trade the franchise's superstar ultimately lands with ownership. Harrison served as the focus of Dallas' vitriol for nine months, but now that will shift to Dumont and the new ownership group that has not earned any trust from the fan base so far. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavs owner Patrick Dumont pens letter to Dallas fans after Nico Harrison firing - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/32801bc0-a261-4bda-976a-a46abcf8cf39/thumbnail/1200x675/b36d026237beb95dfb6272e74a27dcfa/dumont-nico.jpg"
      ],
      "datePublished": "2025-11-11T18:26:36.000Z",
      "dateModified": "2025-11-11T18:26:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kyle Hendricks retires: 2016 World Series champion will always be a legendary part of Cubs history - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/kyle-hendricks-retires-cubs-2016-world-series/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/1713473b-e421-4694-96c4-5e740c105afc/thumbnail/1200x675/12c9dec5f82e26d3514205810c6bb847/hendricks-getty.png",
    "tag": "Sports",
    "date": "2025-11-11T18:45:04.000Z",
    "description": "\n        Right-handed pitcher Kyle Hendricks is retiring, putting a bow on a major-league career that spanned parts of 12 seasons, mostly with the Chi",
    "body": "\n        Right-handed pitcher Kyle Hendricks is retiring, putting a bow on a major-league career that spanned parts of 12 seasons, mostly with the Chicago Cubs. Hendricks finishes with a 105-91 record, 3.79 ERA, 1.19 WHIP and 1,373 strikeouts in 1,745 innings. He might make the Hall of Fame ballot in a decade, but he won't receive more than a token vote or two. The final stat line doesn't really matter, though. What does matter is the lasting impact that Hendricks had on the Cubs and their fan base. Zero in on 2016, when the Cubs won the World Series, and take note that Hendricks finished third in NL Cy Young voting that season. It's so much more than that though. Let's take a stroll through Hendricks' professional career. An eighth-round pick out of Dartmouth, Hendricks started with the Rangers but came to the Cubs as an unheralded, Double-A prospect in a trade for Ryan Dempster in 2012. The move was part of a rebuild by Theo Epstein's front office. Over the course of 2012-14, the Cubs acquired a lot of high-profile position players, including several big bats like Anthony Rizzo, Kris Bryant and Kyle Schwarber. A common refrain among those not believing in the rebuild was \"who's gonna pitch?!?\" \nThe Cubs signed Jon Lester in free agency before the 2015 season and John Lackey before 2016, but the rotation really rounded out due to the development of Jake Arrieta -- who also came over in a trade under Epstein -- and Hendricks. Hendricks threw well in the minors after the Cubs grabbed him and he debuted in 2014, going 7-2 with a 2.46 ERA in 13 starts as a rookie. He was a bit worse in 2015, though he got his feet wet in the postseason. Then came 2016. In that magical 2016 Cubs season, Hendricks pitched like an ace. He was 16-8 with a 2.13 ERA (196 ERA+), winning the ERA title. \nThere was a scare in Game 2 of the NLDS against the Giants, when Hendricks took a liner off the shin and had to leave the game after just 3 ⅔ innings. He'd return for Game 2 of the NLCS and pitched to a 0.83 ERA in his final four starts. Hendricks' finest hour came in Game 6 of the NLCS. Famously, the Cubs had not won the NL pennant since 1945. They had a 3-2 lead in the series, meaning they could clinch with a win over the Dodgers. Hendricks' task? Outpitch prime Clayton Kershaw, one of the greatest pitchers of all-time. Hendricks allowed a leadoff single, but that baserunner was erased on a double play the following hitter. He allowed a single to his final batter, in the eighth inning. Between those two singles, Hendricks got 22 outs without allowing a hit or a walk (a runner reached on error, otherwise it was perfection between the first and last hitters he faced). He struck out six. It was a masterpiece and the Cubs cruised to the NL pennant. \nOf course, the Cubs also had famously not won the World Series since 1908. Hendricks was tasked with starting Game 7 against Corey Kluber, who would win his second Cy Young a year later. Hendricks allowed only one run through four innings and was pulled by Cubs manager Joe Maddon rather aggressively after a two-out walk in the fifth. Still, Hendricks left with the lead and threw better in Game 7 than the much more ballyhooed starter. Without the growth of Arrieta and Hendricks, the Cubs don't win the 2016 World Series and it could be argued that -- between Game 6 of the NLCS and Game 7 of the World Series -- Hendricks started the two biggest games in Cubs history. Though Hendricks never recreated the production from 2016, he had several more quality seasons, winning more than 10 games four times in his career and posting at least 2.8 WAR five times. \nThe calm demeanor was a signature of Hendricks on the mound. He was a steadying presence so often early in his career and a nice change of pace from the power of Arrieta and from the southpaw Lester. More than anything, though, Cubs fans will always fondly look back at the times that Hendricks outdueled Kershaw and Kluber en route to a World Series title. He wasn't necessarily the most important player on that 2016 team, but he was integral and indispensable. That \"2016 WORLD SERIES CHAMPIONS\" flag isn't flying without him. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kyle Hendricks retires: 2016 World Series champion will always be a legendary part of Cubs history - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/1713473b-e421-4694-96c4-5e740c105afc/thumbnail/1200x675/12c9dec5f82e26d3514205810c6bb847/hendricks-getty.png"
      ],
      "datePublished": "2025-11-11T18:45:04.000Z",
      "dateModified": "2025-11-11T18:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kentucky vs. Louisville prediction, odds: 2025 Battle of the Bluegrass picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kentucky-louisville-odds-prediction-line-time-college-basketball-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/25ae3165-113a-4e6f-95b3-8b61cc9acdaf/thumbnail/1200x675/ad1062e3e580bc3a8588dc631e3f10ad/usatsi-27505347-1.jpg",
    "tag": "Sports",
    "date": "2025-11-11T17:33:38.000Z",
    "description": "\n        Heavyweights clash when the ninth-ranked Kentucky Wildcats take on the No. 12 Louisville Cardinals in the 2025 Battle of the Bluegrass on Tue",
    "body": "\n        Heavyweights clash when the ninth-ranked Kentucky Wildcats take on the No. 12 Louisville Cardinals in the 2025 Battle of the Bluegrass on Tuesday night. Kentucky is coming off a 107-59 win over Valparaiso on Friday, while Louisville downed Jackson State 106-70 on Thursday. The Wildcats (2-0), who tied for sixth in the SEC a year ago at 10-8 and were 24-12 overall, are 4-6 on the road since the start of last season. The Cardinals (2-0), who tied for second in the ACC at 18-2 and were 27-8 overall in 2024-25, are 16-3 on their home court since last November.Tipoff from KFC Yum! Center in Louisville, Ky., is set for 8 p.m. ET. After opening at -4.5, Louisville is now a 6.5-point favorite in the latest Kentucky vs. Louisville odds from SportsLine consensus, while the over/under for total points scored is 173.5. Before making any Louisville vs. Kentucky picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every college basketball game 10,000 times and has returned over $2,200 in betting profit for $100 players on its top-rated college basketball picks over the past three seasons. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen huge returns.    Now, the model has simulated Kentucky vs. Louisville 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Louisville vs. Kentucky:Kentucky vs. Louisville                 spread:    Louisville -6.5Kentucky vs. Louisville over/under:    173.5 pointsKentucky vs. Louisville                               money line:    Louisville -269, Kentucky +217Kentucky vs. Louisville                               picks:    See picks at SportsLineKentucky vs. Louisville                               streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Kentucky vs. Louisville picksSportsLine's model is going Under on the total (173.5 points). The Wildcats have gone Under the total in five of the last six games, while the Cardinals have been Under in six of their past 10. The model also has just three Kentucky players scoring in double figures, led by Otega Oweh with an average simulation total of 13.1 points. The model says Louisville has five players in double digits, led by Adrian Wooley's 17 points. The teams combine for 163 points as the Under hits in 80% of simulations.. You can head to SportsLine to see the model's men's college basketball picks. So who wins Kentucky vs. Louisville, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Kentucky vs. Louisville spread to back, all from the advanced model was profitable on top-ranked college basketball picks last season, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kentucky vs. Louisville prediction, odds: 2025 Battle of the Bluegrass picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/25ae3165-113a-4e6f-95b3-8b61cc9acdaf/thumbnail/1200x675/ad1062e3e580bc3a8588dc631e3f10ad/usatsi-27505347-1.jpg"
      ],
      "datePublished": "2025-11-11T17:33:38.000Z",
      "dateModified": "2025-11-11T17:33:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ohio vs. Western Michigan odds, prediction: Tuesday MACtion picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ohio-western-michigan-prediction-odds-picks-time-week-12-tuesday-maction-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/03/19a52ddb-4af9-4584-97ec-e193489c5883/thumbnail/1200x675/f8a3c9c402b21893370847c1d93c8a16/parker-navarro-ohio-bobcats-cbs.jpg",
    "tag": "Sports",
    "date": "2025-11-11T17:31:22.000Z",
    "description": "\n        Teams tied atop the Mid-American Conference standings will meet during Tuesday night MACtion as the Ohio Bobcats visit the Western Michigan B",
    "body": "\n        Teams tied atop the Mid-American Conference standings will meet during Tuesday night MACtion as the Ohio Bobcats visit the Western Michigan Broncos. Ohio (6-3, 4-1 MAC) is on a three-game winning streak and defeated Miami (OH), 24-20, last Tuesday. Western Michigan (5-4, 4-1 MAC) has won four of its last five after starting the year 0-3, and the Broncos knocked off Central Michigan, 24-21, on November 1. These are among four teams with 4-1 conference records entering Week 12, and the winner of this game will be the driver's seat for a spot in the MAC title game.Kickoff is at 8 p.m. ET from Waldo Stadium in Kalamazoo, Mich. The Broncos are 1.5-point favorites in the latest Ohio vs. Western Michigan odds, while the over/under for total points scored is 46.5. Before making any Western Michigan vs. Ohio picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Western Michigan vs. Ohio. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Ohio vs. Western Michigan:Western Michigan vs. Ohio spreadWestern Michigan -1.5 Western Michigan vs. Ohio                                    over/under46.5 pointsWestern Michigan vs. Ohio                                                                                                                                                     money line Western Michigan -115, Ohio -105Western Michigan vs. Ohio                                                                                                                                             picksSee picks at SportsLineWestern Michigan vs. Ohio                                                                                                                                               streaming Fubo (Try for free)  How to make Western Michigan vs. Ohio picksSportsLine's model has simulated Western Michigan vs. Ohio 10,000 times and is going Over 46.5 total points. WMU has seen the Over hit in back-to-back games, and the Over is 3-0 in Western Michigan games when it has a rest advantage, as it does in this contest. The model forecasts both teams' dual-threat quarterbacks to have prolific games both through the air and on the ground, with each rushing for over 50 yards. The teams combine for 47 points in the simulations.The model also says one side of the spread hits more than 70% of the time. You can only get the pick at SportsLine.   So who wins Ohio vs. Western Michigan, and which side of the spread hits more than 70% of the time? Visit SportsLine now to see which side of the Western Michigan vs. Ohio spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ohio vs. Western Michigan odds, prediction: Tuesday MACtion picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/03/19a52ddb-4af9-4584-97ec-e193489c5883/thumbnail/1200x675/f8a3c9c402b21893370847c1d93c8a16/parker-navarro-ohio-bobcats-cbs.jpg"
      ],
      "datePublished": "2025-11-11T17:31:22.000Z",
      "dateModified": "2025-11-11T17:31:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL hot seat rumors: Ranking five under-the-radar coaches who could be fired - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-head-coaching-hot-seat-rumors-ranking-five-under-the-radar-big-name-candidates-who-could-be-fired/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/06/a41d6f5b-4151-4475-ab9d-e28eeee284b8/thumbnail/1200x675/42b3dfd8581bdde954fcf42b022b43bc/gettyimages-2237924448-1.jpg",
    "tag": "Sports",
    "date": "2025-11-11T18:33:31.000Z",
    "description": "\n        We're past the midway point of the 2025 NFL season, and the New York Giants just made the latest in-season coaching change of this year, dism",
    "body": "\n        We're past the midway point of the 2025 NFL season, and the New York Giants just made the latest in-season coaching change of this year, dismissing Brian Daboll after three and a half seasons together.The G-Men figure to have company when it comes to searching for a new coach, whether in the coming weeks or months. The Tennessee Titans previously fired Brian Callahan, promoting Mike McCoy to the interim job. And the Miami Dolphins may or may not start fresh depending on how Mike McDaniel finishes a roller coaster of a 2025 campaign, which already saw the AFC East squad part with longtime general manager Chris Grier.But each hiring cycle tends to bring with it a surprise name or two. So which notable head coaches register as unexpected candidates to be replaced come 2026, especially if this season doesn't end so smoothly? Which established names could be facing more heat than expected behind closed doors? Here are five possibilities, plus our assessment on how likely they are to be dismissed at the end of 2025:Note: We're grading the likelihood of change with a Hot Seat Truth meter, with designations as follows:🔥 = Superficially Warm but Secure🔥🔥 = Increasingly Combustible🔥🔥🔥 = Scalding Hot5. Matt LaFleur (Packers)Record: 5-3-1 | Career Record: 72-36-1Fresh off a dispiriting Monday night loss to the Philadelphia Eagles, LaFleur has struggled to correct the streakiness of an injury-tinged offense, hence The Athletic going so far as to suggest new team president Ed Policy may not be sold on the seventh-year coach beyond 2025. Yes, it's true LaFleur hasn't advanced to a conference title game since his time with Aaron Rodgers, but this is also the guy who hired Jeff Hafley, the architect of Green Bay's humming defense. Still on pace for a sixth postseason appearance in seven years, LaFleur would be snatched up in a heartbeat if the Packers were to cut him loose.Hot Seat Truth: 🔥4. Sean McDermott (Bills)Record: 6-3 | Career Record: 92-48McDermott's resume suggests he's darn near entrenched in the job for as long as he chooses; he's on track to lead Buffalo to its eighth playoff bid in nine years, producing a first-time head coaching run reminiscent of his old Eagles mentor, Andy Reid. But even with a perennial MVP candidate at his disposal in Josh Allen, the Bills have continually failed to get over the hump on the biggest stages, sometimes as a direct result of McDermott's hit-or-miss defenses. His current offensive play-caller, Joe Brady, isn't necessarily elevating the group, either, as the rival New England Patriots overtake the AFC East. Another playoff dud could be the final straw.Hot Seat Truth: 🔥🔥\n\n        \n            \n                Giants coaching candidates: Ranking 10 options to replace fired Brian Daboll, including Bill Belichick\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \n3. Raheem Morris (Falcons)Record: 3-6 | Career Record: 32-53Technically, he's only a year and a half into his gig as Atlanta's head man. But Morris is now 15-22 running the team if you include his mercurial stint as an interim back in 2020, his first stint with the club. General manager Terry Fontenot may be forced to fall on the sword if the Falcons can't squeeze steadier results from young quarterback Michael Penix Jr., who replaced another underwhelming quarterback investment in Kirk Cousins. But Morris and offensive coordinator Zac Robinson have consistently prompted double takes for their in-game decision-making. Even with young cornerstones like Bijan Robinson and Drake London, the wins aren't stacking.Hot Seat Truth: 🔥🔥2. Kevin Stefanski (Browns)Record: 2-7 | Career Record: 42-51The only reason Stefanski qualifies as an \"underrated\" hot seat candidate is the fact he's been so well regarded around the NFL, often propped up as the lone voice of reason in a dysfunctional franchise. He is, after all, a two-time Coach of the Year winner, notably leading Joe Flacco and Co. to a surprise playoff bid in 2023. At some point, though, the record speaks for itself. Gutted as his Andrew Berry-built rosters may be, Stefanski was part of the contingent that signed off on the disastrous Deshaun Watson deal, and he's now ceded offensive play-calling twice in two years -- a sure sign even he no longer has many answers to elevate Cleveland's perpetual rebuild.Hot Seat Truth: 🔥🔥🔥1. Pete Carroll (Raiders)Record: 2-7 | Career Record: 172-127-1Las Vegas thought it was buying long-awaited stability when it poached Carroll from quasi-retirement this offseason, pairing the former Super Bowl champion with fellow big names in minority owner Tom Brady and ex-Seattle Seahawks breakout Geno Smith. Instead, Carroll's short-sighted approach has left the Raiders looking like his age (74). He didn't necessarily inherit a world-beating lineup, but his commitment to aging familiar faces alongside maligned coordinator Chip Kelly could convince Brady, principal owner Mark Davis and Co. to make a quick pivot to longer-term leadership. Remember, current Chicago Bears coach Ben Johnson was reportedly the apple of Brady's eye last offseason; don't be stunned if another search for the \"next big thing\" comes soon.\nHot Seat Truth: 🔥🔥🔥\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL hot seat rumors: Ranking five under-the-radar coaches who could be fired - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/06/a41d6f5b-4151-4475-ab9d-e28eeee284b8/thumbnail/1200x675/42b3dfd8581bdde954fcf42b022b43bc/gettyimages-2237924448-1.jpg"
      ],
      "datePublished": "2025-11-11T18:33:31.000Z",
      "dateModified": "2025-11-11T18:33:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michigan's Sherrone Moore details 'connection' with Nick Saban ahead of CFP push - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/sherrone-moore-nick-saban-relationship-michigan-college-football-playoff/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/fd989e23-097a-4d1a-9119-7a26b904a385/thumbnail/1200x675/8d6c66bc3ab4af87e82de3fab09688b7/sherrone-moore.jpg",
    "tag": "Sports",
    "date": "2025-11-11T18:51:03.000Z",
    "description": "\n        Michigan coach Sherrone Moore has spent much of this season quietly consulting one of college football's greatest minds: retired Alabama coac",
    "body": "\n        Michigan coach Sherrone Moore has spent much of this season quietly consulting one of college football's greatest minds: retired Alabama coach Nick Saban. The connection has become a touchstone for Moore as he navigates a pivotal three-game stretch that could define the Wolverines' College Football Playoff hopes.\"I try to call him every two months, a month,\" Moore said Monday. \"... Why not take advice from somebody you consider the G.O.A.T. of college football?\"Moore began building his connection with Saban after Michigan's 2023 national championship run, which included a CFP semifinal win over Alabama at the Rose Bowl -- the last game of Saban's legendary coaching career that included seven national championships. Through a mutual connection with current Michigan associate coach Biff Poggi, Moore reached out shortly after taking the Michigan job in February 2024 and established regular communication.\"I remember him talking about, 'You know, I really didn't like your guys' game plan against us. You guys shifted and motioned every play; it was annoying,'\" Moore said. \"And I was like, 'Thanks, coach, I appreciate it.' But as much as I could, tried to get as much information from him as possible. And that's really where the connection's grown.\"\n\n        \n            \n                College Football Playoff Rankings projection: SEC leaders set for massive Week 12, Texas Tech cements status\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nThe mentorship comes as Moore, now deep into his second year at Michigan, faces a stretch that could define both the program and his tenure. The Wolverines (8-2) play Northwestern in a neutral-site game at Wrigley Field in Chicago this Saturday, then travel to Maryland before closing the season against rival Ohio State. A clean sweep in these games would likely secure a CFP berth and could also put Michigan, currently 5-1 in conference play, in position for a spot in the Big Ten Championship Game, depending on tiebreakers involving Oregon and USC, who also each have one conference loss.It's not out of reach, considering the Wolverines have owned the Buckeyes in recent years, winning four straight in the historic rivalry. Michigan's odds to make the CFP sit at +600 at FanDuel Sportsbook. Sherrone Moore under pressure to win big at MichiganDespite the opportunity, skepticism still surrounds Moore. His first season ended 8-5 after taking over from Jim Harbaugh, and this year Michigan is 0-2 against teams currently ranked nationally. The offense, led by No. 1 recruit and freshman quarterback Bryce Underwood -- rumored to have signed an NIL deal worth up to $10 million -- has struggled to produce consistently, ranking in the bottom half of the Big Ten in points per game (28.1).\nUnderwood has thrown for just 185.7 yards per game with seven touchdowns and three interceptions, showing flashes of talent but also the growing pains typical of a freshman quarterback with limited talent at receiver.Meanwhile, star running back Justice Haynes remains week-to-week with a right foot injury, having been sidelined prior to Michigan's bye week for the 21-16 win against Purdue. Haynes ranks second nationally with 122.4 rushing yards per game and averages 7.1 yards per carry, fourth-best among running backs with at least 100 attempts this season.Combined with the high expectations placed on Underwood and a roster heavily invested in recruiting and development, these offensive struggles have intensified scrutiny of Moore's leadership. The focus is on whether he can translate his experience -- and lessons drawn from Saban -- into consistent on-field success.\nWhile the Wolverines' path to the playoff is still very much alive, the upcoming games will test Moore's adjustments, game management and the ability of his young roster to perform under pressure. How Michigan finishes the season could set the tone for both its postseason prospects and also for the perception of Moore's overall trajectory as coach in Ann Arbor.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michigan's Sherrone Moore details 'connection' with Nick Saban ahead of CFP push - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/fd989e23-097a-4d1a-9119-7a26b904a385/thumbnail/1200x675/8d6c66bc3ab4af87e82de3fab09688b7/sherrone-moore.jpg"
      ],
      "datePublished": "2025-11-11T18:51:03.000Z",
      "dateModified": "2025-11-11T18:51:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 12 college football picks, predictions, bets from legendary expert on 29-17 roll - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-picks-predictions-week-12/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/26/e0780901-ade9-462b-9111-465a573f3d98/thumbnail/1200x675/3ff6b18d7573a4d0ea602106dc1b8de6/marcel-reed-texas-am-aggies-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-11T19:15:34.000Z",
    "description": "\n        The SEC takes the spotlight during the Week 12 college football schedule with a pair of top-15 matchups. No. 4 Alabama hosts No. 12 Oklahoma,",
    "body": "\n        The SEC takes the spotlight during the Week 12 college football schedule with a pair of top-15 matchups. No. 4 Alabama hosts No. 12 Oklahoma, while No. 5 Georgia hosts No. 11 Texas. The latest Week 12 college football odds list the Tide and the Bulldogs both at -6 in their respective matchups.Other Week 12 college football lines of note include No. 19 USC (-6.5) vs. No. 20 Iowa, No. 10 Notre Dame (-11.5) vs. No. 24 Pittsburgh and No. 3 Texas A&M (-19.5) vs. South Carolina. Before locking in any Week 12 college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters Week 12 of this season on an 29-17 run on his official SportsLine college football picks as well, returning more than $1,000 for $100 bettors. Anyone following could have seen huge returns. \nNow, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for Week 12 and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:Top college football predictions for Week 12One of the top college football picks Marshall is recommending for Week 12: He likes No. 3 Texas A&M (-19.5) to cover against South Carolina in a noon ET kickoff on Saturday. He's also taking the Over (47.5) in this matchup.\nThe Aggies are coming off two of their most impressive overall performances of the season, beating Missouri 38-17 in Week 11 and LSU 49-25 back in Week 9. South Carolina, meanwhile, is having a nightmare season as the Gamecocks have just one SEC win and have covered just once since late September. \"The home team has won outright last four seasons, though the Gamecocks have covered in last three meetings, including a 44-20 romp at Williams-Brice last October,\" Marshall told SportsLine. Still, a disappointing campaign for SC, a team that has lost six of last seven outright, and is only 3-5 last eight vs. spread. The unbeaten Ags have now covered four of last five as they push forward, also have gone Over in last four in 2025, and they are 8-2 to the Over since late 2024.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football picks for Week 12Marshall has evaluated every other matchup, and he's backing a coach who is on a 15-4 streak against the spread dating back to last season. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month for $1.\nSo what college football picks can you make with confidence, and what alarming trend do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 29-17 run on college football picks this season, and find out.College football odds for Week 12 notable gamesSee full Week 12 college football picks, odds, predictions here(odds subject to change)Tuesday, Nov. 11Kent State vs. Akron (-5.5, 46.5)Ohio vs. Western Michigan (-1.5, 46.5)Wednesday, Nov. 12Buffalo vs. Central Michigan (-2.5, 43.5)Toledo vs. Miami-OH (+3, 44.5)Thursday, Nov. 13Troy vs. Old Dominion (-10.5, 53.5)Friday, Nov. 14Clemson vs. Louisville (-3.5, 51.5)Minnesota vs. Oregon (-22.5, 45.5)\nSaturday, Nov. 15Michigan vs. Northwestern (+10, 41.5)Notre Dame vs. Pittsburgh (+10.5, 56.5)\nUCF vs. Texas Tech (-23.5, 48.5)NC State vs. Miami (-14.5, 55.5)Iowa vs. USC (-6.5, 49.5)\nOklahoma vs. Alabama (-6, 45.5)Texas vs. Georgia (-6, 48.5)UCLA vs. Ohio State (-32.5, 48.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 12 college football picks, predictions, bets from legendary expert on 29-17 roll - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/26/e0780901-ade9-462b-9111-465a573f3d98/thumbnail/1200x675/3ff6b18d7573a4d0ea602106dc1b8de6/marcel-reed-texas-am-aggies-imagn-images.jpg"
      ],
      "datePublished": "2025-11-11T19:15:34.000Z",
      "dateModified": "2025-11-11T19:15:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas vs. Georgia sets SEC playoff stage: Can Steve Sarkisian overcome Longhorns' big-game struggles? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-vs-georgia-sets-sec-playoff-stage-can-steve-sarkisian-overcome-longhorns-big-game-struggles/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/09/750d58c9-c898-4216-93bd-36712c7fbfb5/thumbnail/1200x675/a588deb1dae4ab8dd009a38c5ca0c871/sarkisian.png",
    "tag": "Sports",
    "date": "2025-11-11T18:15:07.000Z",
    "description": "\n        The gamesmanship between Kirby Smart and Steve Sarkisian started long before kickoff ahead of Saturday's seismic SEC battle between fifth-ran",
    "body": "\n        The gamesmanship between Kirby Smart and Steve Sarkisian started long before kickoff ahead of Saturday's seismic SEC battle between fifth-ranked Georgia and No. 11 Texas. The Bulldogs coach texted Sarkisian over the weekend prior to his team's 41-21 romp at Mississippi State, shooting the breeze concerning the trek from Tupelo to Starkville with their nationally-ranked matchup upcoming.\"I texted with Sark today about the drive we had over here,\" Smart said after his team's eighth win. \"I was like, this drive is an hour and five minutes. Couldn't believe it \"(Texas) had the same thing. ... I have no idea what he was doing. I was just texting with him.\"There's no tactical advantage gained over a travel discussion, but psychologically, Smart floating his name across Sarkisian's phone on gameday is a not-so-subtle reminder of the weekend's implications. Not it was necessary considering Sarkisian was already knee-deep in gameplan prep and his struggles in spotlight games for the Longhorns are well-documented.Sarkisian has won 32 of his last 39 games at Texas, but is just 1-5 against top 6 opponents during that stretch, including a pair of losses to Smart and Georgia. Sarkisian gets another crack at the Bulldogs, this time between the hedges, in what could set up as a playoff elimination game of sorts for the Longhorns.\nMuch can happen over the season's final three weeks during a year filled with parity in the 12-team bracket discussion, but from the standpoint of controlling its own destiny in the at-large discussion en route to 10 wins, Saturday's opportunity is a must for Texas.Texas vs. top-6 opponents under SarkisianOct. 11, 2025No. 6 Oklahoma, 29-21 (WIN)Aug. 30, 2025No. 3 Ohio State, 14-7 (LOSS)Jan. 10, 2025No. 6 Ohio State, 28-14 (LOSS)Dec. 7, 2024No. 5 Georgia, 22-19 (LOSS)Oct. 19, 2024No. 5 Georgia, 30-15 (LOSS)Jan. 1, 2024No. 2 Washington, 37-31 (LOSS)Sept. 9, 2023No. 3 Alabama, 34-24 (WIN)Nov. 12, 2022No. 4 TCU, 17-10 (LOSS)Sept. 10, 2022No. 1 Alabama, 20-19 (LOSS)Oct. 9, 2021No. 6 Oklahoma, 55-48 (LOSS)This season's win over Oklahoma during Red River snapped the program's five-game losing skid against elite competition under Sarkisian. While the Longhorns have beaten several ranked teams during that stretch, including conference champions Clemson and Arizona State in last year's playoff, they've struggled to produce against the best of the best — part of the reason consecutive seasons have ended with semifinal appearances with no hardware.Execution in late-game situations deserves much of the blame. Trailing by a touchdown near midfield at the two-minute warning during the season-opening loss at Ohio State, Arch Manning and the offense went nowhere in four plays.Previously, Texas settled for an overtime field goal on its only possession before losing to Georgia in last season's SEC Championship Game and had red-zone malfunctions in playoff semifinal setbacks against Ohio State and Washington back-to-back years with the national title game on the horizon.Prior to that, one-possession losses to TCU, Alabama and Oklahoma during Sarkisian's first two seasons were quite painful.Those results are in the past and mean nothing to the players involved this weekend. And the Longhorns are taking their back-against-the-wall mentality into the matchup with the Bulldogs.\"We always want to win, we know we can't lose,\" Texas cornerback Malik Muhammad said over the weekend. \"We know we don't have any room to lose. So we always motivated. Everybody is hungry because we don't breed losers, we breed competitors. So everybody is always looking to do something more.\"Trench warfare will define the SEC's marquee contest of Week 12 given the Longhorns' strengths at the line of scrimmage. This Texas front is giving up just 78.2 yards rushing per game, which ranks No. 2 nationally and tops in the conference.By comparison, Georgia is coming off a 303-yard effort on the ground at Mississippi State and for the first time since 2022, is hoping to end the campaign with an average of 200-plus yards per game. Nate Frazier managed 181 yards on 12 carries last time out, his first 100-yard outing of the season and second of his career.Sarkisian's mid-week message during the open date was fine-tuning issues that have given the Longhorns problems this fall, essentially, fixing themselves before worrying about what the opposition will bring.Sounds like a page taken from Smart's playbook, right?\"We've got to look at how people are attacking us in all three phases right now.\" Sarkisian said. \"We've got to make sure we've got enough tools in our toolbox to combat that stuff. As much as I want to get a head start on Georgia, we've got to look at ourselves first.\"Sark simplifies the offenseSarkisian faced harsh criticisms last month following the Longhorns' ugly 16-13 win at Kentucky, and defended his decision to continue calling plays as the brains behind the Texas offense.He tweaked some things against Mississippi State and Vanderbilt, giving Manning a chance to find a rhythm early with a bunch of horizontal, quick-fire throws that were timing based and less read dependent. Texas went 11 personnel and found openings in space, highlighted by Ryan Wingo's 75-yard catch-and-run for a touchdown on the first play of the game.Overall results have impressed offensively since the effort in Lexington — 45 points during a comeback win over the Bulldogs and a 34-point showing in the victory over the nationally-ranked Commodores.Manning had his best game as a collegian in his last start, throwing for 328 yards and three scores during a 25-of-33 afternoon. That's consecutive 300-yard performances from the redshirt sophomore, who's now averaging 235.9 yards per game.Given Georgia's lack of havoc stats on defense within a unit that ranks last I the SEC in sacks and tackles-for-loss this fall, perhaps the Longhorns' modified plan offensively generates success in Week 12.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas vs. Georgia sets SEC playoff stage: Can Steve Sarkisian overcome Longhorns' big-game struggles? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/09/750d58c9-c898-4216-93bd-36712c7fbfb5/thumbnail/1200x675/a588deb1dae4ab8dd009a38c5ca0c871/sarkisian.png"
      ],
      "datePublished": "2025-11-11T18:15:07.000Z",
      "dateModified": "2025-11-11T18:15:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavericks GM Nico Harrison fired: Candidates to replace the embattled executive - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nico-harrison-hot-seat-mavericks-gm-replacement-candidates/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/10/4b432c11-d755-425c-a2ac-0b6c92bd2cf7/thumbnail/1200x675/bc99f336791f4f2784cf442fa5788eed/cuban-getty.png",
    "tag": "Sports",
    "date": "2025-11-11T17:59:50.000Z",
    "description": "\n        Nico Harrison was fired as the general manager of the Dallas Mavericks Tuesday. Between a dreary 3-8 start and the vociferous \"fire Nico\" cha",
    "body": "\n        Nico Harrison was fired as the general manager of the Dallas Mavericks Tuesday. Between a dreary 3-8 start and the vociferous \"fire Nico\" chants that remain a constant at Mavericks home games, it seemed as though it was only a matter of time before Harrison was axed. It turns out trading Luka Dončić may not have been the best idea.The firing will surely bring some measure of relief to a fanbase that appears utterly determined to boo Harrison out of this job, but it won't be long before that relief is replaced by a new sort of anxiety. This is a tricky job, one with plenty of upside, but a fair amount of downside. Having Cooper Flagg means everything. His mere presence gives Dallas hope for the future. But without control over their first-round picks between 2027 and 2030, we're headed into one of the most critical stretches in Mavericks history.\n        \n            \n                If Nico Harrison is really on the hot seat, that may be the best news Mavericks fans have gotten all season\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nAssistant general managers Michael Finley and Matt Riccardi have been named co-interim general managers to oversee basketball operations, but the Mavericks said Tuesday that a \"comprehensive search will begin for a permanent replacement.\"Whoever replaces Harrison needs to be prepared to act swiftly and decisively to safeguard Flagg's future. That probably means trading Anthony Davis and it may mean trading several other veterans as well. Those moves should come fairly quickly. No team needs a high 2026 draft pick quite as badly as the Mavericks do considering all of the future picks headed out the door.\nThose basketball needs are paramount, but they're not the only consideration here. The Mavericks don't just need a smart basketball mind. They need someone who can serve as an effective ambassador between the organization and the fans, someone who can mend fences and clearly convey his plan to an antsy fanbase. That means that executives who either have an established track record or some credibility within the organization will likely be at the top of any early list of candidates. The Mavericks aren't just trying to win games here. They're trying to win back fans who may already have abandoned them.It's too early to say definitively who is and is not a candidate for this job, but there are obvious names to watch. Those names either have ties to the Mavericks or strong enough reputations to take such a complicated job in the middle of a season and make the most of it. So here are the early names to keep an eye on as we await a seemingly inevitable change in Dallas.Mark CubanOkay, let's define our terms here. Mark Cuban is not going to be the next general manager of the Dallas Mavericks. He has never held that title, nor has he been responsible for all of that job's functions. He's busy. He's not going to be the person in that building grinding mid-major tape and traveling to Europe to watch a 19-year-old second-round prospect.\nBut Mark Cuban rather successfully oversaw basketball operations for the Mavericks for a quarter century. When Patrick Dumont and Miriam Adelson bought the team, reporting at the time claimed that Cuban would retain control over basketball matters. Obviously that isn't how it played out. Harrison seemingly nudged Cuban out. Well, Harrison is gone now. Cuban still owns a 27% stake in the team and, unlike the current majority ownership, does have some subject-matter expertise here.Would Cuban take on such a role after seeing being deprived of it when he sold the team? Would he need an agreement in writing about what he could and couldn't do in that position? Heck, does he even want to run a basketball team anymore? All of this is unclear. But the most successful period in Mavericks history came with Cuban at the helm. He'd have to hire or empower internal candidates to manage the day-to-day and only loop him in on big-picture decisions, but, at the very least, Cuban is more qualified to run basketball operations for the Mavericks than Dumont is.Michael FinleyIn Tim MacMahon's book \"Wonder Boy\" about the Dončić era in Dallas, he detailed a five-man committee Cuban assembled to help hire a new coach and general manager in 2021, a search that ultimately yielded Harrison and Jason Kidd. Those five men were Dirk Nowitzki, who is otherwise occupied with a studio job and has no experience in a full-time front office position, Keith Grant, the former assistant GM who has since retired, Casey Smith, the former head athletic trainer who now works for the Knicks, Don Kalkstein, the team's sports psychologist, and Michael Finley, one of the team's current assistant general managers and a former All-Star in Dallas. \nOf the five, Finley holds by far the most prominent role in Dallas today. He was part of Cuban's inner circle, but also worked under Harrison. He is an experienced executive, but also a respected former player who should mostly satisfy the fanbase (provided its more conspiratorial wing has gotten over the beer incident with Dončić). If Cuban returns to a more prominent role, Finley is a feasible fit underneath him. If not, Finley has been a candidate for GM jobs in the past, including in Dallas, and would seemingly be a name to watch this time around as well if internal candidates are considered.Matt RiccardiFinley is one of the assistant general managers underneath Harrison. Matt Riccardi is another. He lacks Finley's reputation and playing experience, but he has subtly become important to the Mavericks not only as a decision-maker on basketball matters, but as a voice and face for the front office.After Harrison's disastrous press availability last April, Riccardi became a sort of unofficial spokesman for the Mavericks. He was the team's representative in the lottery drawing room when they won Cooper Flagg, and he made a number of podcast and on-camera appearances over the course of the offseason to discuss the team, which is something of a rarity for executives that don't have the general manager title or decision-making powers. Given the severity of the messaging issues Dallas had in the wake of the Dončić trade, that is quietly a pretty important part of this job. It displays a level of trust from ownership that appears to be lacking in Harrison and that trust could make him a candidate for the full-time job.\nDennis LindseyThough Harrison will be remembered for his worst moves, he did have a stretch in 2023 and 2024 during which he took the Mavericks from the lottery to the Finals. After the Dončić trade, Haralabos Voulgaris, the former professional gambler and alleged shadow GM of the Mavericks, hinted on Twitter that Lindsey, the former GM of the Jazz who was with the Mavericks during the Finals season, was somewhat responsible for that success. Well, in July of 2024, the Pistons hired Lindsey away from the Mavericks. Things fell apart from there. Correlation does not necessarily equal causation, but perhaps having another experienced general manager in the building could have protected Harrison from his worst impulses. Lindsey built the Donovan Mitchell-Rudy Gobert Jazz teams that achieved quite a bit of regular-season success, so if he built up any goodwill with ownership in Dallas during his brief tenure with the Mavericks, he'd figure to be a name they consider as well.Bob MyersIt's the name that comes up in every high-profile GM search. If Bob Myers wants to run a team, he'll be able to run a team. At the moment, Myers is technically running several of them. He was recently named the new president of Harris Blitzer Sports & Entertainment, the group that owns the Philadelphia 76ers, New Jersey Devils and Washington Commanders. That job differs quite a bit from a standard GM gig. It's more of an oversight position than day-to-day management. On the surface, it seems less stressful.\nAny team trying to hire a GM should call Myers and, if he's interested, talk to him. According to Tim Cato, Patrick Dumont actually did over the summer. Aside from his track record as a talent evaluator for the Warriors, he is extremely well regarded as a manager of people. Holding together a dynasty isn't easy, but Myers did it for nearly a decade. Given some of the less tactful ways Harrison seemingly reshaped the organization in his image, having someone like Myers who would likely be able to rally the staff and gain immediate fan support would be quite valuable. But, for the time being, there just isn't any indication that Myers wants to be a GM again and, even if he does, we don't know how loose his current contract is. Could he leave for a GM job if he wanted? Maybe. Until he shows real interest, it probably isn't worth too much thought.Masai UjiriLet's say the Mavericks want to go big-game hunting but Myers is off of the table. Suddenly, the number of available, championship-winning executives looks pretty small. The Nuggets just fired Calvin Booth, but given the drama that doomed both him and Michael Malone in Denver, he probably isn't suited to a high-pressure job like this. Mitch Kupchak is technically an advisor for the Hornets, but is so far removed from his titles that he probably isn't worth pursuing. The same was true of Joe Dumars. The Pelicans ignored that and look where it got them. Most other title-winning executives are spoken for. Or, in Donnie Nelson's case, have already been fired by the Mavericks.Between the executives we've already covered and the ones still employed by other teams, there are amazingly only two championship GMs left to be theoretically hired. The first is Masai Ujiri. Five years ago, this is a slam dunk hire. Teams regularly used to try to poach Ujiri when the Raptors were at their peak. But they haven't won a playoff series since 2020 and the current roster that he largely built looks somewhat directionless. Further, his later Raptors teams shared many of the same issues the Harrison Mavericks currently have: too many big, athletic defenders and not enough shooting and ball-handling. Ujiri would have to explain some of his later decisions in Toronto, but he figures to be in the mix for future GM openings if he wants to be.\nDavid GriffinGriffin is the other championship-winning GM who's on the market, and considering how poorly things have gone in New Orleans since he was fired, it's worth wondering how much blame he really bears for the poor fortunes of the Pelicans. He largely drafted well there, landing players like Trey Murphy and Herb Jones after the lottery, and it's not his fault Zion Williamson frequently got hurt. There were certainly misses as well, with the Dejounte Murray trade coming to mind, but considering Griffin's track record in Cleveland, he's probably going to draw consideration for future GM jobs as well.One of the fringe benefits of a Griffin hire? He started his NBA career in Phoenix's PR department and has done television work between jobs. In other words, he's media friendly. He should be able to explain his decisions to an irritable fanbase more effectively than Harrison did.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavericks GM Nico Harrison fired: Candidates to replace the embattled executive - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/10/4b432c11-d755-425c-a2ac-0b6c92bd2cf7/thumbnail/1200x675/bc99f336791f4f2784cf442fa5788eed/cuban-getty.png"
      ],
      "datePublished": "2025-11-11T17:59:50.000Z",
      "dateModified": "2025-11-11T17:59:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavericks fire Nico Harrison: Three moves Dallas must make to get back on track - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/mavericks-fire-nico-harrison-whats-next-davis-flagg/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/b5f63beb-d67f-49d5-8755-5a09257b2255/thumbnail/1200x675/1ddd5dd5fa28af51ece5fd5972d082e1/flagg-imagn.png",
    "tag": "Sports",
    "date": "2025-11-11T18:23:37.000Z",
    "description": "\n        The Dallas Mavericks have fired embattled general manager Nico Harrison. The move comes nine months after making the highly controversial dec",
    "body": "\n        The Dallas Mavericks have fired embattled general manager Nico Harrison. The move comes nine months after making the highly controversial decision to trade franchise centerpiece Luka Dončić to the Los Angeles Lakers for a package centered around Anthony Davis. It's a surprising firing to no one and the Mavericks fanbase is undoubtedly elated that the man who traded away their franchise darling is no longer making decisions for the team.   Harrison's now out and that should provide some relief and validation for the fans who have been incredibly vocal in the months since the trade. Now the Mavericks must clean up Harrison's mess. Dončić isn't walking back through that door, so Dallas must figure out the path ahead for the rest of the season to at least right some of the wrongs Harrison has done.   The Mavericks have named Matt Riccardi and Michael Finely as interim co-general managers, but team governor Patrick Dumont plans on leading an exhaustive search to find a long-term replacement for Harrison. While the next permanent decision-maker is unknown, some of the decisions that should be made in the immediate aftermath of Harrison's firing are pretty straightforward.   With Harrison on his way out, let's take a look at three things the Mavericks must do now.   \n\n        \n            \n                Mavericks fire Nico Harrison: General manager ousted less than a year after Luka Dončić trade\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \n   1. Trade Anthony Davis   Davis should immediately become a trade candidate. This is no fault of Davis; it was always going to be difficult to make Mavericks fans fully support him when he's a reminder of what they lost in that trade every time he suits up. But the man who was so enamored with bringing Davis to Dallas is no longer in charge, so a new vision will certainly be in place regardless of who takes the job. I'm sure it also doesn't sit right with Davis that Dumont told a Mavericks fan at the game Monday night that the Dončić trade was \"a mistake.\"   That aside, Davis' fit on this team became a problem as soon as the Mavericks' 1.8% chance of landing the No. 1 overall pick in the 2025 Draft went from a long shot to reality. When Cooper Flagg became a member of the Mavericks, Davis became even more expendable. Flagg can naturally shift between both forward positions, but the abundance of forwards on this team and the lack of healthy guards has forced him to play out of position. Flagg's been operating as a combo guard, despite that not being best suited to his strengths.    The simpler move -- and more fruitful at this point -- would be to trade PJ Washington. But the Mavericks have already committed to Washington on a four-year, $88.7 million deal and he's not eligible to be traded until the summer. Washington is also the better fit next to Flagg for the time being, while Davis' presence clogging the paint alongside any of Dallas' other bigs who can't stretch the floor limits Flagg's ability to attack the rim.   \nTrading Davis is easier said than done. He's missed the last six games due to a calf strain, though his return is imminent. In the five games he played, Davis is averaging 20.8 points, 10.2 rebounds and 2.2 assists on an efficient 52% from the floor. He's an All-Star, All-Defensive player when he's healthy, but Davis' durability will be the focal point in any trade conversations.   Any return for Davis should come with a quality guard attached. Until Kyrie Irving returns, there has to be a better solution than the current options, and that includes D'Angelo Russell, who has been a massive disappointment thus far. Could the Mavericks convince the Bulls to part ways with Coby White in exchange for the hometown kid in Davis?    The Bulls have been cooking without White, who has yet to make his season debut. He would fit in seamlessly in the backcourt alongside Josh Giddey, who is putting together an All-Star campaign, but Chicago is also in desperate need of some rim protection. Sending White and Nikola Vucevic to the Mavericks in exchange for a package centered around Davis would solve some problems for both teams. Vucevic is the kind of floor-spacing big who would be the most ideal to place next to Flagg. White is a dynamic guard who is closer to Flagg's timeline at 24 years old.   \nThe Spurs could be another logical trade partner here. De'Aaron Fox might appear like the odd man out in San Antonio's backcourt logjam thanks to the quick ascension of Stephon Castle and rookie Dylan Harper. Fox can't be traded until Feb. 4 and it would take a lot to make the money work, but a Fox and Irving backcourt could work for Dallas.   Trading Davis works for both sides. Davis can -- hopefully -- be sent to a contending team, while the Mavericks can go all-in on building around Flagg for the future. Speaking of which...      2. Go all-in on rebuilding around Flagg   This goes hand-and-hand with the first point. This should've been Dallas' plan entering the season, because it's not every day that a generational star falls in your lap. The Mavericks have been lucky for that to happen to them twice in the last 10 years. Having Flagg extends Dallas' runway back to competitiveness and everything done from this point forward should be done with thought about how it's going to best serve his development.   \nThat means, as mentioned above, trading Davis and hoping you net a quality package that comes with draft capital in return. That also means trading someone like Klay Thompson, who looks like he'd rather be on his boat than out there with this team with the way he's playing. Thompson's averaging a career low in points (7.4), while shooting worse than he ever has (31.4% FG, 26.7% 3P). Jason Kidd finally moved Thompson to the bench after an abysmal start to the season, but trading him to a team better suited to highlight his elite catch-and-shoot ability would be better for all involved.   The same is true of someone like Daniel Gafford, who will draw significant interest from teams around the trade deadline. Gafford was likely going to be a trade candidate regardless of Harrison's employment because you have Dereck Lively II, but this might make that a certainty. Lively has durability issues of his own, so keeping Gafford to this point has been more of an insurance policy for the Mavericks. But that's when they were trying to compete for a playoff spot.    The goal for the rest of the season shouldn't be to immediately compete, which was what Harrison was aiming for. The Mavericks should be focusing on Flagg's development and hoping they get a good shot at landing a top-5 pick in what's expected to be yet another extremely loaded draft class.    \nFlagg doesn't turn 19 until December, so there's no reason to expedite this process. Stockpiling young talent through trades and the draft should be the plan this year, especially when the Mavericks don't control any of their first-round picks from 2027 to 2031. This is the golden year to bottom out and hope you get blessed by the ping pong balls again to get a shot at drafting the likes of Darryn Peterson or any of the other prized names at the top of the draft board.   Every game should be an opportunity for Flagg to get the reps needed to develop and learn from his mistakes. There should never be a scenario in which Russell is the one taking three straight bad shots down the stretch of a close game, which is what happened at the end of Dallas' loss to the Rockets. The ball should be in Flagg's hands, or at the very least he should be involved in those late-game plays instead of just standing in the corner and watching Russell or Thompson jack up shots.   Flagg is the Mavericks' future and they need to do everything to put him in the best position to succeed for the rest of the season.   \n   3. Repair relationship with the fans   I don't think we've seen a reaction to a trade quite like we have since the Mavericks traded Dončić. Protests were held outside the arena and chants of \"Fire Nico\" became a constant at home games, most recently when Washington was taking what would've been game-tying free throws against the Bucks Monday night in the fourth quarter.   Mavericks fans made it known loud and clear how they felt about the trade. Some even abandoned the team completely and became Lakers fans because of Dončić. It didn't help that the messaging since the Dončić trade only flamed the anger from the fans. Harrison's constant refrain of \"defense wins championships\" in response to why the Slovenian superstar was traded was met with confusion. His words about how the team wasn't convinced Dončić would sign the incredibly lucrative extension he was eligible for last summer despite his constant commitment and loyalty to the franchise was seen as a fraudulent excuse.   Harrison and Dumont took a fiercely loyal fanbase for granted and have seen the consequences play out over the last nine months. The Mavericks' 24-year sellout streak ended when they hosted the Pelicans on Nov. 5. The longest sellout record in the league came to an end and could be directly correlated to the Dončić trade. But it's not just the trade, it's everything that's come out about Harrison's tenure what's and happened since the trade, too.    \nAssistant coach God Shammgod, who had been with the team for the entirety of Dončić's career in Dallas, left to join the Orlando Magic's coaching staff in the summer. Shammgod said the trade was a big reason why he bolted for Orlando. The Mavericks fired longtime team trainer Casey Smith in 2023 to the dismay of both Dončić and franchise legend Dirk Nowitzki. Smith had been with the Mavericks for two decades and it was his dismissal that reportedly led to Nowitzki distancing himself from the franchise.   Harrison eroded the trust of Mavericks fans and Dumont signed off on all of it. Dumont has taken a step in the right direction after publishing an open letter confirming Harrison's firing and acknowledging the impact the last nine months have had on the fans.\"I understand the profound impact these difficult last several months have had,\" Dumont wrote. \"Please know that I'm fully committed to the success of the Mavericks.\"\nFiring Harrison was the right decision, but now the Mavericks need to look ahead and course correct what's transpired over the last nine months. Riccardi and Finley will be tasked with trying to lead Dallas out of what's been a dark period of time for the franchise, and while their plan forward is unclear, it can't get worse than what Harrison did nine months ago. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavericks fire Nico Harrison: Three moves Dallas must make to get back on track - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/b5f63beb-d67f-49d5-8755-5a09257b2255/thumbnail/1200x675/1ddd5dd5fa28af51ece5fd5972d082e1/flagg-imagn.png"
      ],
      "datePublished": "2025-11-11T18:23:37.000Z",
      "dateModified": "2025-11-11T18:23:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ranking current college football head coach openings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ranking-college-football-open-coaching-jobs-2025-26/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/27/d7cdb758-25e2-46e8-9e02-447aa99d1fba/thumbnail/1200x675/b67203472bcdd95bbf250ba01ffc84ae/lsufootballcrowd.jpg",
    "tag": "Sports",
    "date": "2025-11-11T17:07:41.000Z",
    "description": "\n        The 2025 college football coaching carousel continued to churn after Hugh Freeze was let go from Auburn in his third season. The firing marke",
    "body": "\n        The 2025 college football coaching carousel continued to churn after Hugh Freeze was let go from Auburn in his third season. The firing marked the 13th of the 2025 season, including nine at the Power Four level. Last season, there wasn't a single power conference opening until the final week of the season. Auburn took a chance by swinging for Freeze, a controversial coach with a checkered past at Ole Miss. His penchant for beating Alabama and historic recruiting success gave him another chance. However, his run proved disastrous, providing the longest stretch of losing seasons since 1950 on The Plains. College football also got its first hiring of the 2025 cycle as interim Mark Carney was promoted to full-time head coach at Kent State after leading the program to a 3-5 start; the Golden Flashes managed just one combined win in two years under Kenni Burns. So far, this cycle is defined by a number of jobs that haven't opened in years. Oklahoma State is open for the first time since 2005. Penn State last made a hire in 2014. Even UCLA hasn't done a full coaching search since after the 2017 season. \nThere are several factors that go into evaluating an opening, and it's becoming more difficult in the player compensation era. Having the resources to compete at the highest level is at the top of the list, but a pathway to competitiveness also plays a part. The expanded College Football Playoff also changes the dynamic. Every job is unique, and each candidate will value them differently. With that said, here's how we rank all 13 FBS head coaching jobs in the 2025 cycle, broken up into Power Four and Group of Six levels. \n        \n            \n                College football coaching carousel tracker: Grades, analysis on coach changes, 2025-26 firings and hirings\n                \n                    Brandon Marcello                \n            \n                            \n    \n                \n                    \n    \nPower Four openings\n    \n                                        \n    1. LSUPrevious coach: Brian Kelly (34-14, 19-10 SEC)Previous salary: $10.2 millionLast conference title: 2019\nThere were some heavy hitting jobs open entering Week 9, but LSU is on the shortlist of those in contention for No. 1 in the sport. The program has recruited itself in the 21st Century thanks to its almost magical connection to the state of Louisiana, which ranks among the top talent-producing states in the country. Anything you can't find in the state, you can find a short jaunt away to Houston. Prior to Kelly, the last three coaches won national championships with the program. There are some mild questions about whether LSU is prepared to compete at the zenith of monetary investment across college football, but this is a job that doesn't just have championship upside -- they have championship expectations. \n    \n                                        \n    2. FloridaPrevious coach: Billy Napier (22-23, 12-16 SEC)Previous salary: $7.5 millionLast conference title: 2008On paper, Florida is close to an ideal job. The Gators boast elite recruiting territory with easy access to the state of Florida, and rising talent bases in Georgia and the Carolinas. Napier helped develop their organization from a recruiting and fundraising perspective, building some of the most talented rosters in the SEC. However, nearly all of Florida's historic success came under Steve Spurrier and Urban Meyer, two of the greatest coaches in history. Since then, the Gators have been a revolving door of mediocrity. This job is less turnkey than many may assume, but the championship ceiling is still (probably) there. \n\n    \n                                        \n    3. Penn StatePrevious coach: James Franklin (104-45, 64-36 Big Ten)Previous salary: $8.5 millionLast conference title: 2016For the right candidate, Penn State could be the best job on the market, if not one of the best in all of college football. There's little question the Nittany Lions have resources and commitment to winning, as the program moves on from James Franklin after reaching the national semis last year. He was able to pay top dollars for both coordinators, and built a monstrous roster. The athletic department's approach to recruiting grounds will be an interesting dynamic. Will they look for a Big Ten lifer? A national recruiter? Someone who can bring some SEC influence? This is the first time Penn State has opened under normal circumstances in essentially the entire modern era. Their process will be fascinating. \n    \n                                        \n    4. AuburnPrevious coach: Hugh Freeze (15-19, 6-16 SEC)Previous salary: $6.7 millionLast conference title: 2013\nAuburn has long carried a reputation as a schizophrenic program, but the highs are hard to ignore. In the 21st century alone, the Tigers have posted three AP top-two finishes, including a national championship in 2010. With Nick Saban now out of the picture at Alabama, Auburn finally has a chance to establish its own identity outside his shadow. That said, Hugh Freeze dragged the program to some of the lowest depths in its history. There's still a talented roster in place -- if the next coach can keep it intact -- but resetting the culture will be a challenge. Even so, the candidate pool should be strong, especially with LSU and Florida mired in university-level turmoil. Amazingly, Auburn -- yes, Auburn -- stands as a model of administrative alignment.\n    \n                                        \n    5. ArkansasPrevious coach: Sam Pittman (32-34, 14-29 SEC)Previous salary: $6.8 millionLast conference title: 1989The Razorbacks left the Southwest Conference for the SEC in 1992. Since then, the historically great program has struggled to find its place in the college football ecosystem. Arkansas has only six AP Top 25 finishes in 34 years in the SEC, including only one since 2011. Recruiting inroads in DFW have taken a hit since Texas, Oklahoma and Texas A&M entered the SEC -- along with the rest of the conference prioritizing the state. Adding another layer of complication, the men's basketball and baseball programs take legitimate attention away. The next Arkansas coach will have to establish an identity for this program, but the fan support is rabid. \n\n    \n                                        \n    6. Oklahoma StatePrevious coach: Mike Gundy (170-90, 102-72 Big 12)Previous salary: $6.88 millionLast conference title: 2011Let's be clear, Mike Gundy is Oklahoma State football. There have been 11 10-win seasons in program history; Gundy was part of 10 as either a coach or player. That said, the job Gundy leaves is very different from the one he took, for the better. Oklahoma State has invested heavily over the years in its program and has strong facilities and investment. While it won't rank at the top of the Big 12 in money, it's close enough to contend for the conference in the right circumstances. Gundy was a legend, but there's plenty of reasons to also believe that a new coach could have better success in utilizing the transfer portal and player compensation than Gundy ever did. \n    \n                                        \n    7. Virginia TechPrevious coach: Brent Pry (16-24, 10-13 ACC)Previous salary: $4.8 millionLast conference title: 2010\nVirginia Tech has ranked among the lowest-funded football programs in the ACC in recent years, but new guidelines passed by its board of trustees could change that -- and perhaps push this job up the list. The fan support and tradition have been tremendous at the school since the days of Frank Beamer, and the area around Virginia is becoming even more of a recruiting hotspot in recent years. If the money can come around, the Hokies can get back into the ACC conversation. If not, this isn't a great job. Which will it be? \n    \n                                        \n    8. UCLAPrevious coach: DeShaun Foster (5-10, 3-6 Big Ten)Previous salary: $3.1 millionLast conference title: 1998UCLA may be a Big Ten program, but the Bruins are a true bottom-feeder as currently constructed. When you hear talk about short-term cash infusion in the Big Ten, plenty of it is built around trying to save UCLA, which finds itself in a major financial hole. Consistent cross-country travel in the Big Ten and major focus on basketball takes away from the football team. The Rose Bowl is a blessing and curse as images constantly go viral for lack of fan support. Recruiting in Los Angeles is a huge advantage, but the Bruins have not signed a top 10 player in California since 2019. This job is an uphill battle, but certainly one with intrigue. \n\n    \n                                        \n    9. StanfordPrevious coach: Troy Taylor (6-18, 4-13 ACC/Pac-12)Previous salary: N/ALast conference title: 2015Jim Harbaugh and David Shaw did an incredible job of building Stanford into a consistent powerhouse in the Pac-12. In the era of transfer portal and NIL, though, the Cardinal's commitment to the new era is in question. Stanford's athletic department is heavily committed to non-revenue sports, and it's unclear how that will shape rev share. Getting Andrew Luck involved in the program is good news -- he will try to scrape together any advantage he can find. But how many advantages can there really be, especially as Stanford plays nearly all of its conference games across the country? Group of Six openings\n    \n                                        \n    1. Oregon StatePrevious coach: Trent Bray (5-14)Previous salary: $2 millionLast conference title: 2000\nThe Beavers have gone through one of the most complicated situations of any program in college football after the collapse of the legacy Pac-12. Numerous key players and coaches have abandoned ship over the last two years at the two remaining Pac-12 schools, but there's finally a light at the end of the tunnel. Oregon State won't necessarily compete with Power Four schools financially, but the Beavers should contend with the top of the new Pac-12 starting next year, and have the resources that can make it worthwhile for the right next candidate. \n    \n                                        \n    2. Colorado StatePrevious coach: Jay Norvell (18-26, 13-13 MWC)Previous salary: $1.9 millionLast conference title: 2002Colorado State has decent resources and nice facilities, but the Rams have struggled to put together a consistent product. The program has only one bowl appearance since 2017 and only one 10-win season in the past 20 years, coming under Jim McElwain. The program has upside, and joining the Pac-12 presents an interesting opportunity, but lack of consistent results over a long period of time presents questions. \n\n    \n                                        \n    3. UABPrevious coach: Trent Dilfer (9-21, 5-14 American)Previous salary: $1.45 millionLast conference title: 2020Four years ago, the Blazers seemed prepared to be a surging Group of Six darling as Bill Clark led the program to two Conference USA titles in three years. Instead, the program embarrassed itself with the hiring of Trent Dilfer, pushing them towards the bottom of The American. UAB has a great stadium built in 2021 and Birmingham is one of the biggest hotbeds of college football. The right hire could easily shoot them back up the list. \n    \n                                        \n    4. Kent State (Filled)Previous coach: Kenni Burns (1-23, 0-16 MAC)Previous salary: $525,000Last conference title: 1972Hired: Mark Carney (promoted from interim)Burns is on the shortlist of most disastrous coaching tenures in FBS history, but few Kent State coaches have found much success. Sean Lewis is the only coach to ever make multiple bowl games in program history, and the Golden Flashes have finished above .500 only 11 times in 64 seasons. This might be the worst job in the sport. Burns was fired before the season with Mark Carney serving as interim coach in 2025. Carney was promoted to the full-time role on Oct. 30. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ranking current college football head coach openings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/27/d7cdb758-25e2-46e8-9e02-447aa99d1fba/thumbnail/1200x675/b67203472bcdd95bbf250ba01ffc84ae/lsufootballcrowd.jpg"
      ],
      "datePublished": "2025-11-11T17:07:41.000Z",
      "dateModified": "2025-11-11T17:07:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn QB Joe Fagnano is college football's best-kept secret - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-footballs-best-kept-secret-uconn-qb-joe-fagnano-is-quietly-putting-together-a-masterful-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/2b3afbdb-2dae-4af0-980e-47871d9f19ce/thumbnail/1200x675/f15577e6791b540559410e9c4ac34175/fagnano.jpg",
    "tag": "Sports",
    "date": "2025-11-11T16:51:13.000Z",
    "description": "\n        The UConn Huskies were once one of college football's laughingstocks -- the ultimate little-brother program at a school that has long taken m",
    "body": "\n        The UConn Huskies were once one of college football's laughingstocks -- the ultimate little-brother program at a school that has long taken more pride in its basketball success.Under coach Jim Mora Jr., however, UConn has steadily climbed toward respectability. Over the last two seasons, the Huskies have become one of the more competitive non-power conference teams in the country. Mora deserves plenty of credit for rebuilding the program, but the catalyst for their latest leap has been the emergence of quarterback Joe Fagnano.Fagnano transferred from Maine in 2023 and redshirted after appearing in two games that season. In 2024, he split time at quarterback with Nick Evers but had seized the starting job by season's end -- leading UConn to its first bowl win in more than a decade with a victory over North Carolina in the Fenway Bowl.Entering the 2025 season, the senior was the unquestioned starter and has guided the Huskies to a 7-3 start. Wins over Air Force (Saturday, Nov. 15, noon ET, CBS Sports Network) and FAU to close the regular season would send UConn to a bowl game at 9-3, with a chance at the first 10-win season in program history.\nFagnano ranks among the nation's leaders in nearly every passing category, completing 68.8% of his passes (18th nationally) for 2,840 yards (second), 25 touchdowns (third) and zero interceptions (first). His production places him alongside the likes of Fernando Mendoza, Ty Simpson, Julian Sayin and other top quarterbacks -- though he's done it well outside the national spotlight.Some of that shine finally came his way Saturday, when he led UConn to one of the biggest wins in school history, a 38-35 victory over Duke. Fagnano was nearly flawless, completing 27 of 39 passes for 311 yards and three touchdowns, while adding 51 rushing yards.His film shows the kind of quick processing that has allowed him to post those numbers without a single interception all season. Years of experience show up in the way Fagnano diagnoses defenses at the snap and knows exactly where to go with the football.\nIt certainly helps Fagnano to have a dominant receiver, which he has in Skyler Bell, and they have been the nation's most prolific quarterback-receiver combination this season. Bell is second in the country in receiving yards (1,081), first in receptions (85) and set a new UConn single-season record with 13 touchdown catches already this season, which leads all FBS receivers by three. Bell's second TD catch against Duke was the game-winner, with Fagnano hitting him on the back shoulder at the pylon for the go-ahead score. \nIn the portal era, we are often enamored with what comes next for a player having a spectacular season, especially those outside the power conferences. But as a redshirt senior, this will be Fagnano's final season of college football. With no more eligibility, there will not be a transfer portal bidding war for him from power programs and he won't likely garner tons of NFL Draft buzz. \nFagnano's season is a reminder that sometimes it's worth just celebrating what's happening right now rather than speculating on what's to come. In the present, he's generated a level of excitement around the UConn football program it hasn't seen in more than a decade. Saturday's win over Duke had more than 38,000 in attendance, the most at Rentschler Field since 2013, and forced national eyeballs to take notice of what's going on in Storrs. Fagnano has already put up the greatest quarterbacking season in UConn history, and with three games left in his career (including a bowl game), he can further cement his spot in Huskies lore and lead the program to it's best-ever season. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn QB Joe Fagnano is college football's best-kept secret - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/2b3afbdb-2dae-4af0-980e-47871d9f19ce/thumbnail/1200x675/f15577e6791b540559410e9c4ac34175/fagnano.jpg"
      ],
      "datePublished": "2025-11-11T16:51:13.000Z",
      "dateModified": "2025-11-11T16:51:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Herb Dean says referees 'haven't been enforcing' part of eye poke rule in UFC - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/herb-dean-ufc-eye-poke-fingers-tom-aspinall-ciryl-gane-michael-bisping/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/b500514c-cd1e-462d-a43e-d860eb9fd5a1/thumbnail/1200x675/667d51dd46eec9a1e6f724bc3e1deed4/dustin-jacoby-getty.jpg",
    "tag": "Sports",
    "date": "2025-11-11T16:49:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The UFC 321 main event between heavyweight champio",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The UFC 321 main event between heavyweight champion Tom Aspinall and challenger Cyril Gane ended when Gane poked his fingers deep into both of Aspinall's eyes. Aspinall was unable to continue, and a spirited opening round from Gane amounted to nothing more than a no-contest.Worse for the UFC, paying customers, both fans in the arena and those who dropped significant money for the pay-per-view, are never happy when a main event ends in such an unsatisfying way.Deepening that frustration is the inconsistent application of rules by referees on a fight-to-fight basis.Veteran referee Herb Dean spoke on Michael Bisping's \"Believe You Me Podcast\" about a recent meeting of officials, not to add rules, but rather to enforce ones already in place.\n\"So we made a rule, it's a foul to extend the fingers towards the eyes,\" Dean said. \"That's the rule we've already had in place. So that rule has been there, but we haven't been enforcing it. So we're going to move forward on that.\"\nDean seemed to explain that the lack of enforcement on the rule preventing extending fingers toward the eyes stemmed from only wanting to take action if a damaging foul had actually taken place. This means not stepping in with a warning when fingers are extended toward an opponent's face or taking points for repeated infractions, but waiting until the illegal action actually results in the direct damage of an eye poke.\"I think people would not have been used to seeing someone get a point taken, because most of the time when we take a point, it's more of reactive to the [damage] and the unbalancing of the fight that's been done by a foul, and that's the only way we can think to balance it,\" Dean said. \"But this right here is a dangerous foul, and somebody's going to keep doing a dangerous action. We should start taking points by them doing that action before it actually happens to hurt somebody.\"The vast majority of MMA fights are three-round affairs. That means a single point deduction can dramatically impact the result of a fight.\nIt will be interesting to see how aggressively referees approach the renewed initiative to follow a rule already on the books that could lead to fight-changing point deductions.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Herb Dean says referees 'haven't been enforcing' part of eye poke rule in UFC - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/b500514c-cd1e-462d-a43e-d860eb9fd5a1/thumbnail/1200x675/667d51dd46eec9a1e6f724bc3e1deed4/dustin-jacoby-getty.jpg"
      ],
      "datePublished": "2025-11-11T16:49:17.000Z",
      "dateModified": "2025-11-11T16:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Bills' Sean McDermott is not considering adding Brian Daboll to his staff - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/brian-daboll-giants-firing-bills-sean-mcdermott-offensive-coordinator-joe-brady/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/11/1f7c7b4d-fcdf-4759-a9d7-6c45965def40/thumbnail/1200x675/0ccf23b077708c2bf3f8c41bab124558/mcdermott.jpg",
    "tag": "Sports",
    "date": "2025-11-11T17:02:03.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants' firing of Brian Daboll came a",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The New York Giants' firing of Brian Daboll came a day after Daboll's former employer, the Buffalo Bills, suffered an unexpected loss to the Miami Dolphins that led to Sean McDermott being asked about the state of Buffalo's offense.Before landing the Giants job, Daboll spent four years as McDermott's offensive coordinator in Buffalo and Daboll was largely credited with helping develop Bills quarterback and reigning league MVP Josh Allen. Could a reunion potentially be in the works?McDermott was asked point blank if he has considered adding Daboll to his coaching staff. He shot it down and backed his current offensive coordinator, Joe Brady.  \"Brian's a great coach,\" McDermott said Monday. \"Unfortunate to see that happen to him. At this point, that's not under any type of consideration.\"\n\n        \n            \n                Giants coaching candidates after Brian Daboll firing, plus one big name already ruled out\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nBrady is in the middle of his second full season as Buffalo's offensive coordinator. Through nine games, Brady's unit is sixth in the NFL in points scored. On Sunday, however, Buffalo's offense scored a season-low 13 points while turning the ball over three times. \"Joe's a good coach,\" McDermott said. \"He really is. We've got a really good offensive staff. They've had really good games. You're going to have some games you want back, some play calls you want back. It's how you respond to them and I'm fully confident in our offensive staff, and Joe as our leader, that we will make the adjustments we need to make and move us forward.\"\nWhile McDermott is currently not considering adding Daboll to his coaching staff, it's a question that could come up again if the Bills have another subpar offensive showing in the coming weeks. The Bills, now 6-3, will host the Buccaneers this weekend before going on the road for matchups against the Texans (who currently have the league's top-ranked scoring defense) and Steelers. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Bills' Sean McDermott is not considering adding Brian Daboll to his staff - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/11/1f7c7b4d-fcdf-4759-a9d7-6c45965def40/thumbnail/1200x675/0ccf23b077708c2bf3f8c41bab124558/mcdermott.jpg"
      ],
      "datePublished": "2025-11-11T17:02:03.000Z",
      "dateModified": "2025-11-11T17:02:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]