[
  {
    "title": "Cavaliers vs. Hornets prediction, odds, spread, time: 2026 NBA picks for Wednesday, Jan. 21 by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/cavaliers-hornets-odds-prediction-spread-line-time-2026-nba-picks-wednesday-january-21/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-21T21:30:42.000Z",
    "description": "\n        An Eastern Conference matchup tips off the Wednesday NBA schedule as the Charlotte Hornets host the Cleveland Cavaliers. Charlotte is 16-27 o",
    "body": "\n        An Eastern Conference matchup tips off the Wednesday NBA schedule as the Charlotte Hornets host the Cleveland Cavaliers. Charlotte is 16-27 overall, but coming off a 3-2 West Coast trip that included dominant wins over the Lakers and Nuggets. The Cavs are 24-20, though they were blown out 136-104 in a cross-conference showdown against the Thunder on Monday. Darius Garland (toe) and Sam Merrill (hand) remain out for Cleveland. Tipoff is at 7 p.m. ET from the Spectrum Center in Charlotte. The Cavs are 3-point road favorites in the latest Cavaliers vs. Hornets odds, while the over/under is 237.5. Before making any Hornets vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated Cavs vs. Hornets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Hornets vs. Cavs:Cavaliers vs. Hornets spread:    Cavaliers -3Cavaliers vs. Hornets over/under:    237.5 pointsCavaliers vs. Hornets money line:    Cavaliers -147, Hornets +124Cavaliers vs. Hornets picks:    See picks at SportsLineCavaliers vs. Hornets streaming:Fubo (Try for free)  New users can check out the latest FanDuel promo code to get $300 in bonus bets if your initial $5 wager wins:How to make Cavaliers vs. Hornets pickAfter 10,000 simulations of Hornets vs. Cavaliers, SportsLine's model is going Over on the total (222.5 points). Charlotte has seen four of its past five games go Over the total as the Hornets have been clicking on offense recently. Cleveland, meanwhile, has seen four of its last six games clear the total. The model is projecting that 10 players clear double figures with Donovan Mitchell and LaMelo Ball leading the scoring for their respective sides as the Over clears 61% of the time. The model also says one side of the spread hits well over 50% of the time. Head to SportsLine to see the model's NBA picks. So who wins Cavaliers vs. Hornets and which side of the spread hits well over 50% of the time. Visit SportsLine now to see which side of the Hornet spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. Hornets prediction, odds, spread, time: 2026 NBA picks for Wednesday, Jan. 21 by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/18fee7d8-f3a6-4964-9e9b-b70b5c9e0ed8/thumbnail/1200x675/956d84aaf3ec653598123cb36a06be80/donovan-mitchell-cleveland-cavaliers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-21T21:30:42.000Z",
      "dateModified": "2026-01-21T21:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Knicks-Nets, Bucks-Thunder, Kentucky-Texas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-bet365-bonus-code-cbsbet365-get-200-bonus-bets-knicks-nets-bucks-thunder-kentucky-texas/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2026-01-21T22:48:38.000Z",
    "description": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be unlocked by",
    "body": "\n        The latest bet365 bonus code CBSBET365 gives new users $200 in bonus bets after placing a first wager of $5 or more, which can be unlocked by betting on college basketball or NBA action on Wednesday night. Oklahoma City and Milwaukee meet at 9:30 p.m. ET, with the Thunder favored by 9.5 points. SportsLine's proven computer model prefers taking the Over (227) as one of its Wednesday best bets.  The model has also revealed picks for Kentucky vs. Texas at 7 p.m. ET, along with Knicks vs. Nets at 7:30 p.m. ET. The Knicks are favored by 11.5 points, according to the latest NBA odds at bet365. Claim the latest bet365 bonus code here:Check out our bet365 promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. It also enters Week 12 of college basketball on a sizzling 10-1 run on its top-rated over/under college basketball picks dating back to last season. Anybody following its college basketball betting and NBA betting picks at sportsbooks and on betting sites could have seen strong returns. Bet games at bet365 here:Wednesday's top picks, best betsKnicks -11.5 vs. Nets (-110)Over 227 in Bucks vs. Thunder (-110)Over 154.5 in Kentucky vs. Texas (-110)Combining the model's three picks into a three-leg parlay at bet365 would result in a payout of +596 (risk $100 to win $596). Bet it at bet365 here:\nKnicks -11.5 vs. NetsThe Knicks are in one of their worst stretches in recent years, losing nine of their last 11 games, with six of those setbacks coming by double digits. They never led and trailed by as many as 30 points in the first half of a 114-97 setback against Dallas on Monday. This is the perfect opportunity for New York to get back on track, as Brooklyn is 12 games back in the standings and is well into draft prep mode. The Nets have only won two games all month, and they have dropped seven of their last eight games. SportsLine's model has the Knicks winning by 14 points, covering the spread 56% of the time in the latest simulations. Back the Knicks at bet365 here:Over 227 in Thunder vs. BucksOklahoma City is coming off another impressive offensive display, putting up 136 points in a win over Cleveland on Monday. Star guard Shai Gilgeous-Alexander scored 30 points on 12-of-20 shooting, while Chet Holmgren added 28 points. Milwaukee is coming off a win of its own, beating Atlanta behind a 21-point performance from Giannis Antetokounmpo. Five of his teammates finished in double figures as well. The Thunder have gone Over the total in five of their last seven games, and the model has the Over cashing in 66% of simulations. Back the Over at bet365 here:Over 154.5 in Kentucky vs. TexasKentucky has turned its season around over the last two weeks, racking up a three-game winning streak. The Wildcats scored at least 75 points in all three of those outings, going over 90 points against Mississippi State while scoring 80 points at Tennessee last weekend. Texas has scored at least 70 points in seven straight games, recording at least 80 points in five of those games. The Longhorns have gone Over in 15 of their last 18 outings, and the Over hits 67% of the time in Kentucky vs. Texas on Wednesday. Back the Over at bet365 here:\nLooking for NBA and college basketball picks?You've seen the model's best bets for Wednesday. Now, get against the spread, total and money-line picks for every college basketball and NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use bet365 bonus code CBSBET365, get $200 bonus bets by backing Knicks-Nets, Bucks-Thunder, Kentucky-Texas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/08/991d6f95-e7f7-45ee-8fd1-85dbc9810625/thumbnail/1200x675/3020bf377b3b600042bdc7ffe309037c/bet365-promo-bet-5-get-200.jpg"
      ],
      "datePublished": "2026-01-21T22:48:38.000Z",
      "dateModified": "2026-01-21T22:48:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL Championship Round longshot parlay from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-longshot-parlay-picks-bets-conference-championship-games-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/e45a11bb-30d6-43e7-9611-3b6cb9f0e074/thumbnail/1200x675/6886ec4aa8edc6bfb05f47c3166d2877/usatsi-27523225z.jpg",
    "tag": "Sports",
    "date": "2026-01-22T00:55:27.000Z",
    "description": "\nThe 2026 NFL Championship Round takes place on Sunday as the Broncos host the New England Patriots (-5.5) at 3 p.m. ET and the Seahawks host the Rams",
    "body": "\nThe 2026 NFL Championship Round takes place on Sunday as the Broncos host the New England Patriots (-5.5) at 3 p.m. ET and the Seahawks host the Rams (+2.5) at 6:30 p.m. ET. While one could pursue standard NFL bets like the spread and total with a Championship Round NFL parlay, you could also take a chance on plus-money predictions. Wagers like alternate lines, exact score predictions and NFL props often have huge returns, and stringing them together within a single bet could be an NFL longshot parlay worth pursuing.The Pats have won four straight games by double digits and now get to face a backup quarterback in Jarrett Stidham who hasn't thrown a pass in two years. If you expect another huge Pats victory, then you could back New England on an alternate spread as Patriots -13.5 has +242 odds at DraftKings Sportsbook. This could be a standalone bet or as part of an NFL longshot parlay prediction. Before making any Championship Round NFL picks or parlays, you need to see the Championship Round NFL longshot parlay from SportsLine's proven computer simulation that pays out $1.1 million on a $10 bet.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the AFC and NFC Championship Games on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Championship Round NFL odds, it's locked in its betting picks to form a longshot NFL parlay that could pay out $1.1 million for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.Top Championship Round NFL parlay picksFor the Championship Round, one of the picks featured in the parlay is taking Denver's Zach Allen to have 1+ sacks (+191) versus the Patriots. Denver's 68 sacks led the NFL in the regular season and were just four shy of matching the all-time NFL record. Allen is the only member of this elite Broncos defense to be a First-Team All-Pro as the lineman had 7.0 sacks and lived in the offensive backfield. His 47 QB hits led all NFL players, even topping Myles Garrett, who set the single-season sack record.New England has allowed five sacks in back-to-back games, and just three quarterbacks were sacked more often than Drake Maye (47) in the regular season. Allen has at least 0.5 sacks in his last two playoff games, and this season he has three times as many sacks playing at home than in road stadiums. The Broncos are projected to have 4.42 sacks on Sunday, making this an NFL prop with great value to back. See the rest of the picks in the Championship Round NFL parlay here, and you can bet Allen to record a sack using the DraftKings promo code, which offers $300 in bonus bets if your bet wins right here:\nHow to make NFL parlay picks for a payout of $1.1 millionThe parlay also includes six additional picks from the Championship Round from SportsLine's computer model, including multiple touchdown props that return higher than +400. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for the Championship Round that can be combined into a parlay that returns $1.1 million on just a $10 bet, and what optimal touchdown scorer bets should you be all over? Visit SportsLine now to see the top Championship Round NFL picks from SportsLine's proven model that can be combined for a parlay that pays $1.1 million, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL Championship Round longshot parlay from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/e45a11bb-30d6-43e7-9611-3b6cb9f0e074/thumbnail/1200x675/6886ec4aa8edc6bfb05f47c3166d2877/usatsi-27523225z.jpg"
      ],
      "datePublished": "2026-01-22T00:55:27.000Z",
      "dateModified": "2026-01-22T00:55:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks vs. Nets prediction, odds, spread, line, time: 2026 NBA picks for Wednesday, Jan. 21 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/knicks-nets-odds-prediction-time-2026-nba-picks-january-21/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/16/b903939a-7a4f-455f-96fe-107396c3b120/thumbnail/1200x675/56fe9b25086199d4297a52c9faa7f87c/jalen-brunson-new-york-knicks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-21T22:40:38.000Z",
    "description": "\n        NBA Rivals Week 2026 features a crosstown showdown on Wednesday's NBA schedule as the Brooklyn Nets visit the New York Knicks. The Nets (12-2",
    "body": "\n        NBA Rivals Week 2026 features a crosstown showdown on Wednesday's NBA schedule as the Brooklyn Nets visit the New York Knicks. The Nets (12-29) have lost two in a row, most recently a 126-117 defeat to Phoenix on Monday, and seven of their last eight contests. The Knicks (25-18) have dropped four straight, falling to Dallas 114-97 on MLK Day, as both squads are struggling. New York leads the all-time series 118-112.Tipoff is set for 7:30 p.m. ET from Madison Square Garden in Manhattan, N.Y. The Knicks have won each of the last 12 meetings between the teams. New York is an 11.5-point favorite in the latest Nets vs. Knicks odds from DraftKings Sportsbook, while the over/under for total points scored is 220.5. Before making any Knicks vs. Nets picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Nets vs. Knicks 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Knicks vs. Nets:Nets vs. Knicks                                                                                         spread:    Knicks -11.5 at DraftKings    Nets vs. Knicks                                                                                                       over/under:    220.5 pointsNets vs. Knicks                                                                                                       money line:    Knicks -621, Nets +451Nets vs. Knicks                                                                                                       picks:    See picks at SportsLineNets vs. Knicks                                                                                                       streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Knicks vs. Nets picksSportsLine's model has simulated Nets vs. Knicks 10,000 times and is going Over on the total (220.5 points). The last meeting between these two at MSG in November saw 232 points go on the scoreboard, while each of the last two Nets games have eclipsed the total. The Knicks have no players on Wednesday's injury report as six players are projected to reach double-digits, with two of those going for more than 20 points.As for Brooklyn, it will get back its second-leading scorer in Cam Thomas after he missed the last game, and he's one of five Nets forecasted to score over 10 points. Both teams struggle in defending the arc, with each ranking among the bottom four in 3-point percentage allowed. SportsLine's advanced model calls for 228 combined points as the Over hits with points to spare and is surpassed in 54% of simulations.It has also generated an against-the-spread pick that hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Knicks vs. Nets, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Nets vs. Knicks spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks vs. Nets prediction, odds, spread, line, time: 2026 NBA picks for Wednesday, Jan. 21 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/16/b903939a-7a4f-455f-96fe-107396c3b120/thumbnail/1200x675/56fe9b25086199d4297a52c9faa7f87c/jalen-brunson-new-york-knicks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-21T22:40:38.000Z",
      "dateModified": "2026-01-21T22:40:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 324 -- Justin Gaethje vs. Paddy Pimblett: Five biggest storylines to follow - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-324-fight-card-justin-gaethje-paddy-pimblett-storylines-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/1bf1010d-a7f3-4342-970f-36240b8f4927/thumbnail/1200x675/789da566156ff4bf0515a91c3813a0bd/paddy-pimblett-ufc-mic.jpg",
    "tag": "Sports",
    "date": "2026-01-21T20:30:57.000Z",
    "description": "\n        For the first time since 2021, a numbered UFC event will not air on pay-per-view in the U.S. this Saturday when UFC 324 comes to Las Vegas in",
    "body": "\n        For the first time since 2021, a numbered UFC event will not air on pay-per-view in the U.S. this Saturday when UFC 324 comes to Las Vegas in the first event of a new broadcasting era for the MMA worldwide leader. UFC's new seven-year media rights deal with Paramount Skydance (the parent company of CBS Sports) takes the product off of PPV domestically and onto the streaming network Paramount+. Bet UFC 324 at DraftKings Sportsbook, where new users get $300 in bonus bets with a winning $5 wager:In the main event, which emanates from T-Mobile Arena, Justin Gaethje and British star Paddy Pimblett will square off for the interim lightweight championship while top-five bantamweights Sean O'Malley and Song Yadong meet in the co-main event (after an injury to women's bantamweight champion Kayla Harrison postponed her superfight against former two-division champion Amanda Nunes). \nPlus, powerful heavyweights are set to collide when veteran and fan favorite Derrick Lewis returns to take on fast rising contender Waldo Cortes-Acosta. Former women's strawweight champion Rose Namajunas also looks to hold on to her position in the women's flyweight division when she takes on Natalia Silva. And the opening fight on the main card is sure to produce fireworks when Jean Silva takes on Arnold Allen at featherweight.Subscribe now to Paramount+ to get access to UFC 324 for just $8.99 per monthLet's take a closer look at the biggest storylines entering this weekend.1. Can Paddy Pimblett become the early face of the Paramount era? The flashy and charismatic 31-year-old from Liverpool, England, is certainly positioned to give it a try after lightweight champion Ilia Topuria's personal issues in the aftermath of his divorce left him unable to headline the first Paramount event. The biggest challenge for Pimblett, as he prepares to face all-action veteran Justin Gaethje for the interim 155-pound title, is that he will need to prove once and for all that he's an elite fighter. \"Paddy the Baddy\" might be 7-0 inside the Octagon since his 2021 UFC debut, but he has had some ups and downs along the growing process, including a highly disputed 2022 win over Jared Gordon and a history of heavy weight fluctuation between fights. The good news for Pimblett is that marriage and fatherhood seem to have matured him over the past two years and made him a more tactical and focused fighter as evidenced by back-to-back stoppage wins over veterans King Green and Michael Chandler. Should the Paramount era recharge the casual MMA audience by taking numbered events off of PPV, Pimblett's ability to talk on the microphone could bring quasi Conor McGregor flashbacks to general sports fans who haven't checked in on the product in a while. And an eventual matchup between them, should it take place at the White House, for example, could become a passing of the torch for popularity. But none of that matters if Pimblett can't back it up inside the Octagon. 2. Justin Gaethje enters his last shot at cementing his unforgettable legacyAlready the greatest action fighter in MMA history (seriously, debate me on that) and a former interim lightweight champion and symbolic \"BMF\" champion, \"The Highlight\" has already authored a future Hall of Fame career worth being proud of. But nothing in combat sports sure stamps all-time greatness like becoming an undisputed divisional champion, which is something that has eluded Gaethje throughout his nine years in the Octagon despite two chances already. At 37, with a strong track record of late having won three of his last four, Gaethje said publicly over the past year that he would only continue fighting if it was for a title. And his longtime coach, Trevor Wittman, said recently that Gaethje will retire if he loses on Saturday. Even though he's fighting Pimblett for the interim belt and not the full title, recent interviews suggest Gaethje is all in on leaving it all inside the Octagon to try and fulfill his longtime dream of becoming champion. And for a fighter so beloved for his willingness to entertain and brazenly welcome danger, an upset of Pimblett would put him in prime position for a storybook ending.\n3. Let the auditions for the next bantamweight title challenger begin!Petr Yan's upset of Merab Dvalishvili in their rematch in December didn't just snap an incredible 14-fight win streak for the former champion, it turned the division upside down. And while it's certainly possible Dvalishvili could be rewarded for his activity (he attempted a record four title defenses in 2025) by being given an immediate trilogy, Saturday's card offers a pair of top-10 bouts at 135 pounds that will likely serve as further auditions for Yan's first title defense. Former champion Sean O'Malley will look to rebound from a pair of title losses to Dvalishvili by facing Song Yadong. Umar Nurmagomedov, who lost a close decision to Dvalishvili in their UFC 311 title bout last year, will also face former two-time flyweight champion Deiveson Figueiredo. O'Malley might ultimately have the edge (should he defeat Yadong) not just because he's the most marketable fighter of the four but because he defeated Yan via split decision in their non-title meeting in 2022. But Nurmagomedov, the younger cousin of former lightweight champion Khabib Nurmagomedov, is undoubtedly the most skilled among them and a fighter who many critics believe is inevitably going to raise the gold. Either way, one of the sports most consistently deep and competitive divisions is going to be fun to follow in 2026.  4. Natalia Silva is closing in on a shot at flyweight goldA 7-0 record in the UFC since her 2022 debut and a win streak that has reached 13 consecutive overall has the Brazilian striker atop the women's flyweight rankings at 125 pounds. And if her thorough decision win last May over former champion Alexa Grasso wasn't enough to stamp her ticket to a title shot, it's very likely that a victory over former two-time strawweight queen Rose Namajunas on Saturday would seal the deal. The 28-year-old Silva, who also owns victories over former strawweight champion Jessica Andrade and Jasmine Jasudavicius, will get a nice close-up after her bout was elevated onto the main card following the postponement of Harrison-Nunes. But it's expected to be anything but an easy fight against Namajunas, 33, who is 4-2 since moving up in weight from 115 pounds in 2022 with her losses coming in competitive fights against top contenders Manon Fiorot and Erin Blanchfield. Namajunas hasn't looked completely comfortable at 125 pounds as of yet but has a history producing career-best performances just when it looks like her career is lacking momentum. 5. Don't sleep on the rise of middleweight Ateba GautierAt 6-foot-4 with an 81-inch reach, the 185-pound slugger known as \"The Silent Assassin\" has made a ton of noise in a short time period after debuting inside the Octagon last March. A native of Cameroon, Gautier (9-1) is just 23 and remains one of the most attractive prospects in the promotion following a knockout victory in his 2024 \"Dana White Contender Series\" bout that set up a trio of first-round knockouts to officially begin his UFC career. The muscular Gautier, who will take on Russian Andrey Pulyaev (10-3), has connected on 60% of his strikes through three fights and has many predicting he will enter the top 10 of the middleweight rankings before the new year is over. Gautier is also nearly a 10-to-1 betting favorite to defeat Pulyaev. Watch his rise closely. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 324 -- Justin Gaethje vs. Paddy Pimblett: Five biggest storylines to follow - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/1bf1010d-a7f3-4342-970f-36240b8f4927/thumbnail/1200x675/789da566156ff4bf0515a91c3813a0bd/paddy-pimblett-ufc-mic.jpg"
      ],
      "datePublished": "2026-01-21T20:30:57.000Z",
      "dateModified": "2026-01-21T20:30:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Landing spots for Bills receiver Keon Coleman after wild press conference - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/keon-coleman-landing-spots-bills-press-conference/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/a63f82be-7d1e-4989-b392-25e39270a823/thumbnail/1200x675/5a3e29e96dac7beb58d877a21f7b7270/keon-coleman.jpg",
    "tag": "Sports",
    "date": "2026-01-21T20:51:53.000Z",
    "description": "\n        Buffalo Bills owner Terry Pegula and president/general manager Brandon Beane held a press conference on Wednesday morning to, among other thi",
    "body": "\n        Buffalo Bills owner Terry Pegula and president/general manager Brandon Beane held a press conference on Wednesday morning to, among other things, explain the decision to fire deposed head coach Sean McDermott. During that press conference, Pegula appeared to take a shot at wide receiver Keon Coleman, deflecting blame for the draft choice from Beane and assigning it to McDermott. \"The coaching staff pushed to draft Keon,\" Pegula said. \"I'm not saying Brandon wouldn't have drafted him, but he wasn't his next choice. That was Brandon being a team player and taking advice of his coaching staff who felt strongly about the player. He's taken, for some reason, heat over it, and not saying a word about it. I'm here to tell you the true story.\"Evidence to the contrary of this claim has already emerged in two different forms. The first is a clip of Beane saying that he was glad Coleman ran the 40-yard dash in 4.57 seconds because that would make it easier for the Bills to land him in the draft. And the second is another clip of Beane saying that he knew he wanted to draft Coleman unless some other team blew the Bills away with a trade offer for the No. 33 overall pick in the 2024 draft. Regardless of who was the driving force behind a pick that has clearly not worked out -- Coleman has been ineffective in his role and also had off-the-field issues that led to his being a healthy scratch for multiple games this season -- it was wildly inappropriate for an owner to hang Coleman himself out to dry like this, seemingly declaring him a failed experiment while Coleman is still on the team. \nIt would seem to be untenable for Coleman to return to the Bills in 2026 in the wake of these comments. This isn't something you just put your head down and forget about. So with that in mind, we want to take a look at a few potential landing spots that might make sense for Coleman as a \"second draft\" type of prospect who could be rehabilitated in a new situation. \n                            \n    \n                                                \n                    \n    Kansas City ChiefsThe Chiefs need a big-bodied outside receiver to complement Rashee Rice in the slot and Xavier Worthy as their speed option on the perimeter. Coleman has largely struggled at the things he'd need to do to be an effective weapon for another team, but perhaps a change of scenery would help unlock more of what he showed during his time in college. He's not going to find many teams with an equivalent or better quarterback than Josh Allen, but Kansas City provides one of those options in Patrick Mahomes.\n                            \n    \n                                                \n                    \n    San Francisco 49ersWith Brandon Aiyuk having played his last down with the Niners and Jauan Jennings hitting free agency, San Francisco could have a need for an outside receiver as well. Kyle Shanahan has always shown an ability to put players in position to succeed, so if there is anyone out there who might be able to unlock the best of what Coleman has to offer, it might be him.\n\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersThe Steelers desperately need some help across from DK Metcalf at the wide receiver position. They can't come into next season with guys like Roman Wilson and Calvin Austin III as the primary complements to Metcalf. Coleman could make sense as a buy-low option while they make larger investments in free agency or the draft. \n                            \n    \n                                                \n                    \n    New Orleans SaintsThe Saints, like the Steelers, need a complement to their No. 1 wide receiver. New Orleans has guys like DeVaughn Vele and Kevin Austin Jr. behind Chris Olave but probably needs to find Tyler Shough more to work with to make sure that he shows progress next season after putting together a pretty strong rookie season. \n                            \n    \n                                                \n                    \n    Tennessee TitansThe Titans don't even really have a No. 1 wide receiver given the way Calvin Ridley's season went, so they need to take as many shots as possible at pass catchers this offseason in order to give Cam Ward a better chance for success after they put him in so many tough situations during his rookie year. Coleman isn't going to be a reliable solution, but taking a dice-roll at a low cost could make some degree of sense.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Landing spots for Bills receiver Keon Coleman after wild press conference - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/a63f82be-7d1e-4989-b392-25e39270a823/thumbnail/1200x675/5a3e29e96dac7beb58d877a21f7b7270/keon-coleman.jpg"
      ],
      "datePublished": "2026-01-21T20:51:53.000Z",
      "dateModified": "2026-01-21T20:51:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eric Bieniemy finalizing deal to return to Chiefs as offensive coordinator - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/eric-bieniemy-chiefs-offensive-coordinator-matt-nagy-nfl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/9708973a-9d72-46f2-8d35-3bdfa9e70704/thumbnail/1200x675/d52b367891282604cca4ae3c603f5b25/eric-bienemy.png",
    "tag": "Sports",
    "date": "2026-01-22T01:10:08.000Z",
    "description": "\n        Fresh off the first losing season of the Andy Reid-Patrick Mahomes era, the Kansas City Chiefs are turning to a familiar face to help the tea",
    "body": "\n        Fresh off the first losing season of the Andy Reid-Patrick Mahomes era, the Kansas City Chiefs are turning to a familiar face to help the team rebound in 2026. The Chiefs have agreed to terms with Eric Bieniemy to return as the team's offensive coordinator, CBS Sports' Jonathan Jones reports. Bieniemy, who spent the 2025 season as the running backs coach of the Chicago Bears, is replacing Matt Nagy, whose contract is set to expire and has been interviewing for other jobs around the league. Bieniemy, 56, helped the Chiefs win two Super Bowls during his five-year run as the team's offensive coordinator from 2018-22. During that time, the Chiefs boasted one of the NFL's most potent offenses, led by Mahomes and tight end Travis Kelce. Kansas City continued to have success on offense even after former All-Pro receiver Tyreek Hill was traded to the Miami Dolphins after the 2021 season. Despite the Chiefs' success over that span, Bieniemy did not receive any serious consideration for available head-coaching positions at that time. Because of that, he accepted a lateral move to the Washington Commanders in 2023, allowing him to call plays. He lasted just one year in Washington as the team struggled through a 4-13 season. \nBieniemy then had a brief tenure as UCLA's associate head coach and offensive coordinator before landing in Chicago as part of Ben Johnson's initial staff. This season, the Bears finished third in the NFL in both rushing yards and third in average yards per carry as running backs D'Andre Swift and rookie Kyle Monangai respectively ran for 1,087 and 783 yards and a combined 14 touchdowns. A former NFL running back, Bieniemy spent five years as a running backs coach in the college ranks before serving the same role with the Minnesota Vikings in 2006. During that time, he worked closely with Adrian Peterson, who was named to four straight Pro Bowls during his time with Bieniemy. Bieniemy served as the Chiefs' running backs coach for five years before being promoted to offensive coordinator in 2018, Mahomes' first season as the team's starting quarterback. That season, the Chiefs led the NFL in scoring while Mahomes threw a league-high 50 touchdowns. The Chiefs won their first of three Super Bowls over a five-year span the following season. \nThere are several questions surrounding the Chiefs entering the offseason with Mahomes coming off a torn ACL and Kelce mulling retirement. At least one question has now been answered with Bieniemy back in place orchestrating the offense alongside Reid. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eric Bieniemy finalizing deal to return to Chiefs as offensive coordinator - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/9708973a-9d72-46f2-8d35-3bdfa9e70704/thumbnail/1200x675/d52b367891282604cca4ae3c603f5b25/eric-bienemy.png"
      ],
      "datePublished": "2026-01-22T01:10:08.000Z",
      "dateModified": "2026-01-22T01:10:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Broncos QB Bo Nix reflects on 'devastating' injury, expresses confidence in Jarrett Stidham - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bo-nix-injury-broncos-patriots-jarrett-stidham-afc-championship/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/f79bb6d2-54e5-4904-9a98-f7fa7f88fbbc/thumbnail/1200x675/2c9d161012a65ee6d9fd8acdc5ee4fdd/bonix.png",
    "tag": "Sports",
    "date": "2026-01-21T23:17:40.000Z",
    "description": "\n        If the Denver Broncos are going to play for a Super Bowl, it will be without quarterback Bo Nix, who recently underwent ankle surgery followi",
    "body": "\n        If the Denver Broncos are going to play for a Super Bowl, it will be without quarterback Bo Nix, who recently underwent ankle surgery following his season-ending injury during the final moments of Denver's AFC divisional round win over the Buffalo Bills. As his team prepares for Sunday's AFC Championship game against the New England Patriots, Nix summed up his emotions in a lengthy Instagram post. Nix called the injury \"some of the most devastating football news\" he's ever received. And while he is struggling with the notion of not being on the field with his teammates, Nix is confident the Broncos are still capable of winning with backup Jarrett Stidham leading the offense. The last few days have been hard to put into words. What started as one of the most exciting games I've ever been a part of ended with some of the most devastating football news I've ever received. This is not how I imagined my season would come to an end, but our season has been defined by overcoming adversity and responding to it. I can't express how much this team and organization mean to me and how much I believe in them. I couldn't be more proud of our guys. I couldn't be more confident in Jarrett. And I couldn't be more excited for what's next. Thank you all for the kind words, love and support over the last few days. Thankful for my trainers, Beau, Vince and Dr. Waldrop for taking great care of me. God never says oops, and he is always good. He has big plans for this team. We're not finished, as a matter of fact we're just getting started. We're just going to keep climbing higher. Go Broncos.Nix's injury halted what would have been an intriguing showdown between two of the league's rising young quarterbacks with Patriots quarterback Drake Maye on the other sideline. Members of the 2024 NFL Draft class, Maye and Nix have enjoyed fast starts to their careers. Nix helped the Broncos snap their 10-year drought without a playoff appearance as a rookie. This past Sunday, he led Denver to its first postseason victory since its win over the Carolina Panthers in Super Bowl 50. \nWhile his team didn't have much success in 2024, Maye did earn Pro Bowl honors after completing an impressive 66.6% of his passes. This year, he led the NFL with a 72% completion percentage while leading the Patriots to their first 14-win season since 2016.  \nWhile Nix and Maye won't get the chance to match wits on Sunday, there is another point of intrigue in Stidham trying to join the surprisingly long list of backup quarterbacks who have led their teams to the big game. That list includes Jeff Hostetler, the former New York Giants quarterback who helped Bill Parcells win his fourth Super Bowl with Big Blue. \nBroncos coach Sean Payton -- a Parcells disciple -- is hoping to emulate his former boss by becoming the latest coach to win it all with a backup quarterback.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Broncos QB Bo Nix reflects on 'devastating' injury, expresses confidence in Jarrett Stidham - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/f79bb6d2-54e5-4904-9a98-f7fa7f88fbbc/thumbnail/1200x675/2c9d161012a65ee6d9fd8acdc5ee4fdd/bonix.png"
      ],
      "datePublished": "2026-01-21T23:17:40.000Z",
      "dateModified": "2026-01-21T23:17:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Basketball: 10 best floor spacing big men - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-2025-2026-the-best-floor-spacing-big-men-to-acquire-and-place-in-lineups-now/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/07/02/2f29e8f5-abdf-483d-beb7-1f252223907b/thumbnail/1200x675/d72fbf43bc0bb56bbe7785ee2458a464/gettyimages-2213871617.jpg",
    "tag": "Sports",
    "date": "2026-01-21T21:11:03.000Z",
    "description": "\n        Floor-spacing centers are reshaping modern offenses, and their willingness to fire from deep is creating new wrinkles for fantasy basketball ",
    "body": "\n        Floor-spacing centers are reshaping modern offenses, and their willingness to fire from deep is creating new wrinkles for fantasy basketball managers. As three-point volume rises among big men, fantasy basketball stats no longer come strictly from the paint, forcing managers to rethink player rankings and category balance. This article breaks down the 10 centers attempting the most three-pointers per game, highlighting who is thriving as a true stretch option and who may be sacrificing rebounds, efficiency or interior production.Naz Reid, TimberwolvesReid has been among the league's leading centers in three-point attempts per game for a few seasons now. He is pacing the league for a second consecutive campaign, with 6.3 long-range attempts per game. He has also improved his distance shooting over the last three seasons, with a career-best 41.4 percent shooting from deep in 2023-24, and he is currently hitting 38.8 percent from deep, which marks the second-best rate of his career. Additionally, this is the second straight year that he is averaging a minimum of 6.0 rebounds per game, as he is on pace for a career high with 6.2 per game. Myles Turner, BucksTurner ranks second among centers with a career-high 5.8 three-point attempts per game and is shooting 39.0 percent from deep, which is just a sliver below his career-high of 39.6 percent from last season. However, his increased shooting volume from long range is dragging down his overall field-goal percentage, as he is sitting at a career-low 42.1 percent shooting from the field, which is more than three percent worse than his previous low. His rebounding is also at a career-low 5.3 boards per game, while his 1.5 blocks per game are on pace for the second fewest of his career. Nikola Jokic, NuggetsJokic (knee) has been sidelined since December 29 but is on track in his recovery and could return to action in the next couple of weeks. He ranks third in the league with a career-high 4.8 three-point attempts per game and is shooting a blistering career high of 43.5 percent from long range. The incredible shooting combined with his creativity and dominance in the paint have been an impossible combination for opponents for years now. The three-time MVP continues to push the limits of productivity, averaging a triple-double for a second consecutive season after becoming the first center to ever do so last season. \nKarl-Anthony Towns, KnicksTowns also averages 4.8 three-point attempts per game, but it is not a career high for him, as he has had four seasons shooting over five threes per game. Meanwhile, he is knocking down just 35.8 percent from deep, which is his lowest mark since his rookie season. His struggles are not only from deep, as he is shooting 46.7 percent from the field, which is a career low. On the other hand, he continues to do a great job on the glass and acts as a solid distributor with 3.0 assists per game. Nikola Vucevic, BullsVucevic attempts 4.7 three-pointers per game and is making an average of 1.7, while knocking down 37.1 percent from beyond the arc. This marks the fourth time in 15 seasons that he is shooting better than 37 percent from deep, and he is on pace to shoot better than 50 percent from the field for a third time in four seasons. On the other hand, he is lagging in terms of his rebounding, averaging fewer than 10 per game for the first time in eight seasons. Quinten Post, WarriorsPost is averaging almost identical numbers to his rookie season with 8.1 points, 4.0 rebounds, 1.4 assists and 0.5 blocks per game. However, his three-point shooting is down 5.7 percent in efficiency compared to last season, as he is hitting just 35.1 percent of his 4.5 shots from deep. His ability to stretch the floor is certainly a notable part of his role, but the second-year big man needs to find a few more ways to contribute in order to break through into a larger role in the rotation. \nBrook Lopez, ClippersLopez was never a dominant rebounder despite his size and role at the center position, but he has always been able to provide enough scoring and shot-blocking to remain a positive contributor. He  also did well to morph himself into a three-point specialist about nine seasons ago and has not looked back since, on track to average at least 4.0 three-point attempts per game for a 10th straight season. He is in a significantly reduced role, averaging just 17.0 minutes per game in his first campaign with the Clippers, which may also be making it tougher to find a rhythm, as his current 32.3 percent shooting from deep is his second-lowest mark in 10 seasons. Jay Huff, PacersHuff averages 4.4 three-point attempts per game, which ranks eighth among centers, but his 32.1 percent success rate ranks lowest among the players on this list. Nonetheless, his skill in stretching the floor has been helpful for the Pacers in terms of filling a void in offense after the departure of Myles Turner. Huff also does a great job on the defensive side, averaging 2.1 blocks per game, which is second most in the league. His 3.8 rebounds per game leaves something to be desired but is not overly lacking due to his limited average of 20.0 minutes per game.Bam Adebayo, HeatAdebayo is having a less-than-impressive start to the season, with his averages down nearly across the board, including his field-goal percentage sitting at a career-low 44.5 percent. Part of the dip is surely since he is shooting a career-high 4.3 threes per game, up from 2.8 last season. However, his three-point shooting percentage is holding up at 35.9, suggesting that it is the other areas of his offense that are struggling in their own right. The Heat's continued injury trouble with playmakers in the backcourt could also be affecting the way that he is able to fit into the offense. \nEvan Mobley, CavaliersMobley is another big name that is arguably falling short of many expectations, as his numbers are  down in the scoring and rebounding columns. Still, he continues to step up defensively with a career-high 1.9 blocks per game. The reigning Defensive Player of the Year is also showing growth on the other side of his game with a career-high 3.7 three-point attempts per game, of which he is knocking down 32.6 percent. His increased three-point shooting is surely contributing to a dip in his overall field-goal percentage, but the added long-range threat can also be valuable in the dynamics of the squad's offense. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Basketball: 10 best floor spacing big men - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/07/02/2f29e8f5-abdf-483d-beb7-1f252223907b/thumbnail/1200x675/d72fbf43bc0bb56bbe7785ee2458a464/gettyimages-2213871617.jpg"
      ],
      "datePublished": "2026-01-21T21:11:03.000Z",
      "dateModified": "2026-01-21T21:11:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers to investigate viral substation conspiracy theory after injury-plagued season - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/san-francisco-49ers-substation-conspiracy-theory-injury-rate/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/c001b6f3-c0b5-46fa-8007-35bdf8224ace/thumbnail/1200x675/a21b98472007b6e0e74f13252532f158/kittlehurt.png",
    "tag": "Sports",
    "date": "2026-01-22T04:35:30.000Z",
    "description": "\n        After having another promising season derailed by injury, the San Francisco 49ers will evaluate everything this offseason, including looking ",
    "body": "\n        After having another promising season derailed by injury, the San Francisco 49ers will evaluate everything this offseason, including looking into whether or not excessive exposure to electromagnetic force (EMF) is contributing to the team's alarming injury rate. Specifically, 49ers general manager John Lynch said the team will investigate a viral conspiracy theory that the electrical substation near their training facility and Levi's Stadium is having an impact on the team's injuries. The substation (which is operated by Silicon Valley Power) expanded in 2014 with the opening of Levi's Stadium. The theory was mentioned by receiver Kendrick Bourne after tight end George Kittle tore his right Achilles during the 49ers' wild card playoff win over the Philadelphia Eagles. And while the theory has been debunked by scientists and other medial professionals, the 49ers aren't taking anything to chance. \"We've been reaching out to anyone and everyone to see, does a study exist other than a guy sticking an apparatus underneath the fence and coming up with a number that I have no idea what that means? That's what we know exists,\" 49ers general manager John Lynch said, via ESPN. \"We've heard that debunked. ... The health and safety of our players is of the utmost priority. We pore into it. Our ownership, Jed [York] is tremendous in terms of resources and we'll always be cognizant of things. I know that a lot of games have been won at this facility since it opened, but yeah, we aren't going to turn a blind eye.\"Given their injury numbers in recent years, it's easy to see why the 49ers will at least do their due diligence to look into this theory. This season, the 49ers dealt with significant injuries to several key players, including Kittle, pass rusher Nick Bosa (torn ACL), linebacker Fred Warner (fractured and dislocated ankle), quarterback Brock Purdy (turf toe) and rookie pass rusher Mykel Williams (torn ACL). \nDespite those and other injuries, the 49ers went 12-5 during the regular season while playing in the NFL's toughest division. But if the 49ers want to win their first Super Bowl since 1994, they're going to have to find a way to get more of their players to the finish line. With that in mind, Lynch said the 49ers will look over their entire process this offseason in an effort to have a healthier team moving forward. \n\"The fact of the matter is injuries are a part of this game,\" Lynch said. \"What we strive to do is never to eliminate injuries, but to mitigate injuries. And I think we have a lot of good processes. We'll challenge them all. And that process has begun. It never frankly stopped. But yes, we'll look at everything and we'll examine everything.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers to investigate viral substation conspiracy theory after injury-plagued season - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/c001b6f3-c0b5-46fa-8007-35bdf8224ace/thumbnail/1200x675/a21b98472007b6e0e74f13252532f158/kittlehurt.png"
      ],
      "datePublished": "2026-01-22T04:35:30.000Z",
      "dateModified": "2026-01-22T04:35:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Mixon injury: Texans RB's future uncertain due to 'freak' medical condition - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/joe-mixon-injury-texans-rb-freak-medical-condition/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/45de5d88-a989-406f-8a55-51b668ca10a6/thumbnail/1200x675/63db2c53a6eab80a1e191fca499c5e47/gettyimages-2190340942-1.jpg",
    "tag": "Sports",
    "date": "2026-01-21T20:36:40.000Z",
    "description": "\n        It remains unclear when, or even if, Houston Texans running back Joe Mixon can return to action after he missed the entire 2025 season with a",
    "body": "\n        It remains unclear when, or even if, Houston Texans running back Joe Mixon can return to action after he missed the entire 2025 season with a foot injury. General manager Nick Caseiro said Wednesday that Mixon has not been at the team facility in some time. The Texans are unable to make a decision on his future until medical personnel gather more information.Mixon missed OTAs and minicamp with what was believed to be an ankle injury. He was then feared to miss an extended period of time when the Texans placed him on the non-football injury list on July 23. His transfer to the reserve NFI list ruled him out for the first four games of the season, and Caseiro said after that period that while Mixon was progressing, he still needed at least another month before making a decision on his availability.Come late November, the Texans effectively closed the door on Mixon suiting up at any point in 2025.\"It was a very unique situation,\" Caseiro said. \"I don't think anybody really had any clarity, honestly, from the start of the year until now. I'd say Joe worked very, very hard to try to get himself ready to play football. It just never manifested itself and came to fruition.\n\"Probably have an opportunity to kind of see where he is in the offseason relative to next year. But, again, it was as unique a situation and injury as I've been associated with. I don't want to call it a freak thing, but it's just kind of a freak thing. Joe worked really hard, put his best foot forward, but it didn't work out.\"The Texans have been coy about Mixon's status from the jump, which Caseiro chalked up to there being a lack of clarity regarding the injury itself. Houston's GM did shed more light on the situation this week, though, referring to the issue as a medical condition.\"He didn't do anything off the field,\" Caseiro said. \"It wasn't like he was riding a snowmobile or anything like that. I'd say it was just more of a medical condition or situation that really didn't improve maybe as much as everybody would have hoped. I'm not trying to evade the question. I think that's the reality of the situation. He didn't jump off a building. He wasn't cliff diving or anything like that.\n\"He wasn't doing anything irresponsible. It was a freak thing. Honestly, I've never seen it, the condition.\"A stellar debut season in Houston set Mixon up for what most believed would be a highly productive 2025 campaign. He earned his second career Pro Bowl nod in 2024 after rushing for 1,016 yards and 11 touchdowns and shining in a pair of playoff games. Instead, the Texans leaned on Woody Marks and Nick Chubb, who combined for just five rushing scores.Mixon, a former second-round pick, remains under contract through 2026 and is set to earn $10.5 million in the third and final year of his deal.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Mixon injury: Texans RB's future uncertain due to 'freak' medical condition - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/45de5d88-a989-406f-8a55-51b668ca10a6/thumbnail/1200x675/63db2c53a6eab80a1e191fca499c5e47/gettyimages-2190340942-1.jpg"
      ],
      "datePublished": "2026-01-21T20:36:40.000Z",
      "dateModified": "2026-01-21T20:36:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bayern survive chaos against USG, assert themselves as UCL contenders - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/bayern-munichs-champions-league-contenders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/e09a3450-abf5-4147-af5a-2016b4c5916b/thumbnail/1200x675/52674ae3078244f842207d705f7b4b00/fcbayern.jpg",
    "tag": "Sports",
    "date": "2026-01-22T01:42:45.000Z",
    "description": "\n        The most relatable thing about Bayern Munich is that they, probably like many of us, have gotten off to a sluggish start after the holiday br",
    "body": "\n        The most relatable thing about Bayern Munich is that they, probably like many of us, have gotten off to a sluggish start after the holiday break. First halves have always gone according to plan for Vincent Kompany's side, conceding first in each of their last two matches against Cologne and RB Leipzig and finding themselves level at 1-1 by the 13th minute in the first game of the new year against Wolfsburg.The good news on Wednesday in the UEFA Champions League is that Bayern had not conceded to Union Saint-Gilloise, but the Belgian visitors had grown into the match and were starting to string together an impressive defensive showing. They had limited Bayern to just one shot on target and 0.75 expected goals, their third straight game in which they could not crack more than one expected goal despite a reputation for slinging goals into the back of the net at an audacious rate, Vincent Kompany's side already on track for the greatest single-season goal tally in the Bundesliga's history. Perhaps the pressure of the German league's best-ever Hinrunde, or first half of a season, has a way of weighing down on a team, no matter how dominant they are.And yet, as Union learned the hard way and Leipzig and Cologne did before them, Bayern always find a way to regress toward the mean.The German champions notched yet another win on Wednesday, scoring twice in the second half against Union and becoming one of two teams to secure direct passageway to the round of 16 with a game to spare in the league phase. Bayern have a trademark way of wearing teams down, correcting course in the second half when need be. Wednesday's Champions League clash offered a perfect example – Union went from a defensively resilient team to one that conceded on the simplest of chances, the first a basic header from Harry Kane in the 52nd minute.\nKane, one of the greatest goalscorers of his generation, is a terrific thematic fit for this version of Bayern because he cannot help but overpower an opposing defense time and time again. Moments later, he forced Union goalkeeper Kjell Scherpen into a foul that led to a penalty, the England captain coolly finishing off the opportunity from the spot.\nIt was enough to survive the chaos that followed, first Kim Min-jae's second yellow card in the 63rd minute and Kane's missed penalty in the 81st minute, a rare sighting from the uber-clinical forward. The surprise developments, though, came with a stark reminder of Bayern's abilities – Kompany's side can handle many of the punches that a title challenge can throw at them, making them perhaps the greatest challenger to Arsenal as the road to May's Champions League final begins to kick into high gear.\nKompany's Bayern, like many previous editions of the team, tend to blaze past a range of German and European teams anchored by their historic dominance, but the one-dimensional version of Bayern in recent years has given way for a layered team that have multiple ways of grinding opponents down. Kane's multidimensional style suits Bayern well but these days, he is far from their only option in attack. He has help from Michael Olise, who notched the assist to his first goal and has 16 goals and 18 assists across all competitions this season, while newcomer Luis Diaz is not all that far behind with 14 goals and 10 assists. Kompany has also benefitted from the rise of 17-year-old Lennart Karl, who has seven goals and two assists this campaign and joined the more senior trio in the lineup on Wednesday, a strong fit for a team developing a reputation in the Bundesliga for steamrolling the rest.For all their skill, Kompany's Bayern are also willing to do the grunt work when the game calls for it, a tendency to be relentless in their pursuit of victory making up some of the intangibles needed to be a team that rises above the rest. It is a multi-dimensional style that will allow them to surpass most tests they will face, most impressively with a 2-1 win at Paris Saint-Germain in November, in which they announced themselves as Champions League contenders. A deep run now has to be the expectation for Bayern, but winning the title for the first time in six years does not feel too ambitious.\nLast season's edition of the Champions League demonstrates that it is too early to pick out eventual champions, especially once the knockouts begin. The title may still be Arsenal's to lose and their win over Bayern earlier in the league phase demonstrates just that but Kompany's side still feel like the most genuine competitor of any in the competition, and at the very least are on pace to restore the team's position as a European heavyweight.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bayern survive chaos against USG, assert themselves as UCL contenders - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/e09a3450-abf5-4147-af5a-2016b4c5916b/thumbnail/1200x675/52674ae3078244f842207d705f7b4b00/fcbayern.jpg"
      ],
      "datePublished": "2026-01-22T01:42:45.000Z",
      "dateModified": "2026-01-22T01:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "American Express 2026 preview: Predictions, odds, picks as Scottie Scheffler opens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/american-express-2026-predictions-odds-picks-field-rankings-pga-tour/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/5c161d45-04af-4a25-a78a-2e3ef8944737/thumbnail/1200x675/a73ad87191eeaa39aa4a9a8670c73896/scottie-scheffler-amex-2024-g.jpg",
    "tag": "Sports",
    "date": "2026-01-21T21:49:51.000Z",
    "description": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no addit",
    "body": "\n\n    \n        This page may contain affiliate links. If you click and sign up, make a deposit, or place a wager, we may earn a commission at no additional cost to you.\n    \n        \n\n    \n                                    The No. 1 player, among 28 of the top 50 in the Official World Golf Rankings, tees it up this week on the PGA Tour\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 21, 2026\n                            \n                    at\n    4:47 pm ET\n                        \n                •\n            \n            5 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The PGA Tour heads to the mainland as the 2025 American Express takes center stage this week in Palm Springs, California. Transversing two courses at PGA West and La Quinta Country Club, players will be forced to make birdies in bunches as a strong field embarks on this three-course rotation that will feature a cut at the 54-hole mark.Leading the way is the man who was forced to miss the festivities last season: world No. 1 Scottie Scheffler. Named PGA Tour Player of the Year each of the last four seasons, Scheffler looks for more of the same as he gets his 2026 season underway. But how can a man who seems to do no wrong get even better?Scheffler looked at his 2025 season, which consisted of 20 top 25 finishes in as many starts plus six trophies and identified the start of his campaign as an area to improve. Not quite 100% by the time he returned from his hand injury, Scheffler has taken a conscious effort regarding his endurance and appears ripe for a fast start to the new year.If it starts in any way like his 2025 ended -- six victories in his last 12 PGA Tour starts -- the rest of the world will be up against a monster yet again. Scheffler headlines the action, which includes his good friend Sam Burns and fellow U.S. Ryder Cup team members Patrick Cantlay, Russell Henley and Ben Griffin.\nA large European contingent finds itself in the field as well with Ludvig Åberg, Matt Fitzpatrick, reigning champion Sepp Straka and Justin Rose all rearing to go. While all these players hope to mirror the success of last season, there are others like Rickie Fowler, Will Zalatoris and Max Homa who will attempt to put the past behind them and kick off their years in memorable fashions.2026 American Express scheduleDates: Jan. 22-25Location: Pete Dye Stadium Course — La Quinta, CaliforniaPar: 72 | Yardage: 7,210 | Architect: Pete DyePurse: $9,200,0002026 American Express field, oddsOdds via DraftKings Sportsbook\nScottie Scheffler (5/2): In five appearances, Scheffler has notched four top 25 finishes at the American Express. While some may be concerned that the low-scoring nature of the event breathes life into the rest of the field, let's not forget Scheffler boat raced the competition at the CJ Cyo Byron Nelson by reaching 31 under for the tournament. He's added some speed and remains the clear-cut best player in the world. The only question entering the year is whether he can putt as well as he did in 2025. If he does, he will continue to roll.Ben Griffin (20-1)Sam Burns (25-1): It has been more than three years since Burns has won a stroke-play event on the PGA Tour. Still ranked inside the top 25 of the Official World Golf Rankings, the free-wheeling right-hander starts his season at a comfortable spot as he has collected four top 20 finishes in six starts. Even for his high standards, Burns' putter was red hot throughout the 2025 season and hid a lot of deficiencies in his game.Ludvig Åberg (25-1): In the blink of an eye, we have arrived at Åberg's fourth season on the PGA Tour -- albeit his third in a full-time capacity. The 26-year-old has taken steps every season from playing himself onto Ryder Cup teams, winning on the PGA Tour, contending in major championships and winning a signature event last season. He hit a lull in the middle of the year as his course management was questionable at times, but he found his stride late and looked a lot like the robot we have all grown accustomed to seeing.Russell Henley (28-1)Robert MacIntyre (28-1): MacIntyre is the sixth-ranked player in the world at the moment, and not a lot of people are keen on it. The Scotsman started his year in beautiful fashion thanks to a top-five finish at the Sony Open that included a closing 63. He mentioned his attitude was not up to par throughout the tournament and revealed that he even snapped his putter late in the second round due to frustrations on the greens. In his five worldwide starts since October, the left-hander has a win and three other top-10 results.Patrick Cantlay (30-1)Si Woo Kim (35-1)Matt Fitzpatrick (40-1): A winner at the DP World Tour Championship to cap off his 2025, Fitzpatrick found the culmination of all his hard work come to fruition in the Middle East. In what looked like a lost campaign early in the year, the former U.S. Open champion flipped a switch at the PGA Championship in May and never looked back. Fitzpatrick's iron play really found a groove during this portion of the schedule and was key to sparking this surge.Taylor Pendrith (40-1)2026 American Express picks\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Patrick Cantlay\n                    \n            \n            \n        \nWinner (30-1): The last time Cantlay entered the winner's circle, the biggest members of the PGA Tour were gathering in Delaware to figure out the future of the league. That feels like ages ago, if not longer. The former FedEx Cup champion called upon Phil Kenyon to help with his putting late in 2025, leading to some success, including a runner-up at the Tour Championship. He has been known to take it deep and has four top-10 finishes in his last six appearances at this tournament.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Nick Taylor\n                    \n            \n            \n        \nContender (90-1): A first-round leader in his title defense at the Sony Open, Taylor ultimately fell off the pace and settled for a T13 finish. Still, the Canadian showed plenty of positive signs as he ranked second in greens in regulation and rolled the rock with some consistency. Taylor finally figured out this rotation last year with a T12 finish (the best of his American Express career) and has shown an affinity for golf in the desert.\n    \n                        \n                        \n    \n                                            \n                    \n    \n            \n    \n                    \n                Matt McCarty\n                    \n            \n            \n        \nSleeper (110-1): He is a player I like to take a step in the right direction in 2026, and he looked close last week in Honolulu. Upended by his short game and some uncharacteristic misses on the greens, McCarty will find the flat stick at a tournament that was once labeled a putting contest. Stretching back to the FedEx Cup Fall, the left-hander has been finding the center of the club face with much more consistency.Who will win The American Express 2026, and which longshots will stun the golfing world? Visit SportsLine now to see the projected leaderboard, all from the model that's nailed 16 golf majors heading into the weekend, and find out. \n            \n    \n\n        \n    \n                                            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "American Express 2026 preview: Predictions, odds, picks as Scottie Scheffler opens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/5c161d45-04af-4a25-a78a-2e3ef8944737/thumbnail/1200x675/a73ad87191eeaa39aa4a9a8670c73896/scottie-scheffler-amex-2024-g.jpg"
      ],
      "datePublished": "2026-01-21T21:49:51.000Z",
      "dateModified": "2026-01-21T21:49:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Broncos odds: How to bet AFC Championship Game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-vs-broncos-odds-how-to-bet-the-afc-championship-game-what-to-know-about-betting-each-team/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/17/19bfed3f-af06-4ced-8394-c8f0fc087e94/thumbnail/1200x675/30bffd72f037113481a68f03a77b768d/drake-maye-patriots-2.jpg",
    "tag": "Sports",
    "date": "2026-01-21T19:50:57.000Z",
    "description": "\nHere we go again.The New England Patriots and Denver Broncos -- two of the AFC's most storied franchises -- collide once again in the playoffs, this ",
    "body": "\nHere we go again.The New England Patriots and Denver Broncos -- two of the AFC's most storied franchises -- collide once again in the playoffs, this time in the AFC Championship Game with a spot in Super Bowl LX on the line. Sunday's matchup at Empower Field in Denver will be the sixth postseason matchup between the teams, but the first since the AFC Championship Game for the 2015 season. The Broncos have won four of the previous five playoff meetings. But Denver enters Sunday's showdown without its starting quarterback. Bo Nix, who led the Broncos to a 14-3 record in the regular season and the No. 1 seed in the AFC, suffered a broken ankle late in Denver's 33-30 overtime win over the Bills in the Divisional Round and is out for the rest of the year. Backup Jarrett Stidham will make his first start since Week 18 of the 2023 season. The Patriots are 5.5-point road favorites over the Broncos at DraftKings.Patriots vs. Broncos odds\nOpening spread: Patriots -4.5Opening money line: Patriots -250, Broncos +205Opening total: 40.5The hypothetical lookahead line for this game was Denver -1.5 prior to the AFC Divisional Round, but the Nix news changed that dramatically. The early money came in on the Patriots, moving both the point spread and the money line. If the game kicks off with the Broncos as underdogs of 5.5 points or more, they would be the largest home underdog in a conference championship game since 1970.In addition, with Denver playing its backup quarterback and the game featuring two of the top four scoring defenses in the NFL, the total suggests a low-scoring game. The total is trending to be the second lowest in a conference championship matchup since the NFC Championship Game for the 2017 season between the Eagles and Vikings closed at 39.Broncos betting profile\nOpening win total: 9.5 wins  W/L record: 15-3ATS record: 8-10O/U record: 8-10The Broncos have won 14 of their last 15 straight up this season, but they've only been mediocre against-the-spread. To be fair, seven of those 10 losses ATS have come when Denver was a favorite of six points or more. (The Broncos still won each of those seven games straight-up.) Denver also is 6-4 ATS at Empower Field.History suggests that the underdog role suits the Broncos. Denver is 3-0 straight-up as a home underdog in the playoffs since 1970. The team also has won its last four games outright as an underdog, which is the longest active streak in the NFL.With Broncos offense missing Nix, the defense will need to play well, and it has a plus matchup against the New England pass protection. This version of Orange Crush has registered a NFL-best 71 sacks this season over the course of the regular season and playoffs. Meanwhile, the Patriots have given up 58 sacks, including a league-worst 10 in the postseason. New England quarterback Drake Maye has fumbled six times in the playoffs, which is the most fumbles by any player in the first two games of a postseason.Patriots betting profile\nOpening win total: 7.5 wins  W/L record: 16-3ATS record: 14-5O/U record: 12-7New England continues to pay dividends for its bettors. After going 12-5 against-the-spread during the regular season, which was tied for the best such record in the league, the Patriots have covered both playoff games. They can become just the fifth team since 1970 to cover 15-plus games in a season. Head coach Mike Vrabel's men are proven road warriors. New England went 8-0 straight-up on the road this season, the only NFL team to go undefeated this year on the road. The Patriots went 7-1 against-the-spread in those road games.In addition, the Over has hit in six of New England's last seven games, and the total for Sunday's game is the lowest conference title game since the NFC Championship Game for the 2017 season.History suggests the Broncos have an enormous problem with Stidham starting his first game of the season on Sunday. Just six quarterbacks have previously made their first start of the season in the playoffs, and only one of those (the Bills' Frank Reich in a 32-point comeback against the Oilers in the 1992 season) won the game.Patriots-Broncos prop pick: Hunter Henry Over 43.5 receiving yards\nHenry has gone Over 43.5 receiving yards in 10 of 19 games this season, including six of his last nine games. During the regular season he ranked second on the team behind only Stefon Diggs in targets (87), receptions (60) and receiving yards (768). On Sunday, he has a favorable matchup against a Broncos defense that has struggled defending tight ends. Denver allows 59.7 yards per game to tight ends this season, which is the ninth-most in the league. In the Divisional Round matchup against Buffalo last week, the Broncos gave up 115 receiving yards and a touchdown combined to the Bills tight end tandem of Dalton Kincaid and Dawson Knox.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Broncos odds: How to bet AFC Championship Game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/17/19bfed3f-af06-4ced-8394-c8f0fc087e94/thumbnail/1200x675/30bffd72f037113481a68f03a77b768d/drake-maye-patriots-2.jpg"
      ],
      "datePublished": "2026-01-21T19:50:57.000Z",
      "dateModified": "2026-01-21T19:50:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Freddy Peralta trade grades: Mets finally get their ace; Brewers continue the cycle - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/freddy-peralta-trade-grades-mets-brewers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/4ac8e061-1678-4a94-a249-0127ca5803a6/thumbnail/1200x675/a28669b3c822f1fcffb8b511816be05d/peralta-getty-1.png",
    "tag": "Sports",
    "date": "2026-01-22T04:20:36.000Z",
    "description": "\n        The New York Mets and Milwaukee Brewers have agreed to a four-player trade headlined by right-handed starter Freddy Peralta. The Brewers will",
    "body": "\n        The New York Mets and Milwaukee Brewers have agreed to a four-player trade headlined by right-handed starter Freddy Peralta. The Brewers will net two prospects in return, in right-hander Brandon Sproat and utility player Jett Williams, while the Mets receive an additional big-league piece in the form of right-handed pitcher Tobias Myers. As is the case whenever a notable trade happens during Major League Baseball's offseason, I'm here to break down the deal from all angles. That means providing analysis on every player changing hands, as well as passing judgement in the form of a letter grade assigned to each side. The letter grade, it should be noted, is the least important part of the exercise and should be treated as such.Before getting to the fireworks factory, here once again is the deal in its entirety: Mets receive: RHP Freddy Peralta, RHP Tobias MyersBrewers receive: OF/INF Jett Williams, RHP Brandon SproatLet's proceed.\n                            \n    \n                                                \n                    \n    Mets grade: AThis is another easy trade to like for the Mets, their second in 24 hours after they obtained outfielder Luis Robert Jr. in a no-brainer swap with the Chicago White Sox late Tuesday. In essence, the Mets landed a season of an above-average starter and a depth arm without moving anyone from their big-league roster or the tippy-top of their farm system.\nPeralta, 29, is coming off the best season of his career. In 33 starts, he managed a 2.70 ERA (154 ERA+) and a 3.09 strikeout-to-walk ratio. He earned his second All-Star Game designation and his first Cy Young Award consideration. Should he revert to his prior form, his 111 ERA+ would still have ranked third among Mets pitchers with at least 10 starts. Peralta needn't maintain last year's output to be a welcomed addition to a New York rotation that should feature some combination of blossoming star Nolan McLean, David Peterson, Kodai Senga, Clay Holmes, and Sean Manaea.\nPeralta conducts his business with a four-pitch arsenal: a mid-90s fastball that features more cutting action than you'd expect; a changeup that he'll deploy versus both hands; and two breaking balls (a slider and curveball). It's a quality arsenal, if one that he can struggle to command. He threw a below-average frequency of strikes last season, which helps explain why he's never been a big inning compiler -- his 176 innings last year represented a new personal best. Peralta makes it work anyway because he's adept at missing bats and suppressing hard contact. (He ranked in the 83th percentile in whiff rate last season and in the 80th percentile in average exit velocity.)Whether or not the Mets are willing to pony up to keep Peralta in town beyond 2026 is to be seen. At minimum, they should be able to recoup draft-pick compensation if he walks.  \nMyers, 27, is a well-traveled right-hander who logged nearly 190 innings of 132 ERA+ ball for the Brewers over the past two seasons. He's not big and he doesn't throw particularly hard (his fastball sits around 93 mph), but he gets far down the mound and throws from a steep arm angle to create an odd visual. Myers has four pitches he leaned on last year: the aforementioned fastball (which generates nearly 20 inches of induced vertical break, albeit from a six-foot release height), a cutter and slider tandem (the slider features more downward action), and a splitter/changeup that led his repertoire in whiff rate. Peak Myers throws a lot of strikes and avoids scary fly ball outcomes despite generating about 37% ground balls. He wasn't as effective dodging barrels last season, with his hard-hit percentage increasing from 38.7% to 44.8%. He has a minor-league option remaining, and that, plus his experience as both a starter and reliever, should make him a useful depth piece for the Mets.\n                            \n    \n                                                \n                    \n    Brewers: BThis is what the Brewers do. They take impending free-agent pitchers and convert them into package deals, usually involving an unheralded, if near-ready player. They usually get more mileage than expected from that player too. They did it with Joey Ortiz in 2024 (after netting him in the Corbin Burnes trade) and they did it with Caleb Durbin last year (following his inclusion in the Devin Williams deal). That doesn't ensure the Brewers will succeed with either Sproat or this other Williams, but it does suggest their front office has a handle on how to successfully navigate these situations.\nWith that established, you can make the case this return is light and that they should be docked a grade. Not accessing the tip-top of the Mets system despite Peralta's low salary ($8 million) and Myers' inclusion is tough. Would Milwaukee have been better off keeping Peralta, maximizing their World Series chances in 2026, and then netting a draft pick at year's end? Maybe so. The math would seem to support the approach the Brewers took, though, especially if you're not sold on them again being the best team in the majors. There's a funny incongruity between Williams' basic biographical data (he's a 5-foot-7 up-the-middle defender with speed) and his offensive game. You would be within reason to guess that he's all about putting the bat on the ball. You would also be wrong.Williams, 22, has instead embraced the art of pulling and lifting the ball. That's how he batted .261/.363/.465 with 17 home runs and 34 stolen bases split across the upper minors last season, all the while putting up pedestrian marks in exit velocity (86 mph in Triple-A) and hard-hit percentage (34.3%). Predictably, he swings and misses a fair amount, too. His 22% in-zone whiff rate would've finished beneath the MLB average by about four percentage points. Combined with an otherwise patient approach, he's going to punch out a fair amount of the time against top-level pitchers.\nNevertheless, I ranked Williams as the 14th-best prospect in the National League East because of his bundle of skills. He's going to walk, hit for power, steal bases, and play quality defense wherever the Brewers elect to plunk him down at. That's a nifty player, no matter how much he defies expectation.\nSproat, 25, made his big-league debut last season, compiling a 4.79 ERA (85 ERA+) and a 2.43 strikeout-to-walk ratio in four games. In 26 prior Triple-A appearances, he had notched a 4.24 ERA and a 2.13 strikeout-to-walk ratio. He would've appeared in my aforementioned ranking of the top 20 NL East prospects were it not for the Miami Marlins' late acquisition of outfielder Owen Caissie. Sproat is a hard-throwing right-hander (his average four-seamer checked in at 96 mph in the majors) with a whippy arm action and a broad arsenal. To wit, he showed six pitches last season -- that's two fastballs, a changeup, and three breaking balls -- and everything averaged 80 mph or harder. His fastballs aren't particularly impressive, velocity aside, and he's battled his command of them. He has shown a feel for placing his breaking balls in the zone, however, allowing him to steal strikes.\nSproat feels like a back-end starter, or maybe even a reliever to me in his present form. Few teams are better at meeting their players' strengths and extracting a little extra from them in turn than the Brewers. Whether or not they can pull off with Sproat what they did with, say, Quinn Priester last year is to be seen. But I'll allow for the possibility that there's a little chicken left on the bone, with a big-league floor remaining in place all the same.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Freddy Peralta trade grades: Mets finally get their ace; Brewers continue the cycle - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/4ac8e061-1678-4a94-a249-0127ca5803a6/thumbnail/1200x675/a28669b3c822f1fcffb8b511816be05d/peralta-getty-1.png"
      ],
      "datePublished": "2026-01-22T04:20:36.000Z",
      "dateModified": "2026-01-22T04:20:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]