[
  {
    "title": "Week 14 NFL betting guide, picks, player props, DFS, fantasy football rankings - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-14-nfl-betting-guide-props-spreads-parlay-dfs-fantasy-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/14ff0b61-f014-4413-bb24-a8ba7149ddba/thumbnail/1200x675/3b85c6e5677b0731e1e8ae635d89ba3e/usatsi-27714307.jpg",
    "tag": "Sports",
    "date": "2025-12-03T18:08:25.000Z",
    "description": "\n        If you're hoping to use NFL betting trends to help influence your Week 14 NFL predictions, you won't get much assistance. Favorites have cove",
    "body": "\n        If you're hoping to use NFL betting trends to help influence your Week 14 NFL predictions, you won't get much assistance. Favorites have covered in 51% of games, with underdogs winning versus the spread 49% of the time. What's essentially a flip of the coin doesn't offer any NFL betting advice for a slate of games with slim lines, as no team is favored by more than 8.5 points. There are five games with a spread of a field goal or less, per the Week 14 NFL odds, including Colts vs. Jaguars (+1.5), Vikings vs. Commanders (+1.5) and Dolphins vs. Jets (+2.5).The Commanders vs. Vikings contest has uncertainty at the QB position for both teams, which could have ramifications on the rest of the skill players. With that, should the likes of Terry McLaurin, Zach Ertz, Justin Jefferson or Jordan Addison factor into NFL player props, plugged into Fantasy football lineups or be a part of your NFL DFS strategy? If you are looking for NFL picks, NFL parlays, Fantasy football rankings or NFL DFS picks for Week 14, SportsLine has you covered with its proven model, Machine Learning Model and team of experts.Join SportsLine here, and for a limited time get your first month for $1 using promo code CHAMPIONSHIP. NFL parlay picks could generate massive payoutsSportsLine's model has returned well over $7,000 on top-rated NFL betting picks since its inception, so those picks can confidently be used to fill out NFL parlay picks on betting apps. The model has built a five-team parlay for Week 14 that pays over 25-1, and one of the legs is the Browns (-3.5, 33.5) covering against the Titans. The model has Cleveland covering in over 60% of simulations in an A-rated pick, and the rest of the five-team parlay can be found here.You can also bet this parlay at DraftKings, where you can get $200 in bonus bets if your initial $5 wager wins. NFL DFS picks from top experts SportsLine has a DFS Optimizer that simulates every game 10,000 times and uses info from the SportsLine Projection Model and DFS Professional Millionaire Mike McClure to identify top DFS picks/plays for any slate on sites like FanDuel and DraftKings. It has the Bucs' Baker Mayfield as one of its top value picks at quarterback, while Cleveland's Harold Fannin Jr. is among the best values at tight end for Sunday's main slate. Here are its complete Week 14 NFL DFS rankings. Senior Fantasy Writer Heath Cummings has locked in his projections for every Fantasy relevant quarterback, running back, wide receiver and tight end. Not only do you get statistical projections as well as Fantasy point totals for every player in different scoring formats, but Cummings also includes DFS prices and values to help build winning DFS lineups each week. He has the Cardinals' Michael Wilson as a top-10 Fantasy wideout this week. Get his full Week 14 Fantasy and DFS projections right here. New users can also make picks at Underdog and get $100 in site credits after making a $5 wager:Fantasy rankings to help you win your matchupsSportsLine's model simulates every game 10,000 times, which has helped it produce better Fantasy rankings than human experts over the last few seasons. It has revealed its Week 14 Fantasy football rankings that can be used to make start-sit decisions. The Dolphins' Darren Waller is projected to be a top-5 Fantasy tight end this week, and the model also has full rankings for every position right here. Advanced NFL model simulates every game 10,000 times SportsLine's model is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024 and has revealed picks for every Week 14 NFL game. One of its favorite picks is the Jets (+2.5, 40.5) covering versus the Dolphins, which cashes nearly 60% of the time. You can find the model's picks for every NFL Week 14 game here. You can also use the latest FanDuel promo code to get $150 in bonus bets instantly:NFL Vegas expert picks revealed SportsLine has an expansive team of NFL experts who provide quality betting advice for every game on the schedule. Larry Hartstein, who is 25-15 (+835) over his last 40 Vikings ATS picks, is backing Washington (-1) to cover at home versus Minnesota on Sunday.\"The Commanders gave a spirited performance coming off their bye, losing by one in overtime to Denver. It was Washington's second solid effort in a row. Terry McLaurin's return made a huge difference, as did the presence of Daron Payne and Will Harris on defense. Now Washington visits a reeling Vikings team dealing with internal turmoil. It is unclear at the moment whether J.J. McCarthy and Jayden Daniels will return. Regardless, I like the Commanders to pull out the win.\" Hartstein's Week 14 NFL picks can be found here.Cowboys vs. Lions 'Thursday Night Football' picksThe teams that are Thanksgiving Day staples will meet seven days after the holiday as the Cowboys visit Detroit on TNF. The Lions won 47-9 when these teams met last year -- which was Dallas' largest home defeat since 1988 -- but the Cowboys had won each of the prior six matchups. NFL expert R.J. White, who is 34-22-2 (+1064) over his last 58 picks in Lions games, is backing Dallas (+3) to cover on the road.\"The Cowboys are surging while the Lions are slumping, so it's tough to take Dallas when the spread was 6 on the lookahead,\" said White. \"But since that line was posted, the Cowboys outplayed the Chiefs, while the Lions played an even game against the Packers, but lost another key player to injury in Amon-Ra St. Brown. With Trevon Diggs potentially returning for Dallas, this is a spot where we should expect the Cowboys defense to handle the Detroit passing attack in its current form, and defending the run will be key. Even if Dallas is behind, I trust their dynamic passing game to make this a tight game. Grab +3.5 if you see it at any point.\" Get more 'Thursday Night Football' picks right here.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 14 NFL betting guide, picks, player props, DFS, fantasy football rankings - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/14ff0b61-f014-4413-bb24-a8ba7149ddba/thumbnail/1200x675/3b85c6e5677b0731e1e8ae635d89ba3e/usatsi-27714307.jpg"
      ],
      "datePublished": "2025-12-03T18:08:25.000Z",
      "dateModified": "2025-12-03T18:08:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 323 fight card: Henry Cejudo vs. Payton Talbott among undercard fights to watch - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-323-fight-card-undercard-henry-cejudo-vs-payton-talbott/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4006383-22cd-4c9b-8bcd-dc83ffb5b600/thumbnail/1200x675/6aec6ca02943c9c6d61394fb321dec1c/henry-cejudo-ufc-323-fight-card-cbs-sports-mma-dec-3-2025.jpg",
    "tag": "Sports",
    "date": "2025-12-03T19:42:13.000Z",
    "description": "\n        History could be made at UFC 323. On Saturday in Las Vegas, bantamweight champion Merab Dvalishvili could become the only UFC fighter to make",
    "body": "\n        History could be made at UFC 323. On Saturday in Las Vegas, bantamweight champion Merab Dvalishvili could become the only UFC fighter to make four successful title defenses in one calendar year. With so much attention on the legacy-defining feat, the undercard risks being overshadowed.UFC 323 features not only two title fights, but also former champions in every main card bout. Former two-division titleholder Henry Cejudo, ex-flyweight king Brandon Moreno and one-time light heavyweight ruler Jan Blachowicz are all in action. It's a solid undercard supporting what could be the most unique achievement in UFC history.Take a look at three undercard fights worth your time, plus three honorable mentions, before the last UFC pay-per-view preceding the Paramount+ era.\n        \n            \n                Merab Dvalishvili's shot at UFC history among top storylines to watch at UFC 323 in Las Vegas\n                \n                    Brian Campbell                \n            \n                            \n    \n                \n                    \n    \nHenry Cejudo vs. Payton TalbottCejudo is expected to retire again on Saturday. His success before and after his first retirement couldn't be more different. He walked away from the sport in 2023, having become a two-division UFC champion and a successful bantamweight title defense. In his second stint, he's 0-3 and fighting an unranked opponent. But Cejudo's winless stretch doesn't tell the whole story. He took bantamweight champion Aljamain Sterling to a split decision in his first fight in three years. Then he lost to Merab Dvalishvili, who'd go on to become arguably the best bantamweight ever. Against Song Yadong, Cejudo was fighting relatively well before an eye poke ruined everything.\nThe Talbott fight is unusual but inspired matchmaking. Talbott is a non-conformist among the regular MMA circle, drawing attention beyond the sport. He's an unfinished product, but he can fight his ass off. Talbott gave up 11 takedowns in his last two fights. If he can't fend off Olympic gold medalist Cejudo, the former champion can ride off into the sunset happily. But if Talbott gets it done, we have a new star player among the bantamweight elite.\nBrandon Moreno vs. Tatsuro TairaA UFC flyweight title shot could be at stake for the winner of this fight. Two-time former champion Moreno found himself on the outside looking in after consecutive split decision losses to Pantoja and Brandon Royval. After a six-month break, Moreno reemerged as a contender by knocking off young guns Amir Albazi and Steve Erceg. On Saturday, Moreno has another chance to prove that the new wave of flyweights isn't ready to take over. Taira is an impressive contender with a slick submission game. Taira (17-1) bounced back from a split decision, Fight of the Night loss to Royval by submitting Hyun Sung Park. Taira would be a fresh matchup for Pantoja or Van. Moreno hasn't fought Van either, but has a rich history with Pantoja.Terrance McKinney vs. Chris Duncan  McKinney fights are feast and famine, always. He's never reached a decision, win or lose, in 24 pro fights. There's very little reason to suspect he'll break that chain on Saturday. McKinney has never chained together more than two consecutive wins in the UFC, but the second half of his Octagon run looks better than the first. He's on a 4-1 run with consecutive finishes over Viacheslav Borshchev (submission) and Damir Hadzovic (KO). Scotland's Duncan is a solid prospect at 4-1 in the UFC and 14-2 overall. A known KO artist on the regional scene, including in the \"Contender Series\" fight that earned him a UFC contract, Duncan has successfully incorporated submission wins into his repertoire since joining the promotion. Duncan is a slight favorite against the inconsistent McKinney, but the fight should be memorable whichever way it goes.\nHonorable mentions: Jan Blachowicz vs. Bogdan Guskov, Maycee Barber vs. Karine Silva, and Edson Barboza vs. Jalin Turner\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 323 fight card: Henry Cejudo vs. Payton Talbott among undercard fights to watch - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4006383-22cd-4c9b-8bcd-dc83ffb5b600/thumbnail/1200x675/6aec6ca02943c9c6d61394fb321dec1c/henry-cejudo-ufc-323-fight-card-cbs-sports-mma-dec-3-2025.jpg"
      ],
      "datePublished": "2025-12-03T19:42:13.000Z",
      "dateModified": "2025-12-03T19:42:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brent Key agrees to five-year extension with alma mater Georgia Tech, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/georgia-tech-coach-brent-key-contract-extension/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/d033a2c2-0bf3-47d9-b80c-1d515338acae/thumbnail/1200x675/e35474c3be4d908f627434292e59468c/brent-key.jpg",
    "tag": "Sports",
    "date": "2025-12-03T18:07:06.000Z",
    "description": "\n        Georgia Tech locked in Brent Key to a new five-year contract extension that will keep the coach at his alma mater through 2030, the school an",
    "body": "\n        Georgia Tech locked in Brent Key to a new five-year contract extension that will keep the coach at his alma mater through 2030, the school announced. The deal comes after Key guided the Yellow Jackets to a 9-3 record and a third consecutive bowl game -- the first three-year streak for the program in a decade.Key owns a 27-19 (.587) overall record in four seasons at Georgia Tech and has steadily transformed the Yellow Jackets into an ACC contender. The new contract comes with a significant raise, expanded resources for the current staff and funding for additional support positions, according to ESPN, as Georgia Tech continues investing heavily in football.For the 2025 season, Key's base salary was $4.15 million, which ranked 52nd nationally among FBS head coaches, according to USA Today's coaching database.\"There is no other place or opportunity out there like Georgia Tech,\" Key said in a statement. \"Our goal is to build a championship program. I'm proud of the steps that we've taken towards reaching that goal, but I'm not satisfied. Building a championship program is not possible without everyone being aligned.\"\nThe move also closes the door on speculation linking Key to the still vacant position at Penn State as the coaching search rolls on. With numerous candidates like BYU's Kalani Sitake opting to remain at their current programs, the pool for Penn State has thinned considerably, leaving Georgia Tech's decision to extend Key as a definitive move to retain momentum and keep the program competitive in the ACC.Under his guidance, Georgia Tech posted a 7-1 record against nationally ranked ACC opponents, and the program is the only team to finish fourth or better in the ACC each of the last three seasons.\"Coach Key has brought our storied football program back to where it belongs,\" Georgia Tech President Ángel Cabrera said in a statement. \"He has delivered three-straight winning seasons and bowl appearances, reinvigorated the passion of our fan base and given us moments we will not easily forget.\"\nGeorgia Tech spent just one week in the AP Top 25 from 2016 through 2024, but have been in the national poll for 12 consecutive weeks this season, climbing as high as No. 7 following an 8-0 start. For the first time in the 12-year history of the College Football Playoff rankings, Georgia Tech has appeared in all five early CFP rankings this year. The Yellow Jackets rank No. 22 as they await their bowl destination.Before returning to his alma mater, Key spent time at several programs, including Western Carolina, UCF and Alabama, building a reputation as a top offensive line and assistant coach. He first came back to Georgia Tech in 2019 as assistant head coach and offensive line coach before being named interim coach in 2022 and permanent head coach in 2023.Key was a four-year starter at right guard for Georgia Tech from 1997-2000, starting 44 consecutive games. He helped lead the Yellow Jackets to four straight bowl appearances and remains one of just a handful of Georgia Tech alumni to serve as head coach.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brent Key agrees to five-year extension with alma mater Georgia Tech, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/d033a2c2-0bf3-47d9-b80c-1d515338acae/thumbnail/1200x675/e35474c3be4d908f627434292e59468c/brent-key.jpg"
      ],
      "datePublished": "2025-12-03T18:07:06.000Z",
      "dateModified": "2025-12-03T18:07:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Clippers did Chris Paul dirty - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/the-clippers-did-chris-paul-dirty/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/01227658-9f71-493e-9d3b-d60a261475be/thumbnail/1200x675/dada227e2de0c355bf2d76387dc7f3c5/chris-paul-press-conference-getty-1.png",
    "tag": "Sports",
    "date": "2025-12-03T17:36:26.000Z",
    "description": "\n        Chris Paul signed with the Los Angeles Clippers in July on a minimum contract. He knew he wouldn't be starting, and they made no guarantees w",
    "body": "\n        Chris Paul signed with the Los Angeles Clippers in July on a minimum contract. He knew he wouldn't be starting, and they made no guarantees when it came to playing time. At 40 years old, heading into his 21st NBA season, he just wanted to wear a Clippers uniform again and be with his family.\"If I'm really honest, I wanted to get back and play here by any means necessary,\" Paul said at his introductory press conference. \"I didn't even care what the team looked like. I just wanted to be home, be here with the Clippers.\"Paul wanted to retire a Clipper. On Nov. 22, before a game in Charlotte, he announced that this season would be his last. On Nov. 28, during the Clippers' first game at Intuit Dome after that road trip, they played a video to honor him. They shared it on social media, too, with the caption, \"CP3 will end his Hall of Fame career at home,\" punctuated with a heart emoji. Four nights later, in the middle of the night during the middle of a road trip, they told Paul that they were done with him.In team president Lawrence Frank's statement about the decision, provided to The Athletic and ESPN, he called Paul \"a legendary Clipper who has had a historic career.\" Frank also said that \"no one is blaming Chris for our underperformance\" and the Clippers are \"grateful for the impact Chris has made on our franchise.\" This was shortly after Paul had broken the news in an Instagram story at about 2:40 a.m. ET, telling the world that he'd just found out he'd been \"sent home\" while the team was in Atlanta. \nThe Clippers brought Chris Paul \"home\" in July. Then they sent him packing in December. \n                                                                    Getty Images\n                                                            Is this what gratitude looks like? Is this how you treat a \"legendary Clipper?\" Sure, the team has been worse than anybody could have imagined this season -- they're currently 5-16 and spiraling, with the third-worst non-garbage-time defense in the NBA, per Cleaning The Glass -- but that alone doesn't explain them casting aside one of the greatest players in franchise history.Paul is, famously, a competitive maniac. In 2017, when asked if Paul could ever really have fun playing basketball, JJ Redick told Rob Mahoney, then of Sports Illustrated, \"That's a great question. I think winning is fun for him. I think the end result is fun for him.\" He has never been shy about holding teammates accountable, and, even in the best of times, that has rubbed some people the wrong way. He recently posted the definition of \"leeway\" to his Instagram story, and he can't possibly have been all smiles as the team has descended the standings. Of all the teams that could have signed him last summer, though, the Clippers had to know what they were getting.\n        \n            \n                Three potential Chris Paul landing spots, and why his next move is complicated\n                \n                    Sam Quinn                \n            \n                            \n    \n                \n                    \n    \nFor now, Paul is in limbo. He can't be traded until Dec. 15, but Los Angeles hasn't waived him. Unless there was some inciting incident that has yet to be reported, Paul, who made five All-Star teams and five All-NBA teams as a Clipper, deserved better than this kind of dismissal. The NBA can be cold and cutthroat, and no one -- not even one of the top point guards of all-time -- is promised a storybook ending, but in this case the Clippers were selling that story right up until the moment they shredded it.\nThe Clippers didn't have to do Paul dirty. If both sides regretted the reunion, they could have mutually agreed to move on. Otherwise, they needed to do right by him and let him ride out this miserable season at home. By choosing to embarrass Paul, they have embarrassed themselves.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Clippers did Chris Paul dirty - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/01227658-9f71-493e-9d3b-d60a261475be/thumbnail/1200x675/dada227e2de0c355bf2d76387dc7f3c5/chris-paul-press-conference-getty-1.png"
      ],
      "datePublished": "2025-12-03T17:36:26.000Z",
      "dateModified": "2025-12-03T17:36:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Brewers considering Freddy Peralta trade, Blue Jays could move starter - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-brewers-freddy-peralta-astros-marlins-sandy-alcantara-edward-cabrera/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4d08225-ed08-4ae7-934b-ff8828834066/thumbnail/1200x675/6b92117741520b18bf753e75023283f5/peralta-getty.png",
    "tag": "Sports",
    "date": "2025-12-03T19:26:52.000Z",
    "description": "\n        We're only a few days from the Winter Meetings and we've started to see a trickle of moves here in the MLB offseason, which means it's possib",
    "body": "\n        We're only a few days from the Winter Meetings and we've started to see a trickle of moves here in the MLB offseason, which means it's possible things start to pick up a bit. As such, the rumor mill is churning and we're going to round up the best nuggets of news and rumors here for the day, which is Wednesday, Dec. 3. Let's get to it.Brewers drawing 'significant interest' in PeraltaEarlier this offseason, reports surfaced that the Brewers were not interested in trading ace Freddy Peralta. In fact, as recently as yesterday the reporting was that the Brewers were going to keep him.Lately, though, according to The Athletic, things might be leaning in the other direction.Perhaps this was inevitable, but the interest in right-hander Freddy Peralta is so significant, the Milwaukee Brewers are now considering \"cracking the door open\" for trade discussions, according to a person briefed on their situation.Peralta is 30 years old next season and is coming off arguably the best year of his career. He was 17-6 with a 2.70 ERA (154 ERA+), 1.08 WHIP, 204 strikeouts in 176 ⅔ innings. He posted a career-high 5.5 WAR. He's set to make $8 million in 2026 before hitting free agency. If the Brewers think 2025 was the peak for Peralta and that he'll definitely walk in free agency, you can see the line of thinking to accept huge trade offers here. They previously dealt Corbin Burnes a season before free agency. Given the conflicting reports of late, it's safe to assume the situation is fluid with the Brewers listening to trade offers and maybe even considering them while leaning toward keeping Peralta until they're blown away.\nAstros looking at pitching depthThe Astros were crushed under the weight of pitching injuries over the last two years, including lengthy absences from the likes of Cristian Javier, Lance McCullers Jr., Luis Garcia, Ronel Blanco and Spencer Arrighetti. What's more, ace workhorse Framber Valdez is now a free agent. Knowing all this, it isn't surprising that the Astros are targeting depth at the Winter Meetings. They don't \"have the financial resources\" to a top free agent, per MLB.com, but they have a \"desire\" to land pitchers who are still under team control via trades. Center fielder Jake Meyers is mentioned as a possibility for the Astros to trade for said pitching. Marlins not inclined to deal Alcantara or Cabrera?People love talking about trading prospects to the Marlins in order to grab controllable players because, well, look at their history. This time around, the Marlins are apparently trying to hold and maybe even extend some of their own players, according to MLB.com.\nSpecifically, high-upside Edward Cabrera and former Cy Young winner Sandy Alcantara have seen their names bandied about in trade rumors since early last regular season, but the Marlins are repotedly not \"actively trying to trade\" either, though if that were to change, Christina De Nicola speculated that Cabrera is the more likely of the two to be dealt. Blue Jays willing to deal BerríosThe Blue Jays have signed starting pitchers Dylan Cease and Cody Ponce so far this offseason. Given that they have Kevin Gausman and Shane Bieber coming back in addition to rookie sensation Trey Yesavage, that's a full, five-man rotation without getting to veteran and former All-Star José Berríos. Sure enough, they are willing to part with Berríos in a trade, according to The Athletic. Berríos, 31, was 9-5 with a 4.17 ERA (102 ERA+), 1.30 WHIP and 138 strikeouts in 166 innings along with 1.3 WAR last season. Keep in mind that he's due over $18 million this season before roughly $24 million in each 2027 and 2028. In light of their recent signings and trying to bring back Bo Bichette, it's possible the Jays are trying to shed salary in dealing Berríos. \nObviously, teams these days need more than five starting pitchers, but the Jays already have depth beyond their starting five with Eric Lauer and Bowden Francis.Former GM Byrnes takes Rockies' GM positionFormer Diamondbacks and Padres general manager Josh Byrnes has been hired as the general manager of the Rockies, reports The Athletic. Keep in mind that there's been a shift in titles over the course of the past decade-plus and that GM isn't necessarily always the big boss in the front office. Here, Byrnes is second in command under new president of baseball operations Paul DePodesta. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Brewers considering Freddy Peralta trade, Blue Jays could move starter - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/d4d08225-ed08-4ae7-934b-ff8828834066/thumbnail/1200x675/6b92117741520b18bf753e75023283f5/peralta-getty.png"
      ],
      "datePublished": "2025-12-03T19:26:52.000Z",
      "dateModified": "2025-12-03T19:26:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks, predictions, best bets today: This Week 14 parlay returns 25-1 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/week-14-nfl-picks-odds-best-bets-today-parlay/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/8f99f61e-22f3-4db2-91a9-02af4004bbe6/thumbnail/1200x675/1b1d7932523d0bbb54c05b3e29be7517/quinshon-judkins-cleveland-browns-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T16:32:19.000Z",
    "description": "\n        The NFL Week 14 schedule is full of intrigue, including several with playoff implications. Among them is the NFC North-leading Chicago Bears ",
    "body": "\n        The NFL Week 14 schedule is full of intrigue, including several with playoff implications. Among them is the NFC North-leading Chicago Bears (9-3), who have won five in a row, visiting the 8-3-1 Green Bay Packers, who have won three straight. Caleb Williams of the Bears will face off against Jordan Love and the Packers in a battle between up-and-coming quarterbacks. Green Bay is the 6.5-point favorite and is 3-7 against the spread, while the Bears are 8-2 ATS.  There are a number of other solid matchups on the Week 14 NFL schedule, including Cowboys vs. Lions (-3) on 'Thursday Night Football,' Steelers vs. Ravens (-6), Cols (-1.5) vs. Jaguars, Bengals vs. Bills (-5.5) on Sunday, and Texans vs. Chiefs (-3.5) on 'Sunday Night Football.' Before locking in any Week 14 NFL picks or NFL parlays, be sure to see the NFL predictions and betting advice from SportsLine's proven computer model.LIMITED TIME: Use promo code CHAMPIONSHIP to get your first month at SportsLine for $1. Join now.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has scoured the Week 14 NFL odds and locked in five confident NFL best bets. If you successfully parlay its picks, you'd be looking at a massive payout of over 25-1. You can only see the model's Week 14 NFL picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins:Top Week 14 NFL picksAfter simulating every game 10,000 times, the model is high on the Cleveland Browns (-4.5, 33.5) to cover against the Tennessee Titans despite being tied for the sixth-lowest spread of the week. The Buccaneers (7-5) and Rams (9-3) are tied for the highest spread at -8.5. The Buccaneers are favored over the Saints, while the Rams are favored over the Cardinals. The 3-9 Browns are led by rookie running back Quinshon Judkins, who has been a beast. In 11 games, he leads Cleveland in rushing with 758 yards on 196 carries (3.9 average) and seven touchdowns. He also has 17 receptions for 88 yards. He is coming off a 23-carry, 91-yard performance in a 26-8 loss to the San Francisco 49ers in Week 13.The model has Cleveland winning outright 70% of the time and covering in over 60% of simulations. See which other NFL parlay picks to make here, and bet the Browns to cover here:How to make Week 14 NFL parlaysThe model also jumped on four other NFL matchups where it says the line is way off, including backing an underdog that it says will easily cover. You can only see the model's Week 14 NFL best bets and NFL parlay at SportsLine.What are the model's top Week 14 NFL picks, and which NFL matchups should you target for an epic 26-1 payout? Visit SportsLine now to see the Week 14 NFL best bets from a model on a 49-33 run on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks, predictions, best bets today: This Week 14 parlay returns 25-1 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/8f99f61e-22f3-4db2-91a9-02af4004bbe6/thumbnail/1200x675/1b1d7932523d0bbb54c05b3e29be7517/quinshon-judkins-cleveland-browns-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T16:32:19.000Z",
      "dateModified": "2025-12-03T16:32:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Agent's Take: Top NFL individual dead money charges in 2025: Daniel Jones' Giant hit - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/agents-take-biggest-individual-dead-money-charges-in-2025-including-daniel-jones-still-costing-the-giants/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/25/900b2746-f706-4cf2-9d10-211b0b1a2a94/thumbnail/1200x675/7e0b21cfd70fdef17bc48af8338cb458/daniel-jones-indianapolis-colts-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-03T18:41:35.000Z",
    "description": "\n        Dead money is a salary cap charge for a player who is no longer on a team's roster. It exists because of how salary cap accounting rules oper",
    "body": "\n        Dead money is a salary cap charge for a player who is no longer on a team's roster. It exists because of how salary cap accounting rules operate. Signing bonuses, option bonuses and certain roster bonuses are prorated or spread out evenly over the life of a contract for a maximum of five years. When a player is released, traded or retires, the remaining proration of these salary components immediately accelerate onto his team's current salary cap. There are two major exceptions to this general rule of bonus proration accelerating. Only the current year's proration counts toward the cap with players released, traded or retiring after June 1. The bonus proration in future contract years is delayed until the following league year, which typically begins in early to mid-March. A team can also release two players each league year prior to June 2 (known as a post-June 1 designation) that will be treated under the salary cap as if released after June 1. With a post-June 1 designation, a team is required to carry the player's full cap number until June 2 even though he is no longer a part of the roster. The player's salary comes off the books at that time unless it is guaranteed. \nThis means dead money is typically a sunk cost where money isn't owed to a player. A payment is associated with dead money when there are salary guarantees at the time of release or departure comes after the player has already begun receiving a portion of his compensation in that particular league year.Teams have become increasingly more comfortable with big amounts of dead money. There are eight dead money charges of $20 million or more this year. Here's a look at the eight players responsible for this 2025 dead money. WR Deebo Samuel, 49ers: $34,106,705The handwriting was on the wall for Deebo Samuel in San Francisco because wide receiver Ricky Pearsall was selected 31st overall in the 2024 NFL Draft, Brandon Aiyuk signed a four-year, $120 million contract extension shortly before the regular season started and Jauan Jennings took a big step forward. The Washington Commanders acquired Samuel for a 2025 fifth-round pick in March. A $19.847 million salary conversion a couple days after the Aiyuk extension, which the 49ers seemingly developed buyer's remorse about shortly thereafter, added $15,877,600 to Samuel's dead money. \nSamuel had a $15,737,270 2025 cap number prior to being dealt. The trade raised San Francisco's 2025 cap charges for Samuel by $18,369,435. The 49ers were able to accommodate the dramatic increase because of having the NFL's highest adjusted 2025 salary cap at $341.46 million primarily thanks to carrying over a little more than $50 million in unused 2024 cap space. A $3,086,105 cap credit will be coming in 2026 from the 2025 proration relating to Samuel's $15,430,529 option bonus that became a Commanders salary obligation in the trade.QB Russell Wilson, Broncos: $32 millionRussell Wilson claims one of the top spots in dead money for a second straight year, dropping from first to second. That's because Wilson was released with a post-June 1 designation in March 2024 when his marriage of convenience with coach Sean Payton came to an end after one season together. Last year's $53 million is the record for dead money related to an individual player in one league year. The $85 million of residual cap charges taken over two years, 2024 and 2025, is a record for the most dead money relating to a single player contract. CB Marshon Lattimore, Saints: $31,661,837Marshon Lattimore's dead money is a byproduct of the Saints constantly pushing cap obligations into the future through salary conversions. It's only the third time there has ever been more than $30 million of dead money with a non-quarterback. The Saints restructured for cap purposes the five-year, $97 million extension Lattimore signed at the beginning of the 2021 regular season on three separate occasions before he was dealt along with a 2025 fifth-round pick to the Commanders for 2025 third-, fourth- and sixth-round picks at the 2024 trade deadline.\n\n        \n            \n                Arch Manning report card: The real story of Texas QB's 2025 season -- and how it shapes his NFL draft future\n                \n                    Mike Renner                \n            \n                            \n    \n                \n                    \n    \nWR Amari Cooper, Browns: $22.584 millionThe Buffalo Bills acquired Amari Cooper from the Browns for essentially a 2025 third-round pick six games into the 2024 season. Cooper was brought in to help fill a void at wide receiver created by Stefon Diggs' departure to the Houston Texans in an offseason trade.It was clear that Cooper didn't fit into Cleveland's long-term plans. His efforts for a new deal were rebuffed. Instead, $5 million of not likely to be earned incentives were added to his contract giving him the opportunity to earn $25 million instead of the $20 million he was originally scheduled to make in 2024. As a part of the reworked contract, $18.79 million of the $20 million was turned into a signing bonus where dummy/voiding 2027 and 2028 contract years were inserted into the deal for proration purposes. The bulk of Cooper's dead money ($15.032 million) is from this contract maneuver.  \nWR Cooper Kupp, Rams: $22.26 millionAnkle and hamstring injuries and 2023 fifth-round pick Puka Nacua's emergence made the Rams comfortable moving on from Cooper Kupp. The Rams released Kupp in March after a trade market never materialized. The Rams picked up $7.52 million of 2025 cap space in the process by no longer having Kupp's $29.78 million 2025 cap number on their books. Kupp, who is 32, had two years worth $39.58 million remaining on his contract. He hadn't had a 1,000-yard receiving season since 2021 when he won the receiving triple crown. The Rams clearly didn't have an issue paying an older wide receiver. Davante Adams, who will be 33 on Christmas Eve, was signed to a two-year, $44 million contract with $26 million fully guaranteed as Kupp's replacement.Kupp signed a three-year, $45 million deal, containing $26.5 million in guarantees, with the Seattle Seahawks a few days after the Rams released him. The Rams are getting a $5 million cap credit from Kupp finding a new football home. The $5 million of his $7.5 million fifth day of the 2025 league year roster bonus that became fully guaranteed in 2024 has an offset.\nQB Daniel Jones, Giants: $22.21 millionThe $22.21 million is a result of the Giants accommodating Daniel Jones' request for his release last November after his benching 10 games into the 2024 season. The combined $69.315 million in dead money over 2024 and 2025 is the second most ever relating an individual player contract. Jones' dead money is almost 30% more than the combined $17,120,657 in 2025 cap charges the Giants have for the quarterbacks currently on their roster (Jaxson Dart, Russell Wilson and Jameis Winston).QB Aaron Rodgers, Jets: $21 millionThe Aaron Rodgers experiment came to an end after two seasons with Aaron Glenn and Darren Mougey being hired as coach and general manager in January. Rodgers, who just turned 42, was released in March with a post-June 1 designation. From a salary cap standpoint, it was time to move on from Rodgers. Since Rodgers' contract was structured with multiple option bonuses, the total dead money would have increased from $49 million to $63 million by bringing him back for another year. \nThe Jets will be getting a $7 million cap credit in 2026 from the $7 million of 2025 proration relating to the $35 million option bonus for a 2029 contract year that wasn't picked up due to Rodgers being released. The cap credit is reducing the 2026 dead money from $35 million to $28 million. WR DK Metcalf, Seahawks: $21 millionSomething had to give with DK Metcalf considering he had the NFL's third largest 2025 cap number for a wide receiver heading into the offseason at $31,875,471. The Seahawks opted to trade Metcalf, who was in a contract year, to the Pittsburgh Steelers for the equivalent of a second-round pick rather than give him a new deal. The Steelers signed Metcalf to a four-year contract extension, averaging nearly $33 million per year, in the process. Seattle's trade compensation is more than what would have been received by letting Metcalf walk in free agency after this season. At best, the Seahawks would have gotten a 2027 third-round compensatory pick. Moving Metcalf allowed the Seahawks to free up $11,875,471 of 2025 cap space.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Agent's Take: Top NFL individual dead money charges in 2025: Daniel Jones' Giant hit - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/25/900b2746-f706-4cf2-9d10-211b0b1a2a94/thumbnail/1200x675/7e0b21cfd70fdef17bc48af8338cb458/daniel-jones-indianapolis-colts-imagn-images.jpg"
      ],
      "datePublished": "2025-12-03T18:41:35.000Z",
      "dateModified": "2025-12-03T18:41:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Predicting landing spots for top 2026 NFL free agents: Aaron Rodgers finds a new home? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/early-predictions-for-top-2026-nfl-free-agents-potential-landing-spots-for-aaron-rodgers-george-pickens/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/26/ff6ed41b-ca16-4a03-90d0-81adb47b4e3c/thumbnail/1200x675/74c7f6227e2fd302e0557b46574d28f4/getty-george-pickens-cowboys.jpg",
    "tag": "Sports",
    "date": "2025-12-03T18:08:37.000Z",
    "description": "\n\n\n    \n                                    Where might these notable names end up after the season?\n        \n                                        ",
    "body": "\n\n\n    \n                                    Where might these notable names end up after the season?\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 3, 2025\n                            \n                    at\n    1:08 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n            \n    \n        The home stretch of the 2025 NFL season is here, which means we're in the thick of the playoff race. This year's battle for postseason entry is particularly tight, with five different division leaders holding less than a one-game lead entering Week 14.Not every team has the privilege of partaking in the fight for a playoff appearance, however. There are a handful, like the New York Jets and Tennessee Titans, who are already anticipating the 2026 offseason, when tentpole events like the draft and free agency provide opportunities for restocking. Which got us thinking: Which top pending free agents have the most to gain -- or lose -- in the final weeks of the 2025 season? And which teams could already be eyeing their services?\nHere's a look at five of the biggest names set to hit the open market in March, including their current status, their future outlook and an early projection for where they'll end up come 2026:\n                            \n    \n                                                \n                    \n    QB Daniel Jones (Colts)Current status: After almost six years of injury- and turnover-littered action with the New York Giants, Jones is the figurehead of a surprisingly balanced Colts attack, turning in efficient marks for Shane Steichen's top five offense. Red-hot to open the year, he's cooled off a bit in recent weeks, though, while battling a fibula issue.What's next: The Colts signaled their intentions to build around this rejuvenated version of Jones when they spent big on other spots at the trade deadline, but how Jones finishes could determine his long-term fate, not so dissimilar to Sam Darnold of last year; despite cruising for much of his lone season with the Minnesota Vikings, Darnold's flat finish all but bought his exit.Potential destinations: Cardinals, Colts, Jets, VikingsPrediction: Signs franchise tag with Colts\n                            \n    \n                                                \n                    \n    QB Aaron Rodgers (Steelers)Current status: On a one-year deal in what might be his final NFL season, Rodgers is mirroring the unevenness of his Pittsburgh setup. Despite flashing vintage touch during the Steelers' 4-1 start, the 41-year-old signal-caller has lately looked his age, succumbing to pressure and sustaining a wrist injury amid Pittsburgh's slump.What's next: The Steelers are still in the mix for an AFC North title thanks to the volatility of the rival Baltimore Ravens, who are also 6-6, but Rodgers probably needs a borderline heroic finish to warrant consideration as anyone's starting quarterback beyond 2025. That's assuming he even wants to suit up again.Potential destinations: Raiders, Steelers, retirementPrediction: Retires\n        \n            \n                One under-the-radar free agent addition that has helped every NFL playoff hopeful\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \n\n                            \n    \n                                                \n                    \n    WR George Pickens (Cowboys)Current status: Acquired via trade from the Steelers prior to the season, Pickens is dominating as Dak Prescott's new favorite target, logging a career-high 1,142 yards in just his first 12 games with the Cowboys. While CeeDee Lamb is the more established name in Dallas' wide receiver room, Pickens is the hotter contested-catch playmaker at the moment.What's next: Pickens was notoriously emotional while playing for Pittsburgh, but he's been nothing but a team player in Dallas, and his production suggests he's due for a monster payday. The question, as is often the case with Cowboys stars, is whether owner Jerry Jones will prolong rather than rush to resolve pending contract talks.Logical suitors: Chargers, Cowboys, Jets, Patriots, RaidersPrediction: Re-signs with Cowboys\n                            \n    \n                                                \n                    \n    OL Tyler Linderbaum (Ravens)Current status: A former first-round draft pick, Linderbaum is in the midst of his fourth season as the anchor of Baltimore's front, which isn't enjoying its finest season blocking for Lamar Jackson but still has Baltimore as a top-five rushing offense. Initial Pro Bowl voting suggests he's also on his way to a third straight all-star nod.What's next: The Ravens declined Linderbaum's fifth-year option prior to the season, and they reportedly aren't close to a long-term deal with the veteran center. Still, he figures to be atop the club's priority list in free agency, especially if Baltimore finds a way to reclaim the AFC North and make it into the postseason.Logical suitors: Jaguars, Jets, Lions, Raiders, Ravens, TitansPrediction: Signs with Titans\n                            \n    \n                                                \n                    \n    EDGE Trey Hendrickson (Bengals)Current status: The face of offseason headlines thanks to a years-long contract dispute with Cincinnati, Hendrickson is sidelined from the Bengals' pass rushing rotation due to lingering injuries. The All-Pro sack artist started 2025 strong with four sacks in his first six games but has no clear timeline to return.What's next: The Bengals are trying to forge a desperate playoff push without Hendrickson, leaning upon the return of fellow standout Joe Burrow, and all indications are the former is destined for new pastures this offseason. After repeatedly eyeing a trade out of town, Hendrickson is due to test the market.Logical suitors: Buccaneers, Chargers, Commanders, 49ers, RavensPrediction: Signs with Chargers\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Predicting landing spots for top 2026 NFL free agents: Aaron Rodgers finds a new home? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/26/ff6ed41b-ca16-4a03-90d0-81adb47b4e3c/thumbnail/1200x675/74c7f6227e2fd302e0557b46574d28f4/getty-george-pickens-cowboys.jpg"
      ],
      "datePublished": "2025-12-03T18:08:37.000Z",
      "dateModified": "2025-12-03T18:08:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top 25 And 1 college basketball rankings: UConn makes statement in road win vs. Kansas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-rankings-uconn-makes-statement-with-road-win-vs-kansas-in-blue-blood-battle/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/abdb53db-4ada-4d24-a7d6-b036309cf64f/thumbnail/1200x675/cefd755d31556593747cb7f13d635a91/uconn-top25.jpg",
    "tag": "Sports",
    "date": "2025-12-03T19:50:51.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        It's rare for Kansas coach Bill Self to be a",
    "body": "\n    \n    \n                    \n                CBS Sports graphic\n            \n            \n    \n        It's rare for Kansas coach Bill Self to be an underdog at home. It had only happened three times in 22 years before UConn closed as a 1.5-point favorite in Tuesday night's showdown with the Jayhawks inside Allen Fieldhouse.Darryn Peterson's absence played a role in that number.(Hopefully he's back soon.)Either way, by the time it was over, the oddsmakers looked smart making the Huskies small favorites on the road, as they pulled out a 61-56 victory over Kansas to improve to 7-1 on the season and remain No. 4 in Wednesday morning's updated CBS Sports Top 25 And 1 daily college basketball rankings.Arizona, the only team to beat UConn, remains No. 1.Short on things to cheer with the Jayhawks missing their best player and shooting just 35% from the field, including 28% from 3-point range, KU fans briefly resorted to a \"F-ck Dan Hurley\" chant that came through loud and clear. Asked about it afterward, the UConn coach said: \"I wasn't expecting that. Everyone was so nice to me the last time [we were here in December 2023]. I don't really have anything. If that's how people want to carry themselves in the game, it's sports. We're all f-cking gladiators.\"\n\n        \n            \n                College basketball just had its best November ever. This needs to be the scheduling standard moving forward\n                \n                    Matt Norlander                \n            \n                            \n    \n                \n                    \n    \nIt should be noted that UConn was also shorthanded -- specifically because of Tarris Reed's ankle injury. The 6-foot-11 center missed two games (against Arizona and Bryant), returned and played 15 minutes in last Friday's win over Illinois, but missed the KU game and is considered day-to-day. In other words, UConn just won at Allen Fieldhouse without its leading scorer (15.5 points) and leading rebounder (8.3 boards), which is the latest bit of evidence suggesting that the Huskies really do have the goods to possibly win a third national championship in a four-year span after cutting nets in both 2023 and 2024. Top 25 And 1 rankings \n        Biggest Movers\n    \n                2\n            \n                Houston\n            \n                7\n            \n                Kentucky\n            RkTeams\n                    ChgRcrd\n                                1\n                            \n                                    Arizona\n                                \n                            Motiejus Krivas finished with 20 points and nine rebounds in Saturday's 98-61 win over Norfolk State. The Wildcats' next game is Saturday against Auburn.\n                        \n                            --\n                        \n                            7-0\n                        \n                                2\n                            \n                                    Purdue\n                                \n                            Trey Kaufman-Renn finished with 19 points and 13 rebounds in Tuesday's 81-65 win at Rutgers. The Boilermakers' next game is Saturday against Iowa State.\n                        \n                            --\n                        \n                            8-0\n                        \n                                3\n                            \n                                    Michigan\n                                \n                            Yaxel Lendeborg finished with 20 points and 11 rebounds in Wednesday's 101-61 win over Gonzaga. The Wolverines' next game is Saturday against Rutgers.\n                        \n                            --\n                        \n                            7-0\n                        \n                                4\n                            \n                                    UConn\n                                \n                            Braylon Mullins finished with 17 points and five rebounds in Tuesday's 61-56 win at Kansas. The Huskies' next game is Friday against East Texas A&M.\n                        \n                            --\n                        \n                            7-1\n                        \n                                5\n                            \n                                    BYU\n                                \n                            Richie Saunders finished with 29 points and eight rebounds in Friday's 83-79 win over Dayton. The Cougars' next game is Wednesday against Cal Baptist.\n                        \n                            --\n                        \n                            6-1\n                        \n                                6\n                            \n                                    Duke\n                                \n                            Cameron Boozer finished with 29 points and six rebounds in Tuesday's 67-66 win over Florida. The Blue Devils' next game is Saturday at Michigan State.\n                        \n                            --\n                        \n                            9-0\n                        \n                                7\n                            \n                                    Louisville\n                                \n                            Ryan Conwell finished with 32 points and nine rebounds in Wednesday's 104-47 win over NJIT. The Cardinals' next game is Wednesday at Arkansas.\n                        \n                            --\n                        \n                            7-0\n                        \n                                8\n                            \n                                    Iowa St.\n                                \n                            Milan Momcilovic finished with 24 points and five rebounds in Wednesday's 95-64 win over Syracuse. The Cyclones' next game is Wednesday against Alcorn State.\n                        \n                            --\n                        \n                            7-0\n                        \n                                9\n                            \n                                    Michigan St.\n                                \n                            Coen Carr finished with 15 points and five rebounds in Tuesday's 71-52 win over Iowa. The Spartans' next game is Saturday against Duke.\n                        \n                            --\n                        \n                            8-0\n                        \n                                10\n                            \n                                    Gonzaga\n                                \n                            Graham Ike missed all nine of the shots he attempted in Wednesday's 101-61 loss to Michigan. The Zags' next game is Friday against Kentucky.\n                        \n                            --\n                        \n                            7-1\n                        \n                                11\n                            \n                                    Alabama\n                                \n                            Labaron Philon finished with 20 points and six assists in Wednesday's 105-72 win over Maryland. The Crimson Tide's next game is Wednesday against Clemson.\n                        \n                            --\n                        \n                            5-2\n                        \n                                12\n                            \n                                    N. Carolina\n                                \n                            Henri Veesar finished with 17 points and 10 rebounds in Tuesday's 67-64 win at Kentucky. The Tar Heels' next game is Sunday against Georgetown.\n                        \n                            --\n                        \n                            7-1\n                        \n                                13\n                            \n                                    Houston\n                                \n                            Emanuel Sharp finished with 17 points and five rebounds in Wednesday's 66-56 win over Notre Dame. The Cougars' next game is Saturday against Florida State.\n                        \n                            2\n                        \n                            7-1\n                        \n                                14\n                            \n                                    Kansas\n                                \n                            Melvin Council Jr. missed nine of the 13 shots he attempted in Tuesday's 61-56 loss to UConn. The Jayhawks' next game is Sunday against Missouri.\n                        \n                            1\n                        \n                            6-3\n                        \n                                15\n                            \n                                    Illinois\n                                \n                            Andrej Stojakovic missed six of the seven shots he attempted in Friday's 74-61 loss to UConn. The Illini's next game is Saturday against Tennessee.\n                        \n                            1\n                        \n                            6-2\n                        \n                                16\n                            \n                                    Texas Tech\n                                \n                            JT Toppin finished with 27 points and nine rebounds in Sunday's 76-72 win over Wyoming. The Red Raiders' next game is Sunday against LSU.\n                        \n                            1\n                        \n                            6-2\n                        \n                                17\n                            \n                                    Tennessee\n                                \n                            Nate Ament missed eight of the 10 shots he attempted in Tuesday's 62-60 loss at Syracuse. The Vols' next game is Saturday against Illinois.\n                        \n                            3\n                        \n                            7-2\n                        \n                                18\n                            \n                                    Arkansas\n                                \n                            Maleek Thomas missed 10 of the 15 shots he attempted in Thursday's 80-71 loss to Duke. The Razorbacks' next game is Wednesday against Louisville.\n                        \n                            1\n                        \n                            5-2\n                        \n                                19\n                            \n                                    Nebraska\n                                \n                            Pryce Sandfort finished with 20 points and nine rebounds in Saturday's 72-63 win over South Carolina State. The Cornhuskers' next game is Sunday against Creighton.\n                        \n                            1\n                        \n                            8-0\n                        \n                                20\n                            \n                                    Indiana\n                                \n                            Tucker DeVries finished with 20 points and five assists in Saturday's 100-56 win over Bethune-Cookman. The Hoosiers' next game is Wednesday at Minnesota.\n                        \n                            1\n                        \n                            7-0\n                        \n                                21\n                            \n                                    Auburn\n                                \n                            Tahaad Pettiford finished with 27 points and three steals in Wednesday's 85-74 win over St. John's. The Tigers' next game is Wednesday against NC State.\n                        \n                            2\n                        \n                            6-2\n                        \n                                22\n                            \n                                    Vanderbilt\n                                \n                            Duke Miles finished with 25 points and four assists in Friday's 96-71 win over Saint Mary's. The Commodores' next game is Wednesday against SMU.\n                        \n                            2\n                        \n                            8-0\n                        \n                                23\n                            \n                                    St. John's\n                                \n                            Oziyah Sellers missed six of the seven shots he attempted in Wednesday's 85-74 loss to Auburn. The Red Storm's next game is Saturday against Ole Miss.\n                        \n                            2\n                        \n                            4-3\n                        \n                                24\n                            \n                                    USC\n                                \n                            Chad Baker-Mazara finished with 25 points and three assists in Tuesday's 82-77 win at Oregon. The Trojans' next game is Saturday against Washington.\n                        \n                            2\n                        \n                            8-0\n                        \n                                25\n                            \n                                    Kentucky\n                                \n                            Denzel Aberdeen missed nine of the 13 shots he attempted in Tuesday's 67-64 loss to North Carolina. The Wildcats' next game is Friday against Gonzaga.\n                        \n                            7\n                        \n                            5-3\n                        \n                                26\n                            \n                                    Iowa\n                                \n                            Isaia Howard missed five of the six shots he attempted in Tuesday's 71-52 loss at Michigan State. The Hawkeyes' next game is Saturday against Maryland.\n                        \n                            4\n                        \n                            7-1\n                        \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top 25 And 1 college basketball rankings: UConn makes statement in road win vs. Kansas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/abdb53db-4ada-4d24-a7d6-b036309cf64f/thumbnail/1200x675/cefd755d31556593747cb7f13d635a91/uconn-top25.jpg"
      ],
      "datePublished": "2025-12-03T19:50:51.000Z",
      "dateModified": "2025-12-03T19:50:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben Roethlisberger floats Mike Tomlin as candidate for Penn State job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/ben-roethlisberger-mike-tomlin-steelers-penn-state-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/46689d77-5431-4f81-afc8-d553f03245d1/thumbnail/1200x675/cb305ca4bb8fca83336631efd9c44d2d/gettyimages-2240593741-1.jpg",
    "tag": "Sports",
    "date": "2025-12-03T17:30:41.000Z",
    "description": "\n        Outside of the success of the reigning Super Bowl champions, football in the state of Pennsylvania is at a crossroads. The Pittsburgh Steeler",
    "body": "\n        Outside of the success of the reigning Super Bowl champions, football in the state of Pennsylvania is at a crossroads. The Pittsburgh Steelers are in danger of posting the first losing season of the 19-year Mike Tomlin era, and after Penn State fired James Franklin, the Nittany Lions remain in search of a replacement coach.The unrest stemming from the Steelers' underperformance and the anxiety tied to Penn State's tumultuous coaching search led a local legend to an idea; former Steelers quarterback Ben Roethlisberger suggested Tomlin should take the Nittany Lions job.\"Maybe it's a clean house time,\" Roethlisberger said on his podcast. \"Maybe it's time. I like Coach Tomlin. I have a lot of respect for Coach Tomlin. But maybe it's best for him, too. Maybe a fresh start for him is what's best. Whether that's in the pros, maybe go be Penn State's head coach. You know what he would do at Penn State? He'd probably go win national championships, because he's a great recruiter.\"To be clear, there is little evidence to suggest Tomlin would be up for the task of modern college football recruiting. His last college job came from 1999-2000 when he served as Cincinnati's defensive backs coach, and the landscape has changed dramatically in the 25 years since he departed for the NFL, most notably with the rise of NIL, revenue sharing and the transfer portal.\nIf there is one thing Tomlin has proven, though, it is that he can command a successful enterprise. With 18 straight winning seasons and a Super Bowl title as a head coach, he could provide a high floor and potentially raise the ceiling for a program like Penn State if he were to return to the college level.A mutual parting of ways could also make sense for Tomlin and the Steelers. Fan support continues to dwindle with each loss, and after one of the worst defeats of his tenure, the two-time Super Bowl champion is suddenly 6-11 in his last 17 games.\"Here's what you don't do,\" Roethlisberger said. \"You don't fire a guy like Coach Tomlin. He's a Hall of Fame coach. What you do is you come to an understanding and agreement. It's like, 'Hey, listen, I think it's probably best for both of us.' … Coach Tomlin's been here a long time. You would give him a statue, do whatever you gotta do, because he deserves it. He's earned it. But it's like, OK, it's time to find that next guy.\"\nTomlin previously shut down college football interestThis is not the first time that prominent figures floated Tomlin's name as a potential target for a college job. In 2021, with USC searching for a new coach, former players, including Carson Palmer, suggested the Trojans should look at Tomlin as a candidate. The not-so-dissimilar situation to the one at hand with Roethlisberger and Penn State drew an impassioned response from the Steelers' coach.\"I got one of the best jobs in all of professional sport,\" Tomlin said four years ago. \"Why would I have any interest in coaching college football? That'll be the last time that I address it. And not only today, but moving forward. Never say never, but never. OK? Anybody else got any questions about any college jobs? There's not a booster with a big enough blank check.\"Perhaps his stance would change in 2025 as the Steelers fight to stay above .500 and questions about his job security grow louder than ever. But if not, Tomlin's past comments indicate a move to the college ranks is not in the cards.\nIf not Tomlin, then who for Penn State?Despite being one of the first jobs to open, the Penn State position remains unfilled at the end of the regular season. The Nittany Lions watched as other Power Four programs made splashy hires and as some of the top candidates inked extensions with their current schools. The options are dwindling, and Penn State whiffed again this week after its pursuit of BYU's Kalani Sitake ended with him securing a long-term deal with the Cougars.Vanderbilt's Clark Lea, Missouri's Eli Drinkwitz and Nebraska's Matt Rhule also all stayed put despite links to the Penn State job. If the Nittany Lions continue to swing and miss, their decision to move on from Franklin could prove devastating.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben Roethlisberger floats Mike Tomlin as candidate for Penn State job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/46689d77-5431-4f81-afc8-d553f03245d1/thumbnail/1200x675/cb305ca4bb8fca83336631efd9c44d2d/gettyimages-2240593741-1.jpg"
      ],
      "datePublished": "2025-12-03T17:30:41.000Z",
      "dateModified": "2025-12-03T17:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Chiefs on CBS becomes most watch NFL regular season game in history - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-chiefs-thanksgiving-cbs-most-watched-nfl-regular-season-game-all-time/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/4fec913d-7eaf-48c1-89ff-3f2f0ee510e9/thumbnail/1200x675/5b516243cac51d48d7227f6c58597e54/cowboys-patrick.jpg",
    "tag": "Sports",
    "date": "2025-12-03T17:23:00.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        There's a new most-watched NFL regular season game",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        There's a new most-watched NFL regular season game in television history. 57.230 million viewers tuned in to watch Dak Prescott and the Dallas Cowboys upset the Kansas City Chiefs, 31-28, on CBS this past Thanksgiving. Viewership peaked with 61.357 million viewers for the game's conclusion. Previously, the Cowboys' 28-20 victory over the New York Giants on Thanksgiving in 2022 was the most-watched regular-season game, drawing 42.059 million viewers. Chiefs vs. Cowboys shattered that number by over 15 million. \"The NFL. Thanksgiving. Chiefs. Cowboys. A perfect recipe for a record audience. We're thrilled and honored this NFL showcase on CBS and Paramount+ delivered the most-watched regular-season game in NFL history,\" President and CEO of CBS Sports David Berson said in a statement.\nPatrick Mahomes threw for 261 yards and four touchdowns vs. Dallas, but his offense was out-gained by Prescott and co., 457 yards to 362. It marked Mahomes' first career loss in which he threw four touchdowns and zero interceptions. CeeDee Lamb and George Pickens combined for 200 yards receiving, and had more receiving yards in the fourth quarter (117) than the Chiefs had total yards (82). It was a momentous victory for Dallas. The win pushed the Cowboys above .500 for the first time this season. The Cowboys also became the first team in NFL history to defeat both of the previous year's Super Bowl teams in a five-day span, as Dallas overcame a 21-point deficit to beat the Philadelphia Eagles in Week 12.\nAs for the Chiefs, this loss dropped them to 6-6. It marks their worst 12-game start to a season since 2017. The six losses suffered are tied for the most Mahomes has taken in a season as starter, while the Chiefs are 1-6 in one-score games this year, and 1-5 on the road. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Chiefs on CBS becomes most watch NFL regular season game in history - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/4fec913d-7eaf-48c1-89ff-3f2f0ee510e9/thumbnail/1200x675/5b516243cac51d48d7227f6c58597e54/cowboys-patrick.jpg"
      ],
      "datePublished": "2025-12-03T17:23:00.000Z",
      "dateModified": "2025-12-03T17:23:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bo Bichette free agency: After Blue Jays bulk up rotation, could All-Star be next? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/bo-bichette-free-agency-rumors-blue-jays-payroll-offseason-needs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/4cacca26-3af2-4bf6-a0eb-c6481b20b560/thumbnail/1200x675/bca3c2a0e268574bfa8a3b28146dd668/bichette-getty.png",
    "tag": "Sports",
    "date": "2025-12-03T16:28:53.000Z",
    "description": "\n        After coming tantalizingly close to winning the 2025 World Series, the Toronto Blue Jays are the active team here early in the offseason. The",
    "body": "\n        After coming tantalizingly close to winning the 2025 World Series, the Toronto Blue Jays are the active team here early in the offseason. They signed free-agent starter Dylan Cease to a seven-year, $210 million deal. Next, they rounded out their rotation by bringing Cody Ponce back to the majors after a stint in Japan and then a very successful stint in Korea (he was MVP last year in KBO) on a three-year, $30 million deal. The biggest free agent the Blue Jays had heading into the offseason was All-Star infielder Bo Bichette. A Blue Jays draft pick in 2016, he hasn't been with any other organization. He's a two-time All-Star and has been a fixture in their lineup for years. Last season, Bichette hit .311/.357/.483 (129 OPS+) with 181 hits, 44 doubles, 18 home runs, 94 RBI, 78 runs and 3.5 WAR in 139 games with a knee injury hampering him down the stretch and in the playoffs. He missed the ALDS and ALCS, but played all seven World Series games despite the injury, hitting .348 with a home run and six RBI. So far this offseason, there have been very few public rumors about Bichette. We heard about the Blue Jays' interest in bringing Bichette back at the general manager meetings, which were about a month ago, but there hasn't been much out there since.What does that mean? In all likelihood, not much. There could be an argument that the Jays are content with Ernie Clement at second base, Andrés Giménez at shortstop and Addison Barger at third base -- with Davis Schneider as depth, given that Anthony Santander returns to the outfield. That would instead mean the Blue Jays could decide to spend their offseason money on pitching depth. Sure enough, the rotation is now Cease, Kevin Gausman, Shane Bieber, Trey Yesavage and Ponce. That looks stout. There's even good depth with José Berríos and Eric Lauer. \nIs there money left? That all depends on how much more the Blue Jays are willing to spend after their first World Series run since 1993. Factoring in the new deals for Cease and Ponce, Cot's Contracts estimates the Blue Jays are set with a 40-man competitive balance payroll of nearly $271 million, which is well over the luxury tax threshold and would be their second-highest payroll ever. Their highest? Last season, finishing at nearly $278 million. Hey, a World Series run increases revenue in a big way. It also brings in a lot of income.Plus, the Jays could backload any deal for Bichette. Right now, they have $175 million or so allocated for 2027 and considerably less in the ensuing years, even with Vladimir Guerrero Jr. locked up long-term. They could also defer a bunch of money, a move that has become popular in recent years, notably with the two-time defending champion Dodgers. Even if it seems tricky, there's room to add Bichette. The bottom line here is these pitching moves don't prevent the Blue Jays from bringing Bichette back. \nThis doesn't necessarily mean the Blue Jays will do so, nor does any of this mean they won't. It's Dec. 3. The Winter Meetings are next week. There are a bunch of free agents out there and we haven't seen a ton of rumors about a good number of them. Patience is the key. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bo Bichette free agency: After Blue Jays bulk up rotation, could All-Star be next? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/4cacca26-3af2-4bf6-a0eb-c6481b20b560/thumbnail/1200x675/bca3c2a0e268574bfa8a3b28146dd668/bichette-getty.png"
      ],
      "datePublished": "2025-12-03T16:28:53.000Z",
      "dateModified": "2025-12-03T16:28:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Belichick, Robert Kraft among five Pro Football Hall of Fame finalists - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bill-belichick-robert-kraft-pro-football-hall-of-fame-finalists-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/89a38a8d-4716-48cd-9a63-4872b7d3dc1f/thumbnail/1200x675/a6f9e91c22dc334da1091b7d1d9b2463/bill-belichick-robert-kraft.jpg",
    "tag": "Sports",
    "date": "2025-12-03T16:29:03.000Z",
    "description": "\n        Former New England Patriots coach Bill Belichick and current Patriots owner Robert Kraft are among five finalists for the Pro Football Hall o",
    "body": "\n        Former New England Patriots coach Bill Belichick and current Patriots owner Robert Kraft are among five finalists for the Pro Football Hall of Fame class of 2026 via the Blue-Ribbon Committees' nominations. The Blue-Ribbon Committees, which select candidates across the \"Coach,\" \"Contributor\" and \"Seniors\" categories, also selected former players Roger Craig, L.C. Greenwood and Ken Anderson as finalists.Belichick, now coach at North Carolina, is in his first year of eligibility for the Hall of Fame. His football credentials are undeniable. Across 29 years as a head coach -- five with the Cleveland Browns, 24 with the Patriots -- he won 302 regular-season games (third-most ever), 31 playoff games (most ever) and six Super Bowls (most ever).All of those playoff and Super Bowl wins came with Kraft as the team's owner, a position he has held since 1994. Kraft hired Belichick back in 2000 in a stunning turn of events. The New York Jets initially hired Belichick (he was New York's defensive coordinator at the time), but at the press conference announcing the hiring, he announced he was leaving the team. It was an immediate boon for New England, which became a powerhouse for the next two decades under Kraft, Belichick and Tom Brady.\nAfter Brady's departure, however, New England began to struggle, and in early 2024, Belichick and the Patriots parted ways. It at first seemed like an amicable split, but the relationship has seemingly been rocky ever since. Kraft blamed Belichick for the Patriots' Super Bowl LII loss, and Kraft and Belichick both called partnering in the first place a \"big risk.\" On the other hand, Kraft said shortly before this season that he plans to build a statue for Belichick when his coaching career ends.Now, ironically, they could be reunited again. Despite his unparalleled success as an owner, Kraft has been frozen out of the Hall of Fame for more than a dozen years, something some attribute to the Patriots' \"Spygate\" cheating scandal. Other voters have mentioned \"Deflategate\" as well as dismissed charges after Kraft's two visits to a Jupiter, Florida, massage parlor. Some have wondered whether \"Spygate\" would impact Belichick's candidacy.\nFinalists must receive 80% of the vote from the full Selection Committee in order to make the Hall of Fame. Members can only vote for three of the five Blue-Ribbon Committees finalists, and only three of the five can make the Hall of Fame. The voting will occur in early 2026, and results will be revealed during Super Bowl LX week.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Belichick, Robert Kraft among five Pro Football Hall of Fame finalists - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/89a38a8d-4716-48cd-9a63-4872b7d3dc1f/thumbnail/1200x675/a6f9e91c22dc334da1091b7d1d9b2463/bill-belichick-robert-kraft.jpg"
      ],
      "datePublished": "2025-12-03T16:29:03.000Z",
      "dateModified": "2025-12-03T16:29:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Browns designate QB Deshaun Watson to return to practice from Achilles injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/browns-qb-deshaun-watson-practice-injury-shedeur-sanders/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/a99b071f-c2ee-4a10-b4da-1b8e3f0fd363/thumbnail/1200x675/5378bdf29ffa37e1b31859dacca19b20/deshaun-watson.jpg",
    "tag": "Sports",
    "date": "2025-12-03T16:21:36.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Cleveland Browns quarterback carousel will soo",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Cleveland Browns quarterback carousel will soon get another participant, as the team designated Deshaun Watson to return to practice for the first time since rupturing his Achilles last October. Watson has 21 days to practice or he will remain on injured reserve for the rest of the season.Watson suffered a setback in January that required a second surgery and extended his timeline for a return to the field. However, he is now set to begin ramping up his on-field workload. It's not clear what the timeline is for a potential return to actual game action for Watson. The Browns have five games left in this regular season and it's at least possible Watson gets a chance to take some snaps before the end of the year. It has been a wild season at the quarterback position in Cleveland, starting with the NFL Draft when they selected Dillon Gabriel and Shedeur Sanders in the third and fifth rounds, respectively. Those rookies joined a crowded QB room with Kenny Pickett and Joe Flacco. The Browns traded Pickett before the start of the season to the Raiders for a fifth-round pick.Flacco began the year as the starter where he went 1-3 and was benched in favor of Gabriel. He was then traded to the rival Bengals. Gabriel went 1-5 in six starts before suffering a concussion that thrust Sanders into action. Sanders struggled in his first action, but he picked up a win in his first start against the Raiders before then losing to the 49ers last week. \nNow, Watson's potential return to practice adds another layer to what has already been one of the league's most dramatic quarterback rooms. Watson has one more year remaining on his infamous, fully guaranteed $230 million contract for 2026. Watson arrived in Cleveland embroiled in controversy as he faced lawsuits alleging sexual misconduct from nearly two dozen massage therapists. Most of those lawsuits have been settled and he served an 11-game suspension from the NFL in his first season in Cleveland. \nWatson has played in just 19 games over four seasons with the Browns due to that suspension and various injuries. When he has played, his performance has been a disappointment, completing 61.2% of his passes for 3,365 yards, 19 touchdowns and 12 interceptions. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Browns designate QB Deshaun Watson to return to practice from Achilles injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/a99b071f-c2ee-4a10-b4da-1b8e3f0fd363/thumbnail/1200x675/5378bdf29ffa37e1b31859dacca19b20/deshaun-watson.jpg"
      ],
      "datePublished": "2025-12-03T16:21:36.000Z",
      "dateModified": "2025-12-03T16:21:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three potential Chris Paul landing spots, and why his next move is complicated - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/chris-paul-landing-spots-trade-buyout-clippers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/47b13b17-2ce2-40f8-976a-7c857f59beac/thumbnail/1200x675/5466928c8708e22411d49d3697b67295/chris-paul-getty-7.png",
    "tag": "Sports",
    "date": "2025-12-03T16:44:44.000Z",
    "description": "\n        Something is rotten in the state of Denmark. If Chris Paul and the Clippers had parted a few weeks from now, ideally at a more reasonable hou",
    "body": "\n        Something is rotten in the state of Denmark. If Chris Paul and the Clippers had parted a few weeks from now, ideally at a more reasonable hour, it could be chalked up to a Hall of Fame player preferring to finish his career in a different environment, perhaps one that includes more winning or minutes. But that's not how this played out.News of the Paul-Clippers separation broke a little before 3 a.m. ET on Wednesday, and yes, that is the appropriate time zone. The Clippers are in the middle of a four-game road trip. They played in Miami on Monday and will face the Hawks in Atlanta on Wednesday. This is not a rumor. Paul himself shared an Instagram post at 2:40 a.m. saying he'd just been sent home. The Clippers released a statement half an hour later confirming that Paul \"will no longer be with the team.\"Here's the problem: the Clippers technically can't separate from Paul officially, at least not yet. They have less than $1.3 million in room beneath their first-apron hard cap and only 14 players on the roster, so they can't waive his guaranteed salary. Teams can only drop below 14 rostered players for 14 days at a time and 28 days total in a season, and the Clippers don't have enough room to sign a veteran to replace Paul. They can't trade him either, as he was signed as a free agent this offseason, so the earliest he could be moved would be Dec. 15. So we're at least 12 days away from something official here. This happening now suggests that there's more to this story that we don't know yet.And that makes it pretty hard to predict what comes next. Paul hasn't played well this season, averaging just 2.9 points in 14.3 minutes on 32.1% shooting. Maybe he still has something left in the tank in a better situation. He was a viable, rotation-level point guard for the Spurs last season. But nobody gets dumped at 3 a.m. for performance alone. Until we know what really happened, it's hard to say which teams, if any, would be interested in allowing Paul complete his retirement tour with some dignity. Several of the teams that were interested over the summer have likely moved on. \nMilwaukee has gotten plenty of bang for its buck out of Ryan Rollins, Cole Anthony, Gary Trent Jr. and Kevin Porter Jr. The breakout of Collin Gillespie likely means there wouldn't be minutes available for him in Phoenix. The Lakers have sniffed around Paul several times in the past, but the last thing they need is another old ball-handler. There will be a sentimental push among some fans to get him back to Oklahoma City so he can try to finally win that elusive championship ring, but the Thunder have a full roster, no minutes to spare and no great need for veteran leadership after already winning the 2025 title. The Rockets could use another guard. With the contracts and draft picks at their disposal, they can do better.So finding Paul a new team won't be easy. It's possible he's played his last NBA game. If there is a fit here, it probably isn't a winning team. Paul just didn't play well enough to justify minutes for a team playing high-stakes basketball, and if Paul wanted to languish on a contender's bench, he frankly would have chosen to do so in prior offseasons. He wants to play. It might have to be for a younger team hoping to benefit from his years of wisdom. Ideally, it would be a Western Conference team, as Paul spoke openly about his desire to be closer to his family in Los Angeles before returning to the Clippers. That's not exactly a long list. Really, only three teams even come to mind.\n                            \n    \n                                                \n                    \n    New Orleans PelicansHere's the heartwarming reunion that actually makes a shred of sense. The Pelicans have a full roster, but some fairly expendable back-of-roster players they could easily swap out for Paul. Let's make it a reunion special and ship DeAndre Jordan back to the Clippers. The 3-19 Pelicans have the worst record in the NBA and nothing to play for this season, so bringing in a clearly diminished Paul wouldn't dim any short-term ambitions of theirs.\nBut he would be a valuable mentor for rookie point guard Jeremiah Fears. Paul's track record is excellent in that respect. He spent a year with Shai Gilgeous-Alexander in Oklahoma City and that obviously turned out quite well for the Thunder. He helped Devin Booker reach the Finals in his first trip to the playoffs, and Booker remains a star to this day. Stephon Castle won Rookie of the Year under Paul's watch. When your promising young guard is averaging below three assists per game, Paul is probably the sort of veteran you want hanging around him.Paul's Hall of Fame résumé would bring a layer of legitimacy to a young team like the Pelicans. That's something New Orleans needs. This organization is routinely criticized for its cheapness and lack of professionalism, with Dejounte Murray's offseason comments serving as the latest shot on that front. Having someone around who knows what a successful organization looks like certainly couldn't hurt. Joe Dumars and Troy Weaver have seemingly made leadership a priority in their first season on the job. That's why they overpaid Kevon Looney despite a skillset that doesn't exactly fit with their younger big men, and it's probably part of what got Jordan a job early in the year, as he's a widely beloved teammate. \"Beloved\" isn't always the term used on Paul. He's a kick in the pants more than a pat on the shoulder. But when you're 3-19, you probably need the former more than the latter. The real hangup here is how far Los Angeles is from New Orleans. There's a reason so many expansion plans seemingly include the Pelicans moving to the Eastern Conference. Still, a trade would amount to four months in Louisiana before his retirement, and it would give Paul a chance to mend fences with his first NBA fanbase. This is the only team that really makes a lot of sense.\n\n                            \n    \n                                                \n                    \n    Dallas MavericksThe Mavericks just did a speed run of the standard D'Angelo Russell experience. It's been a month-and-a-half and he's already fighting just to stay in the rotation. It usually takes teams a bit longer to fall out of love with the inconsistent former All-Star, but remember, Dallas is coached by Jason Kidd, a Hall of Fame point guard. It's hard to imagine him having much patience for such an up-and-down player.Paul is cut from a similar cloth as Kidd: relentless competitors and genius basketball thinkers. Cooper Flagg could benefit from his presence in many of the same ways that Fears would, though he obviously isn't a traditional point guard. The Mavericks could match money easily enough with Danté Exum, who's out for the season due to a knee injury. The Clippers just need someone to occupy their 14th roster spot. They don't have to actually use that player, though obviously, that would be preferable.The potential fringe benefit here? Paul could be a pretty helpful stealth tanking move. To players in the locker room, such an addition could be viewed as a rallying cry. \"We're adding a Hall of Famer! We can still turn this season around!\" But if he's still the player he was for the Clippers, well, that's not someone helping anyone win games, especially a team that needs shot-creation as badly as this team does. That should suit a Mavericks team who controls its own first-round pick for the last time until 2031 quite well. Paul could come in, teach Flagg some of his old tricks, retire with a bit of dignity, and then leave Dallas with a high draft pick. Seems like a nice outcome for everyone involved.\n\n                            \n    \n                                                \n                    \n    Sacramento KingsYes, I know. The Kings have a guard glut. The Kings have an old guard glut. Sacramento seemingly fired its former star guard bullet on Russell Westbrook, who has actually played well for them. DeMar DeRozan is still here. So is Zach LaVine. Malik Monk. Dennis Schröder. They can't find minutes for Keon Ellis, the best defender on the roster. Promising rookie Nique Clifford should also probably be playing more for a team in rebuild mode. All of that is valid.But you know what the Kings never actually addressed? Their need for a point guard. A traditional one, the sort Domantas Sabonis lobbied for after last season. Now, Sacramento's 5-16 start has likely put a pause on any veteran additions. Realistically, Paul could probably only come after another guard is traded to create some minutes. It certainly seems as though the Kings are trying, albeit with limited success thus far.But the reality here is that most of the Western Conference is trying to win games, and very few 40-year-old point guards have ever successfully helped a team do that. If Paul is going to get minutes anywhere, they probably have to be low-stakes minutes. Almost every minute the Kings have played for 20 years have been low stakes. If they can clear out their glut a little bit, Paul does seemingly fit a hole they've been trying to fill ever since they traded De'Aaron Fox. A Hall of Famer like Paul deserves better than retiring on one of the NBA's worst organizations, but his options are probably limited at this point. At least the Kings play in California, making for a reasonably easy trip home to Los Angeles.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three potential Chris Paul landing spots, and why his next move is complicated - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/47b13b17-2ce2-40f8-976a-7c857f59beac/thumbnail/1200x675/5466928c8708e22411d49d3697b67295/chris-paul-getty-7.png"
      ],
      "datePublished": "2025-12-03T16:44:44.000Z",
      "dateModified": "2025-12-03T16:44:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]