[
  {
    "title": "Louisville vs. Toledo prediction, odds, time, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/louisville-toledo-prediction-odds-spread-time-2025-boca-raton-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/a88c9970-18cb-4c8a-aedd-2c6544f11b3e/thumbnail/1200x675/23e6364971e38428b2a66d4afbcd28e8/miller-moss-louisville-cardinals-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T11:52:40.000Z",
    "description": "\n        The Toledo Rockets will take on the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed out the regular seas",
    "body": "\n        The Toledo Rockets will take on the Louisville Cardinals in the 2025 Boca Raton Bowl on Tuesday afternoon. Toledo closed out the regular season with a 21-3 win at Central Michigan on Nov. 29, while Louisville downed Kentucky 41-0 that same day. The Rockets (8-4), who tied for second in the MAC at 6-2, have won four in a row. They'll be led by interim head coach Robert Weiner after Jason Candle left for UConn. The Cardinals (8-4), who tied for seventh in the ACC, have lost three of four. Toledo quarterback Tucker Gleason is not expected to play after being injured in the regular-season finale. Louisville defensive linemen Rene Konga and Wesley Bailey have both opted out of this game, while leading receiver Chris Bell is out with an injury. Kickoff from Flagler Credit Union Stadium in Boca Raton, Fla., is at 2 p.m. ET. The Cardinals are 8.5-point favorites in the latest Louisville vs. Toledo odds, while the over/under for total points scored is 43.5 via SportsLine consensus. Before making any Toledo vs. Louisville picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Toledo vs. Louisville. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Louisville vs. Toledo:Toledo vs. Louisville                                                                                                                                         spreadLouisville -8.5 at DraftKings SportsbookToledo vs. Louisville                                                                                                                                     over/under43.5 pointsToledo vs. Louisville                                                                                                                                                                                                                                                     money line Louisville -338, Toledo +268Toledo vs. Louisville                                                                                                                                                                                                                                             picksSee picks at SportsLineToledo vs. Louisville                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Toledo vs. Louisville picksAfter 10,000 simulations of this matchup, SportsLine's model is going Over on the total (43.5). The Over has hit in four of Toledo's last seven games, and in four of Louisville's last 10.The model has Toledo running backs Chip Trayanum and Connor Walendzak combining to rush for more than 110 yards and one touchdown, while Louisville quarterback Miller Moss will throw for more than 250 yards and two touchdowns. The teams are projected to combine for 51 points as the Over clears in well over 60% of simulations.The model also also says one side of the spread hits over 50% of the time. You can see the model's pick at SportsLine.  So who wins Louisville vs. Toledo, and which side of the spread hits in over 50% of simulations? Visit SportsLine now to see which side of the Toledo vs. Louisville spread to jump on, all from the advanced model that's up on its top-ranked money-line and total picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisville vs. Toledo prediction, odds, time, spread: 2025 Boca Raton Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/a88c9970-18cb-4c8a-aedd-2c6544f11b3e/thumbnail/1200x675/23e6364971e38428b2a66d4afbcd28e8/miller-moss-louisville-cardinals-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T11:52:40.000Z",
      "dateModified": "2025-12-23T11:52:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Western Kentucky vs. Southern Miss prediction, odds: 2025 New Orleans Bowl picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/western-kentucky-southern-miss-prediction-odds-time-2025-new-orleans-bowl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/ec1eba02-5996-49e7-a865-639b0253ef14/thumbnail/1200x675/135ee660d81b6cf45299655643aa0584/braylon-braxton-southern-mississippi-golden-eagles-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T12:03:01.000Z",
    "description": "\n        A Tuesday college football bowl tripleheader has the Western Kentucky Hilltoppers taking on Southern Miss Golden Eagles in the middle matchup",
    "body": "\n        A Tuesday college football bowl tripleheader has the Western Kentucky Hilltoppers taking on Southern Miss Golden Eagles in the middle matchup. It's the 2025 New Orleans Bowl as the former Conference USA rivals will renew acquaintances. WKU (8-4) has dropped back-to-back games, both coming by three points, while Southern Miss (7-5) is on a three-game losing streak. The Hilltoppers are 4-0 all-time versus the Golden Eagles. Blake Anderson, who was promoted from offensive coordinator to head coach, will lead Southern Miss both in this game and going forward after Charles Huff left for Memphis. Kickoff is at 5:30 p.m. ET from the Caesars Superdome in New Orleans. Southern Miss is 4-1 all-time in the New Orleans Bowl, while WKU won its lone prior appearance. The Hilltoppers are 1.5-point favorites in the latest Southern Miss vs. Western Kentucky odds, while the over/under is 58.5. Before making any Western Kentucky vs. Southern Miss picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Southern Miss vs. WKU. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for WKU vs. Southern Miss:Southern Miss vs. Western Kentucky spreadWestern Kentucky -1.5 at DraftKings SportsbookSouthern Miss vs. Western Kentucky over/under58.5 pointsSouthern Miss vs. Western Kentucky money line WKU -116, Southern Miss -103Southern Miss vs. Western Kentucky picksSee picks at SportsLineSouthern Miss vs. Western Kentucky streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $250 in bonus bets at FanDuel if your $5 bet wins. How to make Western Kentucky vs. Southern Miss picksAfter simulating Southern Miss vs. Western Kentucky 10,000 times, SportsLine's model is going Under on the total (57.5 points).The Under is 6-3 over the last nine Western Kentucky games, while the Under has also hit in three out of the last four Southern Miss contests. Additionally, facing unfamiliar opponents have trended towards the total not being reached for both programs. The Under is 6-3 over WKU's last nine non-conference games, while it's 5-3 for the Golden Eagles when playing out-of-conference opponents.While both teams are projected to pile up heavy yardage, that doesn't necessarily mean lots of points due to the turnover factor. The teams are projected to combine for 3.5 turnovers, on average, which stunts many drives. With that, the game is forecasted to hit the Under well over 50% of the time.The model also says one side of the spread hits well over 60% of the time. You can see the model's pick at SportsLine.  So who wins Western Kentucky vs. Southern Miss, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Southern Miss vs. Western Kentucky spread to jump on, all from the advanced model that's up on its top-ranked money-line picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Western Kentucky vs. Southern Miss prediction, odds: 2025 New Orleans Bowl picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/ec1eba02-5996-49e7-a865-639b0253ef14/thumbnail/1200x675/135ee660d81b6cf45299655643aa0584/braylon-braxton-southern-mississippi-golden-eagles-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T12:03:01.000Z",
      "dateModified": "2025-12-23T12:03:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks for Week 17, score predictions, best bets today from self-learning AI - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-17-picks-ai-score-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/16/c2a3f6b8-9901-4b6a-9d0e-c2f0354d0aa9/thumbnail/1200x675/4c359b4910216a9631f25c7b07f3e178/steelers.jpg",
    "tag": "Sports",
    "date": "2025-12-23T13:44:02.000Z",
    "description": "\nThe NFL Week 17 schedule features a full slate of games, including 10 on Sunday, several of which have a direct bearing on the NFL playoffs and seedi",
    "body": "\nThe NFL Week 17 schedule features a full slate of games, including 10 on Sunday, several of which have a direct bearing on the NFL playoffs and seeding. In the NFC, the NFC West-leading Seattle Seahawks take on the NFC South-leading Carolina Panthers. Seattle enters as a 7.5-point favorite at DraftKings Sportsbook. In the AFC South, the division-leading Jacksonville Jaguars take on the Indianapolis Colts. The Jaguars are favored by 6.5 points. Sunday's largest spread is Patriots (-13.5) vs. Jets, while another larger spread is on 'Monday Night Football,' with the Rams (-8.5) vs. Falcons. The smallest spreads Sunday include Giants vs. Raiders (-1.5), Saints (-2.5) vs. Titans, Eagles vs. Bills (-2.5) and Bears vs. 49ers (-2.5) on 'Sunday Night Football.' Seattle entered the weekend as the NFC's top seed, while Denver was first in the AFC. Before making any Week 17 NFL picks or NFL score predictions on those games or others, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For Week 17 NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all 16 games. You can only see the AI predictions for the Week 17 NFL schedule here.Top Week 17 NFL AI picksAfter analyzing every game in Week 17, the AI says the Steelers (-3.5, 34), who have won three in a row, cover comfortably against the Browns. \nThe Steelers have gone over in two of their last three games, while the over has hit in six of the past 10 Browns games. Bet the Over 34.5 in the latest DraftKings promo code, which offers $200 in bonus bets if your first bet wins:\nPittsburgh is looking to win its first AFC North title since 2020 and is expected to win comfortably over the division-rival Browns. A win would be their third in a row over Cleveland. SportsLine AI rates the Steelers as an A+ spread pick and also predicts a 24-15 win on average. See its other Week 17 football predictions and football picks at SportsLine, and bet the Steelers at DraftKings here:\nHow to make Week 17 NFL picksIn addition, the AI PickBot has generated more than two dozen highly-coveted A picks for Week 17. You need to see the AI's NFL picks before making any Week 17 NFL bets of your own. You can only see them at SportsLine.Who wins and covers each Week 17 NFL game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under, and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks for Week 17, score predictions, best bets today from self-learning AI - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/16/c2a3f6b8-9901-4b6a-9d0e-c2f0354d0aa9/thumbnail/1200x675/4c359b4910216a9631f25c7b07f3e178/steelers.jpg"
      ],
      "datePublished": "2025-12-23T13:44:02.000Z",
      "dateModified": "2025-12-23T13:44:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs vs. Broncos prediction, odds, spread: 'Thursday Night Football' picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/broncos-chiefs-prediction-odds-2025-christmas-nfl-thursday-night-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/9e527c27-d559-4c5b-a164-eaa4c15bd00a/thumbnail/1200x675/6043e28be4d7eb1324ef94069f9ed856/imagn-bo-nix-broncos.jpg",
    "tag": "Sports",
    "date": "2025-12-23T13:01:26.000Z",
    "description": "\nThe 2025 NFL Christmas schedule concludes with a \"Thursday Night Football\" AFC West battle of teams in a surprising position as the Kansas City Chief",
    "body": "\nThe 2025 NFL Christmas schedule concludes with a \"Thursday Night Football\" AFC West battle of teams in a surprising position as the Kansas City Chiefs host the Denver Broncos. The Broncos (12-3) lead the entire AFC and are chasing a top seed and a bye in the NFL playoffs. Kansas City, meanwhile, has been eliminated from the playoff picture. Kansas City is down to third quarterback Chris Oladokun and Shane Buechele, signed off the Buffalo practice squad on Monday, after losing Patrick Mahomes and Gardner Minshew to knee injuries in consecutive weeks. Kickoff from GEHA Field at Arrowhead Stadium in Kansas City is set for 8:15 p.m. ET. The latest Broncos vs. Chiefs odds have Denver favored by 12.5 points, while the over/under for total points scored is 36.5 via DraftKings Sportsbook. Before making any Chiefs vs. Broncos picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Chiefs vs. Broncos. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Broncos vs. Chiefs:Broncos vs. Chiefs spreadDenver -12.5 at DraftKings SportsbookBroncos vs. Chiefs over/under36.5 pointsBroncos vs. Chiefs money line Denver -877, Kansas City +593Broncos vs. Chiefs picksSee picks at SportsLineBroncos vs. Chiefs streaming Amazon Prime \nWhy the Chiefs can coverThe Chiefs haven't been this big of an underdog since the 2021 season, so it's a massive amount of points to be getting for the Chiefs, especially at home. Kansas City has been decimated by injuries at quarterback, but still has star power in tight end Travis Kelce, defensive lineman Chris Jones, receiver Xavier Worthy and others. Even in a the midst of a lost season, they'll be highly-motivated to avoid a blowout at the hands of their division rivals in the national spotlight. Denver is just 2-5 against the spread on the road and it only has two double-digit wins this season. The Broncos are also coming off a poor showing against the Jaguars, losing 34-20 despite being 3.5-point favorites in that Week 16 matchup. See which team to back at SportsLine. Why the Broncos can coverDenver has more to play for as the Broncos have the inside track for the top seed in the AFC side of the NFL playoff bracket. The Broncos already beat the Chiefs 22-19 last month, and that was when Kansas City had Mahomes and was still in contention, so a much bigger margin could be in play in this one. The Chiefs are just 5-10 overall this season against the spread. They are also just 1-7 ATS against quality opponents (teams that have won 55% or more of games) 0-7 ATS against teams that give up fewer than 21 points per game. Denver ranks fifth in the NFL in scoring defense (19.7 ppg), fourth in the NFL in total defense (291.6 ypg) and leads the league in total sacks (63) by a wide margin, making life extremely tough on a quarterback with virtually no experience. See which team to back at SportsLine.How to make Chiefs vs. Broncos picksSportsLine's model has simulated Broncos vs. Chiefs 10,000 times and is going Over on the total, projecting 37 combined points. It also says one side of the spread hits nearly 60% of the time. You can only get the pick at SportsLine. So who wins Broncos vs. Chiefs, and which side of the spread hits in nearly 60% of simulations? Visit SportsLine now to see which side of the spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs vs. Broncos prediction, odds, spread: 'Thursday Night Football' picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/9e527c27-d559-4c5b-a164-eaa4c15bd00a/thumbnail/1200x675/6043e28be4d7eb1324ef94069f9ed856/imagn-bo-nix-broncos.jpg"
      ],
      "datePublished": "2025-12-23T13:01:26.000Z",
      "dateModified": "2025-12-23T13:01:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions vs. Vikings prediction, odds, spread: NFL Christmas picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-vikings-prediction-odds-time-2025-christmas-day-nfl-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/21700c26-8ca5-4ae8-bfb9-7e6052d08439/thumbnail/1200x675/56be78b556da332ee9afc59e8ed19f85/justin-jefferson-minnesota-vikings-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-23T12:44:44.000Z",
    "description": "\nThe NFL Week 17 schedule begins with a Christmas Day tripleheader, with the middle matchup seeing the Detroit Lions visiting the Minnesota Vikings. D",
    "body": "\nThe NFL Week 17 schedule begins with a Christmas Day tripleheader, with the middle matchup seeing the Detroit Lions visiting the Minnesota Vikings. Detroit (8-7) has dropped two in a row and must now win out, plus get some help, in order to make the postseason. Minnesota (7-8) has won three in a row and is coming off a 16-13 victory over the New York Giants. The Vikings have been eliminated from postseason contention. J.J. McCarthy (hand) did not practice on Monday. Max Brosmer would be in line to start if McCarthy can't go.Kickoff from U.S. Bank Stadium in Minneapolis is set for 4:30 p.m. ET. The Vikings prevailed in these teams' Week 9 matchup, which ended a five-game win streak by the Detroit in the series. The latest Vikings vs. Lions odds have Detroit favored by 6 points, while the over/under for total points scored is 44.5 via DraftKings Sportsbook. Before making any Lions vs. Vikings picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 17 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Vikings vs. Lions. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Lions vs. Vikings:Vikings vs. Lions                                                                       spreadDetroit -6 at DraftKings SportsbookVikings vs. Lions                   over/under44.5 pointsVikings vs. Lions                                                                                                                                                                                   money line Detroit -267, Minnesota +217Vikings vs. Lions                                                                                                                                                                           picksSee picks at SportsLineVikings vs. Lions                                                                                                                                                                            streaming Netflix\nWhy the Lions can coverDetroit is facing a must-win scenario to have any chance at the postseason, so it has the clear motivational edge over Minnesota, which has already been knocked out of playoff contention. The Lions have won five of the last six matchups, but their spread success goes back beyond that. Detroit sports a 9-1 ATS record versus Minnesota over their last 10 meetings. Additionally, there's no greater discrepancy between these teams than what's arguably the most important statistic in football, and that's turnovers. The Lions have the fewest giveaways (eight) in the NFL, while the Vikings have the most (29). See which team to back at SportsLine. Why the Vikings can coverMinnesota has found its groove as it has both outright won and covered in three straight games. The defense has been the catalyst as it had a season-high-tying of five sacks in Sunday's win over New York. Minnesota's defense also didn't allow a touchdown in that game, which came two weeks after pitching a shutout of Atlanta. The Vikings are on an amazing run of six straight games without giving up a passing score, and Justin Jefferson finally got going to help out the offense. He's coming off an 85-yard game, which is as many yards that he had over his previous four games combined and is his most yards since Week 5. His success could continue versus Detroit's No. 25 pass defense that has given up the fourth-most passing TDs. See which team to back at SportsLine.How to make Lions vs. Vikings picksSportsLine's model has simulated Vikings vs. Lions 10,000 times and is going Over on the total, projecting 47 combined points. It also says one side of the spread hits well over 50% of the time.         You can only get the pick at SportsLine. So who wins Lions vs. Vikings, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Vikings vs. Lions spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions vs. Vikings prediction, odds, spread: NFL Christmas picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/21700c26-8ca5-4ae8-bfb9-7e6052d08439/thumbnail/1200x675/56be78b556da332ee9afc59e8ed19f85/justin-jefferson-minnesota-vikings-imagn-images.jpg"
      ],
      "datePublished": "2025-12-23T12:44:44.000Z",
      "dateModified": "2025-12-23T12:44:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Commanders prediction, odds: Week 17 NFL Christmas Day picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-commanders-prediction-odds-start-time-week-17-nfl-christmas-day-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/f833566c-159f-4782-9973-fcb258cc22bf/thumbnail/1200x675/8540629c139189ca31843b5f13af52c6/dak-prescott-dallas-cowboys.jpg",
    "tag": "Sports",
    "date": "2025-12-23T13:30:12.000Z",
    "description": "\nNFC East rivals looking to finish out disappointing seasons meet when the Dallas Cowboys take on the Washington Commanders on Christmas Day. Dallas i",
    "body": "\nNFC East rivals looking to finish out disappointing seasons meet when the Dallas Cowboys take on the Washington Commanders on Christmas Day. Dallas is coming off a 34-17 loss to the Los Angeles Chargers on Sunday, while Washington dropped a 29-18 decision to the Philadelphia Eagles on Saturday. The Cowboys (6-8-1), who have lost three in a row, are 2-5 on the road this season. Both teams have been eliminated from playoff contention. The Commanders (4-11), who have lost nine of 10, are 2-5 on their home field. It's uncertain who Washington will start at quarterback with Jayden Daniels (elbow) shut down for the season and Marcus Mariota (hand/quad) missing practice on Monday.Kickoff from Northwest Stadium in Landover, Md., is set for 1 p.m. ET. The Cowboys lead the all-time series 80-49-2, including wins in four of the last five meetings. The Cowboys are 6.5-point favorites in the latest Cowboys vs. Commanders odds, while the over/under for total points scored is 50.5 via DraftKings Sportsbook. Before making any Commanders vs. Cowboys picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 17 on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Cowboys vs. Commanders. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Cowboys vs. Commanders:Cowboys vs. Commanders                                                                         spreadDallas -6.5 at DraftKings SportsbookCowboys vs. Commanders                     over/under50.5 pointsCowboys vs. Commanders                                                                                                                                                                                     money line Dallas -300, Washington +244Cowboys vs. Commanders                                                                                                                                                                             picksSee picks at SportsLineCowboys vs. Commanders                                                                                                                                                                               streaming Netflix \nWhat you need to know about the CowboysVeteran quarterback Dak Prescott powers the Dallas offense. In 15 games this season, he has completed 68.5% of his passes for 4,175 yards and 28 touchdowns with 10 interceptions and a 100.0 rating. He has also carried 47 times for 154 yards (3.3 average) and two touchdowns. In Sunday's loss to the Chargers, Prescott completed 21 of 30 passes for 244 yards and two touchdowns. He also rushed twice for 14 yards.Wide receiver George Pickens is one of Prescott's top targets. In 15 games, he has 88 receptions for 1,342 yards (15.3 average) and nine touchdowns. He has 21 explosive plays of 20 yards or more, including a long of 45, with 426 yards after the catch and 69 first-down conversions. In the loss to the Chargers, he caught seven passes for 130 yards (18.6 average) and one touchdown. See which team to back at SportsLine. What you need to know about the CommandersWith quarterbacks options dwindling, Washington might turn to veteran journeyman Josh Johnson. In three games, Johnson has completed 55.6% of his passes for 43 yards and one interception. Washington also signed Jeff Driskel this week to provide depth. Among Washington's top receivers is veteran wide receiver Deebo Samuel. In 14 games, he has 68 receptions for 639 yards (9.4 average) and five touchdowns. He has eight explosive plays of 20 yards or more, including a long of 38, with 384 yards after the catch and 29 first-down conversions. In a 16-13 loss against Miami on Nov. 16, he caught seven passes for 74 yards and one touchdown. See which team to back at SportsLine.How to make Cowboys vs. Commanders picksSportsLine's model is going Over on the total, projecting 60 combined points. It also says one side of the spread hits 60% of the time.         You can only get the pick at SportsLine. So who wins Cowboys vs. Commanders, and which side of the spread hits 60% of the time? Visit SportsLine now to see which side of the Cowboys vs. Commanders spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Commanders prediction, odds: Week 17 NFL Christmas Day picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/f833566c-159f-4782-9973-fcb258cc22bf/thumbnail/1200x675/8540629c139189ca31843b5f13af52c6/dak-prescott-dallas-cowboys.jpg"
      ],
      "datePublished": "2025-12-23T13:30:12.000Z",
      "dateModified": "2025-12-23T13:30:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts vs. 49ers prediction, odds: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-49ers-prediction-odds-line-time-spread-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/141966cf-5582-43c4-aa22-f76e2c023a28/thumbnail/1200x675/37d8dfa26cfc90f1029a8d711d223cf9/philip-rivers-indianapolis-colts-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T23:20:32.000Z",
    "description": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4",
    "body": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4) have won four straight, all of them coming by multiple scores, including a 37-24 win over Tennessee in Week 15. The Colts (8-6), meanwhile, are riding a four-game losing streak and fell to Seattle, 18-16, last week. Quarterback Philip Rivers, who came out of retirement last week following Daniel Jones' Achilles injury, will start again for the Colts with rookie Riley Leonard backing him up. Cornerback Sauce Gardner (calf) is out for Indianapolis. Ricky Pearsall (knee, ankle) is out for the Niners. Kickoff is at 8:15 p.m. ET from Lucas Oil Stadium in Indianapolis. The latest 49ers vs. Colts odds from DraftKings Sportsbook have San Francisco as the 4.5-point road favorite, while the over/under for total points scored is 46. Before making any Colts vs. 49ers     picks, be sure to see the NFL predictions from SportsLine's projection model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on San Francisco vs. Indianapolis. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Colts vs. 49ers:49ers vs. Colts              spread49ers -4.5 at DraftKings Sportsbook49ers vs. Colts                  over/under46 points49ers vs. Colts                  money line 49ers -230, Colts +19049ers vs. Colts                  picksSee picks at SportsLine49ers vs. Colts          streaming Fubo (Try for free)\nWhy the 49ers can coverThe Niners have covered in each contest of their four-game win streak, while Brock Purdy is 5-1 ATS this season. San Fran also has a huge primetime advantage when it comes to the spread, as it has covered in all three such games this year, while Indy is 0-5 ATS over its last five under the bright lights of primetime. Despite batting major injuries all year, the Niners still rank among the top four in both third-down offense and passing offense. The Colts' offense should have difficulty keeping up with the 49ers as Indianapolis has scored 20 or fewer points in four straight games. See which team to back at SportsLine.Why the Colts can coverThe Colts have owned this series recently, winning five straight overall matchups and going 9-3 over the last dozen home meetings. Indy controls the trenches, leading the NFL in rushing touchdowns while ranking second by allowing just 3.7 yards per rush. The ground game is already a struggle for the 49ers, who rank 31st with 3.5 yards per carry, and Rivers should find more success in his second week back. He's had a full week in the practice facility, is at home instead of a hostile environment like Seattle, and the Niners rank dead last in the NFL in defensive sacks. See which team to back at SportsLine. How to make Colts vs. 49ers           picksFor 49ers vs. Colts   on 'Monday Night Football,' the model is leaning Over the total, projecting 52 combined points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine.Who wins Colts vs. 49ers, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the 49ers vs. Colts spread you need to jump, all from the model that is 52-37 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts vs. 49ers prediction, odds: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/141966cf-5582-43c4-aa22-f76e2c023a28/thumbnail/1200x675/37d8dfa26cfc90f1029a8d711d223cf9/philip-rivers-indianapolis-colts-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T23:20:32.000Z",
      "dateModified": "2025-12-22T23:20:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Monday Night Football' prediction, odds, time: 49ers vs. Colts picks from Niners expert who's 18-4 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/monday-night-football-prediction-odds-spread-time-49ers-colts-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/16/2261e011-5e7e-4db6-87a6-655de191cb71/thumbnail/1200x675/a129fdaf2f43e66abc3edde64bb494e7/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-22T23:45:37.000Z",
    "description": "\nThe Indianapolis Colts will look to snap a four-game losing streak when they battle the San Francisco 49ers on Monday Night Football. San  Francisco ",
    "body": "\nThe Indianapolis Colts will look to snap a four-game losing streak when they battle the San Francisco 49ers on Monday Night Football. San  Francisco is coming off a 37-24 win over the Tennessee Titans on Sunday, while Indianapolis dropped an 18-16 decision at Seattle. The 49ers (10-4), who are third in the NFC West, are 6-2 on the road this year. The Colts (8-6), who are third in the AFC South, are 6-1 on their home field. Indianapolis will start 44-year-old Philip Rivers for a second week in a row.Kickoff from Lucas Oil Stadium in Indianapolis is set for 8:15 p.m. ET. The Colts lead the all-time series 27-19, including wins in each of the last five meetings. San Francisco is a 4.5-point favorite in the latest 49ers vs. Colts odds, while the over/under for total points scored is 46 at DraftKings Sportsbook. Before making any Colts vs. 49ers picks, make sure to check out the 'Monday Night Football' predictions from SportsLine NFL expert Micah Roberts.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Christian McCaffrey anytime TD scorer:\nRoberts has worked in the Las Vegas sportsbook industry for 20-plus years, including a 13-year run as Station Casinos' book director. Armed with an elaborate network of sources, Roberts has unmatched info in multiple sports. Most importantly, Roberts has a read on the pulse of the 49ers. He is 18-4 (+1360) on his last 22 against-the-spread picks in games involving San Francisco. Anyone following could have seen huge returns. Now, Roberts has set his sights on 49ers vs. Colts and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and NFL betting lines for Colts vs. 49ers: 49ers vs. Colts                                     spreadSan Francisco -4.5 at DraftKings Sportsbook49ers vs. Colts                                           over/under46 points49ers vs. Colts                                           money line San  Francisco -230, Indianapolis +19049ers vs. Colts                                       picksSee picks at SportsLine49ers vs. Colts                                           streaming Fubo (Try for free)  \nWhy the 49ers can winQuarterback Brock Purdy has played in six games this season. He has completed 67.9% of his passes for 1,442 yards and 12 touchdowns with seven interceptions and a 96.0 rating. In the win over Tennessee, he completed 23 of 30 passes for 295 yards and three touchdowns. He completed 22 of 38 passes for 309 yards and two touchdowns with two interceptions in a 26-21 loss to Jacksonville on Sept. 28.Running back Christian McCaffrey continues to post huge numbers. He leads the 49ers in both rushing and receiving. In 14 games, he has rushed 259 times for 922 yards (3.6 average) and nine touchdowns. He also has 86 receptions for 820 yards (9.5 average) and five touchdowns. In a 41-22 win over Arizona on Nov. 16, he carried 13 times for 81 yards and two touchdowns, while catching five passes for 40 yards and a score. See which team to back at SportsLine. Bet Brock Purdy to go Over 247.5 passing yards at DraftKings:\nWhy the Colts can winRunning back Jonathan Taylor has been dominant and leads the Indianapolis offense. In 14 games, he has carried 272 times for 1,443 yards (5.3 average) and 16 touchdowns. He also has 38 receptions for 318 yards and two touchdowns. In a 31-25 overtime win over the Atlanta Falcons on Nov. 9, he carried 32 times for 244 yards and three touchdowns.Wide receiver Michael Pittman Jr. is among Indianapolis' top pass catchers. In 14 games, he has 72 receptions for 725 yards (10.1 average) and seven touchdowns. He has five explosive plays of 20 yards or more, including a long of 27, with 245 yards after the catch and 44 first-down conversions. In a 36-19 loss at Jacksonville, he caught nine passes for 79 yards, including a long of 24. See which team to back at SportsLine.Bet Jonathan Taylor to go Over 16.5 for longest rush at DraftKings:\nHow to make 49ers vs. Colts  picksRoberts has analyzed 49ers vs. Colts from every angle and he's leaning Under on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins 49ers vs. Colts, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the 49ers vs. Colts spread you need to jump on, all from the expert that is 18-4 on his last 22 San Francisco 49ers picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Monday Night Football' prediction, odds, time: 49ers vs. Colts picks from Niners expert who's 18-4 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/16/2261e011-5e7e-4db6-87a6-655de191cb71/thumbnail/1200x675/a129fdaf2f43e66abc3edde64bb494e7/christian-mccaffrey-san-francisco-49ers-imagn-images.jpg"
      ],
      "datePublished": "2025-12-22T23:45:37.000Z",
      "dateModified": "2025-12-22T23:45:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warriors' Draymond Green explains why he left game after heated Steve Kerr exchange - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/warriors-draymond-green-exits-game-steve-kerr/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/4f495296-fda8-4673-bd9d-f5c4a41868cf/thumbnail/1200x675/c2e0a80e91ca2ac16cc34b8506bee7bb/green25.png",
    "tag": "Sports",
    "date": "2025-12-23T14:54:19.000Z",
    "description": "\n        Draymond Green missed the final 20 minutes of the Golden State Warriors' 120-97 win over the Orlando Magic after going to locker room followi",
    "body": "\n        Draymond Green missed the final 20 minutes of the Golden State Warriors' 120-97 win over the Orlando Magic after going to locker room following a heated argument with coach Steve Kerr.The exchange occurred early in the third quarter with the Warriors trailing, 71-66. Kerr called the timeout after Green committed a turnover. Things got heated between the two during the timeout, which led to Green excusing himself from the bench and retreating to the locker room. \"We had it out a little bit,\" Kerr said, via ESPN. \"He made his decision to go back to the locker room to cool off. That's all I'm going to say about it. Everything is private.\"\nGreen returned to the bench before the start of the fourth quarter, but he didn't re-enter the game. \n\"Tempers spilled over, and I thought it was best that I get out of there,\" Green said. \"I don't think it was a situation where it was going to get better. It was best to remove myself.\"The situation largely overshadowed what Kerr said was one of team's better wins of the season, a win that evened their record at 15-15. Kerr specifically said that Draymond \"played great\" prior to his early exit. In fewer than 18 minutes of work, Green tallied nine points, seven rebounds and two assists.Stephen Curry scored a team-high 26 points despite going just 10 of 23 from the field. The Warriors received efficient games from Jimmy Butler and Moses Moody, who scored a combined 41 points while making 75% of their shots. \n\"The questions are a little bit more negative than they should be,\" Curry said afterward. \"I get why you're asking them, but downstairs right now, the DJ has a good playlist going, the guys are getting their work in and we're having a good time because we're winning.\"Based on what Kerr, Curry and Green said afterward, it appears that the situation is water under the bridge as the Warriors turn their attention to their matchup with the Dallas Mavericks on Christmas Day. \"We've been at this now for a long time,\" Green said. \"Sometimes you're with people for a long time and there's a level of comfort and shit happens. We move forward.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warriors' Draymond Green explains why he left game after heated Steve Kerr exchange - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/4f495296-fda8-4673-bd9d-f5c4a41868cf/thumbnail/1200x675/c2e0a80e91ca2ac16cc34b8506bee7bb/green25.png"
      ],
      "datePublished": "2025-12-23T14:54:19.000Z",
      "dateModified": "2025-12-23T14:54:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baseball Hall of Fame: Manny Ramírez rides out 10th (and last) chance on the ballot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/manny-ramirez-baseball-hall-of-fame-steroids-suspensions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/18/8eeabc42-b343-4eb3-b081-cb1a6624a132/thumbnail/1200x675/557182980b13d066ddfd609c9d553617/manny-getty.png",
    "tag": "Sports",
    "date": "2025-12-23T15:00:58.000Z",
    "description": "\n        Manny Ramírez is on the ballot for the 2026 Baseball Hall of Fame class. Again. It's his 10th time, which means it's his final chance. Spoile",
    "body": "\n        Manny Ramírez is on the ballot for the 2026 Baseball Hall of Fame class. Again. It's his 10th time, which means it's his final chance. Spoiler coming: He won't make it. Ramírez debuted on the ballot for the 2017 Hall of Fame class and got 23.8% of the vote. He stagnated for three years before jumping to the 28% range for three years before he saw another jump to roughly one-third of the vote. He hit a new high last year, but that was only 34.3%. Players can typically see a final year bump, but not like this. The largest one in recent memory to make the Hall of Fame was Larry Walker, who saw a 22-point increase that saw him squeak into the Hall on his 10th and final try. Barry Bonds' final year bump only took him from 61.8% to 66%.Bonds was a better all-around player -- by a decent margin -- and, though he was tied to PEDs, was never suspended by the league. Now consider that Ramírez was nailed by MLB twice and slapped with PED-related suspensions. In light of this, I feel extremely confident that Manny isn't going to see the 40-point jump to get to the required 75% for Hall of Fame induction. \nThat means we're saying goodbye to him being on the ballot. In parts of 19 seasons, Ramírez hit .312/.411/.585 (154 OPS+) with 2,574 hits, 547 doubles, 20 triples, 555 home runs, 1,831 RBI, 1,544 runs and 69.3 WAR. His issues on the bases and in the field dragged down his overall WAR, but his offensive WAR is 34th in MLB history. He also sits 90th in average, 36th in on-base percentage, 12th in slugging, 12th in OPS, 31st in OPS+, 91st in hits, 34th in doubles, 15th in home runs, 20th in RBI, 61st in runs, 30th in total bases, 42nd in walks, 48th in times on base and 18th in extra-base hits. Aside: He also had the funniest cut-off in baseball history.\nThat's the dossier of one of the greatest sluggers the game has ever seen. The eye test matched it. He was feared and for those who either weren't alive or don't remember, he was a big deal. Huge. Additionally, Ramírez won two World Series with the Red Sox, including the 2004 title, one of the most famous in MLB history. He hit .285 with a .937 OPS in the playoffs and still holds the record with 29 postseason home runs. \nEven with the shortfall on defense and baserunning, Manny sits eighth among left fielders all-time in WAR, trailing only Bonds, Ted Williams, Rickey Henderson, Carl Yastrzemski, Pete Rose, Ed Delahanty and Tim Raines. He is above Hall of Famers Al Simmons, Fred Clarke, Goose Goslin, Billy Williams, Willie Stargell, Joe Medwick and plenty of others. It's the statistical resume of a Hall of Famer. And yet, we're saying goodbye to Ramírez without him having ever gotten close to induction. On May 7, 2009, he was suspended for 50 games for a violation of the Joint Drug Agreement. Ramírez at the time said he accidentally took a banned medication. The drug used was, reportedly, hCG, which is a women's fertility drug that has generally been used by steroid users to restart testosterone intake after a steroid cycle. On April 8, 2011, Ramírez was again busted by the league. Rather than serve his 100-game suspension, he retired.This has all been enough to scare off well more than 60% of the BBWAA voting body, including yours truly. He did not get my vote this year either, and it'll be the final time we see his name on the ballot. Maybe Ramírez will fare better with an Era Committee down the road, but I wouldn't count on that happening any time soon. The best bet is that if Manny Ramírez ever gets into the Hall of Fame, it'll be decades from now. \nHappy Trails, Manny.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baseball Hall of Fame: Manny Ramírez rides out 10th (and last) chance on the ballot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/18/8eeabc42-b343-4eb3-b081-cb1a6624a132/thumbnail/1200x675/557182980b13d066ddfd609c9d553617/manny-getty.png"
      ],
      "datePublished": "2025-12-23T15:00:58.000Z",
      "dateModified": "2025-12-23T15:00:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Phillip Rivers contract 2025: Colts QB salary details in NFL return - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/phillip-rivers-contract-salary-colts-quarterback/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/ec167ba2-1a83-4d2b-975c-a9109b410e47/thumbnail/1200x675/e7fcf4b5bd546fd88fc8d49ba3f5c469/philip-rivers.jpg",
    "tag": "Sports",
    "date": "2025-12-23T01:17:19.000Z",
    "description": "\n        While the brief return of Philip Rivers is clearly about more than a paycheck, he is nonetheless being financially compensated during his NFL",
    "body": "\n        While the brief return of Philip Rivers is clearly about more than a paycheck, he is nonetheless being financially compensated during his NFL comeback with the Indianapolis Colts. Rivers, who made $244 million during his first 17 seasons in the NFL, is making a prorated veteran minimum of $278,889 for the final weeks of the 2025 season. Rivers' return also restarted his five-year NFL heath insurance coverage. Not a bad deal for a 44-year-old father of 10 and grandfather of one who had not played a down of professional football in nearly five years. Rivers has a chance to further cash in on his comeback if he can lead the Colts to the playoffs. Players on wildcard teams receive $49,500, while players on division championship teams will earn an additional $54,500, which is the same amount players receive if their teams advance to the divisional round of the playoffs. Players whose teams reach the conference championship receive an additional $77,000. The Super Bowl runner-up earns $96,000, and players on the team that wins Super Bowl LX will rake in $171,000. \nAs noted above, Rivers' return to the gridiron is not financially motivated. A high school football coach since his initial retirement from the NFL, Rivers hopes that his comeback can serve as inspiration. \"There is doubt, and it's real,\" Rivers said following the Colts' Week 15 loss to Seattle. \"The guaranteed safe bet is to go home or to not go for it, and the other one is, 'Shoot, let's see what happens.' I hope in that sense that can be a positive to some young boys, or young people.\"Given the circumstances, Rivers' season debut was largely a success. He went 18 of 27 for 120 yards with a touchdown and an interception as the Colts nearly upset the Seahawks in Seattle. Rivers also came away from the game largely unscathed. \nRivers hopes to push the ball downfield more on on Monday night against a San Francisco 49ers team that -- like the Colts -- is fighting for playoff spot. \"I don't feel any really limitations pushing the ball down the field,\" he said. \"Am I gonna throw it 60 yards? No, but I can't name many times I ever did that anyway. But if you get it out on time in the things that we can do, I don't think that there's like, 'Oh, we can't call this, or we can't call that.' It'll be a solid plan that the staff puts together and and we'll have a great week of practice and go out and execute.\"LIVE updates: Follow along with all the action as the Colts battle the 49ers on \"Monday Night Football.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Phillip Rivers contract 2025: Colts QB salary details in NFL return - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/ec167ba2-1a83-4d2b-975c-a9109b410e47/thumbnail/1200x675/e7fcf4b5bd546fd88fc8d49ba3f5c469/philip-rivers.jpg"
      ],
      "datePublished": "2025-12-23T01:17:19.000Z",
      "dateModified": "2025-12-23T01:17:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DK Metcalf suspension voids $45 million in guarantees, could alter Steelers outlook - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/dk-metcalf-suspension-voids-40m-in-guarantees-gives-steelers-future-financial-out/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/23/b43b8694-2a80-45e6-8d07-0f4c63ba27f8/thumbnail/1200x675/b6f1609e5b16b9c6eca22cdfaf037d22/dkmetcalfsteelers-1.jpg",
    "tag": "Sports",
    "date": "2025-12-23T01:48:15.000Z",
    "description": "\n        DK Metcalf's physical confrontation with a Detroit Lions fan Sunday will see him miss the rest of the regular season and forfeit more than $5",
    "body": "\n        DK Metcalf's physical confrontation with a Detroit Lions fan Sunday will see him miss the rest of the regular season and forfeit more than $555,000 in salary. But the impact could go beyond that. The two-game suspension for what the NFL terms \"conduct detrimental\" to the league now voids at least $45 million in future guaranteed money for the Pittsburgh Steelers receiver. Metcalf would still be able to earn that money over the next two years.His four-year, $132 million contract from March, reviewed by CBS Sports, notes that if he \"fails… to practice or play with the Club for any reason,\" which includes \"Player's suspension by the NFL or Club for Conduct Detrimental,\" his guarantees \"will be NULL AND VOID.\"Metcalf appeared to throw a punch at a Lions fan during the first half of Pittsburgh's eventual 29-24 win Sunday. Metcalf reportedly had prior history with the fan when he was a member of the Seattle Seahawks. \nMetcalf plans to appeal his two-game suspension, which will be heard by either commissioner Roger Goodell or one of his designees. Even if Metcalf's suspension is reduced to one game, his contract guarantees would still automatically void.Metcalf's 2026 salary of $25 million was previously fully guaranteed. Should he be suspended at least one game, that guarantee will void. But it is extremely unlikely the Steelers would part ways with Metcalf before the 2026 season after sending Seattle a second-round pick for him in the spring for who is now their top receiver. He would still be eligible to earn every dollar of his salary next season and beyond regardless of its guaranteed status.The voided guarantees are more important in 2027 when $20 million in salary has been injury-protected. If Metcalf suffered a major injury in the 2026 season that kept him from passing a physical in March 2027, he would be guaranteed $20 million for that upcoming season. If the suspension holds, that guarantee goes away -- which would give the Steelers a potential financial out after two seasons should they wish or need to use it.\nWith this many millions at stake, it is no wonder Metcalf will appeal the ruling handed down Monday by the league. But the same league that issued the punishment will hear the appeal, unlike how players suspended for actions like unnecessary roughness have their appeals heard by officers who are jointly appointed by the NFL and NFL Players Association.Should this end Metcalf's season, the 28-year-old would have the least productive year of his career. His 59 receptions are the fewest since his 2019 rookie season, and his 850 yards would be his least in his seven seasons.\n        \n            \n                Steelers' DK Metcalf had prior history with Lions fan he had confrontation with, per report\n                \n                    Jordan Dajani                \n            \n                            \n    \n                \n                    \n    \nMeanwhile, the Steelers can clinch the AFC North this weekend before even playing Sunday against the Browns. If the Ravens lose to the Packers on Saturday, or if the Steelers beat the Browns on Sunday, Pittsburgh clinches the division and the fourth seed in the AFC playoffs.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DK Metcalf suspension voids $45 million in guarantees, could alter Steelers outlook - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/23/b43b8694-2a80-45e6-8d07-0f4c63ba27f8/thumbnail/1200x675/b6f1609e5b16b9c6eca22cdfaf037d22/dkmetcalfsteelers-1.jpg"
      ],
      "datePublished": "2025-12-23T01:48:15.000Z",
      "dateModified": "2025-12-23T01:48:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Harbaugh addresses job security as Ravens' playoff hopes dwindle - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/john-harbaugh-job-security-baltimore-ravens-nfl-playoffs/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/ab6e2302-ca26-45ab-814d-023bf703c040/thumbnail/1200x675/1ee6007dfe8dfd24d68b1fb96677b404/gettyimages-2253068893-1.jpg",
    "tag": "Sports",
    "date": "2025-12-22T23:33:01.000Z",
    "description": "\n        A surprisingly poor season has the Baltimore Ravens on the verge of missing the playoffs for the first time since 2021, and with those postse",
    "body": "\n        A surprisingly poor season has the Baltimore Ravens on the verge of missing the playoffs for the first time since 2021, and with those postseason hopes dwindling after the Week 16 loss to the New England Patriots, team leadership fell further under the microscope. John Harbaugh has been a model of consistency throughout his 18-year tenure in Baltimore but suddenly faces real questions about his job security.When asked whether he is concerned about his grip on the job, though, Harbaugh brushed off the threat of a firing.\"Coaching at any level is a day-to-day job,\" Harbaugh said on the heels of his eighth loss this season. \"Your job is to do the best job you can today and to do everything you can to help your players -- and your coaches if you're a head coach -- be the best they can be every single day. It's never been about keeping a job. There's no such thing as 'your' job or 'my' job. We have responsibilities. We're given opportunities to steward those responsibilities, and you're given a job to do that until you're not.\"The Ravens' only road to the postseason is to win the AFC North, but to do so would require them to win out and the Pittsburgh Steelers to lose out. Anything short of those results would force Lamar Jackson, Derrick Henry and the rest of the star-laden roster to watch the playoffs from home. That is a precarious situation that few would have expected the preseason Super Bowl contenders to find themselves in for the final two weeks of the campaign.\nA losing record also remains on the table for the 7-8 Ravens, who have finished under .500 just twice in Harbaugh's prolific run.\"I try to do the job, not try to keep the job,\" said the 63-year-old Harbaugh. \"There's no such thing as 'having' a job. It's just 'doing' a job. So my focus is on, and it has been for the last 18 years here and last 41 years in coaching, to try to do the best job I can today and fight as hard as I can so the guys have the best chance to be successful today.\"Anything after today, I'm not thinking about because it's not given for us to think about. We don't have control over that except for the job we do today. If we do a good enough job today, then the opportunity to do that job or do a different job will be there tomorrow. That's what you hope for.\"\nHarbaugh regularly has Baltimore in the mix with the best teams in the league but has not broken through for a Super Bowl victory in 13 years. To boast a two-time MVP in Lamar Jackson and a typically elite defense but to be in the midst of a championship drought only emphasizes the sting of this particularly underwhelming season.Who would replace John Harbaugh?Harbaugh set a high bar over 18 years as the winningest coach in Ravens history and the third-winningest coach in the NFL since his arrival. Finding a successor who can uphold that standard is no guarantee. But the Ravens would be an attractive destination for potential candidates if they were to make a move.Buffalo Bills offensive coordinator Joe Brady has long been regarded as a premier assistant coach, at both the college and NFL levels, and will likely hear his name swirl as a target for head coaching opportunities this offseason. He has experience with an MVP-caliber quarterback in Josh Allen and could make excellent use of Jackson and his supporting cast.\nIf the Ravens were inclined to stay within the Harbaugh tree, they could look toward Los Angeles Chargers defensive coordinator Jesse Minter. The former Baltimore defensive backs coach has experience working under both John Harbaugh and Jim Harbaugh, won a national championship at Michigan and built back-to-back top-10 defenses upon his return to the NFL.Former head coaches including Robert Saleh and Brian Flores could also emerge as priority candidates. Other star coordinators such as Klink Kubiak and Chris Shula could be in line for opportunities, too.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Harbaugh addresses job security as Ravens' playoff hopes dwindle - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/ab6e2302-ca26-45ab-814d-023bf703c040/thumbnail/1200x675/1ee6007dfe8dfd24d68b1fb96677b404/gettyimages-2253068893-1.jpg"
      ],
      "datePublished": "2025-12-22T23:33:01.000Z",
      "dateModified": "2025-12-22T23:33:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts vs. 49ers where to watch: Live stream, TV channel as Rivers returns on MNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-vs-49ers-where-to-watch-pick-odds-prediction-for-mnf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/2a54d926-522b-476e-9805-ac382c2c54dd/thumbnail/1200x675/58a947ba81adef4f8e3da4f32af7908a/brock-purdy-49ers.jpg",
    "tag": "Sports",
    "date": "2025-12-23T01:17:31.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Niners control their own destiny in the NFC, while the Colts need help in the AFC\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Dec 22, 2025\n                            \n                    at\n    8:17 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        In the final game of what has been a wild Week 16, the Indianapolis Colts host the San Francisco 49ers on \"Monday Night Football.\"The Colts come into this game starting 44-year-old Philip Rivers at quarterback after the season-ending Achilles injury to Daniel Jones. They have lost four consecutive games after starting the season 8-2, and they've fallen back to the fringes of the playoff race. They probably need to win out to have any hope of making it to the postseason, though they will technically still be alive even if they lose.The 49ers are coming off a win over the Titans following their bye week, their fourth consecutive win after a loss to the Rams had dropped them to 6-4 on the year. The playoff-bound Niners got another massive favor from the Seahawks on Thursday night, and they now control their own destiny in the race for the No. 1 seed in the NFC. \nWill the Niners get the first of the three straight wins they need, or will the Colts keep their playoff hopes off the life-support machine? We'll find out soon enough. Before we break down some key storylines, here's a look at how you can watch the game.Where to watch Colts vs. 49ersDate: Monday, Dec. 22 | Time: 8:15 p.m. ETLocation: Lucas Oil Stadium (Indianapolis)TV: ESPN | Stream: Fubo (Try for free) Follow: CBS Sports AppOdds: 49ers -5.5, O/U 46.5 via DraftKings Sportsbook\nLIVE updates: Follow along with all the action as the Colts battle the 49ers on \"Monday Night Football.\"\nKey Storylines49ers playoff picture. The 49ers clinched a playoff berth on Sunday thanks to the Lions' loss to the Steelers. They are currently in third place in the NFC West and sixth place in the NFC. However, they will win the NFC West and the No. 1 seed if they win all three of their remaining games. They control their own destiny here, as following this game against Indianapolis they have showdowns with the Bears in Week 17 and the Seahawks in Week 18. If they win all three games, they'll own the tiebreakers over each of the Bears, Seahawks and Rams, claiming the top spot in the conference no matter what else happens.Colts playoff picture. The Colts are currently in eighth place in the AFC and are technically still alive in the playoff hunt. If they win this game, their hopes will remain alive for at least another week. If they lose, they are officially out of the race for the AFC South title, but they would just barely still be alive for a wild-card spot. They'd need to win out and get a ton of help in order to make the playoffs, though. An Indianapolis loss would also clinch playoff berths for the Jaguars, Bills and Chargers leaving only one spot for the Colts and Texans.Philip Rivers, Game 2. Rivers survived his return game last week against the Seahawks largely by getting rid of the ball as quickly as humanly possible -- his average time to throw was just 2.41 seconds, which would be the fastest time in the league if he qualified for the leaderboard. Rivers went went 18 of 27 for 120 yards, one touchdown and one interception, and 16 of his 27 pass attempts were released with 2.5 seconds of the snap. On the throws that weren't let go quickly, Rivers went only 6 of 11 for 38 yards and a pick. CMC's 1000-1000 quest. Christian McCaffrey has 922 rushing yards and 820 receiving yards on the season. He needs just 78 rushing yards to hit 1,000, but 180 receiving yards to do it. That means he needs to average 60 receiving yards per game to get there. The Colts have allowed just 364 receiving yards to running backs this season, though, the eighth-fewest in the NFL heading into Week 16. McCaffrey already has a 1,000-1,000 season under his belt, but that came all the way back in 2019. If he does it again, he'll be the first player ever with two such seasons. Colts vs. 49ers pick, prediction\nCount me among those that did not actually think that Rivers' return to the field was at all impressive. He looked like a 44-year-old grandfather who can't really throw the ball. Seemingly everyone can throw on the 49ers, so maybe he gets going here, but I doubt it. On the other side of the ball, I think San Francisco can get something going against the Indianapolis defense. Even without Ricky Pearsall, there are just too many weapons for them to get shut down, especially if Sauce Gardner is not going to be out there. Pick: 49ers -5.5, Over 46.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts vs. 49ers where to watch: Live stream, TV channel as Rivers returns on MNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/2a54d926-522b-476e-9805-ac382c2c54dd/thumbnail/1200x675/58a947ba81adef4f8e3da4f32af7908a/brock-purdy-49ers.jpg"
      ],
      "datePublished": "2025-12-23T01:17:31.000Z",
      "dateModified": "2025-12-23T01:17:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football's Christmas Grinches of 2025: Lane Kiffin tops the list - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-christmas-grinches-2025-lane-kiffin-ole-miss-cfp-lsu/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/22/e2b9e55c-82d5-4dac-b4cc-5e0aaa3bfb76/thumbnail/1200x675/0ae2c0ebc9ec22db90438f9c78f36b27/grinch.png",
    "tag": "Sports",
    "date": "2025-12-23T14:07:20.000Z",
    "description": "\n        As a connoisseur of holiday favorites this time of year, why not incorporate a personal cartoon favorite into the college football stratosphe",
    "body": "\n        As a connoisseur of holiday favorites this time of year, why not incorporate a personal cartoon favorite into the college football stratosphere before the College Football Playoff and bowl season kicks into high gear? You see, the Grinch's backstory is a sad one, stemming from being teased as a child for his appearance, leading to a life of reclusiveness as someone who hated the joy associated with celebrations.There are a couple college football-level outcasts coming out of the 2025 season, too. They're not as ugly as their green counterpart, but provided ample reasons to be despised by fans, viewers and others associated with the sport.This one's meant to be somewhat satirical and light-hearted, but if it makes you feel some type of way it might be time to look in a mirror and get in a more festive spirit before the in-laws arrive!Lane Kiffin, newly-named LSU coach \"Deplorable rubbish\" is a memorable phrase from the 1966 \"You're a Mean One, Mr. Grinch\" theme song that describes the rotten soul of the green, big-bellied monster who lives on a mountain overlooking Whoville. That's also akin to how Ole Miss fans feel about Kiffin this Christmas following his departure to LSU. For weeks, Kiffin left the Rebels in the dark on his decision and waited until Thanksgiving weekend to deliver the news. \"Hot yoga\" became part of SEC vernacular and Ole Miss even had to pay Kiffin a hefty bonus following its first-round playoff win over Tulane. So, the Grinch got a raise, additional recruiting resources and another check to cash before assuming his throne inside Mount Crumpit.\nBy the way, Ole Miss athletic director Keith Carter's decision to tell Kiffin to kick rocks and book it to Baton Rouge rather than stick around for the Rebels' playoff run was the right call. Going in the other direction would've been like your girlfriend breaking up with you ahead of senior prom and still lending her hand before the dance as a pair -- you just don't do it.Pete Bevacqua, Notre Dame athletic director For the bowl season purists out there, Bevacqua's hissy fit following the Fighting Irish's exclusion from the College Football Playoff leading to an unexpected postseason opt-out was disappointing across the board. Notre Dame wasn't invited to the 12-team Christmas party, so its answer was to raise hell kicking and screaming. Where's the holiday cheer? Instead of a possible Notre Dame vs. BYU matchup in the Pop-Tarts Bowl, we were saddled with 72 hours of fallout on why the university's relationship with the ACC was in disarray and how the Fighting Irish deserved better. Notre Dame's elitist move was later magnified by news of its deal with the playoff for 2026 and beyond, guaranteeing entry into the field if it ranks inside the top 12. No wonder there are reports of teams potentially backing out of future scheduling with the Independent. No program in college football has a deal this sweet thanks to a memorandum of understanding.\nDiego Pavia, Vanderbilt quarterbackFrom beloved to extremely tiring in the blink of an eye, Pavia's schtick was fun until he was forced into an apology following the Heisman Trophy ceremony. The SEC Player of the Year re-posted an image from comedian Theo Von on Instagram showing himself with family and friends on the red carpet with the caption: \"F-ALL THE VOTERS, BUT ... FAMILY FOR LIFE\" with a thumbs down emoji, sparking outrage nationally. Rece Davis said he regretted voting for Pavia at the top of his Heisman ballot following his behavior and was relieved Indiana's Fernando Mendoza won. Clark Lea said the situation should be viewed through a lens of grace and folks need to understand that Pavia's actions are not a reflection of who he is as a person. Or, like the Grinch, perhaps his heart is three sizes too small and humility goes a long way. I'd argue this is an accurate depiction of college football's too-much, too-fast athlete in the NIL era. It's one thing to react quickly on social media, but there was also an inflammatory Indiana sign that Pavia carried around a club in NYC, clearly a planned charade. The dual-threat quarterback, who has taken the Commodores to new heights this season, will be playing in the ReliaQuest Bowl on Dec. 31 against Iowa for those interested.Bill O'Brien, Boston College coachThere's a reason the former New England Patriots offensive coordinator earned the nickname \"teapot\" from quarterbacks Tom Brady and Brian Hoyer during his time in the NFL. Asked earlier this season to direct a message to fans on how he was going to end Boston College's eight-game losing streak and fix program-wide issues, O'Brien flipped on a local reporter. The rant quickly went viral:\n\"You know, I'm glad you're down. I'm not down. Nobody's down,\" O'Brien said in a fiery manner. \"We're fighting, we're competing. It's the second year of this program, Mike. You always come in here with these down questions. You show up like once a month or something like that, and come in here with these down questions. I'm not down. I don't know what year you graduated from BC, but this is a program that we're building. Nobody here is down. We're positive, we're gonna show up and play our a** off against SMU. You can go out there in your dark clouded world or whatever it is, and do what you wanna do. We're not down. The sun is up, and we're fighting. That's my message to the fans.\"The Eagles would go on to lose that game to SMU, 45-13, and finished 2-10 on the year.Mack Rhoades, former CFP committee chairImagine being in the shoes of Hunter Yurachek, the Arkansas athletic director who was propped up in front of viewers every Tuesday night for a month straight in the middle of his own coaching search with the Razorbacks. Yurachek was placed in a no-win situation after Rhoades' unexpected leave of absence following the second CFP Rankings release. One week after stepping down as selection committee chair, Rhoades was fired at Baylor as the result of an internal investigation. Would Rhoades have been able to give us a more thorough explanation on why Notre Dame was ranked ahead of Miami for so long despite the head-to-head result before the rankings switched the final weekend when both teams were idle? That's hard to say, but bailing on what was unquestionably the poorest-led CFP committee in playoff history rests at his feet this season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football's Christmas Grinches of 2025: Lane Kiffin tops the list - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/22/e2b9e55c-82d5-4dac-b4cc-5e0aaa3bfb76/thumbnail/1200x675/0ae2c0ebc9ec22db90438f9c78f36b27/grinch.png"
      ],
      "datePublished": "2025-12-23T14:07:20.000Z",
      "dateModified": "2025-12-23T14:07:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]