[
  {
    "title": "Pelicans vs. Pacers prediction, odds, spread start time: 2026 NBA picks for Friday, Jan. 16 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/pelicans-pacers-odds-prediction-spread-time-2026-nba-picks-friday-january-16/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/93706445-8b2a-4682-aed2-8daedfd93de5/thumbnail/1200x675/7e4ad53b51250590b6ca40f53b69be23/pascal-siakam-indiana-pacers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-16T22:00:49.000Z",
    "description": "\n        The New Orleans Pelicans will look to sweep the two-game season series with the Indiana Pacers when they meet in NBA action on Friday night. ",
    "body": "\n        The New Orleans Pelicans will look to sweep the two-game season series with the Indiana Pacers when they meet in NBA action on Friday night. New  Orleans is coming off a 116-113 win over Brooklyn on Wednesday, while Indiana dropped a 115-101 decision to Toronto that same night. The Pelicans (10-33), who are fifth in the Southwest Division, are 3-15 on the road this season. The Pacers (9-32), who are fifth in the Central Division, are 7-16 on their home court. Herbert Jones (ankle) and Jose Alvarado (oblique) will miss the game for New Orleans, while Bennedict Mathurin (thumb) and Isaiah Jackson (concussion) are out for Indiana.Tioff from Gainbridge Fieldhouse in Indianapolis, is set for 7 p.m. ET. Indiana is a 4-point favorite in the latest Pelicans vs. Pacers odds from DraftKings Sportsbook, while the over/under for total points scored is 241.5. Before making any Pacers vs. Pelicans picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    Now, the model has simulated Pelicans vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Pacers vs. Pelicans:\nPelicans vs. Pacers                                                                         spread:    Indiana -4 at DraftKings    Pelicans vs. Pacers                                                                                       over/under:    241.5 pointsPelicans vs. Pacers                                                                                       money line:    Indiana -174, New Orleans +145Pelicans vs. Pacers                                                                                       picks:    See picks at SportsLinePelicans vs. Pacers                                                                                       streaming:Fubo (Try for free)   New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Pelicans vs. Pacers picksSportsLine's model is going Under on the total (241.5 points). The last New Orleans game went under the total, while Indiana has seen five straight games fail to hit the total. The model is projecting 239 combined points as the Under hits in 55% of simulations. It has also generated an against-the-spread pick that hits well over 60% of the time. You can head to SportsLine to see the model's NBA picks. \nSo who wins Pacers vs. Pelicans, and which side of the spread hits well over 60% of the time? Visit SportsLine now to see which side of the Pelicans vs. Pacers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pelicans vs. Pacers prediction, odds, spread start time: 2026 NBA picks for Friday, Jan. 16 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/93706445-8b2a-4682-aed2-8daedfd93de5/thumbnail/1200x675/7e4ad53b51250590b6ca40f53b69be23/pascal-siakam-indiana-pacers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-16T22:00:49.000Z",
      "dateModified": "2026-01-16T22:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cavaliers vs. 76ers prediction, odds, spread, time: 2026 NBA picks for Friday, Jan. 16 from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/cavaliers-76ers-odds-prediction-line-time-2026-nba-picks-friday-january-16f/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/4e6357ef-4fdd-493b-800a-2bf0a53374af/thumbnail/1200x675/74c217a8a6bfe63dce9dcc4dd1b5e89b/donovan-mitchell-cleveland-cavaliers-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-16T21:30:42.000Z",
    "description": "\n        An Eastern Conference matchup helps get the Friday NBA schedule underway as the Cleveland Cavaliers visit the Philadelphia 76ers for the seco",
    "body": "\n        An Eastern Conference matchup helps get the Friday NBA schedule underway as the Cleveland Cavaliers visit the Philadelphia 76ers for the second game between the teams in three days. Cleveland won 133-107 when these teams met in Philly on Wednesday. The Cavs are 23-19 on the season, while the Sixers are 22-17. Philadelphia, however, has performed much better than market expectations as it is 23-15 against the spread, while Cleveland is just 14-28 ATS. Darius Garland (toe) has been ruled out for Cleveland. Tipoff is at 7 p.m. ET from Xfinity Mobile Arena in Philadelphia. Philadelphia is a 2.5-point favorite in the latest Cavaliers vs. 76ers odds per DraftKings Sportsbook, while the over/under is 233.5 points. Before making any 76ers vs. Cavaliers picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can also target the latest Underdog promo code, good for $75 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.\nNow, the model has simulated 76ers vs. Cavaliers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Cavs vs. Sixers 76ers vs. Cavaliers spread:    76ers -2.5 at DraftKings Sportsbook76ers vs. Cavaliers over/under:    233.5 points76ers vs. Cavaliers money line:    76ers -149, Cavs +12576ers vs. Cavaliers picks:    See picks at SportsLine76ers vs. Cavaliers streaming:Fubo (Try for free)  New users can check out the latest FanDuel promo code to get $300 in bonus bets if your initial $5 wager wins:How to make Cavs vs. 76ers picksAfter 10,000 simulations of 76ers vs. Cavs, SportsLine's model is going Over on the total (233.5 points). The game on Wednesday went Over the total -- which was 236.5 -- as the teams combined for 240 points. That was third time in the past four games for Cleveland that the Over cleared, while three of the past five Philadelphia games have gone Over. The model is projecting 238 combined points on Friday as the Over hits 57% of the time. The model also says one side of the spread hits almost 70% of the time. You can head to SportsLine to see the model's NBA picks. So who wins Cavaliers vs. Sixers, and which side of the spread hits almost 70% of the time? Visit SportsLine now to see which side of the Sixers vs. Cavaliers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cavaliers vs. 76ers prediction, odds, spread, time: 2026 NBA picks for Friday, Jan. 16 from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/4e6357ef-4fdd-493b-800a-2bf0a53374af/thumbnail/1200x675/74c217a8a6bfe63dce9dcc4dd1b5e89b/donovan-mitchell-cleveland-cavaliers-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-16T21:30:42.000Z",
      "dateModified": "2026-01-16T21:30:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tennessee vs. Kentucky prediction, odds, spread: 2026 college basketball picks for Saturday, Jan. 17 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/kentucky-tennessee-odds-spread-time-2026-college-basketball-picks-saturday-january-17/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/568da6d3-3abd-4889-9282-f48026780d22/thumbnail/1200x675/94b876427b2e9a4af40bd5d964443ea0/jakobi-gillespie-tennessee-volunteers-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-17T01:08:08.000Z",
    "description": "\n        SEC powers meet on Saturday as the No. 24 Tennessee Volunteers host the Kentucky Wildcats. Both teams had dramatic mid-week victories and are",
    "body": "\n        SEC powers meet on Saturday as the No. 24 Tennessee Volunteers host the Kentucky Wildcats. Both teams had dramatic mid-week victories and are looking to turn the corner as SEC heats up after starting 2-2. Tennessee is 12-5 overall, while Kentucky is 11-6 on the season. The Wildcats swept the regular-season series last year, but the Vols avenged those losses with a 78-65 win in the 2025 Sweet 16. Tipoff is at noon ET from Thompson-Boling Arena at Food City Center in Knoxville, Tenn. The Vols are 5.5-point favorites in the latest Tennessee vs. Kentucky odds, while the over/under is 147.5. Before making any Kentucky vs. Tennessee picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 11 on a sizzling 9-1 run on its top-rated over/under college basketball picks dating back to last season. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns. \nNow, the model has simulated Tennessee vs. Kentucky 10,000 times and just revealed its men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Kentucky vs. Tennessee:Tennessee vs. Kentucky spread:    Tennessee -5.5Tennessee vs. Kentucky over/under:    147.5 pointsTennessee vs. Kentucky money line:    Tennessee -267, Kentucky +215Tennessee vs. Kentucky picks:    See picks at SportsLineTennessee vs. Kentucky streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Tennessee vs. Kentucky picksAfter simulating Tennessee vs. Kentucky 10,000 times, SportsLine's model is going Over on the total (147.5 points). Five straight Tennessee games have cleared the total, and Tennessee is 11-6 to the Over on the season. Three of the past five Tennessee vs. Kentucky matchups have led to at least 148 combined points as well. SportsLine's model is projecting that four players score in double figures with Ja'Kobi Gillespie (19.2 points) leading the way for Tennessee and Otega Oweh (17.2 points) pacing Kentucky. The teams combine for 154 total points as the Over hits 74% of the time. The model also says one side of the spread hits nearly 60% of the time. You can only see that pick at SportsLine.So who wins Kentucky vs. Tennessee, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has simulated this matchup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tennessee vs. Kentucky prediction, odds, spread: 2026 college basketball picks for Saturday, Jan. 17 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/568da6d3-3abd-4889-9282-f48026780d22/thumbnail/1200x675/94b876427b2e9a4af40bd5d964443ea0/jakobi-gillespie-tennessee-volunteers-imagn-images.jpg"
      ],
      "datePublished": "2026-01-17T01:08:08.000Z",
      "dateModified": "2026-01-17T01:08:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Friday parlay returns over +500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-predictions-parlay-best-bets-friday-january-16-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/03/09/f0344a47-95b7-4f8b-8adf-98bbca140a05/thumbnail/1200x675/8dbe3ceea24363037c708f48d225c7b1/demar-derozan-kings-usatsi.jpg",
    "tag": "Sports",
    "date": "2026-01-16T21:15:35.000Z",
    "description": "\n        Six games highlight Friday's NBA schedule. Among the notable NBA odds are Cavaliers vs. 76ers (-2.5), Bulls vs. Nets (-1.5), Clippers vs. Rap",
    "body": "\n        Six games highlight Friday's NBA schedule. Among the notable NBA odds are Cavaliers vs. 76ers (-2.5), Bulls vs. Nets (-1.5), Clippers vs. Raptors (-2.5) and Timberwolves vs. Rockets (-4.5). The Los Angeles Clippers will look to extend their winning streak to five games, while Brooklyn looks to snap a five-game losing skid.        What are the NBA best bets for Friday, and which combination of picks should you target in a Friday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +500. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Friday, Jan. 16After simulating every game 10,000 times, the model is backing the Sacramento Kings (-7.5) to cover the spread against the Washington Wizards at 10 p.m. ET. The Kings have won three in a row, while the Wizards have dropped four in a row. Washington will also be down a number of players due to injury, including Khris Middleton (knee), Bilal Coulibaly (back) and Trae Young (quad). Keegan Murray (ankle) will be out for Sacramento.\nThe Kings have won five of the past eight meetings with Washington. Guards Zach LaVine and DeMar DeRozan help power the Sacramento offense. Levine is averaging 20 points, 3.1 rebounds and 2.2 assists in 32.9 minutes, while DeRozan averages 19.1 points, 3.9 assists and 3.4 rebounds in 33.5 minutes.The model is projecting six Wizards players to score 12.6 points or more, led by Alex Sarr's 20.1 points. The Kings meanwhile, are projected to be led by DeMar DeRozan's 20.5 points as seven Sacramento players score 10.3 points or more. The model is backing the Kings to cover nearly 70% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Friday, Jan. 16The model also has locked in two more picks, including another bet that hits 70% of the time. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Friday, and which best bets should you target for a chance at a payout of over +500? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Friday parlay returns over +500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/03/09/f0344a47-95b7-4f8b-8adf-98bbca140a05/thumbnail/1200x675/8dbe3ceea24363037c708f48d225c7b1/demar-derozan-kings-usatsi.jpg"
      ],
      "datePublished": "2026-01-16T21:15:35.000Z",
      "dateModified": "2026-01-16T21:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Seahawks prediction, odds, spread: 2026 NFL divisional round picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-49ers-prediction-odds-spread-time-2026-nfl-divisional-round-saturday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/44a4de62-8bc9-422a-9bc8-d56712fe8df8/thumbnail/1200x675/1e76ab2cd9124203d695541e684d56fe/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-17T01:30:39.000Z",
    "description": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in the 2026 ",
    "body": "\nDivision rivals square off with a spot in the NFC Championship Game on the line when the San Francisco 49ers battle the Seattle Seahawks in the 2026 NFL divisional round on Saturday. San Francisco (12-5) advanced with a 23-19 wild-card win at Philadelphia, while Seattle (14-3) is coming off a bye after earning the NFC's top seed. These teams split their two head-to-head matchups in the regular season. Seattle quarterback Sam Darnold (oblique) is listed as questionable, but told reporters that he expects to play. Niners receiver Ricky Pearsall (knee) is questionable. Kickoff from Lumen Field in Seattle is set for 8 p.m. ET. The Seahawks are 7-point favorites in the latest 49ers vs. Seahawks odds, while the over/under for total points scored is 45.5 via DraftKings Sportsbook. Before making any Seahawks vs. 49ers picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.    Now, the model has set its sights on 49ers vs. Seahawks. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Seahawks vs. Niners:\n49ers vs. Seahawks                                                                                     spreadSeattle -7 at DraftKings Sportsbook49ers vs. Seahawks                                 over/under45.5 points49ers vs. Seahawks                                                                                                                                                                                                 money line Seattle -340, San Francisco +27049ers vs. Seahawks                                                                                                                                                                                         picksSee picks at SportsLine49ers vs. Seahawks                                                                                                                                                                                           streaming Fubo (Try for free)  Why the Seahawks can coverEighth-year veteran Sam Darnold helps power the Seattle offense. In 17 games, he has completed 67.7% of his passes for 4,048 yards and 25 touchdowns with 14 interceptions and a 99.1 rating. In a 13-3 win over the 49ers on Jan. 3, he completed 20 of 26 passes for 198 yards. In a 38-37 come-from-behind overtime win over the Los Angeles Rams on Dec. 18, he completed 22 of 34 passes for 270 yards and two touchdowns with two interceptions.His top target is third-year veteran wide receiver Jaxon Smith-Njigba. In 17 games, he caught 119 passes for 1,793 yards (15.1 average) and 10 touchdowns. He had 27 explosive plays of 20 yards or more, including a long of 63, with 528 yards after the catch and 79 first-down conversions. In two games against San   Francisco this season, he caught 15 passes for 208 yards. See which team to back at SportsLine. Why the 49ers can coverFourth-year veteran quarterback Brock Purdy is coming off a solid performance in the Wild Card win over Philadelphia. He completed 18 of 31 passes for 262 yards and two touchdowns with two interceptions. In nine regular-season games this year, he completed 69.4% of his passes for 2,167 yards and 20 touchdowns with 10 interceptions and a 100.5 rating. He also carried 33 times for 147 yards (4.5 average) and three scores.Veteran Christian McCaffrey was San Francisco's leading rusher and receiver during the regular season. In 17 games, he carried 311 times for 1,202 yards and 10 touchdowns. He also had 102 receptions for 924 yards (9.1 average) and seven touchdowns with seven explosive plays, including a long of 39, with 720 yards after the catch and 49 first-down conversions. In the Wild Card win at Philadelphia, he carried 15 times for 48 yards (3.2 average) and had six receptions for 66 yards and two touchdowns. See which team to back at SportsLine.How to make 49ers vs. Seahawks picksSportsLine's model is going Over on the total, projecting 49 combined points. It also says one side of the spread is the better value. You can only get the pick at SportsLine. So who wins Seahawks vs. 49ers, and which side of the spread is the better value? Visit SportsLine now to see which side of the 49ers vs. Seahawks spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Seahawks prediction, odds, spread: 2026 NFL divisional round picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/44a4de62-8bc9-422a-9bc8-d56712fe8df8/thumbnail/1200x675/1e76ab2cd9124203d695541e684d56fe/jaxon-smith-njigba-seattle-seahawks-imagn-images.jpg"
      ],
      "datePublished": "2026-01-17T01:30:39.000Z",
      "dateModified": "2026-01-17T01:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UConn vs. Georgetown prediction, odds, spread time: 2026 college basketball picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/uconn-georgetown-odds-prediction-time-2026-college-basketball-picks-saturday-january-17/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/ad709862-2d76-492c-8908-516e86cb3821/thumbnail/1200x675/5af1f35694645aa2ded185a03ba57807/alex-karaban-uconn-huskies.jpg",
    "tag": "Sports",
    "date": "2026-01-17T00:42:25.000Z",
    "description": "\n        The third-ranked UConn Huskies will look to stay perfect in Big East play when they take on the Georgetown Hoyas in a key matchup on Saturday",
    "body": "\n        The third-ranked UConn Huskies will look to stay perfect in Big East play when they take on the Georgetown Hoyas in a key matchup on Saturday afternoon. Connecticut is coming off a 69-64 win at Seton Hall on Tuesday, while Georgetown dropped an 86-83 decision at Creighton that same night. The Huskies (17-1, 7-0 Big East), who have won 13 in a row, are 5-0 on the road this season. The Hoyas (9-8, 1-5 Big East), who are tied for eighth in the Big East, are 7-3 on their home floor.Tipoff from Capital One Arena in Washington, D.C., is set for noon ET. UConn leads the all-time series 40-36, including wins in each of the last 10 games. UConn is a 12.5-point favorite in the latest UConn vs. Georgetown odds from DraftKings Sportsbook, while the over/under for total points scored is 141.5. Before making any Georgetown vs. UConn picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 11 on a sizzling 9-1 run on its top-rated over/under college basketball picks dating back to last season. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns. \nNow, the model has simulated UConn vs. Georgetown 10,000 times and just revealed its coveted men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Georgetown vs. UConn:UConn vs. Georgetown                                                                                                spread:    UConn -12.5 at DraftKings SportsbookUConn vs. Georgetown                                                                               over/under:    141.5 pointsUConn vs. Georgetown                                                                                                            money line:    UConn –885, Georgetown +590    UConn vs. Georgetown                                                                                                             picks:    See picks at SportsLineUConn vs. Georgetown                                                                                                             streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make UConn vs. Georgetown picksSportsLine's model is going Over on the total (141.5 points). The Over has hit in seven of the last 10 meetings between the teams. The Over has hit in three of UConn's last five games, and in seven of Georgetown's last 10 games. The model projects the Huskies to have five players register 12.4 points or more, including Alex Karaban's projected 17.3 points. The Hoyas, meanwhile, are projected to have three players score 10 or more points, led by Malik Mack, who is projected to score 15 points. The model projects a combined total of 149 points as the Over clears in nearly 70% of simulations.The model also says one side of the spread hits well over 50% of the time. You can only see that pick at SportsLine.So who wins UConn vs. Georgetown, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the UConn vs. Georgetown spread to back, all from the advanced model that has simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UConn vs. Georgetown prediction, odds, spread time: 2026 college basketball picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/ad709862-2d76-492c-8908-516e86cb3821/thumbnail/1200x675/5af1f35694645aa2ded185a03ba57807/alex-karaban-uconn-huskies.jpg"
      ],
      "datePublished": "2026-01-17T00:42:25.000Z",
      "dateModified": "2026-01-17T00:42:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills vs. Broncos prediction, odds, spread, time: 2026 divisional round NFL picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-broncos-prediction-odds-spread-time-nfl-divisional-round-saturday-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/b587800e-eb4a-4c04-a9a1-4dd42aca7cee/thumbnail/1200x675/c2abaf99b9a3b333c7d8d90cfefc6fbf/josh-allen-buffalo-bills-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-17T01:12:32.000Z",
    "description": "\nThe divisional round of the 2026 NFL playoffs kicks off with the Denver Broncos hosting the Buffalo Bills on Saturday. The Broncos (14-3) tied for th",
    "body": "\nThe divisional round of the 2026 NFL playoffs kicks off with the Denver Broncos hosting the Buffalo Bills on Saturday. The Broncos (14-3) tied for the league's best record, won back-to-back games to close the regular season and earned a bye as the AFC's No. 1 seed. The Bills (12-5) have won six of their last seven contests, including a 27-24 road victory over Jacksonville in Sunday's Wild Card matchup. Buffalo safety Jordan Poyer (hamstring) has been ruled out.Kickoff is at 4:30 p.m. ET from Empower Field at Mile High in Denver. The latest Broncos vs. Bills odds from DraftKings Sportsbook list Denver as a 1.5-point favorite, after Buffalo opened as 1.5-point favorites. The over/under for total points is 45.5. Denver running back RJ Harvey is the most likely anytime touchdown scorer at -130, with Josh Allen at -120 and James Cook at -105. Before making any Bills vs. Broncos picks, check out the NFL predictions from the SportsLine Projection Model. Watch the game on CBS or stream on Paramount+. Sign up right here.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the divisional round of the 2026 NFL playoffs on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Broncos vs. Bills. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends Bills vs. Broncos:\nBroncos vs. Bills                                                                    spreadDenver -1.5 (-108) at DraftKings SportsbookBroncos vs. Bills                over/under45.5 pointsBroncos vs. Bills                                                                                                                                                                                money line Denver -120, Buffalo +100Broncos vs. Bills                                                                                                                                                                       picksSee picks at SportsLineBroncos vs. Bills                                                                                                                                                                          streaming Paramount+Why the Bills can coverIt was just a year ago that the Bills trounced the Broncos, 31-7, in the playoffs, but Buffalo's dominance over Denver goes back beyond that. The Bills are 8-1 against the spread versus the Broncos over their last nine meetings, with three of those games taking place in Denver. Buffalo just defeated an elite defense in Jacksonville, which had the No. 1 run defense and forced the second-most turnovers. Thus, the Bills should find an easier time on the ground come Saturday, and Denver has the least opportunistic defense in the postseason. No 2026 playoff team forced fewer turnovers than the Broncos' 14, which is fewer than one per game. The Bills are undefeated (8-0) when they don't give away the ball and boast an 11-1 record with one or fewer turnovers. See which team to back at SportsLine. Why the Broncos can coverThis will be Buffalo's eight divisional road game since the 1970 merger, and the Bills have covered just once over that span. One also can't discount Denver coming off a bye, as the Broncos are 3-1-1 ATS over their last five with a rest advantage, while the Bills are 1-4 ATS this season when having less rest than their opponents. Denver possesses a ferocious pass rush as its 68 sacks are the fifth-most in NFL history, and the Bills have struggled when Josh Allen is under attack. The Broncos average 4.0 sacks per game, and Buffalo has lost six straight games, including being 0-3 this season, when Allen is sacked at least four times. Additionally, Sean Payton and company can exploit Buffalo's porous run defense as just four teams allowed more yards on the ground than Buffalo this season. See which team to back at SportsLine.How to make Bills vs. Broncos   picksSportsLine's model has simulated Broncos vs. Bills 10,000 times and is going Over on the total, projecting 47 combined points. It also says one side of the spread hits in more than 50% of simulations. You can only get the pick at SportsLine. So who wins Bills vs. Broncos, and which side of the spread hits more than 50% of the time? Visit SportsLine now to see which side of the Broncos vs. Bills spread to jump on, all from the advanced model that is up well over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills vs. Broncos prediction, odds, spread, time: 2026 divisional round NFL picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/b587800e-eb4a-4c04-a9a1-4dd42aca7cee/thumbnail/1200x675/c2abaf99b9a3b333c7d8d90cfefc6fbf/josh-allen-buffalo-bills-imagn-images.jpg"
      ],
      "datePublished": "2026-01-17T01:12:32.000Z",
      "dateModified": "2026-01-17T01:12:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indiana vs. Miami prediction, odds, date: 2026 CFP national championship game picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/indiana-miami-prediction-odds-date-start-time-2026-college-football-playoff-national-championship-game-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/309fb213-4a09-49ce-b057-0361d1e057b8/thumbnail/1200x675/c0696312ce7b0b0c16a2e5d29f5bf73c/mark-fletcher-miami-hurricanes-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-16T21:03:18.000Z",
    "description": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes i",
    "body": "\n        The top-ranked Indiana Hoosiers look to become the second team to ever finish 16-0 when they battle the 10th-ranked Miami (Fla.) Hurricanes in the 2026 College Football Playoff National Championship Game on Monday, Jan. 19. Miami is coming off a 31-27 win over No. 6 Ole Miss, while Indiana dominated fifth-ranked Oregon 56-22 in the national semifinals. The Hurricanes (13-2, 6-2 ACC), who have won seven in a row, are looking to win their sixth national championship and first since 2001. The Hoosiers (15-0, 9-0 Big Ten), who have won three conference championships in over 125 years, are seeking their first-ever national title. Kickoff is at 7:30 p.m. ET from Hard Rock Stadium in Miami Gardens, Fla., which is the Hurricanes' home venue. The Hoosiers are 8.5-point favorites in the latest Miami vs. Indiana odds, while the over/under for total points scored is 47.5 via DraftKings Sportsbook. Before making any Miami vs. Indiana picks, check out the college football predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The model simulates every FBS game 10,000 times, and it is 31-19 on its top-rated college football money-line picks since the beginning of the 2024 season. \nNow, the model has set its sights on Miami vs. Indiana. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Indiana vs. Miami:Miami vs. Indiana                                                                                                                                                                                         spreadIndiana -8.5 at DraftKings SportsbookMiami vs. Indiana                                                                                                                                                                                     over/under47.5 pointsMiami vs. Indiana                                                                                                                                                                                                                                                                                                     money line Indiana -340, Miami +270Miami vs. Indiana                                                                                                                                                                                                                                                                                             picksSee picks at SportsLineMiami vs. Indiana                                                                                                                                                                                                                                                                                               streaming Fubo (Try for free)  New users can also check out the latest FanDuel promo code and get $300 in bonus bets at FanDuel if your $5 bet wins. Why Indiana can coverJunior quarterback and Heisman Trophy winner Fernando Mendoza helps power the Hoosiers' offense. In 15 games, he has completed 73% of his passes for 3,349 yards and 41 touchdowns with just six interceptions. He also has rushed 83 times for 284 yards and six scores. In the national semifinal win over the Oregon Ducks, he completed 17 of 20 passes for 177 yards and five touchdowns. He also carried six times for 28 yards.Senior running back Roman Hemby leads the rushing attack. In 15 games, he has carried 211 times for 1,060 yards (5.0 average) and seven touchdowns. He also has 15 receptions for 160 yards, including a long of 26. In a 56-3 win at Purdue on Nov. 28, he rushed 12 times for 152 yards and a score. He had 18 carries for 89 yards and a score in a 38-3 win over No. 9 Alabama in the College Football Playoff quarterfinals. See which team to back at SportsLine.\nWhy Miami can cover Senior quarterback Carson Beck helps guide the Hurricanes. In 15 games, he has completed 73.3% of his passes for 3,581 yards and 29 touchdowns with 11 interceptions. He has also rushed for a pair of touchdowns. In the national semifinal win over Ole Miss, he completed 23 of 37 passes for 268 yards and two touchdowns with one interception.The Miami ground attack is led by junior running back Mark Fletcher Jr. In 13 games this season, he has carried 199 times for 1,080 yards (5.4 average) and 10 touchdowns. He also has caught 16 passes for 132 yards (8.3 average) and two touchdowns. In the win over Ole Miss, he rushed 22 times for 133 yards, including a long of 19. See which team to back at SportsLine.How to make Indiana vs. Miami picksSportsLine's model is going Over on the total, projecting 48 combined points. It also says one side of the spread hits in well over 50% of simulations. You can see the model's pick at SportsLine.So who wins Indiana vs. Miami, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the Miami vs. Indiana spread to jump on, all from the advanced model that's simulated this game 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indiana vs. Miami prediction, odds, date: 2026 CFP national championship game picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/309fb213-4a09-49ce-b057-0361d1e057b8/thumbnail/1200x675/c0696312ce7b0b0c16a2e5d29f5bf73c/mark-fletcher-miami-hurricanes-imagn-images.jpg"
      ],
      "datePublished": "2026-01-16T21:03:18.000Z",
      "dateModified": "2026-01-16T21:03:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chelsea Green discusses how she went from WWE's 'big loser' to winning titles - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/chelsea-green-wwe-united-states-championship/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/15/2d437895-42e4-4502-b2c4-10420b1adac9/thumbnail/1200x675/4c3aa706bb23bb73a33c3fb5b000f974/chelsea-green-wwe-smackdown-giliua-pro-wrestling-cbs-sports-jan-16-2026.jpg",
    "tag": "Sports",
    "date": "2026-01-16T20:29:43.000Z",
    "description": "\n        Chelsea Green isn't supposed to be a winner. She flunked out of WWE the first time, and her grand return lasted mere seconds. Yet Green succe",
    "body": "\n        Chelsea Green isn't supposed to be a winner. She flunked out of WWE the first time, and her grand return lasted mere seconds. Yet Green succeeded anyway, becoming a multi-time champion in the promotion. Her secrets? Checking her ego and maximizing minutes.  Green's first WWE stint was a series of blink-and-you'll-miss-it moments: playing Daniel Bryan's physical therapist, finishing fourth on \"Tough Enough,\" and stints on NXT and SmackDown, both of which were interrupted by broken wrists.Green spent the next two years gaining experience on the independent  scene. When WWE eventually came calling again, she was convinced the  second go would be different. Instead, Green, who stars on Season 2 of Netflix's \"WWE Unreal\" reality show, got a harsh reality check.\"When you get released, the No. 1 goal is to get back to WWE...\" Green told CBS Sports ahead of the reality show's Jan. 20 premiere. \"I think every person would say that they think they'll come in and go straight to the top. They're going to win the Royal Rumble and have a glorious comeback. All the things they didn't have in their first run. \n\"I quickly realized when I got to the Royal Rumble that I was going to be in and out. Nobody really gave two shits about me. It's not what I dreamt of. It's not what I had envisioned.\"Undeterred, Green went to work, finding small windows to make herself seen and making the most of every opportunity.  \"I had to pivot my mindset and the direction I was going. 'OK, so I'm not going straight to the top. They don't think I'm up here.' Now we have to work extra hard to show them in double time why I deserve to be up there.\"\nGreen made the most of a bad situation. She found a silver lining in being eliminated from her first Royal Rumble in 14 seconds, making sure WWE's social and digital teams were waiting so she could deliver her best on-camera freakout. Within a week, she was collaborating with creative while continuing to film content with the social team, turning herself into an asset in real time. \"I did everything within my power to control my narrative,\" Green explained. \"You really can't in WWE, but I think, for the most part, for the past three years, I've controlled my narrative as much as I could. At the end of the day in wrestling, there will always be forks in the road. There will always be speed bumps. There will be deadends. Once you get to your destination, you realize those twists and turns are what make your story unique.\"Green is a throwback superstar, a nod to the trashy Attitude Era and dolled-up WWE Divas that followed. There's a magnetism to her over-the-top performances. She isn't afraid to make a fool of herself or end up headfirst in a dumpster if it leaves an impression.    \nGreen was tossed in a dumpster in an incredible moment. \n                                                                    WWE\n                                                            \"That's  what I knew coming back. I wanted to make sure I was undeniable,\" Green said. \"I'm  not saying I'm the best wrestler, but I'm saying I'll make sure  when  you give me something, I'll always do my best to make people talk  about  it. That's the point. If you can't do that, there won't be a spot  for  you.\"In a few years, Green went from a 14-second Rumble elimination to becoming a multi-time champion. She's the inaugural women's United States champion and the first two-time champion, feats she accomplished while maintaining her goofy persona. It's an underdog story told through a character who regularly cheats.\"For me, it's what makes me relatable. It's what people talk to me about,\" Green said. \"I wasn't a chosen one. I haven't gone straight to the top. You've seen me struggle over and over again. You've seen other people get things that I thought I deserved. \n\"That's special now that I'm here. I'm a former tag team champion, a former two-time United States champion, and a mixed tag team champion. I've won four to five titles in three years. That's pretty amazing, all things considered, for a big loser like myself.\"Green stole hearts with her bubbly nature and vulnerability during the first season of \"WWE Unreal.\" Her joy after winning the women's United  States title and heartbreak over not being booked in front of her family  at \"Survivor Series: WarGames\" exposed the relatable performer behind the vile, tacky character.\"My willingness to share and be  open is something that a lot of my co-workers love to speak about,\"  Green said. \"I assume that's also what the fans think. At the end of the  day, it's just a camera following me. I try not to think too much about  it because I never want to self-produce. \n\"I don't want to watch  myself in season one or two, or listen to what people are saying, and  change how I am. I don't even want to pander. All that stuff matters in  unscripted television. You need to be so authentic, or else it shows. It  really shows.\"Check out the full interview with Chelsea Green below. \nSome superstars guard their on-camera personas fiercely, protecting them from outside input. That's a personal preference. Far worse are those who sabotage others for their own success. Green is the antithesis of both. \"Some  people can't do that. Some people think that to get to the top, you  have to step on people,\" Green said. \"I was having a conversation with  Bianca Belair yesterday. We were talking about how you don't need to  step on people to get to the top. In fact, the people at the top should  be reaching down, holding your hand, pulling you up, and elevating you. \n\"That's  the whole point of being a top girl. You didn't get there because you  stepped on all of the little people. We got you to the top. We were all  pulling you up one by one and elevating you.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chelsea Green discusses how she went from WWE's 'big loser' to winning titles - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/15/2d437895-42e4-4502-b2c4-10420b1adac9/thumbnail/1200x675/4c3aa706bb23bb73a33c3fb5b000f974/chelsea-green-wwe-smackdown-giliua-pro-wrestling-cbs-sports-jan-16-2026.jpg"
      ],
      "datePublished": "2026-01-16T20:29:43.000Z",
      "dateModified": "2026-01-16T20:29:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Sony Open leaderboard: Nick Taylor tied on top in Hawai'i after 36 holes - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/sony-open-leaderboard-2026-leaderboard-round-2-nick-taylor/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/2f92be61-598e-4ae7-9a4a-f4952b3642b6/thumbnail/1200x675/26e6b474746a20a231e148a04f72ae87/nick-taylor-hawaii-pga.jpg",
    "tag": "Sports",
    "date": "2026-01-17T04:49:02.000Z",
    "description": "\n        A windy day in Honolulu saw Waialae Country Club show some teeth in Friday's second round of the Sony Open, with tougher scoring conditions c",
    "body": "\n        A windy day in Honolulu saw Waialae Country Club show some teeth in Friday's second round of the Sony Open, with tougher scoring conditions condensing the top of the leaderboard and sending some big names home early. After yielding a pair of 62s on Thursday, the best anyone could do on Friday was a 64, with Davis Riley firing a 6-under second round to surge into a share of the lead and Ryan Gerard matched him for low round of the day to climb into the top 10. Riley credited a hot putter and an improved ball-striking day for moving him into a tie on top of the leaderboard, even with a penalty stroke in his round. \"Today I putted really well, but I definitely hit the ball a little bit better today,\" Riley said. \"It maybe wasn't even better, I just didn't have as many crazy shots as yesterday. I had a penalty stroke off the tee yesterday, which really cost me and felt like I lost a lot of momentum there. Overall the ball striking was a little cleaner and continued some of that good putting.\" On the other end of the spectrum was Collin Morikawa, as the No. 17 player in the Official World Golf Rankings could only manage a 68 on Friday to finish at even par for the week, one shot short of the cut line. As so often happens with Morikawa, it was the putter that let him down. Morikawa missed a few short putts on his back nine, including a 6-footer for birdie on No. 18 to make the cut. \nA missed cut in the season opener that doesn't feature many of the game's elite is an extremely difficult way for Morikawa to begin what he hopes is a bounce-back season after a tough second half of 2025. He still appears to be searching for the form that made him a two-time major champion and won't get the kind of confidence boost expected from a Sony Open start. Morikawa wasn't alone in struggling with the wind on Friday, and will find some company from a few other notable names who will also be looking for an early flight home -- most notably Keegan Bradley, who also finished his week at even par. Jordan Spieth did make the cut, as he aims for a rebound season himself, and he highlighted the challenge of the conditions on Friday after his round, a second consecutive 68 that moves him comfortably into the weekend at 4 under. \n\"I hit a 7-iron into that 15th hole. I had maybe 158 hole and I think it went 120 yards and I played it like 175,\" Spieth explained. \"So it was just very challenging at times. And on the greens it just becomes really hard to make putts when it's that windy.\"Thanks to those conditions, things bunched up considerably and when the third round gets underway, plenty of players will believe they're still in contention to win the opening event of the 2026 PGA Tour season. LeadersT1. Nick Taylor, Davis Riley, S.H. Kim, Adrien Dumont de Chassart, Kevin Roy (-9)\nWhile Taylor and Roy couldn't replicate their 62s from Thursday, the first round co-leaders remain in a share of the lead heading into the weekend -- with Taylor aiming to go back-to-back in Honolulu. Riley's low round of the day vaults him into first as well, with Kim (68), Parry (67) and Dumont de Chassart (67) climbing to the top of the leaderboard as well. Those five players will tee it up late in the afternoon for Saturday's third round, and they'll hope that it's similar to Friday when the winds got going in the morning and made it tough on the early wave. Taylor is the favorite of this group to maintain his spot given his ranking and history of success at Waialae.ContendersT5. Maverick McNealy, Chris Gotterup, John Parry, Takumi Kanaya (-8)T10. Ryan Gerard, Vince Whaley, Patrick Rodgers (-7)T13. Ben Griffin, Jake Knapp and six others (-6)\nThere are some extremely notable names in the chase pack entering the weekend, and given we know there are low scores that can be produced at Waialae when the conditions present themselves, everyone in this group -- and even some behind -- will feel like they're very much in the hunt for a win. McNealy, Gotterup and Griffin pick up where they left off in 2025, as all three enjoyed career years on Tour and are off to a quality start to their 2026 campaign. Griffin stumbled on Friday to a 71, falling a bit off the pace after a hot first round, but he'll be a serious threat on the weekend right alongside McNealy and Gotterup. Ryan Gerard is a popular pick as a breakout star for the 2026 season, as he also closed 2025 strong, and he's making those projections look smart with his start in Hawaii. \nNotable players who missed the cutCollin Morikawa (E)Keegan Bradley (E)Luke Clanton (+1)Chris Kirk (+1)Cam Davis (+3)Gary Woodland (+3)Tony Finau (+6)2026 Sony Open updated picks, oddsOdds via FanDuel SportsbookNick Taylor (11/2)Maverick McNealy (17/2)Chris Gotterup (11-1)Takumi Kanaya (13-1)Adrien Dumont de Chassart (13-1)S.H. Kim (13-1)Kevin Roy (14-1)John Parry (16-1)Davis Riley (16-1)Ben Griffin (17-1)Ryan Gerard (17-1)The odds sheet going into the weekend has gotten extremely tight and that does present some opportunity to identify some value. Griffin, just three shots off the pace, at 17-1 seems to provide some value, especially after proving he can go low with his Thursday 63. Gotterup at 11-1 also seems solid, especially if winds stay up as he's proven in the past to be able to handle those conditions -- albeit on a very different kind of course in Scotland. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Sony Open leaderboard: Nick Taylor tied on top in Hawai'i after 36 holes - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/2f92be61-598e-4ae7-9a4a-f4952b3642b6/thumbnail/1200x675/26e6b474746a20a231e148a04f72ae87/nick-taylor-hawaii-pga.jpg"
      ],
      "datePublished": "2026-01-17T04:49:02.000Z",
      "dateModified": "2026-01-17T04:49:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jai Opetaia signs deal with Zuffa Boxing: Cruiserweight champ joins upstart promotion - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/boxing/news/jai-opetaia-zuffa-boxing-ibf-cruiserweight-champion/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/17/52b8c57e-380a-4844-bc07-2fe4be922908/thumbnail/1200x675/14c0c608a01a86c75f108cfe3abf8e1c/jai-opetaia-boxing-jan-16-2026-cbs-sports.jpg",
    "tag": "Sports",
    "date": "2026-01-17T01:39:11.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Zuffa Boxing has a new world champion on its roste",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Zuffa Boxing has a new world champion on its roster. The boxing promotion, founded in part by UFC president and CEO Dana White, has signed IBF and The Ring cruiserweight champion Jai Opetaia.Zuffa Boxing and Opetaia announced the signing on Friday on Instagram.\"I'm with Zuffa Boxing now. I'm pumped for the future. It's exciting times,\" Opetaia said. \"Let's get these big fights lined up. Unification. Undisputed soon.\"\n\nOpetaia (29-0, 23 KOs) is one of the best professional boxers on the planet. The undefeated fighter is currently enjoying his second reign as IBF cruiserweight champion, after previously vacating the title, and has knocked out his last four opponents. He owns a pair of victories over former champion Mairis Briedis that helped him earn the title.Zuffa Boxing was officially founded last year by White and Turki Alalshikh. It's a joint venture co-owned by TKO Group Holdings, the parent company of UFC and WWE.\nZuffa Boxing will launch with 12 cards this year. The first official Zuffa Boxing card, headlined by Callum Walsh vs. Carlos Ocampo, is scheduled for Jan. 23, the night before UFC 324, both of which will stream exclusively on Paramount+. Last September, Zuffa Boxing held its debut event headlined by an undisputed title fight between Canelo Alvarez and Terence Crawford.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jai Opetaia signs deal with Zuffa Boxing: Cruiserweight champ joins upstart promotion - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/17/52b8c57e-380a-4844-bc07-2fe4be922908/thumbnail/1200x675/14c0c608a01a86c75f108cfe3abf8e1c/jai-opetaia-boxing-jan-16-2026-cbs-sports.jpg"
      ],
      "datePublished": "2026-01-17T01:39:11.000Z",
      "dateModified": "2026-01-17T01:39:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 14 Fantasy basketball waiver adds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/week-14-fantasy-basketball-waiver-wire/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/e388c180-9cc6-4480-97db-f26ce501e961/thumbnail/1200x675/457db82fbeee99ba9fbbf60979eb9ddc/royce-oneale-phoenix-suns-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-16T21:43:20.000Z",
    "description": "\n        There are 13 teams scheduled to play three or fewer games next week. That leaves an advantage in fantasy for those who roster players on the ",
    "body": "\n        There are 13 teams scheduled to play three or fewer games next week. That leaves an advantage in fantasy for those who roster players on the teams that will play at least four times each. Let's keep that in mind as we hit the waiver wire and highlight five players to consider adding who are still available in the majority of CBS leagues.Royce O'Neale, Phoenix Suns (47% rostered)After logging 25 minutes per game in both of the previous two seasons, O'Neale has played 30 minutes a game this season. That has helped him average 10.5 points, 5.1 rebounds, three assists, 1.2 steals, and 2.9 3-pointers. Of his 8.5 shot attempts per game, seven of them have come from behind the arc. That's significant because he is shooting 41.8% from deep.O'Neale can help fantasy managers in multiple categories, but he doesn't really excel in any one area, outside of 3-pointers. With that in mind, he's best deployed as a streaming option when the Suns have a favorable schedule. That's the case for the upcoming week, with the Suns set to play four times. One of their matchups will be against a Nets team that has the 10th-worst defensive rating. Another will come against the Heat, who play at the fastest pace in the league.Keldon Johnson, San Antonio Spurs (41% rostered)Johnson has proved to be a reliable veteran off the bench for the Spurs. With teams focusing their efforts on trying to slow down Victor Wembanyama, De'Aaron Fox, and Stephon Castle, Johnson has received plenty of quality looks on his way to shooting 56.3% from the field and 41.3% from behind the arc. With his improved efficiency, he has averaged 13.4 points and 1.3 3-pointers to go along with 6.3 rebounds a night.\nThe downside that comes with rostering Johnson is that he provides very little in terms of assists and defensive stats. Still, those who need points, 3-pointers, and rebounds could do worse on the waiver wire. The Spurs will play three games next week, including two against the Jazz and one versus the Pelicans. Those two teams rank inside the bottom five in the league in defensive rating.Tim Hardaway Jr., Denver Nuggets (30% rostered)In a season that has been filled with injuries for the Nuggets, Hardaway has missed just one game. Entering this campaign, he had appeared in at least 71 games in each of the last three seasons. He has hit the ground running with his new team, averaging 13.8 points and 2.9 3-pointers over 28 minutes per game. Known for his 3-point prowess, Hardaway is shooting a career-high 41.4% from deep.Hardaway is on pace to average at least 2.2 3-pointers for the ninth straight season. Of his 10 shot attempts per game, seven of them have been 3-point tries. The Nuggets will play four times next week, making Hardaway a top waiver wire target for those who need 3-pointers. However, don't expect much else from him, considering he has provided only 2.4 rebounds, 1.4 assists, and 0.5 steals per game. \nBrandon Williams, Dallas Mavericks (24% rostered)Anthony Davis (finger) is hurt again. While it appears he has avoided surgery, the Mavericks announced that he will be out for at least six weeks. Davis has been involved in trade rumors, so given his return timeline, he may have already played his final game with the Mavericks. Cooper Flagg (ankle) missed Thursday's game against the Jazz, robbing the team of their top two scoring options.With Flagg being forced out of Wednesday's game against the Nuggets, Williams stepped up to provide 20 points and seven rebounds off the bench. He followed that up with 18 points and three assists Thursday. He has caught fire from the field lately, shooting 57.5% over his last eight games. Even if Flagg isn't out long-term, the absence of Davis makes Williams worth rostering with the Mavericks playing four games next week.De'Anthony Melton, Golden State Warriors (12% rostered)News broke Thursday that Jonathan Kuminga has requested a trade from the Warriors. He hasn't played in 14 straight games as he has fallen completely out of their rotation. Steve Kerr tends to change his rotations often, but Kuminga still hasn't been able to find his way onto the floor. One recent change that Kerr has made has been playing Melton more. Over their last seven games, the veteran has averaged 23 minutes.\nWith Melton playing more, he averaged 13.9 points, three rebounds, one steal, and 2.4 3-pointers over that seven-game span. He shot 50% from the field and 42.5% from behind the arc, both of which likely aren't sustainable. For his career, he shoots 41.1% from the field and 36.6% from 3. Still, those in deeper formats might want to take a chance on riding his hot streak with the Warriors set to play four games next week.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 14 Fantasy basketball waiver adds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/e388c180-9cc6-4480-97db-f26ce501e961/thumbnail/1200x675/457db82fbeee99ba9fbbf60979eb9ddc/royce-oneale-phoenix-suns-imagn-images.jpg"
      ],
      "datePublished": "2026-01-16T21:43:20.000Z",
      "dateModified": "2026-01-16T21:43:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ole Miss QB Trinidad Chambliss sues NCAA for sixth year of eligibility in 2026 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/ole-miss-qb-trinidad-chambliss-ncaa-lawsuit-eligibility-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/0707a7c8-ce83-4418-a5d0-7e961fdae3c3/thumbnail/1200x675/f749ccf48f9e185c742c8a5cf864a192/untitled-design-161.png",
    "tag": "Sports",
    "date": "2026-01-17T00:19:39.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The lawyers of Ole Miss quarterback Trinidad Chamb",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The lawyers of Ole Miss quarterback Trinidad Chambliss officially filed a lawsuit on Friday in the chancery court of Lafayette County in Mississippi, seeking another year of eligibility for their client. The news of Chambliss filing a lawsuit against the NCAA was expected, as it was reported earlier this week that the legal team for Chambliss planned to file suit in Mississippi state court for a preliminary injunction to secure eligibility for next season.Attorney Tom Mars is working with Mississippi trial lawyer William Liston to assist in the move for Chambliss, who seeks relief for his 2022 season at Division II Ferris State. The NCAA denied his waiver request last week, which would likely bring an end to his college career. Chambliss led Ole Miss to the College Football Playoff semifinals before losing to Miami.Chambliss had a deal in place at Ole Miss to return in 2026 under first-year coach Pete Golding, contingent on the NCAA granting his waiver request.\nChambliss argues the legitimacy of his case because of \"incapacitating injury or illness\" in 2022. The NCAA argued that proper documentation from that time period wasn't provided and Ferris State's reasoning for Chambliss not playing after redshirting the previous season was \"development needs and our team's competitive circumstances.\"If Chambliss is ruled ineligible for the 2026 season, he will be eligible for this spring's NFL Draft. In CBS Sports' NFL Draft Prospect Rankings, Chambliss is ranked as the No. 3 signal caller behind Indiana's Fernando Mendoza and Alabama's Ty Simpson. Chambliss finished the 2025 campaign by throwing for 3,927 yards and 22 touchdowns to just three interceptions.\nWith Chambliss' eligibility in limbo, the Rebels signed former blue-chip quarterback recruit Deuce Knight. The former Auburn signal caller would be the projected starter for Ole Miss in 2026 if Chambliss heads to the NFL.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ole Miss QB Trinidad Chambliss sues NCAA for sixth year of eligibility in 2026 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/0707a7c8-ce83-4418-a5d0-7e961fdae3c3/thumbnail/1200x675/f749ccf48f9e185c742c8a5cf864a192/untitled-design-161.png"
      ],
      "datePublished": "2026-01-17T00:19:39.000Z",
      "dateModified": "2026-01-17T00:19:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool vs. Burnley: Where to watch online, live stream - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/all-the-pressure-is-on-arne-slot-at-liverpool-will-the-specter-of-xabi-alonso-waiting-in-the-wings-push-reds/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/16/26da9dd3-826c-4b50-ba86-ed1cb9fe93d0/thumbnail/1200x675/e95f86e3db47e6d5f86a80576de36252/untitled-design-2026-01-16t232316-036.png",
    "tag": "Sports",
    "date": "2026-01-16T22:35:45.000Z",
    "description": "\n        The pressure on Liverpool manager Arne Slot to turn around what has been a disappointing season is now higher that it's ever been. Despite le",
    "body": "\n        The pressure on Liverpool manager Arne Slot to turn around what has been a disappointing season is now higher that it's ever been. Despite leading the Reds to a Premier League title last season, time waits for no one in top level management, and with Xabi Alonso on the market, pressure has now been ramped up for Slot. In an alternative timeline, Alonso would've been the man who Liverpool moved on from club legend Jurgen Klopp for, but things didn't align at the time while he was in the midst of a successful tenure with Bayer Leverkusen.How to watch Liverpool vs. Burnley, oddsDate: Saturday, Jan. 17 | Time: 10 a.m. ETLocation: Anfield -- Liverpool, EnglandTV: USA Odds: Liverpool -450; Draw +550; Burnley +1000But now, Alonso is gone from Real Madrid after only seven months, and Liverpool are trying to secure a Champions League spot for next season while the title race is already out of their reach. After a summer of spending that included adding former players under Alonso in Florian Wirtz and Jeremie Frimpong, there are too many connections to draw of why the Reds would consider making a change during the summer if Slot doesn't turn things around.Liverpool is still a club where the manager can have input from the top down and look to instill a culture stopping the issues leading to Alonso's Real Madrid departure from repeating themselves, but it creates a tenuous situation for Slot. Managing a club is hard enough when a replacement to do the job is on the market, and now, with any poor performance, whispers will arise of when Alonso will come in to right the ship. \nEven facing a team like Burnley, now anything but an emphatic victory won't be enough for the Reds to move past this. Slot also has the added challenge of integrating Mohamed Salah back into the squad after Egypt finishes Africa Cup of Nations duty. During Salah's absence, Wirtz has been able to get back to being more of a ball-dominant player, turning in some of his best performances in a Liverpool shirt with two goals and an assist in his last five Premier League matches. It may not seem like buch but when Wirtz didn't register a single attacking return in the league until December third, it's quite an uptick in production for the young attacker.Slot has his work cut out for him, and Champions League play is also on the verge of returning giving the Reds even more matches to deal with. If they can string together wins in them, it will help change the vibes around a club who have drawn three consecutive league matches, but they also run the risk of deepening their spiral. \nUnder Slot, Liverpool have been able to be extremely consistent, and it led them to a league title, but that has all gone out the door this season after starting off unbeaten in their first five league matches. In a managerial world where you look at what a manager has done for you now instead of their past success, these are the kinds of runs that can lead to shifts of who is in charge so Anfield will be a place to watch.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool vs. Burnley: Where to watch online, live stream - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/16/26da9dd3-826c-4b50-ba86-ed1cb9fe93d0/thumbnail/1200x675/e95f86e3db47e6d5f86a80576de36252/untitled-design-2026-01-16t232316-036.png"
      ],
      "datePublished": "2026-01-16T22:35:45.000Z",
      "dateModified": "2026-01-16T22:35:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College Football Playoff betting line movement for Miami vs. Indiana title game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/line-movement-for-college-football-playoff-national-championship-indiana-vs-miami/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/ac1f344d-6119-4f15-b442-3e8cb4914ffb/thumbnail/1200x675/682952f86edf075e970544893237e0d2/hoosiers.jpg",
    "tag": "Sports",
    "date": "2026-01-16T22:26:33.000Z",
    "description": "\n        College football's national champion will be crowned on Monday night when the undefeated and No. 1 Indiana Hoosiers and the surging Miami Hur",
    "body": "\n        College football's national champion will be crowned on Monday night when the undefeated and No. 1 Indiana Hoosiers and the surging Miami Hurricanes collide in the College Football Playoff National Championship Game at Hard Rock Stadium in Miami.The Hoosiers (15-0) entered the season having lost more games than any program in college football history. But behind the magic of head coach Curt Cignetti and Heisman Trophy-winning quarterback Fernando Mendoza, Indiana is 60 minutes away from completing arguably the most unlikely turnaround in sports history.Meanwhile, the Hurricanes (13-2) were longshots just to get into the 12-team CFP field. But after getting the nod for the final spot over Notre Dame, Miami has knocked off Texas A&M, Ohio State and Ole Miss to reach the title game, which will be played in its home stadium. The Hurricanes will be looking for their sixth national championship but first since the 2001 season.The Hoosiers opened as 7.5-point favorites, but early wagering on Indiana has moved the line to -8.5. It even reached -9 at one point.Bet the College Football Playoff National Championship at DraftKings Sportsbook, where new users get $300 in bonus bets. Click here to sign up:So what should you make the line movement? Is it an overreaction or market correction?Bet College Football Playoff National Championship at FanDuel Sportsbook, where new users get $300 in bonus bets. Click here:CFP National Championship: No. 1 Indiana vs. No. 10 Miami (7:30 p.m. ET Monday)Open: Indiana -7.5Current: Indiana -8.5\nFor transparency: I picked the Hoosiers to cover when the spread opened at -7.5. My thinking is this: Indiana is not a team that beats itself -- the Hoosiers lead the country in turnover margin (1.40 per game) and rank second in penalty yards per game (26.9). Meanwhile, the Hurricanes can sometimes be their own worst enemy. They average 57.1 penalty yards per game (84th in the nation) and are coming off a 10-penalty game in the CFP semifinal win over Ole Miss. And that doesn't include drops, turnovers and game management issues that we've seen with coach Mario Cristobal's squad. Miami needs to play a clean game against a disciplined Indiana team, and I don't know if the Hurricanes are capable of that in the biggest game of their lives.But while I think the Hoosiers will cover, I recognize that the line movement is a bit of an overreaction to recent results. Indiana has blown out both of its CFP opponents -- Alabama (38-3) and Oregon (56-22) -- while Miami is coming off a narrow victory over the Rebels (31-27) to get to the title game. The lookahead line for this matchup was -5.5. Public perception can be strong and certainly has played a part in the early line movement.As kickoff for the championship game nears, there is reason to think that the line will return to -8 or even lower. As of Friday afternoon, the total has come down from 48.5. Normally when money comes in on the Under, the underdog takes money as well, especially when the 'dog is a defense-first team like the Hurricanes. The fact that the point spread has actually risen makes me think we're in store for a drop eventually.So Miami backers would be wise to move sooner rather than later; barring an injury the line is unlikely to get to -9 again. But Hoosiers backers can wait for the spread to get back to a more favorable number.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College Football Playoff betting line movement for Miami vs. Indiana title game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/ac1f344d-6119-4f15-b442-3e8cb4914ffb/thumbnail/1200x675/682952f86edf075e970544893237e0d2/hoosiers.jpg"
      ],
      "datePublished": "2026-01-16T22:26:33.000Z",
      "dateModified": "2026-01-16T22:26:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]