[
  {
    "title": "Purdue vs. Iowa prediction, odds, spread, time: 2026 college basketball picks for Wednesday, Jan. 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/purdue-iowa-odds-spread-time-2026-college-basketball-picks-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/21/0203f211-39c0-49aa-b1ad-0e3b66a5de47/thumbnail/1200x675/e470e2efb73f56cef903879bd0ead01b/usatsi-27506136-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T20:46:29.000Z",
    "description": "\n        A Big Ten battle helps get the Wednesday college basketball schedule underway when the Purdue Boilermakers host the Iowa Hawkeyes. No. 5 Purd",
    "body": "\n        A Big Ten battle helps get the Wednesday college basketball schedule underway when the Purdue Boilermakers host the Iowa Hawkeyes. No. 5 Purdue is 15-1 and 5-0 in the Big Ten, while Iowa is 12-4 and 2-3 in the Big Ten. Iowa is 11-5 against the spread this season, and Purdue is 9-7 ATS.Tipoff is at 6:30 p.m. ET from Mackey Arena. The Boilermakers are 10.5-point favorites per the latest Purdue vs. Iowa odds, while the over/under for total points is 143.5. Before making any Iowa vs. Purdue picks, check out the men's college basketball predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every college basketball game 10,000 times and it enters Week 11 on a sizzling 9-1 run on its top-rated over/under college basketball picks dating back to last season. Anyone following its college basketball betting advice at sportsbooks and on betting apps could have seen strong returns. Now, the model has simulated Purdue vs. Iowa 10,000 times and just revealed its men's college basketball picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several men's college basketball odds and men's college basketball betting lines for Iowa vs. Purdue:\nPurdue vs. Iowa spread:    Purdue -10.5Purdue vs. Iowa over/under:    143.5 pointsPurdue vs. Iowa money line:    Purdue -629, Iowa +453Purdue vs. Iowa picks:    See picks at SportsLinePurdue vs. Iowa streaming:Fubo (Try for free)    New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Purdue vs. Iowa picksAfter simulating Iowa vs. Purdue 10,000 times, SportsLine's model is going Over on the total (143.5 points). The recent trends point strongly to this play as four straight Purdue games have cleared the total, while Iowa has seen three of its past four games go Over as well. The model is projecting 155 combined points as the Over hits nearly 70% of the time. The model also says one side of the spread hits more than 60% of the time. You can only see that pick at SportsLine.\nSo who wins Purdue vs. Iowa, and which side of the spread hits more than 60% of the time? Visit SportsLine now to see which side of the spread to back, all from the model that has simulated this matchup 10,000 times, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Purdue vs. Iowa prediction, odds, spread, time: 2026 college basketball picks for Wednesday, Jan. 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/21/0203f211-39c0-49aa-b1ad-0e3b66a5de47/thumbnail/1200x675/e470e2efb73f56cef903879bd0ead01b/usatsi-27506136-1.jpg"
      ],
      "datePublished": "2026-01-14T20:46:29.000Z",
      "dateModified": "2026-01-14T20:46:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Real Madrid shocked in Copa del Rey by second division Albacete - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/real-madrid-copa-del-rey-upset-albacete-alvaro-arbeloa/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/0d2ccfcf-aebd-46f8-934c-59755e2fed60/thumbnail/1200x675/21c3ffba509c5011bca6038a9278d8b1/rn.jpg",
    "tag": "Sports",
    "date": "2026-01-14T22:56:07.000Z",
    "description": "\n        The Alvaro Arbeloa era at Real Madrid has gotten off to a rocky start with the club getting knocked out of the Copa del Rey at the hands of s",
    "body": "\n        The Alvaro Arbeloa era at Real Madrid has gotten off to a rocky start with the club getting knocked out of the Copa del Rey at the hands of second-tier Albacete 3-2 on Wednesday. Mired currently in LaLiga 2, Albacete are closer to being relegated than they are in pushing for a place in LaLiga, but cup matches can be the great equalizer in soccer. Real Madrid were without Kylian Mbappe in the squad, as he has been dealing with a knee injury, and there was rotation everywhere, but it was Albacete who struck first with Javi Villar scoring in the first half. Franco Mastantuono equalized before halftime, but at no point did Real Madrid seem comfortable away from home. The match would be a deadlock until the 80th minute, with Real Madrid regulars such as Eduardo Camavinga and Dani Carvajal entering the match, but by then, Albacete felt the belief, with substitute forward Jefte Betancor scoring. \nLos Blancos equalized again via Gonzalo Garcia in stoppage time, but yet again, Bentancor struck back to ensure that this match wouldn't go into extra time. With the Real Madrid job being Arbeola's first foray into top flight managment, this match was an important test for a side with sky-high ambitions, and it's one that he fell flat in. In a match like this, even if Madrid don't have their preferred starting XI available, they're expected to emerge with a victory, and instead, despite having 78% of possession, Madrid allowed three goals from only five shots on target.\nAfter falling to Barcelona in the Supercopa de España and moving on from Xabi Alonso as the manager of the club, things need to turn around sooner rather than later for Real Madrid as they're four points behind Barcelona for the LaLiga lead while also still being alive in Champions League play. But for Albacete, this is a moment to celebrate.Who are Albacete?Founded in 1939, this is a team that hasn't been in La Liga since the 2004-05 season. They've been mainstays in the second division, only rarely threatening to make the playoffs for a shot at the top flight, and this season is no different, with the club sitting in 17th place. There is an American on the books in left back Jonathan Gomez, who has been bouncing around Spain since leaving Louisville City FC in 2021, and he came on in the second half as a substitute to help bring fresh legs to the match. He has been far from a regular starter for the club but has still made 20 appearances this season. A club with no notable top-flight trophies, this is a night that will go down in history in Albacete as they now have a place in the Copa Del Rey quarterfinals, and who knows, they could go further and win the whole thing.\nMore worries for Real MadridOn one hand, Arbeloa's inexperience can be looked past due to being a former Real Madrid player, but starting off management on this foot couldn't bring more pressure onto the new Real Madrid manager. A weekend match with Levante would seem like a bounce-back moment for Los Blancos, especially with them being at home at the Santiago Bernabeu, but after losing this match, it's hard to have confidence in what Real Madrid will do. After that, the difficulty level only picks up, closing out January with Champions League matches against Monaco and Benfica (live on Paramount+), along with a LaLiga match against Villarreal. Dropping more points will only make it harder to claw back space in LaLiga before the next Clasico with Barcelona in May, but to even have that chance, Arbeloa will need to establish his style on the squad sooner rather than later. Alonso only lasted seven months on the job, and if things spiral more, there's a real possibility that Real Madrid could see three managers in one season as time waits for no one at the club.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Real Madrid shocked in Copa del Rey by second division Albacete - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/0d2ccfcf-aebd-46f8-934c-59755e2fed60/thumbnail/1200x675/21c3ffba509c5011bca6038a9278d8b1/rn.jpg"
      ],
      "datePublished": "2026-01-14T22:56:07.000Z",
      "dateModified": "2026-01-14T22:56:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Raptors vs. Pacers prediction, odds, start time, spread: 2026 NBA picks for Wednesday, Jan. 14 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/raptors-pacers-odds-prediction-line-time-2026-nba-picks-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/fd9aed46-ae89-46e1-bf78-356c3cbbba41/thumbnail/1200x675/5da615c9d7ac139430e8a080ea96374e/brandon-ingram-toronto-raptors-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-14T21:30:40.000Z",
    "description": "\n        The Indiana Pacers will look to stay hot when they take on the Toronto Raptors in Eastern Conference action on Wednesday night. Indiana is co",
    "body": "\n        The Indiana Pacers will look to stay hot when they take on the Toronto Raptors in Eastern Conference action on Wednesday night. Indiana is coming off a 98-96 win over the Boston Celtics on Monday, while Toronto dropped a 115-102 decision to the Philadelphia 76ers that same night. The Raptors (24-17), who are third in the Atlantic Division, are 11-8 on the road this season. The Pacers (9-31), who are fifth in the Central Division, are looking to win their fourth game in a row. Toronto will be without R.J. Barrett (ankle), Ja'Kobe Walter (hip) and Jakob Poeltl (back), while Indiana will be missing Bennedict Mathurin (thumb) and Isaiah Jackson (concussion).Tip-off from Gainbridge Fieldhouse in Indianapolis is set for 7 p.m. ET. Toronto is a 1.5-point favorite in the latest Raptors vs. Pacers odds from DraftKings Sportsbook, while the over/under for total points scored is 221.5. Before making any Pacers vs. Raptors picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    Now, the model has simulated Raptors vs. Pacers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Raptors vs. Pacers:\nRaptors vs. Pacers                                                                 spread:    Toronto -2.5 at DraftKings    Raptors vs. Pacers                                                                               over/under:    221.5 pointsRaptors vs. Pacers                                                                               money line:    Toronto -120, Indiana +100Raptors vs. Pacers                                                                               picks:    See picks at SportsLineRaptors vs. Pacers                                                                               streaming:Fubo (Try for free) New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Raptors vs. Pacers picksSportsLine's model is going Over on the total (222.5 points). The total has gone Over in six of the last nine head-to-head meetings. The Over has also hit in two of the last three Raptors games. The SportsLine model is projecting Toronto's Brandon Ingram to score 22.4 points on average and be one of five Raptors players to score 10.8 or more points. Indiana's Pascal Siakam, meanwhile, is projected to have 26.1 points as five Pacers players score 11.6 points or more.It has also generated an against-the-spread pick that hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. \nSo who wins Pacers vs. Raptors, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Raptors vs. Pacers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Raptors vs. Pacers prediction, odds, start time, spread: 2026 NBA picks for Wednesday, Jan. 14 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/fd9aed46-ae89-46e1-bf78-356c3cbbba41/thumbnail/1200x675/5da615c9d7ac139430e8a080ea96374e/brandon-ingram-toronto-raptors-imagn-images.jpg"
      ],
      "datePublished": "2026-01-14T21:30:40.000Z",
      "dateModified": "2026-01-14T21:30:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL divisional round picks, AI-generated score predictions, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-divisional-round-2026-picks-ai-score-predictions-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/f7443900-98fe-4ff9-9988-d820b197e94d/thumbnail/1200x675/afb6a8c66254a98a95a37f40723865fb/bo-nix-denver-broncos-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-01-14T21:16:28.000Z",
    "description": "\nThe 2026 NFL divisional round schedule features two games on Saturday, and two on Sunday. Saturday's intriguing matchup will pit NFC West rivals when",
    "body": "\nThe 2026 NFL divisional round schedule features two games on Saturday, and two on Sunday. Saturday's intriguing matchup will pit NFC West rivals when Bock Purdy and the San Francisco 49ers battle Sam Darnold and the Seattle Seahawks. The Seahawks are favored by 7 (over/under 45.5 points) at DraftKings Sportsbook in what's the largest divisional round NFL lines.Other divisional round NFL spreads include Texans vs. Patriots (-3, 40.5) and Rams (-3.5, 48.5)) vs. Bears, both on Sunday. The smallest spread in the divisional round is Bills vs. Broncos (-1.5, 45.5) on Saturday. Before making any 2026 NFL divisional round picks or NFL score predictions, you need to see the NFL against the spread, over/under and money line predictions powered by the self-learning SportsLine AI.Built using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each game. The AI predictions are determined by statistically learning from each team's historical data and then quantitatively evaluating the strength of the opponent's defense by assigning a numeric value out of 100 called a matchup score. It continuously refreshes on the most recent available data and can help you spot the biggest discrepancies in the lines. SportsLine's AI PickBot has hit more than 2,000 4.5- and 5-star prop picks since the start of the 2023 season. For 2026 NFL divisional round NFL betting, SportsLine AI has evaluated the NFL odds and provided NFL betting picks for all four games. You can only see the AI predictions for the 2026 NFL divisional round schedule here.Top 2026 NFL divisional round AI picksAfter analyzing every game in the divisional round, the AI says the Broncos (-1.5, 45.5), who were the top seed in the AFC, cover in a tight win. \nThe Bills have gone under in two of their last three games, while the under has hit in each of the last two Broncos games. Buffalo has won six of the last eight meetings with Denver, including a 31-7 win in an NFC Wild Card matchup last year in Buffalo. The Broncos are looking to win their first postseason game since winning the Super Bowl in 2015. Buffalo has won two of the last three meetings against the Broncos played in Denver. SportsLine AI rates the Broncos as a B money line pick and also predicts a 24-23 Broncos win on average. See its other 2026 NFL divisional round football predictions and football picks at SportsLine, and bet the Broncos at DraftKings here:\nHow to make 2026 NFL divisional round picksIn addition, the AI PickBot has generated three highly-coveted A picks for the 2026 NFL divisional round. You need to see the AI's NFL picks before making any 2026 Wild Card Weekend NFL bets of your own. You can only see them at SportsLine.Who wins and covers each 2026 NFL divisional round game, and which A+ picks should you target now? Visit SportsLine now to see the top NFL picks against the spread, over-under and on the money line, all from the SportsLine AI that has nailed more than 2,000 highly-rated picks since the start of the 2023 season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL divisional round picks, AI-generated score predictions, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/f7443900-98fe-4ff9-9988-d820b197e94d/thumbnail/1200x675/afb6a8c66254a98a95a37f40723865fb/bo-nix-denver-broncos-imagn-images.jpg"
      ],
      "datePublished": "2026-01-14T21:16:28.000Z",
      "dateModified": "2026-01-14T21:16:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +500 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nba-odds-picks-predictions-best-bets-parlay-wednesday-january-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/19/7450d229-ebee-4556-9764-d4a1694dace4/thumbnail/1200x675/5340aebd37f738318e2489bd63ae540c/scottie-barnes-toronto-raptors-imagn-images-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T21:06:44.000Z",
    "description": "\n        Wednesday's NBA schedule features seven games. Among the notable NBA odds include Raptors vs. Pacers (+1.5), Cavaliers vs. 76ers (-1.5), Jazz",
    "body": "\n        Wednesday's NBA schedule features seven games. Among the notable NBA odds include Raptors vs. Pacers (+1.5), Cavaliers vs. 76ers (-1.5), Jazz vs. Bulls (-2.5) and Nuggets vs. Mavericks (-2.5). Indiana and the Los Angeles Clippers look to extend their winning streaks to four games, while Brooklyn looks to snap a four-game losing skid.      What are the NBA best bets for Wednesday, and which combination of picks should you target in a Wednesday NBA parlay? Before locking in any NBA picks, you'll want to see the NBA predictions and betting advice from SportsLine's proven computer model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.    \nNow, the model has scoured the latest NBA odds and locked in three confident NBA best bets. If you successfully parlay its picks, you'd be looking at a payout of over +500. You can only see the model's NBA picks at SportsLine.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins:Top NBA picks for Wednesday, Jan. 14After simulating every game 10,000 times, the model is backing the Indiana Pacers (+1.5) to cover the spread against the Toronto Raptors at 7 p.m. ET. The Pacers have won three games in a row and the Raptors are down a number of players, including R.J. Barrett (ankle), Ja'Kobe Walter (hip) and Jakob Poeltl (back). Indiana has also covered in two of the past three games against Toronto.\nPascal Siakam helps power the Indiana offense. In 39 games, all starts, he is averaging 23.5 points, 6.8 rebounds, 3.8 assists and 1.3 steals in 33.8 minutes. The Pacers will be without Bennedict Mathurin (thumb) and Isaiah Jackson (concussion).    The model is projecting five Raptors players to score 10.8 points or more, led by Brandon Ingram's 22.4 points. The Pacers meanwhile, are projected to be led by Pascal Siakam's 26.1 points as five Indiana players score 11.6 points or more. The model is backing Indiana to cover nearly 60% of the time. See which other NBA parlay picks to make here.\nHow to make NBA predictions for Wednesday, Jan. 14The model also has locked in two more picks, including another bet that hits over 70% of the time. You can only see the model's NBA parlay at SportsLine.\nWhat are the model's top NBA parlay picks for Wednesday, and which best bets should you target for a chance at a payout of over +500? Visit SportsLine now to see NBA best bets from a model that's returned more than $10,000 on top-rated picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA odds, lines, spreads, picks, predictions: This Wednesday parlay returns over +500 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/19/7450d229-ebee-4556-9764-d4a1694dace4/thumbnail/1200x675/5340aebd37f738318e2489bd63ae540c/scottie-barnes-toronto-raptors-imagn-images-1.jpg"
      ],
      "datePublished": "2026-01-14T21:06:44.000Z",
      "dateModified": "2026-01-14T21:06:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $300 bonus bets by targeting Cavaliers-76ers, North Carolina-Stanford today - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/use-draftkings-promo-code-to-get-300-bonus-bets-cavaliers-76ers-north-carolina-stanford-wednesday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg",
    "tag": "Sports",
    "date": "2026-01-14T21:47:05.000Z",
    "description": "\n        The latest DraftKings promo code gives new users $300 in bonus bets if your first $5 bet wins. The Cleveland Cavaliers didn't expect to surpa",
    "body": "\n        The latest DraftKings promo code gives new users $300 in bonus bets if your first $5 bet wins. The Cleveland Cavaliers didn't expect to surpass their loss total from last season more than a month before the 2026 NBA All-Star Game, but coming off a 64-18 season is a tough standard to maintain. The Cavaliers haven't been nearly as dominant over their 22-19 start to the 2025-26 NBA season, but the SportsLine projection model expects them to pick up a quality Eastern Conference win over the Philadelphia 76ers as a part of its Wednesday best bets at DraftKings Sportsbook. The over/under for Cavaliers vs. 76ers is 235.5 points, down three from the opening line. The model has also locked in a college basketball best bet, backing No. 14 North Carolina to cover as 3.5-point favorites against Stanford in California. One of SportsLine's top experts has also locked in a college basketball pick on Iona vs. Rider at 7 p.m. ET. Claim the latest DraftKings promo code, where new users get $300 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 13 of the 2025-26 NBA season on a sizzling 34-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Wednesday best bets at DraftKings SportsbookCavaliers (-108) to defeat the 76ersNorth Carolina (-3.5) vs. Stanford (-108)Iona (-7.5) vs. Rider (-110)Combining the three picks into a Wednesday parlay at DraftKings would result in a payout of +608 (risk $100 to win $608, odds subject to change). Bet it at DraftKings here:\nCavaliers (-108) to defeat the 76ersThe injury report gives the impression that both teams will likely be at near full strength, which makes for one of the best matchups on the Wednesday NBA schedule. The Cavaliers are coming off a 123-112 upset loss to the Jazz on Monday, but they were 5-2 over their prior seven games before that result. Cleveland travels to Philadelphia, but the Cavaliers have won two of their last three road games, including knocking off the Spurs. The Cleveland lineup features the majority of the same pieces from last year's 64-18 season, leading the model to consider the Cavaliers a better team than their current 22-19 record indicates. The 76ers have lost two of their last three home games, and the model projects the Cavaliers to win in 60% of simulations, showcasing strong value at their current odds. Back the Cavaliers at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:North Carolina (-3.5) vs. Stanford (-110)The Tar Heels had the No. 5 freshman class this season, according to rankings by 247Sports, highlighted by 6-foot-10 freshman forward Caleb Wilson. Wilson was the No. 8-ranked Class of 2025 player by 247Sports, and he's justified that position with four 20-point double-doubles over his last five games. He's averaging 19.5 points and 11 rebounds per game this season. The Tar Heels also have experience, though, with senior center Henri Veesaar (16.9 points, 9.2 rebounds) and senior guard Seth Trimble (15.7 ppg). North Carolina (14-2, 2-1 ACC) is No. 14 in the nation and 8-1 over its last nine games, including a road victory over Kentucky. Stanford (13-4, 2-2) is coming off a 70-55 loss to No. 23 Virginia on Saturday. The model projects North Carolina to cover in 57% of simulations. Back North Carolina at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:Iona (-7.5) vs. Rider (-110)\"Things aren't going too well for Rider, which might have a case as the worst-shooting team in America,\" legendary SportsLine expert Bruce Marshall said. \"To wit: only four teams out of 361 shoot less accurately from the floor than the Broncs' 38.6%, and there isn't one team that shoots triples worse than Rider, whose at 24.7% from beyond the arc are bottom-of-the-barrel nationally, with second-worst East Carolina not even that close. The plight is reflected by All-Name soph guard Flash Burton, who followed up his recent 27-point game vs. Fairfield by getting blanked on Sunday by Marist. Meanwhile, Iona has steadied since scoring just 38 in a recent lopsided loss vs. that same Marist, blowing out Niagara and Canisius last week while allowing just 50 ppg in the process.\" Back Iona at DraftKings Sportsbook, where new users get $300 in bonus bets if your first $5 bet wins:\nWant more NBA, college basketball picks for Wednesday?You've seen some of the model's Wednesday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $300 bonus bets by targeting Cavaliers-76ers, North Carolina-Stanford today - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/04/52866cdb-2541-4fb6-8b10-4682965e71be/thumbnail/1200x675/12b9da313f2de6f23afbd2c2e0cb45da/new-draftkings-promo.jpg"
      ],
      "datePublished": "2026-01-14T21:47:05.000Z",
      "dateModified": "2026-01-14T21:47:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 College Football Hall of Fame class: Mark Ingram, Ndamukong Suh headline class - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2026-college-football-hall-of-fame-class-mark-ingram-aaron-donald-ndamukong-suh/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/12b5965a-0053-4143-8d7b-1498c55874bd/thumbnail/1200x675/3097801948d60f89e14ca1e5875fc815/gettyimages-1246025199-1.jpg",
    "tag": "Sports",
    "date": "2026-01-14T21:59:09.000Z",
    "description": "\n        The National Football Foundation announced on Wednesday the 22 inductees who will be enshrined as members of the 2026 College Football Hall o",
    "body": "\n        The National Football Foundation announced on Wednesday the 22 inductees who will be enshrined as members of the 2026 College Football Hall of Fame class. Legendary players, including Mark Ingram, and coaches, including Chris Petersen, are among those selected from the ballot, and they will be inducted during a ceremony on Dec. 8.The 2026 class features 18 players and four coaches. Among them are eight major award winners including Ingram, who won the 2009 Heisman Trophy, and 10 unanimous first-team All-Americans. The coaches combined for 48 conference championships, and former Carson-Newman coach Ken Sparks accounts for all five of the group's national championships.\"Each of these legends ranks among the absolute best to have ever played or coached the game, and we look forward to adding their incredible accomplishments to those permanently enshrined in the NFF Hall of Fame,\" NFF chairman Archie Manning said in a release.Players elected to College Football Hall of FameNamePositionSchoolYears PlayedJerry AzumahRBNew Hampshire1995-98Ki-Jana CarterRBPenn State1991-94Bruce CollieOTTexas-Arlington1981-84George CumbyLBOklahoma1976-79Aaron DonaldDTPittsburgh2010-13Marvin HarrisonKR/WRSyracuse1992-95Garrison HearstRBGeorgia1990-92Chris HudsonDBColorado1991-94Mark IngramRBAlabama2008-10Olin KreutzCWashington1995-97James LaurinaitisLBOhio State2005-08Jordan LynchAP/QBNorthern Illinois2010-13Herman MooreWRVirginia1988-90Terence NewmanCBKansas State1999-2002Bob NovogratzOGArmy1957-58Ndamukong SuhDTNebraska2006-09Peter WarrickWRFlorida State1996-99Eric WeddleSUtah2003-06Ingram and Warrick won national championships at Alabama and Florida State, respectively, while all but four players secured at least one conference title. Numerous inductees enjoyed prolific professional careers at the end of their college days, and 10 of them were selected in the first round of the NFL Draft.\nDonald and Suh not only established themselves as two of the best players in their schools' histories but also stand among the greatest defensive linemen in recent memory at both the college and pro levels.Coaches elected to College Football Hall of FameNameSchoolYears CoachedRecordJim MargraffJohns Hopkins1990-2018221-89-3 (71.1%)Gary PattersonTCU2000-21181-79 (69.6%)Chris PetersenBoise State, Washington2006-13, 2014-19147-38 (79.5%)Ken SparksCarson-Newman1980-2016338-99-2 (77.2%)Petersen redefined what is possible at the Group of Five level with his success at Boise State, which included the legendary 2007 Fiesta Bowl win. He later achieved greatness at Washington and is the only coach in the 2026 Hall of Fame class to reach the College Football Playoff.\nEach of the other inductees ranks first all-time in victories at their respective schools. Patterson is among them and is the most recent coach to hold an on-field job. He enjoyed a legendary run at TCU from 2000-21, which featured two National Coach of the Year award selections, 11 double-digit-win seasons and numerous top-10 rankings across stints in four different conferences.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 College Football Hall of Fame class: Mark Ingram, Ndamukong Suh headline class - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/12b5965a-0053-4143-8d7b-1498c55874bd/thumbnail/1200x675/3097801948d60f89e14ca1e5875fc815/gettyimages-1246025199-1.jpg"
      ],
      "datePublished": "2026-01-14T21:59:09.000Z",
      "dateModified": "2026-01-14T21:59:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morocco, Senegal collide in a cinematic AFCON final loaded with star power - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/morocco-senegal-afcon-2026-final-live-stream-where-to-watch-news/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/49fd6b03-32a4-479f-b2bc-bb4a94ca9e12/thumbnail/1200x675/882b5373be5e11d5fc78fda409e06c4a/morocco.jpg",
    "tag": "Sports",
    "date": "2026-01-14T23:45:36.000Z",
    "description": "\n        The Africa Cup of Nations is set as Senegal will face Morocco on Sunday to determine the champion of the continent. Senegal were able to get ",
    "body": "\n        The Africa Cup of Nations is set as Senegal will face Morocco on Sunday to determine the champion of the continent. Senegal were able to get past Egypt in the semifinals, while it took a penalty shootout for Morocco to book their place in the final in front of their home fans. Morocco got past Nigeria, who had been the top scoring team at AFCON, and it will set up quite a final on Sunday as the Atlas Lions look to win the tournament for the first time since 1976. They've been an extremely successful side at World Cups, but Morocco haven't even been runners-up at AFCON since 2004, but that could all change Sunday.How to watch Senegal vs. MoroccoDate: Sunday, Jan. 18 | Time: 2 p.m. ETLocation: Prince Moulay Abdellah Stadium -- Rabat, MoroccoTV: beIN Sports | Live stream: Fubo (Try for free)How Senegal got hereAfter winning Group D by going undefeated during the group stage, Senegal had the joint best defensive record, allowing only one goal in group stage play. Pushing to the knockout stage, they were able to fend off Sudan before Mali's red card made advancing past the quarterfinals a breeze. Meeting Egypt, Senegal's defense were again strong, keeping Mohamed Salah in check en route to another shutout victory. Only allowing two goals at AFCON so far, keeper Edouard Mendy and the Senegal defense will be tough to break down as the nation look to secure their first AFCON title since 2021.How Morocco got hereLike Senegal, Morocco won Group A with an undefeated record, scoring six goals while only allowing one. Real Madrid man Brahim Diaz's goals were a large part of their success, but so was the return of Paris Saint-Germain right back Achraf Hakimi from injury, which has given them their leader back on the pitch. Called in without playing a minute of soccer for PSG this season, it was a risk bringing Hakimi, but he has hit the pitch as if he hasn't missed a step, which has been critical in the knockout stage for the Atlas Lions. They squeaked past Tanzania in the round of 16 before putting two goals past Cameroon. Coming up against Nigeria in the semifinals was quite a tall task for Morocco, but keeper Yassine Bounou was more than ready to play under pressure and secure their place in the final.Players to watchSenegal: All eyes will be on Sadio Mane, despite him being more of a creative presence during this tournament. When his team needed him most, Mane came up with a goal to defeat Egypt, but during the tournament as a whole, he has two goals and three assists. With Nicolas Jackson and Iliman Ndiaye being able to help pace the attack, less pressure has been on Mane to score in this tournament but he has been a critical part of the progression of Senegal's balanced attack. Facing Morocco in the final, while it will be a defense-first affair, this is a moment where stars like Mane will be looked upon.\nMorocco: Brahim Diaz will not only be looking to win AFCON, but he also enters as the leader in the Golden Boot race. With five goals so far in this tournament, it's clear where the Atlas Lions will look for their goals. He's gotten it done in plenty of different ways and will be looking to bounce back after Nigeria were able to keep him from making an impact in attack. Forward Ayoub El Kaabi of Olympiacos has been able to offer a secondary focus in the attack, but Diaz is still the first person that Morocco look to when they need a goal, and he'll need to be at his best to break down a stout Senegal defense. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morocco, Senegal collide in a cinematic AFCON final loaded with star power - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/49fd6b03-32a4-479f-b2bc-bb4a94ca9e12/thumbnail/1200x675/882b5373be5e11d5fc78fda409e06c4a/morocco.jpg"
      ],
      "datePublished": "2026-01-14T23:45:36.000Z",
      "dateModified": "2026-01-14T23:45:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trae Young won't make Wizards debut until after All-Star break, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/trae-young-injury-update-wizards-hawks-trade-nba/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/b8b0074a-7a1f-4439-9b77-fb0a67bfca63/thumbnail/1200x675/5da5dc857e59142140a255841f504ccd/trae.jpg",
    "tag": "Sports",
    "date": "2026-01-14T22:44:27.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The biggest trade of the 2025-26 NBA season (so fa",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The biggest trade of the 2025-26 NBA season (so far) saw the Atlanta Hawks finally unload four-time All-Star guard Trae Young to the Washington Wizards for CJ McCollum and Corey Kispert. However, Wizards fans wondering what the team will look like with Young on the floor will have to wait some time for his debut in the nation's capital. Young, who has only played in 10 games this season due to MCL and quad injuries, will remain out until after the All-Star break when he is re-evaluated again, per ESPN. The Wizards being cautious with Young's injury comes as little surprise. Washington is 10-28 this season and, organizationally, is far more focused on retaining their top-8 protected pick in the much-anticipated 2026 NBA Draft and landing one of the top prospects to add to the roster. Young, meanwhile, has a key decision to make this summer as he has a $49 million player option for the 2026-27 season. \n\n        \n            \n                Trae Young contract: Wizards mulling extension after trade, so what kind of deal makes sense?\n                \n                    James Herbert                \n            \n                            \n    \n                \n                    \n    \nHe's hopeful to get an extension in Washington, but at this point it seems more likely he'll pick up the option and play out next season with the Wizards in hopes of raising his value again ahead of a free agent summer. While Young, like any player, wants to be on the floor, he will also be taking a long view this season and understands getting healthy and being able to play at his full capacity is the most important thing to his long-term future as well. With both parties aligned (albeit for varying reasons) on remaining cautious and trying to get him back at 100 percent before getting him back on the court, Young will miss at least another month and likely more. The key phrase in ESPN's report is \"re-evaluated\" which typically means a player missing even more time, even if just for a ramp-up period if they're medically cleared in the re-evaluation. \nYoung, in just 10 games this season, is averaging 19.3 points, 8.9 assists and 1.5 rebounds while shooting 41.5% from the field and 30.5% on 3-pointers.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trae Young won't make Wizards debut until after All-Star break, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/b8b0074a-7a1f-4439-9b77-fb0a67bfca63/thumbnail/1200x675/5da5dc857e59142140a255841f504ccd/trae.jpg"
      ],
      "datePublished": "2026-01-14T22:44:27.000Z",
      "dateModified": "2026-01-14T22:44:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PGA Tour predictions, expert picks for 2026: Major winners, breakouts, more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/pga-tour-predictions-expert-picks-2026/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/5e4ca74e-23dd-4dcd-b2ca-143dade5af5c/thumbnail/1200x675/042b401d66008a4578b4686efe59fa4c/2026golfep-editorial.jpg",
    "tag": "Sports",
    "date": "2026-01-14T23:05:22.000Z",
    "description": "\n        With football deep into the playoffs, conference play beginning in college basketball and the NBA still weeks away from its All-Star break, t",
    "body": "\n        With football deep into the playoffs, conference play beginning in college basketball and the NBA still weeks away from its All-Star break, the sports world turns its attention to the 2026 PGA Tour season, which starts Thursday at the Sony Open in Hawaii. This week's tournament has plenty going for it, but a larger look at the game as a whole is required before the campaign gets underway.Will 2026 be dominated by Scottie Scheffler and Rory McIlroy, who were seemingly making weekly headlines in 2025? Scheffler may have gotten off to a slow start, but by year's end, he closed off two additional legs of the career grand slam while again emerging as the PGA Tour of the Year. The opposite was the case for McIlroy, who finally reached the summit at Augusta National, winning his first Masters and achieving the career grand slam he sought for more than a decade, only to fall off a bit after the fact before finding his game again.Might this year be the true breakout for Tommy Fleetwood, who went from never winning a PGA Tour event to capturing the Tour Championship and the massive FedEx Cup Playoffs payday that went along with it? Will Jordan Spieth, Justin Thomas or Rickie Fowler truly rebound and justify their popularity with more trips to the winner's circle than the last few years?There are plenty of questions to be answered as the season begins, and our CBS Sports experts will do their best to give you the lay of the land. Let's take a look at the names that should thrive and survive.\n2026 PGA Tour predictionsPlayer of the YearScottie Scheffler: Yawn. \"Bor-ing!\" Scheffler is going to sprint into 2026 to make amends for his slow start in 2025. He has been up in the gym focusing on his endurance, and he has even picked up some speed with a new Taylormade driver in his bag. That's the area where he decided he has room to improve, and if the improvement comes as quickly as his putter became a weapon the last two seasons, watch out! By the end of 2026, the world No. 1 will be a member of the 25 PGA Tour wins, five major championships club. -- Patrick McDonaldScottie Scheffler. Bold pick, right? It's just tough to envision a world where (health provided) he doesn't win five times, including a major. It would be incredibly tough for anyone else to top that kind of season. Scottie three-peats as Player of the Year and continues his march up the all-time list. -- Robby KallandMost wins (Scheffler excluded)Xander Schauffele: For as important as 2024 was for raising Schauffele's stock, his 2025 was as important as locking him into being a blue-chip player. His injury clearly affected him for the majority of the year, but he found his stride in the fall with a strong showing at the Ryder Cup and a win at the Baycurrent Classic in Japan. From tee to green, he remained a solid producer, and he will just need to find his rhythm on the greens in 2026 to look more like the 2024 version of himself. He has the longest made cut streak on the PGA Tour and has notched 14 top-20 finishes in his last 15 major championships. -- McDonald\nTommy Fleetwood: The Lad finally broke through at the Tour Championship, and he might go on a tear in 2026. I've got Tommy picking up a major and a few other wins this season, and he should close the gap considerably on Rory McIlroy for No. 2 in the world by year's end. For a long time, Fleetwood would pop up, contend, lose and fade away. Last year, he just kept knocking on the door and refused to slide back after coming up short. He takes off in 2026. -- KallandComeback Player of the YearJordan Spieth: A lesson from the 2025 season should be that injuries take a while to get over -- see Scheffler, Schauffele and even Spieth. After an offseason procedure on his wrist, in 2025, Spieth started showing legitimate signs that he is on the path back to being a top 20 player in the world. There is a lot of chatter about his iron play needing to improve (it does), but two areas I am looking at are his putting inside 10 feet (ditching his gamer) and his mentals (chilling out). Since his win at the 2017 Open at Royal Birkdale, where players return this summer, Spieth has only won two times on the PGA Tour. He adds to that this year. -- McDonaldBrooks Koepka: We haven't seen Brooks really contend for some time. His T12 at the U.S. Open last year was his best major finish in two years, and I don't think the rhythm and feel of LIV Golf ever captured his competitive mindset to bring out the best in his game. Maybe he is just past his prime, but at 35 years old, I believe there's more in the tank for Koepka, and a return to the PGA Tour schedule will help him find that level. -- Kalland\nBreakout Player of the YearRyan Gerard: The confidence has always been there for the 26-year-old, and midway through the 2025 season, his game started to catch up. Gerard was a surprise fixture on the leaderboard at the PGA Championship before grabbing his maiden PGA Tour victory at the Barracuda Championship. Needing a fourth-place finish in the final event of the year on the DP World Tour to earn an invitation into the Masters, he traveled to Mauritius, where he fell in a playoff but secured himself a place on the tee sheet at Augusta National in April. He is as steady as they come from tee to green, and if he's able to find some semblance of comfort on the greens, Gerard will comfortably become a top 20 player in the world. (Bonus: Look for Tom McKibbin to make a name for himself out of LIV Golf in the 2026 majors. The 23-year-old is so well-rounded at this stage of his career and has improved in every aspect from season to season.) -- McDonaldNeal Shipley: He's a boom-or-bust player -- eight top 10s and two wins vs. 11 missed cuts last year on the Korn Ferry Tour -- but when he's on, he can hang with the absolute best. It doesn't hurt that Shipley is already a bit of a known commodity with a big personality, but it wouldn't be surprising if he snags some top 10s in big events this season on the PGA Tour and possibly notches a win to cement himself as a rising star. -- KallandLock to win a major championshipJustin Rose: He will be 120 years old, and yet, I will still have faith in him winning a major. This should really go to Scheffler; it could go to McIlroy. But they are free spaces at this point, and you're looking for a little something extra, so why not the 45-year-old Englishman? We know what he can do at the Masters. He won his lone major championship in Philadelphia, where the PGA Championship is being played. He is a past U.S. Open winner, and he can never be doubted at The Open, either. -- McDonald\nTommy Fleetwood: It just doesn't seem fun to just put Scheffler in this space, though he will probably win another in 2026. Slotting in Fleetwood just shows I'm all-in with The Lad this year. What could possibly go wrong?! It's most likely to happen at The Open, but he's got the game to contend at all four majors. The ball-striking has always been there, but the confidence with the putter has started to show up more, and he has the belief now that he's going to finish rounds strong rather than limping to the finish. -- KallandFedEx Cup top five (at start of playoffs)(1) Scottie Scheffler, (2) Xander Schauffele, (3) Justin Rose, (4) Hideki Matsuyama, (5) Matt McCarty: Besides being high on Scheffler and Schauffele, Rose being projected to win a major would likely find him in the mix here, too. Rounding out the top five is Matsuyama, who has quietly notched multiple-win campaigns in three of the last four years, and McCarty, who will raise some eyebrows. The left-hander gets his second look at all these golf courses in his sophomore campaign, which will only help. He's outside signature events as it stands, but expect him to play his way in and possibly win a tournament or two. -- McDonald(1) Scottie Scheffler, (2) Tommy Fleetwood, (3) Rory McIlroy, (4) Xander Schauffele, (5) Viktor Hovland: Not stepping out on any real limbs here, but expect a big year from the top stars with Schauffele and Hovland in particular getting back into elite form and contending more regularly than we saw a year ago and getting some strong results in big events.\nSurprise predictionThe PGA Tour makes plans to cancel the Presidents Cup. This is all gut, but if I'm PGA Tour CEO Brian Rolapp -- and I'm looking at the Presidents Cup -- I wonder how viable an event without some of its biggest names and personalities (Europeans) is long term. The event is scheduled out to 2030, and with it not holding a candle to the PGA of America's Ryder Cup, Rolapp may look in another direction for a team-style tournament. It's far too similar to its counterpart while simultaneously being far less compelling. Not a great combination. -- McDonaldScottie Scheffler does not complete the career grand slam. Everyone has Shinnecock circled for Scheffler, and while it feels like it is only a matter of time before he adds his name to golf's most exclusive club, it won't happen in 2026. As we all saw with McIlroy, it's rarely as easy as it seems to conquer history. While I neither expect Scottie to go through a decade-long major drought like Rory nor get locked up in a Phil Mickelson-esque torture chamber at the U.S. Open, I do believe he'll have to go through some heartache at the national open before he wins it. The last two U.S. Open performances (even with a T7 at Oakmont) weren't what we're accustomed to seeing from Scheffler; he's still figuring out how to best approach U.S. Open setups. -- Kalland\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PGA Tour predictions, expert picks for 2026: Major winners, breakouts, more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/5e4ca74e-23dd-4dcd-b2ca-143dade5af5c/thumbnail/1200x675/042b401d66008a4578b4686efe59fa4c/2026golfep-editorial.jpg"
      ],
      "datePublished": "2026-01-14T23:05:22.000Z",
      "dateModified": "2026-01-14T23:05:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "49ers vs. Seahawks odds: How to bet Divisional Round matchup - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/seahawks-vs-49ers-odds-how-to-bet-the-divisional-round-matchup-what-to-know-about-betting-each-team/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/02/06b1821e-b958-4804-aa8f-56880b8fd16f/thumbnail/1200x675/a9fc377f213f6a256cabb4f1e888ee90/seahawks-49ers-imagn.jpg",
    "tag": "Sports",
    "date": "2026-01-14T23:44:33.000Z",
    "description": "\nJarran Reed doesn't hold back his feelings about the San Francisco 49ers. \"Me personally, don't like nothing about them,\" the Seattle Seahawks defens",
    "body": "\nJarran Reed doesn't hold back his feelings about the San Francisco 49ers. \"Me personally, don't like nothing about them,\" the Seattle Seahawks defensive tackle said Tuesday.On Saturday, Reed and the rest of the Seahawks will square off against the NFC West rival 49ers for the third time this season -- and the just time in three weeks -- when the teams collide in a NFC Divisional Round matchup at Lumen Field in Seattle. In the teams' season opener at Lumen Field, San Francisco won 17-13. But two weeks ago in the regular season finale in Santa Clara, Calif., the Seahawks prevailed 13-3 to win the NFC West and earn the No. 1 seed in the playoffs.This time, the stakes will be much more significant: Saturday's survivor will advance to the NFC Championship Game. \"We know what's at stake; they know what's at stake,\" Reed said. \"It's about getting out there between them lines and hitting it head-on, man-on-man, mano-y-mano.\"For Saturday, Seattle is a seven-point favorite at DraftKings over the 49ers.Seahawks vs. 49ers odds\nOpening spread: Seahawks -6.5 (-115)Opening money line:  Seahawks -305, 49ers +245Opening total: 47.5This line has risen from its initial opening and even touched -7.5 at DraftKings. But note: In both of the previous meetings this season, the road team has been favored, won outright and covered against the spread. In Week 1, San Francisco was a 3.5-point favorite in Seattle and won by four. Just two weeks ago in Santa Clara, Seattle was a 2.5-point favorite and won by 10.In addition, the Under hit in each of the last three meetings dating back to last season. The total was 42.5 in Week 1 when the teams combined for 30 points and 48.5 in Week 18 when the teams combined for just 16. That may be the reason why the total for the Divisional Round matchup has dropped after opening at 47.5.Seahawks betting profile\nOpening win total: 7.5 wins  W/L record: 14-3ATS record: 12-5O/U record: 9-8Believers in the Seahawks did well in 2025. Seattle's 12-5 record against the spread during the regular season was tied with the Patriots for the best such record in the NFL. In addition, the Seahawks easily cleared their preseason win total clinching Over 7.5 wins in Week 12. They also enter the playoffs on a roll, having won seven in a row straight-up. They were favorites in each of those seven games.However, Seattle has struggled in the postseason recently. The Seahawks are 0-3 straight-up and against the spread in their last three playoff games. They also are 1-3 straight-up and against-the-spread against divisional opponents in the postseason since 2000.49ers betting profile\nOpening win total: 10.5 wins  W/L record: 13-5ATS record: 11-7O/U record: 10-8Despite battling a mind-boggling number of injuries to key players this season, San Francisco somehow managed to go Over their preseason total of 10.5 wins. The 49ers also are 7-1 straight-up and 6-2 against the spread over their last eight games, but that includes the loss to the Seahawks in the regular season finale.San Francisco has enjoyed tremendous success against Seattle at Lumen Field recently. The 49ers have won their last four games straight-up against the Seahawks in Seattle, covering in all four games as well. To be fair, San Francisco was favored in each of those games. The 49ers are also 4-1 against the spread all-time against divisional opponents in the postseason and 7-0 straight-up (and 6-1 against-the-spread) in the Divisional Round in the last 20 seasons.Seahawks-49ers prop pick: Brock Purdy Under 230.5 passing yards\nThis number has dropped to 227.5 at some places, so there's some value here. When the 49ers met the Seahawks two weeks ago, Purdy didn't get close to this number, completing 19-of-27 passes for 127 yards. And now he will be without injured tight end George Kittle, who had five catches for 29 yards in that game.On Saturday, Purdy will face arguably the best pass defense in the league. Seattle led the NFL in yards per attempt (6.0) and yards per catch (9.7). The defense also ranked fourth in passer rating (77.9) and 10th in passing yards per game (193.9). Only one opposing quarterback in the Seahawks' last six games, the Rams' Matthew Stafford, has gone Over this number.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "49ers vs. Seahawks odds: How to bet Divisional Round matchup - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/02/06b1821e-b958-4804-aa8f-56880b8fd16f/thumbnail/1200x675/a9fc377f213f6a256cabb4f1e888ee90/seahawks-49ers-imagn.jpg"
      ],
      "datePublished": "2026-01-14T23:44:33.000Z",
      "dateModified": "2026-01-14T23:44:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Basketball: 10 reserves to start in lineups - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-2025-2026-the-10-best-reserve-players-off-the-bench-and-into-your-lineups/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/82fe74cf-befd-4461-ac5c-29b3e43bd996/thumbnail/1200x675/6b5f45a36f25b998acb68dceb20cde21/bobby-portis-milwaukee-bucks-cbs.jpg",
    "tag": "Sports",
    "date": "2026-01-14T20:19:21.000Z",
    "description": "\n        Impactful bench players are often the hidden edge in fantasy basketball. This article spotlights 10 reserves who are delivering consistent pr",
    "body": "\n        Impactful bench players are often the hidden edge in fantasy basketball. This article spotlights 10 reserves who are delivering consistent production, using stats, role trends and rotation context to highlight their real fantasy impact. Whether you're tracking the latest fantasy basketball news, monitoring the NBA injury report, studying NBA depth charts or updating your fantasy basketball cheat sheet, these profiles help identify emerging value and reliable contributors.Bobby Portis, BucksPortis has been the backbone of the Bucks' second unit for most of his time since joining the team in 2020. He has shown many times over that period that he can step up as a starter when needed, but his ability to bring energy and effort off the bench is a valuable element to any rotation. He is producing 13.0 points on 48.8 percent shooting, 6.5 rebounds and 1.3 assists in 23.4 minutes per game this season, which is right around his career averages. He has appeared in all 40 games, reaching the 20-point mark six times, and hauling at least 10 rebounds on seven occasions. Santi Aldama, GrizzliesAldama has seen a number of starting stints over the last couple of seasons, but he remains largely in a backup role. He has shown improvement every year and is currently averaging career highs of 14.0 points, 6.8 rebounds, 3.1 assists and 0.9 steals in 28.0 minutes per game. He scored a career-high 37 points twice this season, once as a starter and once off the bench, while reaching the 20-point mark in six of his 39 appearances. Additionally, he has hauled in double digits in rebounds seven times off the bench.  Jaime Jaquez, HeatJaquez hit a bit of a slump last season but has made a strong bounce back, averaging career highs of 15.9 points, 5.1 rebounds and 4.6 assists per game, including reaching the 20-point mark in 11 outings and establishing a season high of 31 points. He has also grabbed double digits in rebounds three times and dished over five assists in 12 games, with a season high of 11 assists. His all-around offensive ability is a great asset in a bench player, as he can chip in as needed with a scoring focus or by looking to distribute the ball. His efficient 53.0 percent shooting this season is another fantastic element to his game, but he is struggling from long range, with a career-low 0.4 made threes per game, while hitting just 25.8 percent from beyond the arc.  \nMitchell Robinson, KnicksAlthough he continues to work through recurring injury trouble, Robinson is providing a formidable presence when available. He has played in 27 of the squad's 39 games and is averaging 4.5 points, 8.9 rebounds, 1.1 assists, 0.9 steals and 1.1 blocks in just 19.4 minutes per game. Despite playing so few minutes, he ranks 12th in the league in rebounds per game, including pulling down a career-best 4.7 offensive rebounds per game. Tim Hardaway, NuggetsHardaway is having one of the best seasons of his career, as he is thriving since joining the Nuggets. He is shooting career highs of 46.3 percent from the field, including 41.4 percent from long range, while averaging 13.9 points, 2.4 rebounds and 1.3 assists per game. He has reached the 20-point mark eight times in 39 appearances, providing a great offensive boost out of a bench role. Isaiah Stewart, PistonsDespite playing mostly off the bench and averaging just 23.7 minutes per outing, Stewart ranks second in the league with 2.1 blocks per game. He is also averaging over 10 points per game for a third time in his career and continues to do a good job on the glass, averaging at least 5.5 rebounds for a sixth straight season. His grit and intensity add to his statistical contributions and make him a game-changing presence when he gets on the court. \nReed Sheppard, RocketsAfter averaging just 4.4 points in 12.6 minutes per game through his rookie year, Sheppard has taken an impressive leap, averaging 12.9 points, 2.6 rebounds, 3.2 assists and 1.4 steals in 25.4 minutes per game this season. He has come off the bench in 33 of his 37 appearances and scored at least 15 points in 10 of those outings. Additionally, he stepped up in one of his four starts by dropping a season-high 31 points to go with nine rebounds, five assists, a steal and two blocks. Keldon Johnson, SpursJohnson continues to provide a formidable offensive presence off the bench, averaging 13.6 points and a career-high 6.3 rebounds on the campaign. He has also shown notable improvement in his shot selection this season, hitting 56.5 percent from the field, after averaging 46.5 percent shooting over the last five seasons. With a deep roster around him, his ability to keep focus and be ready to step up when called upon is key, especially considering he has shown the potential to handle more responsibility at times.  Naz Reid, TimberwolvesReid has been one of the league's top bench players for years now but is currently pushing the standard by averaging career highs of 14.6 points, 6.2 rebounds, 2.4 assists and 0.9 steals in 26.5 minutes per game, which is 1.0 fewer minutes than he saw last season. His ability to score from deep, averaging a career-high 2.4 made threes per game while shooting 38.1 percent from deep as a big man, makes him one of the more unique players in the league and throws a different look at opponents, who first have to go up against the more traditional starting frontcourt of Julius Randle and Rudy Gobert. \nCaleb Love, Trail BlazersLove got off to a quiet start to the season but has upped his game lately, averaging 16.8 points, 3.4 rebounds and 3.0 assists over the last 12 outings. He is also shooting 40.4 percent from deep over that span, knocking down a whopping 3.5 threes per game. The rookie is becoming a go-to scoring option when on the floor and is also showing the ability to help set the pace for the squad with his playmaking. He may have more competition for minutes if/when Scoot Henderson gets back to action, but this recent stretch has likely been enough for him to secure a stable role in the long run.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Basketball: 10 reserves to start in lineups - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/82fe74cf-befd-4461-ac5c-29b3e43bd996/thumbnail/1200x675/6b5f45a36f25b998acb68dceb20cde21/bobby-portis-milwaukee-bucks-cbs.jpg"
      ],
      "datePublished": "2026-01-14T20:19:21.000Z",
      "dateModified": "2026-01-14T20:19:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 MLB spring training start dates: Pitchers and catchers report to Florida, Arizona next month - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/2026-mlb-spring-training-start-dates-pitchers-catchers-florida-arizona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/c1edd601-5da5-4ae2-989a-ee5d252ffdb8/thumbnail/1200x675/4ac9f0fba6b63cebbf6eeca60251f463/reds-getty.png",
    "tag": "Sports",
    "date": "2026-01-14T21:08:35.000Z",
    "description": "\n\n\n    \n                                    The schedule begins earlier this year thanks to the World Baseball Classic\n        \n                      ",
    "body": "\n\n\n    \n                                    The schedule begins earlier this year thanks to the World Baseball Classic\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 14, 2026\n                            \n                    at\n    4:07 pm ET\n                        \n                •\n            \n            1 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Major League Baseball's offseason is winding toward completion. Players will soon be on their way to spring training camps in Arizona and Florida and pitchers and catchers are officially due to report in less than a month. Soon thereafter, exhibition games will get underway, and before long it'll be Opening Day 2026 (Thursday, March 26).While the clubs makes their own determination on when their players should arrive to spring training and get down to business, those dates generally fall within a tight window. This is a World Baseball Classic year, so reporting dates a little earlier than usual, as those players have to get ready sooner. Every team will open spring training the week of Feb. 9 this year.\nBelow, you'll find the spring training reporting dates and workout schedules for each club, broken down by their respective exhibition season leagues, be it the Cactus League (Arizona) or Grapefruit League (Florida).2026 Cactus League spring training reporting datesTeamPitchers and catchers first workoutFirst full squad workout\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Arizona\n            \n                \n    \n    Tues., Feb. 10Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Chi. Cubs\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Chi. White Sox\n            \n                \n    \n    Tues., Feb. 10Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Cincinnati\n            \n                \n    \n    Weds., Feb. 11Mon., Feb 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Cleveland\n            \n                \n    \n    Thurs., Feb. 12Tues., Feb 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Colorado\n            \n                \n    \n    Thurs., Feb. 12Tues., Feb. 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Kansas City\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            L.A. Angels\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            L.A. Dodgers\n            \n                \n    \n    Fri., Feb. 13Tues., Feb. 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Milwaukee\n            \n                \n    \n    Thurs., Feb. 12Tues., Feb. 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Athletics\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            San Diego\n            \n                \n    \n    Weds., Feb. 11Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            San Francisco\n            \n                \n    \n    Tues., Feb. 10Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Seattle\n            \n                \n    \n    Thurs., Feb. 12Tues., Feb. 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Texas\n            \n                \n    \n    Tues., Feb. 1oSun., Feb. 152026 Grapefruit League spring training reporting datesTeamPitchers and catchers first workoutFirst full squad workout\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Atlanta\n            \n                \n    \n    Tues., Feb. 12Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Baltimore\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Boston\n            \n                \n    \n    Tues., Feb. 10Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Detroit\n            \n                \n    \n    Weds., Feb. 11Sun., Feb. 15\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Houston\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Miami\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Minnesota\n            \n                \n    \n    Thurs., Feb. 12Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            N.Y. Mets\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            N.Y. Yankees\n            \n                \n    \n    Thurs., Feb. 12Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Philadelphia\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Pittsburgh\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            St. Louis\n            \n                \n    \n    Thurs., Feb. 12Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Tampa Bay\n            \n                \n    \n    Thurs., Feb. 12Tues., Feb. 17\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Toronto\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n        \n                            \n    \n                                                \n                    \n                \n    \n                                                                            Washington\n            \n                \n    \n    Weds., Feb. 11Mon., Feb. 16\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 MLB spring training start dates: Pitchers and catchers report to Florida, Arizona next month - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/c1edd601-5da5-4ae2-989a-ee5d252ffdb8/thumbnail/1200x675/4ac9f0fba6b63cebbf6eeca60251f463/reds-getty.png"
      ],
      "datePublished": "2026-01-14T21:08:35.000Z",
      "dateModified": "2026-01-14T21:08:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home of former NASCAR driver Greg Biffle burglarized weeks after his death - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nascar/news/home-of-former-nascar-driver-greg-biffle-burglarized-weeks-after-his-death/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/14/26d21c6b-ca42-46d8-801b-e9efc7467149/thumbnail/1200x675/0edc9cfc6851bd9677bff7ab1104bb37/gettyimages-1405109674-2.jpg",
    "tag": "Sports",
    "date": "2026-01-14T23:57:30.000Z",
    "description": "\n        The home of former NASCAR driver Greg Biffle, who died in a December plane crash, was burglarized around Jan. 7-8, according to the Associate",
    "body": "\n        The home of former NASCAR driver Greg Biffle, who died in a December plane crash, was burglarized around Jan. 7-8, according to the Associated Press. The alleged burglary was reported to the Iredell County Sheriff's Office on Jan. 8, and the Mooresville, North Carolina, home was last known to be secure on the afternoon of Jan. 7.According to the report, someone allegedly forced their way into the home and stole $30,000 in cash in addition to a backpack, guns and memorabilia. No one was home when the alleged crime occurred, and no arrests have been made although police are investigating.\"We're working the case,\" said Sheriff Darren Campbell. \"We are waiting on some digital evidence.\"On Dec. 18, Biffle was among six people killed in a plane crash at nearby Statesville Regional Airport. Three of Biffle's family members -- wife Emily and children Emma and Ryder -- also died in the accident. The plane took off from the airport around 10 a.m. before returning just 15 minutes later, when it crashed while attempting to land.\nAt this time, the exact cause of the crash is unknown. Biffle and two others on board had a pilot's license, but authorities are still uncertain about which one was flying the plane that day.\"NASCAR is devastated by the tragic loss of Greg Biffle, his wife Cristina, daughter Emma, son Ryder, Craig Wadsworth and Dennis and Jack Dutton in a fatal plane crash,\" NASCAR said in a lengthy statement. \"Greg was more than a champion driver, he was a beloved member of the NASCAR community, a fierce competitor, and a friend to so many. His passion for racing, his integrity, and his commitment to fans and fellow competitors alike made a lasting impact on the sport.\"\nBiffle, 55, totaled 515 races in his 16-year NASCAR Cup Series career. He piled up 19 wins and 175 top-10 finishes. Biffle competed numerous times for the Cup Series championship, and his best series finish came in 2005 when he finished second behind Tony Stewart.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home of former NASCAR driver Greg Biffle burglarized weeks after his death - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/14/26d21c6b-ca42-46d8-801b-e9efc7467149/thumbnail/1200x675/0edc9cfc6851bd9677bff7ab1104bb37/gettyimages-1405109674-2.jpg"
      ],
      "datePublished": "2026-01-14T23:57:30.000Z",
      "dateModified": "2026-01-14T23:57:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL head coach interview requests tracker: Updates, news and rumors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-head-coach-interview-requests-tracker-steelers-mike-tomlin-replacement/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/13/5823e34a-e7a1-4e36-9888-6463355613f6/thumbnail/1200x675/573aef2734cd713cb90792a07585fd5b/chrisshula.png",
    "tag": "Sports",
    "date": "2026-01-14T20:39:01.000Z",
    "description": "\n        The end of the regular season doesn't just close the book on another year in the NFL. For some franchises, it also coincides with a reevaluat",
    "body": "\n        The end of the regular season doesn't just close the book on another year in the NFL. For some franchises, it also coincides with a reevaluation of the entire organization, which can result in various firings. While some clubs made changes midseason, the more common time we see head coaches and GMs be let go comes the day after the regular season concludes, better known as Black Monday. At that juncture, we saw six teams move off of their head coach: Falcons, Browns, Cardinals, Raiders, Ravens, and Dolphins. More recently, Steelers entered the coaching carousel after Mike Tomlin stepped down. Pair that with the two head coaching vacancies (Giants and Titans) that were already open due to firings during the season, and you have over 25% of the league looking for a new head coach. The Falcons and Dolphins also entered this period looking for a new GM as well. So who fills all of these positions? With the Band-Aid ripped off, those teams are now beginning the process of finding their next leader. Below, we'll chronicle that pursuit by tracking the latest interview requests by each team. Follow live updates on NFL coaching and GM changes, firings and rumors.Head coaches\n                            \n    \n                                                \n                    \n    Arizona CardinalsPrevious head coach: Jonathan GannonAfter three seasons on the job, the Cardinals decided to move on from Jonathan Gannon. He went 15-36 as the organization's head coach, which included a 3-14 season in 2025. Arizona ended the year on a nine-game losing streak. The Cardinals have made the playoffs once in the last 10 seasons. \nRequestedMike LaFleur -- Rams offensive coordinator (ESPN)Vance Joseph -- Broncos defensive coordinator (ESPN)Robert Saleh -- 49ers defensive coordinator (NBC)Antony Weaver -- Dolphins defensive coordinator (ESPN)Klint Kubiak -- Seahawks offensive coordinator (Sports Illustrated)Thomas Brown -- Patriots passing game coordinator (NFL Media)Matt Nagy -- Chiefs offensive coordinator (NFL Media)Raheem Morris -- former Falcons head coach (ESPN)Jeff Hafley -- Packers defensive coordinator (ESPN)Arthur Smith -- Steelers offensive coordinator (NFL Media)Matt Burke -- Texans defensive coordinator (The Athletic)Jesse Minter -- Chargers defensive coordinator (Sports Illustrated)Chris Shula -- Rams defensive coordinator (Sports Illustrated)Mike LaFleur -- Rams offensive coordinator (ESPN)\n                            \n    \n                                                \n                    \n    Atlanta FalconsPrevious head coach: Raheem MorrisAfter two seasons on the job, the Falcons fired Morris in the aftermath of a disappointing 2025 campaign. Atlanta finished 8-9 for the second season in a row and was third in the NFC South. Completed interviewsMike McDaniel -- former Dolphins head coach (team announcement)John Harbaugh -- former Ravens head coach (team announcement)Kevin Stefanski -- former Browns head coach (team announcement)Aden Durde -- Seahawks defensive coordinator (team announcement)Klint Kubiak -- Seahawks offensive coordinator (team announcement)Anthony Weaver -- Dolphins defensive coordinator (team announcement)Interview requestsVance Joesph -- Broncos defensive coordinator (The Athletic)Jeff Hafley -- Packers defensive coordinator (ESPN)Robert Saleh -- 49ers defensive coordinator (ESPN)Ejiro Evero -- Panthers defensive coordinator (NFL Media)Antonio Pierce -- former Raiders head coach (NFL Media)\n                            \n    \n                                                \n                    \n    Baltimore RavensPrevious head coach: John HarbaughIn somewhat of a stunning turn of events, Baltimore elected to part ways with John Harbaugh after 18 seasons on the job. Harbaugh was the NFL's second-longest tenured head coach after Mike Tomlin in Pittsburgh, who knocked him out of the playoffs with a Week 18 victory that may have clinched his departure. While this is the end of an era in Baltimore, the Ravens suddenly become the top available job in the NFL simply due to the presence of two-time NFL MVP Lamar Jackson. Completed interviewsVance Joseph -- Broncos defensive coordinator (team announcement)David Webb -- Broncos quarterbacks coach (team announcement)Klint Kubiak -- Seahawks offensive coordinator (team announcement)Jim Schwartz -- Browns defensive coordinator (team announcement)Brian Flores -- Vikings defensive coordinator (team announcement)Anthony Weaver -- Dolphins defensive coordinator (team announcement)Kliff Kingsbury -- former Commanders offensive coordinator (team announcement)Matt Nagy -- Chiefs offensive coordinator (team announcement)Kevin Stefanski -- former Browns head coach (team announcement)Jesse Minter -- Chargers defensive coordinator (team announcement)Interview requestsRobert Saleh -- 49ers defensive coordinator (ESPN)Joe Brady -- Bills offensive coordinator (NFL Media)Mike McDaniel -- former Dolphins head coach (NFL Media)Nate Scheelhaase -- Rams pass game coordinator (ESPN)Chris Shula -- Rams defensive coordinator (Sports Illustrated)Joe Brady -- Bills offensive coordinator (NFL Media)\n                            \n    \n                                                \n                    \n    Cleveland BrownsPrevious head coach: Kevin StefanskiCleveland moved on from Kevin Stefanski after a 5-12 season in 2025 that saw the franchise finish last in the AFC North. Stefanski coached the Browns for the last six seasons and won two Coach of the Year awards, but was 45-56 in his 101 regular-season games. \nCompleted interviewsMike McDaniel -- former Dolphins head coach (team announcement)Aden Durde -- Seahawks defensive coordinator (team announcement)Dan Pitcher -- Bengals offensive coordinator (team announcement)Jim Schwartz -- Browns defensive coordinator (team announcement)Tommy Rees -- Browns offensive coordinator (team announcement)Todd Monken -- Ravens offensive coordinator (team announcement)Interview requestsNate Scheelhaase -- Rams passing game coordinator (NFL Media)Jesse Minter -- Chargers defensive coordinator (NFL Media)\n                            \n    \n                                                \n                    \n    Las Vegas RaidersPrevious head coach: Pete CarrollPete Carroll proved to be one-and-done in Las Vegas after the 74-year-old was unable to lift the organization to respectability in 2025. The Raiders finished with the worst record in the NFL (3-14) and now possess the No. 1 overall pick at the 2026 NFL Draft. General manager John Spytek and minority owner Tom Brady are expected to spearhead the coaching search. Completed interviewsKevin Stefanski -- former Browns head coach (team announcement)Matt Nagy -- Chiefs offensive coordinator (team announcement)Davis Webb -- Broncos quarterbacks coach (team announcement)Vance Joseph -- Broncos defensive coordinator (team announcement)Klint Kubiak -- Seahawks offensive coordinator (team announcement)Interview requestsNate Scheelhaase -- Rams passing game coordinator (NFL Media)Mike LaFleur -- Rams offensive coordinator (ESPN)Mike LaFleur -- Rams offensive coordinator (ESPN)Ejiro Evero -- Panthers defensive coordinator (NFL Media)Jesse Minter -- Chargers defensive coordinator (Sports Illustrated)Jeff Hafley -- Packers defensive coordinator (NFL Media)\n                            \n    \n                                                \n                    \n    Miami DolphinsPrevious head coach: Mike McDanielThe Dolphins waited a bit longer to make a decision regarding Mike McDaniel's future with the organization, firing him on the Thursday afte the regular season. Initially, it looked as if McDaniel had saved his job, but Stephen Ross, after a meeting this week to discuss the season, decided to cut bait and go through a total reset. It's slated to be transformative offseason in Miami, as it now needs a new head coach and general manager and is likely to move on from Tua Tagovailoa. Completed interviewsKevin Stefanski -- former Browns head coach (team announcement)Klint Kubiak -- Seahawks offensive coordinator (team announcement)Jeff Hafley -- Packers defensive coordinator (team announcement)Interview requestsPatrick Graham -- Raiders defensive coordinator (NFL Media)Jesse Minter -- Chargers defensive coordinator (Sports Illustrated)Robert Saleh -- 49ers defensive coordinator (NFL Media)Kelvin Sheppard -- Lions defensive coordinator (NFL Media)Chris Shula -- Rams defensive coordinator (NFL Media)Anthony Campanile -- Jaguars defensive coordinator (ESPN)\n                            \n    \n                                                \n                    \n    New York GiantsPrevious head coach: Brian DabollNew York fired Daboll midway through the 2025 season after a 2-8 start to the year. He'd been at his post since 2022 and went 20-40-1 over his tenure in the regular season. General manager Joe Schoen will remain with the organization and lead the search. \nInterview requestsJohn Harbaugh -- former Ravens head coach (The Athletic)Mike Kafka -- Giants interim head coach and offensive coordinatorVance Joseph -- Broncos defensive coordinator (ESPN)Kevin Stefanski -- former Browns head coach (NFL Media)Klint Kubiak -- Seahawks offensive coordinator (Sports Illustrated)Mike McCarthy -- former Cowboys head coach (ESPN)Lou Anarumo -- Colts defensive coordinator (NFL Media)Raheem Morris -- former Falcons head coach (ESPN)Antonio Pierce -- former Raiders head coach (ESPN)Darren Rizzi -- Broncos special teams coordinator (ESPN)Chris Shula -- Rams defensive coordinator (Sports Illustrated)\n                            \n    \n                                                \n                    \n    Pittsburgh SteelersPrevious head coach: Mike TomlinIt's the end of an era in Pittsburgh. After falling to the Texans during Wild Card Weekend, Mike Tomlin stepped down as head coach after 19 seasons leading the franchise. Interview requestsNate Scheelhaase -- Rams passing game coordinator (ESPN)Chris Shula -- Rams defensive coordinator (ESPN)Anthony Weaver -- Dolphins defensive coordinator (The Athletic)Brian Flores -- Vikings defensive coordinator (ESPN)Jesse Minter -- Chargers defensive coordinator (NFL Media)\n                            \n    \n                                                \n                    \n    Tennessee TitansPrevious head coach: Brian CallahanTennessee fired Callahan in mid-October after a 1-5 start to the season. The 41-year-old coach was hired in 2024 and went 4-19 over his tenure. Completed interviewsLou Anarumo -- Colts defensive coordinator (team announcement)Steve Spagnuolo -- Chiefs defensive coordinator (team announcement)Matt Nagy -- Chiefs offensive coordinator (team announcement)Vance Joseph -- Broncos defensive coordinator (team announcement)Kevin Stefanski -- former Browns head coach (team announcement)Mike McCoy -- Titans interim head coach (team announcement)Jason Garrett -- former Cowboys head coach (team announcement)Interview requestsRaheem Morris -- former Falcons head coach (ESPN)Jeff Hafley -- Packers defensive coordinator (The Athletic)Arthur Smith -- Steelers offensive coordinator (The Athletic)Robert Saleh -- 49ers defensive coordinator (The Athletic)Kliff Kingsbury -- former Commanders offensive coordinator (NFL Media)Jesse Minter -- Chargers defensive coordinator (ESPN)Chris Shula -- Rams defensive coordinator (ESPN)Mike McCarthy -- former Packers and Cowboys head coach (NFL Media) Mike McDaniel -- former Dolphins head coach (NFL Media) Brian Daboll -- former Giants head coach (NFL Media)John Harbaugh -- former Ravens head coach (NFL Media)General managers\n                            \n    \n                                                \n                    \n    Atlanta FalconsPrevious GM: Terry FontenotAtlanta cleaned house after the 2025 season, not only firing Raheem Morris but also parting ways with general manager Terry Fontenot. He had been with the organization in this GM role since 2021 and was able to add some intriguing skill position players like Bijan Robinson and Drake London, but was unable to get a concrete plan in place at quarterback. A clear plan at that position will likely be the main emphasis for owner Arthur Blank, and newly hired president of football Matt Ryan as they comb through candidates this time around. \nInterview requestsIan Cunningham -- Bears assistant general manager (CBS Sports lead NFL insider Jonathan Jones)Josh Williams -- 49ers director of scouting and football operations (CBS Sports lead NFL insider Jonathan Jones)\n                            \n    \n                                                \n                    \n    Miami DolphinsPrevious GM: Chris GrierIt was a rather seismic decision by the Dolphins and Grier to mutually part ways during the 2025 season, simply due to how long his tenure had been with the organization. He started as a scout in 2000 and stayed with the franchise ever since, ascending to GM in 2016. Miami made the playoffs just three times over his 10-year stint as GM, and has been under .500 in each of the last two seasons, due to an inability to build a stable roster. HIRED: Jon-Eric Sullivan -- Packers VP of player personnel. Sullivan is a long-time Green Bay Packers executive who started with the team in 2003 and has worked as the vice president of player personnel since 2022.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL head coach interview requests tracker: Updates, news and rumors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/13/5823e34a-e7a1-4e36-9888-6463355613f6/thumbnail/1200x675/573aef2734cd713cb90792a07585fd5b/chrisshula.png"
      ],
      "datePublished": "2026-01-14T20:39:01.000Z",
      "dateModified": "2026-01-14T20:39:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]