[
  {
    "title": "Use FanDuel promo code, get $300 bonus bets by targeting Memphis-Rice, Dodgers-Blue Jays, Blazers-Nuggets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/use-fanduel-promo-code-get-300-bonus-bets-memphis-rice-dodgers-blue-jays-blazers-nuggets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-31T20:56:47.000Z",
    "description": "\n        The latest FanDuel promo code offers new users $300 in bonus bets if their first wager of $5 or more wins. That offer provides sports bettors",
    "body": "\n        The latest FanDuel promo code offers new users $300 in bonus bets if their first wager of $5 or more wins. That offer provides sports bettors an opportunity to target Dodgers vs. Blue Jays in Game 6 of the World Series, which begins at 8 p.m. ET on Friday. According to the latest MLB odds from FanDuel Sportsbook, the Dodgers are -142 money line favorites, while the over/under for total runs scored is 7.5. There are also eight NBA games on Friday's sports schedule, including Nuggets vs. Trail Blazers at 10 p.m. ET, and three college football matchups. SportsLine's model is backing the Nuggets covering the spread as 4.5-point favorites and targeting the over on total points (48.5) in Memphis vs. Rice. Claim the latest FanDuel promo code here:Check out our FanDuel promo code review for full details.The SportsLine Projection Model simulates every MLB game 10,000 times. It entered the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Best Friday picksMemphis vs. Rice: Over 48.5 total points (-110)Blue Jays +118 vs. DodgersNuggets (-4.5) vs. Trail Blazers (-115)Combining the model's three picks into a three-leg parlay at FanDuel would result in a payout of +678 (risk $100 to win $678). Bet it at FanDuel here:\nMemphis vs. Rice: Over 48.5 total points (-110)Memphis ranks third in the American Conference in scoring offense (37.6) and fifth in total offense (439.1). Senior quarterback Brendon Lewis has 1,644 passing yards and 10 passing touchdowns. On the ground, he's added 475 rushing yards and seven touchdowns. Meanwhile, Rice junior running back Quinton Jackson has logged 655 rushing yards and six touchdowns. The over has cashed in three of the last five games for Memphis, and the over has cleared in two straight games with the Owls. SportsLine's model expects that to continue, as the over hits in 70% of simulations. Bet the Memphis vs. Rice over at FanDuel Sportsbook:Blue Jays +118 vs. DodgersThe Blue Jays have a chance to close out the series in front of their home crowd after taking two straight games on the road. Toronto is 19-8 as the home underdog and 59-30 as the home team. They are also 62-41 following a victory. Considering Toronto has momentum and home-field advantage, SportsLine's model has the Blue Jays winning outright in 52% of simulations. Bet the Blue Jays moneyline at FanDuel Sportsbook:Nuggets (-4.5) vs. Trail Blazers (-115)The Nuggets are 3-0 ATS as the favorite and 3-1 ATS in all games thus far this season. Denver has beaten the Trail Blazers in nine of the last 11 games. Center Nikola Jokic is second in the league in rebounds (14.5) and first in assists (11.3) with 20.3 points per game. SportsLine's model has Denver covering the spread in 53% of simulations. Bet the Nuggets to cover at FanDuel Sportsbook:\nWant more NBA picks?You've seen the model's best bets for Friday. Now, get against the spread, total and money-line picks for every NBA game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use FanDuel promo code, get $300 bonus bets by targeting Memphis-Rice, Dodgers-Blue Jays, Blazers-Nuggets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/19/28d4bef1-37d2-43a9-8697-1e28a198ca22/thumbnail/1200x675/e4248d06ca75381ba150a3e37d00518a/fanduel-new-promo.jpg"
      ],
      "datePublished": "2025-10-31T20:56:47.000Z",
      "dateModified": "2025-10-31T20:56:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing North Carolina-Syracuse, college football on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/use-betmgm-bonus-code-cbssports-get-150-bonus-north-carolina-syracuse-college-football-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg",
    "tag": "Sports",
    "date": "2025-10-31T21:13:14.000Z",
    "description": "\n        Take advantage of a busy Friday on the sports calendar by using BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if you",
    "body": "\n        Take advantage of a busy Friday on the sports calendar by using BetMGM bonus code CBSSPORTS to receive up to $1,500 in bonus bets back if your first qualifying wager loses or $150 in bonus bets if your first $10 wager wins. The college football schedule features a trio of games, including Rice vs. No. 25 Memphis at 7 p.m. ET, Syracuse vs. North Carolina and Bill Belichick at 7:30 p.m. ET, and Louisiana Tech vs. Sam Houston on CBS Sports Network at 8 p.m. ET.Picks from all three of those games are among our college football best bets at BetMGM Sportsbook today from the SportsLine Projection Model and our team of experts. Get the newest BetMGM bonus code and take advantage of one of the best sportsbook promos. Get started now:The SportsLine Projection Model simulates every NFL game 10,000 times. The model enters Week 9 on a sizzling 45-28 run on top-rated picks dating back to 2024.   The model enters the 2025-26 NBA season on a sizzling 160-118 roll on all top-rated NBA picks, returning nearly $4,000. Since its inception, it has also generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks, and it enters Week 10 on a profitable 47-33 combined run on money-line and over/under college football picks since the beginning of 2024. Anybody following its NFL betting, college football betting or NBA betting picks at sportsbooks and on betting sites could have seen strong returns.Friday's best bets at BetMGMOver 48.5 points in Rice vs. Memphis (-110) Over 44.5 points in Syracuse vs. North Carolina (-115)Sam Houston +17.5 vs. Louisiana Tech (-125)Combining these three picks into a Friday college football parlay at BetMGM would result in a payout of +621 (risk $100 to win $621). Bet it at BetMGM here:\nOver 48.5 points in Memphis vs. Rice (-110)The Memphis Tigers are coming off a significant win over USF that vaulted them back into the top 25 and consideration for the Group of Five spot in the College Football Playoff. Ryan Silverfield's offense is averaging 37.6 points per game (15th in the nation) and has a dynamic running game spearheaded by quarterback Brendon Lewis and running backs Sutton Smith and Gregory Desrosiers, with all three rushing for at least 400 yards and six touchdowns. Meanwhile, Rice is coming off its best offensive performance of the season in a 37-34 win over Connecticut in double-overtime. The Owls rushed for 300 yards in the win and are now averaging 226.0 yards per game on the ground. The model says the Over hits in 70% of simulations. Back the Over at BetMGM Sportsbook now:Over 44.5 in Syracuse vs. North Carolina (-115)Bill Belichick made a name for himself first as a defensive coordinator for the Giants and then as a defensive-minded head coach for the Patriots. He's starting to establish that brand at North Carolina, but the Tar Heels did give up 34 points or more against three of the five power conference opponents they've faced. Meanwhile, the Orange are giving up 31.6 points per game and haven't held any of their last four opponents under 30. The model predicts that the Over hits in 70% of simulations. Back the Over at BetMGM Sportsbook now:Sam Houston +17.5 vs. Louisiana Tech (-125)The Bearkats won 10 games last season in just their second season in the FBS, but lost head coach K.C. Keeler to Temple and are 0-7 in Phil Longo's first year at the helm. However, Louisiana Tech has lost outright as 5.5-point favorites in each of its last two games. Sam Houston earned its first cover of the season on Oct. 9 and has had two weeks to prepare for this matchup. The model says it covers the spread in 71% of simulations. Back Sam Houston at BetMGM Sportsbook now:\nWant more college football picks for Week 10?You've seen some of the model's best bets for Friday. Now, get against the spread, total and money-line picks for every college football game on the schedule, all from the model that's simulated every game 10,000 times.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use BetMGM bonus code CBSSPORTS, get $150 bonus by backing North Carolina-Syracuse, college football on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/28/b05c234a-7b13-4f54-83a1-ac8c8347d509/thumbnail/1200x675/47f4cfc526b522ab14eb17f7842b7e45/betmgm-promo.jpg"
      ],
      "datePublished": "2025-10-31T21:13:14.000Z",
      "dateModified": "2025-10-31T21:13:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dustin Poirier opens up about life after UFC: 'I always have something to do' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/dustin-poirier-discusses-retirement-life-after-fighting-in-ufc-i-always-have-something-to-do/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/51ecb14d-bc0c-4cdb-825b-8a8eaa96d060/thumbnail/1200x675/8780da3b474560e2aad67016196b4b46/dustin-poirier-retirement-flag.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:50:32.000Z",
    "description": "\n        It may be hard on UFC fans to know they won't be seeing Dustin Poirier in the Octagon again, but it's been harder than anyone can imagine on ",
    "body": "\n        It may be hard on UFC fans to know they won't be seeing Dustin Poirier in the Octagon again, but it's been harder than anyone can imagine on Poirier. Poirier hung up his gloves following his UFC 318 loss to Max Holloway, a retirement that was planned before the event. Since retiring, Poirier has stated on social media that \"a part of me has died\" by no longer being an active fighter.Speaking with CBS Sports, Poirier expanded on how he has dealt with the struggles that come with retirement, even as he does not regret his decision.\"Nothing is ever going to fill that hole,\" Poirier said. \"But, keeping my mind busy ... I've been really trying to focus on staying busy. I'm traveling a lot for different things, spending time with my family, and doing a lot of stuff around the house. Like I've been saying, these days are long. When I'm not waking up running three miles, going to the gym, and having somewhere else to be from fighting, the days are long. You have a lot of time to overthink and sit back. I'm just trying to stay busy, man.\"... A lot of yard work. The honey-do list is good because I can get back from traveling, knock a few things off, and then travel again for something. When I come back, the list is filled up again. I always have something to do.\"\nOne of the ways Poirier is staying busy in his post-fighting career is participating in the current Bud Light \"Call Center\" campaign. Alongside Bruce Buffer, Poirier is \"giving UFC fans ages 21+ the chance to call Bruce and Dustin themselves and request to ditch the desk for tickets with their crew at UFC 322.\" Poirier has also transitioned to occasionally working as an analyst for UFC broadcasts. One might believe that being around the sport, discussing fights, but not entering the Octagon, may further complicate the emotional pain of knowing his in-cage career is over, but Poirier believes the work actually helps him connect to the thing he misses so badly.\"If anything, it makes things easier,\" Poirier said. \"I love doing the analyst work. I'd honestly like to do more of that if the opportunity were to arise. Just to stay a voice in the sport and be around the people behind the scenes, and the people who work for the UFC. I've known these people for decades of my life. So, just being around them, even though I'm not fighting that night, I'm still in the mix, I'm still going through fight week. It just helps me out.\n\"I'm never going to get those feelings [from fighting] again. All eyes on you, someone is trying to hurt you, and you're trying to feed your family. That's a whole different thing.\"Poirier retired with a 30-10 record, losing four of his final six fights against some of the toughest competition in the world. Despite a rocky finish to his career, Poirier was a beloved fighter who was always up to bring excitement to the cage.For someone who has lived and breathed fighting, and fought in such an exciting style, the decision to retire was not an easy one. The difficulty in stepping away was only amplified for Poirier by a belief that he can still compete at an elite level.\n\"It's a slow drip,\" Poirier said. \"I still think I can compete and beat the best guys in the world right now. It's a slow drip, though. Everything going on in life. My wife being pregnant, my daughter getting older, having 50-something fights, and a lot of them were crazy fights. It's just trying to look out for myself for the future.\"Poirier has said there is one fight that would get him back in the game, a bout with fellow fan-favorite brawler Nate Diaz, preferably in Zuffa Boxing.\nPoirier and Diaz were scheduled to fight at UFC 230 in November 2018, but the bout fell through. Both sides have blamed the other for the fight falling apart. Poirier blamed Diaz for extending negotiations with the UFC, while Diaz has claimed Poirier withdrew from the fight due to injuries.\n\"I would have fought Nate in MMA as well,\" Poirier said. \"He knows that. I accepted it many times. He always talked trash, and the fight slipped away. I had to be the fall guy for one of the times the fight slipped away. It's a mess working with him behind the scenes. I just always wanted to beat his ass, honestly.\"I would probably take it, but we'll see. It depends on the date and what me and my wife have going on. But that's a fight I've wanted before I retired and I've accepted it multiple times.\"While the potential Diaz fight could motivate Poirier to come out of retirement for one last dance, Poirier does not find him in the category of other retired or long inactive fighters, such as Jon Jones and Conor McGregor, to fight at the UFC's planned June card on the White House lawn.\n\"For me, it's awesome and incredible and a huge part of history to set up an Octagon on the lawn of the White House,\" Poirier said. \"But it's never been, like, fighting in Madison Square Garden was cool because it's such a historic place. But, like, arenas or places to fight are never going to bring me back. It has to be an opponent or a reason to fight. Venues are just extras.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dustin Poirier opens up about life after UFC: 'I always have something to do' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/51ecb14d-bc0c-4cdb-825b-8a8eaa96d060/thumbnail/1200x675/8780da3b474560e2aad67016196b4b46/dustin-poirier-retirement-flag.jpg"
      ],
      "datePublished": "2025-10-31T19:50:32.000Z",
      "dateModified": "2025-10-31T19:50:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mavericks' Anthony Davis out at least two games after suffering calf injury - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/anthony-davis-injury-mavericks-star-to-miss-two-games-with-left-calf-strain/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/c5f751af-9da5-46f6-b55b-d8fb0b0252f8/thumbnail/1200x675/784c380ef026c72fb711df6c0cbc21a4/untitled-design-74.png",
    "tag": "Sports",
    "date": "2025-10-31T23:34:07.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Dallas Mavericks star forward Anthony Davis will m",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Dallas Mavericks star forward Anthony Davis will miss his team's next two games after suffering a left calf strain against the Indiana Pacers, the team announced on Friday. Davis will be re-evaluated after his team faces the Houston Rockets on Monday.\"The Dallas Mavericks announced today that an MRI revealed a low-grade left calf strain for forward/center Anthony Davis,\" The Mavericks said in a statement. \"Davis sustained the injury in the first quarter of the team's game against the Indiana Pacers on Wednesday and was held out of the remainder of the game for precautionary reasons.\"Davis logged just seven minutes against the Pacers before exiting the game with the injury. Davis finished with four points, four rebounds and a steal and did not return after being ruled out for the remainder of the game at halftime.\n\"He tried to return -- didn't want to take any chances,\" Mavericks coach Jason Kidd told reporters after the game against the Pacers. \"We'll see how he feels moving forward.\"Coming into the game against the Pacers, Davis was listed as probable on the injury report because of bilateral Achilles tendinopathy. Davis, the centerpiece of the trade that sent Luka Dončić to the Los Angeles Lakers, appeared in just nine games with his new team after being traded.\nDavis is averaging 20.8 points, 10.2 rebounds and 2.2 assists in 29.8 minutes per game. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mavericks' Anthony Davis out at least two games after suffering calf injury - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/c5f751af-9da5-46f6-b55b-d8fb0b0252f8/thumbnail/1200x675/784c380ef026c72fb711df6c0cbc21a4/untitled-design-74.png"
      ],
      "datePublished": "2025-10-31T23:34:07.000Z",
      "dateModified": "2025-10-31T23:34:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football 2025 Week 9 DFS lineups: Jamey Eisenberg's most rostered, must have player on the slate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/fantasy-football-2025-week-9-dfs-lineups-jamey-eisenbergs-most-rostered-must-have-player-on-the-slate/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/19/78d9ef3c-d5c7-4538-b313-f020949a527c/thumbnail/1200x675/3cb68bdb2a1a8ef9ac8cedb4b6e75b95/usatsi-27369185-rashee-rice-chiefs-wr-td-1q-2025-1920.jpg",
    "tag": "Sports",
    "date": "2025-10-31T20:29:11.000Z",
    "description": "\n    \n    \n            \n    \n        The best game in Week 9 is Kansas City at Buffalo, and my favorite DFS player in this matchup, based on his upsid",
    "body": "\n    \n    \n            \n    \n        The best game in Week 9 is Kansas City at Buffalo, and my favorite DFS player in this matchup, based on his upside and cost, is Rashee Rice. I want to use Rice in as many lineups as possible.He's $7,600 on DraftKings and $8,200 on FanDuel, and Rice will hopefully stay hot against the Bills. He has now played two games following his six-game suspension to open the season, and he has 16 catches for 135 yards and three touchdowns on 19 targets over that span. Rice has faced the Bills twice in his career, and he scored 18.2 PPR points in one of those outings. And Buffalo has struggled with No. 1 receivers this season as Zay Flowers, Tyreek Hill, Stefon Diggs, Drake London, and Tetairoa McMillan all scored at least 15.9 PPR points.Patrick Mahomes should continue to lean on Rice at Buffalo. And I'm expecting him to deliver another solid stat line in the game of the week.\nFor more of my DFS plays for Week 9, click on this link to SportsLine. And good luck to your DFS lineups for this week.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football 2025 Week 9 DFS lineups: Jamey Eisenberg's most rostered, must have player on the slate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/19/78d9ef3c-d5c7-4538-b313-f020949a527c/thumbnail/1200x675/3cb68bdb2a1a8ef9ac8cedb4b6e75b95/usatsi-27369185-rashee-rice-chiefs-wr-td-1q-2025-1920.jpg"
      ],
      "datePublished": "2025-10-31T20:29:11.000Z",
      "dateModified": "2025-10-31T20:29:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-playoff-bracket-schedule-2025/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/21/be54dcd6-5718-4911-9922-fcde5e6dac36/thumbnail/1200x675/5d80fd3dcdce0a62ae1b1f852e4926b9/mlb-bracket-world-series.jpg",
    "tag": "Sports",
    "date": "2025-11-01T03:11:43.000Z",
    "description": "\n        The 2025 MLB season is down to its final game.The Dodgers have forced a win-or-go-home Game 7 Saturday night with their Game 6 win over the B",
    "body": "\n        The 2025 MLB season is down to its final game.The Dodgers have forced a win-or-go-home Game 7 Saturday night with their Game 6 win over the Blue Jays, tying the World Series at three games apiece. Kevin Gausman had just one bad inning, but that was all it took for the Dodgers' win.The series so far has been a back-and-forth affair. The Blue Jays won Game 5 behind a record-setting Trey Yesavage start and back-to-back home runs to lead off the game, and Game 4 before that by beating Shohei Ohtani. The Dodgers took a wild Game 3 on a Freddie Freeman walk-off home run in the 18th inning Monday. Yoshinobu Yamamoto tossed a complete game in Los Angeles' Game 2 win, while the Blue Jays won Game 1 in an 11-4 blowout, including a grand slam by Addison Barger as part of a nine-run sixth inning.The Dodgers are back in the World Series for the second year in a row, looking to become the first back-to-back champion since the 1998-2000 Yankees. They completed their NLCS sweep of the Milwaukee Brewers last week and had a week off before World Series Game 1. They are the first reigning champion to return to the World Series since the 2009 Phillies. The Blue Jays, meanwhile, took a tougher route through the ALCS but came out victorious in Game 7 against the Seattle Mariners. This marks their first World Series appearance since 1993. \nBelow is a look at the full 2025 MLB playoff bracket.  2025 MLB playoff bracket \n                                                                    Keytron Jordan, CBS Sports\n                                                             2025 MLB playoff schedule All games on ESPN, ABC, Fox and FS1 are streaming on fubo (Try for free). All times Eastern.    World Series        Friday, Oct. 24    World Series Game 1: Blue Jays 11, Dodgers 4Saturday, Oct. 25    World Series Game 2: Dodgers 5, Blue Jays 1Monday, Oct. 27    World Series Game 3: Dodgers 6, Blue Jays 5 (18)Tuesday, Oct. 28    World Series Game 4: Blue Jays 6, Dodgers 2Wednesday, Oct. 29    World Series Game 5: Blue Jays 6, Dodgers 1Friday, Oct. 31    World Series Game 6: Dodgers 3, Blue Jays 1 (Series tied 3-3)Saturday, Nov. 1    World Series Game 7: Dodgers vs. Blue Jays, 8 p.m. | Fox/fubo     Division Series results        Saturday, Oct. 4    NLDS Game 1: Brewers 9, Cubs 3     ALDS Game 1: Blue Jays 10, Yankees 1     NLDS Game 1: Dodgers 5, Phillies 3     ALDS Game 1: Tigers 3, Mariners 2 (11)     \nSunday, Oct. 5    ALDS Game 2: Blue Jays 13, Yankees 7     ALDS Game 2: Mariners 3, Tigers 2     Monday, Oct. 6    NLDS Game 2: Dodgers 4, Phillies 3     NLDS Game 2: Brewers 7, Cubs 3     Tuesday, Oct. 7    ALDS Game 3: Mariners 8, Tigers 4     ALDS Game 3: Yankees 9, Blue Jays 6    \nWednesday, Oct. 8    ALDS Game 4: Tigers 9, Mariners 3    NLDS Game 3: Cubs 4, Brewers 3     ALDS Game 4: Blue Jays 5, Yankees 2 (Toronto wins series 3-1)    NLDS Game 3: Phillies 8, Dodgers 2    Thursday, Oct. 9    NLDS Game 4: Dodgers 2, Phillies 1 (11) (Los Angeles wins series 3-1)     NLDS Game 4: Cubs 6, Brewers 0  Friday, Oct. 10    ALDS Game 5: Mariners 3, Tigers 2 (15) (Seattle wins series 3-2)    \nSaturday, Oct. 11    NLDS Game 5: Brewers 3, Cubs 1 (Milwaukee wins series, 3-2)    Wild Card Series scoresTuesday, Sept. 30    AL Wild Card Series Game 1: Tigers 2, Guardians 1    NL Wild Card Series Game 1: Cubs 3, Padres 1     AL Wild Card Series Game 1: Red Sox 3, Yankees 1     NL Wild Card Series Game 1: Dodgers 10, Reds 5    Wednesday, Oct. 1    AL Wild Card Series Game 2: Guardians 6, Tigers    NL Wild Card Series Game 2: Padres 3, Cubs 0    AL Wild Card Series Game 2: Yankees 4, Red Sox 3    NL Wild Card Series Game 2: Dodgers 8, Reds 4 (Los Angeles wins 2-0)    \nThursday, Oct. 2    AL Wild Card Series Game 3: Tigers 6, Guardians 3 (Detroit wins 2-1)    NL Wild Card Series Game 3: Cubs 3, Padres 1 (Chicago wins 2-1)    AL Wild Card Series Game 3: Yankees 4, Red Sox 0 (New York wins 2-1)     Championship Series Sunday, Oct. 12 ALCS Game 1: Mariners 3, Blue Jays 1  Monday, Oct. 13 ALCS Game 2: Mariners 10, Blue Jays 3 NLCS Game 1: Dodgers 2, Brewers 1  Tuesday, Oct. 14 NLCS Game 2: Dodgers 5, Brewers 1 Wednesday, Oct. 15 ALCS Game 3: Blue Jays 13, Mariners 4 Thursday, Oct. 16 NLCS Game 3: Dodgers 3, Brewers 1  ALCS Game 4: Blue Jays 8, Mariners 2 \nFriday, Oct. 17 ALCS Game 5: Mariners 6, Blue Jays 2  NLCS Game 4: Dodgers 5, Brewers 1 (Los Angeles wins 4-0) Sunday, Oct. 19 ALCS Game 6: Blue Jays 6, Mariners 2 Monday, Oct. 20 ALCS Game 7: Blue Jays 4, Mariners 3 (Toronto wins 4-3) \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB playoffs 2025: Postseason bracket, schedule and results - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/21/be54dcd6-5718-4911-9922-fcde5e6dac36/thumbnail/1200x675/5d80fd3dcdce0a62ae1b1f852e4926b9/mlb-bracket-world-series.jpg"
      ],
      "datePublished": "2025-11-01T03:11:43.000Z",
      "dateModified": "2025-11-01T03:11:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rhett Lashlee contract: SMU retains coach with extension, thwarting suitors - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/rhett-lashlee-contract-extension-smu-coach/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/01/fab5bfa9-b1fa-4cad-9893-032560e2aa40/thumbnail/1200x675/143b98b722430c3874c73a240d89f633/untitled-design-75.png",
    "tag": "Sports",
    "date": "2025-11-01T01:04:08.000Z",
    "description": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        SMU coach Rhett Lashlee has agreed on a two-year c",
    "body": "\n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        SMU coach Rhett Lashlee has agreed on a two-year contract extension that will tie him to the school through the 2032 season and will take him out of the candidate pool for other jobs, CBS Sports' Brandon Marcello reported on Friday. Yahoo Sports reported that the raise that Lashlee will receive will make him one of the top-10 highest-paid coaches in the sport.Lashlee, 42, guided SMU to the College Football Playoff and an appearance in the ACC title game during the 2024 campaign. Lashlee has been with the program since the 2022 season and has compiled a 34-15 record at the school. The Mustangs are currently 5-3 heading into a showdown against No. 10 Miami on Saturday.Lashlee was connected to the Arkansas job shortly after the program fired Sam Pittman earlier this month. The former Arkansas quarterback has ties to the school, making him a logical candidate for the position. However, when asked about upcoming job openings, Lashlee quickly shot down the rumors.\n\"I don't stand anywhere on speculation and hypotheticals,\" Lashlee said earlier this month. \"I'm happy, I've got a great job. I think when your name gets linked to jobs it means your team has done well, the program has done well. So it's a compliment to what our staff and administration and players have built over the last three-plus years. Then a lot of times there's obvious connections. If it's your alma mater, it's easy to link names. But I haven't given it any thought because there hasn't been anything to give thought to. It's a great, fair question. But I'm really excited with what we're building here.\"SMU rewarded Lashlee with a new contract last fall that previously tied him to the school through the 2030 season.\nLashlee is the latest coach to sign an extension with his school, rather than potentially joining the coaching carousel. Nebraska and Matt Rhule agreed on an extension earlier this week, while Indiana secured a long-term deal with coach Curt Cignetti to keep him with the program.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rhett Lashlee contract: SMU retains coach with extension, thwarting suitors - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/01/fab5bfa9-b1fa-4cad-9893-032560e2aa40/thumbnail/1200x675/143b98b722430c3874c73a240d89f633/untitled-design-75.png"
      ],
      "datePublished": "2025-11-01T01:04:08.000Z",
      "dateModified": "2025-11-01T01:04:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dodgers vs. Blue Jays World Series Game 6 odds, prediction, picks, Shohei Ohtani player props - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/dodgers-blue-jays-prediction-odds-2025-world-series-game-6-betting-picks-ohtani-props/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/3383a0b1-1e13-4a2d-9592-a00dc4d7ee36/thumbnail/1200x675/d07391b8a4ea7f31173e8b441287da94/shohei-ohtani-la-dodgers.png",
    "tag": "Sports",
    "date": "2025-10-31T21:45:33.000Z",
    "description": "\n        The Los Angeles Dodgers and the Toronto Blue Jays battle in Game 6 of the 2025 World Series on Friday evening. The Blue Jays are on the verge",
    "body": "\n        The Los Angeles Dodgers and the Toronto Blue Jays battle in Game 6 of the 2025 World Series on Friday evening. The Blue Jays are on the verge of winning their first World Series since 1993. On Wednesday, Toronto defeated Los Angeles 6-1. Kevin Gausman (10-11, 3.59 ERA) starts for Toronto, and Yoshinobu Yamamoto (12-8, 2.49 ERA) counters for Los Angeles. Shohei Ohtani is +196 to hit a home run and -230 to record a hit. George Springer is back in the lineup as the leadoff hitter after exiting Game 3 with an injury. First pitch from Rogers Centre in Toronto is set for 8 p.m. ET. Los Angeles is a -141 favorite on the money line (risk $141 to win $100) in the latest Dodgers vs. Blue Jays odds from DraftKings Sportsbook, with the Blue Jays as +119 underdogs (risk $100 to win $119), and the over/under is 7.5. Before making any Dodgers vs. Blue Jays picks, be sure to see the MLB predictions and betting advice from SportsLine's proven computer model. New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every MLB game 10,000 times. It entered the 2025 World Series a profitable 35-29 on top-rated MLB money-line picks this season. It has excelled making home run prop picks this season, returning nearly 30 units of profit. Anybody following its MLB betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Dodgers vs. Blue Jays and just locked in its picks and MLB predictions. You can head to SportsLine now to see the model's picks. Here are several MLB odds and betting lines for Dodgers vs. Blue Jays:Dodgers vs. Blue Jays         money lineLos Angeles -141, Toronto +119Dodgers vs. Blue Jays         over/under7.5 runsDodgers vs. Blue Jays         run line Los Angeles -1.5 (+114)Dodgers vs. Blue Jays         picksSee picks at SportsLineDodgers vs. Blue Jays         streaming Fubo (Try for free)Why the Blue Jays can winToronto enters this contest 19-8 as the home underdog, 62-41 after a win and with a 96-69 record with equal rest to their opponent. The Blue Jays have the backing of the home crowd in this one and have a 59-30 record at Rogers Centre. First baseman Vladimir Guerrero Jr. is the team's top slugger.In the 2025 MLB playoffs, he has a .415 batting average with eight home runs, 15 RBI and 27 hits. Third baseman Ernie Clement logs a .391 batting average, along with 25 total hits, one homer and nine runs driven in. In his last outing, Clement went 1-of-3 with a single and one RBI. See which team to back at SportsLine.Why the Dodgers can winShohei Ohtani is a big-time bat for Los Angeles. He's first on the team in home runs (8), RBI (14) and OBP (.392) in the postseason. In this series alone, he has belted three home runs with five RBI. Yamamoto takes the mound, and he's been lights out this postseason. In 27 innings pitched, he has a 1.57 ERA, 0.73 WHIP, and is averaging 8.2 strikeouts per game. The 27-year-old has allowed one or fewer runs in three of his past four starts. Los Angeles is 11-4 in the playoffs and 94-64 as the favorite this campaign. See which team to back at SportsLine. New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.How to make Blue Jays vs. Dodgers picksSportsLine's model is leaning Over on the total, projecting 8.9 runs, and is projecting 0.92 hits and 1.98 total bases for Ohtani. It also says one side of the money line has all the value. You can head to SportsLine to see the model's MLB picks. So who wins Blue Jays vs. Dodgers, and which side of the money line has all the value? Visit SportsLine now to see which side you need to jump on, all from the model that has crushed its MLB picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dodgers vs. Blue Jays World Series Game 6 odds, prediction, picks, Shohei Ohtani player props - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/3383a0b1-1e13-4a2d-9592-a00dc4d7ee36/thumbnail/1200x675/d07391b8a4ea7f31173e8b441287da94/shohei-ohtani-la-dodgers.png"
      ],
      "datePublished": "2025-10-31T21:45:33.000Z",
      "dateModified": "2025-10-31T21:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LSU athletic director search: Georgia AD shoots down interest in position - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/lsu-athletic-director-search-georgia-josh-brooks-shuts-down-interest-in-lsu-job-scott-woodward-brian-kelly/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/ba51e26e-7eb8-49b1-ab53-7c6b2f7b15b2/thumbnail/1200x675/8263200791b547190ae5b74c4ef7733c/usatsi-18757316-1.jpg",
    "tag": "Sports",
    "date": "2025-10-31T22:20:14.000Z",
    "description": "\n        The LSU athletic director job is open after the university parted ways with Scott Woodward, and it is a tremendously attractive position. One",
    "body": "\n        The LSU athletic director job is open after the university parted ways with Scott Woodward, and it is a tremendously attractive position. One name off the Tigers' potential candidates list, however, is Georgia athletic director Josh Brooks. An intraconference move is off the table for Brooks, who publicly declined interest in the job at one of the SEC's premier destinations.Brooks emerged as a possible option for the Tigers given that he completed his undergraduate degree at LSU and began his administrative career inside state lines at Louisiana-Monroe. His ties to Georgia, however, are also deep. He received a graduate degree from the university and has been on staff in various roles for much of his professional career.\"Georgia fans -- with success often comes speculation, but I want to address it directly,\" Brooks said on social media. \"I have not been contacted by anyone at LSU, and more importantly, I have no interest in any other job. My full focus remains on the University of Georgia, our student-athletes, coaches, staff and fans.\"LSU is a perennial national championship contender in multiple sports, including football, in which it is one of just two schools this century -- along with Ohio State -- to win multiple national championships with different coaches. That makes the athletic director job one of the best in the country.\nThe Tigers are not only in search of a new athletic director but are also set to hire a football coach after the firing of Brian Kelly. Interim athletic director Verge Ausberry and the LSU Board of Supervisors will oversee the coaching search.\"I am very fortunate to work alongside President Morehead, the Athletic Association Board, Governor Brian Kemp, and the Board of Regents, who share a deep commitment to excellence and to the success of Georgia Athletics,\" Brooks said. \"This is home to me, and I'm honored to play a part in the incredible progress we've made together. The best days for Georgia Athletics are still ahead, and I look forward to continuing to build on the championship standard we've established here in Athens. Let's go have some fun in Jacksonville! Go Dawgs!\"\nBrooks has a terrific job of his own at Georgia. The Bulldogs' football program won back-to-back national championships in his first two years in the athletic director role, giving him a roaring start to his tenure. He previously served in multiple administrative roles in Athens, first joining the football program in 2008 as director of football operations and working his way up the athletic department ladder from 2016 onward.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LSU athletic director search: Georgia AD shoots down interest in position - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/ba51e26e-7eb8-49b1-ab53-7c6b2f7b15b2/thumbnail/1200x675/8263200791b547190ae5b74c4ef7733c/usatsi-18757316-1.jpg"
      ],
      "datePublished": "2025-10-31T22:20:14.000Z",
      "dateModified": "2025-10-31T22:20:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arch Manning injury update: Latest news on Texas QB's status vs. Vanderbilt - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/arch-manning-injury-update-concussion-protocol-texas-qb-vanderbilt/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/2350ba39-b035-4a52-9f63-b5682defae4e/thumbnail/1200x675/a0c74a9263b9435115481f43972e8aec/arch-manning-questionable-getty.png",
    "tag": "Sports",
    "date": "2025-11-01T00:37:11.000Z",
    "description": "\n        Texas quarterback Arch Manning is trending in the right direction ahead of the No. 20 Longhorns' Week 10 matchup with No. 9 Vanderbilt. Manni",
    "body": "\n        Texas quarterback Arch Manning is trending in the right direction ahead of the No. 20 Longhorns' Week 10 matchup with No. 9 Vanderbilt. Manning was removed from the Longhorns' player availability report on Friday, indicating that the redshirt sophomore is good to go against the Commodores.Texas coach Steve Sarkisian told ESPN's Molly McGrath that Manning has not experienced any setbacks or symptoms this week, and is expected to meet with doctors Saturday morning for a final evaluation before kickoff. Texas listed him as questionable on its official injury report after he returned to practice in a limited capacity on Wednesday.Sarkisian said Monday that Manning was in concussion protocol after exiting Saturday's 45-38 win over Mississippi State after his helmet made contact with the turf at the end of a 13-yard scramble.Manning knifed his way through the heart of Mississippi State's defense in overtime with the score tied at 38 before he was tackled by Bulldogs safety Isaac Smith and defensive lineman Kedrick Bingley-Jones, who hit him from behind.\nManning tried to get up with the help of Texas offensive tackle Brandon Baker before motioning for trainers from a seated position on the turf. Matthew Caldwell, Manning's backup, threw a 10-yard touchdown pass on the possession to Emmett Mosley V that was the eventual game-winning score.\n        \n            \n                Who is Texas QB Matthew Caldwell? How the Longhorns' offense will look if Arch Manning is unavailable\n                \n                    Brad Crawford                \n            \n                            \n    \n                \n                    \n    \nManning had previously led a 17-point comeback in the fourth quarter to force overtime on the road after the Longhorns trailed 38-21. Texas is the first SEC team to overcome a 17-point deficit in the final frame to win since 2013.Manning finished with his best game as a collegian, completing 29 of 46 attempts for 346 yards and three touchdowns to go along with a score on the ground.\nHow does concussion protocol work?According to the university's concussion management plan, post-concussion management is directed by the team physician and the need for initial physical and cognitive rest will be determined based on individual serial assessments, concussion history, modifying factors and specific needs of the student-athlete.Final authority for \"return to play\" resides with the Longhorns' team physician. The NCAA's concussion safety protocol management mandates Manning would need to be cleared by medical personnel before returning to play. At 6-2 overall and 3-1 in conference play, Texas enters a pivotal final stretch beginning with next weekend's tilt against the 10th-ranked Commodores at DKR-Texas Memorial Stadium. Sarkisian's team is off the following week before traveling to fifth-ranked Georgia, hosting Arkansas and then entertaining the SEC's lone unbeaten, Texas A&M, in the regular-season finale on Nov. 28.\nWinning out from here would not only guarantee a third consecutive playoff appearance for the Longhorns, but would but a ticket to Atlanta in the SEC Championship Game.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arch Manning injury update: Latest news on Texas QB's status vs. Vanderbilt - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/2350ba39-b035-4a52-9f63-b5682defae4e/thumbnail/1200x675/a0c74a9263b9435115481f43972e8aec/arch-manning-questionable-getty.png"
      ],
      "datePublished": "2025-11-01T00:37:11.000Z",
      "dateModified": "2025-11-01T00:37:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Travis Hunter injury: How long will Jaguars star rookie be sidelined? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/travis-hunter-injury-jacksonville-jaguars-rookie-knee-practice-injured-reserve/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/ba8ab879-4440-4833-9bad-0e0694c6f1e2/thumbnail/1200x675/8c07fa59a1aecda5e6a63f746c2080af/travis-hunter.jpg",
    "tag": "Sports",
    "date": "2025-10-31T20:55:42.000Z",
    "description": "\n        The Jacksonville Jaguars placed rookie wide receiver and cornerback Travis Hunter on injured reserve Friday after he suffered a non-contact k",
    "body": "\n        The Jacksonville Jaguars placed rookie wide receiver and cornerback Travis Hunter on injured reserve Friday after he suffered a non-contact knee injury in practice on Thursday, coach Liam Coen said. Hunter will miss at least four games. Testing on Hunter's knee revealed that his ACL is intact, according to ESPN. Hunter will be further evaluated to determine the full extent of the injury and how long he will be sidelined. No definitive timetable is expected before next week, per ESPN.The two-way rookie, selected No. 2 overall in the 2025 NFL Draft, had gradually seen his role expand on both offense and defense. After a quiet start to the season, Hunter was being integrated more heavily in the passing game and rotated consistently in the secondary. The team had planned to further increase his touches following its bye week.\n        \n            \n                Travis Hunter was on the verge of breaking out at WR -- now a knee injury has put everything on hold\n                \n                    Jared Dubin                \n            \n                            \n    \n                \n                    \n    \n\"We're currently assessing the injury just to determine the best course of action moving forward for Travis and for the team,\" Coen said Friday morning. \"Feel bad for the guy, for the kid, for our team, everything, but he's in good spirits right now. Minor setback for a major comeback. That's just the way it's gotta be.\"Hunter, a Heisman Trophy winner at Colorado, has 28 receptions for 298 yards and one touchdown through seven games. That lone score came during a 35-7 loss to the Los Angeles Rams in London, where he hauled in a 34-yard reception for his first NFL touchdown. Hunter had a season-high 101 yards receiving on eight receptions with 14 targets in that Week 7 loss.\nWhat's next for the Jaguars with Hunter sidelined?Hunter's versatility made him a unique weapon in Jacksonville's early-season surprise run, which saw the Jaguars start 4-1 before losing two straight games heading into the bye. Thursday's injury halts what had been a slow but steady ascent in usage on both sides of the ball.The Jaguars, 4-3 in Coen's first season as coach, return to action this Sunday on the road against the Las Vegas Raiders. Hunter could be eligible to return in Week 13 against AFC South rival Tennessee Titans, but that depends on the severity of his injury. Hunter is the Jaguars' second-leading receiver this season behind Brian Thomas Jr., who has 27 receptions for 365 yards and one touchdown. Wide receiver Parker Washington and tight end Brenton Strange are the only other players over 200 yards receiving. With Hunter sidelined, Dyami Brown and veteran Tim Patrick -- who was limited in Thursday's practice along with Thomas -- could see an increased share of targets in the passing game.Coen said he is confident the team can adapt without Hunter.\n\"I have a lot of confidence in these guys that it's a great opportunity for all of us to work through a little adversity and the guys to perform at a high level,\" Coen said.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Travis Hunter injury: How long will Jaguars star rookie be sidelined? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/ba8ab879-4440-4833-9bad-0e0694c6f1e2/thumbnail/1200x675/8c07fa59a1aecda5e6a63f746c2080af/travis-hunter.jpg"
      ],
      "datePublished": "2025-10-31T20:55:42.000Z",
      "dateModified": "2025-10-31T20:55:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtics vs. 76ers prediction, odds: Friday NBA picks from proven computer model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/celtics-76ers-odds-prediction-line-time-2025-nba-picks-october-31/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/24/243fb4c8-9312-4635-9d6c-36b16a1ec4e0/thumbnail/1200x675/a215b9ee14daa58cac59b72c18a7f702/jaylen-brown-celtics.jpg",
    "tag": "Sports",
    "date": "2025-10-31T21:20:30.000Z",
    "description": "\n        The Philadelphia 76ers look to stay unbeaten on the year when they battle the Boston Celtics in a 2025 NBA Cup matchup on Friday night. Phila",
    "body": "\n        The Philadelphia 76ers look to stay unbeaten on the year when they battle the Boston Celtics in a 2025 NBA Cup matchup on Friday night. Philadelphia is coming off a 139-134 overtime win over the Washington Wizards on Tuesday, while Boston downed the Cleveland Cavaliers 125-105 on Wednesday. The Celtics (2-3), who have won two in a row, are 1-2 on the road this season. The 76ers (4-0), who are first in the Atlantic Division, are 2-0 on their home court. Paul George (knee) and Jared McCain (thumb) are out for the Sixers. Tipoff from Xfinity Mobile Arena in Philadelphia is set for 7 p.m. ET. Boston is a 1-point favorite in the latest Celtics vs. 76ers odds from SportsLine consensus, while the over/under for total points scored is 233.5. Before making any 76ers vs. Celtics picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past seven-plus seasons. The model enters Week 2 of the 2025-26 NBA season on a sizzling 161-120 roll on all top-rated NBA picks, returning nearly $4,000. It also went 24-11 (69%) on top-rated NBA against-the-spread picks last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Now, the model has simulated Celtics vs. 76ers 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Celtics vs. 76ers:Celtics vs. 76ers     spread:    Boston -1 at DraftKings    Celtics vs. 76ers                   over/under:    233.5 pointsCeltics vs. 76ers                   money line:    Boston -115, Philadelphia -104Celtics vs. 76ers                   picks:    See picks at SportsLineCeltics vs. 76ers                   streaming:Amazon Prime   Why the 76ers can coverVeteran guard Tyrese Maxey powers the Philadelphia offense. In four starts, he is averaging 37.5 points, 8.3 assists, 3.8 rebounds and one steal in 43 minutes. He is coming off a double-double in the win over the Wizards. In 47 minutes of action, he poured in 39 points, while adding 10 assists and three rebounds. He scored 43 points and added eight assists and four rebounds in a 136-124 win over Orlando on Monday.Rookie guard VJ Edgecombe is off to a fast start to his career. In four starts, he is averaging 22.3 points, 5.8 rebounds, 5.5 assists and 1.5 steals in 40.3 minutes. In a 117-116 win at Boston in the season opener on Oct. 22, he poured in 34 points, while grabbing seven rebounds and dishing out three assists. He scored 26 points, while adding seven assists and four rebounds in the win over the Magic. See which team to back at SportsLine.Why the Celtics can coverWith Jayson Tatum (Achilles) sidelined for an extended period, veteran guard Jaylen Brown has carried the load early this season. In five starts, he is averaging 26.8 points, 5.6 rebounds and 3.8 assists in 32.6 minutes. He is coming off a 30-point, five-rebound and four-assist performance in the win over Cleveland. He had 41 points, six rebounds and four assists in a 119-113 loss to the Detroit Pistons on Sunday.Guard Derrick White has also been a big part of the Boston offense. In five starts, he is averaging 17 points, 4.4 assists, 3.8 rebounds, 1.4 steals and one block in 34.2 minutes. In the season-opening loss to the 76ers, he scored 25 points, while adding four assists and three rebounds. He had 19 points, five rebounds and four assists in the win over Cleveland. See which team to back at SportsLine. New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Celtics vs. 76ers picksSportsLine's model has simulated Celtics vs. 76ers 10,000 times and is leaning Under the total, projecting 231 combined points. The model also says one side hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Celtics vs. 76ers, and which side of the spread hits well over 50% of simulations? Visit SportsLine now to see which side of the Celtics vs. 76ers spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtics vs. 76ers prediction, odds: Friday NBA picks from proven computer model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/24/243fb4c8-9312-4635-9d6c-36b16a1ec4e0/thumbnail/1200x675/a215b9ee14daa58cac59b72c18a7f702/jaylen-brown-celtics.jpg"
      ],
      "datePublished": "2025-10-31T21:20:30.000Z",
      "dateModified": "2025-10-31T21:20:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lions' Dan Campbell reveals he once wore Marilyn Monroe costume for Halloween; his wife provides the evidence - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/lions-dan-campbell-reveals-he-once-wore-marilyn-monroe-costume-for-halloween-his-wife-provides-the-evidence/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/31/fa9bc3f3-7346-4b8f-a7af-b71921d80070/thumbnail/1200x675/9a6119930c63787c207a19440c0384e4/dan-campbell-smiling.jpg",
    "tag": "Sports",
    "date": "2025-10-31T21:46:17.000Z",
    "description": "\n        In honor of Halloween, Detroit Lions coach Dan Campbell peeled back the curtain on some of his past costumes and revealed one particularly hi",
    "body": "\n        In honor of Halloween, Detroit Lions coach Dan Campbell peeled back the curtain on some of his past costumes and revealed one particularly hilarious getup. Campbell, a burly former tight end, told reporters at the Lions facility on Friday that, one year, he dressed up as Marilyn Monroe for the holiday.The Monroe costume was a joint venture of sorts with Campell's wife, Holly. Campbell said that on one Halloween during his NFL playing career, his wife supplied him with a white dress to go with his blonde wig, and all together, the ensemble resembled the late actress.\"That was a long time ago, and that wasn't here,\" said Campbell, who played for the Lions from 2006-08. \"I'm sure you can find some old stuff. But anyway, we paired up pretty good. Let's just put it that way. Holly's the creative one. She always had pretty good ideas for stuff.\"After Campbell's media availability session, Holly Campbell took to social media to provide photo evidence of the costume.\n\n\nIt was not a coordinated costume for the couple, though. Campbell went solo on the Monroe outfit while his wife donned a halo and angel wings.\"It was really more her and her sister than it was we were paired up,\" Campbell said. \"I was kind of the odd one out. But I was Marilyn Monroe. She bought me the freaking dress. I had the wig. Actually, I had a broken ankle, so I was on crutches, too. That was great.\"As for how Campbell plans to celebrate Halloween this year, he said he will be passing out candy at his home. Reese's peanut butter cups and M&M's are the candy of choice in the Campbell household.\nCampbell will lead the Lions into battle against the Minnesota Vikings on the other side of Halloween. Detroit, second in the NFC North at 5-2, hosts Minnesota at 1 p.m. ET on Sunday.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lions' Dan Campbell reveals he once wore Marilyn Monroe costume for Halloween; his wife provides the evidence - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/31/fa9bc3f3-7346-4b8f-a7af-b71921d80070/thumbnail/1200x675/9a6119930c63787c207a19440c0384e4/dan-campbell-smiling.jpg"
      ],
      "datePublished": "2025-10-31T21:46:17.000Z",
      "dateModified": "2025-10-31T21:46:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NWSL Decision Day schedule, scenarios: Racing Louisville, North Carolina Courage battle for last playoff spot - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/nwsl-decision-day-schedule-scenarios-racing-louisville-north-carolina-courage-playoffs-seeding/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/853dbf86-c137-4f7c-80d0-d453ca1fdf48/thumbnail/1200x675/4d6ebea024efdacfd8d3695f4795e336/louisville.jpg",
    "tag": "Sports",
    "date": "2025-10-31T19:51:34.000Z",
    "description": "\n        The scenarios on the NWSL's second-ever decision day on Sunday may be straightforward as two teams compete for the final playoff berth, but t",
    "body": "\n        The scenarios on the NWSL's second-ever decision day on Sunday may be straightforward as two teams compete for the final playoff berth, but the circumstances vary for the last two teams in the mix. The North Carolina, a postseason perennial, may have a chance but it is Racing Louisville who lead the charge for eighth place – and may just book their first trip to the playoffs in the process.Louisville carry not only a two-point advantage heading into the final weekend but have a favorable fixture waiting for them on Sunday against Bay FC, a team whose playoff run officially ended weeks ago and are on the cusp of a coaching change that almost ensures the club has one eye on the future even as they close out the season. The Courage have less room for error – they need a win to cap off a tumultuous regular season on the field, but face a Gotham FC side that will be incentivized to win in order to secure home-field advantage in the postseason.It is an unusual position for both playoff hopefuls but especially Louisville, who have been close to the postseason but are a regular fixture in the bottom portion of the table. That is not to say their status as the favorites to reach the playoffs is undeserved – steady progress under head coach Bev Yanez has subtly improved their standing in recent years, another contrast to a Courage side that underwent a managerial change when Sean Nahas was fired over the summer. Questions about how deep a playoff run Louisville can actually make are valid but, for the time being, almost feel secondary. The more pressing inquiry – is this, at long last, Louisville's year?NWSL Decision Day scheduleSunday, Nov. 2Kansas City Current vs. San Diego Wave | 3 p.m. | ESPN, Fubo (Try for free)  Utah Royals vs. Washington Spiri | 5 p.m. | NWSL+    Portland Thorns vs. Houston Dash | 5 p.m. | NWSL+    Orlando Pride vs. Seattle Reign | 5 p.m. | NWSL+North Carolina Courage vs. Gotham FC  | 5 p.m. | ESPN, Fubo (Try for free)  Racing Louisville vs. Bay FC | 5 p.m. | NWSL+    Chicago Stars vs. Angel City | 5 p.m. | NWSL+    \nA tale of two inconsistent teamsA playoff berth comes with the hopeless optimism that truly anything is possible in a one-off but even then, there is something unglamorous about a battle for eighth place. Louisville and the Courage are middling teams for a reason this season and share some commonalities as a result, but the Courage's campaign is an example in extremes that have proven to be very costly.If the league table was rearranged on expected goal differential, both would rank inside the top eight alongside just about every other playoff team. Neither side has quite lived up to their own potential this season, though – Louisville's goal differential is -4 despite posting 2.56 xG, while the Courage's season has played out as if a data-savvy person was asked to make a joke about expectation vs. reality. The three-time NWSL champions currently boast the league's second-best xGD at 9 but instead have a goal differential of minus three, that difference between expected goal difference and actual goal difference the worst in the league for teams in the top nine.Both sides have just three wins in their last 11 but the Courage's underperformance this season means Louisville's imperfections pale in comparison. Inconsistency has wreaked havoc on the Courage's season, making the prospect of reaching the postseason seem like an uphill battle. They will benefit from the fact that Gotham have been inconsistent in their own right recently, posting just one win in their last six, but the onus will be on the Courage to get the job done on Sunday. Gotham will be chasing a win so they can rise from seventh to third if other results are in their favor, which may play well for the Courage's cheat code – individual brilliance.\nIndividual talent leads the wayFor both Louisville and the Courage, inconsistency has reigned supreme in their seasons but each side has had a standout attacker who has offered some much-needed reliability. Louisville's Emma Sears and the Courage's Manaka Matsukubo each have 10 goals, nearly 30% of the goals scored by their teams this season. Sears and Matsukubo, both tied for third in the NWSL's golden boot race, are essentially in a class of their own on their teams – Taylor Flint is the next highest goalscorer in Louisville with four goals, while Brianna Pinto fills that slot in North Carolina with three goals.Matsukubo's impressive run of form will be key for the Courage on Sunday, her individual talents potentially enough to break through a Gotham defense that has conceded the fewest goals in regular-season play so far this season. The Courage might be overly reliant on Matsukubo on Sunday, though, especially considering the team's collective attacking showing this season. They have underperformed their expected goals tally by a margin of seven goals, behind only Bay FC in that regard, just one of several issues that may soon become issues for next season as they lock in a head coach with Nathan Thackeray acting in an interim capacity.Louisville may also be overly reliant on Sears but the circumstances on Sunday favor them in almost every sense. While the Courage's attacking inconsistencies may be exacerbated by Gotham's sturdy defense, Sears and Louisville may benefit from Bay's flimsiness in the back. U.S. women's national team player Sears is a tough physical match for any defense but Bay's has not covered itself in glory this season, outdoing their expected goals against tally of 34.62 by conceding 40 goals so far.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NWSL Decision Day schedule, scenarios: Racing Louisville, North Carolina Courage battle for last playoff spot - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/853dbf86-c137-4f7c-80d0-d453ca1fdf48/thumbnail/1200x675/4d6ebea024efdacfd8d3695f4795e336/louisville.jpg"
      ],
      "datePublished": "2025-10-31T19:51:34.000Z",
      "dateModified": "2025-10-31T19:51:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Week 9 NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-longshot-picks-week-9-odds-player-props-parlay-alternate-lines-best-bets-predictions/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/17/5c0d49cb-842a-45af-a9eb-413fcc672f78/thumbnail/1200x675/ba3b5aac6a30d38c26050f39293a471f/jordan-love-packers.png",
    "tag": "Sports",
    "date": "2025-10-31T20:45:33.000Z",
    "description": "\n        The Week 9 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the",
    "body": "\n        The Week 9 NFL schedule features a compelling slate of matchups across the league, highlighted by several key games that could help shape the NFL playoff picture. The Indianapolis Colts are 3-point road favorites against the Pittsburgh Steelers in a matchup between potential AFC playoff teams, and the Buffalo Bills host the Kansas City Chiefs (-1.5) in another showdown between Josh Allen and Patrick Mahomes. 'Sunday Night Football' features the Seattle Seahawks (-3) taking on the Washington Commanders, and the week wraps up with the Dallas Cowboys (-2.5) hosting the Arizona Cardinals on 'Monday Night Football.'Effectively building NFL parlay picks can pay off big in your NFL betting strategy. NFL parlays come with a much greater risk than straight bets, but they also carry the potential of a much bigger reward. Before making any Week 9 NFL picks and parlays, you need to see the Week 8 NFL longshot parlay from SportsLine's proven computer simulation model that pays out almost $18,000 on a $10 bet. You can bet this NFL parlay using the latest DraftKings promo code, which offers $300 in bonus bets if your initial $5 wager wins + 3 months of NBA League Pass:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model is on a sizzling 45-28 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now that the simulation model has had a chance to digest the Week 9 NFL odds, it's locked in its betting picks to form a 5-leg NFL parlay that could pay out almost $18,000 for a $10 bettor. You can only see the picks and full parlay by heading to SportsLine.New users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.Top Week 9 NFL parlay picksFor Week 8, one of the model's parlay picks is backing the Panthers and Packers to go Over the alternate point total of 50.5, a bet that returns +161. The standard over/under is 44.5 points, but the model has spotted an opportunity to go bigger here. The Packers and Panthers are projected to combine for 51 points with the standard over/under hitting in 66% of computer simulations, leaving room to play alternate lines. The Packers have one of the league's most explosive offenses behind quarterback Jordan Love and running back Josh Jacobs. The Panthers' young offense has been one of the biggest surprises of the NFL season thus far, with quarterback Bryce Young and running back Rico Dowdle leading the way. The Packers offense is balanced and among the most efficient in the NFL. Green Bay averages 358.1 total yards and 27.6 points per game this season. The Panthers have one of the premier rushing attacks in the NFL, averaging 136.9 yards per game. See the rest of the picks in the Week 9 NFL parlay here.New users can also check out the latest FanDuel promo code and get $300 in bonus bets instantly at FanDuel if your $5 bet wins. How to make NFL parlay picks for a payout of almost $18,000The parlay also includes four additional picks from SportsLine's computer model, including a first touchdown scorer prop bet that returns +1000. You can only see the picks and the full parlay at SportsLine.What are the top NFL picks for Week 9 that can be combined into a parlay that returns almost $18,000 on just a $10 bet? And what optimal first touchdown scorer bets return +1000? Visit SportsLine now to see the top Week 9 NFL picks from SportsLine's proven model that can be combined for a parlay that pays almost $18,000, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Week 9 NFL longshot parlay picks, player props, best bets from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/17/5c0d49cb-842a-45af-a9eb-413fcc672f78/thumbnail/1200x675/ba3b5aac6a30d38c26050f39293a471f/jordan-love-packers.png"
      ],
      "datePublished": "2025-10-31T20:45:33.000Z",
      "dateModified": "2025-10-31T20:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]