[
  {
    "title": "Patriots vs. Ravens prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-ravens-prediction-odds-line-spread-week-16-sunday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/cf7d634a-05ba-4f7a-9392-a1e9f9067913/thumbnail/1200x675/f4a726bb620dd66fdfc20d1d3bc31dfe/lamar-jackson-ravens-2.jpg",
    "tag": "Sports",
    "date": "2025-12-22T00:12:20.000Z",
    "description": "\nAFC contenders will meet on 'Sunday Night Football' when the New England Patriots visit the Baltimore Ravens. The Pats (11-3) saw their 10-game winni",
    "body": "\nAFC contenders will meet on 'Sunday Night Football' when the New England Patriots visit the Baltimore Ravens. The Pats (11-3) saw their 10-game winning streak come to an end in Week 15 when they fell to Buffalo, 35-31. The Ravens (7-7) defeated Cincinnati, 24-0, on Sunday, which ended a two-game losing streak. New England can clinch a playoff berth with a victory, which would put it in the postseason for the first time since 2021. Baltimore All-Pro safety, Kyle Hamilton (ankle), is active, while New England's leading tackler, LB Robert Spillane (ankle), is out.Kickoff is at 8:20 p.m. ET from M&T Bank Stadium in Baltimore. The Ravens won the last matchup, 37-26, back in 2022. The latest Ravens vs. Patriots  odds have Baltimore as 3.5-point favorites, while the over/under for total points scored is 48.5 via DraftKings Sportsbook. New England sports a 9-5 against-the-spread (ATS) record this season, while Baltimore is 5-9 versus the line. Before making any Patriots vs. Ravens picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Ravens vs. Patriots. You can visit SportsLine now to see the picks. Here are the NFL odds and betting trends for Patriots vs. Ravens:Ravens vs. Patriots                                                                  spreadRavens -3.5 at DraftKings SportsbookRavens vs. Patriots              over/under48.5 pointsRavens vs. Patriots                                                                                                                                                                              money line Baltimore -192, New England +158Ravens vs. Patriots                                                                                                                                                                      picksSee picks at SportsLineRavens vs. Patriots                                                                                                                                                                        streaming Fubo (Try for free)  \nWhy the Patriots can coverNo AFC team has a better spread record than New England at 9-5, and the team has also covered in five of six away games. Meanwhile, no team in the NFL has a worse spread record than Baltimore at 5-9, and the Ravens have failed to cover in four of their last five contests. On the field, the Pats have incredible balance, ranking No. 7 in both scoring offense and scoring defense, and the team is coming off a season-high of 246 rushing yards on Sunday. Baltimore's run defense is exploitable this year as after ranking No. 1 versus the run in 2024, the team is just 15th this season. In addition to New England's backs, QB Drake Maye could also take advantage of Baltimore's run defense after he had 43 yards and two TDs on the ground last week. See which team to back at SportsLine. Why the Ravens can coverThe elite Ravens defense which has always been associated with the franchise returned last week as Baltimore pitched its first shutout in over seven years. That came versus a Bengals offense which had scored 30-plus in three straight Joe Burrow starts, while the Patriots offense has issues scoring in the redzone. It ranks 24th in redzone scoring, while the Patriots are dead last in redzone defense as just about every team which gets inside their 20-yard-line ends up with a touchdown instead of a field goal. Baltimore leads the NFL with 5.2 yards per carry, and Lamar Jackson had four passing touchdowns, plus 100-plus yards and a score on the ground, the last time he faced the Pats, who will be shorthanded without leading tackler, Robert Spillane, on 'SNF'. See which team to back at SportsLine.How to make Patriots vs. Ravens picksSportsLine's model has simulated Ravens vs. Patriots  10,000 times is going Over on the total, projecting 50 combined points. It also says one side of the spread hits in well over 50% of simulations.         You can only get the pick at SportsLine. So who wins Patriots vs. Ravens, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Ravens vs. Patriots spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Ravens prediction, odds, time: 'Sunday Night Football' picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/cf7d634a-05ba-4f7a-9392-a1e9f9067913/thumbnail/1200x675/f4a726bb620dd66fdfc20d1d3bc31dfe/lamar-jackson-ravens-2.jpg"
      ],
      "datePublished": "2025-12-22T00:12:20.000Z",
      "dateModified": "2025-12-22T00:12:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Patrtiots vs. Ravens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/best-betting-apps-nfl-sportsbooks-promos-sunday-night-football-how-where-to-bet-patrtiots-ravens/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-21T22:48:38.000Z",
    "description": "\n        The Baltimore Ravens (7-7) will host the New England Patriots (11-3) for Sunday Night Football in Week 16, and both teams are still hopeful o",
    "body": "\n        The Baltimore Ravens (7-7) will host the New England Patriots (11-3) for Sunday Night Football in Week 16, and both teams are still hopeful of winning divisional titles. Baltimore is currently second in the AFC North but could set up a Week 18 showdown for all the marbles with the Steelers (8-6), while the Patriots are first in the AFC East and trying to stave off the Bills (10-4). That makes Sunday's matchup pivotal for both sides with kickoff scheduled for 8:20 p.m. ET. The latest Ravens vs. Patriots odds list Baltimore as the 3.5-point home favorite, while the over/under is 47.5.There are dozens of betting options if you're wondering how to bet on the NFL, or more specifically, where to bet on Patriots vs. Ravens. Here's a closer look at available sportsbook promos on some of the top NFL betting sites, as well as the best betting apps that are available for New England vs. Baltimore on Sunday Night Football, with instructions on how to claim each offer and where to bet NFL.Where to bet on Patriots vs. Ravens on Sunday Night FootballBrandPromoCBS promo codeDraftKingsBet $5, get $200 in bonus betsJust click hereBetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSbet365Bet $5, get $150 in bonus bets win or loseCBSBET365CaesarsBet $1, double your winnings your next 20 betsCBSDYWFanDuelBet $5, get $250 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCashCBSFANThe DraftKings promo code, bet365 bonus code and FanDuel promo code all offer bonus bets after new users place a wager of $5 or more. The bet365 bonus code CBSSPORTS offers new users either $150 in bonus bets with the placement of a $5+ bet, or up to a $1,000 first bet safety net. Users receive the $150 bonus whether the bet wins or loses.At DraftKings and FanDuel, you need to win your first bet to receive the bonus. FanDuel offers new users $250 in bonus bets if their first bet of at least $5 wins. DraftKings offers $200 in bonus bets with a winning wager of at least $5.The latest Fanatics Sportsbook promo code CBSFAN provides new users who place a cash wager of at least $1 on any market with odds of -500 or longer up to $200 in FanCash per day every day for ten (10) consecutive days, if the initial wager settles as a loss. This promotion is available to eligible users in states where Fanatics Sportsbook legally operates (except New York).The latest BetMGM bonus code CBSSPORTS awards new users up to $1,500 back in bonus bets if their first bet loses. BetMGM users in New Jersey, West Virginia, Pennsylvania or Michigan can get a different promotion and receive $150 in bonus bets if you win your first bet of $10 or more.  The Caesars Sportsbook promo code is different than the aforementioned offers, providing profit boosts instead of bonus bets. At Caesars, new users can get 20 100% sportsbook profit boosts with a $1 bet. Bettors can use any of these promotions for Patriots vs. Ravens for Sunday Night Football on Sunday, December 21.Ravens vs. Patriots betting preview, picksRavens (-3.5) vs. PatriotsAfter a 1-5 start, Baltimore ripped off five wins in a row to briefly take control of the AFC North. However, back-to-back losses to the Bengals and Steelers put them back into second in the division and now they're in a chase position again. The Ravens avenged their loss to Cincinnati with a 24-0 shutout victory last week and the defense has generally played much better since the Week 5 bye. With New England having blown a 21-point lead against the Bills with a chance to clinch the AFC East last week, the model sees some cracks in the Patriots' armor. It predicts that Baltimore covers the spread in 55% of simulations.Over 47.5 pointsThe Patriots have one of the best run defenses (fifth in rushing yards allowed) in the NFL, but they were gutted for 168 yards on the ground last week by the Bills. Now they'll take on a Ravens rushing attack that ranks third in the NFL and just put up 189 yards in their win over the Bengals. Meanwhile, the New England offense still managed to score 31 points last week and rushed for a season-high 246 yards. The Patriots have had exceptional balance all season, throwing 411 times and rushing 401 times. The model predicts that the Over hits in 53% of simulations.Responsible gamingResponsible gaming is a serious topic, and all sportsbooks take steps to ensure users play responsibly. The top sportsbooks feature several tools and resources available on their apps and websites, including wager limits, voluntary self-exclusion options, and more. If you or someone you know is dealing with a gambling problem, please seek assistance from trained professionals such as the Problem Gambling Help Network at 1-800-GAMBLER.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best betting apps, NFL sportsbooks promos for Sunday Night Football: How, where to bet Patrtiots vs. Ravens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/18/812d69b5-ca2b-422b-bee1-99310358d56a/thumbnail/1200x675/cbb7c0be73727cc52d619f02cf3d9b84/drake-maye-new-england-patriots-imagn-images.jpg"
      ],
      "datePublished": "2025-12-21T22:48:38.000Z",
      "dateModified": "2025-12-21T22:48:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Steelers vs. Lions picks, score prediction - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/steelers-lions-where-to-watch-nfl-week-16-betting-odds-score-prediction-sgp-picks-sportsbook-promos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/28/c4b72be6-f7e8-46eb-99f6-8a8e293431a2/thumbnail/1200x675/f6265aa9948759a16b04815f8823bfa5/jared-goff-detroit-lions.jpg",
    "tag": "Sports",
    "date": "2025-12-21T20:02:11.000Z",
    "description": "\nBoth teams need a victory in NFL Week 16 when the Detroit Lions host the Pittsburgh Steelers with both teams entering Sunday at 8-6 and in danger of ",
    "body": "\nBoth teams need a victory in NFL Week 16 when the Detroit Lions host the Pittsburgh Steelers with both teams entering Sunday at 8-6 and in danger of missing the playoffs. The Steelers are in a good position, sitting a game ahead of the Baltimore Ravens in the AFC North, but they likely need to hold that spot to make the postseason. The Lions are unlikely to win their division as they are two games behind the Chicago Bears (10-4) in the NFC North and 1.5 behind the 9-4-1 Green Bay Packers, who are second in the division and hold the final playoff spot.   Kickoff from Ford Field is set for 4:25 p.m. ET on CBS and Paramount+. The Lions are 7-point favorites in the latest Steelers vs. Lions odds at DraftKings, and the over/under for total points scored is 52. Detroit's over/under for total points scored is 30.5, while Pittsburgh's is 21.5. Before you make any Lions vs. Steelers picks of your own, make sure to look at the top NFL picks from the SportsLine Projection Model, which simulates every NFL game 10,000 times. \nWhere to watch Steelers vs. Lions on SundayWhen: Sunday, Dec. 21Time: 4:25 p.m. ETTV: CBSStream: Paramount+  Follow along: CBS Sports AppSteelers vs. Lions betting previewOdds: Lions -7, Over/Under 52Both teams are 7-7 against the spread, but Pittsburgh has covered in consecutive games and is 6-3 ATS in its past nine in December. Detroit is 10-2 in its past 12 against AFC teams. The Lions have the league's highest-scoring offense (30.6 points per game), which is why they are 9-5 to the Over, including 6-1 in their past seven. Pittsburgh is 7-7 but has scored at least 27 points in four of its past five games. The Detroit defense gives up 24.6 points per game (23rd in NFL) and Pittsburgh gives up an average of 25.4 on the road. Steelers vs. Lions SGPLions -7Jahmyr Gibbs Over 74.5 rushing yardsJared Goff Over 263.5 passing yards Bet it at DraftKings:\nModel's Steelers vs. Lions score prediction, picksThe model sees some value in taking the Steelers as plus-money underdogs on the money line, as they are winning in 35% of simulations. Detroit is covering the spread 52% of the time, and the simulations peg the score right on the number. The props model is expecting a big day for the Lions' offensive players, with Goff predicted to throw for 304 yards and Gibbs to rush for almost 91. Goff is averaging 262 yards per game but has topped this total in three of the past four and had a season-high 338 last week. Gibbs entered NFL Week 16 sixth in the NFL in yards from scrimmage and is averaging 5.5 yards per carry. He has five runs of at least 42 yards this season, so one big run could get him halfway there.Steelers vs. Lions score prediction: Lions 30, Steelers 22\nWant more Week 16 NFL picks?You've seen the model's best bets for Pittsburgh Steelers vs. Detroit Lions. Now, get against the spread, total and money-line picks for every Week 16 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Steelers vs. Lions picks, score prediction - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/28/c4b72be6-f7e8-46eb-99f6-8a8e293431a2/thumbnail/1200x675/f6265aa9948759a16b04815f8823bfa5/jared-goff-detroit-lions.jpg"
      ],
      "datePublished": "2025-12-21T20:02:11.000Z",
      "dateModified": "2025-12-21T20:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2025 NFL playoff picture: How Bears could earn No. 1 seed or miss postseason - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2025-nfl-playoff-picture-how-surging-bears-could-still-miss-the-postseason-or-even-get-the-nfcs-no-1-seed/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/b3fe84c4-eb45-415d-87aa-194fea44a772/thumbnail/1200x675/c1c986b03d60889ca8bf48c39741a1db/bears.jpg",
    "tag": "Sports",
    "date": "2025-12-21T18:27:16.000Z",
    "description": "\n        The Chicago Bears are one of the hottest teams in the NFL right now. After winning a wild 22-16 overtime game against the Green Bay Packers o",
    "body": "\n        The Chicago Bears are one of the hottest teams in the NFL right now. After winning a wild 22-16 overtime game against the Green Bay Packers on Saturday night, the Bears are now on the cusp of clinching their first playoff berth in five years. However, they haven't earned a postseason spot just yet. At 11-4, the Bears could clinch a spot as soon as Sunday if the Pittsburgh Steelers beat the Detroit Lions in a game that kicks off at 4:25 p.m ET. That would be the ideal scenario for the Bears, because then they wouldn't have to sweat anything out over the next two weeks, and there's at least one scenario that could have them sweating a lot between now and Week 18. The NFC has been so crazy this year that the Bears have two very realistic scenarios in play over their final two games: They could either end up as the No. 1 overall seed in the NFC or they could miss the playoffs entirely. Seriously. The Bears could still miss the playoffs. First, let's start with the good news for Bears fans and take a look at the path for Chicago to win get the top seed in the NFC. Bears have to win out (at 49ers in Week 17, vs. Lions in Week 18) Seahawks lose ONE of their final two games (at Panthers in Week 17, at 49ers in Week 18)That's it. The Bears need just three things to go their way and if that happens, they'll be the No. 1 overall seed. The Bears don't have to worry about the Rams because even if Los Angeles wins its final two games to finish 13-4, Chicago would win the conference record tiebreaker over them (The Bears would also win that same tiebreaker over the Seahawks at 13-4). \n\n        \n            \n                NFL Week 16 playoff picture: Panthers seize NFC South lead; Bills, Chargers maintain wild card position\n                \n                    Tyler Sullivan                \n            \n                            \n    \n                \n                    \n    \nThe only problem with this scenario is that if the Bears beat the 49ers in Week 17, San Francisco might not have anything to play for in Week 18 against the Seahawks. The best case scenario for the Bears would be that the 49ers need to win in Week 18 to clinch a playoff berth. Now that the good news is out of the way, let's check out the bad news. Here's how the Bears could COMPLETELY MISS THE PLAYOFFS: Bears lose their final two games (at 49ers, Lions)Lions win their final three games (Steelers, at Vikings, at Bears)Packers win their final two games (Ravens, at Vikings)If this happens, then the Bears will be out of the playoffs. The Lions and Bears would both be 11-6 in this situation, but Detroit would win the head-to-head tiebreaker to finish on top of the Bears. \nThat would be Chicago's nightmare scenario and if it happens, the 11-6 Bears would become just the third 11-win team in NFL history to miss the playoffs. The Bears can avoid this situation by winning just one of the their final two games, which would allow them to clinch the NFC North. They can also avoid the situation if the Lions lose to the Steelers on Sunday, which means everyone in Chicago will be rooting for Aaron Rodgers, probably for the first time in their life. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2025 NFL playoff picture: How Bears could earn No. 1 seed or miss postseason - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/b3fe84c4-eb45-415d-87aa-194fea44a772/thumbnail/1200x675/c1c986b03d60889ca8bf48c39741a1db/bears.jpg"
      ],
      "datePublished": "2025-12-21T18:27:16.000Z",
      "dateModified": "2025-12-21T18:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Michigan assistant Matt Weiss seen on security footage related to hacking arrest - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/michigan-matt-weiss-security-footage-hacking-arrest/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/ecc13e3b-4d9b-455a-a4dd-bfd658dd8825/thumbnail/1200x675/7e83b60c25a61ebda19c6b6f9be7500f/weiis.png",
    "tag": "Sports",
    "date": "2025-12-21T18:56:07.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Eight months after federal investigators seized th",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Eight months after federal investigators seized thousands of photos and videos as part of an investigation into former Michigan co-offensive coordinator Matt Weiss, an FBI search warrant affidavit filed in federal court details security footage that captured the ex-assistant coach before he allegedly hacked into students' personal accounts to obtain explicit photos, according to The Athletic. The Athletic obtained a filing in Detroit Friday which enclosed a dozen pictures that were allegedly stolen during hacking attempts by Weiss in December 2022. Weiss, who previously worked under Jim Harbaugh at Michigan, was indicted in March for allegedly hacking into the private accounts of students and athletes around the country to steal intimate photographs. Investigators determined Weiss accessed private student files from computers inside Michigan's football facility within Schembechler Hall, The Detroit News reported. \nThe indictment indicated that Weiss downloaded the information of more than 150,000 athletes and used it to hack into the social media, email and cloud storage accounts of more than 2,000, primarily female college athletes. His alleged crimes date back to at least 2015. At the time of his indictment, Weiss faced 24 federal charges: 14 counts of unauthorized access to computers and 10 counts of aggravated identity theft. He plead not guilty to all of them. At least a portion of the alleged crimes occurred over a 72-hour stretch within Michigan's football facility as the Wolverines prepared for their 2022 College Football Playoff game against TCU. Michigan suspended Weiss in January of 2023 when campus police launched their initial investigation, citing only \"computer crimes.\" \nPrior to his termination in early 2023, Weiss worked for the Baltimore Ravens from 2009-20 before leaving to join Harbaugh as Michigan's quarterbacks coach. He later received promotion to co-offensive coordinator and served alongside then-Michigan assistant Sherrone Moore.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Michigan assistant Matt Weiss seen on security footage related to hacking arrest - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/ecc13e3b-4d9b-455a-a4dd-bfd658dd8825/thumbnail/1200x675/7e83b60c25a61ebda19c6b6f9be7500f/weiis.png"
      ],
      "datePublished": "2025-12-21T18:56:07.000Z",
      "dateModified": "2025-12-21T18:56:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liverpool suspect Alexander Isak has broken leg and could miss months, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/liverpools-alexander-isak-injury-suspected-broken-leg-suspected-out-months/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/1fda5edc-d720-4339-a22b-3aa2a8d3429d/thumbnail/1200x675/dfbac414d0e79651d20240190669cce8/isak-alexander-injury.jpg",
    "tag": "Sports",
    "date": "2025-12-21T22:17:08.000Z",
    "description": "\n        Liverpool's Alexander Isak is suspected to have broken his leg during the team's win at Tottenham Hotspur on Saturday, likely forcing him to ",
    "body": "\n        Liverpool's Alexander Isak is suspected to have broken his leg during the team's win at Tottenham Hotspur on Saturday, likely forcing him to spend several months on the sidelines, according to The Athletic.The extent of the injury is still unclear since the team is still waiting on results from an MRI, though the Reds feared it is a serious one, according to the report. Should Isak be diagnosed with a lower leg fracture, it would likely require several months for him to heal and return to the pitch.Isak sustained the injury in the 56th minute, shortly after coming on as a halftime substitute for Conor Bradley. He received a pass from Florian Wirtz as he made his way into the box, quickly taking a shot from close range. As the ball flew into the back of the net, though, Spurs' Micky van de Ven approached Isak for a challenge and the Liverpool forward landed awkwardly. Isak did not join his teammates in the celebration, instead he received medical treatment and then walked off the pitch with the assistance of medical staff four minutes later.\nThe Sweden international's diagnosis was not clear immediately after the game, with manager Arne Slot admitting he did not know the extent of the injury.\n\"If a player doesn't even try to come back, that is usually not a good thing but I cannot say anything more than that,\" Slot said post-match. \"That is just gut feeling and nothing medical … Let's not be too negative yet. We don't know yet, let's hope he is back with us soon.\"Isak notched his second goal of the Premier League season before he came off injured and will likely miss an important stretch of the season, aiming to settle into his new surroundings after a slow start to life at Liverpool. The injury is expected to put a big dent in his first season at the club, though, as well as provide a new set of challenges in a difficult campaign for the reigning champions.Liverpool's festive fixturesDec. 27: Wolverhampton Wanderers (h)Jan. 1: Leeds United (a)Jan. 4: Fulham (a)Jan. 8: Arsenal (a)How will Liverpool cope without Alexander Isak?Questions about how Liverpool will fare without Isak are peculiar ones since the 26-year-old has been off to a slow start since his $174 million move from Newcastle United over the summer. He arrived injured, though, and Slot argued that Isak's early weeks with the Reds were like a preseason since the forward missed out on Newcastle's preparation during a tense period between him and his old club, hampering his ability to perform upon arrival. As a result, he has not exactly been a staple for the Reds – he has nine starts between all competitions and just two league goals for the Reds so far.\nIsak would have had more opportunities to impress during the festive fixtures, especially considering Liverpool's absences. Mohamed Salah is currently with Egypt as they begin to compete in the Africa Cup of Nations, while Cody Gakpo, who has four goals and three assists in the Premier League this season, is dealing with a muscle issue that will keep him out until the new year. Liverpool may have to rely solely on Hugo Ekitike, who has eight goals in his first Premier League season, during a busy period that ends with a trip to Arsenal on January 8.Other options include Federico Chiesa and academy product Rio Ngumoha, though neither have started a league match this season.It is unclear if Liverpool will dip into the transfer market specifically with Isak's injury in mind, though the Reds have reportedly agreed to terms with Bournemouth's Antoine Semenyo over an $87 million move in January, per The Guardian. Semenyo has eight Premier League goals for Bournemouth this season but plays much more frequently on the wing, while Isak is more of a No. 9.\nSweden's World Cup qualification fateIf Isak is diagnosed with a broken leg, he is likely to miss Sweden's crucial World Cup qualifiers in March. Sweden are set to face Ukraine on March 26, the winner then meeting either Poland or Albania on March 31 for a berth at next summer's tournament in North America. The eventual winner of that playoff will be placed into Group F at the World Cup, where they will face the Netherlands, Japan and Tunisia.Isak played three matches for Sweden in the first round of UEFA World Cup qualifying last fall, though he did not get on the scoresheet during a horrid run that saw the team score just four goals and concede 12 in six games. Sweden, though, were able to reach the playoff round – which will take place in March – because of their performance in the UEFA Nations League, a saving grace for a team that would otherwise be watching the World Cup from home.Sweden will have to rely on the likes of Newcastle's Anthony Elanga and Arsenal's Viktor Gyokeres instead, neither of whom have been in particularly strong form this season. Gyokeres has five league goals for Arsenal this season but just one assist for Sweden in World Cup qualifiers, while Elanga has one goal for the national team during qualification but has yet to score in the Premier League this season.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liverpool suspect Alexander Isak has broken leg and could miss months, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/1fda5edc-d720-4339-a22b-3aa2a8d3429d/thumbnail/1200x675/dfbac414d0e79651d20240190669cce8/isak-alexander-injury.jpg"
      ],
      "datePublished": "2025-12-21T22:17:08.000Z",
      "dateModified": "2025-12-21T22:17:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morocco's Ayoub El Kaabi scores ridiculous bicycle kick in AFCON opening win - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/soccer/news/ayoub-el-kaabi-scores-bicycle-kick-as-morocco-win-africa-cup-of-nations-opener/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/88c3e614-6053-4387-9b94-da41cc6a8361/thumbnail/1200x675/17771bc8f882fc860cbff0a57ea4d9bf/bike.jpg",
    "tag": "Sports",
    "date": "2025-12-21T22:20:10.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Morocco opened the Africa Cup of Nations in style ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Morocco opened the Africa Cup of Nations in style with a 2-0 win over Comoros on Sunday, with Ayoub El Kaabi's second-half goal serving as the highlight of the match.In the 74th minute and already boasting a 1-0 lead, Anass Salah-Eddine sent a ball over the top into the penalty area, where El Kaabi was making a run. El Kaabi then leapt into the air for a bicycle kick, executing the acrobatic attempt from the center of the box.Watch the strike below:\nThe goal ensured tournament hosts Morocco would have a scoreline that matched their dominance against Comoros, against whom they had 70% possession and outshot 16 to four. The match did not get off to the smoothest start for Morocco, though – Soufiane Rahimi had his penalty saved by Comoros goalkeeper Yannick Pandor in the 11th minute, while center back Romain Saiss came off with an injury in the 19th minute.\nMorocco eventually had the opening goal of the game in the 55th minute courtesy of Brahim Diaz. Noussair Mazraoui sent the ball Diaz's way and the Real Madrid player came up with a quick finish from close range, a strong start for him in his first international tournament since switching nationalities from Spain to Morocco in 2024.\n\"The opening game is always difficult but we came good in the second half,\" Morocco head coach Walid Regragui said after the match.The hosts currently top Group A, with Mali and Zambia set to face off on Monday to complete the first round of matches in that group. Morocco next face Mali on Friday before wrapping up group play against Zambia on Dec. 29.\nMorocco, who were the first African team to reach the World Cup semifinals with their deep run in 2022, target their first Africa Cup of Nations title since 1976. They are now on a 19 match winning streak, extending a record-breaking streak for a national team after surpassing Spain's total of 15 wins from 2008 to 2009.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morocco's Ayoub El Kaabi scores ridiculous bicycle kick in AFCON opening win - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/88c3e614-6053-4387-9b94-da41cc6a8361/thumbnail/1200x675/17771bc8f882fc860cbff0a57ea4d9bf/bike.jpg"
      ],
      "datePublished": "2025-12-21T22:20:10.000Z",
      "dateModified": "2025-12-21T22:20:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ed Cooley suspended: Georgetown penalizes coach after water bottle hit child - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/ed-cooley-apology-georgetown-coach-water-bottle-hit-child/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/21/02db0518-2705-4351-9fd9-a9f4b1186e49/thumbnail/1200x675/c8fbdf46a28f76a8f4080df0efe85d9d/ed-cooley.jpg",
    "tag": "Sports",
    "date": "2025-12-21T20:35:06.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Georgetown announced a one-game suspension for coa",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Georgetown announced a one-game suspension for coach Ed Cooley after throwing a water bottle in frustration that accidentally hit a child following the Hoyas' 80-77 Saturday loss to Xavier. Cooley will not coach tomorrow against Coppin State. The incident happened after Georgetown's potential game-tying 3-pointer at the buzzer failed to connect. As the final buzzer sounded, Cooley took a water bottle he was holding and threw it towards the Georgetown bench. It flew into the stands and happened to hit a child who was sitting on his mother's lap.\nAfter the game, Cooley opened his postgame press conference with an apology to the family of the kid he hit with the projectile.\"First and foremost, I have to apologize to the Iwuchukwu family,\" Cooley said. \"Really frustrated realized I threw my water bottle, and it hit [him] and his mom. Definitely out of character to be so frustrated, but really that's not called for. I'll call them and make amends to that. Just totally out of character, frustration. So I apologize to the fans, our players, the university. Totally, totally out of character for me to be that way.\"\nThe Big East released a statement showing support for Georgetown's decision to suspend Cooley for Monday's game.\"We have communicated with Georgetown leadership and support their decision to suspend head men's basketball coach Ed Cooley for his actions following last night's game against Xavier. The safety and security of spectators and participants at Big East events is of paramount importance and fundamental to the enjoyment of our games.\"\nThis was not Cooley's first frustrating loss to Xavier. Cooley confronted a Xavier fan last February for \"verbally attacking\" one of his players. As the final buzzer sounded of that game in February, Cooley walked directly towards a fan who was sitting court side and began exchanging words with him. Nothing became physical, but the Georgetown staff had to step in to separate Cooley from the fan. After that incident, the Hoyas coach said, \"I will always protect my players if they are threatened.\"\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ed Cooley suspended: Georgetown penalizes coach after water bottle hit child - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/21/02db0518-2705-4351-9fd9-a9f4b1186e49/thumbnail/1200x675/c8fbdf46a28f76a8f4080df0efe85d9d/ed-cooley.jpg"
      ],
      "datePublished": "2025-12-21T20:35:06.000Z",
      "dateModified": "2025-12-21T20:35:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patrick Mahomes among Week 16 NFL injuries bettors need to know - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-16-injury-report-injuries-for-bettors-to-know-include-patrick-mahomes-and-marvin-harrison-jr/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/14/b4a13d60-f2ae-4ae6-9371-b0402a41a55b/thumbnail/1200x675/6b93ae20852564144b0b76be364a068b/mahomes-chiefs.jpg",
    "tag": "Sports",
    "date": "2025-12-21T20:09:31.000Z",
    "description": "\n        We've reached Week 16, so some teams are clinching playoff spots, some are aiming to stave off elimination and others are just playing out th",
    "body": "\n        We've reached Week 16, so some teams are clinching playoff spots, some are aiming to stave off elimination and others are just playing out the string while keeping one eye on the NFL Draft order. And, of course, at this stage of the season, injuries are piling up for some teams while others are getting healthier. For bettors looking to place NFL bets for Week 16, here are the most important NFL injuries of the week, as well as what NFL betting lines look like per the latest DraftKings Sportsbook odds. We will update this post with inactives lists for every team prior to kickoff. Chargers at Cowboys (1 p.m. ET)LAC WR Quentin Johnston (groin, available)DAL CB DaRon Bland (foot, out)\nThe Chargers have Johnston for this matchup against Dallas' struggling secondary, which will likely be without cornerback DaRon Bland for the remainder of the year. The good news for the Cowboys is neither CeeDee Lamb or Javonte Williams carry injury designations for Week 16.The Cowboys are slight 1.5-point favorites at home. The total is 49.5.Vikings at Giants (1 p.m. ET)No major injuries of note \nBoth teams are just trying to get across the finish line here, with the Vikings taking a major step back from last season while the Giants are going to have a new head coach in 2026. The Giants have a handful of players out or questionable, but no real line-movers.Minnesota is a 2.5-point favorite. The total is 43.5.Bengals at Dolphins (1 p.m. ET)CIN WR Tee Higgins (concussion, available)\nThis matchup is most noteworthy for Quinn Ewers starting at quarterback for Miami in place of the benched Tua Tagovailoa as the rookie from Texas is set to make his first NFL start against Cincinnati's league-worst defense. The Bengals do have Tee Higgins back on offense after he cleared concussion protocol.\nCincy is a 4.5-point favorite, and the total is 47.5.Buccaneers at Panthers (1 p.m. ET)No major injuries of note\nThis very important NFC South clash thankfully doesn't have major injuries impacting it, as the Bucs have no players listed while none of Carolina's stars, namely receiver Tetairoa McMillan, carry designations into the weekend. Both teams are 7-7, so the winner will hold the NFC South lead entering Week 17. These teams face off again in Week 18. Tampa Bay is favored by three points. The total sits at 45.5.Jets at Saints (1 p.m. ET)NYJ Tyrod Taylor (groin and knee, available)NYJ QB Justin Fields (knee, out)NYJ TE Mason Taylor (neck, out)NYJ WR Garrett Wilson (knee, out for season)NO RB Alvin Kamara (knee and ankle, out)\nUndrafted rookie Brady Cook will start for New York and Tyrod Taylor will be his backup. Fields is out. Cook won't have two of New York's top weapons with receiver Garrett Wilson shut down for the year while rookie tight end Mason Taylor remains sidelined with a neck injury. As for New Orleans, the Saints are again without top running back Alvin Kamara. The Saints are 6.5-point favorites. The total is 40.5.Bills at Browns (1 p.m. ET)CLE RB Dylan Sampson (hand, out)CLE TE David Njoku (knee, out)\nThe biggest injuries here come with Cleveland's offense, as rookie No. 2 back Dylan Sampson remains sidelined with a hand injury and veteran tight end David Njoku, who has seen his role diminish with the emergence of rookie Harold Fannin Jr., is also out. \nBuffalo is a 10.5-point favorite, and the total is 41.5.Chiefs at Titans (1 p.m. ET)KC QB Patrick Mahomes (knee, out for season)KC WR Rashee Rice (concussion, out)\nThe Chiefs are eliminated from playoff contention and will be without Patrick Mahomes for the rest of the year after he tore his ACL last week. Gardner Minshew will start in his place, but for this week, he won't have No. 1 receiver Rashee Rice as he is out with a concussion for this matchup with the Titans.Kansas City is favored by 3, and the total is 37.5.Jaguars at Broncos (4:05 p.m. ET)No major injuries of note\nThis AFC clash between division leaders is a potential playoff preview. The Jags have won five in a row to move to 10-4, while Denver sits atop the conference at 12-2 amid an 11-game win streak. Denver has clinched a playoff spot already while Jacksonville can clinch with a win and a loss by either Indianapolis or Houston. Denver is favored by 3.5 while the total is 47.5.Falcons at Cardinals (4:05 p.m. ET)ATL WR Drake London (knee, available)AZ RB Zonovan Knight (ankle, injured reserve)AZ WR Marvin Harrison Jr. (heel, available)\nAtlanta gets star receiver Drake London back after he's been sidelined for weeks with a knee injury. The Cardinals get a top receiver back in Marvin Harrison Jr., who is active after missing time of late after undergoing an appendectomy and more recently a nagging heel injury. The Cardinals' running back woes also continue, as Zonovan \"Bam\" Knight is now the third back the team has lost for the year due to injury, so Michael Carter will be Arizona's lead back on Sunday. \nThe Falcons are favored at -3. The total sits at 48.5.Raiders at Texans (4:25 p.m. ET)LV QB Geno Smith (shoulder, will play)HOU RB Woody Marks (ankle, out) HOU RB Nick Chubb (ribs, available)\nThe Raiders will get their starting quarterback back for this tough matchup with Houston as Geno Smith returns after missing last week's loss. The Texans' backfield will have a new leader, as Marks is out but Chubb is in. Jawhar Jordan is expected to have a big role after rushing for 101 yards on 15 carries against Arizona.Houston is a 14.5-point favorite. The total is 37.5.Steelers at Lions (4:25 p.m. ET)PITT LB T.J. Watt (lung, out)DET OL Taylor Decker (available) and Graham Glasnow (out)\nThis is a big one for both sides, with the Steelers holding a slim one-game lead over Baltimore in the AFC North race while Detroit is trying to keep pace in the NFC wild card picture. The Steelers will again be without star edge rusher T.J. Watt after he had surgery to repair a collapsed lung last week. The Lions have listed two of their five starting offensive linemen as questionable. The Lions are favored by seven points. The total is 52.5.Patriots at Ravens (8:20 p.m. ET)No major injuries of note\nSunday Night Football is a big one for the AFC playoff picture with the Ravens hosting the Patriots. New England fell to Buffalo last week and at 11-3 leads the AFC East but is behind Denver in the race for the No. 1 seed in the conference. The Ravens are 7-7 and are a game behind the Steelers in the AFC North race and desperately need a win to keep pace. The Pats can clinch a postseason berth with a win or if either Houston or Indianapolis lose this week. \nThe Ravens are -3 on the spread with the total set at 49.5.49ers at Colts (8:15 p.m. ET, Monday)SF WR Ricky Pearsall (knee, TBD)IND CB Sauce Gardner (calf, TBD)IND WR Alec Pierce (Achilles, TBD)\nFinal reports for Monday Night Football will come out on Saturday, but the three injuries worth watching are all in the passing game. Ricky Pearsall remains banged up and could be in danger of missing Monday's game for the 49ers, while the Colts are hoping for good news on top cornerback Sauce Gardner and deep-threat receiver Alec Pierce. The 49ers are favored by 5.5. The total is 46.5.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patrick Mahomes among Week 16 NFL injuries bettors need to know - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/14/b4a13d60-f2ae-4ae6-9371-b0402a41a55b/thumbnail/1200x675/6b93ae20852564144b0b76be364a068b/mahomes-chiefs.jpg"
      ],
      "datePublished": "2025-12-21T20:09:31.000Z",
      "dateModified": "2025-12-21T20:09:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Ravens props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-ravens-nfl-player-props-bets-sgp-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/12/fc6f1fd0-b57c-4eff-829f-5296259950b5/thumbnail/1200x675/72f1be6fa43bfae9d676e064028a7fc3/untitled-design-2025-11-12t003952-050.png",
    "tag": "Sports",
    "date": "2025-12-22T00:09:02.000Z",
    "description": "\nTeams in a battle to win their respective divisions meet when the New England Patriots face the Baltimore Ravens in Week 16 'Sunday Night Football' a",
    "body": "\nTeams in a battle to win their respective divisions meet when the New England Patriots face the Baltimore Ravens in Week 16 'Sunday Night Football' at 8:20 p.m. ET from M&T Bank Stadium in Baltimore. The Patriots (11-3), who lead the AFC East, hold a one-game lead over the Buffalo Bills with three games remaining. The Ravens (7-7), who are second in the AFC North, trail the Pittsburgh Steelers by one game. The matchup will feature quarterback Drake Maye against quarterback Lamar Jackson. Both players figure into several NFL player props or a Sunday Night Football SGP, in a contest in which Baltimore is favored by 3.5 points.Maye has played at an MVP-type level for a good portion of the season, completing 70.9% of his passes for 3,567 yards and 23 touchdowns. Jackson, meanwhile, has completed 63.5% of his passes for 2,210 yards and 18 touchdowns. There are several NFL player props one could target for these stars, or you may find value in seeking NFL prop lines for other options like TreVeyon Henderson, Rhamondre Stevenson and Stefon Diggs of the Patriots, and Derrick Henry, Zay Flowers and Mark Andrews of the Ravens. Before betting any Patriots vs. Ravens props for Sunday Night Football, you need to see the Patriots vs. Ravens prop predictions powered by SportsLine's Machine Learning Model AI.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins to bet on props like Derrick Henry anytime TD scorer:\nBuilt using cutting-edge artificial intelligence and machine learning techniques by SportsLine's Data Science team, AI Predictions and AI Ratings are generated for each player prop. For Patriots vs. Ravens NFL betting on 'Sunday Night Football,' SportsLine AI has evaluated the NFL player prop odds and provided Ravens vs. Patriots prop picks. You can only see the Machine Learning Model player prop predictions for Patriots vs. Ravens here.Top NFL player prop bets for Patriots vs. RavensAfter analyzing the Patriots vs. Ravens props and examining the dozens of NFL player prop markets, the SportsLine's Machine Learning AI says Patriots quarterback Drake Maye goes under 1.5 passing touchdowns (-140). Maye has thrown for one or fewer touchdowns in three of the last four games. In the 35-31 loss to the Buffalo Bills last week, he did not throw a touchdown pass, while throwing one interception. Additionally, Baltimore has kept opposing quarterbacks to one or fewer touchdown in seven of its last eight games.Despite throwing for nearly 300 yards in a 26-20 win at Cincinnati on Nov. 23, Maye threw for just one touchdown. He also had one touchdown in a 27-14 win over the New York Jets on Nov. 13. The SportsLine Machine Learning Model projects Maye to have 0.9 touchdown passes and gives this prop a 3.5 out of 5-star prop rating. See more NFL props here. Bet Maye to go Under 1.5 passing touchdowns at DraftKings:\nHow to make NFL player prop bets for Patriots vs. RavensIn addition, the SportsLine Machine Learning Model   says another star sails past his total and has four NFL props that are rated 4.5 stars or better. You need to see the Machine Learning Model analysis before making any Patriots vs. Ravens prop bets for Sunday Night Football.Which Ravens vs. Patriots prop bets should you target for Sunday Night Football? Visit SportsLine now to see the top Patriots vs. Ravens props, all from the SportsLine Machine Learning Model.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Ravens props, 'Sunday Night Football' SGP picks, best bets - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/12/fc6f1fd0-b57c-4eff-829f-5296259950b5/thumbnail/1200x675/72f1be6fa43bfae9d676e064028a7fc3/untitled-design-2025-11-12t003952-050.png"
      ],
      "datePublished": "2025-12-22T00:09:02.000Z",
      "dateModified": "2025-12-22T00:09:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Colts vs. 49ers prediction, odds: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/colts-49ers-prediction-odds-time-monday-night-football-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/14/3b325d04-b292-4c34-b234-478d21928f39/thumbnail/1200x675/dc12781958c2caa031b0e0def07764fd/imagn-philip-rivers-colts.jpg",
    "tag": "Sports",
    "date": "2025-12-21T18:59:30.000Z",
    "description": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4",
    "body": "\nTeams streaking in opposite directions will meet on 'Monday Night Football' as the San Francisco 49ers visit the Indianapolis Colts. The Niners (10-4) have won four straight, all of them coming by multiple scores, including a 37-24 win over Tennessee in Week 15. The Colts (8-6), meanwhile, are riding a four-game losing streak and fell to Seattle, 18-16, on Sunday. This will be Philip Rivers' first Indy home game with a full crowd supporting him, as there was limited attendance due to the pandemic when he last played in 2020.Kickoff is at 8:15 p.m. ET from Lucas Oil Stadium in Indianapolis. The latest 49ers vs. Colts odds from DraftKings Sportsbook have San Francisco as 5.5-point road favorites, while the over/under for total points scored is 46. Before making any Colts vs. 49ers     picks, be sure to see the NFL predictions from SportsLine's projection model.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.  Now, the model has zeroed in on San Francisco vs. Indianapolis. You can head to SportsLine now to see its picks. Here are several NFL odds and betting lines for Colts vs. 49ers:49ers vs. Colts              spread49ers -5.5 at DraftKings Sportsbook49ers vs. Colts                  over/under46 points49ers vs. Colts                  money line 49ers -257, Colts +20949ers vs. Colts                  picksSee picks at SportsLine49ers vs. Colts          streaming Fubo (Try for free)\nWhy the 49ers can coverThe Niners have covered in each contest of their four-game win streak, while Brock Purdy is 5-1 ATS this season. San Fran also has a huge primetime advantage when it comes to the spread, as it has covered in all three such games this year, while Indy is 0-5 ATS over its last five under the bright lights of primetime. Despite batting major injuries all year, the Niners still rank among the top four in both third-down offense and passing offense. The Colts' offense should have difficulty keeping up with the 49ers as Indianapolis has scored 20 or fewer points in four straight games. See which team to back at SportsLine.Why the Colts can coverThe Colts have owned this series recently, winning five straight overall matchups and going 9-3 over the last dozen home meetings. Indy controls the trenches, leading the NFL in rushing touchdowns while ranking second by allowing just 3.7 yards per rush. The ground game is already a struggle for the 49ers, who rank 31st with 3.5 yards per carry, and Rivers should find more success in his second week back. He's had a full week in the practice facility, is at home instead of a hostile environment like Seattle, and the Niners rank dead last in the NFL in defensive sacks. See which team to back at SportsLine. How to make Colts vs. 49ers           picksFor 49ers vs. Colts   on 'Monday Night Football,' the model is leaning Over the total, projecting 54 combined points. It also says one side of the spread hits well over 50% of the time. See what it is at SportsLine.Who wins Colts vs. 49ers, and which side of the spread hits in well over 50% of simulations? Visit SportsLine now to see which side of the 49ers vs. Colts spread you need to jump, all from the model that is 52-37 on top-rated picks since 2024, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colts vs. 49ers prediction, odds: 'Monday Night Football' picks from 10,000 simulations - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/14/3b325d04-b292-4c34-b234-478d21928f39/thumbnail/1200x675/dc12781958c2caa031b0e0def07764fd/imagn-philip-rivers-colts.jpg"
      ],
      "datePublished": "2025-12-21T18:59:30.000Z",
      "dateModified": "2025-12-21T18:59:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Cowboys-Chargers, Cardinals-Falcons NFL games - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/use-draftkings-promo-code-to-get-200-bonus-bets-cowboys-chargers-cardinals-falcons-nfl-games/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg",
    "tag": "Sports",
    "date": "2025-12-21T17:24:18.000Z",
    "description": "\n        The Baltimore Ravens will host the New England Patriots on Sunday Night Football in one of the biggest games of the year, the perfect time to",
    "body": "\n        The Baltimore Ravens will host the New England Patriots on Sunday Night Football in one of the biggest games of the year, the perfect time to use the latest DraftKings promo code, which gives new users $200 in bonus bets if your first $5 bet wins. SportsLine's advanced computer model is backing the Ravens to win and cover as 3-point favorites as a part of its Sunday best bets at DraftKings Sportsbook.In addition, a pair of top SportsLine experts have locked in their NFL best bets for Sunday, including legendary expert Bruce Marshall backing the Chargers as 1.5-point underdogs against the Cowboys in a game with an over-under of 50.5. Finally, R.J. White is taking Over 48.5 total points for Cardinals vs. Falcons as a part of his Sunday NFL best bets. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5 bet wins: Check out our DraftKings promo code review for full details.The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters Week 16 on a 52-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Sunday best bets at DraftKings SportsbookChargers (+1.5) vs. CowboysOver 48.5 points in Cardinals vs. FalconsRavens (-3) vs. PatriotsCombining the model's three picks into a Sunday parlay at DraftKings would result in a payout of +584 (risk $100 to win $584). Bet it at DraftKings here:\nChargers (+1.5) vs. Cowboys (-108)\"The marketplace still seems to be overvaluing the Cowboys, whose playoff hopes could be completely extinguished by the time this one kicks off in Arlington,\" legendary Sportsline expert Bruce Marshall said. \"Dallas should have had more left in the tank for last Sunday's 34-26 loss to the Vikings, and the defense is starting to resemble its poor form from the first half of the season while allowing 39 ppg in consecutive losses to the Lions and Vikes. As for the Bolts, they're still playing inspired defense while continuing to chase Denver in the AFC West, and Justin Herbert's left wrist has had another week to heal and get him closer to 100%. This is arguably a tougher test for Dallas than others they didn't pass the past two weeks. Play Chargers.\" Back the Chargers at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Over 48.5 in Cardinals vs. Falcons (-110)\"Both teams could get their top receiver back this week, though it's not like either team has been hurting for offense in recent weeks with the Falcons scoring 23+ in six of their last seven while the Cardinals are typically also an offense in the mid-20s in scoring but have had to face a few tough defenses in recent weeks, knocking them down to the 17-20 range,\" SportsLine expert R.J. White said. \"But the real reason to like the Over is the two defenses, as Arizona has allowed 40+ points in four of their last six, while Atlanta has given up 27+ in five of their last six. In an indoor environment, this should be a game that reaches the 50s.\" Back the Over at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:Ravens (-3) vs. Patriots (-115)Although the Patriots haven't technically clinched yet, they have all but secured a spot in the playoffs, whereas the Ravens are in essentially a must-win mode every week as they sit at 7-7 and enter the week a game behind the Steelers in the AFC North. Besides just the basic need to win this game, the Ravens have played better football as of late, and specifically, Lamar Jackson has looked more like his former MVP self in recent games. Jackson has played through injuries throughout the season, but he led the Ravens to a 24-0 win over the Bengals last week. The Baltimore defense shutting out Joe Burrow and the Bengals last week was impressive, and the Patriots are coming off a 35-31 loss to Buffalo. At home, the model projects the Ravens to win and cover in 56% of simulations, 28-22. Back the Ravens at DraftKings Sportsbook, where new users get $200 in bonus bets if your first $5 bet wins:\nWant more NFL picks on Sunday?You've seen some of the model's Sunday best bets. Now, get against the spread, total and money-line picks for all games, including NFL, NBA, college basketball, college football, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Cowboys-Chargers, Cardinals-Falcons NFL games - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/25/fb22c609-a863-4f28-9eb8-b53b7070fb75/thumbnail/1200x675/07804f5fd82fe2e08b33c00f8ffeb3e5/draftkings-bet-5-get-200.jpg"
      ],
      "datePublished": "2025-12-21T17:24:18.000Z",
      "dateModified": "2025-12-21T17:24:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Baseball Offseason Reactions: Munetaka Murakami's deal with White Sox spells trouble - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-reactions-munetaka-murakamis-deal-with-white-sox-spells-trouble/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/09/df36a1f3-4edb-40d7-a75d-f2a3e47c8cb6/thumbnail/1200x675/88e72fa9dfae039c3f0045254943623f/munetaka-murakami-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-12-21T23:15:23.000Z",
    "description": "\n        One of the biggest international free agents on the market this offseason has signed … for a suspiciously small number. The White Sox landed ",
    "body": "\n        One of the biggest international free agents on the market this offseason has signed … for a suspiciously small number. The White Sox landed Japanese slugger Munetaka Murakami Sunday, for a deal that will pay him just $34 million over the next two seasons. Murakami has a proven track record of elite production in the second best baseball league in the world and is just 26 years old, so the assumption among most was that he would at least challenge Masataka Yoshida's record $90 million contract for a position player from Nippon Professional Baseball. Instead, he wound up signing a deal that will pay him $6 million less than what an older, injury-plagued Jorge Polanco just signed for.Given that we don't have access to the same type of robust, granular data from NPB as we do for MLB players in the public sphere, the contract Murakami just signed seems telling. We're talking about a 26-year-old with legit 70-grade power – he hit 56 homers in a season once and had a max exit velocity of 116.5 mph last season – the fact that Murakami ended up settling for a two-year deal worth less annual than what Ha-seong Kim and Polanco just got tells us that there are grave concerns about his ability to translate his skills to the majors. And I'm mostly inclined to just leave it at that. MLB teams aren't infallible, and when it comes to a player making the transition from NPB to the majors, there's an inherent uncertainty that makes it harder to say with confidence whether this will end up being a good deal or not. But there are no shortage of teams with the need for a potential 30-plus power hitter in the middle of the lineup, and the fact that Murakami ended up with a similar contract to the ones Jurickson Profar and Tyler O'Neill signed last season (while being significantly older and with pretty mediocre MLB track records) stands out as a pretty big red flag, one Fantasy player shouldn't just ignore. \nI'm not going to totally bury him in my rankings but given that the White Sox (and the other 29 teams, frankly) know a whole lot more about Murakami than we do, I am very much inclined to view him with a skeptical eye. We'll get to the scouting report for Murakami shortly, but the long and short of it is there are significant contact questions with his swing that make his likelihood of living up to the loftiest expectations pretty unlikely. I was willing to give him the benefit of the doubt as a prospect if he signed for big money, but with the details in now, it seems like MLB teams just don't have a lot of faith in his swing. If MLB teams are telling us they don't have much more faith in him than they do in Polanco, we should probably listen. So, for Fantasy, I'm not going to rank Murakami as someone you need to draft for your starting lineup, even if he ends up listed as a 3B, a shallow position where power is at a premium. Projecting him as a 3B-eligible player – he may just end up playing 1B or even DH – I'm ranking him 14th at the position, in between two players with some similar skills and deficits in Royce Lewis and Lenyn Sosa. He could hit 30 homers with a manageable batting average, but Murakami's likeliest outcomes in your mental model should probably have shifted to the bad side of the scale with this contract. Here's what you need to know about Murakami: Let's start with the good**which is easier to make sense of with Murakami's profile The first thing to understand about Murakami is the context of the league he's playing in. Last season, the worst qualifying hitter in MLB was Ke'Bryan Hayes, who put together a .235/.290/.306 triple-slash line between Pittsburgh and Cincinnati. The average hitter in the Central League of NPB put together a .242/.302/.350 slash line. Among six teams in the Central League, only five even got to 100 home runs. \nBy comparison, Murakami hit 22 homers in just 56 games, putting up a .286/.392/.659 slash line despite playing through injuries. That was good for a 211 wRC+; over the past decade in MLB, Aaron Judge (2024, 2022, and 2025) and Juan Soto (2020) are the only qualifiers to put up a wRC+ of at least 200 in a season. Murakami has actually managed that feat twice, when he posted a 225 wRC+ in his record-breaking 2022 season. There have been some ups and downs, but Murakami has probably been the best hitter in Japan over the past half-decade on the strength of world-class power. He had a max exit velocity of 116.5 mph last season and by all accounts was putting up average and 90th percentile exit velocities in the same range as some of the best power hitters in MLB. If Murakami isn't an 80-grade power hitter, it's probably not much worse than 70-grade, and he knows how to put it into play in games. 30 homers isn't the ceiling here. If he ends up being an impact player in MLB, it'll almost certainly because he is a well above average power hitter. \nSo, what's wrong with Murakami?Well, it should come as no surprise if you are moderately aware of how these things typically work: He strikes out too much. But in Murakami's case, this goes beyond merely just striking out too much. His strikeout rate has settled in around 29% over the past couple of seasons, and he simply swings and misses too often. Here's what I wrote in an earlier breakdown of Murakami this offseason in the Fantasy Baseball Today Newsletter: \"Per MLB.com, Murakami has had a whiff rate around 36% over the past two seasons, with his strikeout rate jumping to 29% in that stretch. That's a frightening statistic, and his in-zone contact rate is even more troubling, as he was at just 72.6% in 2025, down from 77.1% in 2022 and well below the MLB average of 82.5%. And he was doing that against less-than-MLB-level competition, meaning we might project even more regression there. And Murakami has also notably struggled against high-velocity fastballs, something he'll see a lot more of in the majors than he has in NPB so far.\"How bad is that 72.6% mark? Only Rafael Devers posted a worse mark in 2026 among MLB hitters at 71.4%. That's not a bad comp for Murakami – he shares Devers' elite quality of contact skills and his inability to really handle third base, though he's probably a smidge more selective than Devers – but a comp of one doesn't give you a lot to fall back on. Devers is an outlier even among whiff-prone sluggers, and expecting any hitter to be Rafael Devers is probably asking too much. \nBut it isn't impossible, and Murakami does have the power to make it all work. He'll just constantly be dancing on a knife's edge. Joey Gallo had a similar profile and made it work for a few years, but the ugly years were truly horrendous, and he fell off quickly. Murakami will need to either improve his contact rates to more tolerable levels or be an absolute outlier when it comes to the damage he does when he makes contact.Neither is out of the realm of possibility. He was a better contact hitter earlier in his career, and the fact that NPB and MLB literally use different balls – the NPB ball is a little bit smaller and tackier, leading to more movement – could mean that his specific shortcomings are magnified in Japan in a way that might be less true in MLB. Plus, Shohei Ohtani had some similar issues with in-zone contact when he came over, and obviously that hasn't held him back.Murakami has some legitimate MLB-caliber skills, and the upside here is enough that he should still be drafted in all Fantasy leagues in 2026. But there's no question that this contract gives his detractors ammo and should be a mark against him. Draft him as a cheap source of power in the later rounds and hope he manages to avoid the worst-case scenarios. If he's off the board around 200, you've probably managed the risk well enough that he's worth having around, even if the likeliest outcome might have shifted more toward the Matt Wallner edge of the spectrum. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Baseball Offseason Reactions: Munetaka Murakami's deal with White Sox spells trouble - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/09/df36a1f3-4edb-40d7-a75d-f2a3e47c8cb6/thumbnail/1200x675/88e72fa9dfae039c3f0045254943623f/munetaka-murakami-imagn-images.jpg"
      ],
      "datePublished": "2025-12-21T23:15:23.000Z",
      "dateModified": "2025-12-21T23:15:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL Week 16 picks, odds, picks predictions: Best bets from our team of experts - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-week-16-odds-predictions-expert-picks-patriots-nfc-south-nfc-north/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/ce8b608f-e0a7-4fbd-ac5e-30f02f1b9f6b/thumbnail/1200x675/d611be5dbf5826eb256020ba25c6a507/dan-campbell-jared-goff-lions.jpg",
    "tag": "Sports",
    "date": "2025-12-21T18:21:59.000Z",
    "description": "\n        With just three weeks left in the 2025 regular season, these games carry substantial weight as we continue to mold the playoff picture. In We",
    "body": "\n        With just three weeks left in the 2025 regular season, these games carry substantial weight as we continue to mold the playoff picture. In Week 16, there are several playoff-clinching scenarios in which teams could punch their tickets to the postseason, including the San Francisco 49ers and New England Patriots facing win-and-in situations. Those raised stakes make the upcoming slate that much more entertaining to not only watch, but wager on as well. As we do every week throughout the season, we've collected all of the best picks and gambling content from CBS Sports and SportsLine and put them in one convenient place, so you can get picks against the spread from our CBS Sports experts as well as additional feature content for each game, including plays from top SportsLine experts and the SportsLine Projection Model, best bets from our staff, survivor picks and more. Ready? Let's jump in.     All NFL odds via DraftKings Sportsbook.Falcons at CardinalsSunday, 4:05 p.m. on Fox (Stream: Fubo -- try for free)\nFalcons -2.5: \"These two are among the biggest disappointments of the year. The Cardinals are decimated by injuries, which shows up on defense. The Falcons showed they could score against Tampa Bay with Kirk Cousins at quarterback and that will continue in this one. Falcons win it.\" -- CBS Sports Senior NFL analyst Pete Prisco on why he has Atlanta covering in Arizona. To see the rest of his Week 16 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Falcons (-2.5) at Cardinals\n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Cardinals\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Falcons\n                    \n    \n    Jaguars at BroncosSunday, 4:05 p.m. on Fox (Stream: Fubo -- try for free)\nBroncos -3: \"If I'm worried about anything here, it's whether the Jags defense can slow down the Broncos offense. Bo Nix has gotten hot over the past few weeks: He's averaging 282.5 passing yards per game over the past four weeks and the Jaguars are 2-3 this season when their opponent throws for more than 280 yards. The Broncos are a perfect 7-0 at home this year and they have a lot to play for: If they go 2-1 in their final three games, they'll clinch the No.1 overall seed in the AFC no matter what happens in any other game. I feel like the Jags will keep this close, but the Broncos end up winning a thriller, which means no one will get to see Jaxson De Ville in a thong, except maybe Mrs. De Ville.\" -- CBS Sports NFL writer John Breech on why he has Denver staying perfect at home with a win over Jacksonville. To see the rest of his Week 16 picks, click here.\n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Jaguars at Broncos (-3)\n                            \n    \n                                                \n                    \n    \n        \n                            Jaguars\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Broncos\n                    \n    \n    Raiders at TexansSunday, 4:25 p.m. on CBS (Stream on Paramount+)\nTexans -14.5: \"The Raiders are bad right now with little semblance of an offense, while the Texans are the best defense in the league. That's a bad combination. The Raiders are also playing consecutive road games with no chance for the playoffs, while the Texans would be in the postseason right now and need it. Texans in a blowout.\" -- CBS Sports Senior NFL analyst Pete Prisco on why he has Houston covering the monster spread, 31-9. To see the rest of his Week 16 picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Raiders at Texans (-14.5)\n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texans\n                    \n    \n    Steelers at LionsSunday, 4:25 p.m. on CBS (Stream on Paramount+)\nLions -7: \"I just don't think the Steelers can score enough to keep up with the Lions -- even against an injury-ravaged Detroit defense. You can run on the Steelers, as we have seen in recent weeks, and this feels like a game where Jahmyr Gibbs gets back on track in a big way after he struggled to run the ball against the Rams last week. Unless an offensive explosion comes out of nowhere for Pittsburgh, I like the Lions to win big.\" -- CBS Sports' Jared Dubin on why he has the Lions taking down Pittsburgh, 31-17. To see the rest of his picks, click here. \n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Steelers at Lions (-7)\n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Steelers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Lions\n                    \n    \n    Ravens at PatriotsSunday, 8:20 p.m. on NBC (Stream: Fubo -- try for free)\nSportsLine's Mike Tierney is the expert you want in your corner when trying to zero in on a wager for Sunday night's matchup between the Patriots and Ravens. In his last 46 picks involving Baltimore, Tierney is on a 31-14 roll (+2505), making him a must-see source in Week 16. We can tell you he's leaning Under the 48.5 total, but to see his official play for Sunday's primetime affair, you'll need to go to SportsLine. \nRavens -3: \"If the Ravens offense has struggled at one thing this year, it's scoring in the red zone. They've scored a touchdown on just 44% of their trips, which ranks 31st in the NFL. The good news for the Ravens is that the Patriots are the perfect opponent to face when you're trying to fix your red zone issues. The Patriots' defense has surrendered a TD on 75% of opponents' red-zone trips, which ranks dead last in the NFL (to put that in perspective, only three teams are above 70%, including New England). The Ravens are healthy and they're going to be desperate because a loss could crush their playoff hopes. I'll say they keep their postseason dreams alive with a big win against New England.\" -- CBS Sports NFL writer John Breech on why he likes Baltimore to pull off the win against the Patriots on Sunday night. To see all of his Week 16 picks, click here.\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            Patriots at Ravens (-3)\n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Patriots\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Patriots\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Ravens\n                    \n    \n    49ers at ColtsMonday, 8:15 p.m. on ESPN (Stream: Fubo -- try for free)\nNeed a little help formulating your pick for this \"Monday Night Football\" showdown in Indy? Allow SportsLine's Micah Roberts to be of assistance. He's been the go-to source when it comes to betting on games involving the 49ers, owning an 18-4 record over his last 22 picks. Now, Roberts has released his best bet for the Week 16 finale, so you won't want to miss how he's attacking this matchup. We can tell you he is leaning Under the 46.5 point total, but to see his official spread pick, you'll need to go to SportsLine.49ers -6.5: \" Grandpa Rivers did a pretty solid job in his return to the field last week against Seattle. It's almost embarrassing that the Seahawks needed a game-winning field goal to win. I imagine Lucas Oil Stadium is going to be rocking for this prime-time matchup, but the difference in this game is going to be the 49ers' offense vs. the Colts' defense. The versatile Christian McCaffrey has been one of the best players in the entire NFL this season, George Kittle has crossed 65 yards receiving in five straight games, Jauan Jennings caught two touchdowns last week and Brock Purdy has found a rhythm. With the number under a touchdown, I have to roll with the 49ers.\" -- CBS Sports' Jordan Dajani on why he has the Niners covering in Indianapolis as one of his top bets of Week 16. To see the rest of his picks, click here.\n\n                    \n    \n                                            \n                    \n                                    Pete Prisco\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jared Dubin\n                            \n            \n                    \n    \n                                            \n                    \n                                    Ryan Wilson\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Breech\n                            \n            \n                    \n    \n                                            \n                    \n                                    Tyler Sullivan\n                            \n            \n                    \n    \n                                            \n                    \n                                    Dave Richard\n                            \n            \n                    \n    \n                                            \n                    \n                                    Jamey Eisenberg\n                            \n            49ers (-6) at Colts\n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            49ers\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Colts\n                    \n    \n    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL Week 16 picks, odds, picks predictions: Best bets from our team of experts - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/ce8b608f-e0a7-4fbd-ac5e-30f02f1b9f6b/thumbnail/1200x675/d611be5dbf5826eb256020ba25c6a507/dan-campbell-jared-goff-lions.jpg"
      ],
      "datePublished": "2025-12-21T18:21:59.000Z",
      "dateModified": "2025-12-21T18:21:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Ravens vs. Patriots: Daily Fantasy lineup advice for 'Sunday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-ravens-patriots-daily-fantasy-picks-stacks-fanduel-draftkings-lineup-advice-sunday-night-football/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/55867e98-10ab-44f7-b364-e2ec88d3a1ea/thumbnail/1200x675/666467fd8c39cf29b2d39270cfd60047/derrick-henry-ravens.jpg",
    "tag": "Sports",
    "date": "2025-12-22T00:01:18.000Z",
    "description": "\nThe Baltimore Ravens host the New England Patriots in the Week 16 edition of 'Sunday Night Football' at 8:20 p.m. ET. New England ranks seventh in th",
    "body": "\nThe Baltimore Ravens host the New England Patriots in the Week 16 edition of 'Sunday Night Football' at 8:20 p.m. ET. New England ranks seventh in the NFL in scoring offense at 27.3 points per game, while Baltimore is 14th at 23.9 points. It's a loaded NFL DFS player pool with names like Lamar Jackson, Drake Maye, Stefon Diggs, Derrick Henry and TreVeyon Henderson to choose from. However, rostering big names like that also means you'll have to find value elsewhere to balance your daily Fantasy football lineups.How should you build your NFL DFS lineups for 'Sunday Night Football,' and which sleepers should factor into your NFL DFS strategy? Before making any Patriots vs. Ravens DFS picks on sites like FanDuel or DraftKings for 'Sunday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. \nMcClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to the 'Sunday Night Football' DFS slate and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. Top NFL DFS picks for Ravens vs. PatriotsOne of McClure's top NFL DFS picks for 'Sunday Night Football' is Henry. The 31-year-old is showing no signs of wearing down this season as he's coming off an extremely efficient day against the Bengals last week, rushing for 100 yards on just 11 carries. The 9.1 yards-per-carry average was his second highest of the season. The Pats have a much tougher run defense, but Henry has already scored this season against tough rushing defenses like the Lions and Texans, so you can confidently put him in your NFL DFS lineups. See who else to roster at SportsLine. Bet Henry to go Over 80.5 rushing yards at DraftKings, where new users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:\nMcClure is also building his 'Sunday Night Football' NFL DFS strategy around Baltimore tight end Mark Andrews. While New England's defense has been strong overall, one area it has struggled in is defending opposing tight ends, giving up the 25th-most points to that position. Andrews has seen at least five targets in four of his past six games, and as a bonus, he's been used in the run game occasionally this season, taking nine carries and scoring once on the ground. See who else to roster at SportsLine. Bet Andrews to go Over 31.5 receiving yards at DraftKings:\nHow to set Patriots vs. Ravens DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Sunday Night Football.' This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Sunday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Ravens vs. Patriots: Daily Fantasy lineup advice for 'Sunday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/55867e98-10ab-44f7-b364-e2ec88d3a1ea/thumbnail/1200x675/666467fd8c39cf29b2d39270cfd60047/derrick-henry-ravens.jpg"
      ],
      "datePublished": "2025-12-22T00:01:18.000Z",
      "dateModified": "2025-12-22T00:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]