[
  {
    "title": "UFC 324 predictions, best bets to consider for the main card in Las Vegas - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-324-predictions-odds-best-bets-picks-justin-gaethje-paddy-pimblett-sean-omalley-song-yadong/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/206cb87b-ebb6-4818-a571-21cd1f1cb6df/thumbnail/1200x675/6b64c20ed764b0c41c17532d991928aa/sean-omalley-noche-ufc.jpg",
    "tag": "Sports",
    "date": "2026-01-22T20:00:48.000Z",
    "description": "\n        Saturday marks the first UFC event of the year, as well as the first UFC event of the Paramount Era, when UFC 324 comes to Las Vegas. The sta",
    "body": "\n        Saturday marks the first UFC event of the year, as well as the first UFC event of the Paramount Era, when UFC 324 comes to Las Vegas. The stacked card is headlined by an interim lightweight title fight between Justin Gaethje and Paddy Pimblett.Gaethje has already held the interim lightweight title once in his career, as well as holding the ceremonial BMF title, but has never managed to hold an undisputed UFC championship. Regaining the interim title on Saturday is likely Gaethje's last path to finally achieving that feat.To do so, Gaethje will have to get past a rising star in Pimblett, who is undefeated in his Octagon career and looking to score the biggest win of his career when he faces one of the most exciting fighters in MMA history.Subscribe to Paramount+ now to get access to UFC 324 for just $8.99 per monthThe rest of the card is loaded with former champions, rising contenders and familiar names.\nAs with any UFC pay-per-view event, there's sure to be plenty of action at the sportsbook window, and with that in mind, we are taking a look at the best bet to make for every main card fight at UFC 324.  \n        \n            \n                UFC 324: Now more mature, Paddy Pimblett can make good on lofty expectations he had upon his UFC debut\n                \n                    Brent Brookhouse                \n            \n                            \n    \n                \n                    \n    \nAfter going 31-25 for our best bets in 2025, we'll look keep our roll going to start the year on Saturday, with our only rule remaining that all bets must be at odds of -250 or better. Let's take a look at this week's picks with odds via DraftKings Sportsbook.Arnold Allen\tvs.\tJean SilvaJean Silva via KO/TKO/DQ or submission +120Silva is a -258 favorite and you can get a line on him to win via either KO or decision at -250. Still, it seems the value is in taking Silva by some form of stoppage. Allen is a tough fighter who has never been stopped in his career. But Silva is nasty and dynamic in his attack, presenting a lot of problems for opponents. Allen has also been sidelined since a July 2024 win over Giga Chikadze. Coming back after a year and a half on the sidelines and having to face someone who brings the kind of wild pace that Silva does is a big ask. Silva's game is a little too wild at times, and Diego Lopes delivered a crushing reality check with a TKO win over Silva in September, but Silva has the right kind of opportunity to bounce back in a big way against Allen, who has lost two of his three most recent fights.\nNatalia Silva\tvs.\tRose NamajunasNatalia Silva via decision (-225)The line has moved slightly, with Namajunas having been around +320 a few days ago and now sitting at +300. This is a tough fight for the multiple-time former strawweight champion. Silva is on an absolute tear right now, with a 7-0 record in the Octagon and back-to-back wins over former UFC champions Jessica Andrade and Alexa Grasso. Namajunas' best chance to win is to get the fight to the ground, but Silva has shown excellent takedown defense against very good fighters. Namajunas has found ways to claw back from the brink of falling out of contention several times in her career, but Silva appears to be at the head of the next wave of flyweights. Five of Silva's seven UFC wins have come via decision and Namajunas seems unlikely to get stopped in a three-round fight, even if Silva gets the win.Waldo Cortes-Acosta\tvs.\tDerrick LewisOver 1.5 rounds (-145)Heavyweight is always something of a crapshoot, and it's entirely possible that picking the over in a fight involving UFC's all-time leader in knockouts (Lewis with 16) is the wrong play. Still, Lewis is facing a man in Cortes-Acosta who has played it safe in many of his fights. While he has back-to-back impressive knockouts of Ante Delija and Shamil Gaziev, it feels like Cortes-Acosta knows that the easiest path to victory is probably to work for takedowns off of leg kicks and try to score a grinding win. Lewis is good at getting up after being taken down, but he only defends takedowns at a 52% clip. That should lead to a fight that gets past the halfway point unless Lewis can find the opportunity to land one of his patented bombs for an early knockout.Sean O'Malley\tvs.\tSong YadongSean O'Malley moneyline (-205)After winning the bantamweight title, O'Malley ran into the exact wrong kind of opponent in Merab Dvalishvili. Dvalishvili's relentless pace and takedown attack served as the perfect kryptonite to O'Malley's game. Fortunately for O'Malley, Yadong's game is nothing like that. Yadong does not have a strong takedown game and wants to operate on the feet. In the striking realm, O'Malley had the edge, with more creativity and sharpness, as well as high-level accuracy that should be enough for him to win almost every exchange. Add in that O'Malley knows this fight is close to do-or-die for his standing as a top bantamweight, and I expect the former champion to roll on Saturday night.\nJustin Gaethje\tvs.\tPaddy PimblettPaddy Pimblett moneyline (-230)Gaethje is the quintessential all-action fighter, and he has enough power to be a threat at any moment in any fight. Pimblett's length, creativity in pressuring with grappling and dynamic top game are going to present challenges for Gaethje, however. Gaethje is 37 and with a lot of miles on his body. He also has fought just once since his April 2024 last-second knockout loss to Max Holloway at UFC 300. There are too many things working in Pimblett's favor entering this fight to pick against him getting the biggest win of his career in the first main event of the Paramount era.Who wins Gaethje vs. Pimblett, and how exactly does the fight end? Visit SportsLine now to get detailed picks and analysis from the incomparable expert who is up over $21,000 on his UFC picks since May 19, 2018, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 324 predictions, best bets to consider for the main card in Las Vegas - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/206cb87b-ebb6-4818-a571-21cd1f1cb6df/thumbnail/1200x675/6b64c20ed764b0c41c17532d991928aa/sean-omalley-noche-ufc.jpg"
      ],
      "datePublished": "2026-01-22T20:00:48.000Z",
      "dateModified": "2026-01-22T20:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Browns coaching search: Jesse Minter joins Mike McDaniel in withdrawing candidacy - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/mike-mcdaniel-withdraws-from-browns-coaching-search/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png",
    "tag": "Sports",
    "date": "2026-01-22T19:27:17.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jesse Minter is the latest candidate to remove him",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        Jesse Minter is the latest candidate to remove himself from the running to be the Cleveland Browns' next head coach. The Los Angeles' Chargers defensive coordinator is not going forward Thursday's scheduled meeting with the Browns, according to Cleveland.com. Minter's decision comes after former Miami Dolphins head coach Mike McDaniel withdrew his name from the team's coaching search. McDaniel since accepted an offensive coordinator position with the Chargers if he does not land one of the league's other head coaching openings. Minter's decision was likely based on his belief that he has other head coaching opportunities that are more certain, according to the report. He is, for example, considered to be a strong candidate for the Baltimore Ravens opening, which offers a roster that includes two-time MVP Lamar Jackson and future Hall of Fame running back Derrick Henry. With Minter out of the running, the Browns will move ahead in their search to find their next coach. The team conducted second interviews with defensive coordinator Jim Schwartz, former Ravens offensive coordinator Todd Monken, Jacksonville Jaguars offensive coordinator Grant Udinski and Los Angeles Rams passing game coordinator Nate Scheelhaase. \nThe Browns are in this position after firing Kevin Stefanski following a 5-12 campaign. Stefanski has since replaced Raheem Morris as the Atlanta Falcons' new head coach. While they are one of the NFL's historic clubs, the Browns have struggled to remain relevant since they fired Bill Belichick after the 1995 season. Upon their return in 1999, the Browns have had just three winning seasons and two playoff appearances, both which came under Stefanski, who also led Cleveland to its first playoff win in over a quarter century. \nCleveland's current roster includes likely 2025 Defensive Player of the Year Myles Garrett, but it also has several serious question marks, including at quarterback with Shedeur Sanders, Dillon Gabriel and Deshaun Watson all under contract. Whoever becomes the next head coach will be tasked with determining which quarterback will be under center when the Browns being the 2026 season. \n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Browns coaching search: Jesse Minter joins Mike McDaniel in withdrawing candidacy - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/ab495872-2033-43a1-bde2-48a56eb3a0b7/thumbnail/1200x675/3fac7da23d7608dc94293bac047e3e0e/minter.png"
      ],
      "datePublished": "2026-01-22T19:27:17.000Z",
      "dateModified": "2026-01-22T19:27:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NFL playoff schedule: Dates, times, TV, live stream for title games, results for each round - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/19/20b1300c-a026-4379-b905-d2d628d19cff/thumbnail/1200x675/dc43b48b5883c4f515685fd9bc35fd71/graphic-nflbracket-ramscg.jpg",
    "tag": "Sports",
    "date": "2026-01-22T19:25:51.000Z",
    "description": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                      ",
    "body": "\n\n\n    \n                                    Here's the full schedule for every NFL playoff game being played this year\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Jan 22, 2026\n                            \n                    at\n    2:25 pm ET\n                        \n                •\n            \n            6 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                CBS Sports design\n            \n            \n    \n        The 2025 NFL season is officially down to its final four teams. The divisional round ended on Sunday with the Los Angeles Rams going into Chicago and pulling off a dramatic 20-17 overtime win over the Bears. The Rams are now headed to the NFC Championship game for the first time since 2021, a season that ended with them winning the Super Bowl. In the NFC title game, the Rams will be heading to Seattle to face the Seahawks for the third time this season. The teams split their two regular-season meetings with the Rams winning in Week 11 (21-19) and the Seahawks winning in Week 16 (38-37). The Seahawks earned their way to the NFC Championship by absolutely destroying the 49ers in a 41-6 win on Saturday night. The Seahawks are in the NFC title game for the first time in 11 years. In the AFC, the Denver Broncos are headed to the conference title game after beating the Buffalo Bills, 33-30 in overtime, in what was easily the wildest game of the divisional round. The Broncos' vaunted defense forced five turnovers, including four from Josh Allen, who threw two interceptions while also losing two fumbles. The top-seeded Broncos will now host New England in the AFC title game with a trip to Super Bowl LX on the line. The Patriots advanced on Sunday after beating the Texans, 28-16. The Broncos and Patriots are facing each other in the AFC title game for the third time in 13 years. The two previous meetings were both played in Denver and the Broncos won both of them. If the Broncos are going to get to the Super Bowl this year, they're going to have to do it without Bo Nix, who suffered a season-ending ankle injury against Buffalo. For the Patriots, it will mark their first trip to the conference title game since 2018 in what ended up being the final appearance by Tom Brady and Bill Belichick. With that in mind, let's take a look at the full playoff schedule.Divisional Round scheduleSaturday, Jan. 17(1) Broncos 33-30 (OT) over (6) Bills. The Broncos have had one of the best defenses in the NFL all year and Josh Allen found out firsthand why they're so good. The Bills turned the ball over five times with four of those coming from Allen. The Bills QB threw an interception in overtime that set up Denver's game-winning drive. Bo Nix also came up big for the Broncos, throwing for 279 yards and three touchdowns in the win. (1) Seahawks 41-6 over (6) 49ers. Rashid Shaheed returned the opening kickoff 95 yards for a touchdown and this game was essentially over after that. The Seahawks defense absolutely suffocated the 49ers, forcing three turnovers while sacking Brock Purdy twice. They also kept San Francisco out of the end zone for the second straight time after also holding the 49ers without a touchdown in Week 18. With Sam Darnold dealing with an oblique injury, the Seahawks put their offense in the hands of Kenneth Walker, who rushed for 116 yards and three touchdowns. Sunday, Jan. 18(2) Patriots 28-16 over (5) Texans. The Texans' defense was the best in the NFL all season, but it was the Patriots' defense that stole the show in this game. The Patriots forced five turnovers, including a pick-six from Marcus Jones in the second quarter that gave New England an early 14-10 lead. Drake Maye had some fumbling problems, but he also came up with some huge plays, including a 32-yard touchdown pass to Kayshon Boutte in the fourth quarter that iced the win. The Texans are now 0-7 in the divisional round in franchise history and are the only team in the NFL that has yet to make it to the conference title game. (5) Rams 20-17 (OT) over (2) Bears. The Rams pulled off a dramatic win that wasn't decided until Harrison Mevis drilled a 42-yard field goal in overtime. The only reason the game made it to overtime is because Caleb Williams threw a miraculous 14-yard touchdown pass on fourth down with under 30 seconds left to play. The Bears looked like they were going to pull out the win in overtime, but Williams threw an interception that set up the Rams' game-winning drive. Championship SundaySunday, Jan. 25\nAFC ChampionshipPatriots at Broncos, 3 p.m. ET (CBS, Paramount+)NFC ChampionshipRams at Seahawks, 6:30 p.m. ET (Fox; Fubo, try for free)Super Bowl LXSunday, Feb. 8AFC champion vs. NFC champion at Levi's Stadium (Santa Clara, California), 6:30 p.m. ET (NBC)Wild Card resultsSaturday, Jan. 10(5) Rams 34-31 over (4) PanthersRams vs. Panthers recap: The Panthers almost pulled off the upset, but they couldn't stop Matthew Stafford with the game on the line. With the Rams trailing 31-27, Stafford engineered a 71-yard game-winning scoring drive that ended when he hit Colby Parkinson with a 19-yard touchdown with just 38 seconds left to play. Stafford threw for 304 yards and three touchdowns in the win. (2) Bears 31-27 over (7) PackersPackers vs. Bears recap: The Bears pulled off the third-largest fourth-quarter comeback in NFL history. Going into the final quarter, the Bears were trailing by 15 points, but they were able to erase that deficit during a miracle quarter where they outscored the Packers, 25-6. Caleb Williams threw for more yardage (184) in the fourth quarter than he did in the first three quarters combined (177). Williams capped things off with a 25-yard score to DJ Moore with just 1:43 left to win the game. Sunday, Jan. 11(6) Bills 27-24 over (3) JaguarsBills vs. Jaguars recap: For the first time in his career, Josh Allen led a game-winning drive in the fourth quarter of a playoff game. The Bills' franchise quarterback scored the game-winning touchdown on a 1-yard run with just one minute left to play. Allen also threw a 15-yard TD pass in the fourth quarter to help propel Buffalo to the win. Allen totaled 306 yards and three touchdowns in the win. For the Bills, it was their first road playoff win in 33 years. (6) 49ers 23-19 over (3) Eagles49ers vs. Eagles recap: The 49ers pulled off a shocker by going on the road and knocking off the Eagles. After losing George Kittle, the 49ers had some unlikely heroes, including Demarcus Robinson, who caught six passes for 111 yards and a touchdown. Christian McCaffrey also came up big with two touchdowns, including the game-winning score, which came on a 4-yard pass from Brock Purdy with just 2:54 left to play. (2) Patriots 16-3 over (7) ChargersChargers vs. Patriots recap: The Patriots defense took over and carried New England to the win. Justin Herbert was sacked six times as the Patriots kept the Chargers out of the end zone and held them to fewer than 210 total yards.The offense didn't light up the scoreboard, but Drake Maye was impressive in his first career postseason start, throwing for 268 yards and rushing for 66 more. The Patriots are headed to the divisional round for the first time since 2018.Monday, Jan. 12(5) Texans 30-6 over (4) Steelers\nTexans vs. Steelers recap. The Texans had the best defense in the NFL during the regular season, and that unit carried them to a win against Pittsburgh. The Texans defense sacked Aaron Rodgers four times, held the Steelers to just 175 yards and scored two touchdowns, which both came in the fourth quarter. The first one came on a 33-yard fumble return by Sheldon Rankins, and then Calen Bullock followed that up with a 50-yard pick six with just 2:39 left in the game. It was a defensive masterpiece by a Texans team that picked up its first road win in franchise history\n            \n    \n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NFL playoff schedule: Dates, times, TV, live stream for title games, results for each round - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/19/20b1300c-a026-4379-b905-d2d628d19cff/thumbnail/1200x675/dc43b48b5883c4f515685fd9bc35fd71/graphic-nflbracket-ramscg.jpg"
      ],
      "datePublished": "2026-01-22T19:25:51.000Z",
      "dateModified": "2026-01-22T19:25:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Has Mets rebuild improved the team enough? Plenty of questions linger - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mets-roster-rebuild-bo-bichette-marcus-semien-freddy-peralta/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/077d738e-03b6-4252-ab71-de216282d113/thumbnail/1200x675/373d118255da1ec719e79c5e68f99f88/bichette-getty.png",
    "tag": "Sports",
    "date": "2026-01-22T19:18:36.000Z",
    "description": "\n        These last two seasons from the New York Mets have been a roller coaster ride and, after the aggressive offseason undertaken this time around",
    "body": "\n        These last two seasons from the New York Mets have been a roller coaster ride and, after the aggressive offseason undertaken this time around, 2026 will again be quite the ride.Remember, the Mets were a punchline toward the start of 2024, falling as far back as 17 ½ games by mid-June, before they got awesome. They ended up in the NLCS. Then they signed Juan Soto and stormed out to the best record in baseball in 2025. They were 45-24 after a win on June 12, putting them on pace to win 106 games. We don't need to rehash what came next. This offseason, Mets president David Stearns has been very aggressive in remaking his MLB roster. They might not be done, but it feels like the only thing left would be at-the-margins tweaks. Let's take a quick look at how things look with spring training right around the corner. The lineup could look something like this: 1. Francisco Lindor, SS2. Juan Soto, RF3. Bo Bichette, 3B4. Jorge Polanco, 1B5. Marcus Semien, 2B6. Mark Vientos/Brett Baty, DH7. Francisco Alvarez, C8. Luis Robert Jr., CF9. Carson Benge/Tyrone Taylor, LF\nThat's a stellar 1-3 and the rest of the lineup has a lot of upside. Now, the rotation.  Freddy Peralta, Nolan McLean, David Peterson, Sean Manaea, Kodai Senga and Clay Holmes makes six. Tobias Meyers can serve as a swingman (long reliever/spot starter) and there's still youngster Jonah Tong, not to mention the returning Christian Scott, who had Tommy John surgery in 2024. There are, of course, question marks all over the place. Many will be answered in the positive, but there will be some answered in the negative. Bichette has to learn third base while Polanco has to learn first. Things could turn out just fine, given they are both moving downward on the defensive spectrum, but there's always a question of how learning a new position impacts a player. It can even affect the offensive output. It's not like there are zero questions on the offensive side for either player here. Semien was incredibly reliable and had posted 7+ WAR seasons three of the last four full years through 2023. He regressed in 2024 and then did so again last season to .230/.305/.364 (97 OPS+). Worse yet, he spent time on the injured list for the first time since 2017. He's now 35 years old. Age-related decline concerns are reasonable.Which Vientos are they getting? Could Baty make those flashes into consistency? How about Alvarez?Robert has been so injured and inconsistent in his career, but that 2023 season showed it's possible there's a star in there.McLean looked like an ace for eight major-league starts, but it was only eight starts at age 24. Which Peterson shows up? Which Manaea? Can Senga stay off the injured list? We didn't mention the bullpen yet, but all bullpens are volatile by nature and there are plenty of concerns with Devin Williams, Luke Weaver and A.J. Minter at the back end here.Every player listed above has somewhere from good to immense upside. I could have named a few others, too. \nFew teams have a bunch of surefire great players. The Mets look like they have at least two in Lindor and Soto and we might be able to add Peralta to that list. Then it's a bunch of question marks, but, again, there's no denying just how much upside so many of these players have. What if the Mets get 2023 Robert along with the best versions of Bichette and Polanco while Vientos looks like his 2024 self? Meanwhile, Manaea also parties like it's 2024 while McLean doesn't miss a beat and Senga stays healthy for 30 starts? Let's say Williams and Weaver are the best versions of themselves all year too. That's a dominant team right there.Things could fall apart, too. Of course they could. There are a lot of ways. It's a relatively risky bunch. \nSimply, this Mets team, as currently constructed, looks like a playoff-caliber team (-225 to make the postseason, per Caesars). If things totally come together and enough of the questions end up working out as best as could be expected, the Mets could well win the World Series. If enough of the concerns turn out negative, the 2026 season ends up in similar fashion to 2025 as they miss the playoffs. The most likely result feels somewhere in the middle, with the Mets making the playoffs and failing to make the World Series. Still, it's gonna be a lot of fun watching it all unfold. Riding roller coasters is an exhilarating activity. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Has Mets rebuild improved the team enough? Plenty of questions linger - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/077d738e-03b6-4252-ab71-de216282d113/thumbnail/1200x675/373d118255da1ec719e79c5e68f99f88/bichette-getty.png"
      ],
      "datePublished": "2026-01-22T19:18:36.000Z",
      "dateModified": "2026-01-22T19:18:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Patriots have kicked up their defense a notch en route to AFC title game vs. Broncos - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-defense-wreaking-havoc-what-changed-afc-title-game-broncos/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/18/7d933d28-f5ff-4ff9-960a-49861b3b216e/thumbnail/1200x675/980ddfb4f68650223a9e5ecdd35724bb/gettyimages-2256951720.jpg",
    "tag": "Sports",
    "date": "2026-01-22T19:49:36.000Z",
    "description": "\n        The AFC crown is on the line Sunday between the Denver Broncos and New England Patriots (sentences from 2015), and most of the attention will",
    "body": "\n        The AFC crown is on the line Sunday between the Denver Broncos and New England Patriots (sentences from 2015), and most of the attention will be on the offenses. Will MVP candidate Drake Maye begin his ascension to the NFL's elite with a good showing against another great defense in the Broncos? How does backup QB Jarrett Stidham fare in his first extensive game reps in a long time? What will Broncos' head coach Sean Payton do to help Stidham and keep the offense afloat?However, I think one part of this game has been underdiscussed: the Patriots' defense has turned the aggression meter up by 1000, and it's helped them turn in some very good defensive performances in the playoffs. Yes, I understand that they played probably two of the weaker offenses in the AFC, but New England's defense has put some strong stuff on tape, and completely changed its stripes from the regular season and it has it on the verge of going back to the Super Bowl.If you want to compare their regular season and playoff splits, the Pats defense has kicked their performance up a notch. Their 1.79 Points Per Drive in the regular season was seventh in the NFL, but their 0.79 Points Per Drive in the playoffs is only behind the Seahawks for the lowest during this playoff run. They're forcing punts on more of their drives and their defensive EPA per play has jumped from 0.06 to 0.34. \n        \n            \n                Patriots vs. Broncos AFC Championship preview: Who has the edge at each position?\n                \n                    Zachary Pereles                \n            \n                            \n    \n                \n                    \n    \nNot too shabby for a defense that sort of took a backseat to the offense for most of the regular season. However, a couple of  numbers stand out when talking about their defensive uptick: their 40.6% blitz rate is second in the playoffs right now, and it's a massive jump from their 27.6% mark during the regular season. On top of that, when they blitz their Havoc Rate is way up to 37.5%, meaning when they bring the house bad things happen for opposing offenses. Interim defensive coordinator Zak Kuhr and head coach Mike Vrabel have leaned into their personnel, and it's completely flipped their defense.\nLet's start up front, in the run game. New England has only given up 3.1 yards per carry on the ground, and they have a havoc rate of 25.2% against the run during the playoffs, second only to the Houston Texans. The Patriots aren't a gap control team in the run game; DTs Christian Barmore (315 pounds) and Milton Williams (290 pounds) lead the defensive tackles in snap counts, and in the regular season New England was struggling on the ground. Against Houston, I think it leaned into its quickness up front and it could be the key to success against the Broncos. They ran a lot of run stunts and games up front, changing the picture on the defensive line. Their edge rushers outside of Anfernee Jennings aren't exactly massive or edge setters in the run game, but when you design them inside moves where they can win with quickness, they cause havoc. This duo run gets wrecked by DT Cory Durden (#93) and EDGE K'Lavon Chaisson (#44) running a game where Chaisson loops inside, and helps to force Marks back into the help on the other side of the line. Duo draws a series of double teams, with man blocking on the other side. The Pats essentially run pick and roll, and Chaisson gets into the backfield.\nHere, they run it out of a five man front with EDGE Elijah Ponder darting inside off Barmore's initial move, and the result is the exact same.\nNow against the pass is where we really see the aggression get turned up. Over the last two playoff games, they blitzed Chargers' QB Justin Herbert and Texans' QB CJ Stroud 42% and 45% respectively, and Stroud especially fared poorly. Against the blitz, Stroud went 6 of 18 for 67 yards, and despite throwing a touchdown he did throw two interceptions. This defensive shift was brought on through missing Williams for an extended period of time with a high ankle sprain, and outside of Williams there aren't many true winners when they rush with four. Across the regular season and playoffs, the Pats pressure rate when not blitzing is 36.4%, compared to 49.3% when they do blitz. Given their personnel and how strong they are in the secondary when healthy, New England has decided to put their trust in the cornerback trio of Christian Gonzalez, Carlton Davis III and Marcus Jones, allowing the front to go absolutely crazy when they decide to turn up the blitz meter.\nThey fooled the Texans a couple of times with blitzes against their under center looks, something that I think could be effective this Sunday as well.\nAgainst a backup QB in Jarrett Stidham who Broncos' head coach Sean Payton has said is \"gonna rip it\" in the AFC title game, playing the chaos game with the blitz could tilt the odds in New England's favor. The Patriots' newfound aggressiveness on the defensive side of the ball might get them caught in bad situations at times, but with the front and secondary playing in sync when they blitz, it could be the biggest reason why New England makes the Super Bowl for the first time since 2019.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Patriots have kicked up their defense a notch en route to AFC title game vs. Broncos - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/18/7d933d28-f5ff-4ff9-960a-49861b3b216e/thumbnail/1200x675/980ddfb4f68650223a9e5ecdd35724bb/gettyimages-2256951720.jpg"
      ],
      "datePublished": "2026-01-22T19:49:36.000Z",
      "dateModified": "2026-01-22T19:49:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warriors assistants do not expect Steve Kerr to return next season, per report - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/warriors-assistants-steve-kerr-next-season/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/6581d244-83a1-49f9-968c-8ec49c527f00/thumbnail/1200x675/7b5c9dc1e2ebe2b4e4c74f812ece0efe/steve-kerr.jpg",
    "tag": "Sports",
    "date": "2026-01-22T19:01:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The week has been difficult for the Golden State W",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The week has been difficult for the Golden State Warriors, whose season became drastically altered with Jimmy Butler's torn ACL.  In the first game after losing Butler, the Warriors lost in a blowout, 145-127, to the Toronto Raptors. Toronto threw multiple defenders at Stephen Curry, forcing other players to beat them. It has been a frustrating week for coach Steve Kerr and company.With no threat of a second reliable scoring option in Butler, the Warriors are now a far easier team against which to game plan. It puts whatever slim chance the Warriors previously had at making a deep postseason run in jeopardy, unless they find the right trade before Feb. 5.While Golden State navigates waters without Butler, next season could represent even more uncharted territory. Kerr is in the final year of his contract, and according to The Ringer's Logan Murdock, several assistant coaches on Kerr's staff are \"operating under the premise that he will not return next season.\"Kerr said in September that he wants to see where things are at the end of the season before talking about a new contract.\n\"I love my job,\" Kerr said. \"I love what I'm doing every day. I can't wait to get to the building. Hopefully I'm here for another few years. But I think it makes sense for the organization and for me to see where this thing is at the end of the year -- where they are and where I am. Hopefully that means we run it back, we keep going with this group, that'd be awesome. But I like the fact we can do it how we want it.\"Kerr also said he was \"very comfortable\" entering this season on an expiring deal, as he, general manager Mike Dunleavy and owner Joe Lacob are all aligned.\"We talked about this -- there's no reason for discussion or concern, \" Kerr said. \"This is kind of a point in our relationship where let's just see how it is at the end of the year.\"\nThis doesn't sound like a situation where Kerr is itching to leave. This all might come down to what path the Warriors take in the wake of Butler's injury. If the Warriors go the nuclear route and decide it's time for a rebuild, then perhaps Kerr doesn't want to be the coach for that era.\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warriors assistants do not expect Steve Kerr to return next season, per report - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/6581d244-83a1-49f9-968c-8ec49c527f00/thumbnail/1200x675/7b5c9dc1e2ebe2b4e4c74f812ece0efe/steve-kerr.jpg"
      ],
      "datePublished": "2026-01-22T19:01:55.000Z",
      "dateModified": "2026-01-22T19:01:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chiefs' Travis Kelce may have just hinted whether he plans to retire or not - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/travis-kelce-retirement-plans-return-to-chiefs-nfl-offseason/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/26/b880ba75-d6f9-4153-9e73-b6589136280e/thumbnail/1200x675/6b28bebd87a2f521be4c189da04a80cc/gettyimages-2253548000-2.jpg",
    "tag": "Sports",
    "date": "2026-01-22T18:54:09.000Z",
    "description": "\n        After 13 NFL seasons, Travis Kelce still hasn't decided if he's going to come back for another year, but he may have offered a small hint abo",
    "body": "\n        After 13 NFL seasons, Travis Kelce still hasn't decided if he's going to come back for another year, but he may have offered a small hint about his future plans during the most recent episode of \"The New Heights\" Podcast, which he hosts with his brother, Jason. During this week's episode, Jason brought up the fact that Eric Bieniemy will be returning as the Chiefs' offensive coordinator. Bieniemy was originally hired by the Chiefs in 2013, which just happened to be Travis' rookie year in the NFL, so the two spent 10 years together before Bieniemy moved on in 2023 to take the Commanders' offensive coordinator job. After one year in Washington, Bieniemy moved on to the college ranks as the offensive coordinator for UCLA. In 2025, he returned to the NFL as the running backs coach for Ben Johnson in Chicago. Now, Bieniemy is returning to Kansas City and Travis definitely sounds excited. \"I love that, shit. I think it's great,\" Kelce said on the podcast. And now, we get to the part where Kelce may have hinted at a possible return. The 11-time Pro Bowler mentioned that he's already excited at the thought of seeing Bieniemy back at the team facility.  \n\"I can't wait to see him back in the building,\" Kelce said. \"He's one of my favorite coaches of all-time, one of my favorite people of all time. I've had so many unbelievable growing moments under him as a player, as a person, and I just love the guy and it's going to be awesome to see him back in the building and see him back wearing the Chiefs logo, baby.\"If Kelce retires, then he won't be in the building anymore, so he wouldn't see Bieniemy there, but if he sticks around for one more season, then it would give him a chance to play one more year with one of his \"favorite\" coaches of all-time. On the podcast, Kelce certainly sounded excited about Bieniemy's return. Retirement speculation aside, Travis seems pretty confident that bringing Bieniemy back into the fold was a smart move for the Chiefs. \n\"I think it's a marriage that's gonna pick up right where it left off,\" Travis said. \"E.B. and who he is as a coach, you can see kind of his personality, what he brings to the table in that Chicago team. I know Ben Johnson has his own version of that, he's a very tough guy, and what he did in Detroit, he brought over as well. And you can see those running backs over in Chicago and their body of work was definitely an Eric Bieniemy style of football.\"Although Kelce's future is still up in the air, he'll almost certainly be making his retirement decision before the start of free agency so that the Chiefs can make their offseason plans. Earlier this month, Travis made it sound like he wanted to see how his body feels before making a decision. \"Right now it's just finding that answer and seeing how the body feels after this [final] game and kinda when it all settles down,\" Travis said at the end of the 2025 season. \nOne of his teammates in Kansas City isn't buying any of the retirement speculation. Chris Jones thinks that Travis will definitely be returning to play at least one more season. \"I'm not buying it, he'll be back next year,\" Jones said in early January. \"I can't promise you anything about another man. This was a tricky year for us. I have faith in my dawg coming back.\"Although Kelce is 36, he showed in 2025 that he still has some juice left in the tank, catching 76 passes for 851 yards and five touchdowns, leading the Chiefs in all three of those categories. \nThere are a lot of reasons why Travis would potentially want to return for one more year. For one, he likely won't want to end his career on a low note, which is what would happen if he calls it quits after a season where the Chiefs went just 6-11. The 2025 season marked just the second time in 13 seasons that Kelce has missed the playoffs. Also, you'd have to think that Patrick Mahomes would love to have Kelce back. The Chiefs quarterback tore his ACL in December and he's going to be motivated to return with a vengeance in 2026 and he's probably love to see Kelce on the field with him when that happens. Kelce actually has a lot to think about this offseason. Not only does he have to consider his football future, but he also has to start planning for the rest of his life. He's currently planning a wedding with his fiancée, Taylor Swift, and the two are expected to tie the knot in June, according to Page Six. If Kelce does return, the Chiefs start their offseason workouts in April, so he'd definitely be staying busy until the wedding rolls around. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiefs' Travis Kelce may have just hinted whether he plans to retire or not - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/26/b880ba75-d6f9-4153-9e73-b6589136280e/thumbnail/1200x675/6b28bebd87a2f521be4c189da04a80cc/gettyimages-2253548000-2.jpg"
      ],
      "datePublished": "2026-01-22T18:54:09.000Z",
      "dateModified": "2026-01-22T18:54:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 NCAA Tournament odds: Michigan still favored, others offer better value - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/2026-ncaa-tournament-odds-michigan-houston-florida/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/2ccb0566-57e9-46b3-bc0e-f9fb4f0e453a/thumbnail/1200x675/78f76dc1003cf7b4cb63fe2a72263f56/untitled-design-168.png",
    "tag": "Sports",
    "date": "2026-01-22T19:02:27.000Z",
    "description": "\n        The 2025 college football season came to a close earlier this week when Indiana defeated Miami in the College Football Playoff National Champ",
    "body": "\n        The 2025 college football season came to a close earlier this week when Indiana defeated Miami in the College Football Playoff National Championship. With football season over, it's time to turn the page toward crowning a college basketball champion.  In just over 10 weeks, there will be one time left standing in Indianapolis as the men's basketball national champion. Florida will head into the tournament as the reigning champion after going on an incredible run last spring. However, there will be new challengers and familiar logos that have the best chance to claim the title and cut down the nets this time around. \n        \n            \n                Trotter's Trends: How Duke's adjustments have it playing with confidence; building the All-Bench All-Stars\n                \n                    Isaac Trotter                \n            \n                            \n    \n                \n                    \n    \nWith the Big Dance just over two months away, Michigan is the current favorite to win the national title at +440. The Wolverines advanced to the Sweet 16 in Year 1 of the Dusty May era and are in the mix to win the program's first national title since 1989.  Arizona (5/1) has been ranked No. 1 for nearly half the season in the AP Top 25 poll and has the second-shortest odds to win the title. Houston (11/1), Duke (11/1) and UConn (12/1) round out the top five. \nHere is a look at some of the best value picks and long shots to win the NCAA Tournament. Odds via FanDuel Sportsbook  Top values \n                            \n    \n                                                \n                    \n     Houston Cougars  Current odds: 11-1 After coming up one possession short of Kelvin Sampson winning his first national title as a coach, the Cougars are back with a roster capable of being the final team standing in April. Since losing to Tennessee in the Players Era Festival in Las Vegas, Houston has won 11 consecutive games. Emanuel Sharp and Milos Uzan are veteran presences, Joseph Tugler is arguably the best defender in the sport, and the play from freshman Kingston Flemings stacks up with the best in his respective class. Houston is only going to get better as the season goes on. The Cougars have what it takes to cut down the nets this time around. My pick (if the tournament were today) would be Houston to win the title. \n                            \n    \n                                                \n                    \n     Florida Gators Current odds: 14-1Don't count out the Gators, yet. Florida is a team I had a chance to watch up close during its run to the title. What impressed me the most was how Florida was able to wear down teams with its frontcourt play. Sure, Florida might not have a closer like Walter Clayton Jr. this time around, but Todd Golden's team is going to be a dangerous out in the tournament. The reason for optimism for Florida is how Xaivian Lee has played as of late. He dropped 20 points in a win over Vanderbilt on the road last weekend. Thomas Haugh is an All-American candidate and Rueben Chinyelu is one of the most underrated players in the sport. Florida has the talent and DNA to repeat as champions. \n\n                            \n    \n                                                \n                    \n     BYU Cougars Current odds: 25-1One of the main reasons I'm optimistic about BYU's chances is that there are not many teams in the sport that have a better \"Big Three.\" That, of course, would be AJ Dybantsa, Richie Saunders and Robert Wright III. Dybantsa is someone in contention to be the No. 1 overall pick in the 2026 NBA Draft and the way he has played the last two months has also put him in the thick of the National Player of the Year race. BYU is coming off its first loss in nearly two months against Texas Tech, but this is a team capable of figuring it out when it matters. BYU has never been to the Final Four. This might be the Cougars' best shot to do just that.  Long shots to consider \n                            \n    \n                                                \n                    \n     Kentucky Wildcats Current odds: 80-1 In our CBS Sports preseason Final Four predictions, I had Kentucky facing Florida for the national title. Although it's still a long shot, if Kentucky can actually make a deep run in the NCAA Tournament, there is still a chance. Kentucky has won three consecutive games -- including a dramatic win on the road over Tennessee -- just days after beating LSU on a last-second shot. Jaland Lowe is out for the season, which means SEC Preseason Player of the Year Otega Oweh will need to step up. Arizona State transfer Jayden Quaintance has played in just four games, but when healthy, he is one of the best defenders in the sport. This season has been far from pretty through the first three months, but Kentucky still has time to turn it around. It's worth considering as a long shot. \n                            \n    \n                                                \n                    \n     Louisville Cardinals  Current odds: 65-1After being one of the best stories in college basketball during Year 1 of the Pat Kelsey era, this season has been a mixed bag for Louisville. The Cardinals started 11-2 but have since lost three of their last five games to drop to 3-3 in ACC play. Louisville is 3-5 against Quad 1 opponents and has seven matchups against those teams during the remainder of the regular season. What will make-or-break Louisville's tournament hopes is star freshman Mikel Brown Jr., who hasn't played in over a month due to injury. When Brown was healthy, he was playing like one of the best point guards in the sport. For what it's worth, Louisville opened the 2025-26 season with the third-shortest odds (behind Duke and Houston) to win the title. \n\n                            \n    \n                                                \n                    \n     Kansas Jayhawks Current odds: 40-1Kansas will have a chance to win the title for one main reason: Darryn Peterson. When he is healthy, Peterson is an elite scorer and arguably the best player in the sport. However, a hamstring injury/cramping has limited Peterson to just 10 games. In six of those games, Peterson logged under 30 minutes. Is Kansas going to win the title this year? Probably not. However, if Peterson is on the floor and healthy, Kansas will have the best player, regardless of the opponent. Guards can single-handedly win games in March. Kansas can only hope that Peterson can do just that. \n        \n            \n                College basketball rankings: Kansas freshman Darryn Peterson showing why he could be No. 1 NBA Draft pick\n                \n                    Gary Parrish                \n            \n                            \n    \n                \n                    \n    \n 2026 NCAA Tournament championship oddsOdds to win the 2026 NCAA Tournament via FanDuel Sportsbook\t\t\t\tTeam\t\t\t\tOddsMichigan+440Arizona+500Houston+1100Duke+1100Connecticut+1200Florida+1500Purdue+1500Illinois+2000Iowa State+2000Gonzaga+2200BYU+2500Alabama+3000Arkansas+3500Texas Tech+3500Vanderbilt+3500Michigan State+3500Nebraska+4000Kansas+4000Virginia+4000St. John's+5000Louisville+6500Kentucky+8000Iowa+10000Tennessee+10000North Carolina+10000SMU+15000NC State+15000Villanova+15000Saint Louis+15000Clemson+20000Wisconsin+20000UCLA+20000Miami+20000Georgia+20000Auburn+20000Saint Mary's+20000Utah State+20000Ohio State+25000Texas A&M+25000Texas+25000TCU+30000Syracuse+30000Indiana+30000Missouri+30000Ole Miss+30000San Diego State+30000West Virginia+30000UCF+30000Creighton+30000Virginia Tech+30000USC+30000Baylor+30000McNeese+50000Boise State+50000LSU+50000Butler+50000Memphis+50000High Point+50000Yale+50000Oklahoma+50000George Mason+50000UC San Diego+50000Oklahoma State+50000Dayton+50000VCU+50000Minnesota+50000UC Irvine+50000Wake Forest+50000Miami (OH)+50000\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 NCAA Tournament odds: Michigan still favored, others offer better value - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/2ccb0566-57e9-46b3-bc0e-f9fb4f0e453a/thumbnail/1200x675/78f76dc1003cf7b4cb63fe2a72263f56/untitled-design-168.png"
      ],
      "datePublished": "2026-01-22T19:02:27.000Z",
      "dateModified": "2026-01-22T19:02:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giannis Antetokounmpo calls out Bucks teammates after 122-102 loss to Thunder - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/giannis-antetokounmpo-bucks-thunder-teammates/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/1a8962ab-1688-4ee2-a852-9b3239053c3c/thumbnail/1200x675/c46ca270ee71d34fef114cde43e22ef0/giannis-antetokounmpo.jpg",
    "tag": "Sports",
    "date": "2026-01-22T18:15:54.000Z",
    "description": "\n        The Milwaukee Bucks are 4-6 in their last 10 games, coming off a blowout loss to the defending champion Oklahoma City Thunder. Shai Gilgeous-",
    "body": "\n        The Milwaukee Bucks are 4-6 in their last 10 games, coming off a blowout loss to the defending champion Oklahoma City Thunder. Shai Gilgeous-Alexander went off for 40 points in the win, and while most teams grow accustomed to losing to OKC, Bucks star Giannis Antetokounmpo still took issue with the effort from his teammates.\"We're not playing hard,\" Antetokounmpo said. \"We're not playing to win. We're not playing together. Our chemistry is not there. Guys are being selfish. Guys will try to look for their own shot instead of looking for the right shot for the team. At times I feel like when we're down 10, 15 20 [points], we tried to make it up in one play. ... You got to know that you have to compete for 48 minutes, and try to get the best shot for 48 minutes. If you don't do that, and you're trying to get the first shot available, on a one-pass shot, it's not going to work on [OKC, Minnesota and San Antonio].\"Antetokounmpo only shot the ball 11 times and finished with 19 points, which is his third-lowest point total this season. It was an abnormal output.\"I'm not the guy that will yell and cuss his teammates out and demand the ball,\" Antetokounmpo said. \"I've never done that in my career, but I feel like I've played with teammates that kinda understand the gravity that I can cause for our team and how I can create for my teammates or for myself and how I can help the team be more successful. But maybe for some reason -- I don't understand. \n\"Maybe because we're young, maybe because we're not playing well, maybe because guys think it's their turn, they want to carry the team on their back and try to turn this around, but I really don't get it. I really don't It's not like I'm not trying to be aggressive. I'm really trying to be aggressive. I have coaches, people that talk to me, they told me there's this thing that's called the white swan and the black swan. You gotta be the black swan and be more aggressive and demand the ball. It's something I've never done in my whole career. Maybe I gotta do it more.\"Antetokounmpo not getting enough shot attempts is primarily a product of his teammates struggling to get him the ball. This was the first possession of that Bucks-Thunder matchup, where OKC sends two defenders at Antetokounmpo in the post, denying any chance of an entry pass.Antetokounmpo averages his fewest touches per game since the year the Bucks won a championship in 2021. And on that championship team, Milwaukee didn't need Antetokounmpo to do everything. They had a free-flowing offense that got Antetokounmpo the ball on the move, but also relied on the scoring from Khris Middleton and Jrue Holiday.\nSeasonTouches per game2025-2671.42024-2583.72023-2479.72022-2377.72021-2273.82020-2170.0On this team, where the second-leading scorer is Kevin Porter Jr., there is no reason for Antetokounmpo to be anything except the primary focus. The defensive pressure he faces contributes, not shooting the ball more than 13 times in each of the last four games.It represents a symptom of poor roster construction. Unless the Bucks plan on making a major move at the trade deadline, the issue may go unsolved. They could certainly try different things to get Antetokounmpo the ball more, having him bring the ball up the floor more, getting him the ball on the move when he's coming downhill or setting off-ball actions to free him up. But he excels when he's able to use his brute force against opponents, and if he can't get the ball in the post as much, it takes away an important part of his game.\"We got to go through this [adversity],\" Antetokounmpo said when asked what's going to fix this. \"Got to watch film, work hard and hopefully by the experience you create through the adversity that you face, and then, you know, the winning and the losses, eventually you're going to get it. But we don't have time for that. We don't. We've got 39 games left, we don't have time. We really don't.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giannis Antetokounmpo calls out Bucks teammates after 122-102 loss to Thunder - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/1a8962ab-1688-4ee2-a852-9b3239053c3c/thumbnail/1200x675/c46ca270ee71d34fef114cde43e22ef0/giannis-antetokounmpo.jpg"
      ],
      "datePublished": "2026-01-22T18:15:54.000Z",
      "dateModified": "2026-01-22T18:15:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MLB rumors: Mets not talking Freddy Peralta extension yet; Twins add Taylor Rogers - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-rumors-free-agency-trades-mets-freddy-peralta-extension-twins-taylor-rogers/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/56e83bde-eeb1-4e8c-ab1b-95602a5e2dd9/thumbnail/1200x675/71dc89ff81fffc011861e6190055ed09/peralta-getty-3.png",
    "tag": "Sports",
    "date": "2026-01-22T18:15:39.000Z",
    "description": "\n        Thursday here in the world of Major League Baseball, we're fresh off two straight nights of late trades involving the New York Mets. They gra",
    "body": "\n        Thursday here in the world of Major League Baseball, we're fresh off two straight nights of late trades involving the New York Mets. They grabbed Luis Robert Jr. on Tuesday and Freddy Peralta (along with Tobias Meyers) Wednesday. Further, the Yankees signed Cody Bellinger Wednesday afternoon and the free-agent pool is finally dwindling. Framber Valdez (No. 4), Eugenio Suárez (No. 14) and Zac Gallen (No. 18) are the only top 20 free agents still available. Pitchers and catchers report to spring training in a few weeks and, thankfully, it seems the offseason in transactions is also winding down. It's almost time for baseball.Still, things will keep happening and we'll round up the news and rumors here. Mets, Peralta not talking extension... yetThe Mets' acquisition of Peralta adds the All-Star righty to the rotation for the 2026 season for just $8 million. He's a free agent after this coming season. In making such a deal, most people assume the acquiring team is interested in pursuing an extension with the player, though that isn't always the case (look at the Cubs and Kyle Tucker last season, for one recent example, or Corbin Burnes and the Orioles a few years back). \nRegarding Peralta and the Mets, The Athletic reports that the plan for the time being is to \"let everyone get comfortable.\" That is, don't immediately hound Peralta about what it would take to extend him and instead wait until he's really enjoying himself with the ballclub at some point this coming season. The report says both sides are content to wait until March or even into the regular season before seeing if there's mutual interest, but it certainly doesn't sound like it's off the table.Twins add a twin in RogersFrom the quirky department, the Minnesota Twins have agreed to terms with reliever Taylor Rogers on a one-year, $2 million deal, per The Athletic. The quirk is that Rogers is an actual twin. His twin brother, Tyler Rogers, is signed with the Blue Jays. Taylor Rogers is a 35-year-old lefty. In 57 games last season between the Reds and Cubs, he pitched to a 3.38 ERA with a 1.38 WHIP and 53 strikeouts in 50 ⅔ innings. \nAs the Twins' bullpen is currently constructed, it's possible Rogers heads into the season as one of the key late-inning arms, maybe even the closer. Justin Topa, Cole Sands and Kody Funderburk are the other options.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MLB rumors: Mets not talking Freddy Peralta extension yet; Twins add Taylor Rogers - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/56e83bde-eeb1-4e8c-ab1b-95602a5e2dd9/thumbnail/1200x675/71dc89ff81fffc011861e6190055ed09/peralta-getty-3.png"
      ],
      "datePublished": "2026-01-22T18:15:39.000Z",
      "dateModified": "2026-01-22T18:15:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Sox choose their identity, but banking on pitching might only carry Boston so far - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/red-sox-identity-pitching-ranger-suarez/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/7e6d7873-6e9b-46e3-81ef-1dfd2ff568e8/thumbnail/1200x675/310e188cf5c19747483978c191eb3e71/red-sox-ranger-suarez.png",
    "tag": "Sports",
    "date": "2026-01-22T17:59:31.000Z",
    "description": "\n        The Red Sox made their signing official Wednesday afternoon, inking Ranger Suárez to a five-year, $130 million deal. Suárez, who spent his fi",
    "body": "\n        The Red Sox made their signing official Wednesday afternoon, inking Ranger Suárez to a five-year, $130 million deal. Suárez, who spent his first eight seasons in the big leagues with the Phillies, gives Boston a legitimate No. 2 starter behind Garrett Crochet. The deal also underscores where the club believes it can best fortify itself in the ultra-competitive American League East: starting pitching.\"I don't think there's a question anymore that the identity of our team, the strength of our team, is going to be our pitching and our ability to prevent runs,\" said chief baseball officer Craig Breslow during Suarez' introductory press conference at Fenway Park. The Sox now have a rotation anchored by both Crochet and Suárez, with Sonny Gray also in the fold after being acquired via trade from the Cardinals earlier in the offseason. Crochet carried much of the load for the rotation last season, often stopping losing streaks and extending -- or beginning winning streaks. The Red Sox ranked 12th in both starters' ERA (3.92) and strikeouts (805) in 2025.\n\"I'm just looking forward to putting my own little grain of rice to what we're doing here,\" said Suárez.But even with Crochet no longer carrying the burden alone, is banking on the rotation enough for the Red Sox heading into the 2026 season? Probably not. The Red Sox had to pivot once Alex Bregman elected to join the Cubs earlier this month. Suárez, though Breslow played it down, represented that. \nStill, the Sox have a major offensive issue, leaving hitting coach Pete Fatse and manager Alex Cora with limited options. Bregman was supposed to replace Rafael Devers. Instead, Boston is without both after Bregman chose the Cubs over the Sox, placing a heavy burden on 21-year-old Roman Anthony and an aging Trevor Story to carry much of the offense.The free agent market is thinning, too. With the exception of Eugenio Suarez, who could be an option for Boston on a short-term deal, there's little to be desired. Or, little that could help the Red Sox in their current situation. Boston was tied to Ketel Marte for much of the offseason, but the Arizona Diamondbacks ultimately took him off the trade market. That decision is for now. Decisions change and the Sox would be prudent to keep that door open as the season progresses. \nBreslow has yet to show he can land a true marquee free agent, at least on the position-player side. What has become clear is where his comfort level lies: evaluating pitching. Even when looking at trades, his lone blockbuster move was acquiring Crochet.The Sox do have the starting pitching depth to make a trade to help amplify their lineup. One that would likely begin with right-hander Brayan Bello, who has shown a mixed bag of results, pairing stretches of effectiveness with command lapses and uneven outings.Still, Bello won't turn 27 until May and teams might still see some upside in him following a season in which he made 29 appearances (28 starts) and posted a 3.35 ERA. \nNow, when it comes to Suárez, no doubt, he's a front-of-the-rotation starter, who has shown the ability to get outs. Yet he's a throwback compared to plenty of his counterparts, pitching to contact instead of huge swing-and-miss numbers while with the Phillies. \"If you have really good command of your pitches and are able to mix them well, you don't really need 100 miles per hour,\" Suárez said. \"In my case, that's what's given me the most success.\" Success, however, could look different in this uniform, particularly given the defensive lapses behind him. While the outfield grades as one of the best in the sport, the infield remains a clear weakness. The infield led the league in errors last season, and with Bregman gone, the defense could regress further without a true second or third baseman in place. Upgrading defensively remains a priority.\n\"Defense is a significant contributor to run prevention,\" added Breslow. \"We tend to get caught up in the pitching side of this, but there are other key components, as well defense being the most obvious. So, it's really important that we improve our defense, particularly our infield defense. Our out conversion needs to be improved.\" As it stands, Mayer is expected to be part of the mix at third base, though he is naturally a shortstop. Romy Gonzalez and David Hamilton are slated to contribute at second, though neither profiles as an everyday starter, with Hamilton grading as a below-average defender.\"I'm reluctant to kind of commit to things that at this point,\" added Breslow on Mayer possibly being an everyday player at third. \"Marcelo is going to play a very important role for us, his defensive skills and also versatility are going to be really, really useful for us. He's such a functional piece on the roster, and he's still acclimating to the big leagues.\" \nAcclimation, though, shouldn't be in the Sox's vocabulary if they truly intend to compete. It can't be. Not in a division that has only intensified with Toronto's emergence, Baltimore's retooling, and New York largely running back the same roster, with Gerrit Cole expected to return this summer for the Yankees.Their offseason work may be finished. Not re-signing or replacing Bregman, however, will carry a cost and questions heading into spring training.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Sox choose their identity, but banking on pitching might only carry Boston so far - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/7e6d7873-6e9b-46e3-81ef-1dfd2ff568e8/thumbnail/1200x675/310e188cf5c19747483978c191eb3e71/red-sox-ranger-suarez.png"
      ],
      "datePublished": "2026-01-22T17:59:31.000Z",
      "dateModified": "2026-01-22T17:59:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuggets vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/nuggets-wizards-odds-prediction-spread-time-2026-nba-picks-thursday-january-22/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/9b4b9083-c56e-4316-af52-43986982ba49/thumbnail/1200x675/25a6d6e0685ad61fd4d159852c66c327/usatsi-28020973.jpg",
    "tag": "Sports",
    "date": "2026-01-22T16:09:08.000Z",
    "description": "\n        A cross-conference matchup on Thursday's NBA schedule has the Denver Nuggets visiting the Washington Wizards. Denver (29-15) is coming off ba",
    "body": "\n        A cross-conference matchup on Thursday's NBA schedule has the Denver Nuggets visiting the Washington Wizards. Denver (29-15) is coming off back-to-back defeats, including a 115-107 loss to the Lakers on Monday, which followed a four-game win streak. Washington (10-32) is mired in a seven-game losing streak, most recently falling 110-106 to the Clippers on Sunday, and that follows a 5-2 stretch for the Wizards. Nikola Jokic (knee) and Trae Young (knee) remain out for their respective teams.Tip-off is at 7 p.m. ET from Capital One Arena in Washington, D.C. Denver leads the all-time series 60-43 and just defeated the Wizards on Jan. 17. Denver is a 5.5-point favorite in the latest Wizards vs. Nuggets odds from DraftKings Sportsbook, while the over/under for total points scored is 228.5. Before making any Nuggets vs. Wizards picks, check out the NBA predictions and betting advice from the SportsLine Projection Model.New users can target the DraftKings promo code, which offers $300 in bonus bets if your $5+ bet wins:The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model enters Week 14 of the 2025-26 NBA season on a sizzling 35-15 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.   \nNow, the model has simulated Wizards vs. Nuggets 10,000 times and just revealed its coveted NBA picks and betting predictions. You can head to SportsLine now to see the model's picks. Here are several NBA odds and NBA betting lines for Nuggets vs. Wizards:Wizards vs. Nuggets                                                                                            spread:    Denver -5.5 at DraftKings    Wizards vs. Nuggets                                                                                                          over/under:    228.5 pointsWizards vs. Nuggets                                                                                                           money line:    Denver -222, Washington +183Wizards vs. Nuggets                                                                                                           picks:    See picks at SportsLineWizards vs. Nuggets                                                                                                          streaming:Fubo (Try for free)  New users can check out the latest bet365 bonus code to get $200 in bonus bets after placing a $5 bet:How to make Nuggets vs. Wizards   picksSportsLine's model has simulated Wizards vs. Nuggets 10,000 times and is going Over on the total (228.5 points). The Nuggets have the second-best Over record in the NBA at 27-17, as the total has been eclipsed in 61.4% of their games. That includes their matchup versus the Wizards on Saturday, which saw 236 total points scored, surpassing the game's O/U of 228.5, which is the same as Thursday's contest.Each of the last four meetings between these teams have seen at least 235 combined points, with them averaging 240 points. This season, both teams struggle on the defensive end, with Denver ranking 20th in points allowed, while Washington sits 29th. With that, both squads are forecasted to score more points than their season averages. The model projects 239 total points being scored as the Over hits in 60.1% of simulationsIt has also generated an against-the-spread pick that hits in well over 50% of simulations. You can head to SportsLine to see the model's NBA picks. So who wins Nuggets vs. Wizards, and which side of the spread hits nearly 50% of the time? Visit SportsLine now to see which side of the Wizards vs. Nuggets spread to back, all from the model that has returned well over $10,000 on top-rated NBA picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuggets vs. Wizards prediction, odds, time: 2026 NBA picks for Thursday, Jan. 22 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/9b4b9083-c56e-4316-af52-43986982ba49/thumbnail/1200x675/25a6d6e0685ad61fd4d159852c66c327/usatsi-28020973.jpg"
      ],
      "datePublished": "2026-01-22T16:09:08.000Z",
      "dateModified": "2026-01-22T16:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Batting Around: Does MLB need a salary cap? - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/mlb/news/mlb-salary-cap-roundtable/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/22/5fcc9016-30b7-49b6-ab9d-e3b1674223a8/thumbnail/1200x675/7827e604ac88fb087d0bb82e1ac64643/manfred-getty.png",
    "tag": "Sports",
    "date": "2026-01-22T17:22:33.000Z",
    "description": "\n        Throughout the offseason the CBS Sports MLB   experts will bring you a                                      weekly Batting Around roundtable,",
    "body": "\n        Throughout the offseason the CBS Sports MLB   experts will bring you a                                      weekly Batting Around roundtable,        breaking         down      pretty       much           anything.      The      latest   news, a      historical      question,           thoughts         about         the future  of         baseball,   all     sorts of     stuff. Last week we debated Bo Bichette's future (he since signed with the Mets). This week we're going to tackle a salary cap.Does baseball need a salary cap?R.J. Anderson: No.Matt Snyder: I've been a staunch defender of the MLB system for years and I'm still  not willing to say a salary cap would be a reasonable solution, but I  understand the push for it at this point. The optics look bad. I get it.  When you have teams spending five times as much as others, it  definitely looks bad. I've gotten to the point now where every time we  head into an offseason I'm basically praying the Dodgers don't add  anyone because I don't feel like dealing with the mass hysteria from a  large portion of the MLB fan base. I continue to  believe the bigger issue is the number of owners pocketing  revenue-sharing money and the idea that small-market teams can't compete. The  Brewers had the best record in baseball last regular season. The  Guardians keep making the playoffs. The Rays contend often. I  am open to hearing arguments that would better level the playing field,  but a hard salary cap at something like $200 million would do nothing  but take money away from the players and keep it in the hands of the  owners, who are the problem in the first place. A salary floor obviously  comes with a cap, but with three years of pre-arbitration, are you  forcing teams to spend money for the sake of spending it just to get to  the floor, possibly then playing a washed-up veteran over a  pre-arbitration guy who could develop into a great player? \nThere aren't good answers.Mike Axisa: I mean, it clearly doesn't, right? Record revenues, terrific attendance, great television/streaming ratings, etc. The league and its teams are making money hand over fist. MLB and the owners have done a good job framing the salary cap fight as a competitive balance thing, but don't fall for it. The owners want a cap because it will keep player salaries down and redirect those dollars into their pockets, and also boost their franchise values. Don't believe them when they say otherwise.That all said, there is clearly a revenue disparity problem. It doesn't matter how many stats you put in front of people showing that MLB's competitive balance is pretty good, actually. If fans feel like their team has no chance, that's bad. A salary cap won't fix that though. The cheap owners will still be cheap because it's in their DNA, and the salary floor that comes with a cap won't be high enough to change their behavior. I'm not saying it will be easy, but you can address the revenue disparity problem with adjustments to the revenue sharing program. One with rules that guarantee revenue sharing money is spent on the MLB roster rather than just \"we'll spend it on players, trust us 😉.\"\nDayn Perry: No, and the NFL comparisons that typically accompany  calls for a cap in MLB are completely daft. You simply cannot compare  the two leagues. MLB is most reliant on local revenues, while the NFL is  essentially a national-revenue league. The NFL plays 10% off the  regular-season games that MLB does and benefits from the small-sample  randomness that flows from such a schedule. Ditto their one-and-done  playoff format. Owners want a cap because they want to tamp down on  labor costs, full stop. It has nothing to do with parity, which MLB  already has plenty of. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Batting Around: Does MLB need a salary cap? - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/22/5fcc9016-30b7-49b6-ab9d-e3b1674223a8/thumbnail/1200x675/7827e604ac88fb087d0bb82e1ac64643/manfred-getty.png"
      ],
      "datePublished": "2026-01-22T17:22:33.000Z",
      "dateModified": "2026-01-22T17:22:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patriots vs. Broncos prediction, odds, time, spread: 2026 AFC Championship Game picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/patriots-broncos-prediction-odds-time-date-2026-afc-championship-game-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/08/a35f09cc-5b60-40bf-a675-77aadaa002fe/thumbnail/1200x675/a260134efb7d46e18099964af752cb67/rhamondre.jpg",
    "tag": "Sports",
    "date": "2026-01-22T16:13:55.000Z",
    "description": "\nThe Denver Broncos will look to overcome the loss of quarterback Bo Nix (ankle) when they battle the New England Patriots in the 2026 AFC Championshi",
    "body": "\nThe Denver Broncos will look to overcome the loss of quarterback Bo Nix (ankle) when they battle the New England Patriots in the 2026 AFC Championship Game on Sunday. The winner will advance to Super Bowl LX. New England downed Houston 28-16 on Sunday, while Denver outlasted Buffalo 33-30 in overtime on Saturday. The Patriots (14-3), the second seed in the AFC, are 8-0 on the road this season. The Broncos (14-3), the top seed in the conference, are 9-1 at home, including the postseason.Kickoff from Empower Field at Mile High in Denver is set for 3 p.m. ET on CBS and Paramount+ (sign up here). The Patriots are 4.5-point favorites in the latest Patriots vs. Broncos odds, a 1-point drop since opening as 5.5-point favorites. The over/under for total points scored is 42.5 via DraftKings Sportsbooks. Before making any Broncos vs. Patriots picks, check out the NFL predictions from the SportsLine Projection Model. The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model enters the AFC and NFC Championship Games on a 53-37 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting apps could have seen strong returns.    Now, the model has set its sights on Patriots vs. Broncos. You can visit SportsLine now to see the picks. Here are the NFL odds and trends for Broncos vs. Patriots\nPatriots vs. Broncos                                                                                             spreadNew England -4.5 at DraftKings SportsbookPatriots vs. Broncos                                         over/under42.5 pointsPatriots vs. Broncos                                                                                                                                                                                                         money line New England -248, Denver +201Patriots vs. Broncos                                                                                                                                                                                                 picksSee picks at SportsLinePatriots vs. Broncos                                                                                                                                                                                                   streaming Paramount+   Why the Patriots can coverMVP candidate Drake Maye helps power the New England offense. In 17 regular-season games, he completed 72% of his passes for 4,394 yards and 31 touchdowns with eight interceptions and a 113.5 rating. In the postseason, he has thrown for four touchdowns with two interceptions. In the win over the Texans, he completed 16 of 27 passes for 179 yards and three touchdowns with one interception.His top target has been Stefon Diggs. In 17 regular-season games, he caught 85 passes for 1,013 yards and four touchdowns. He had 17 explosive plays of 20 yards or more, including a long of 34. He also had 354 yards after the catch with 51 first-down conversions. He caught four passes for 40 yards and a score in the win over Houston. See which team to back at SportsLine. Why the Broncos can coverBackup quarterback Jarrett Stidham will take over for the injured Nix. He will be making his first extended appearance since Jan. 7, 2024, when he guided Denver against the Las Vegas Raiders. In a 27-14 loss, he completed 20 of 34 passes for 272 yards and one touchdown with one interception. For his career, he has played in 20 games, completing 59.4% of his passes for 1,422 yards and eight touchdowns with eight interceptions.Veteran wide receiver Courtland Sutton will be a key target. In 18 games, including playoffs, he has 78 receptions for 1,070 yards and seven touchdowns. Sutton had four catches for 53 yards in the win over Buffalo. He's had two games with seven or more receptions, including seven for 113 yards (16.1 average) and one touchdown in a 34-26 win over Green Bay on Dec. 14. See which team to back at SportsLine.How to make Patriots vs. Broncos picksSportsLine's model is going Under on the total, projecting 40 combined points. It also says one side of the spread hits in nearly 60% of simulations. You can only get the pick at SportsLine. So who wins Broncos vs. Patriots, and which side of the spread hits nearly 60% of the time? Visit SportsLine now to see which side of the Patriots vs. Broncos spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patriots vs. Broncos prediction, odds, time, spread: 2026 AFC Championship Game picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/08/a35f09cc-5b60-40bf-a675-77aadaa002fe/thumbnail/1200x675/a260134efb7d46e18099964af752cb67/rhamondre.jpg"
      ],
      "datePublished": "2026-01-22T16:13:55.000Z",
      "dateModified": "2026-01-22T16:13:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AFC and NFC championship picks and predictions, plus NFL Honors finalists - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfc-afc-championship-picks-predictions-mvp-finalists-bills-bizarre-press-conference/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/21/7e4c2435-49ae-4b2a-ad92-846e2e6de7e7/thumbnail/1200x675/256db08c48de5843fd315b8a6877b3e5/los-angeles-rams.jpg",
    "tag": "Sports",
    "date": "2026-01-22T18:04:23.000Z",
    "description": "\n        Welcome to the Thursday edition of the Pick Six newsletter!There are only three games left in the NFL season and two of them will be going do",
    "body": "\n        Welcome to the Thursday edition of the Pick Six newsletter!There are only three games left in the NFL season and two of them will be going down on Sunday with the AFC Championship and NFC title game both happening. Since this is our last newsletter of the week, we will be making some predictions about both of those games today. Broncos over Patriots? We've got several people who think that upset is going to happen (Spoiler alert: Pete Prisco is one of them). Rams over Seahawks? Apparently, almost everyone I work with thinks that upset is going to happen. Not only are we going to break down the conference title games, but we're also going to take a look at the finalists for every major award that's being handed out, from MVP to Coach of the Year, and more.As always, here's your reminder to tell all your friends to sign up for the newsletter. Let's get to the rundown. 1. Staff predictions for the AFC and NFC championship games \n                                                                    Keytron Jordan, CBS Sports Design\n                                                            With two big games on the schedule for Sunday, I thought we should do an extra special version of our weekly picks, so that's what we're going to do today. I tracked down every NFL writer I could find here at CBS Sports and demanded that they give me a pick for both games. \nWhat that means is that you're going to get an AFC title pick and an NFC Championship pick from 12 different experts. Let's get to them, starting in the AFC. AFC CHAMPIONSHIP PICKSPete Prisco: Broncos 23-21 over Patriots (Prisco's full picks here)Tyler Sullivan: Patriots 24-17 over Broncos (Sullivan's full picks here)John Breech: Patriots 20-17 over Broncos (Breech's full picks here)Jared Dubin: Patriots 21-10 over Broncos (Dubin's full picks here)Jordan Dajani: Patriots 23-17 over Broncos (Dajani's full picks here)Kyle Stackpole: Broncos 24-21 over PatriotsGarrett Podell: Patriots 27-13 over BroncosBryan DeArdo: Patriots 20-10 over BroncosJ.P. Acosta: Patriots 24-17 over BroncosZach Pereles: Patriots 20-17 over BroncosJoel Corry: Patriots 20-17 over BroncosMike Renner: Patriots 13-10 over BroncosOf our 12 writers, only TWO are taking the Broncos. And no, Prisco has not gone crazy. Here's the partial explanation for his pick: \"It would be easy to pick the Pats here based on Jarrett Stidham playing. But I think the Denver players will elevate their games around him and Sean Payton will have a big day calling the game for him. I think Denver's defense will get the best of the Pats offense. Denver goes to the Super Bowl.\" You can read Prisco's full pick here. \nWe have three writers who are expecting the Patriots to win by double digits. If you want to read each writer's full explanation for their AFC title game pick, we've got that here. Alright, let's get to the NFC title game. In a surprise, our picks for this game are almost as lopsided as the AFC title game. NFC CHAMPIONSHIP PICKSPete Prisco: Seahawks 23-17 over RamsTyler Sullivan: Seahawks 30-20 over RamsJoel Corry: Seahawks 23-20 over RamsJohn Breech: Rams 30-23 over SeahawksJared Dubin: Rams 23-20 over SeahawksJordan Dajani: Rams 30-27 over SeahawksKyle Stackpole: Seahawks 20-17 over RamsGarrett Podell: Rams 27-24 over SeahawksBryan DeArdo: Rams 27-20 over SeahawksJ.P. Acosta: Rams 28-24 over SeahawksZach Pereles: Rams 28-27 over SeahawksMike Renner: Rams 31-24 over Seahawks\nThe Seahawks are favored by 2.5 points and they're at home, but we still have eight of our 12 experts taking the Rams. So why is everyone picking against Seattle? I guess I'll serve as the official spokesman for people taking the Rams. My take: The Seahawks definitely have one of the best defenses in the NFL, but the last time I saw them on the field against the Rams, Matthew Stafford went off for 457 yards and three touchdowns, and he did that even though he didn't have Davante Adams in the lineup. Adams led the team in touchdown catches, but he didn't play in the Rams' wild Week 16 loss to Seattle. I think Stafford goes off again and leads L.A. to the Super Bowl. I also think Sam Darnold turns the ball over at least once and it makes a huge difference in the game. Tyler Sullivan, who has the Seahawks winning by 10, is the only one of us who doesn't think this will be a one-score game. If you want to read each writer's explanation for their NFC title game pick, you can do that here. \n2. AFC and NFC title games: Breaking down who has the edge at each position  If you're wondering who has the edge in the two games being played this weekend, don't worry, we have you covered. Zach Pereles went through EVERY position group in both games to figure out who has the edge going into Sunday. Let's take a look at two of his positional edges from each game. AFC CHAMPIONSHIPWide receiver edge: PatriotsZach's take: Stefon Diggs has been outstanding this season, and his touchdown catch last week was one of the best this season. So, too, was Kayshon Boutte's one-handed snag against Houston. Diggs is a route-running master, Boutte is a big play waiting to happen, DeMario Douglas is elusive, and Kyle Williams can stretch the field. Courtland Sutton has had a terrific season for Denver, but both Troy Franklin (hamstring) and Pat Bryant (concussion) are dealing with injuries suffered last week.Running back edge: PatriotsZach's take: Rhamondre Stevenson has quietly been a significant boost for the Patriots with 209 yards from scrimmage in two playoff games after scoring six touchdowns over his final three games of the regular season. New England also mixes in TreVeyon Henderson, who is capable of breaking a big play any time. Denver hasn't had consistent success on the ground since J.K. Dobbins went down with what was thought to be a season-ending foot injury, but he could return this weekend now that the Broncos have extended their season. If not, it'll be a heavy dose of Harvey, with McLaughlin and Badie spelling him.\nIf you want to see who has the edge at every position group in the AFC title game, be sure to check out Zach's full story here. We also came up with some X factors that could decide the game and you can check those out here. NFC CHAMPIONSHIPQuarterback edge: RamsZach's take: This is a clear-cut advantage for the Rams. Stafford is a potential MVP, while Darnold's play has been a rollercoaster for the past several months. Stafford threw for 457 yards and three touchdowns in Week 16 against Seattle in what will surely go down as a top MVP moment if he does indeed win the award (even though he lost that game). Darnold threw four interceptions in the team's first meeting and, though he came up clutch in the second meeting, was up-and-down in that contest as well.Cornerback edge: SeahawksZach's take: The difference between these two units might be the largest of any so far. Devon Witherspoon is an All-Pro, Josh Jobe has been terrific, Tariq Woolen is one of the most physically gifted corners in the NFL, and Nick Emmanwori is the ultimate chess piece for McDonald.\nFor a look at who has the edge at each position group in the NFC, you can check out our full list here. For a look at the players who might end up being an X factor in the NFC Championship game, be sure to check out our story on that here. 3. Ranking the best possible Super Bowl matchups: Matthew Stafford vs. Drake Maye takes the top spot\n                                                                    Getty Images\n                                                            With just four teams left, that means there are only four Super Bowl matchups that are still possible, so we thought we would rank each of those four games based on which one we want to see the most. I was put in charge of these rankings, which means there's 100% chance that you will agree with them. \n1. Rams vs. Patriots. Not only would we get a duel between the two MVP front-runners (Matthew Stafford and Drake Maye), but this game would also give us two of the smartest head coaches going head to head, with offensive genius Sean McVay battling wits with defensive mastermind Mike Vrabel. If this Super Bowl happened, it would mark the third time the Rams and Patriots have met in the big game, tying the Cowboys-Steelers as the only other Super Bowl matchup to have happened three times. The Patriots' first Super Bowl win over the Rams kick-started their dynasty in 2001, with Tom Brady and Bill Belichick. Their second win over the Rams was the unofficial end of that dynasty in 2018. Now, in a cosmic twist, Vrabel and Maye could kick-start their own dynasty with a win over the Rams. 2. Seahawks vs. Patriots. One big reason why this game would be so attractive is that it would give us an unbelievable matchup on both sides of the ball. For one, we'd get to see the AFC's highest-scoring offense going up against a Seahawks defense that gave up the fewest points in the NFL this year. Not only that, but we'd get to see the NFL's third-highest scoring offense in Seattle going up against a Patriots defense that surrendered the fourth-fewest points. A great AFC offense vs. a great NFC defense? A great AFC defense vs. a great NFC offense? You'd never be able to take your eyes off the game.3. Rams vs. Broncos. This game would pit the NFL's highest-scoring offense (Rams) against a Broncos defense that surrendered the third-fewest points in the NFL this year. This game would also give us one very interesting storyline: Sean McVay and Sean Payton coaching against each other in a postseason game for the first time since McVay's Rams beat Payton's Saints in the 2018 NFC title game, which featured arguably the most controversial pass interference no-call in NFL history. I'm guessing we would see the replay of that no-call at least 400 times during Super Bowl week.\n4. Seahawks vs. Broncos. This game would give us Jarrett Stidham going up against the best defense in the NFL and I'm pretty sure we all know how that would turn out. If it did turn into a blowout, that would make sense, because that always seems to happen when the two top seeds face each other in the Super Bowl. Over the past 50 years, the AFC's top seed and the NFC's top seed have faced each other in the Super Bowl 14 times, and for the most part, those games have turned into blowouts. Out of those 14 games, 10 have been decided by double digits, including Super Bowl XLVIII, when the Seahawks smashed the Broncos 43-8.I wrote over 1,700 words to justify my rankings and if you want to check out every single one of those words, you can do that here. 4. Bills owner Terry Pegula's bizarre press conference: Four things to know Bills owner Terry Pegula took part in a rare press conference on Wednesday and things definitely got interesting. After the Bills made the surprising decision to fire Sean McDermott on Monday, Pegula wanted to take questions so he could explain why he decided to dump his head coach. \nHere are four things to know: Why Pegula fired McDermott. Apparently, the Bills' owner made the decision to get rid of McDermott shortly after the team's 33-30 overtime loss to Denver on Saturday. \"My decision to bring in a new coach was based on the results of our game in Denver,\" the Bills owner said, via NYup.com. \"I want to take you in the locker room after that game. I looked around, first thing I noticed was our quarterback with his head down, crying. I looked at all the other players. I looked at their faces and our coaches.\"Explanation for why general manager Brandon Beane got promoted. With the success of Beane and McDermott being so intertwined over the past nine years, you might be wondering why one guy got fired and the other guy got promoted. During his press conference, Pegula was asked if Beane had made some sort of 'power play' to save his job. \"I'm the kind of guy, if I sense you're on a power play, you're out,\" Pegula said. \"I don't like power play people. We have an organization that we work together, but any sense at all that he was on a power play, [Beane] would have been gone because that's not my type of person.\"Pegula defends Beane. If you look at the Bills, the biggest reason it felt like they couldn't get over the Super Bowl hump is that the roster wasn't good enough and that's because of Beane. However, Pegula defended his general manager. \"Does anyone know what the numbers 5-2-3, 2-2-2-6 represent? I'm asking a question. No? That's our seeding over the last seven years in the playoffs. 5-2-3, 2-2-2-6. An organization doesn't carry that kind of record without being a great organization and without having great players.\" Beane's track record is so questionable that a former Super Bowl-winning coach (Bruce Arians) was shocked that the team kept him over McDermott (you can read Arians' comments here). Keon Coleman gets thrown under the bus. During a conversation about Beane's inability to build the roster, Coleman's name came up. The 2024 second-round pick hasn't lived up to the hype, and according to Pegula, you can't blame Beane for that because it was the coaching staff that wanted him. \"The coaching staff pushed to draft Keon [Coleman],\" Pegula said. \"I'm not saying Brandon wouldn't have drafted him, but he wasn't his next choice. That was Brandon being a team player and taking advice of his coaching staff who felt strongly about the player. He's taken, for some reason, heat over it, and not saying a word about it. I'm here to tell you the true story.\" He's taking heat because he took all the credit for a pick during an interview held shortly after the 2024 draft (You can see the video here). You can also read more about the Coleman situation here. With Beane running the show, it will be interesting to see who the Bills hire as their new coach. A coaching candidate may not want to work under Beane, knowing he's willing to throw people under the bus, which will certainly create an interesting dynamic in the interview process. 5. NFL Honors: Finalists named for all awards, from MVP to Coach of the Year\n                                                                    Getty Images\n                                                            In just two weeks, the NFL will hand out all its 2025 season awards at the league's annual \"NFL Honors\" show on Feb. 5 in San Francisco. During the event, hosted by Jon Hamm, we'll find out who won each award, from MVP to Coach of the Year to both Rookie of the Year awards and more. The Associated Press handles the voting for each award and the AP released the finalists in each category on Thursday. One thing to keep in mind with these awards is that they're voted on at the end of the regular season, so how a player performs in the postseason has no impact on who wins each award. With that in mind, let's check out some of the finalists. MVPRams QB Matthew Stafford Patriots QB Drake Maye Bills QB Josh Allen 49ers RB Christian McCaffrey Jaguars Trevor LawrenceBreech's prediction: Matthew StaffordCoach of the YearBears coach Ben Johnson Jaguars coach Liam Coen Seahawks coach Mike Macdonald 49ers coach Kyle Shanahan Patriots coach Mike VrabelBreech's prediction: Mike Vrabel Offensive Player of the YearRams WR Puka NacuaFalcons RB Bijan Robinson49ers RB Christian McCaffreySeahawks WR Jaxon Smith-NjigbaPatriots QB Drake MayeBreech's prediction: Jaxon Smith-NjigbaDefensive Player of the YearTexans DE Will Anderson Jr.Broncos LB Nik BonittoBrowns DE Myles GarrettLions DE Aidan HutchinsonPackers EDGE Micah ParsonsBreech's prediction: Myles Garrett You can see the full list of finalists for every award here. And remember, all of these awards were voted on at the end of the regular season, so the playoffs have no impact on who wins any of these awards. 6. Extra points: 49ers will look into electrical substation conspiracy theoryIt's been a busy 24 hours in the NFL, and since it's nearly impossible to keep track of everything that happened, I went ahead and put together a roundup for you.49ers to investigate conspiracy theory. The 49ers practice field is located near an electrical substation and there's been some speculation that this might be why the team is dealing with so many injuries. Instead of ignoring that rumor, general manager John Lynch said the team is actually going to investigate that theory. \"Because it deals with allegedly the health and safety of our players, I think you have to look into everything,\" Lynch said Wednesday. You can read more about this situation here. Chiefs bring back Eric Bieniemy. The former Chiefs offensive coordinator is returning to Kansas City. Bieniemy was with the team from 2013 through 2022, but then left in 2023 to take the offensive coordinator job with the Commanders, a spot where he could call plays. Bieniemy left that job after one year and ended up at UCLA in 2024. He then spent the 2025 season with Ben Johnson and the Bears. Now, he's returning to Kansas City and we've got the details here. Falcons offensive coordinator heading to Tampa Bay. With Kevin Stefanski getting hired in Atlanta, that meant Falcons offensive coordinator Zac Robinson was likely going to need a new job and he found one on Thursday. Robinson is finalizing a deal to become the OC in Tampa Bay, according to ESPN. With Baker Mayfield calling out Stefanski this week and Robinson now leaving Atlanta for Tampa Bay, this definitely adds some spice to the Falcons-Buccaneers rivalry (And let's not forget, the Falcons knocked the Bucs out of the playoffs by beating the Saints in Week 18). Bills-Broncos sets Saturday TV record for an NFL playoff game. The Broncos' overtime win over Buffalo was the most-watched Saturday game in NFL history. The CBS game averaged 39.6 million viewers and it peaked in overtime with 51.23 million people watching. It was the most-watched Saturday sporting event on any network since the 1994 Olympics, which was also on CBS. NFL Scouting Combine staying in Indy through at least 2028. The NFL combine has been held in Indianapolis since 1987 and it will be staying there for at least two more years. The NFL reached a deal to hold the combine in Indy through the 2028 season. The current contract was set to expire after the 2026 combine and there had been talk that the league might look to move the event, but instead, it will be staying put for now. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AFC and NFC championship picks and predictions, plus NFL Honors finalists - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/21/7e4c2435-49ae-4b2a-ad92-846e2e6de7e7/thumbnail/1200x675/256db08c48de5843fd315b8a6877b3e5/los-angeles-rams.jpg"
      ],
      "datePublished": "2026-01-22T18:04:23.000Z",
      "dateModified": "2026-01-22T18:04:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]