[
  {
    "title": "Computer model locks in Saints vs. Panthers picks, score prediction, SGP for NFL Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/saints-panthers-where-to-watch-nfl-week-10-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/12/fb140528-83b2-426e-a5b8-64d1dffa8f11/thumbnail/1200x675/aaa5ff3b2c8e5af7748c0ae74cf37cb2/usatsi-27308542-1.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:56:57.000Z",
    "description": "\n        Two NFC South rivals square off in Week 10 action when the New Orleans Saints visit the Carolina Panthers. It's been a rough start to Kellen ",
    "body": "\n        Two NFC South rivals square off in Week 10 action when the New Orleans Saints visit the Carolina Panthers. It's been a rough start to Kellen Moore's tenure as New Orleans' head coach as the Saints are 1-8 and are in contention to have the No. 1 overall pick in April's NFL Draft. The team recently made a change at quarterback, benching Spencer Rattler in favor of rookie Tyler Shough. As for the Panthers, they're 5-4 and are quietly playing good football. They beat the Green Bay Packers last week and have gotten a big boost offensively behind running back Rico Dowdle, who has 652 rushing yards over his last five games.Kickoff from Bank of America Stadium is set for 1 p.m. ET, and the Panthers are 5.5-point favorites at home, according to the latest Saints vs. Panthers SportsLine consensus odds. The over/under for total points scored is 39.5. The Panthers are -254 money line favorites (risk $254 to win $100), while the Saints are +205 underdogs (wager $100 to win $205). Before you make any Saints vs. Panthers picks, make sure to check out what the SportsLine Projection Model has to say. Click here to bet Saints vs. Panthers at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Saints vs. PanthersBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Saints vs. Panthers on SundayWhen: Sunday, Nov. 9Time: 1 p.m. ETTV: FOXStream: FuboFollow along: CBS Sports AppSaints vs. Panthers betting previewOdds: Panthers -5.5, over/under 39.5The Panthers have won five of their last seven games and are quietly in the wild card conversation, while the Saints have mustered just a single win on the year to date. Carolina has been especially good at home, going 3-1. This is the first game the Panthers have been favored this season. Five of Carolina's nine games have gone Over, while only three of New Orleans' six have. The Panthers are 27th in scoring offense and the Saints are 31st. Click here to bet Saints vs. Panthers at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Saints vs. Panthers SGPOver 39.5 (-118, DraftKings)Panthers -5.5 (-108, DraftKings)Rico Dowdle anytime touchdown (-150, DraftKings)Final odds: +493 at DraftKings (wager $100 to win $493)Model's Saints vs. Panthers score prediction, picksDespite the Saints' trend of Unders, the SportsLine Projection Model likes Over 39.5 as that hits in 57% of the model's 10,000 simulations. The Panthers have been great at home and outside of a 9-point showing in a 40-9 loss to Buffalo, Carolina has scored 27, 30 and 30 in its other three home games this season. Saints vs. Panthers score prediction: Panthers 24, Saints 20Want more Week 10 NFL picks?You've seen the model's best bets for New Orleans Saints vs. Carolina Panthers. Now, get against the spread, total and money-line picks for every Week 10 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Saints vs. Panthers picks, score prediction, SGP for NFL Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/12/fb140528-83b2-426e-a5b8-64d1dffa8f11/thumbnail/1200x675/aaa5ff3b2c8e5af7748c0ae74cf37cb2/usatsi-27308542-1.jpg"
      ],
      "datePublished": "2025-11-08T19:56:57.000Z",
      "dateModified": "2025-11-08T19:56:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model locks in Browns vs. Jets picks, score prediction, SGP for NFL Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/browns-jets-where-to-watch-nfl-week-10-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/22/1ffcc6eb-8585-4b4a-a760-928893b12723/thumbnail/1200x675/4059f77e720bc64d11d7d829b4f9187f/justin-fields-jets.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:51:45.000Z",
    "description": "\n        The Cleveland Browns and New York Jets meet in Week 10 of the 2025 NFL season on Paramount+ with both teams sitting near the bottom of the le",
    "body": "\n        The Cleveland Browns and New York Jets meet in Week 10 of the 2025 NFL season on Paramount+ with both teams sitting near the bottom of the league standings. The Browns have transitioned to starting rookie quarterback Dillon Gabriel after dealing Joe Flacco, while the Jets were busy at the trade deadline and stockpiled more picks for their rebuild. This isn't expected to be one of the top games in Week 10, but it could ultimately decide which franchise has the No. 1 pick in the 2026 NFL Draft.Kickoff from MetLife Stadium is set for 1 p.m. ET on CBS and Paramount+. The Browns are 2.5-point favorites in the latest Browns vs. Jets consensus odds at SportsLine and the total comes in at 37.5. Cleveland is a -135 money line favorite while New York is a +113 home underdog. Before making any Browns vs. Jets picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here. Click here to bet Browns vs. Jets at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Browns vs. JetsBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Browns vs. Jets on SundayWhen: Sunday, Nov. 9Time: 1 p.m. ETTV: CBS Stream: Paramount+Follow along: CBS Sports AppBrowns vs. Jets betting previewOdds: Browns -2.5, over/under 37.5This is not expected to be a high-scoring game, as the total for this contest is tied for the lowest on the Week 10 odds board. The Browns were actually slight underdogs before the Jets dealt Sauce Gardner and Quinnen Williams at the trade deadline, shifting the lines substantially. Cleveland is 3-5 ATS this season while New York is 4-4. The Browns are 4-4 on the over/under while the Jets are 5-3 to the Over.Click here to bet Browns vs. Jets at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Browns vs. Jets SGPUnder 37.5 points (-105)Quinshon Judkins anytime touchdown (-130)Justin Fields Under 179.5 passing yards (-113)Final odds: +550 at DraftKings (wager $100 to win $550)Model's Browns vs. Jets score prediction, picksThe SportsLine Projection Model likes the Jets as home underdogs. They cover the spread in 53% of simulations and win in 48%, bringing value in the latter market as +113 underdogs. The Over hits in 58% of simulations at 37.5.Browns vs. Jets score prediction: Browns 22, Jets 21Want more Week 10 NFL picks?You've seen the model's best bets for Cleveland Browns vs. New York Jets. Now, get against the spread, total and money-line picks for every Week 10 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model locks in Browns vs. Jets picks, score prediction, SGP for NFL Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/22/1ffcc6eb-8585-4b4a-a760-928893b12723/thumbnail/1200x675/4059f77e720bc64d11d7d829b4f9187f/justin-fields-jets.jpg"
      ],
      "datePublished": "2025-11-08T18:51:45.000Z",
      "dateModified": "2025-11-08T18:51:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bills vs. Dolphins: Where to watch NFL Week 10, score prediction, betting odds, sportsbook promos, SGP picks - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/bills-dolphins-where-to-watch-nfl-week-10-score-prediction-betting-odds-sportsbook-promos-sgp-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/04/195b3382-db27-43c4-b3c4-a198de6194e1/thumbnail/1200x675/ff24b25c0e6a652d5a7982f7ba1036aa/josh-allen-bills.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:41:45.000Z",
    "description": "\n        It's an AFC East matchup in Miami in Week 10 as the Dolphins welcome the Buffalo Bills to town for a showdown on Paramount+. The Bills (6-2) ",
    "body": "\n        It's an AFC East matchup in Miami in Week 10 as the Dolphins welcome the Buffalo Bills to town for a showdown on Paramount+. The Bills (6-2) are riding high after beating the rival Kansas City Chiefs, while the Dolphins (2-7) are coming off a home blowout loss to the Baltimore Ravens. Buffalo is once again gunning for a berth in the Super Bowl, while Miami has a difficult offseason ahead of it. Kickoff from Hard Rock Stadium is set for 1 p.m. ET on CBS and Paramount+. The Bills are 9.5-point favorites in the latest Bills vs. Dolphins consensus odds at SportsLine and the total comes in at 50. Buffalo is a -546 money line favorite while Miami is a +406 home underdog. Before making any Bills vs. Dolphins picks, make sure you check out the NFL picks from the SportsLine Projection Model. Be sure to watch this game on CBS and Paramount+, where new users can get a free one-week trial. Sign up here.Click here to bet Bills vs. Dolphins at BetMGM Sportsbook, where new users get either $150 in bonus bets if your first bet wins or up to $1,500 in bonus bets if your first bet loses:Where to bet on Bills vs. DolphinsBrandPromoPromo CodeDraftKingsBet $5, get $300 in bonus bets if your bet wins + 3 Months of NBA League PassJust click herebet365Bet $5, get $200 in bonus bets instantly CBSBET365BetMGMUp to $1,500 in bonus bets if your first bet losesCBSSPORTSCaesarsBet $1, double your winnings your next 20 betsCBS20XFanDuelBet $5, get $150 in bonus bets if your bet winsJust click hereFanaticsBet and get up to $2,000 in No Sweat Bets FanCash  CBSFANWhere to watch Bills vs. Dolphins on SundayWhen: Sunday, Nov. 9Time: 1 p.m. ETTV: CBSStream: Paramount+Follow along: CBS Sports AppBills vs. Dolphins betting previewOdds: Bills -9.5, over/under 50The Bills are simply in a different weight class here, but will Miami roll over and show its belly again? Mike McDaniel will want more from his offense after the Dolphins managed a mere six points against the newly healthy Baltimore defense. Tua Tagovailoa is a much better player at home (last week's dud notwithstanding). That being said, momentum and motivation are both on Buffalo's side here, as the Bills need this win to keep pace with the surging New England Patriots atop the division, and Miami is just playing out the string at this point.Click here to bet Bills vs. Dolphins at FanDuel Sportsbook, where new users get $150 in bonus bets if their first bet of at least $5 wins:Bills vs. Dolphins SGPBills -9.5 (-112)Dalton Kincaid anytime touchdown scorer (+200)De'Von Achane Over 65.5 rushing yards (-111)Final odds: +1100 at DraftKings (wager $100 to win $1100)Model's Bills vs. Dolphins score prediction, picksThe SportsLine Projection Model likes the Bills here. Buffalo covers in 54% of its simulations and Buffalo wins outright in 73%, although the Dolphins provide more betting value as such heavy underdogs. The Over hits in 63% of the simulations -- given the model has the total at an even 50, that includes pushes. DraftKings offers the number at 50.5, which the model's projected score still clears.Bills vs. Dolphins score prediction: Bills 35, Dolphins 23Want more Week 10 NFL picks?You've seen the model's best bets for Buffalo Bills vs. Miami Dolphins. Now, get against the spread, total and money-line picks for every Week 10 NFL game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bills vs. Dolphins: Where to watch NFL Week 10, score prediction, betting odds, sportsbook promos, SGP picks - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/04/195b3382-db27-43c4-b3c4-a198de6194e1/thumbnail/1200x675/ff24b25c0e6a652d5a7982f7ba1036aa/josh-allen-bills.jpg"
      ],
      "datePublished": "2025-11-08T18:41:45.000Z",
      "dateModified": "2025-11-08T18:41:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jets sticking with Justin Fields over Tyrod Taylor at QB vs. Browns - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/new-york-jets-justin-fields-tyrod-taylor-aaron-glenn-quarterback-browns/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/08/c311df8a-9c96-48ac-8508-1ce7ee06a384/thumbnail/1200x675/c4ded757d29fe0d080bfbdc8cbbecbf0/gettyimages-2243441847-1.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:24:51.000Z",
    "description": "\n        While New York Jets coach Aaron Glenn declined to publicly name his starting quarterback for the Week 10 matchup with the Cleveland Browns, J",
    "body": "\n        While New York Jets coach Aaron Glenn declined to publicly name his starting quarterback for the Week 10 matchup with the Cleveland Browns, Justin Fields will remain in the lineup on the heels of the team's first win of the year. The Jets plan on starting Fields on Sunday rather than going with veteran Tyrod Taylor, CBS Sports' Matt Zenitz reported Saturday.Despite Fields' improved play before the bye week, Glenn would not go so far as to name Fields the Week 10 starter. He said he had his \"own reasons\" for declining to shut down the consternation over the role and dismissed the idea that his lack of public backing of Fields may hurt the quarterback's confidence.\"You know I'm not gonna give you that answer,\" Glenn said. \"You'll find out soon who our starting quarterback will be. Justin did a hell of a job against Cincinnati, but you know I'm gonna keep that close to the vest.\"\n        \n            \n                Aaron Glenn remains quiet on Jets' starting QB for Week 10 despite Justin Fields' big game vs. Bengals\n                \n                    Austin Nivison                \n            \n                            \n    \n                \n                    \n    \nFields sparked a 23-point fourth-quarter explosion in the Jets' most recent outing, a 39-38 triumph over the Cincinnati Bengals. He played some of his best football of the year in the team's first win and may have built some cushion in what has been an uncertain quarterback situation. That did not, however, bring an end to the weekly uncertainty over the direction of the Jets' offense.\nFields' play inconsistent in first season with JetsGlenn has kept his intentions private nearly every week this season but ended up rolling with Fields in all but one game. Taylor got the nod for a 29-27 loss to the Tampa Bay Buccaneers and was more than serviceable in the job but was still unable to get the Jets over the top. Taylor also logged a rough outing, though, when he tossed two interceptions in relief of Fields in a Week 7 loss to the Carolina Panthers.It has been an up-and-down season for Fields, who is in his debut campaign in the Meadowlands. In his four strong performances, he completed at least 65.6% of his passes, threw for no fewer than 218 yards and ran for three total touchdowns. But in his down weeks, Fields struggled to an extreme degree, passing for no more than 46 yards. His Week 2 outing was historically bad as he went just 3-for-11 for 27 yards.The rough performances sparked criticism from team owner Woody Johnson, who openly criticized Fields during the 0-7 start to the season. Fields responded days later with a victorious effort, which was a cathartic experience for the former first-round pick.\n\"It's been a lot for me emotionally, spiritually,\" Fields said after the win over the Bengals. \"When I was on the field, I was damn near about to start crying. Not because we won, but just because of the greatness of God and just how everything works for the greater good, everything I've been through this past week, everything that we've been through as a team these past seven weeks. It was a lot of ups and downs.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jets sticking with Justin Fields over Tyrod Taylor at QB vs. Browns - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/08/c311df8a-9c96-48ac-8508-1ce7ee06a384/thumbnail/1200x675/c4ded757d29fe0d080bfbdc8cbbecbf0/gettyimages-2243441847-1.jpg"
      ],
      "datePublished": "2025-11-08T19:24:51.000Z",
      "dateModified": "2025-11-08T19:24:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Bills vs. Dolphins: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-bills-vs-dolphins-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/cacb0ac9-1143-4043-878c-d86758d07879/thumbnail/1200x675/06762f7bfcb923cad2acf8b70b4978d1/j.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:45:04.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Buffalo looks to sweep the season series against Miami for the third straight season\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:44 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Two AFC East rivals face off in South Beach this Sunday, as Tua Tagovailoa and the 2-7 Miami Dolphins host Josh Allen and the 6-2 Buffalo Bills. Miami is coming off a mini-bye following its 28-6 loss to the Baltimore Ravens last Thursday, while the Bills are riding high following a 28-21 victory over the Kansas City Chiefs.The Dolphins moved on from general manager Chris Grier last week, but coach Mike McDaniel is expected to keep his job through the end of the season. Miami is off to its worst nine-game start under McDaniel, and just experienced the largest home loss of the McDaniel era last week (22 points). With that being said, the Dolphins were competitive with the Bills in Week 3.Bet Dolphins vs. Bills at Bet365 Sportsbook, where new users get $200 in bonus bets using the bonus code CBSBET365. Click here to get started:The Bills on the other hand appear to be surging following their Week 7 bye. Buffalo ran over the Carolina Panthers, 40-9, in Week 8, then Allen completed 23 of 26 passes for 273 yards and scored three total touchdowns against Patrick Mahomes last week. His 88.5% completion percentage vs. the Chiefs was the highest in a single game in franchise history. Let's break down this Week 10 showdown, but first, here's how you can watch the game. Where to watch Bills vs. Dolphins liveDate: Sunday, Nov. 9 | Time: 1 p.m. ETLocation: Hard Rock Stadium -- Miami Gardens, FloridaTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Bills -9.5; O/U 49.5 (via FanDuel)Bills vs. Dolphins: Need to knowAllen has had total domination over Dolphins. Allen likes facing the Dolphins, because he usually plays very well. The reigning MVP is 14-2 vs. the Dolphins lifetime, and he's been averaging 312.1 total yards and three touchdowns per game vs. Miami over his career. The three total touchdowns are the most averaged by any player vs. any opponent since 1950, and the 312.1 total yards per game are the second-most by a player vs. any opponent since 1950. Allen's 4,994 total yards and 48 total touchdowns vs. the Dolphins are the most by any player vs. an opponent before turning 30 since 1950. James Cook's impressive start. Last week, Cook snapped the Chiefs' 27-game streak without allowing a 100-yard rusher by scampering for 114 yards following a 216-yard outing vs. the Panthers the week prior. Cook's 857 rushing yards through eight games are the most by a Bills player since O.J. Simpson in 1975, and his 108.4 rushing yards per game lead the league. Is De'Von Achane one of the most explosive players ever? If the Dolphins are going to pull off this upset, running back De'Von Achane will be important. He has the sixth-most scrimmage yards (880) in the NFL this season, and you may be surprised to learn that his 5.42 yards per rush ranks No. 1 in NFL history among players that rush at least 10 times per game -- above even Bo Jackson and Jamaal Charles! Achane's 5.9 yards per touch (minimum 15 touches per game) also rank most in NFL history above Jahmyr Gibbs and Christian McCaffrey. Bills vs. Dolphins prediction, pick\nDespite being 14-2 vs. the Dolphins, did you know that Allen is just 7-8-1 against the spread vs. Miami? This line is also the largest spread McDaniel has faced as a home underdog. Still, I'm going to take Buffalo to keep rolling. The Bills have averaged 34 points per game in back-to-back wins after averaging 17 points per game in back-to-back losses. Pick: Bills -9.5, Under 49.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Bills vs. Dolphins: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/cacb0ac9-1143-4043-878c-d86758d07879/thumbnail/1200x675/06762f7bfcb923cad2acf8b70b4978d1/j.jpg"
      ],
      "datePublished": "2025-11-08T19:45:04.000Z",
      "dateModified": "2025-11-08T19:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shai Gilgeous-Alexander: Thunder did not play 'our best basketball' during NBA title run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/shai-gilgeous-alexander-thunder-hot-start-nba-title/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/08/c7c22bf1-badb-48a2-8d04-9f8a55c30cf4/thumbnail/1200x675/a92a7cfeb829d34c383fd5901a9621f7/shai-gilgeous-alexander-thunder-usatsi.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:58:13.000Z",
    "description": "\n        The Oklahoma City Thunder are off to a 9-1 start to the 2025-26 NBA season, giving them the best record in the league in their pursuit of bac",
    "body": "\n        The Oklahoma City Thunder are off to a 9-1 start to the 2025-26 NBA season, giving them the best record in the league in their pursuit of back-to-back titles.  Their performance in the first 10 games has ensured there is no talk about a championship hangover in OKC, as they look even more dominant than the team that won 68 games in the regular season a year ago. That's particularly impressive for a young team that had never won a title before and could have easily spent their summer celebrating and expected to do it again. \n        \n            \n                NBA Power Rankings: Lakers, Rockets on the rise; Blazers, Bulls busy shocking the world\n                \n                    Brad Botkin                \n            \n                            \n    \n                \n                    \n    \nAfter their win over Sacramento on Friday night, Shai Gilgeous-Alexander explained how the Thunder used their playoff run to fuel a hot start rather than letting their championship victory make them comfortable. \"Honestly speaking, I didn't like the way we won, if that makes sense,\" said Gilgeous-Alexander. \"I didn't think we won an NBA championship playing our best basketball. And that was the first time we'd been that far in the playoffs, so it was a learning experience for us, but it takes another level of focus, discipline, assertiveness, aggression, to like, be who we were in the regular season and do that throughout the postseason. \n\"I think we were definitely more dominant in the regular season than the postseason,\" Gilgeous-Alexander added. \"So yeah, that was the biggest thing for me. And for me, as well as a player, I don't think I was as good in the postseason as I was in the regular season. Now, it naturally happens when you play a team seven times in a row, and they get to scout seven times in a row. But I feel like I could have been better, so I try to control that. And then that mentality I guess just trickles over to the team stuff.\"This echoes Mark Daigneault's comments earlier this year in which he explained the message in the OKC gym all offseason has been to \"look at this season as if we lost in the second round -- if we lost Game 7 in Denver.\" The Thunder were pushed to seven games twice in their run to a title, first in the second round against the Nuggets and then again in the Finals against Indiana. After winning 68 games and looking like a buzzsaw on both sides of the ball, Oklahoma City learned firsthand how difficult it is to sustain that kind of performance in the postseason, nearly getting caught twice en route to the title. \nThe result of their approach this year has been the Thunder once again leading the league with a 106.4 defensive rating and pairing that with the sixth-ranked offense.On a personal level, Gilgeous-Alexander saw his efficiency dip from his MVP performance in the regular season in the playoffs -- 49.4 effective field goal percentage in the playoffs after a 56.9 eFG% in the regular season. As the leader of the team, he's put it on himself to set the tone and come out with the same level of focus and intensity this season after winning MVP, Finals MVP and a championship as he did last year when he was still hunting for his first of all of those accolades. When the guy who accomplished all of that individually takes that approach, it's hard for the rest of the team not to follow. The young Thunder don't appear worn out by last year's deep playoff run and have the luxury of the league's deepest roster to lean on, maintaining their spot atop the NBA standings even without their second-best player, Jalen Williams, playing yet. \nAlignment in messaging from their coach and best player has kept them focused and determined to prove last year was only the beginning and that they can be even better. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shai Gilgeous-Alexander: Thunder did not play 'our best basketball' during NBA title run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/08/c7c22bf1-badb-48a2-8d04-9f8a55c30cf4/thumbnail/1200x675/a92a7cfeb829d34c383fd5901a9621f7/shai-gilgeous-alexander-thunder-usatsi.jpg"
      ],
      "datePublished": "2025-11-08T18:58:13.000Z",
      "dateModified": "2025-11-08T18:58:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch 49ers vs. Rams: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-49ers-vs-rams-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/03d3c33b-68eb-43e8-839d-7e2a603cf65b/thumbnail/1200x675/5d32d508f57721f4f7925fcb8c20e49a/matthew-stafford-rams.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:47:05.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    San Francisco will go for the season sweep over Los Angeles at home this weekend\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:46 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The latest chapter in the Kyle Shanahan vs. Sean McVay rivalry unfolds Sunday when the 49ers host the Rams in a crucial NFC West battle.Shanahan owns an 11-7 edge (including playoffs) over his friend and former co-worker, and that includes a 26-23 overtime win in Los Angeles in Week 5. The 49ers, quarterbacked by Mac Jones, were 7.5-point underdogs, making it Shanahan's largest upset win as a coach. It looks like Jones will get the call under center once again as Brock Purdy continues to deal with a troublesome turf toe injury that has limited him to just two games this season.Bet Rams vs. 49ers at Caesars Sportsbook, where new users get 20 100% profit boost tokens with the promo code CBS20X. Click here to get started:On the other side is a team that is absolutely rolling. Ever since the loss to the 49ers, the Rams have won three straight games, outscoring their opponents 86-20 over that span. Matthew Stafford has emerged as an MVP candidate, and the defense has more than held up its end of the bargain as well.Here's how to watch this NFC West showdown, as well as betting information, keys to the game and a prediction.Where to watch 49ers vs. Rams liveDate: Sunday, Nov. 9 | Time: 4:25 p.m. ETWhere: Levi's Stadium -- Santa Clara, CaliforniaTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Rams -4.5; O/U 49.5 (via FanDuel)49ers vs. Rams: Need to knowMatthew Stafford is on an absolute heater. Over his last five games, Stafford has thrown for 16 touchdowns and zero interceptions. That included a 375-yard, three-touchdown game against the 49ers. Overall this season, Stafford leads the NFL with 21 passing touchdowns, and he is fifth in the league with 2,147 passing yards. Stafford has been tremendous surrounded by one of the best receiving duos in the NFL in Puka Nacua and Davante Adams, who leads the NFL with eight receiving touchdowns. Nacua, it should be noted, is expected to be just fine for this game after exiting early with a rib injury in Week 9.Christian McCaffrey keeps 49ers offense moving. Purdy is one of several key players who has missed time this season. Defensive stars Fred Warner and Nick Bosa are out for the season, as is first-round rookie Mykel Williams. George Kittle, Ricky Pearsall and Jauan Jennings have all missed time, and Brandon Aiyuk is yet to make his season debut. Yes the 49ers just keep on going, thanks in large part to McCaffrey, who leads the NFL with 1,222 yards from scrimmage. After missing much of last year, McCaffrey has returned to his normal workhorse status, and even though he hasn't been as explosive or efficient as in past years, he is on pace to become the first player with multiple seasons of 1,000 rushing yards and 1,000 receiving yards.Rams defense holding its own. For all the headlines Stafford, Nacua and Adams garner, the Rams' defense has been terrific. Los Angeles ranks in the top 10 in yards per play allowed, yards per rush allowed, net yards per pass attempt allowed, sack rate and third-down and red zone efficiency. Byron Young has nine sacks this year, already surpassing his previous career high, and Jared Verse is the other half of a fearsome pass rush.49ers vs. Rams pick, prediction\nEach of the last five games between these two teams has been decided by seven points or fewer, and expect that to continue this weekend. This time, however, it's the Rams sneaking out a narrow win, with Stafford and his top two targets making big plays to even the season series with their division rivals upstate. Pick: Rams -4.5; Over 49.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch 49ers vs. Rams: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/03d3c33b-68eb-43e8-839d-7e2a603cf65b/thumbnail/1200x675/5d32d508f57721f4f7925fcb8c20e49a/matthew-stafford-rams.jpg"
      ],
      "datePublished": "2025-11-08T19:47:05.000Z",
      "dateModified": "2025-11-08T19:47:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Steelers vs. Chargers: TV channel, live stream and preview for SNF - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-steelers-vs-chargers-tv-channel-live-stream-and-preview-for-snf/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/06/0b2ea6c4-ecb7-4383-80ad-47b1ff1a033f/thumbnail/1200x675/d1c94e5da4eadd71994b731b1e0ceed8/rodgersindy.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:49:09.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    A compelling matchup between two of the AFC's top teams on 'Sunday Night Football'\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:49 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        January 15, 1995, is a day that lives in infamy for Steelers fans who remembered what might be the worst loss in the franchise's rich history. Bill Cowher has gone on record saying Pittsburgh's 17-13 loss to the Chargers that day was the worst defeat during his 15 years as the Steelers' coach. A massive favorite, the Steelers watched the Chargers overcome a 10-point, fourth-quarter deficit to steal what appeared to be a sure trip to the Super Bowl for the black and gold. Bet Chargers vs. Steelers at Caesars Sportsbook, where new users get 20 100% profit boost tokens with the promo code CBS20X. Click here to get started:Sunday night has all the makings of another highly-competitive game between these two teams. The Steelers will head to Los Angeles with a 5-3 record after dispatching the Colts last week in Pittsburgh. At 6-3, the Chargers are looking to keep pace with the Broncos who moved to 8-2 with a victory over the Las Vegas Raiders Thursday night. Plus the Chargers still have to visit Kansas City to face a rejuvenated Chiefs team. \nWhere to watch Steelers vs. Chargers liveWhen: Sunday, Nov. 9 | Time: 8:20 p.m. ETWhere: SoFi Stadium -- Inglewood, California  TV: NBC | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Chargers -3; O/U 44.5 (via FanDuel)Steelers vs. Chargers: Need to know Recent rematch. These teams faced each other a little over a year ago in Pittsburgh. The Steelers won that game, 20-10, on the strength of a defense that held the Chargers to just 10 first downs and 166 total yards. Steelers coach Mike Tomlin acknowledged this week that his team faced a physically compromised Justin Herbert that day, as Herbert played through a considerable ankle injury for most of the game before exiting the contest in the second half. Key injury. The Chargers recently lost another notable player when starting offensive tackle Joe Alt suffered a season-ending ankle injury during last week's win over the Titans. Los Angeles is now without both of its starting offensive tackles after losing Rashawn Slater to a season-ending injury back in August. New Steelers secondary. Tomlin said this week that Jalen Ramsey will be exclusively at free safety while playing alongside new starting strong safety Kyle Dugger. Dugger played in all but one of the Steelers' defensive snaps last week despite joining the team just days before Pittsburgh's win over the Colts. Big game for Warren? Pittsburgh struggled to run the ball vs. the Colts, but on Sunday, they'll be facing a Chargers defense that is 27th in the NFL in average yards-per-carry allowing 4.9 yards. This could mean good things for Jaylen Warren, who is three weeks removed from his lone 100-yard rushing performance this season. Red zone showdown. It'll be interesting to see which units steps up when Pittsburgh's offense enters the red zone against Los Angeles' defense. Led by Aaron Rodgers, the Steelers' offense is seventh in the NFL in red zone efficiency this season. On Sunday night, they'll face a Chargers defense that is the fourth-best in the league inside their own 20-yard-line. Steelers vs. Chargers prediction, pick \nA pretty evenly matched game, the Steelers do have one statistical advantage that may prove to be a big key in the game. Pittsburgh's defense, seventh in the NFL in red zone efficiency, will face a Chargers offense that is just 26th in the NFL in terms of scoring touchdowns inside the opponents' 20-yard-line. If T.J. Watt and the rest of Pittsburgh's defense can force the Chargers to settle for field goals, it would go a long way towards a possible upset. Pick: Steelers +3; Over 44.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Steelers vs. Chargers: TV channel, live stream and preview for SNF - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/06/0b2ea6c4-ecb7-4383-80ad-47b1ff1a033f/thumbnail/1200x675/d1c94e5da4eadd71994b731b1e0ceed8/rodgersindy.jpg"
      ],
      "datePublished": "2025-11-08T19:49:09.000Z",
      "dateModified": "2025-11-08T19:49:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Browns vs. Jets: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-browns-vs-jets-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/91cbe33c-1a12-4434-a8c0-073ac23e71d1/thumbnail/1200x675/d06f1b67ff6c85d1158bdb041cffa156/myles-garrett.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:45:56.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    This November matchup could have serious April implications\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:45 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Cleveland Browns and New York Jets are facing off in a game that could end up having draft implications. The Browns sit at 2-6 and last in the AFC North, while the Jets are 1-7 and also last in their division, the AFC East.While neither team is having an incredible season, which is putting it mildly, some changes both squads made prior to last week's trade deadline could have big impacts on not just this game but the rest of the season. The trade deadline move that shook up the league was the Jets sending the 2022 No. 4 overall pick Sauce Gardner to the Indianapolis Colts. They also sent their 2019 No. 3 overall pick Quinnen Williams to the Dallas Cowboys.Bet Jets vs. Browns at BetMGM Sportsbook, where new users get up to $1,500 in bonus bets back if their first wager doesn't win with the promo code CBSSPORTS: Click here to get started:Leading up to the game, Browns coach Kevin Stefanski announced that for the second-straight year, he will be giving up play-calling duties to his offensive coordinator, Tommy Rees.\nWhere to watch Browns vs. Jets liveDate: Sunday, Nov. 9 | Time: 1 p.m. ETLocation: MetLife Stadium -- East Rutherford, New JerseyTV: CBS | Stream: Paramount+Follow: CBS Sports AppOdds: Browns -2.5; O/U 37.5 (via DraftKings)Browns vs. Jets: Need to knowWho'll be Jets' QB1? During Monday's press conference, coach Aaron Glenn wouldn't say if Justin Fields or Tyrod Taylor would be the starter for Week 10. Glenn did compliment Fields' 244 yard, one touchdown performance against the Bengals, saying the QB \"did a hell of a job\" against them. Taylor is 0-1 in starts this year, losing to the Tampa Bay Buccaneers. It'll be a new New York defense. The Jets defense will look a lot different without Gardner and Williams. New York wasn't winning games even with the two All-Pros and decided that investing in their future was more important than their present. Their defense had been allowing the fifth-fewest passing yards up to this point and so it will be interesting how their approach and effectiveness in shutting down opposing offenses looks without their two former stars. Both teams are coming off byes. Both teams had a chance to have a much-needed reset in Week 9. The Jets last game was their first win of the season, when they defeated the Cincinnati Bengals, 39-38. Can New York recapture that momentum and start a winning streak? The Browns most recent contest was a 32-13 loss to the New England Patriots.Browns vs. Jets prediction, pick\nConsidering the struggles that exist on both sides, this is a difficult one to pick. I'm agreeing with the betting odds this week and picking Cleveland to have a slight edge. Pick: Browns -2.5; Under 37.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Browns vs. Jets: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/91cbe33c-1a12-4434-a8c0-073ac23e71d1/thumbnail/1200x675/d06f1b67ff6c85d1158bdb041cffa156/myles-garrett.jpg"
      ],
      "datePublished": "2025-11-08T19:45:56.000Z",
      "dateModified": "2025-11-08T19:45:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Commanders vs. Lions: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-commanders-vs-lions-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/ce8b608f-e0a7-4fbd-ac5e-30f02f1b9f6b/thumbnail/1200x675/d611be5dbf5826eb256020ba25c6a507/dan-campbell-jared-goff-lions.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:48:43.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    Detroit looks to get back on track against a depleted Washington team\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:48 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Lions will put their remarkable winning streak following a loss on the line Sunday when they visit the Commanders in a rematch of last year's NFC divisional round meeting.Detroit (5-3) is coming off a surprising 27-24 loss to the Vikings, but Dan Campbell's bunch hasn't lost consecutive games since 2022. The Lions have have gone 52 straight games without losing back-to-back contests since then and have won their last 12 games that followed a loss.Bet Lions vs. Commanders at Bet365 Sportsbook, where new users get $200 in bonus bets using the bonus code CBSBET365. Click here to get started:They will be heavily favored to make that 13 straight given the condition of the Commanders currently. Washington (3-6) has come crashing back down to Earth after last year's stunning 12-5 record and trip to the NFC Championship Game. Reigning Offensive Rookie of the Year Jayden Daniels dislocated his elbow late in a Week 9 blowout loss to the Seahawks and will be out. His injury is one of several the Commanders have experienced this year, and Marcus Mariota will make his fourth start in place of Daniels this season.\nWhere to watch Commanders vs. Lions liveDate: Sunday, Nov. 9 | Time: 4:25 p.m. ETWhere: Northwest Stadium -- Landover, MarylandTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Lions -8.5; O/U 48.5 (via FanDuel)Commanders vs. Lions: Need to knowLions look to get offense back on track. Jared Goff got sacked five times, and Detroit managed just 65 rushing yards last week. The Lions' 305 yards of offense represented their fifth consecutive game with 380 yards or fewer, their longest streak since 2021. Overall, the Lions have slipped to 11th in yards per game this season; they were second last year. Offensive coordinator John Morton, Goff and star running back Jahmyr Gibbs should have ample opportunities to get back on track, though. Washington is allowing over 410 yards per game over their past four games, the second-highest in the NFL.Aidan Hutchinson, rest of pass rush aim to get after Marcus Mariota. After signing a massive extension with the Lions last week, Hutchinson had a sack and seven pressures against the Vikings. He has seven sacks this season and will look to add to that total against a Washington offensive line susceptible to the pass rush. Washington quarterbacks have taken 24 sacks this season, tied for ninth-most in the NFL entering Week 10, and Mariota has taken multiple sacks in three of the four games he's seen significant action in this season.Washington trying to find bright spots. The Commanders have been outscored 135-67 during their four-game losing streak, the worst point margin in the NFL since Week 6. Not only is Daniels out, but so, too is Terry McLaurin as well as several other key contributors. At this point, Washington is hoping to find anything positive to take forward. Keep an eye on rookie right tackle Josh Conerly Jr., rookie cornerback Trey Amos and some other youngsters who will figure heavily into Washington's future as it plays out the string this season.Commanders vs. Lions pick, prediction\nThis one seems pretty straight forward. Washington has been one of the worst defensive teams in the NFL over the past several weeks, making this a perfect get-right game for Detroit. This was always going to be a tough challenge for Washington even if Daniels was healthy considering how poorly the defense is playing. Without him, victory is a near impossibility. Pick: Lions -8.5; Over 48.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Commanders vs. Lions: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/ce8b608f-e0a7-4fbd-ac5e-30f02f1b9f6b/thumbnail/1200x675/d611be5dbf5826eb256020ba25c6a507/dan-campbell-jared-goff-lions.jpg"
      ],
      "datePublished": "2025-11-08T19:48:43.000Z",
      "dateModified": "2025-11-08T19:48:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Vikings vs. Ravens: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-vikings-vs-ravens-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/05/cf7d634a-05ba-4f7a-9392-a1e9f9067913/thumbnail/1200x675/f4a726bb620dd66fdfc20d1d3bc31dfe/lamar-jackson-ravens-2.jpg",
    "tag": "Sports",
    "date": "2025-11-08T19:45:24.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    After early-season disappointments both teams are looking to build on recent wins\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:45 pm ET\n                        \n                •\n            \n            3 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        Two teams looking to make playoff pushes with their starting quarterbacks finally healthy meet in Minneapolis on Sunday when the Vikings host the Ravens at U.S. Bank Stadium.The Vikings (4-4) pulled off a stunner win Week 9, topping the Lions, 27-24, behind a strong effort from the defense in J.J. McCarthy's return from an ankle injury. The Ravens cruised past the Dolphins, 28-6, and are now 3-5 on the season after a 1-5 start. Lamar Jackson, playing for the first time since Week 4, threw for four touchdown passes. The Ravens had thrown for only one score in the previous three weeks when Jackson was out with a hamstring injury.Bet Ravens vs. Vikings at Bet365 Sportsbook, where new users get $200 in bonus bets using the bonus code CBSBET365. Click here to get started:Both teams will look to kick off the second half of their seasons with an interconference win and look to keep pace in the group of teams on the outside looking in on the current playoff picture. Here's how to watch the game, followed by odds, keys to the game and a prediction.\nWhere to watch Vikings vs. Ravens liveDate: Sunday, Nov. 9 | Time: 1 p.m. ETWhere: U.S. Bank Stadium -- Minneapolis, MinnesotaTV: Fox | Stream: Fubo (try for free)Follow: CBS Sports AppOdds: Ravens -4.5; O/U 48.5 (via FanDuel)Vikings vs. Ravens: Need to knowLamar Jackson has dominated NFC teams. Jackson leads the NFL in passer rating this season, and if the past is any indication, he should have another big performance Sunday. Jackson is 24-3 against NFC teams, the best interconference mark by a starting quarterback since the 1970 AFL-NFL merger, and he has thrown 20 touchdown passes and just one interception in his last seven starts against NFC teams. Jackson's return also provided a boost for Derrick Henry, who had 119 yards rushing against the Dolphins, so the Minnesota defense will have its hands full.J.J. McCarthy looks to build on big win. McCarthy has experienced plenty of ups and downs to start his NFL career. After missing all of his rookie year due to a knee injury, he struggled for much of his NFL debut against the Bears before rallying the Vikings to an unlikely win. He then struggled again in a Week 2 loss to the Falcons and suffered a high ankle sprain. He missed Weeks 3-8 with that injury and returned in Week 9 with his best and most consistent performance. Though the 143 yards passing aren't that impressive, he made multiple big throws -- including two touchdowns -- and also ran for a score. He has multiple passing touchdowns and a rushing touchdown in two of his three career NFL games.Both defenses are improving. The Ravens were one of the NFL's worst defenses early in the season, but a pair of recent developments have helped. First, they've gotten healthy, with Roquan Smith, Marlon Humphrey and others returning from injury. Second, the acquisition of Alohi Gilman has allowed the Ravens to play with three safeties more often and move Kyle Hamilton closer to the line of scrimmage. The Vikings uncharacteristically struggled in consecutive losses to the Eagles and Chargers but got back on track in Week 9, by limiting the Lions' potent rushing attack to just 65 yards and sacking Jared Goff five times.Vikings vs. Ravens pick, prediction\nEven with improvements last week, the Vikings are allowing the sixth-most yards per play since Week 6, and now they're facing an offense back at full strength with Jackson in the fold. McCarthy looked more comfortable and confident in his return from injury, but the lack of explosiveness will make it hard for Minnesota to keep up with Jackson, Henry & Co. Pick: Ravens -4.5; Under 48.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Vikings vs. Ravens: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/05/cf7d634a-05ba-4f7a-9392-a1e9f9067913/thumbnail/1200x675/f4a726bb620dd66fdfc20d1d3bc31dfe/lamar-jackson-ravens-2.jpg"
      ],
      "datePublished": "2025-11-08T19:45:24.000Z",
      "dateModified": "2025-11-08T19:45:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dakorien Moore injury: Oregon star WR injured, will miss Iowa game in Week 11 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/dakorien-moore-injury-oregon-ducks-wide-receiver/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/08/00778cfc-026a-4f3b-83e4-0da7060c57bd/thumbnail/1200x675/1f8697eae2d3f01a47e4a3949b260f76/adobe-express-file-78.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:51:33.000Z",
    "description": "\n        Oregon wide receiver Dakorien Moore will miss his team's Week 11 game against No. 20 Iowa (3:30 p.m. ET on CBS and streaming on Paramount+ Pr",
    "body": "\n        Oregon wide receiver Dakorien Moore will miss his team's Week 11 game against No. 20 Iowa (3:30 p.m. ET on CBS and streaming on Paramount+ Premium) after he suffered an injury during practice this week, sources confirmed to CBS Sports' Matt Zenitz. Moore, a true freshman, leads the Ducks with 443 yards receiving on 28 catches with three touchdowns. The injury is not expected to be season-ending. It didn't take long for Moore, who signed with Oregon in 2025 as the nation's top-ranked wide receiver prospect, to emerge as one of quarterback Dante Moore's top targets. Moore had 69 yards and a touchdown on just two catches in Oregon's Week 2 win against Oklahoma State, which marked his debut against Power Four competition. He's dipped below 40 yards receiving just once in seven games since and his 15.8 yards per catch ranks sixth in the Big Ten among receivers with at least 20 receptions on the season and first among the conference's true freshmen. Moore, a product of Duncanville, Texas, initially chose the Ducks over offers from almost every major program in the nation, including the in-state powerhouse Texas Longhorns. He filled an immediate need for Oregon, which lost three of its top four receiving targets from the 2024 season.\n        \n            \n                College football picks: Predictions against the spread, odds, betting lines for top 25 games in Week 11\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nTo compound matters, Evan Stewart, Oregon's top returning wide receiver, suffered a preseason knee injury that has sidelined him for the entirety of the 2025 campaign thus far. There is a chance that he returns late in the year. \nIf Moore is unable to go, Oregon will have to lean more on Gary Bryant Jr., Malik Benson and Jeremiah McClellan, who each have at least 200 yards receiving this season. McClellan, a redshirt freshman and former top-100 prospect in the 2024 class, could start alongside Benson at one of Oregon's outside receiver spots. Moore's injury also opens the door for a veteran like Kyler Kasper, a 6-foot-6 junior that has just two receptions in 2025, to step into a bigger role on the road in Iowa City. A lot on the line for Oregon vs. IowaThe timing of Moore's injury certainly isn't ideal for Oregon as it's staring down its toughest stretch of the season. Saturday's road trip to Iowa will be the Ducks' most difficult road environment since a win over then-No. 3 Penn State back on Sept. 27. Beginning with Iowa, Oregon has to face three teams ranked in the top 25 in its last four games as matchups with No. 19 USC and No. 23 Washington wait. \nThe Hawkeyes debuted at No. 20 in the initial College Football Playoff rankings, which means that the selection committee views them as a legitimate contender. It could be a nice résumé piece for Oregon if it escapes with a win. A loss would not tank Oregon's playoff hopes, but it would effectively prevent the Ducks from making a return to the Big Ten Championship Game. Currently, they're one of four Big Ten teams -- including Iowa -- with just one loss in conference play. Everyone is chasing No. 1 Ohio State and No. 2 Indiana, who remain unblemished. It's already going to be hard to close the gap with the Buckeyes and the Hoosiers. Two losses would make it virtually impossible. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dakorien Moore injury: Oregon star WR injured, will miss Iowa game in Week 11 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/08/00778cfc-026a-4f3b-83e4-0da7060c57bd/thumbnail/1200x675/1f8697eae2d3f01a47e4a3949b260f76/adobe-express-file-78.jpg"
      ],
      "datePublished": "2025-11-08T18:51:33.000Z",
      "dateModified": "2025-11-08T18:51:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giants coaching rumors: One big name that can be ruled out if Brian Daboll is let go - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/giants-coaching-rumors-heres-one-big-name-ruled-out-if-new-york-moves-on-brian-daboll/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/08/26/d4becdc7-618f-4ea4-9325-3eec92379833/thumbnail/1200x675/2353c80afaa5a681c57915afe2931b19/gettyimages-2231382905-1.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:13:51.000Z",
    "description": "\n        If you were hoping for another Ole Miss Rebel to head north and become the next head coach of the New York Giants, you might be out of luck. ",
    "body": "\n        If you were hoping for another Ole Miss Rebel to head north and become the next head coach of the New York Giants, you might be out of luck. As current coach Brian Daboll currently stands on shaky ground in East Rutherford, there has been a natural question as to who could fill his shoes if New York were to part ways with him. Given the emergence of rookie sensation Jaxson Dart as a franchise cornerstone at quarterback, folks have drawn the logical line to giving Lane Kiffin a call to see if he'd want to reunite with his former quarterback and return to the NFL. While it makes sense on paper, judging by what Brandon Dart, Jaxson's father, had to say about that possible reunion, it doesn't sound like a realistic option. \"As we were texting on our Kiffin-Dart family text thread, because I think Boomer Esiason had said something in the media today that maybe they should throw out a potential coaching (offer) to Kiffin, and he just sent it over with a smirk and just said, 'It's too cold in New York for me.' It's just kind of funny,\" Brandon Dart told the \"Bleav in Ole Miss\" podcast, via the New York Post. \"But we have our weekly interactions with him and his family, and Jaxson holds high regard. I think Kiffin is one of his most trusted allies, and I think he uses him for advice in a lot of different ways, so there's constant communication between them, even today, and there's a lot of that between our families. I don't think we could have asked for a more special coach relationship between our family and our son, so we're very, very grateful for coach Kiff.\"\nKiffin coached Dart for three years at Ole Miss, which included a stellar senior season in 2024 with the quarterback throwing for 4,279 yards and 29 touchdowns while completing 69.3% of his throws. That tutelage helped him become a first-round pick at the 2025 NFL Draft, and, given the close ties they share, it would make sense for New York to see if he'd be interested in the job. While weather might be a factor for Kiffin, so is the current landscape in college football. There are a number of high-profile jobs open, including at LSU, Penn State, and Florida, where he could be a leading candidate. He could also simply stay put at Ole Miss, where he currently has the Rebels in contention for the College Football Playoff. Even with Kiffin as a long shot, the mere fact that this is a conversation highlights how hot the seat is under Daboll at the moment. New York finds itself entering Week 10 dead last in the NFC East at 2-7, and the club is currently on a three-game losing streak. That streak includes a 33-32 loss to the Broncos in Week 7, where the Giants allowed Denver to score all of those points in a frantic fourth-quarter comeback. \nIf Daboll, who is 20-39-1 in his 60 regular-season games as head coach of the Giants, doesn't show signs of turning it around between now and the end of the season, it could force owner John Mara's hand to make a change. And if that change isn't toward someone like Kiffin, let's highlight three other possible options. Jesse MinterCurrent role: Defensive coordinator, Los Angeles ChargersOwnership and fans alike may want an offensive-minded head coach to further cater to Dart's development, but don't sleep on a guy like Jesse Minter, either. New York has invested heavily along the defensive line by acquiring the likes of Brian Burns, signing Dexter Lawrence to a big-money extension, and drafting Abdul Carter and Kayvon Thibodeaux inside the top five of the NFL Draft in recent years. That unit has the potential to be among the best in the NFL, and could reach that with someone like Minter at the helm, which would, in turn, help Dart and the offense. \nMinter, who was the defensive coordinator at the University of Michigan and followed Jim Harbaugh to the Los Angeles Chargers in the same role, has presided over some dominant defenses. In 2024, the Chargers ranked No. 1 in points allowed and are No. 6 in the league in yards allowed in 2025 (entering Week 10). Kliff KingsburyCurrent role: Offensive coordinator, Washington CommandersLast offseason, we saw former Lions offensive coordinator Ben Johnson accept a head coaching job in the division with Chicago, so maybe Kingsbury could be the latest to follow that track. Kingsbury has done wonders for the Commanders offense with a young Jayden Daniels, and could bring a similar boost to Dart's development in New York. On top of being one of the top offensive minds in the NFL, he also comes with prior head coaching experience, leading the Arizona Cardinals from 2019 to 2022. Kingsbury went just 28-37-1 over that tenure, but it did include an 11-6 record in 2021. Klint KubiakCurrent role: Offensive coordinator, Seattle SeahawksKubiak is expected to be a popular name this upcoming hiring cycle, especially after he has turned the Seattle Seahawks offense into one of the best in the league. Entering Week 10, Sam Darnold is playing at an MVP level and averaging 9.6 yards per attempt. Meanwhile, Jaxon Smith-Njigba currently leads the NFL with 948 yards receiving and is on pace to be the league's first 2,000-yard receiver. Could he work similar magic with Dart and a healthy Malik Nabers with the Giants? \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giants coaching rumors: One big name that can be ruled out if Brian Daboll is let go - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/08/26/d4becdc7-618f-4ea4-9325-3eec92379833/thumbnail/1200x675/2353c80afaa5a681c57915afe2931b19/gettyimages-2231382905-1.jpg"
      ],
      "datePublished": "2025-11-08T18:13:51.000Z",
      "dateModified": "2025-11-08T18:13:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oregon vs. Iowa odds, line: Week 11 college football picks from proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/oregon-iowa-prediction-odds-line-time-week-11-college-football-picks/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/08/4661d3ad-a1c7-4436-bfe4-cc5fec4938d9/thumbnail/1200x675/5b6f9914b66c34ec1edb0fdb78876243/jordon-davison-oregon-ducks-imagn-images.jpg",
    "tag": "Sports",
    "date": "2025-11-08T18:41:05.000Z",
    "description": "\n        The ninth-ranked Oregon Ducks will battle the 20th-ranked Iowa Hawkeyes in a key Big Ten showdown on Saturday. Both teams are coming off thei",
    "body": "\n        The ninth-ranked Oregon Ducks will battle the 20th-ranked Iowa Hawkeyes in a key Big Ten showdown on Saturday. Both teams are coming off their byes, after Oregon topped Wisconsin 21-7 and Iowa rolled over Minnesota 41-3. The Ducks (7-1, 4-1 Big Ten), who are 1-1 against ranked teams, are 3-0 on the road this year. The Hawkeyes (6-2, 4-1 Big Ten), who are 0-2 against ranked foes, are 4-1 on their home field. Oregon receiver Dakorien Moore has been ruled out. Kickoff from Kinnick Stadium in Iowa  City, Iowa, is at 3:30 p.m. ET on CBS and Paramount+. The Ducks are 5.5-point favorites in the latest Oregon vs. Iowa odds, while the over/under for total points scored is 42.5. Before making any Iowa vs. Oregon picks, check out the college football predictions from the SportsLine Projection Model. Be sure to watch this game on CBS or Paramount+, where new users can get a free one-week trial. Sign up here.    New users can target the DraftKings promo code, which offers $300 in bonus bets if your bet wins + 3 months of NBA League Pass:The model simulates every FBS game 10,000 times. Since its inception, it has generated a betting profit of over $2,000 for $100 players on its top-rated college spread football picks. Anybody following its college football betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Oregon vs. Iowa. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Iowa vs. Oregon:Oregon vs. Iowa                                                                     spreadOregon -5.5 at DraftKings SportsbookOregon vs. Iowa                                                                 over/under42.5 pointsOregon vs. Iowa                                                                                                                                                                                 money line Oregon -220, Iowa +180Oregon vs. Iowa                                                                                                                                                                         picksSee picks at SportsLineOregon vs. Iowa                                                                                                                                                                           streaming Paramount +  Why Oregon can coverSophomore quarterback Dante Moore has had a solid season. In eight games, he has completed 145 of 203 passes (71.4%) for 1,772 yards and 19 touchdowns with just four interceptions and a 171.7 rating. He has also carried 40 times for 131 yards. In a 41-7 win over rival Oregon  State on Sept. 20, he completed 21 of 31 passes for 305 yards and four touchdowns, while rushing seven times for 53 yards, including a long of 28.Among those helping lead the rushing attack is freshman Jordon Davison. He is coming off back-to-back monster games. In a 56-10 win at Rutgers, he carried four times for 100 yards and one touchdown. He carried 16 times for 102 yards and two scores in the win over Wisconsin. He has scored in every game but one, and has 10 touchdowns on the season, to go along with 51 carries for 352 yards. See which team to back at SportsLine. Why Iowa can coverSenior Mark Gronowski helps power the Hawkeyes' offense. In eight games, he has completed 107 of 165 passes for 946 yards and four touchdowns with four interceptions. He has also carried 76 times for 313 yards and 11 touchdowns. In the 25-24 win over Penn  State, he rushed nine times for 130 yards and two touchdowns. He also rushed for three touchdowns in a 38-28 win over Rutgers.Also leading the ground game for Iowa is sophomore running back Kamari Moulton. In six games, Moulton has carried 82 times for 435 yards (5.3 average) and two touchdowns. He has 11 receptions for 81 yards, including a long of 16. In the win over Penn  State, he carried 17 times for 99 yards (5.8 average), including a long of 21. He rushed 15 times for 96 yards and a score in a 37-0 win at Wisconsin on Oct. 11. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to make Oregon vs. Iowa picksSportsLine's model is going Over on the total, projecting 52 combined points. It also says one side of the spread hits in well over 50% of simulations.     You can only get the pick at SportsLine. So who wins Oregon vs. Iowa, and which side of the spread hits in well over 50% of the time? Visit SportsLine now to see which side of the Oregon vs. Iowa spread to jump on, all from the advanced model that finished up over $2,000 on its FBS college football picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oregon vs. Iowa odds, line: Week 11 college football picks from proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/08/4661d3ad-a1c7-4436-bfe4-cc5fec4938d9/thumbnail/1200x675/5b6f9914b66c34ec1edb0fdb78876243/jordon-davison-oregon-ducks-imagn-images.jpg"
      ],
      "datePublished": "2025-11-08T18:41:05.000Z",
      "dateModified": "2025-11-08T18:41:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Saints vs. Panthers: TV channel, live stream and preview for Week 10 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/where-to-watch-saints-vs-panthers-tv-channel-live-stream-and-preview-for-week-10/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/a0283239-e8f8-4d85-a02a-4ea617e01917/thumbnail/1200x675/6da3d185b6b670d356b0b2df14acf45c/untitled-design-2025-11-07t014920-329.png",
    "tag": "Sports",
    "date": "2025-11-08T19:43:37.000Z",
    "description": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you",
    "body": "\n\n    \n        Content on this page may include affiliate links. If you click and sign up/place a wager, we may receive compensation at no cost to you.\n    \n        \n\n    \n                                    The Panthers and Saints will reignite their NFC South rivalry this weekend\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n                            \n    Nov 8, 2025\n                            \n                    at\n    2:43 pm ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Imagn Images\n            \n            \n    \n        The Carolina Panthers and New Orleans Saints will meet in a divisional clash this weekend, and the vibes around each squad couldn't be more different. Carolina just sprung a huge upset against the Green Bay Packers in Lambeau Field, and New Orleans just got shelled by the Los Angeles Rams.Anyone who thought about writing off the Panthers as playoff contenders can forget it because they just pulled off one of the most surprising results of the season with their 16-13 win over the Packers. Running back Rico Dowdle, who wrestled the starting job from Chuba Hubbard, has given the offense a little more juice. He went for 141 total yards and two touchdowns against a stout Green Bay defense. After an 0-2 start, the Panthers have rattled off five wins in their last seven games.Bet Panthers vs. Saints at BetMGM Sportsbook, where new users get up to $1,500 in bonus bets back if their first wager doesn't win with the promo code CBSSPORTS: Click here to get started:On the other sideline, the Saints have been written off for a while now, and for good reason. They have one of the worst quarterback situations in the NFL, and that showed last week. In his first career start, Tyler Shough threw for 176 yards, one touchdown and one interception against a very good Rams defense. Shough faces a less difficult test this weekend, but he is down a key weapon after the Saints dealt receiver Rashid Shaheed to the Seattle Seahawks at the trade deadline.\nWhere to watch Saints vs. Panthers liveDate: Sunday, Nov. 9 | Time: 1 p.m. ETLocation: Bank of America Stadium -- Charlotte, North CarolinaTV: Fox | Stream: Fubo (Try for free)Follow: CBS Sports AppOdds: Panthers -5.5; O/U 39.5 (via DraftKings)Saints vs. Panthers: Need to knowPanthers favored for this first time this season. The Panthers are the favorite in this matchup, and that marks the first time that has happened all season. In fact, Carolina hasn't been favored in this matchup since 2017 with New Orleans snapping a streak of 15 straight meetings as the favorite. It will be interesting to see how the Panthers handle a game that most everyone expects them to win.Saints' struggles against winning teams. The good news for Carolina is that New Orleans has been miserable against teams with winning records dating back to 2021. Since the start of that season, the Saints are 6-23 in 29 games against teams that are above .500. That includes an active nine-game losing streak.Rico running wild. Since Hubbard missed time with a calf injury earlier this season, Dowdle has seized the role and put up some monster numbers. In his three games as Carolina's starting running back, Dowdle has averaged 173 yards per game and 6.7 yards per attempt while finding the end zone three times. Dowdle's three games with 130 or more rushing yards are tied for the second-most in franchise history.Saints vs. Panthers prediction, pick\nThe Panthers haven't been a favorite all season, so there's no track record there. That makes me a little nervous, but how can I possibly bank on the Saints in this spot? Shough will be making his second career start, and the offense will be worse with the loss of Shaheed. Add in the fact that Dowdle should shred the New Orleans defense, and I could see the Panthers winning this one by a touchdown. Pick: Panthers -5.5; Under 39.5\n            \n    \n\n        \n    \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Saints vs. Panthers: TV channel, live stream and preview for Week 10 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/a0283239-e8f8-4d85-a02a-4ea617e01917/thumbnail/1200x675/6da3d185b6b670d356b0b2df14acf45c/untitled-design-2025-11-07t014920-329.png"
      ],
      "datePublished": "2025-11-08T19:43:37.000Z",
      "dateModified": "2025-11-08T19:43:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]