[
  {
    "title": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/thursday-night-football-prediction-odds-line-start-time-lions-cowboys-nfl-expert-picks-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg",
    "tag": "Sports",
    "date": "2025-12-05T00:09:04.000Z",
    "description": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lio",
    "body": "\n        NFC teams coming off different results on Thanksgiving Day will meet on 'Thursday Night Football' as the Dallas Cowboys visit the Detroit Lions. Dallas (6-5-1) defeated Kansas City on Thanksgiving, 31-28, for its third straight victory. Detroit (7-5) fell to Green Bay on the holiday, 31-24, as the Lions have alternated wins and losses over their last eight games. However, the Lions won the last meeting between the teams, 47-9 in 2024, which is Dallas' largest margin of defeat since 1988. CB Trevon Diggs (knee), OL Tyler Guyton (ankle) and Jadeveon Clowney (hamstring) have been ruled for for Dallas, while Amon-Ra St. Brown (ankle) is active for Detroit.Kickoff is at 8:15 p.m. ET from Ford Field in Detroit. The Lions' victory in their 2024 matchup ended a six-game win streak by Dallas in the head-to-head series. Detroit is a 3.5-point favorite in the latest Lions vs. Cowboys odds. Meanwhile, the over/under for total points is 55.5. Detroit is at -181 on the money line (risk $181 to win $100). Before making any Cowboys vs. Lions picks, make sure to check out the 'Thursday Night Football' predictions from SportsLine NFL expert R.J. White.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:White, a Fantasy and gambling editor for CBS Sports, consistently crushes against-the-spread picks. He's SportsLine's No. 1 NFL expert this year with a 133-110 (+1724) run on all NFL picks and is an outstanding 34-22-2 (+1064) run over his last 58 NFL picks in Lions games. Anybody following his NFL betting picks at sportsbooks and on betting sites could have seen strong returns. Now, White has set his sights on Lions vs. Cowboys and just locked in his picks and predictions. You can head to SportsLine now to see his picks. Here are several NFL odds and betting lines for Cowboys vs. Lions:Lions vs. Cowboys                 spreadDetroit -3.5 at DraftKings SportsbookLions vs. Cowboys                       over/under55.5 pointsLions vs. Cowboys                       money line Detroit -181, Dallas +151Lions vs. Cowboys                   picksSee picks at SportsLineLions vs. Cowboys                       streaming Amazon PrimeWhy the Cowboys can coverDallas is 5-1 ATS as an underdog and has both won and covered in three straight games overall, including the last two coming versus last year's Super Bowl participants in the Chiefs and Eagles. Meanwhile, Detroit has lost three straight versus the spread, and it lost one of its best playmakers in Sam LaPorta (back). While Detroit still has its backfield of Jahmyr Gibbs and David Montgomery to lean on, the run defense has been the biggest improvement for Dallas recently. Since acquiring Quinnen Williams from the Jets, Dallas has allowed just 69.7 rushing yards, which is less than half of the 143 yards per game it allowed in nine games prior to his arrival. See which team to back at SportsLine. Why the Lions can coverThese teams met in October 2024 -- in Dallas -- in which the Lions' 38-point victory was their third-largest road win, ever, while the game also marked Dallas' fourth-largest home loss in franchise history. So, Detroit should feel very confident it can take care of business at home, as the Cowboys average 6.9 fewer points on the road than in Dallas. Dan Campbell also knows how to get the best out of his team after a defeat, as the Lions have remarkable resiliency in terms of spread success. Since the start of the 2023 season, the Lions are 10-1 ATS (90.9%) following a straight-up defeat, while Dallas is just 11-13 ATS (45.8%) after a win over that same time frame. See which team to back at SportsLine.New users can also check out the latest BetMGM bonus code to get up to $1,500 in bonus bets if your first bet loses:How to make Cowboys vs. Lions  picksWhite has analyzed Lions vs. Cowboys from every angle and he's leaning Over on the point total. He has also discovered a critical X-factor that has him jumping all over one side of the spread. He's only sharing what it is, and which side to back, at SportsLine.Who wins Cowboys vs. Lions, and what critical X-factor makes one side of the spread a must-back? Visit SportsLine now to see which side of the Lions vs. Cowboys spread you need to jump on, all from the expert that is 34-22-2 on his last 58 Detroit picks, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Thursday Night Football' prediction, odds: Cowboys vs. Lions picks from expert on 34-22 run - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/07/71481eef-dd1e-4288-8f7a-706d607b0e48/thumbnail/1200x675/d01b9ea0d0da1ecbc096bc456b623ca2/jared-goff-detroit-lions-imagn-images-2.jpg"
      ],
      "datePublished": "2025-12-05T00:09:04.000Z",
      "dateModified": "2025-12-05T00:09:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/nfl-dfs-cowboys-lions-daily-fantasy-picks-lineups-advice-stacks-thursday-night-football-fanduel-draftkings/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:25:39.000Z",
    "description": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys ",
    "body": "\n        Two of the top three scoring offenses will meet on 'Thursday Night Football,' providing quite the NFL DFS player pool for the Dallas Cowboys vs. Detroit Lions matchup at 8:15 p.m. ET. Detroit is a 3-point home favorite, while the over/under is 54.5, the highest on the board in Week 14. Dak Prescott, Jared Goff, Jahmyr Gibbs and CeeDee Lamb are names known to casual football fans and names very familiar with being included in NFL DFS lineups. However, Detroit could be shorthanded with Sam LaPorta on the IR and Amon-Ra St. Brown (ankle) a game-time decision after not practicing this week. George Pickens (calf/knee) doesn't carry an injury designation for TNF.Wideout Isaac TeSlaa played 92% of snaps in Detroit's last game and scored his third touchdown of the year. Daily Fantasy football lineups need economical options like TeSlaa to balance out the highly-priced stars. The Cowboys also have NFL daily Fantasy sleepers who could provide a great return on investment on TNF. Before making any Lions vs. Cowboys NFL DFS picks for 'Thursday Night Football,' be sure to check out the NFL DFS advice, strategy, and stacks from SportsLine daily Fantasy expert Mike McClure. New users can also target the latest Underdog promo code, good for $100 in bonus entries when you play $5 with the promo code CBSSPORTS2 in select states.McClure is a legendary professional DFS player with more than $2 million in career winnings. He uses a powerful prediction model that simulates every snap of NFL action, taking factors such as matchups, statistical trends, and injuries into account. This allows him to find the best DFS values that he shares only with members at SportsLine. His methodology has led to enormous cashes on FanDuel and DraftKings, including. In 2023, he finished tied for first in the DraftKings Millionaire Maker twice and the FanDuel Million once. Anyone who has followed him could be way up.Now, McClure has turned his attention to 'Thursday Night Football' and just locked in his top daily Fantasy football picks. You can only see his picks and analysis at SportsLine. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top NFL DFS picks for Cowboys vs. LionsOne of McClure's top NFL DFS picks for 'Thursday Night Football' is Cowboys receiver CeeDee Lamb. The wideout is coming off a 7-112-1 stat line on Thanksgiving versus Kansas City, with the 112 yards matching a season high. Lamb is averaging 82.7 receiving yards per game in 2025, which ranks sixth-best in the NFL, and his career high of 227 yards came versus Detroit in 2023. This year's Lions team has allowed the third-most touchdowns to opposing wideouts, and now it will be without starting cornerback, Terrion Arnold (shoulder), who was placed on injured reserve on Monday. Detroit also allowed four touchdowns to wideouts in last week's loss to Green Bay. See who else to roster at SportsLine.McClure is also rostering Lions running back Jahmyr Gibbs, who has been a one-man show over the last half-dozen games. Gibbs is averaging 152.3 scrimmage yards with eight total touchdowns over his last six contests, compared to 83.7 yards and five scores over his first six games. The two-time Pro Bowler is on pace for career highs in rushing yards, rushing average, receptions and receiving yards, with his 2025 production coming versus defenses much more stout than what Dallas possesses. The Cowboys have allowed the second-most points and the fourth-most yards this season, in addition to giving up the third-most receiving yards to running backs, which increases the value of a pass-catching RB like Gibbs. See more NFL DFS picks at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets at FanDuel if your $5 bet wins. How to set Lions vs. Cowboys NFL DFS lineupsMcClure is targeting another undervalued player who could explode for huge numbers on 'Thursday Night Football'. This pick could be the difference between winning your tournaments and cash games or going home with nothing. You can only see who it is, and the rest of McClure's NFL DFS picks, at SportsLine.So who is Mike McClure including in his optimal NFL DFS lineups for 'Thursday Night Football', and which under-the-radar player offers huge value? Visit SportsLine now to see optimal NFL DFS picks, NFL DFS rankings, NFL DFS advice and NFL DFS stacks, all from a daily Fantasy expert with more than $2 million in winnings, and find out. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL DFS picks, Cowboys vs. Lions: Daily Fantasy football lineup advice for 'Thursday Night Football' - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/09/18/e50ff8d1-ca63-4146-8b0b-260260f3e4bb/thumbnail/1200x675/977915f09b6b4f9958e6c7a6387f567b/jahmyr-gibbs-1.jpg"
      ],
      "datePublished": "2025-12-04T23:25:39.000Z",
      "dateModified": "2025-12-04T23:25:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Computer model reveals conference championship college football picks, best bets for Dec. 5 - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/2025-college-football-free-picks-betting-odds-models-best-bets-conference-championship-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/cb8ffda8-680b-4b64-9705-87c54fe01896/thumbnail/1200x675/4c9b2bf26fc7251af9f44cbac5e83c29/drew-mestemaker-north-texas.jpg",
    "tag": "Sports",
    "date": "2025-12-04T21:17:01.000Z",
    "description": "\n        Conference Championship week begins on Friday with four Group of Five contests, with at least one of these four conference champions guarante",
    "body": "\n        Conference Championship week begins on Friday with four Group of Five contests, with at least one of these four conference champions guaranteed a spot in the College Football Playoff. The current College Football Playoff rankings would indicate that team is most likely the winner of the American Athletic Championship between No. 24 North Texas and No. 20 Tulane, as the two highest-ranked teams playing on Friday from the CFP polls. North Texas is a 2.5-point favorite in the latest college football odds despite being the lower-ranked team in the CFP polls. The other Friday conference championship games feature Kennesaw State (-2.5) vs. Jacksonville State in the Conference USA Championship on CBS Sports Network at 7 p.m. ET, Troy vs. No. 25 James Madison (-23.5) in the Sun Belt, and UNLV vs. Boise State (-3.5) in the Mountain West.The SportLine Projection Model has found values in all four of these conference championship games. Rather than backing a side for the AAC Championship showdown between Tulane and North Texas, the model finds the best value in playing Over 66.5 total points scored. The model is also backing Over 58.5 points in Boise State vs. UNLV, while projecting value a pair of underdogs in Jacksonville State (+2.5) and Troy (+23.5) for Friday's conference championship best bets. Before locking in your college football picks, be sure to check out the top college football betting picks from SportsLine's advanced computer model. New users can also utilize the latest BetMGM bonus code, which gives new users up to $1,500 back in bonus bets if your first bet loses:The model simulates every FBS game 10,000 times, and it is profitable on its top-rated money-line and over/under picks since the beginning of the 2024 season. Anybody following those college football betting picks at sportsbooks and on betting sites could have seen strong returns.New users can also target the FanDuel promo code, which offers $150 in free bets if your first $5 bet wins:Friday conference championship best bets for Friday, Dec. 5 (odds subject to change): Jacksonville State (+2.5) vs. Kennesaw StateTroy (+23.5) vs. James MadisonNorth Texas vs. Tulane: Over 66.5 pointsUNLV vs. Boise State: Over 58.5 pointsCombining the model's three picks into a Friday conference championship parlay would result in a payout of +1202 (risk $100 to win $1202). Bet it now at Caesars Sportsbook: Jacksonville State (+2.5) vs. Kennesaw State (-110)Jacksonville State, the defending Conference USA champions, won this regular-season matchup, 35-26, on its home turf, which is where the Conference USA Championship Game will be played. The Gamecocks went 5-0 at home this season, and they'll have homefield advantage for the biggest game of the season. Kennesaw State went 9-3 overall and 7-1 in the conference, with its only loss coming to Jacksonville State, which also went 7-1 in Conference USA. Jacksonville State has the nation's leading rusher in Cam Cook, who has 1,588 rushing yards on 45.7 yards per carry this season. Cook rushed for 132 yards and a touchdown, and dual-threat quarterback Caden Creel threw for 137 yards and rushed for 127 yards and two touchdowns in their regular-season matchup. The model projects Jacksonville State to cover in 70% of simulations on Friday.Troy (+23.5) vs. James Madison (-105)Troy, the West Division champions, meets James Madison, the top team on the East side, in the Sun Belt Championship Game. Troy has won two of the last three Sun Belt championships, but James Madison joining the conference brings a strong, growing program into the Sun Belt Championship picture. These two teams didn't meet during the regular season, where Troy went 8-4 (6-2), and James Madison went 11-1 (8-0). Troy has only lost one game by more than 23 points this season, and it played Clemson tough in a 27-16 non-conference matchup, so it has been tested against stronger programs as well. The model projects Troy to cover in 61% of simulations.North Texas vs. Tulane: Over 66.5 points (-110)North Texas has the No. 1 scoring offense in the nation, averaging 46.4 points per game. The Mean Green are second in the nation in passing yards per game (324.5) behind freshman quarterback Drew Mestemaker. He has 3,835 passing yards with 29 touchdowns and four interceptions this season as the Mean Green have scored more than 50 points in three straight games and five of their last six contests. Meanwhile, Tulane can score as well, posting at least 26 points in five straight games. The model projects the Over to hit in 55% of simulations.UNLV vs. Boise State: Over 58.5 points (-108)These two teams went significantly Over this total during their regular-season meeting, which resulted in a 56-31 win for Boise State. They combined for 1,034 yards and 12 touchdowns, and the model expects the offenses to outshine the defenses again in the Mountain West Championship Game. Maddux Madsen threw for 253 yards and four touchdowns for Boise State, and he'll return after missing the last month with a leg injury. Dylan Riley rushed for 201 yards on 13.4 yards per rush for the Broncos in that contest. Anthony Colandrea, who has thrown for more than 3,000 yards this season, passed for 215 yards, rushed for 87 yards, and had three total touchdowns for UNLV against Boise State. The model projects the Over to hit in 63% of simulations.Want more college football picks?You've seen the model's college football best bets for Friday. Now, get against the spread, total and money line picks for every Conference Championship Game here, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Computer model reveals conference championship college football picks, best bets for Dec. 5 - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/cb8ffda8-680b-4b64-9705-87c54fe01896/thumbnail/1200x675/4c9b2bf26fc7251af9f44cbac5e83c29/drew-mestemaker-north-texas.jpg"
      ],
      "datePublished": "2025-12-04T21:17:01.000Z",
      "dateModified": "2025-12-04T21:17:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LeBron James' double-digit scoring streak ends in the most LeBron way possible - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nba/news/lakers-lebron-james-double-digit-scoring-streak-ends/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/74a2a0e7-ab6b-43bf-8f0c-00ed068c5651/thumbnail/1200x675/36de6f57f7587c24da9eb281b84080d9/untitled-design-2025-12-04t193025-564.png",
    "tag": "Sports",
    "date": "2025-12-05T03:50:48.000Z",
    "description": "\n        A baby born on the last day that LeBron James scored single-digit points in a regular season NBA game would be an adult today. It has been ne",
    "body": "\n        A baby born on the last day that LeBron James scored single-digit points in a regular season NBA game would be an adult today. It has been nearly 19 years since James was last held below 10 points in the regular season, the last such occasion coming on Jan. 5, 2007. That's a stretch of 1,297 total games. But when the final buzzer sounded between the Los Angeles Lakers and Toronto Raptors on Thursday, James had only eight points. The mythical streak had finally, amazingly, come to an end.And it ended in the most LeBron James-possible fashion. With the score tied at 120 and the final seconds ticking down, Austin Reaves, who finished the game with 44 points, tried to create an opening for a game-winner. When Scottie Barnes crept over to double Reaves, he passed it to a wide open James, who bolted into the lane. A frantic Immanuel Quickley rotated over from the corner to pick him up, which left Rui Hachimura wide open. James did what he's been doing for even longer than he's been scoring double-digit points in regular-season games: he made the right basketball play. He passed the ball to Hachimura, who drilled the game-winning 3-pointer, leaving James, who could have attempted his own game-winner to reach 10 points, stranded at eight as time expired.\nThroughout his career, James has drawn criticism for making passes just like this. In Game 1 of the 2007 Eastern Conference finals, he made a similar pass to Donyell Marshall in the final seconds, but he missed the possible game-winning 3-pointer and the Cavaliers lost by two. In Game 5 of the 2020 NBA Finals, James could have won the championship with his own final shot. He passed the ball to Danny Green instead, who also missed. His critics, many of whom love to point out how eager players like Michael Jordan and Kobe Bryant are to take game-ending shots, yelled that as the star, he should have been responsible for scoring those final, critical points.But James has never been wired like Jordan or Bryant. He always makes the right basketball play, even if that play means giving the ball to someone else. It can come in the first quarter of a random game. It can come with the title on the line. It can even cost him one of his most legendary streaks. But James is always going to make the play he believes gives his team the best chance to win. He did that on Thursday, and it paid off for the Lakers. James never doubted the process. \n\"You always make the right play,\" James explained after the game. \"That's just been my M.O. That's how I was taught the game. I've done that my whole career. There's not even one second guessing that. Once they doubled AR and the ball got swung to me, I know it's a numbers game. We've got a 4-on-3 advantage. I was just trying to put the ball on time, on target in Rui's socket, in his shot pocket, and he knocked it down.\"That attitude is going to serve the Lakers well this season. James is now 41 years old. Through his first five games this season, he was already averaging a career-low 15.2 points per game. James has tended to start seasons slowly as a Laker, but there's a pretty noticeable difference this season as he's worked his way back from sciatica. The player who is used to controlling every aspect of his team's offense is clearly struggling to get up to speed. James already had one streak scare on Monday against the Phoenix Suns. He finished the loss with exactly 10 points, and he needed 31 minutes to get them.But the Lakers don't need James scoring at the volume that he typically has. Reaves and Luka Dončić entered Thursday's game averaging a combined 63.4 points per game, the most ever by a post-merger pair of teammates. The Lakers have more than enough scoring.\nWhat they need is for James to fit in. To play hard on defense, get rebounds and make the smart pass. He did all of that on Thursday. Case in point: he may not have reached double digit points, but he got to 11 assists in a victory. That has always been his preference, and it's what's going to make him a valuable player even as age leads to inevitable decline. James isn't as fast as he used to be. He may not be able to jump as high or play quite as hard on a possession-by-possession basis. But he's a pathologically unselfish basketball genius, and that's the sort of player that every team could benefit from. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LeBron James' double-digit scoring streak ends in the most LeBron way possible - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/74a2a0e7-ab6b-43bf-8f0c-00ed068c5651/thumbnail/1200x675/36de6f57f7587c24da9eb281b84080d9/untitled-design-2025-12-04t193025-564.png"
      ],
      "datePublished": "2025-12-05T03:50:48.000Z",
      "dateModified": "2025-12-05T03:50:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kansas State hires Collin Klein as coach to succeed retiring Chris Klieman - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/kansas-state-hires-colin-klein-as-coach-program-legend-succeeds-retiring-chris-klieman/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/9b3cd37e-e451-4f1f-a28a-3a2b643054bc/thumbnail/1200x675/230aee29ae3d904281e08718705573a0/collin-klein-texas-a-m.jpg",
    "tag": "Sports",
    "date": "2025-12-05T04:11:47.000Z",
    "description": "\n        Kansas State officially hired legendary former quarterback Collin Klein as coach, the program announced Thursday. Klein, 36, had most recentl",
    "body": "\n        Kansas State officially hired legendary former quarterback Collin Klein as coach, the program announced Thursday. Klein, 36, had most recently served as Texas A&M's offensive coordinator. He succeeds Chris Klieman, who retired Wednesday, and 247Sports had reported Klein was in line to be the next head man in charge for the Wildcats.Klein will continue to coach the Aggies through the College Football Playoff.After redshirting at Kansas State in 2008, Klein played wide receiver in 2009 before converting to quarterback in 2010. He took over full-time behind center the next year, and across 2011 and 2012, he accumulated a 21-5 record, threw for 29 touchdowns, ran for 50 touchdowns and finished third in 2012 Heisman Trophy voting. The Wildcats reached as high as No. 2 in his senior season, tied for their highest ranking ever.Klein returned to Kansas State as a coach in 2014 and slowly worked his way up from low-level assistant to quarterbacks coach to co-offensive coordinator to, finally, offensive coordinator from 2022-23. Texas A&M hired him away after the 2023 season. Now, however, he returns to the place that made him a star.Klein's contract is for five years, with an average base salary of $4.3 million.Klieman, who took over for the iconic Bill Snyder in 2019 and was under contract through 2032, produced several strong seasons upon his arrival in Manhattan, including a 10-win campaign in 2022 and bowl wins in 2021, 2023 and 2024.But the Wildcats are just 6-6 this season after being ranked 17th in the AP preseason poll. They'll hope Klein -- the first Kansas State alum to be head coach since Ellis Rainsberger from 1975-77 -- can get things back on track.\nHere's more analysis from CBS Sports' Cody Nagel:He spent five seasons on Klieman's staff, including two as offensive coordinator, before departing for College Station ahead of the 2024 season. Klein's familiarity with Kansas State's roster, donors and recruiting base -- combined with his status as one of the program's most accomplished former players -- has made him the university's leading target as succession planning accelerates.As a coach, Klein quickly made his mark when he joined the staff in 2017. He served as Kansas State's offensive coordinator for two seasons in 2022-23, taking a unit that ranked outside the top 75 nationally in 2021 to top-25 rankings in multiple offensive categories before his departure. His offenses became known for efficiency and balance: total offense jumped from 362.3 yards per game in 2021 to 446.1 in 2023, scoring jumped from 27.5 to 37.8 points per game, and his final unit led the nation in red-zone touchdown conversion rate at 78.7%. The Wildcats' rushing attack also flourished, producing top-15 units nationally in yards per game, while quarterbacks posted school-record low interception percentages.After joining Texas A&M in 2024, Klein helped guide the Aggies to a 5-0 start in SEC play, marking the program's best conference start since 1998. The offense ranked second in the SEC in rushing behind a strong offensive line. Texas A&M ranks 16th nationally in scoring offense with 36.3 points per game this season. Klein is a semifinalist for the Broyles Award, given annually to the top assistant coach in college football.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kansas State hires Collin Klein as coach to succeed retiring Chris Klieman - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/9b3cd37e-e451-4f1f-a28a-3a2b643054bc/thumbnail/1200x675/230aee29ae3d904281e08718705573a0/collin-klein-texas-a-m.jpg"
      ],
      "datePublished": "2025-12-05T04:11:47.000Z",
      "dateModified": "2025-12-05T04:11:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn State targets Matt Campbell as Nittany Lions look to poach Iowa State coach - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-matt-campbell-head-coach-iowa-state/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/05/2abfafd1-c23b-4257-9886-9c5705d612ad/thumbnail/1200x675/33a8d8b041a3e451f7ebc9b0284415f0/gettyimages-2188732340-1.jpg",
    "tag": "Sports",
    "date": "2025-12-05T03:41:11.000Z",
    "description": "\n        After whiffing on numerous candidates, Penn State has turned the focus of its long, winding coaching search to a prominent name in the Big 12",
    "body": "\n        After whiffing on numerous candidates, Penn State has turned the focus of its long, winding coaching search to a prominent name in the Big 12. The Nittany Lions are now targeting Iowa State's Matt Campbell, sources confirmed to CBS Sports' Matt Zenitz. The two sides had talks on Thursday. Campbell has achieved unprecedented success, posting a 72-55 record throughout a decade-long tenure at Iowa State and has been tied to various coaching searches across the Big Ten on numerous occasions. Each time his name popped up as a candidate for a premier job, though, Campbell elected to remain with the Cyclones. Prior to his stint at Iowa State, Campbell made a name for himself as a head coach by going 35-15 across five seasons leading Toledo in the MAC. While it has taken a while for Campbell to emerge as a Penn State target, his track record of maximizing his program's potential indicates he could thrive with the Nittany Lions. Campbell inherited a perennial middling operation when he took the Iowa State job in 2016, and he quickly turned his program into one of the Big 12's most consistent winners. After a three-win debut, the Cyclones posted just one losing season from 2017 onward. They racked up five consecutive bowl appearances for the first time in school history and reached their first conference championship game in an 11-win 2024 campaign.\n        \n            \n                Kalani Sitake sends Penn State coaching search back to drawing board again as eight targets spurn interest\n                \n                    Robby Kalland                \n            \n                            \n    \n                \n                    \n    \nShould Penn State close the deal with Campbell, it would bring a splendid conclusion to a coaching search that turned sour as candidate after candidate brushed off interest in the Penn State job. Eight presumptive candidates locked up contract extensions or engaged in such conversations with their current schools instead of taking the position. On Thursday, Alabama's Kalen DeBoer became the latest to deny ties to the Nittany Lions.\nThis prolonged search has had major ramifications on the program's immediate outlook. Penn State inked just two recruits on Signing Day after losing countless commits, many of whom followed Franklin to Virginia Tech. Reconstructing the recruiting class and attacking the transfer portal when it opens Jan. 2 would be among Campbell's most pressing tasks upon his arrival.Could Campbell deliver Penn State's elusive next step?For all of the much-deserved praise Franklin received for rebuilding Penn State into a Big Ten title contender, the frustration of consistently falling short of championships did not sit well with the Nittany Lions faithful. The program remains in search of its first national championship since 1986, and it achieved Big Ten supremacy just once in Franklin's 12 years at the helm.For a potential Campbell tenure to be considered a success, not only would Penn State need to consistently advance deep into the College Football Playoff and win the occasional conference crown, but it would also need to fare better against premier competition than it did over the last decade. The Nittany Lions went just 4-21 against AP top-10 teams under Franklin's watch and just 2-21 against teams in the top six.\nThe floor is incredibly high at Penn State. Campbell would be tasked with raising the ceiling. Anything less than a breakthrough would make the Franklin firing appear as a waste of a coaching change.Campbell does more with lessOne sign of a prolific coach is the consistent exceeding of expectations. By that measure, Campbell is a star in the industry. Iowa State had not cracked the AP Top 25 in a decade when Campbell arrived, and he led the Cyclones to rankings in all but three of his seasons -- three times reaching the top 10. The program also only had 12 bowl appearances in its history prior to his tenure, and he made seven postseason trips.Not only has Campbell overseen the greatest period of Iowa State football to date, but he also did so with a modest amount of talent. Never in his tenure did the Cyclones secure a recruiting class better than No. 39 in the 247Sports team rankings, and more often than not, the program signed classes ranked near the bottom of the Power Four. Campbell's player development acumen and in-game abilities helped him overcome the talent gap.\nOf course, the expectation at Penn State is to recruit at a high level, so Campbell would have to prove more capable of attracting blue-chip prospects to the program than he has been at Iowa State.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State targets Matt Campbell as Nittany Lions look to poach Iowa State coach - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/05/2abfafd1-c23b-4257-9886-9c5705d612ad/thumbnail/1200x675/33a8d8b041a3e451f7ebc9b0284415f0/gettyimages-2188732340-1.jpg"
      ],
      "datePublished": "2025-12-05T03:41:11.000Z",
      "dateModified": "2025-12-05T03:41:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penn State coaching search: Micah Parsons backs Terry Smith for full-time job - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/penn-state-coaching-search-micah-parsons-terry-smith/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/221ab564-a8d8-4d8e-82b6-570e5fe14266/thumbnail/1200x675/64761f340ccc4b84019245c4b3fc81d8/micah-parsons-packers.jpg",
    "tag": "Sports",
    "date": "2025-12-04T21:02:59.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Penn State's coaching search continues, one of ",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        As Penn State's coaching search continues, one of the Nittany Lions' best former players made his voice heard. Packers star edge defender Micah Parsons said Penn State should elevate Terry Smith, who served as the team's interim coach after the program fired James Franklin.Parsons, 26, said his relationship with Smith goes back to when he was 14 years old. Parsons starred at Penn State from 2018-19, recording five sacks and 14 tackles for loss as a sophomore in 2019. He opted out of the 2020 COVID-impacted season before going 12th overall to the Cowboys in 2021 NFL Draft.\nSmith played wide receiver at Penn State from 1987-91 and has been on Penn State coaching staff since 2014, working his way up from cornerbacks coach to associate head coach to, after six games this season, interim head coach. The Nittany Lions went 3-3 under Smith, winning each of their final three games to finish the regular season 6-6. The team awaits its bowl fate, though Smith has not been informed of his future.The on-field product took a back seat to a coaching search gone awry. Louisville's Jeff Brohm and BYU's Kalani Sitake are the latest coaches who signed extensions after being linked to the Nittany Lions' opening. Sitake, in particular, seemed close to heading to Happy Valley before a full-scale effort from the Cougars and their donors kept him at his alma mater.\nOverall, eight coaches who had been potentially tied to Penn State's opening received new contracts from their current team.CoachSchoolContract extensionCurt CignettiIndiana8 years, $93 millionMatt RhuleNebraska2 years, $25 millionMike ElkoTexas A&M6 years, $66+ millionEli DrinkwitzMissouri6 years, $64.5 millionClark LeaVanderbilt6 years, UnknownKalani SitakeBYUUnknownBrent KeyGeorgia Tech5 years, $32.5 millionJeff BrohmLouisvilleUnknown\n            \n    ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penn State coaching search: Micah Parsons backs Terry Smith for full-time job - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/221ab564-a8d8-4d8e-82b6-570e5fe14266/thumbnail/1200x675/64761f340ccc4b84019245c4b3fc81d8/micah-parsons-packers.jpg"
      ],
      "datePublished": "2025-12-04T21:02:59.000Z",
      "dateModified": "2025-12-04T21:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NFL picks: How Bears vs. Packers Week 14 impacts NFC North race, playoff picture - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/nfl-predictions-how-bears-vs-packers-week-14-showdown-shapes-the-nfc-north-playoff-picture/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/24/6ec84a2d-326a-4fb7-952d-e05f3e71e905/thumbnail/1200x675/2c89ea8b674faa917ae1349850ff07e9/caleb-williams-2.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:59:59.000Z",
    "description": "\nThe Chicago Bears were expected to show improvement from last season under first-year head coach Ben Johnson, but beating out the two-time defending ",
    "body": "\nThe Chicago Bears were expected to show improvement from last season under first-year head coach Ben Johnson, but beating out the two-time defending division champions Detroit Lions, Green Bay Packers and Minnesota Vikings for the NFC North title wasn't really on anyone's bingo card. After all, Chicago went 5-12 in 2024 while each of its three division rivals posted at least 11 victories en route to postseason appearances.Johnson's squad opened the 2025 NFL season with back-to-back losses to Minnesota and Detroit, leaving many to believe it would be another lost year in the Windy City. But the Bears (9-3) won nine of their next 10 games, including each of the last five, and enter their Week 14 showdown with the Packers at Lambeau Field atop the NFC North - a half game ahead of Green Bay (8-3-1) and two in front of Detroit (7-5).While many of Chicago's victories came against opponents with sub-.500 records, the club rallied past the Pittsburgh Steelers 31-28 in Week 12 and put on an impressive performance in its 24-15 triumph over the defending Super Bowl champions Philadelphia Eagles in the City of Brotherly Love last week. The Bears never trailed in the contest as their second-ranked ground attack racked up 281 yards, with Kyle Monangai gaining 130 and D'Andre Swift recording 125 against his former team to give Chicago two 100-yard rushers in a game for the first time since Walter Payton (107) and Matt Suey (102) ran wild on Nov. 10, 1985 versus the Lions.Chicago now faces a Green Bay squad that is eighth in the NFL against the run (98.3 yards allowed) and fourth in the league in total defense (284.8). The Bears are sixth in total offense (374.3 yards) and eighth in scoring (26.1 points), but the Packers allow the sixth-fewest points per game (18.8).Green Bay also is on a roll as it has followed back-to-back losses to the Carolina Panthers and Eagles with three consecutive victories, including last week's 31-24 triumph at Detroit. Jordan Love threw for 234 yards and four touchdowns - including a pair to Dontayvion Wicks, who is listed as questionable for Sunday's matchup due to an ankle injury.Love is 10th in the NFL with 2,794 passing yards and tied for seventh with 19 TD tosses while throwing only three interceptions and has gone four straight games without being picked off. The 27-year-old may have another wideout to target this week as Jayden Reed, who has been sidelined since Week 2 due to foot and shoulder injuries, could return to action. \nReed woud be a welcome addition to a Packers offense that could be without both Wicks and running back Josh Jacobs. The NFL's leading rusher in 2022 while with the Las Vegas Raiders, Jacobs also is questionable for Week 14 with a knee injury.The Bears are not without question marks on offense as the status of both Monangai (ankle) and receiver Rome Odunze (foot) for the divisional showdown is up in the air. The 23-year-old Odunze leads Chicago in catches (44), receiving yards (661) and touchdown receptions (six).Green Bay's defense is led by Micah Parsons, who is third in the NFL with 12.5 sacks. Acquired from the Dallas Cowboys in August, the 26-year-old defensive end has recorded six sacks over his last three games and is 1.5 away from matching the career high he set in 2023.Love's ability to avoid interceptions will be tested as the Bears lead the league with 17 and also are first with a plus-17 turnover differential. Safety Kevin Byard III tops the NFL with six interceptions after recording two in 33 games over the previous two seasons and cornerback Nahshon Wright, who had one pick in 32 contests over his first three NFL campaigns with Dallas, is tied for second with five.Even though it is a half game behind Chicago, SportsLine's Inside the Lines team and its projection model currently like Green Bay's chances of winning the NFC North. But the ITL team's model, which simulates every NFL game 10,000 times, feels a Bears win in Week 14 will make their outlook for the division title better than the Packers'.A victory would give Green Bay almost a 67% chance to win their first NFC North crown since 2021 and reduce Chicago's odds to 27%. Should the Bears triumph, their prospects would be better than 69% and the Packers' chances would drop to just over 22%.CHANCES OF WINNING NFC NORTHTEAMCURRENTWITH WEEK 14 WINWITH WEEK 14 LOSSDIFFERENCEChicago Bears40.5%69.6%27.0%42.6%Green Bay Packers52.7%66.8%22.1%44.7%Making the playoffs is almost a certainty for both the Bears and Packers, according to the model. Each team enters their matchup with a better than 81% chance of reaching the postseason, and a loss would reduce their prospects to no lower than 76%.CHANCES OF MAKING PLAYOFFSTEAMCURRENTWITH WEEK 14 WINWITH WEEK 14 LOSSDIFFERENCEChicago Bears81.8%93.9%76.3%17.6%Green Bay Packers90.0%95.7%78.1%17.6%Green Bay is a 6.5-point favorite against Chicago in the latest NFL odds. The NFC North rivals split their two meetings last year, with each winning on the road. The Bears' 24-22 triumph at Lambeau Field in the 2024 regular-season finale ended its 11-game losing streak against the Packers, who have won 28 of the last 32 clashes and are 107-95-6 in the all-time series.The model believes Sunday's showdown will be decided by one score. However, it feels Green Bay will cover the spread as it is predicting a 28-20 victory by the Packers.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL picks: How Bears vs. Packers Week 14 impacts NFC North race, playoff picture - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/24/6ec84a2d-326a-4fb7-952d-e05f3e71e905/thumbnail/1200x675/2c89ea8b674faa917ae1349850ff07e9/caleb-williams-2.jpg"
      ],
      "datePublished": "2025-12-04T20:59:59.000Z",
      "dateModified": "2025-12-04T20:59:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Madison vs. Troy prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/james-madison-troy-prediction-pick-odds-spread-where-to-watch-live-sun-belt-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/d9ff8c66-3adb-4d7c-999c-b119e366349b/thumbnail/1200x675/3c3b8bd04a6b1e0d02e925c2f7bcdac9/jmu-football-james-madison-alonza-barnett.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:52:16.000Z",
    "description": "\n        Don't overlook the Sun Belt Championship Game and the impact it could have on the College Football Playoff. No. 25 James Madison and Troy mee",
    "body": "\n        Don't overlook the Sun Belt Championship Game and the impact it could have on the College Football Playoff. No. 25 James Madison and Troy meet Friday night at Showker Field at Bridgeforth Stadium, in Harrisonburg, Virginia, with more than a conference crown on the line -- a victory for the Dukes could put them in position for an automatic CFP bid, depending on what happens Saturday in the ACC title game. For the Group of Six, this is a rare opportunity to get two teams into the 12-team playoff field.Then there's the added subplot for James Madison: coach Bob Chesney is set to take over at UCLA, sources confirmed to CBS Sports. While the timing of the move could be a distraction, Chesney's focus remains on guiding the Dukes toward their first conference championship since joining the FBS in 2022.Winners of the Sun Belt East Division, James Madison enters the title game 11-1, with its only loss coming at Louisville. Troy, meanwhile, finished 8-4 and captured the Sun Belt West Division, returning to the conference title game for the third time in four years. The Trojans won back-to-back Sun Belt championships in 2022 and 2023, giving them experience on the big stage.  James Madison vs. Troy: Need to know  CFP implications: This isn't a simple win-and-in scenario for James Madison. If Virginia defeats Duke in the ACC Championship Game, the Dukes won't make the playoff. And even if Duke pulls off the upset, there's no guarantee the selection committee won't still favor a five-loss ACC champion over what could be a 12-1 Sun Belt champion. The major knock on James Madison is its weak strength of schedule -- currently well outside the top 100 in the FBS -- which makes it harder for the committee to justify a spot over a Power Four champion with a tougher path.Matchup to watch: Troy's veteran linebacker Jordan Stringer (104 tackles, 11 for loss, 2.0 sacks) ranks 27th nationally in total stops and faces arguably the toughest test of his career against James Madison's dual-threat quarterback Alonza Barnett III (2,440 yards passing, 20 touchdowns; 459 yards rushing, 13 touchdowns) and 1,000-yard rusher Wayne Knight (1,051 rush yds, 8 touchdowns). Stringer will be in the middle of everything as Troy's defense -- 89th nationally at 4.46 yards allowed per rush -- tries to slow down a James Madison ground attack that ranks 15th in the FBS at 5.40 yards per carry.\nBalanced dominance: James Madison is one of four FBS teams that rank inside the top 10 nationally in both scoring offense and scoring defense. The Dukes average 37.8 points per game on offense and allow just 16.0 points per game on defense -- both 10th in the country. That balance has led to a dominant overall performance, ranking sixth in both point margin (+227) and spending the least amount of time trailing opponents all season (1:27:29).  Where to watch James Madison vs. Troy liveDate: Friday, Dec. 5 | Time: 7 p.m. ET  Location: Showker Field at Bridgeforth Stadium -- Harrisonburg, Virginia  TV: ESPN | Live stream: Fubo (Try for free)James Madison vs. Troy prediction, picks  James Madison won't be letting its foot off the gas in this one as it goes for style points to try and impress the selection committee just in case its path to the CFP opens up. The Dukes are a massive favorite over Troy, but they've blown the doors off essentially every Sun Belt opponent this season by an average of 27.38 points per game -- second-most by any FBS team in conference play. Coaching move distractions aside, James Madison should roll to its first Sun Belt title. Pick: James Madison -23.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            JMU -23.5\n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Troy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Troy\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            James Madison\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Madison vs. Troy prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/d9ff8c66-3adb-4d7c-999c-b119e366349b/thumbnail/1200x675/3c3b8bd04a6b1e0d02e925c2f7bcdac9/jmu-football-james-madison-alonza-barnett.jpg"
      ],
      "datePublished": "2025-12-04T20:52:16.000Z",
      "dateModified": "2025-12-04T20:52:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami (OH) vs. Western Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/miami-oh-western-michigan-prediction-pick-odds-spread-where-to-watch-live-mac-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/02/eeeb22b8-4dfc-46b1-804a-88d9de9eb036/thumbnail/1200x675/010cf482236c9bae7059e041e9e3e883/adobe-express-file-2025-12-02t125423-932.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:48:20.000Z",
    "description": "\n        Miami (Ohio) and Western Michigan are set to meet for the second time this season in Saturday afternoon's MAC Championship Game. The RedHawks",
    "body": "\n        Miami (Ohio) and Western Michigan are set to meet for the second time this season in Saturday afternoon's MAC Championship Game. The RedHawks won the first matchup 26-17 on Oct. 25, improving their all-time edge in the series to 39-24-1 across 64 meetings. The MAC title game is familiar territory for Miami. This marks the RedHawks' third straight appearance, after losing to Ohio in 2024 and beating Toledo in 2023. They're the first MAC program to reach three consecutive championship games since Northern Illinois made five straight from 2010-15. Miami's four MAC Championship Game wins are tied for the second most in league history. Western Michigan, meanwhile, is chasing the fourth MAC title in program history and its first since 2016, which was also the Broncos' most recent trip to the conference championship. They enter as one of the league's hottest teams after winning four straight to surge into the postseason and finish with a MAC-best 7-1 conference record, tied for the second-most league wins in program history.  Miami (OH) vs. Western Michigan: Need to know What's going on with Miami's quarterbacks? Miami ran into a bind in November when starting quarterback DeQuann Finn left the program following a loss to Toledo, his former school. Finn did not play against the Rockets due to illness. The RedHawks initially turned to Henry Hesson, but he threw three interceptions against Toledo and was benched in Week 13 against Buffalo in favor of Thomas Gotkowski. Gotkowski led Miami to a win over Buffalo and closed the regular season with 226 yards and three touchdowns passing in a 21-point triumph over Ball State. Star pass rushers on display: Both Western Michigan and Miami (OH) feature standout edge rushers. Broncos defensive end Nadame Tucker leads the MAC and is tied for second nationally with 12 sacks, the most by a WMU player since Ameer Ismail in 2006. He has also forced four fumbles and recorded 18.5 tackles for loss. Miami (OH) defensive lineman Adam Trick has 63 pressures, tied for second-most among FBS defenders, and 8.5 sacks, not far behind Tucker. \nWMU quarterback Broc Lowry a versatile threat: Western Michigan quarterback Broc Lowry has been one of the MAC's most dynamic playmakers this season. He has 1,572 passing yards, 875 rushing yards, and 21 total touchdowns, making him one of just four FBS quarterbacks with at least 1,500 passing yards and 800 rushing yards this season. His 875 rushing yards rank fifth in the conference.  Where to watch Miami (OH) vs. Western Michigan live Date: Saturday, Dec. 6 | Time: 12 p.m. ET Location: Ford Field -- Detroit, Michigan TV: ESPN | Stream: Fubo (Try for free)    Miami (OH) vs. Western Michigan prediction, pick  \nThis is a different Miami (OH) team than the one that beat Western Michigan in the regular season. The RedHawks have looked a lot different without Finn. These two teams are also headed in entirely different directions. WMU won four in a row following its loss to Miami, while Miami is 2-2 over the last month -- including that 21-point loss to Toledo. Momentum will carry the Broncos to a bit of revenge. Prediction: Western Michigan -1.5 (-118) \n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            WMU -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Miami-OH\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            W. Michigan\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami (OH) vs. Western Michigan prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/02/eeeb22b8-4dfc-46b1-804a-88d9de9eb036/thumbnail/1200x675/010cf482236c9bae7059e041e9e3e883/adobe-express-file-2025-12-02t125423-932.jpg"
      ],
      "datePublished": "2025-12-04T20:48:20.000Z",
      "dateModified": "2025-12-04T20:48:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Texas Tech vs. BYU prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/texas-tech-byu-prediction-pick-odds-spread-where-to-watch-live-big-12-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/03/1c11cea6-d0fc-4b7a-ad25-616e9d751093/thumbnail/1200x675/d3b57d43ca15b4d6f41c50eb55f95d82/texas-tech-vs-byu.jpg",
    "tag": "Sports",
    "date": "2025-12-04T20:49:18.000Z",
    "description": "\n        No. 4 Texas Tech and No. 11 BYU meet Saturday in the Big 12 Championship Game at AT&T Stadium in Arlington, Texas. The matchup is the first a",
    "body": "\n        No. 4 Texas Tech and No. 11 BYU meet Saturday in the Big 12 Championship Game at AT&T Stadium in Arlington, Texas. The matchup is the first appearance for both teams in the Big 12 title game, and neither has won a major conference title since the Big 12 was formed in 1996. The Red Raiders are in the midst of perhaps the greatest season in program history, and have virtually clinched their spot in the College Football Playoff. BYU needs a little more help after coming into the weekend as the projected first team out. To comfortably make the field for the first time, the Cougars likely have to win and earn the Big 12's automatic spot. The title game is a rematch, which played on Nov. 8 in Lubbock. The Red Raiders ran away with a 29-7 victory over the Cougars, the only loss by BYU this season. Running back Cameron Dickey rushed for 121 yards and a touchdown to lead the way.   Texas Tech vs. BYU: Need to know  Stunning defense: Texas Tech rates near the top of every Big 12 category, but the defense is one for the ages. Linebacker Jacob Rodriguez and edge rusher David Bailey both rank near the top of national defensive player of the year lists as the Red Raiders lead the nation in rushing defense. Rodriguez specifically has been ultra productive, leading the nation with seven forced fumbles and adding four interceptions. Dynamic rusher: BYU running back LJ Martin was a breakout candidate heading into 2025, but his rise has been off the charts. The junior from El Paso has rushed for 1,229 yards and 11 touchdowns on 5.7 yards per carry. In a 26-14 win against Cincinnati, Martin broke off 222 yards and two touchdowns. He struggled with injuries during the first matchup against Texas Tech, but is a major factor if fully healthy. \nImportant showcase: The College Football Playoff Committee has often cited BYU's loss to Texas Tech as a primary reason that the Cougars are sitting outside of the CFP. The Red Raiders were dominant in victory, holding BYU scoreless until late in the fourth quarter. BYU has the opportunity to make things right with a strong performance against Texas Tech. It's vital they rectify that performance.   Where to watch Texas Tech vs. BYU live  Date: Saturday, Dec. 6 | Time: 12 p.m. ET  Location: AT&T Stadium -- Arlington, Texas  TV: ABC | Live stream: Fubo (Try for free)  Texas Tech vs. BYU prediction, picks  \nBYU played it safe during its first road trip to Lubbock. The Cougars didn't throw much until they trailed big, and didn't have a healthy LJ Martin. This time, expect plenty more motion and downfield passing after reviewing a full game of tape. However, it won't be enough. Texas Tech is the class of the Big 12 -- and maybe college football. They'll pull away in the fourth quarter for their first ever Big 12 title. Pick: Texas Tech -13.5\n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            Tech -12.5\n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            BYU\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Texas Tech vs. BYU prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/03/1c11cea6-d0fc-4b7a-ad25-616e9d751093/thumbnail/1200x675/d3b57d43ca15b4d6f41c50eb55f95d82/texas-tech-vs-byu.jpg"
      ],
      "datePublished": "2025-12-04T20:49:18.000Z",
      "dateModified": "2025-12-04T20:49:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kennesaw State vs. Jacksonville State prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/kennesaw-state-jacksonville-state-prediction-pick-odds-spread-where-to-watch-live-cusa-championship-game/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/01/cba7b5d3-44e7-4644-a6b3-9462a06f4cbe/thumbnail/1200x675/3e07c4ca814f25181c1042e882296aea/untitled-design-107.png",
    "tag": "Sports",
    "date": "2025-12-04T20:51:58.000Z",
    "description": "\n        The first conference title game of the 2025 college football season features Kennesaw State and Jacksonville State squaring off for the Confe",
    "body": "\n        The first conference title game of the 2025 college football season features Kennesaw State and Jacksonville State squaring off for the Conference USA crown. It's a rematch of last month's meeting, which Jacksonville State won 35-26.In Year 2 as an FBS member, Kennesaw State will be playing for its first CUSA title. The Owls finished the 2024 campaign at 2-10 and have staged a remarkable turnaround under first-year coach Jerry Mack. They enter the game 9-3 and went 7-1 in conference play.Jacksonville State also finished 7-1 in league play and will host the title game. The Gamecocks are seeking their second straight CUSA championship after beating Western Kentucky 52-12 in last year's title game. With a win over Kennesaw State, Jacksonville State would become the fourth program to claim back-to-back CUSA crowns. Kennesaw State vs. Jacksonville State: Need to know Homefield advantage for Jacksonville State: The Gamecocks have won 11 straight at home, with their last loss at AmFirst Stadium coming against Coastal Carolina in the 2024 season opener. This season's 5-0 home record includes their win over Kennesaw State. This will be the seventh all-time meeting between the programs, and the stakes have never been higher.Kennesaw State's turnaround: No FBS program has made a bigger leap in 2025 than Kennesaw State. The Owls improved their win total by seven and are on the verge of claiming a conference title in just their second season at the FBS level. They can become only the second program to win a league championship game in Year 2 after reclassifying from FCS -- joining Jacksonville State, which did it last year.\nCam Cook is the X-factor: Jacksonville State's star running back could determine this game. Cook enters averaging 131.8 rushing yards per game, the top mark in the FBS. He's totaled 1,581 yards, has topped 100 yards in seven straight games and has 10 100-yard performances overall — the most in the country. He ran for 132 yards and a touchdown in the first meeting with Kennesaw State. Where to watch Kennesaw State vs. Jacksonville State live Date: Friday, Dec. 5 | Time: 7 p.m. ET Location: AmFirst Stadium -- Jacksonville, Alabama TV: CBS Sports Network | Stream: Fubo (Try for free)  Kennesaw State vs. Jacksonville State prediction, pick  \nIt's hard to beat a team twice in the same season, but Jacksonville State is capable of doing just that. The Gamecocks have home-field advantage and a strong run game that should help them control this one. My prediction is Jacksonville State wins the CUSA title game behind a big night on the ground from Cook. PICK: Jacksonville State -1.5 \n\n                    \n    \n                                            \n                    \n                                    Tom Fornelli\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chip Patterson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brandon Marcello\n                            \n            \n                    \n    \n                                            \n                    \n                                    John Talty\n                            \n            \n                    \n    \n                                            \n                    \n                                    Richard Johnson\n                            \n            \n                    \n    \n                                            \n                    \n                                    Shehan Jeyarajah\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Brad Crawford\n                            \n            \n                    \n    \n                                            \n                    \n                                    Chris Hummer\n                            \n            KENN -2.5\n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    SU\n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Jacksonville St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kennesaw St.\n                    \n    \n    Who will win and cover in each conference championship game? Legendary Vegas expert Bruce Marshall is on a 43-36 roll on college football picks. Visit SportsLine now to see all his college football picks.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kennesaw State vs. Jacksonville State prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/01/cba7b5d3-44e7-4644-a6b3-9462a06f4cbe/thumbnail/1200x675/3e07c4ca814f25181c1042e882296aea/untitled-design-107.png"
      ],
      "datePublished": "2025-12-04T20:51:58.000Z",
      "dateModified": "2025-12-04T20:51:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where to watch Cowboys vs. Lions: Live stream, kickoff time, TV channel, pick - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-vs-lions-where-to-watch-pick-odds-prediction-tnf-week-14/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/12/04/e1559539-9a88-431d-9b19-620ebb300f9c/thumbnail/1200x675/9d57884d824baaf3c6f6dd1fc2444006/prescott-goff.jpg",
    "tag": "Sports",
    "date": "2025-12-04T22:00:44.000Z",
    "description": "\n        FRISCO, Texas -- The official start of the 2025 NFL postseason is still about a month away, but for the Dallas Cowboys (6-5-1) and Detroit Li",
    "body": "\n        FRISCO, Texas -- The official start of the 2025 NFL postseason is still about a month away, but for the Dallas Cowboys (6-5-1) and Detroit Lions (7-5), it's pedal to the metal right now. With both teams sitting just outside the NFC playoff picture as the eight (Lions) and nine (Cowboys) seeds, they know it's essentially do or die on \"Thursday Night Football.\"Even Dallas quarterback Dak Prescott has begun to peek at the playoff standings, something he usually refrains from doing.Bet Lions vs. Cowboys at Bet365 Sportsbook, where new users get $150 in bonus bets using the bonus code CBSBET365:\"I did the other day. It was just more -- I wouldn't say by accident, but I was just watching TV, right? It came up there showing the AFC, so I'm thinking, 'What's the NFC look like?' I went and checked it out,\" Prescott said Monday. \"And I guess nothing different than what I've said, right? It's about us controlling what we control, winning the games in front of us. I don't think we're in a position where we can truly count wins and losses from other teams. I think if we just win and handle our business, we'll put ourselves in a great spot.\"\nSo what does controlling what they can control mean to Prescott? The need to win out with no margin for error.\"I said it three weeks ago, just being honest with you, and nothing's changed,\" Prescott said of Dallas' season being in a place where it's win or bust. \"As I said then, and we say it now, you can't even think of it as one game at a time. We just have to do our absolute best every day and take advantage of it. Be good with the results we go out there and put.\"Despite being on a three-game winning streak that includes wins over the last two Super Bowl champions -- the Philadelphia Eagles and Kansas City Chiefs, the Super Bowl LIX participants -- the Cowboys are still walking a tightrope in terms of their playoff chances. The same goes for the Lions, a team that has alternated wins and losses across their last eight games. \nCBS Sports' SportsLine model puts both squads at nearly a 50% chance to reach the postseason with a victory Thursday night in Detroit, while the loser's playoff hopes will be all but cooked.Playoff chances by Week 14 resultCowboysLionsWin 42%53%Loss10%19%Here's everything you need to know to catch the Cowboys-Lions showdown, including key matchups and our prediction:Where to watch Cowboys vs. LionsDate: Thursday, Dec. 4 | Time: 8:15 p.m. ETLocation: Ford Field (Detroit)Stream: Amazon PrimeFollow: CBS Sports AppOdds: Lions -3, O/U 54.5 (via DraftKings Sportsbook)Bet Cowboys vs. Lions and other NFL Week 14 games at DraftKings Sportsbook, where new users get $200 in bonus bets if their first bet of at least $5 wins.Cowboys vs. Lions: Need to knowCowboys' George Pickens nearly unstoppable on slants\nExplosive Dallas wide receiver George Pickens is having a season for the ages in Year 1 as a Cowboy. His 1,142 receiving yards rank second in the league, and with just 39 yards on Thursday, he'll break Dallas' all-time record for the most receiving yards in a player's first season with the Cowboys. Pro Football Hall of Famer Terrell Owens currently holds that mark with 1,180 yards back in 2006.Why has Pickens been so successful playing alongside Prescott and All-Pro wide receiver CeeDee Lamb? For one, he's been the most elusive player in the NFL after the catch: Pickens' 19 forced missed tackles are the most in the league, according to Pro Football Focus. He's also been dominant over the middle, with the second most catches (33) and receiving yards (576) on in-breaking routes in 2025. Only the NFL's overall receiving yards leader, the Seahawks' Jaxon Smith-Njigba (1,336), has been better on those routes with 36 catches for 586 yards.\"Just certain leverage, just getting open. I've kind of beat both of them [inside or outside leverage], so like sometimes I don't even have the leverage. I still catch it. I feel like a slant is not too much. It's a short route, so everything is just pretty much me. If he guards me and I make a contestant catch, or I just cook him off the line,\" Pickens said Monday. \"I got just a quick twitch. Whether he's inside, I can do a certain move to make him get outside. If he's outside, I can leave him there. It's a lot of stuff.\"\n        \n            \n                Early predictions for top 2026 NFL free agents: Potential landing spots for Aaron Rodgers, George Pickens\n                \n                    Cody Benjamin                \n            \n                            \n    \n                \n                    \n    \nIn Pickens' mind, there's nothing a defender can do to slow him down when he wants to get open on a slant. Should a cornerback play tight, press man coverage, he's more than happy to run a vertical, deep route -- a \"go ball.\" Pickens' 15.6 yards per reception this season is the sixth-best in the league, and only Smith-Njigba (21) has more catches of 20-plus yards than his 18.In Pickens' mind, there's nothing a defender can do to slow him down when he wants to get open on a slant. Should an opposing cornerback play tight, press man coverage, he's more than happy to run a vertical, deep route aka a \"go ball.\" Pickens' 15.6 yards per reception this season is the sixth-best in the league, and only Smith-Njigba (21) has more catches for 20-plus yards than his 18. \"It's kind of inevitable. It's going to happen regardless. Because I can beat it against two-man, man, three, four. It's a window thing. … There's nothing they can do to win,\" Pickens said Monday. \"I got the go ball. I got the stop route, slant. Now they're kind of focusing on the slant, and I still got the go ball. There's a lot of stuff.\"\nThe Steelers utilized Pickens as a pure deep threat in his last two seasons there (2023 and 2024) before he was traded to Dallas. Here's his route heat map from TruMedia, with the brightest yellow areas along the sidelines.\n                                                                    TruMedia\n                                                            However, as a Cowboy this season, Dallas has added more variety to his route tree, using him much more over the middle of the field while still giving him deep-shot opportunities with Prescott. Pickens said that variance is one of the biggest reasons for his breakout this season.\"It's been great. That's one of the things that I'm glad you talk about because that's one of the things that I remember me saying earlier in the year,\" Pickens said. \"That if you see me with a more versatile route tree, then you can kind of see what I can do.\"\n\n                                                                    TruMedia\n                                                            \nWhat will Amon-Ra St. Brown's impact be? Detroit may or may not have the services of their No. 1, All-Pro wide receiver Amon-Ra St. Brown on Thursday night. He suffered a low ankle sprain on Thanksgiving against the Packers that knocked him out of that game and has him officially listed as questionable for Week 14. His presence -- or absence -- will be a major factor for the Lions. St. Brown's 505 career receptions have him just six catches away from breaking Michael Thomas' record (510) for the most through five seasons in NFL history. Detroit also ranks first in the NFL in yards per play (6.1) across the last five seasons with St. Brown on the field; without him, that figure drops to 25th (5.0).\nIf he's not out there, the Lions will be in uncharted territory without both St. Brown and Pro Bowl tight end Sam LaPorta, who is currently on injured reserve with a back injury. Detroit has played just 5% of its offensive snaps since drafting LaPorta in 2023 without both him and St. Brown on the field. Four offensive line starters -- All-Pro right tackle Penei Sewell (shoulder), Pro Bowl left tackle Taylor Decker (shoulder/rest), center Graham Glasgow (knee) and left guard Kayode Awosika (foot) -- are also questionable.\nLions NFL ranks with Amon-Ra St. Brown on/off field (since 2021)OnOffOffensive efficiency 2nd16thYards per play1st25thCan Cowboys' new-look defense contain Jahmyr Gibbs and Co.?\nThe Cowboys' defense transformed from one of the worst in football through the first nine weeks of the season to one of the NFL's best at stopping the run and rushing the passer -- all while becoming a league-average scoring defense. The trade-deadline acquisition of Jets All-Pro defensive tackle Quinnen Williams has been transformative. His 21 quarterback pressures are the third most in the league since he made his Dallas debut in Week 11, and they're already more than the 19 he had in eight games as a Jet this season.\"Yeah, it's really everybody. Everybody's all 11, all together all the time. That's been the biggest improvement, but when you add a very talented All-Pro player in the middle, you get middle pressure,\" Cowboys defensive coordinator Matt Eberflus said Monday. \"When you have the threat of middle pressure, that creates a lot of one-on-ones for somebody else. That's the biggest thing, like for the [defensive tackles] Osa [Odighizuwa] or KC [Kenny Clark] or whoever might be in there. That's what that [an All-Pro DT in Williams] creates because you've got to move people to him. That creates opportunities for somebody else.\"Cowboys With/without Quinnen Williams This Season (NFL ranks)Without (Weeks 1-9)With (Weeks 11-13)W-L3-5-1 (19th)3-0  (T-1st)PPG allowed30.8  (31st)21.7 (16th)Total YPG allowed397.4  (31st)312.3  (14th)Rush YPG allowed143.0  (29th)69.7 (2nd)QB pressures135 (3rd)55 (2nd)QB pressure rate39.8% (9th)41.7% (3rd)Sacks20 (T-17th)8 (T-6th)Takeaways7 (T-23rd)3 (T-18th)* On bye week in Week 10\nThe improvement Dallas has made -- from being a bottom-five run defense to the second-best in the NFL (69.7 rushing yards per game allowed) since Week 11 -- will be tested by the Lions' two-headed monster of Jahmyr Gibbs and David Montgomery. Since they became a tandem in 2023, Gibbs (36 rushing touchdowns, second most among running backs) and Montgomery (31 rushing touchdowns, sixth most) have become the first running back duo in the Super Bowl era (since 1966) to each run for more than 30 touchdowns in a three-season span.\"Yeah, D-Mo is a real pro, very serious, very intense. He's a damn good runner, and he's done a good job for those guys. The 1-2 punch that they have is something that you don't have in the NFL, and they have it,\" Eberflus said. \"Gibbs is just one of the best in the league in terms of his burst, in terms of his ability to capture edges in the run game and then in space. When he's in space, he's electric. So, we got our hands full with them.\"\nCowboys vs. Lions prediction, pick\nThe Cowboys are the healthier team at this point in the season. Detroit's banged up offensive line won't be able to hold up for all 60 minutes against Dallas' three-headed monster at defensive tackle of All-Pro Quinnen Williams, three-time Pro Bowler Kenny Clark and Osa Odighizuwa. \nPick: Cowboys 35, Lions 31 | (Dallas +3, Over 54.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where to watch Cowboys vs. Lions: Live stream, kickoff time, TV channel, pick - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/12/04/e1559539-9a88-431d-9b19-620ebb300f9c/thumbnail/1200x675/9d57884d824baaf3c6f6dd1fc2444006/prescott-goff.jpg"
      ],
      "datePublished": "2025-12-04T22:00:44.000Z",
      "dateModified": "2025-12-04T22:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-football/news/college-football-championship-games-2025-picks-odds-lines-spreads-predictions-best-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg",
    "tag": "Sports",
    "date": "2025-12-04T23:40:40.000Z",
    "description": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC champ",
    "body": "\n        Conference championship week in college football has arrived. The Group of Five has four title games on Friday, with the fifth, the MAC championship, coming on Saturday. The Power Four title games take place on Saturday, and all of them will impact either who makes the College Football Playoff field and/or where they are seeded. The latest conference championship college football odds list Texas Tech at -12.5 vs. BYU in the Big 12 as BYU head coach Kalani Sitake is remaining with the Cougars instead of going to Penn State. Georgia is at -2.5 vs. Alabama in the SEC as the Dawgs look to avenge their lone defeat, Ohio State is at -4 vs. Indiana in the Big Ten in a No. 1 versus No. 2 matchup, and Virginia is at -4.5 against Duke in the ACC after UVA both beat and covered versus the Blue Devils on Nov. 15. Before locking in any college football picks on those games or others, be sure to see the college football betting guide from legendary Vegas handicapper Bruce Marshall.   iNew users can also target the latest Underdog promo code, good for $100 in site credits when you play $5 with the promo code CBSSPORTS2 in select states.For years Vegas-based Marshall was synonymous with The Gold Sheet, the famous sports betting newsletter. He has also won various handicapping titles and also is working on several book projects. Marshall crushed his 2024 college football betting picks, going 64-43 and returning more than 16 units, finishing the season as SportsLine's top expert. He enters this week on a 43-36 run on his official SportsLine college football picks as well. Anyone following could have seen huge returns. Now, using his Tech Corner technique that evaluates all the trends, Marshall has turned his attention to the latest college football odds for conference championship week and evaluated each matchup. You can head to SportsLine to see every pick.New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:Top college football predictions for championship weekOne of the top college football picks Marshall is recommending for the conference title games: He's backing Virginia (-3.5) against Duke in the ACC Championship Game. He's also likes the Under (57.5) to hit in the 8 p.m. ET nightcap on Saturday. These teams met in Durham on Nov. 15 and Virginia won 34-17 despite being a 5-point road underdog. That game also hit the Under (60.5) with some room to spare. Marshall sees more of the same at a neutral site in Charlotte.\"UVA is 7-3 vs. the spread in last 10 this season and the Cavaliers also enter Charlotte on 7-0 Under run,\" Marshall told SportsLine. \"The Blue Devils are only 3-3 straight-up and vs. spread down stretch this season.\" Go to SportsLine to see all of Marshall's picks, and bet that pick right here:How to make college football conference championship picksMarshall has evaluated every other matchup, and he's backing a team on a huge 14-2 spread run dating back to last year. Get betting analysis for each matchup at SportsLine, and use promo code CHAMPIONSHIP to get your first month at SportsLine for $1.So what college football picks can you make with confidence, and what alarming trends do you need to know about this week? Check out the latest college football odds below, then visit SportsLine to see which teams to back, all from the legendary Vegas expert who has won multiple handicapping titles and is on a 43-36 run on college football picks this season, and find out.College football odds for championship weekSee full conference championship game college football picks, odds, predictions here(odds subject to change)Friday, Dec. 5Conference USA Championship Game: Kennesaw State vs. Jacksonville State (-2.5, 60.5)Sun Belt Championship Game: James Madison vs. Troy (+23.5, 47.5)AAC Championship Game: North Texas vs. Tulane (+2.5, 67.5)Mountain West Championship Game: Boise State vs. UNLV (+4.5, 58.5)Saturday, Dec. 6Big 12 Championship Game: BYU vs. Texas Tech (-12.5, 49.5)MAC Championship Game: Miami (OH) vs. Western Michigan (-2.5, 43.5)SEC Championship Game: Georgia vs. Alabama (+2.5, 47.5)Big Ten Championship Game: Indiana vs. Ohio State (-4, 47.5)ACC Championship Game: Duke vs. Virginia (-4.5, 57.5)\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College football predictions, odds, spreads: 2025 Championship Week picks from legendary expert - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/11/30/cd97256a-1bda-4d4f-95cc-f20e2d6522b4/thumbnail/1200x675/89cfe0c4f424dc4b32eb5e5841ab2d7e/chandler-morris-virginia-vs-virginia-tech.jpg"
      ],
      "datePublished": "2025-12-04T23:40:40.000Z",
      "dateModified": "2025-12-04T23:40:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/cowboys-lions-prediction-odds-line-spread-time-week-14-thursday-night-football-nfl-picks-bets/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png",
    "tag": "Sports",
    "date": "2025-12-05T00:03:30.000Z",
    "description": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dall",
    "body": "\n        Teams battling for a playoff spot meet when the Dallas Cowboys face the Detroit Lions in a key NFC matchup on 'Thursday Night Football.' Dallas is coming off a 31-28 win over the Kansas City Chiefs, while Detroit dropped a 31-24 decision to the Green Bay Packers on Thanksgiving Day. The Cowboys (6-5-1), who have won three in a row, are just 1.5 games behind Philadelphia for the NFC East lead. The Lions (7-5), who have lost three of five, have fallen two games behind Chicago in the NFC North. Lions receiver Amon-Ra St. Brown (ankle) is active, while safety Kerby Joseph (knee) is inactive.Kickoff from Ford Field in Detroit is set for 8:15 p.m. ET. The Cowboys lead the all-time series 19-13, but the Lions won last year's meeting 47-9. The Lions are 3.5-point favorites in the latest Cowboys vs. Lions odds, while the over/under for total points scored is 55.5 via SportsLine consensus. Detroit is at -181 on the money line (risk $181 to win $100), while Dallas is at +151 (risk $100 to win $151). Before making any Cowboys vs. Lions picks, check out the NFL predictions from the SportsLine Projection Model. New users can target the DraftKings promo code, which offers $200 in bonus bets if your bet wins:The model, which simulates every NFL game 10,000 times, is up well over $7,000 for $100 players on top-rated NFL picks since its inception. The model entered Week 14 on a 49-33 run on top-rated picks dating back to 2024. Anybody following its NFL betting picks at sportsbooks and on betting sites could have seen strong returns.Now, the model has set its sights on Cowboys vs. Lions. You can visit SportsLine now to see the picks. Here are the FBS college football odds and trends for Lions vs. Cowboys:Cowboys vs. Lions                                                             spreadDetroit -3.5 at DraftKings SportsbookCowboys vs. Lions         over/under55.5 pointsCowboys vs. Lions                                                                                                                                                                         money line Detroit -181, Dallas +151Cowboys vs. Lions                                                                                                                                                                 picksSee picks at SportsLineCowboys vs. Lions                                                                                                                                                                   streaming Prime VideoWhy the Lions can coverVeteran quarterback Jared Goff helps power the Detroit offense. In 12 games this season, he has completed 69.8% of his passes for 3,025 yards and 25 touchdowns with five interceptions and a 110.2 rating. In last week's loss to the Packers, he completed 20 of 26 passes for 256 yards and two touchdowns. He also carried once for 24 yards. In a 34-27 overtime win over the New York Giants on Nov. 23, he completed 28 of 42 passes for 279 yards and two touchdowns with one interception.Another weapon on offense is running back Jahmyr Gibbs. In 12 games, he has carried 175 times for 1,019 yards (5.8 average) and 10 touchdowns. He has had 10 explosive plays of 20 yards or more, including a long of 78, with 46 first-down conversions. In the win over the Giants, he carried 15 times for 219 yards (14.6 average) and two touchdowns. He also caught 11 passes for 45 yards and a score. See which team to back at SportsLine. Why the Cowboys can coverTen-year veteran quarterback Dak Prescott leads the Dallas offense. In 12 starts, he has completed 69.3% of his passes for 3,261 yards and 25 touchdowns with eight interceptions and a 102.4 rating. He has also rushed 41 times for 124 yards and two touchdowns. In the win over Kansas   City, he completed 27 of 39 passes (69.2%) for 320 yards and two touchdowns with one interception. His top target is fourth-year veteran wide receiver George Pickens. In 12 games, he has 73 receptions for 1,142 yards and eight touchdowns. In the win over the Chiefs, he caught six passes for 88 yards. He caught nine passes for 146 yards and one touchdown in a 24-21 win over the Philadelphia Eagles on Nov. 23. See which team to back at SportsLine.New users can also check out the latest FanDuel promo code and get $150 in bonus bets instantly at FanDuel if your $5 bet wins. How to make Cowboys vs. Lions picksSportsLine's model is going Over on the total, projecting 56 combined points. It also says one side of the spread hits in well over 50% of simulations.         You can only get the pick at SportsLine. So who wins Cowboys vs. Lions, and which side of the spread hits well over 50% of the time? Visit SportsLine now to see which side of the Cowboys vs. Lions spread to jump on, all from the advanced model that finished up over $7,000 on its NFL picks since its inception, and find out.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cowboys vs. Lions prediction, odds, start time: 2025 NFL Thursday Night Football game picks by proven model - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2025/10/30/c8a6cc91-27be-4869-b8f5-dd4e3a602b1f/thumbnail/1200x675/fa8708bad0ef14ef35ddee2ae700b605/javonte-williams-cowboys.png"
      ],
      "datePublished": "2025-12-05T00:03:30.000Z",
      "dateModified": "2025-12-05T00:03:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]