[
  {
    "title": "Use DraftKings promo code to get $200 bonus bets by targeting Thunder-Nuggets, Illinois-Michigan on Friday - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/use-draftkings-promo-code-to-get-200-bonus-bets-thunder-nuggets-illinois-michigan-friday/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg",
    "tag": "Sports",
    "date": "2026-02-27T21:28:39.000Z",
    "description": "\n        Shai Gilgeous-Alexander makes his return for the Oklahoma City Thunder, the perfect time to claim the current DraftKings promo code, which gi",
    "body": "\n        Shai Gilgeous-Alexander makes his return for the Oklahoma City Thunder, the perfect time to claim the current DraftKings promo code, which gives new users $200 in bonus bets if your first $5+ bet wins. Gilgeous-Alexander has missed the last nine games with an abdominal strain, but the Thunder still went 5-4 without him and are 45-15 on the season. The SportsLine Projection Model is picking the Thunder to cover as 8.5-point favorites as one of its Friday best bets at DraftKings. The model is also backing Over 217.5 total points scored for Knicks vs. Bucks for Friday NBA best bets. One of SportsLine's top experts has also locked in a college basketball pick in a top 10 Big Ten showdown between No. 3 Michigan and No. 10 Illinois at 8 p.m. ET. Claim the latest DraftKings promo code, where new users get $200 in bonus bets if your first $5+ bet wins: Check out our DraftKings promo code review for full details.The SportsLine Projection Model simulates every NBA game 10,000 times and has returned well over $10,000 in betting profit for $100 players on its top-rated NBA picks over the past eight-plus seasons. The model entered Week 19 on a sizzling 38-18 roll on top-rated NBA spread picks dating back to last season. Anyone following its NBA betting advice at sportsbooks and on betting apps could have seen huge returns.Friday best bets at DraftKings SportsbookKnicks vs. Bucks: Over 217.5 total points (-112)Illinois (+105) to defeat Michigan Thunder (-8.5) vs. Nuggets (-102)Combining the three picks into a Friday parlay at DraftKings would result in a payout of +668 (risk $100 to win $668, odds subject to change). Bet it at DraftKings here:Knicks vs. Bucks: Over 217.5 total points (-112)The Knicks are coming off one of their worst scoring performances of the season, posting 94 points against the Cavaliers, but the four other times they've been held to less than 100 points, New York scored at least 110 points the following contest. Expect the Knicks to want to erase that performance, and with the Knicks having a top-10 scoring offense (117.2 points per game, ninth), that's likely to happen. Meanwhile, the Bucks' offense has been rolling lately even without Giannis Antetokounmpo (calf). Milwaukee has scored at least 118 points in three of its last four games. The Over has cashed in three of the last four Bucks games, and the model projects the Over to hit in 67.5% of simulations. Back the Over at DraftKings here:Illinois (+105) to defeat Michigan\"Illinois has had all week to stew over blowing a 23-point lead in an overtime loss at UCLA last Saturday. So while Michigan had a bit of a palate-cleanser from the Duke game with its win against Minnesota at home, I think the Illini are going to be breathing fire,\" SportsLine expert Chip Patterson said. \"Then there's the matchup, which has Illinois with a notable advantage in the backcourt (Keaton Wagler and Kylan Boswell over Elliot Cadaeu and Nimari Burnett) and comparable size to handle Michigan's 6-9, 6-9, 7-3 jumbo-sized front-court. Plus, there's a sneaky series edge here because while Michigan might eye Ohio State or Michigan State as its primary rivals, Illinois has won nine straight against the Wolverines, a streak that dates back to Jan. 2019.\" Back Illinois to win at DraftKings here:Thunder (-7.5) vs. Nuggets (-102)Shai Gilgeous-Alexander is back for the Thunder after missing nine games with an abdominal strain, and although they played well without him, going 5-4, his return takes them to a new level. SGA is the reigning NBA MVP on the reigning NBA champions, and Oklahoma City has the No. 1 score differential (+11.4 ppg) largely due to his court presence. Gilgeous-Alexander is second in the NBA in scoring at 31.8 ppg this year. The Thunder are home on Friday, where OKC is 24-6 overall this season. The Nuggets have lost six of their last 10 games, including a 121-111 loss to the Thunder in Denver where SGA scored 34 points. The model projects the Thunder to cover in 59% of simulations. Back the Thunder to cover at DraftKings here:Want more NBA and college basketball picks on Friday?You've seen some of the model's Friday best bets. Now, get against the spread, total and money-line picks for all games, including the NBA, college basketball, NHL, and more, all from the model that's simulated every game 10,000 times. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Use DraftKings promo code to get $200 bonus bets by targeting Thunder-Nuggets, Illinois-Michigan on Friday - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/12/14bae9ea-2c5b-4135-b71d-96f1e51d9813/thumbnail/1200x675/63ff067995cb006b0fa0fbf6a1ef925e/draftkings-bet-5-get-200-iyw-1400x788.jpg"
      ],
      "datePublished": "2026-02-27T21:28:39.000Z",
      "dateModified": "2026-02-27T21:28:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 WWE Elimination Chamber: Matches, date, card and rumors for annual event - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/wwe-elimination-chamber-2026-card-matches-rumors-date-location/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg",
    "tag": "Sports",
    "date": "2026-02-28T00:40:28.000Z",
    "description": "\n        The Road to WrestleMania has reached its final prelude. WWE has just one PPV left before the greatest show of them all in April and that's th",
    "body": "\n        The Road to WrestleMania has reached its final prelude. WWE has just one PPV left before the greatest show of them all in April and that's the Elimination Chamber. WWE returns to Chicago on Saturday night for the epic event where two superstars will punch their ticket to WrestleMania 42 by outlasting five others inside the sadistic structure. The men's match has some massive names looking to return to a headlining role at WrestleMania (Cody Rhodes, Randy Orton and Jey Uso) but it also has some men looking to make their mark and earn their first headlining spot (LA Knight, Je'Von Evans and Trick Williams).On the women's side, four former champions are set to compete in Tiffany Stratton, Rhea Ripley, Alexa Bliss and Asuka while two newer competitors look to make a splash in Kiana James and Raquel Rodriguez.\nThe other two matches are near and dear to the fans in Chicago. World heavyweight champion CM Punk puts his title on the line in front of his hometown fans when he takes on Finn Balor. And Punk's wife, AJ Lee, challenges Becky Lynch for the women's intercontinental title in her first singles match in more than a decade.Take a look below at the confirmed matches for Elimination Chamber and take a glance at the crystal ball of what may come. The event streams live on ESPN Unlimited on Saturday with the main card starting at 6 p.m. ET.2026 WWE Elimination Chamber matchesWorld Heavyweight Championship -- CM Punk (c) vs. Finn Balor: Balor returned to the main event scene after Judgment Day ally Liv Morgan accused him of complacency. Balor fell short of defeating the world heavyweight champion in Balor's home nation of Ireland. The respect Punk and Balor showed each other after the match fizzled out after Balor was denied a rematch by Raw general manager Adam Pearce. Balor took matters into his own hands, attacking Punk and provoking the champ into granting him a rematch.\nElimination Chamber match -- Randy Orton vs. LA Knight vs. Cody Rhodes vs. Je'Von Evans vs. Trick Williams vs. Jey Uso: An undisputed WWE title shot awaits the winner of the men's Elimination Chamber match. Orton qualified by beating Aleister Black and Solo Sikoa in a triple threat match. Knight defeated Austin Theory and Penta to earn his spot. After Rhodes earned his spot with a win over Jacob Fatu and Sami Zayn, Evans became the biggest surprise entrant in the match by defeating Gunther and Dominik Mysterio on Raw. Williams earned the penultimate spot by beating Carmelo Hayes and Damian Priest. Uso was the final man to qualify, partially as a result of a legitimate injury suffered by Bronson Reed during the qualifying match against Uso and El Grande Americano.Women's Intercontinental Championship -- Becky Lynch (c) vs. AJ Lee: Punk isn't the only adored superstar coming home to Chicago. Lee seeks to join her husband as an active champion at Elimination Chamber. Lynch proposed the match, but only agreed to defend her women's intercontinental title after Lee refused to wrestle her otherwise. Lee is 2-0 against Lynch since ending her 10-year retirement, beating her in a mixed tag team match and in WarGames.Elimination Chamber match -- Rhea Ripley vs. Tiffany Stratton vs. Alexa Bliss vs. Asuka vs. Kiana James vs. Raquel Rodriguez: Stratton advanced to the Elimination Chamber by beating Lash Legend and Chelsea Green on SmackDown. Ripley qualified by overcoming Lyra Valkyria and Ivy Nile on Raw. Bliss defeated Giulia and Zelina Vega to grab a spot in the match, and was joined by Asuka, who defeated Bayley and Nattie. James snuck a pinfall over Charlotte Flair in their match with Nia Jax. Rodriguez has the chance to join Judgment Day Liv Morgan in challenging for a world championship at WrestleMania after defeating Iyo Sky and Kairi Sane in the final qualifier.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 WWE Elimination Chamber: Matches, date, card and rumors for annual event - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/10/26aa6276-8ccc-4835-8ab2-daa887863678/thumbnail/1200x675/a6498dd550bac5f964974083c6f190a6/cm-punk-elimination-chamber-wwe-cbs-sports-pro-wrestling-feb-10-2026.jpg"
      ],
      "datePublished": "2026-02-28T00:40:28.000Z",
      "dateModified": "2026-02-28T00:40:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Cognizant Classic leaderboard: Brooks Koepka heats up as Austin Smotherman leads - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/golf/news/cognizant-classic-leaderboard-2026-brooks-koepka-austin-smotherman/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/76fe5e82-787d-4e15-b265-62df38fbc55d/thumbnail/1200x675/ea3964f73ea407ddf4cd75306fd3593d/brooks-koepka-sun-cognizant-g.jpg",
    "tag": "Sports",
    "date": "2026-02-27T23:53:09.000Z",
    "description": "\n        As winds picked up on Friday, PGA National started to show a bit more of its teeth, and the conditions that produced some incredibly low scor",
    "body": "\n        As winds picked up on Friday, PGA National started to show a bit more of its teeth, and the conditions that produced some incredibly low scores gave way to a greater challenge in the second round of the 2026 Cognizant Classic. Still sitting atop the leaderboard going into Saturday is Austin Smotherman, one of the few players who ended Thursday on the first page of the leaderboard.Smotherman backed up his strong play with a quality round Friday, extending his lead from one to three shots thanks to a solid 69 that put him 11 under par. Few players were able to mount a real charge on a difficult day. While it wasn't as dynamic a round as his 62 on Thursday, Smotherman acquitted himself well in the tougher conditions on Friday afternoon. Most of the best scores of the day were posted in the morning, and Smotherman's 69 was among the better rounds of the later wave. Unsurprisingly, his approach play was the first thing to falter in the wind, but the putter stayed warm with another day with more than 2 strokes gained on the field on the greens. This bomb for birdie on No. 17 did some of the heavy lifting. \nWith two excellent rounds in the books, Smotherman is in the driver's seat to pick up the first win of his PGA Tour career going into the weekend. He's been boom or bust to start the 2026 PGA Tour season, with just one made cut in his first four events, a T8 at The American Express. Now he looks poised to not only pick up a second top 10 of the season but also a potential career-changing victory. \nWhile Smotherman was extending his lead at the top of the leaderboard, some of the biggest names in the field came into Friday's second round needing serious improvement just to make the weekend. Brooks Koepka, Max Homa and Ryan Gerard all entered Friday over par and outside the projected cut, but each posted rounds in the mid-60s on Friday to punch their tickets to the final 36 holes. Gerard entered the week in unfamiliar territory as the pre-tournament favorite, and while he struggled to produce his best on Thursday, a 67 on Friday got him into red figures at 2 under and two more rounds of golf this weekend. Homa and Koepka, meanwhile, shot matching 66s as they continue to try to create the spark that can help them capture past form. For Homa, it was his iron play coming to life that led to his second-round surge, as he gained more than 3.3 strokes on the field approaching the green. Once a premier ball-striker on the PGA Tour, Homa has slipped significantly of late, but Friday brought a reminder of what he's capable of achieving when he gets in a good swing rhythm. \nKoepka, meanwhile, has been one of the worst putters on the PGA Tour this season in his return. He came into the week 171st in strokes gained putting and was 111th on Thursday on his way to a 74. His putting turned around in a major way on Friday, as he poured in 131 feet and 3 inches of putts in the second round -- the most of anyone in the field -- picking up nearly 4 strokes on the greens. After his round, he credited a setup change he made after his first round struggles that turned around his fortunes, despite, in his mind, hitting the ball worse on Friday.\"Just may hand position at setup,\" Koepka said. \"I was just cheating it. Changed the stroke a little bit. I'm not getting as handsy, and I was cheating it by getting my hands back, and it just was creating an inconsistent feel. Where I thought it was taking off, it wasn't.\"\nReplicating that exact kind of putting performance will be nearly impossible, but for a player who hasn't been able to get anything to drop all year, having a day where the putter gets red-hot could be huge for his confidence on the greens -- especially after putting a new putter in the bag this year.Leader1. Austin Smotherman (-12): The winds are supposed to settle down again on Saturday before picking back up on Sunday, and the field will be starting play early due to potential storms in the area. That means, if Smotherman is going to maintain a comfortable lead going into the final round, he'll need to keep the pedal down on Moving Day in solid conditions. We've seen that low scores are available at PGA National since they've made some recent changes to the setup, and Smotherman will need to stay on the front foot with an eye on another round in the 60s rather than simply trying to hold on for 36 holes. Contenders2. Taylor Moore (-8)T3. Nico Echavarria, A.J. Ewart (-7)5. Joel Dahmen (-6)T6. Shane Lowry, Aaron Rai and four others (-5)T12. Daniel Berger and five others (-4)T18. Max Homa and eight others (-3) \nEwart posted the round of the day on Friday to thrust himself into contention after starting the second set of 18 holes at even par. His 64 paced the field in scoring, and now, he finds himself in unfamiliar territory with a late tee time on the weekend for the first time in his young career. Echavarria started Friday one back of Smotherman, but he struggled in the more challenging conditions and moved backwards a spot on the leaderboard. Even with that minor setback, Echavarria is certainly a threat going into the weekend, particularly with the forecast for Saturday looking more like Thursday when he fired a 63. Lurking a bit further back are some notable names like Joel Dahmen, Shane Lowry, Aaron Rai and Daniel Berger. Dahmen has put together consecutive rock-solid 68s, but if he's going to contend, he'll need to take it a bit deeper and find some more birdies to get in the mix. Lowry has made the cut at the Cognizant for nine straight starts and loves PGA National, so don't count him out if he can get the putter warmed up and see some fall early on Saturday. Players won't have to look far to find a reason for optimism heading into the weekend trailing, as Joe Highsmith won last year after making the cut on the number. That required a pair of weekend 64s, and he was only eight shots off the lead, not 11, but everyone will know what's possible, and we ought to see some extremely aggressive play early on Saturday with the winds down. \nNotable players who missed the cutLuke Clanton (+1)Webb Simpson (+1)Michael Thorbjornsen (+1)Neal Shipley (+2)Gary Woodland (+2)Chris Kirk (+2)Stephan Jaeger (+2)A late move on Friday afternoon shifted the cut line from +1 to Even, which dropped a huge group of players from the weekend. Some of the rising young stars of the game were included in that group, as Luke Clanton, Michael Thorbjornsen and Neal Shipley (who bogeyed his last, trying to make a birdie to get to the weekend) all narrowly missed out.Updated 2026 Cognizant Classic odds, picksOdds via Caesars SportsbookAustin Smotherman (7/4)Taylor Moore (7-1)Nico Echavarria (19/2)Shane Lowry (12-1)A.J. Ewart (17-1)Joel Dahmen (18-1)Aaron Rai (20-1)We'll see how Smotherman handles the nerves of being the 36-hole leader in pursuit of his first career win. The nature of this course (with the current setup) is going to make it so someone from the chase pack reels him in. Echavarria, despite a rough Friday, has a good chance to post another low round on Saturday and get in position for a win, and Lowry's comfort on this course should keep him in the mix all the way through Sunday afternoon. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Cognizant Classic leaderboard: Brooks Koepka heats up as Austin Smotherman leads - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/76fe5e82-787d-4e15-b265-62df38fbc55d/thumbnail/1200x675/ea3964f73ea407ddf4cd75306fd3593d/brooks-koepka-sun-cognizant-g.jpg"
      ],
      "datePublished": "2026-02-27T23:53:09.000Z",
      "dateModified": "2026-02-27T23:53:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Basketball: Week 20 Waiver Wire adds - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/basketball/news/fantasy-basketball-2026-week-20-waiver-wire/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/9eb95aa3-0376-4086-a515-f0901044025c/thumbnail/1200x675/dae8c01b2c904bedf0f5f9c2a315153e/gui-santos-golden-state-warriors-imagn-images.jpg",
    "tag": "Sports",
    "date": "2026-02-27T20:53:42.000Z",
    "description": "\n        As we enter the month of March, there will be several unlikely players that will morph into valuable fantasy options with teams resting playe",
    "body": "\n        As we enter the month of March, there will be several unlikely players that will morph into valuable fantasy options with teams resting players and dealing with injuries. Finding the right ones to add could help you bring home a championship. Here are five under-the-radar players to consider adding who are still available in the majority of CBS leagues.Gui Santos, Golden State Warriors (48% rostered)Stephen Curry has missed the entire month of February as he continues to battle his knee injury. The Warriors acquired Kristaps Porzingis (illness) at the trade deadline, but he has appeared in just one game for them. He has played just 18 games total this season, and even when he has taken the floor, he usually sees limited minutes.With the Warriors so shorthanded, Santos has averaged 29 minutes over their last 12 games. During that stretch, he put up 15 points, 5.6 rebounds, 3.8 assists, 1.6 steals, and 1.8 3-pointers a night. For the season, he is shooting 53.1% from the field and 39% from behind the arc. Even when Curry comes back, there should be enough minutes and shot attempts for Santos to remain a valuable fantasy option.Precious Achiuwa, Sacramento Kings (33% rostered)As the Kings continue their path to finishing with one of the worst records in the NBA, they don't have any reinforcements coming. Domantas Sabonis (knee), Zach LaVine (finger), and De'Andre Hunter (eye) are all out for the remainder of the season. Dylan Cardwell (ankle) will likely be out for at least three more weeks, and Keegan Murray left Wednesday's game against the Rockets with an ankle injury. For Murray, it's the same ankle that sidelined him for 20 games recently. It would not be a surprise to see the Kings take a cautious approach with him moving forward.\nA lack of healthy options has forced Achiuwa into more playing time. He has averaged 30 minutes over the last four games, which helped him produce averages of 17 points, 9.4 rebounds, 1.8 steals, and 0.8 blocks. Given the state of the Kings' roster right now, Achiuwa has the potential to be a nightly double-double threat down the stretch.Marvin Bagley III, Dallas Mavericks (28% rostered)Daniel Gafford has been hampered by injuries for much of the season. The Mavericks need him to play more with Dereck Lively II (foot) out and Anthony Davis having been traded, but he has only averaged 23 minutes over the last 12 games as he battles an ankle ailment. Thursday, he did not play against the Kings in what was the first game of a back-to-back set for Dallas.With Gafford seemingly unable to log heavy minutes, Bagley has settled into a significant role off the bench. He has averaged 24 minutes over seven games with the Mavericks, leaving him to average 13 points and 8.9 rebounds during that span. Don't count on him for many assists or defensive stats, but if your squad needs rebounds, Bagley is worth considering on the waiver wire.\nJavon Small, Memphis Grizzlies (16% rostered)The Grizzlies continue to try to improve their lottery odds by giving more minutes to their younger players. Ja Morant (elbow) and Zach Edey (ankle) might not play again this season. The Grizzlies have also been operating without Santi Aldama (knee) and Cedric Coward (knee) recently. That has helped Small average 26 minutes over his last seven games.Small has made a case to remain in a significant role down the stretch, averaging 14.9 points, 4.4 rebounds, 3.9 assists, 1.1 steals, and 2.3 3-pointers over those seven games. He shot 59.3% from the field and 85.7% from the charity stripe. The Grizzlies don't give any of their players over 30 minutes a night on a regular basis, but Small could certainly play around 25 minutes a game moving forward. For those who play in deeper formats, Small has some upside.Guerschon Yabusele, Chicago Bulls (9% rostered)The Bulls are another team that is dealing with a lack of depth up front. They traded away Nikola Vucevic as they dove into a rebuild at the trade deadline. Zach Collins (toe) is out for the rest of the season, and Jalen Smith can't seem to shake a nagging calf injury. Smith has missed seven of the last 12 games and didn't log more than 25 minutes in any of the games that he did appear in. He is expected to miss a minimum of one week. Given that the Bulls continue to fall out of the playoff hunt, it would make sense for them to sit Smith until he is completely healthy.\nYabusele went from barely playing on the Knicks to being an important player for the Bulls. Since landing with his new team, he has averaged 10.1 points, 5.9 rebounds, two assists, and 2.1 3-pointers over nine games. The only real size behind him right now is journeyman Nick Richards. The Bulls don't have an up-and-coming young center to give minutes to, so Yabusele could split time at both the four and the five and play around 25 minutes a night for the foreseeable future. In 14-team and deeper leagues, that's enough to warrant adding him.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Basketball: Week 20 Waiver Wire adds - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/9eb95aa3-0376-4086-a515-f0901044025c/thumbnail/1200x675/dae8c01b2c904bedf0f5f9c2a315153e/gui-santos-golden-state-warriors-imagn-images.jpg"
      ],
      "datePublished": "2026-02-27T20:53:42.000Z",
      "dateModified": "2026-02-27T20:53:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Men's college basketball conference tournaments 2026: Schedule, brackets, automatic-bid tracker - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-conference-tournaments-2026-schedule-results-automatic-bids/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/28/67e6e3fc-ec45-4943-a6d0-8199749672c0/thumbnail/1200x675/ed1573360438bc5694f81ce4b63ddb17/untitled-design-213.png",
    "tag": "Sports",
    "date": "2026-02-28T06:19:11.000Z",
    "description": "\n\n\n    \n                                    The first conference tournament bracket is here with the first March Madness games set for next week\n     ",
    "body": "\n\n\n    \n                                    The first conference tournament bracket is here with the first March Madness games set for next week\n        \n                                                \n                        \n                        \n    \n                                            \n                    \n                    \n                                            \n        \n    Feb 28, 2026\n                            \n                    at\n    1:08 am ET\n                        \n                •\n            \n            2 min read\n            \n        \n    \n\n            \n    \n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The first conference tournament bracket for the 2025-26 season is set. The Sun Belt Tournament begins Tuesday with a pair of first-round matchups between teams that will be looking to extend their seasons for another day. Entering Friday, the final day of the regular season, seven different teams were mathematically alive for at least a share of the SBC championship. Troy captured the Sun Belt title after defeating UL Monroe to earn the No. 1 seed in next week's tournament. Marshall earned the No. 2 seed and the bye into , and despite losing to Georgia Southern. There was a six-way tie (with 11-7 conference records) for second place in the conference standings.Because of the Sun Belt's tournament format which places the top two seeds in the conference's semifinals, Troy and Marshall will need to win just one game next weekend (March 8) to advance to the Sun Belt Tournament championship game. The tournament gets started Tuesday in Pensacola, Florida, when No. 14 seed UL Monroe will face No. 11 seed Old Dominion before No. 13 seed Georgia State meets No. 12 seed Louisiana.\nThe Horizon League will get college basketball's postseason underway on Monday with a first-round game between No. 10 seed Cleveland State and No. 11 seed IU Indianapolis.While the Horizon League will be the first league to get its tournament underway, other leagues will be in action later in the week. Among the leagues that will have first-round games on Wednesday are the ASUN, Big South, Northeast, Ohio Valley and the Summit League and we are just days away from the rest of the conferences to get underway.\n\n        \n            \n                Why Miami (Ohio) still hasn't locked up an NCAA Tournament at-large bid despite roaring off to 29-0 start\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nWhen conference tournament results roll in, we'll be keeping track of them here as teams begin to claim automatic bids to the NCAA Tournament. 2025-26 conference tournaments ConferenceLocationDates\tChampionship (TV) / Champion America EastCampus sitesMarch 7, 10, 14March 14, 11 a.m. ESPN2AmericanBirmingham, Ala.March 11-15March 15, 3:15 p.m. ESPNAtlantic 10Pittsburgh, Pa.March 11-15March 15, 1 p.m. CBSACCCharlotte, N.C.March 10-14March 14, 8:30 p.m. ESPNASUNJacksonville, Fla.March 4,6-8March 8, 2 p.m. ESPN2Big 12Kansas City, Mo.March 10-14March 14, 6 p.m. ESPNBig EastNew York CityMarch 11-14March 14, 6:30 p.m. FoxBig SkyBoise, IdahoMarch 7-11March 11, 11:30 p.m. ESPN2Big SouthJohnson City, Tenn.March 4, 6-8March 8, 12 p.m. ESPN2Big TenChicagoMarch 10-15March 15, 3:30 p.m. CBSBig WestHenderson, Nev.March 11-14March 14, 10 p.m. ESPN2CAAWashington, D.C.March 6-10March 10, 7 p.m. CBS Sports NetworkConference USAHuntsville, Ala.March 10-14March 14, 8:30 p.m. CBS Sports NetworkHorizon LeagueIndianapolisMarch 2,4,8-10March 10, 7 p.m. ESPNIvy LeagueIthaca, N.Y.March 14-15March 15, 12 p.m. ESPN2MAACAtlantic City, N.J.March 5-10March 10, 9 p.m. ESPN2MACClevelandMarch 12-14March 14, 8 p.m. ESPN2MEACNorfolk, Va.March 11-14March 14, 1 p.m. ESPN2Missouri ValleySt. LouisMarch 5-8March 8, 12 p.m. CBSMountain WestLas VegasMarch 11-14March 14, 6 p.m. CBSNortheastCampus sitesMarch 4,7,10March 10, 7 p.m. ESPN2Ohio ValleyEvansville, Ind.March 4-7March 7, 8 p.m. ESPN2Patriot LeagueHigher seed hostsMarch 3,5,8,11March 11, 7 p.m. CBS Sports NetworkSECNashville, Tenn.March 11-15March 15, 1 p.m. ESPNSoConAsheville, N.C.March 6-9March 9, 7 p.m. ESPNSouthlandLake Charles, La.March 8-11March 11, 5 p.m. ESPN2SWACAtlantaMarch 9-14March 14, 7:30 p.m. ESPNUSummit LeagueSioux Falls, S.D.March 4-8March 8, 9 p.m. CBS Sports NetworkSun BeltPensacola, Fla.March 3-9March 9, 6 p.m. ESPN2West CoastLas VegasMarch 5-10March 10, 9 p.m. ESPNWACLas VegasMarch 11-14March 14, 12 a.m. ESPN2\n            \n\n\n        \n                        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Men's college basketball conference tournaments 2026: Schedule, brackets, automatic-bid tracker - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/28/67e6e3fc-ec45-4943-a6d0-8199749672c0/thumbnail/1200x675/ed1573360438bc5694f81ce4b63ddb17/untitled-design-213.png"
      ],
      "datePublished": "2026-02-28T06:19:11.000Z",
      "dateModified": "2026-02-28T06:19:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CBB picks: Expert shares best bets for Saturday's games, including Arkansas-Florida - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/college-basketball-picks-arkansas-vs-florida-among-experts-best-bets-for-biggest-games-on-saturday-feb-28/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/783a4402-78c6-4576-8e86-3289cb8d8639/thumbnail/1200x675/a64d49b8ee6799eaa0a870331560938c/arkansas.jpg",
    "tag": "Sports",
    "date": "2026-02-27T21:30:33.000Z",
    "description": "\n        Every Friday leading up to conference tournaments I'll take an early look at some of Saturday's biggest college basketball games based on the",
    "body": "\n        Every Friday leading up to conference tournaments I'll take an early look at some of Saturday's biggest college basketball games based on the opening lines. This Saturday features an SEC showdown between Arkansas and Florida, while Arizona hosts Kansas in a key Big 12 matchup.  I'll give an early lean for each game and where I think the line will move closer to tip-off. These are just leans, unless I mention I officially gave out a pick on SportsLine in the analysis.Kansas Jayhawks at Arizona Wildcats \nI bet against Arizona last Saturday on the road at Houston but came away extremely impressed with the Wildcats. I wasn't surprised that they won the game, but rather how they won it. Very few teams push Houston around, but Arizona did in an impressive defensive performance. I expect another defensive grinder this Saturday when Kansas goes to Tucson. Like Arizona, the Jayhawks got a big win over Houston thanks to a defense that held the Cougars to just 56 points on 38% shooting. This game could come down to rebounding. Arizona has a big edge on both the offensive and defensive boards, which is key against a Kansas defense that ranks first in two-point field goal percentage. The Wildcats don't shoot many threes, so second-chance points will be a big factor if the Jayhawks' can't keep Arizona's big front line off the offensive glass. I do believe Kansas can keep this game close, though. It's tough to bet against Arizona at home, although Bill Self's teams typically excel in the underdog role. I expect a lower-scoring game, and if the Jayhawks can limit Arizona's second-chance opportunities, they should stay within the big number. Leans: Kansas +8.5 and Under 147.5Bet the Under in Kansas vs. Arizona at Caesars Sportsbook:Arkansas Razorbacks at Florida Gators\nFlorida is rolling right now. The Gators are 13-1 in their last 14 games, winning 11 of those matchups by double-digits. Florida gets one of its toughest tests of the season on Saturday when Arkansas and its high-flying offense comes to town. The Hogs are playing at a blistering pace and have scored 80+ points in 12 of their 15 SEC games. Led by freshman sensation Darius Acuff (22.2 PPG), Arkansas has four players scoring in double-digits. While the Razorbacks have the SEC's top offense, they will be facing the conference's No. 1 defense. Florida's defense ranks first in the SEC in efficiency, rebounding, and two-point field goal percentage. The bottom line is, it's tough to score on the Gators and when teams miss shots, Florida doesn't allow many second-chance opportunities. Even though the Gators' defense has been impressive in league play, I still like this game to go Over. Todd Golden has shown he will run when teams want to play fast with Florida. The Gators averaged 92 points in five wins over Georgia, Vanderbilt, Alabama, and Texas A&M -- all teams that rank top 80 in tempo.  The total opened at 167.5 and quickly dropped a point but is back up to 167.5. I think it could get down to 164.5 because of Florida's dominant defense. If it goes that low, I might make the Over an official play. I also lean Arkansas at +10.5. I make the line closer to 7.5. Lean: Arkansas +10.5 and Over 167.5Bet the Razorbacks to cover the spread in Arkansas vs. Florida at DraftKings:Gonzaga Bulldogs at St. Mary's Gaels\nThese two teams typically play close games, so I like to take the underdog when the line is high. The first time they met, I played St. Mary's +8.5 and the Gaels just got in under the number, losing, 73-65. That game was closer than the final score suggests. St. Mary's actually led by four at halftime and hung on late for the cover. I expect another tight game this time around, although there isn't nearly as much value taking the Gaels at +1.5. The question is, can St. Mary's shoot better from the perimeter? They were just 6-of-21 (28.6%) in the first meeting. This matchup is pretty even on paper. The biggest edge one team has is St. Mary's at the foul line. The Gaels are the top free throw shooting team in the WCC at 80 percent, while Gonzaga ranks last at 67.8 percent. This was a factor in the first game when St. Mary's went 23-of-25 (92%) from the foul line. The Gaels are undefeated at home this season, and I like that trend to continue on Saturday. Gonzaga is the better overall team, although I love how St. Mary's is playing right now. The Gaels as a slight home dog will likely be an official play for me. Lean: St. Mary's +1.5Bet on the Gaels to cover at home against Gonzaga at DraftKings:\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CBB picks: Expert shares best bets for Saturday's games, including Arkansas-Florida - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/783a4402-78c6-4576-8e86-3289cb8d8639/thumbnail/1200x675/a64d49b8ee6799eaa0a870331560938c/arkansas.jpg"
      ],
      "datePublished": "2026-02-27T21:30:33.000Z",
      "dateModified": "2026-02-27T21:30:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fantasy Football Fallout: Cowboys franchise tag George Pickens - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/fantasy/football/news/cowboys-franchise-tag-george-pickens-2026-fantasy-football-outlook-secure-but-what-about-ceedee-lamb/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/01/01/6bb0ccdd-2a0f-48a4-b774-ef7d8b548fe7/thumbnail/1200x675/bd51d1f11bc1c4957cd2f31bad53d3df/getty-george-pickens-cowboys.jpg",
    "tag": "Sports",
    "date": "2026-02-27T20:22:30.000Z",
    "description": "\n        George Pickens had a career season in his first year in Dallas in 2025. Now, we could get a repeat performance in 2026 after the Cowboys plac",
    "body": "\n        George Pickens had a career season in his first year in Dallas in 2025. Now, we could get a repeat performance in 2026 after the Cowboys placed the non-exclusive franchise tag on Pickens on Friday.Under the non-exclusive franchise tag, Pickens can negotiate with other teams, but Dallas has the right to match any offer. And both sides will still have until mid-July to negotiate a potential multi-year deal, which is something the Cowboys have expressed interest in doing. If no long-term extension is finalized, Pickens will play out the 2026 campaign on a one-year, $28.8 million contract, which is fully guaranteed.We hope this contract situation doesn't get messy and cause Pickens to miss any time in training camp. If he remains with the Cowboys as expected then he has the chance to be a low-end No. 1 Fantasy receiver in all leagues, and he will be worth drafting as early as Round 3.Pickens came to Dallas prior to last season in a trade from Pittsburgh, and it was a fantastic deal for the Cowboys. He had career highs in catches (93), yards (1,429), touchdowns (nine) and targets (137), and he played all 17 games. He averaged a career-best 17.2 PPR points per game, which was No. 6 behind Puka Nacua, Jaxon Smith-Njigba, Ja'Marr Chase, Amon-Ra St. Brown and Rashee Rice.\nPickens had five games with more than 100 yards receiving, and he set a franchise record with five games of at least 130 yards receiving and a touchdown. According to ESPN, his 13 catches of at least 25 yards and 73 first-down receptions ranked in the top five in the NFL.Now, while Pickens was great all season, he was a dominant force when CeeDee Lamb missed three games and the majority of another from Weeks 3-6 with an ankle injury. Pickens scored at least 17.8 PPR points in three of those four games and averaged 24.2 PPR points over that span, with five touchdowns.Pickens staying in Dallas isn't great news for Lamb, who had a down year in 2025. He finished the season with 75 catches for 1,077 yards and three touchdowns on 117 targets in 14 games, and he averaged just 14.4 PPR points per game. It was his lowest reception and yardage total since his rookie season in 2020, and this was the worst touchdown total of his career.\nWe're counting on Lamb to bounce back in 2026, even with Pickens on the roster, and he should be drafted no later than Round 2 in the majority of leagues. But Lamb is no longer in the same tier as Nacua, Smith-Njigba, Chase and St. Brown, and you shouldn't reach for Lamb on Draft Day.Pickens' return is great news for Dak Prescott, who passed for 4,552 yards, 30 touchdowns and 10 interceptions in 2025, along with 177 rushing yards and two touchdowns. He averaged 21.9 Fantasy points per game, which was No. 7 among quarterbacks behind Matthew Stafford, Josh Allen, Drake Maye, Brock Purdy, Patrick Mahomes and Trevor Lawrence.This was the third time in Prescott's career that he passed for at least 4,500 yards and fourth time with at least 30 touchdowns. With his elite duo of receivers back, Prescott is worth drafting as a No. 1 Fantasy quarterback in all leagues with a mid-round pick.\nThe Cowboys have been aggressive so far this offseason by using the franchise tag on Pickens and signing Javonte Williams to a contract extension. Dallas should once again be a standout offense, and we like that as Fantasy managers.We'll continue to monitor the situation for Pickens and if he'll get a long-term contract. As long as he doesn't hold out in training camp, Pickens has the chance to once again be an awesome Fantasy receiver in 2026.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fantasy Football Fallout: Cowboys franchise tag George Pickens - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/01/01/6bb0ccdd-2a0f-48a4-b774-ef7d8b548fe7/thumbnail/1200x675/bd51d1f11bc1c4957cd2f31bad53d3df/getty-george-pickens-cowboys.jpg"
      ],
      "datePublished": "2026-02-27T20:22:30.000Z",
      "dateModified": "2026-02-27T20:22:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Falcons fire assistant coach LaTroy Lewis after sexual assault allegation surfaces - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/nfl/news/falcons-fire-assistant-defensive-line-coach-latroy-lewis/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/e7f73e74-686a-4373-a7b0-148d254ea59f/thumbnail/1200x675/2e0d86d48358a581d37cda094e0d7bf1/falconshelmet.png",
    "tag": "Sports",
    "date": "2026-02-27T19:50:55.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons have fired assistant defensive",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        The Atlanta Falcons have fired assistant defensive line coach LaTroy Lewis after allegations of sexual assault surfaced Friday morning. The team said in a statement Friday morning that it was \"aware of allegations regarding\" Lewis and was \"in the process of gathering information.\" Hours later, the Falcons announced that Lewis had been dismissed from his role. Lewis, 32, was hired by the Falcons under new coach Kevin Stefanski earlier this month after he was the defensive line coach at Toledo during the 2025 season. He previously spent multiple seasons as an assistant at Michigan. The sexual assault allegations stem from his time with the Wolverines, and the Ann Arbor Police Department confirmed to ESPN that it is investigating the claims against Lewis. After a college career at Tennessee, Lewis went undrafted in 2017 before having brief stints with the then-Oakland Raiders, Houston Texans and Tennessee Titans. His playing career ended following one season with the XFL's Houston Roughnecks in 2020. \nLewis broke into coaching at Akron in 2020 as a graduate assistant. He then spent one season at South Alabama and another at Wake Forest before joining then-Michigan coach Jim Harbaugh's staff at Michigan ahead of the 2023 season.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Falcons fire assistant coach LaTroy Lewis after sexual assault allegation surfaces - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/e7f73e74-686a-4373-a7b0-148d254ea59f/thumbnail/1200x675/2e0d86d48358a581d37cda094e0d7bf1/falconshelmet.png"
      ],
      "datePublished": "2026-02-27T19:50:55.000Z",
      "dateModified": "2026-02-27T19:50:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UFC 327 fight card: Jiri Prochazka vs. Carlos Ulberg set to headline Miami event in April - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/ufc/news/ufc-327-fight-card-jiri-prochazka-vs-carlos-ulberg-miami/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/025ffbaf-0d54-449c-8666-92b8bc5ad5a5/thumbnail/1200x675/425f790569b375022b64a2bb0ff2489e/jiri-prochazka-prefight-2025.jpg",
    "tag": "Sports",
    "date": "2026-02-28T04:16:39.000Z",
    "description": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UFC 327 has its main event. Jiri Prochazka and Car",
    "body": "\n    \n    \n                    \n                Getty Images\n            \n            \n    \n        UFC 327 has its main event. Jiri Prochazka and Carlos Ulberg will battle for the vacant light heavyweight championship inside Kaseya Center in Miami on April 11. UFC president and CEO Dana White made the fight official with an announcement on Friday night.The title was vacated by Alex Pereira, who was on his second run as light heavyweight champion after having previously held the middleweight title, in anticipation of a move to the heavyweight division.Prochazka is aiming for his own second stint as champion at 205 pounds, having previously won the title with a win over Glover Teixeira at UFC 275. Prochazka lost the belt in his first defense, suffering a TKO defeat to Pereira. Prochazka then lost a rematch for the title against Pereira two fights later.Prochazka has been perfect in his UFC career outside of the two defeats to Pereira, compiling a 6-2 record in the Octagon with all victories coming via stoppage. He has won back-to-back fights, stopping Jamahal Hill via TKO and then scoring a dramatic comeback knockout of Khalil Rountree Jr. this past October.\nUlberg stumbled in his UFC debut, suffering a knockout loss to Kennedy Nzechukwu. Since that loss, Ulberg has rattled off nine consecutive victories, most recently knocking out Dominick Reyes in a UFC Fight Night main event.\nProchazka and Ulberg sit at No. 2 and 3, respectively, in the official UFC light heavyweight rankings, sitting only behind No. 1 Magomed Ankalaev.Prochazka vs. Ulberg tops a card that also includes a flyweight title defense between champion Joshua Van and challenger Tatsuro Taira.White also announced on Friday that former Bellator two-division champion Patricio Pitbull would return in Miami to take on a familiar name in Aaron Pico as both men spent years with the promotion. The two will meet at featherweight on the prelims. \nHere's how the rest of the card shakes out.UFC 327 fight cardJiri Prochazka vs. Carlos Ulberg, vacant light heavyweight championshipJoshua Van (c)\tvs.\tTatsuro Taira, flyweight championshipCurtis Blaydes\tvs.\tJosh Hokit, heavyweightsBeneil Dariush vs. Manuel Torres, lightweightsDominick Reyes vs. Johnny Walker, light heavyweightsAzamat Murzakanov vs. Paulo Costa, light heavyweightsPatricio Pitbull vs. Aaron Pico, featherweightsMatuesz Gamrot vs. Esteban Ribovics, lightweightsCub Swanson vs. Nate Landwehr, featherweightsKevin Holland\tvs.\tRandy Brown, welterweightsKelvin Gastelum vs. Vicente Luque, welterweightsTatiana Suarez\tvs.\tLoopy Godinez, women's strawweightsKyle Daukaus\tvs.\tVicente Luque, middleweights Christopher Alvidrez vs. Francisco Prado welterweights\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UFC 327 fight card: Jiri Prochazka vs. Carlos Ulberg set to headline Miami event in April - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/025ffbaf-0d54-449c-8666-92b8bc5ad5a5/thumbnail/1200x675/425f790569b375022b64a2bb0ff2489e/jiri-prochazka-prefight-2025.jpg"
      ],
      "datePublished": "2026-02-28T04:16:39.000Z",
      "dateModified": "2026-02-28T04:16:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Finn Balor knows his 'days are numbered' after watching AJ Styles retire - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/wwe/news/finn-balor-aj-styles-retirement-wwe-elimination-chamber/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/26/cdebfaf4-ab5c-48b5-affd-c852da415c95/thumbnail/1200x675/1c507705e30cc2c7f5bf03243c3fc74e/finn-balor-demon-aj-styles-tlc-wwe-elimination-chamber-smackdown-cm-punk-cbs-sports-pro-wrestling-feb-26-2026-v2.jpg",
    "tag": "Sports",
    "date": "2026-02-27T19:28:34.000Z",
    "description": "\n        Professional wrestling is obsessed with singular achievements, especially during WrestleMania season. Superstars chase their \"WrestleMania mo",
    "body": "\n        Professional wrestling is obsessed with singular achievements, especially during WrestleMania season. Superstars chase their \"WrestleMania moment\" and strive to \"finish the story.\" Finn Balor doesn't see it that way. For him, every accomplishment is a thread in a much grander body of work.  This year marks 25 years since Balor's wrestling debut. He may not look it, but he's long in the tooth. The milestone hit harder when his longtime friend and colleague AJ Styles retired ahead of his WWE Hall of Fame induction.\"Seeing AJ retire got me thinking about a lot of things,\" Balor told CBS Sports before Saturday's WWE Elimination Chamber. \"I've always  looked up to AJ. I've always chased his coattails, so to speak. He's  always been the benchmark for what we all strive to be. Seeing him  retire brought it home to me that my days are numbered. AJ has been an  ever-present for me for the last 25 years.\"  Balor will challenge world heavyweight champion CM Punk at Elimination Chamber. The title isn't the only thing at stake. The winner will defend it against Roman Reigns in the main event of WrestleMania 42. Balor is one pinfall away from righting a wrong and securing what many consider the biggest match of his career.  \n\"I have this massive stain on my career from 10 years ago when I got hurt and had to relinquish the universal championship,\" Balor said. \"I've been asked about that in every interview for 10 years. This whole 'what if.'\"Balor couldn't have scripted a better main roster start. In 2016, he defeated Roman Reigns, Kevin Owens and two others in the same night to earn a universal championship match. He became the first person to win a WWE world title in his debut pay-per-view match by dethroning Seth Rollins at SummerSlam. He also suffered a torn labrum that night. His first and only WWE world title reign lasted 22 hours.For 10 years, Balor has revisited that moment in nearly every interview. People remain fixated on what could have been. Since vacating the universal championship, he's won multiple intercontinental and tag team titles, reclaimed the NXT championship and captured the United States title. None of it has erased the stain of that lone world title run.  \n\"It's not like I haven't been trying, but for some reason, people can't  get these 'what ifs' out of their heads,\" Balor said. \"The only way  to fix that is by becoming world champion again.\"  \nBalor might not live in the main event, but he's a constant presence on television. That consistency isn't complacency. It's the product of a drive that's endured for 25 years, regardless of where he's slotted on the card. Headlining Elimination Chamber, and potentially WrestleMania, matters. It just isn't new fuel.\"You can't define your legacy over one match in Belfast, or one moment in Barclays Center, where I got hurt. It's  based on a 25-year career,\" Balor explained. \"It's a body of work that I'm trying to  present. If you look at my body of work, I think it's pretty  accomplished. Sure, I haven't won the world title in 10 years. How many  people have won the Best of the Super Juniors? How many have dominated  in Japan, been successful in Mexico, Europe, and WWE for 10 years?\n\"I try not to worry too much about  feelings in the moment. I try to zoom out and look at the 25 years. Am I  happy with the 25 years? Yes. Has being in the main event reignited a  spark that may have extinguished? No, because the spark never  extinguished. I've always had this burning desire to perform. If that's  in the first match or the last match, once I'm performing, that's what's  important.\"Elimination Chamber isn't about retribution. It's another entry into a rich codex.\"Am I happy with my career?\" Balor asked. \"I would have been happy having one match. My goal when I started training was to have one match. Everything after that was a bonus. Coming to WWE was the most far-fetched idea for a small kid from Ireland. There were no wrestling schools. There was no industry. Nothing.\"\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Finn Balor knows his 'days are numbered' after watching AJ Styles retire - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/26/cdebfaf4-ab5c-48b5-affd-c852da415c95/thumbnail/1200x675/1c507705e30cc2c7f5bf03243c3fc74e/finn-balor-demon-aj-styles-tlc-wwe-elimination-chamber-smackdown-cm-punk-cbs-sports-pro-wrestling-feb-26-2026-v2.jpg"
      ],
      "datePublished": "2026-02-27T19:28:34.000Z",
      "dateModified": "2026-02-27T19:28:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "San Diego State vs. New Mexico  prediction, pick, odds, spread, where to watch live - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/san-diego-state-new-mexico-prediction-pick-odds-spread-where-to-watch-live/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/6fede0ef-7b6c-499d-a5c9-f3467020b631/thumbnail/1200x675/f06d84552f4514e580fe3e94c112ec7f/new-mexico-1.jpg",
    "tag": "Sports",
    "date": "2026-02-27T21:21:49.000Z",
    "description": "\n        The first game of Saturday's CBS Sports doubleheader features a Mountain West showdown as New Mexico hosts San Diego State. It is a rematch o",
    "body": "\n        The first game of Saturday's CBS Sports doubleheader features a Mountain West showdown as New Mexico hosts San Diego State. It is a rematch of an early-season thriller won by San Diego State, 83-79, behind a game-high 21 points from forward Miles Byrd.Despite losing two of its past three games, San Diego State enters the final stretch of the regular season tied atop the Mountain West standings. The Aztecs are coming off an 89-72 win over MWC co-leader Utah State earlier this week. San Diego State is seeking its fourth regular-season title in the past nine seasons.New Mexico is coming off a loss to Nevada and sits one game behind San Diego State and Utah State in the conference race. Before the setback, the Lobos had won three straight.Here is everything you need to know ahead of San Diego State's matchup against New Mexico this weekend.\n\n        \n            \n                Bracketology Bubble Watch: Which teams near the NCAA Tournament cut line need a victory the most?\n                \n                    David Cobb                \n            \n                            \n    \n                \n                    \n    \nSan Diego State vs. New Mexico: Need to knowBracketology implications: In CBS Sports' latest Bracketology projections, San Diego State is a No. 11 seed, while New Mexico is listed among the \"Last Four Out.\" A win would significantly boost the Lobos' NCAA Tournament résumé and ease Selection Sunday pressure. New Mexico is 9-6 against Quad 1 and Quad 2 opponents this season, compared with 7-7 for San Diego State.San Diego State's offense surging: San Diego State is averaging 79.3 points per game — its highest mark since the 1984-85 season. That ranks No. 104 nationally. The Aztecs have three players averaging at least 10 points per game: Miles Byrd, Reese Dixon-Waters and BJ Davis.Mountain West title at stake: San Diego State can clinch at least a share of the Mountain West regular-season title by winning its final three games against New Mexico, Boise State and UNLV. New Mexico can also earn a share by winning out. The Lobos close the regular season against San Diego State, Colorado State and Utah State. The finale against Utah State could determine the MWC champion.\nWhere to watch San Diego State vs. New Mexico liveDate: Saturday, Feb. 28 | Time: 2 p.m. ETLocation: The Pit -- Albuquerque, New MexicoTV: CBS | Live stream: CBSSports.com, CBS Sports AppStreaming on Paramount+ Premium  San Diego State vs. New Mexico prediction, pick\nThe Mountain West race remains wide open with only a few games left, making San Diego State–New Mexico a pivotal matchup on CBS. The Lobos are 3-point favorites, and rightfully so. The Pit should be packed and primed to rattle the visiting Aztecs with the stakes this high. New Mexico, led by Eric Olen, gets its revenge after dropping the first meeting by four points in January. Pick: New Mexico -3 (Kyle Boone)\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            NM -3\n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    Who will win and cover in every college basketball game? Visit SportsLine to get picks from the model that simulates each game 10,000 times and is up more than $1,200 for $100 players on its top-rated spread picks the past six years. \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "San Diego State vs. New Mexico  prediction, pick, odds, spread, where to watch live - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/6fede0ef-7b6c-499d-a5c9-f3467020b631/thumbnail/1200x675/f06d84552f4514e580fe3e94c112ec7f/new-mexico-1.jpg"
      ],
      "datePublished": "2026-02-27T21:21:49.000Z",
      "dateModified": "2026-02-27T21:21:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bracketology Bubble Watch: San Diego State meets New Mexico meet in 'double-bubble' game - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/bracketology-ncaa-tournament-bubble-watch-san-diego-state-new-mexico-march-madness/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/28/3477d4c5-e5aa-46b6-98b6-fb21ff61ae72/thumbnail/1200x675/d3fe5cde730205dc8d0ccf2c0773dc52/sandiegostatebubble.jpg",
    "tag": "Sports",
    "date": "2026-02-28T03:21:48.000Z",
    "description": "\n        The last day of February is packed to the brim with NCAA Tournament bubble intrigue as college basketball's regular season nears its end. Con",
    "body": "\n        The last day of February is packed to the brim with NCAA Tournament bubble intrigue as college basketball's regular season nears its end. Conference tournament action is set to begin in the coming days for a handful of mid-major conferences, and the high-major schools are running short on resume-padding opportunities.Against that backdrop, Saturday is pivotal. It starts with Seton Hall trying to salvage its at-large hopes at UConn and end with Saint Mary's aiming for a final bit of at-large insurance in the late-night window against Gonzaga. In between, there are myriad consequential games that will shape the picture heading into March.Among them are a couple of \"double bubble\" battles, including a showdown between New Mexico and San Diego State on CBS. The Mountain West's bid tally is up in the air, and the results of that one will influence the conference's overall outlook as we creep closer to Selection Sunday.Later on, Texas and Texas A&M square off in a rivalry showdown that carries even greater stakes than usual. With both programs on the bubble under first-year coaches, intensity will be high as the Longhorns look to even the season series with a road win.\nHere is the full rundown of the bubble picture entering Saturday's action.Last Four InCalSanta Clara TCUTexas A&MFirst Four OutNew MexicoOhio State Seton HallVCUNext Four OutIndianaStanfordUSCVirginia TechCheck out the CBS Sports Bracketology model's latest bracket at the Bracketology hub                                All times ET                 Bubble teams in action Saturday\n                            \n    \n                                                \n                    \n    Seton Hallat UConn | 12 p.m. (FS1)Entering the weekend: First Four OutGame status: Quad 1Seton Hall has a lot of ground to make up, but beating UConn on the road would cover a nice chunk of it. This would be one of the 10 best victories posted by anyone in college basketball this season, and it would prove to the selection committee that the Pirates are worthy of a hard look. But if Seton Hall can't pull a mammoth upset, this will likely be the end of the road for the Pirates' at-large aspirations.\n\n                            \n    \n                                                \n                    \n    VCUvs. Fordham | 12:30 p.m. (USA)Entering the weekend: First Four OutGame status: Quad 4The Rams are an interesting case study because the average of their resume metrics is hovering in the mid-40s. Generally speaking, that's fringe at-large territory. But there isn't a single victory a projected at-large team, and VCU is just 4-7 across the top two quadrants. Playing Fordham is a nothing-burger, but it gives VCU a chance to reset the vibes after more than a week off since a disappointing loss to Saint Louis. \n                            \n    \n                                                \n                    \n    Missouriat Mississippi State | 1 p.m. (SEC Network)Entering the weekend: No. 9 seedGame status: Quad 2\nMissouri is the perfect example of why you should like at WAB instead of NET. If all you saw was Missouri's No. 58 NET ranking, you might think the Tigers have no business in the at-large conversation. But with a highly respectable No. 35 WAB ranking, Mizzou is actually in decent shape. Coming off a win over Tennessee -- its fifth Quad 1 win -- Missouri would have to fall hard down the stretch to miss the dance. \n                            \n    \n                                                \n                    \n    Clemsonvs. Louisville | 2 p.m. (ESPN2)Entering the weekend: No. 9 seedGame status: Quad 1Four straight losses have dropped Clemson from the ACC title race into the bubble conversation. At 10-7 across Quads 1 and 2, the Tigers are still OK for now. But facing Louisville and North Carolina (Tuesday on the road) isn't the easiest way to get back on track. Clemson likely needs to win two of its final three games to feel good entering the ACC Tournament.\n\n                            \n    \n                                                \n                    \n    New Mexicovs. San Diego State | 2 p.m. (CBS)Entering the weekend: First Four OutGame status: Quad 2New Mexico dropped onto the wrong side of the bubble following a 67-60 Quad 1 loss at Nevada on Tuesday. The Lobos are hovering around 50th in results-based metrics. They will likely need to be in the mid-40s come Selection Sunday to have a realistic chance at inclusion. Any way you slice it, closing the regular season with a win at Utah State would be huge. But evening the season series with San Diego State would keep the Lobos in position along the cut line.\n                            \n    \n                                                \n                    \n    San Diego Stateat New Mexico | 2 p.m. (CBS)Entering the weekend: No. 11 seed (auto-bid)Game status: Quad 1\nThe Mountain West could get anywhere from 1 to 3 bids, depending on how things play out for San Diego State and New Mexico. The Aztecs are currently \"in\" the CBS Sports Bracketology field as the league's automatic bid recipient. But, from an at-large perspective, they are just 53rd in WAB and have work to do. This game is critical because it's the best game the Aztecs have left in the regular season.\n                            \n    \n                                                \n                    \n    UCLAat Minnesota | 2 p.m. (FS1)Entering the weekend: No. 9 seedGame status: Quad 1Coming off a blowout loss at Michigan State on Feb. 17, the Bruins had dropped three of five games and two straight by a combined margin of 53 points. Things appeared to be going south in a hurry. But consecutive victories over Illinois and USC have restored UCLA's tournament trajectory. If the Bruins win two of three down the stretch, they will likely head to the Big Ten Tournament in a strong position.\n                            \n    \n                                                \n                    \n    Georgiavs. South Carolina | 3:30 p.m. (SEC Network)Entering the weekend: No. 10 seedGame status: Quad 3\nGeorgia is in good shape, but a loss here would change that. Falling at home to a bad South Carolina team would bring an estimated WAB hit of roughly 0.80, which would translate to a 5-7 spot drop in WAB ranking. That would put Georgia in the low-to-mid 40s, which is close to the likely cut line. But if the Bulldogs take care of business against a team they should beat, they'll head into the final week of the regular season on solid footing.\n                            \n    \n                                                \n                    \n    USCvs. Nebraska | 4 p.m. (Big Ten Network)Entering the weekend: Next Four OutGame status: Quad 1It might feel like USC is a lost cause amid a four-game losing streak. But the Trojans have consecutive Quad 1 opportunities ahead, starting Saturday against Nebraska. If they close on a three-game winning streak -- or win 2 of 3 and get some favorable results from other bubble teams -- they could still head to the Big Ten Tournament with some at-large pulse. Pulling that off is going to require some rapid improvement, though, because this team is flunking the eye test.\n\n                            \n    \n                                                \n                    \n    Californiavs. Pitt | 4 p.m. (ACC Network)Entering the weekend: Last Four InGame status: Quad 3Playing lowly Pitt at home is nothing but a landmine for Cal. It's a no-reward, high-risk proposition, and the Bears better be ready. With wins over four projected tournament teams (UCLA, North Carolina, Miami and SMU), Cal is looking good from a resume perspective. That would change quickly if the Bears slip up against the Panthers.\n                            \n    \n                                                \n                    \n    Texasat Texas A&M | 4 p.m. (ESPN2)Entering the weekend: No. 10 seedGame status: Quad 1\nTexas had Florida on the ropes until the final seven minutes on Wednesday. That's when the Gators mashed the gas pedal, showing their elite gear and leaving the Longhorns in the dust. Missing out on a potential resume-defining win was a bummer. Still, Texas should have no problem flushing that and getting up for Texas A&M. After losing its first meeting with the Aggies at home back on Jan. 17, Texas will be out for revenge in a high-intensity \"double bubble\" battle.  \n                            \n    \n                                                \n                    \n    Texas A&Mvs. Texas | 4 p.m. (ESPN2)Entering the weekend: Last Four InGame status: Quad 2Seeing Bucky McMillan's high-octane system back in the NCAA Tournament would be entertaining. Remember, his Samford team took Kansas down to the wire during a 2024 first-round game. Now in his first season with the Aggies, McMillan has more talent. But he still needs a couple more wins to feel safe after A&M struggled through a four-game losing skid to open February. \n\n                            \n    \n                                                \n                    \n    TCUat Kansas State | 6:30 p.m. (ESPN2)Entering the weekend: Last Four InGame status: Quad 2TCU has won five of its past six games to reach 18-10 (8-7 Big 12) heading into the weekend. The Horned Frogs own a resume that is all over the map. It includes wins over Florida, Wisconsin and Iowa State but losses to Notre Dame, Utah and Colorado. The demonstrated ability to beat high-caliber opposition bodes well for Jamie Dixon's club in the selection discussion, but the Horned Frogs need to win two of three down the stretch.\n                            \n    \n                                                \n                    \n    Santa Claravs. Oregon State | 8 p.m. (CBS Sports Network)Entering the weekend: Last Four InGame status: Quad 4Santa Clara lost at home to Gonzaga on Feb. 14 and fell at Saint Mary's on Wednesday. The Gaels needed to win one of those two games to feel safe-ish. Now they have to take care of business against Oregon State and then gear up for a potentially tense WCC Tournament. Beating the Zags or Gaels on a neutral floor would be significant for a Santa Clara team that is 1-5 in Quad 1.\n                            \n    \n                                                \n                    \n    Auburnvs. Ole Miss | 8:30 p.m. (SEC Network)Entering the weekend: No. 10 seedGame status: Quad 3Generally speaking, a Quad 3 game this time of year is nothing but a needless risk for a team on the bubble. But in Auburn's case, hosting Ole Miss could be viewed as a welcome reprieve. After a stretch of six losses in seven games, Auburn just needs wins. Ole Miss is limping in on a 10-game losing streak, which should allow the Tigers to regain their footing.\n                            \n    \n                                                \n                    \n    Virginia Techat North Carolina | 8:30 p.m. (ESPN2)Entering the weekend: Next Four OutGame status: Quad 1Virginia Tech fans who have seen their team drop four of its past six games might wonder why the Hokies are still showing up in a bubble watch. But beating North Carolina on the road would send Virginia Tech surging back toward the cut line, as it would bring a projected 5-8 spot rise in WAB ranking for the Hokies. A season-ending road game at Virginia is also a big opportunity. It'll take a big upset or two, but the Hokies aren't dead yet.\n                            \n    \n                                                \n                    \n    Saint Mary'svs. Gonzaga | 10:30 p.m. (ESPN)Entering the weekend: No. 10 seedGame status: Quad 1Saint Mary's averages out as a top-30 team across both results-based and predictive metrics looked at by the selection committee. But while the Gaels are 8-1 in Quad 2, they remain winless in Quad 1. Wednesday night's 86-67 home win over Santa Clara was the best win of the season for the Gaels, which is a little concerning. Toppling Gonzaga one last time before the Bulldogs leave for the Pac-12 would make for some great insurance. Bubble teams in action Sunday\n                            \n    \n                                                \n                    \n    Ohio Statevs. No. 8 Purdue | 1:30 p.m. (CBS)Entering the weekend: First Four OutGame status: Quad 1Ohio State got second-leading scorer John Mobley Jr. back from a three-game injury absence, but the Buckeyes looked flat anyway during a 74-57 loss at Iowa on Wednesday. That was the Buckeyes' last chance to beat an at-large team in a true road environment, and they flunked it. Hosting Purdue marks Ohio State's last guaranteed opportunity to make any sort of statement.\n                            \n    \n                                                \n                    \n    Indianavs. No. 13 Michigan State | 3:45 p.m. (ESPN)Entering the weekend: Next Four OutGame status: Quad 1Indiana's combined total of four victories across Quad 1 and Quad 2 is the fewest of any high-major team in the top 60 of the NET. That's the bad news. The good news is that IU has wins over projected tournament teams Purdue, UCLA and Wisconsin. There are several different ways to interpret this resume, but the Hoosiers desperately need to stop the bleeding after dropping three straight.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bracketology Bubble Watch: San Diego State meets New Mexico meet in 'double-bubble' game - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/28/3477d4c5-e5aa-46b6-98b6-fb21ff61ae72/thumbnail/1200x675/d3fe5cde730205dc8d0ccf2c0773dc52/sandiegostatebubble.jpg"
      ],
      "datePublished": "2026-02-28T03:21:48.000Z",
      "dateModified": "2026-02-28T03:21:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "College basketball expert picks for Saturday's loaded Top 25 slate - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/college-basketball-picks-predictions-odds-top-25-games-saturday-duke-virginia-kansas-arizona/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/4260d08e-b4ee-4e5a-a68d-36e81676fd84/thumbnail/1200x675/cdfeef0042457e924dc9c29fd69d23aa/arizona-kansas.png",
    "tag": "Sports",
    "date": "2026-02-27T21:22:48.000Z",
    "description": "\n        The penultimate weekend of college basketball's regular season is upon us, replete with conference-shaping showdowns in the Big 12, ACC and S",
    "body": "\n        The penultimate weekend of college basketball's regular season is upon us, replete with conference-shaping showdowns in the Big 12, ACC and SEC, along with Gonzaga's final regular-season game as a member of the WCC (in a game that will determine the league's champion). Please prepare your body accordingly.Saturday's slate is particularly packed, beginning with a noon ET tip between No. 1 Duke and No. 11 Virginia. We also have a handful of afternoon tips worth watching, which include No. 2 Arizona and No. 14 Kansas in Tucson and No. 4 Iowa State and No. 16 Texas Tech.In the evening window, No. 7 Florida can assert itself as the king of the SEC as No. 20 Arkansas comes to Gainesville with the Gators up two games in the conference standings. We also have the aforementioned Gonzaga game to watch for -- a 10:30 p.m. ET tip! -- as it travels to face Saint Mary's for a chance to win the league.Our team of experts has picks for every major game below straight up and against the spread.\nOdds via DraftKings Sportsbook | All times ET              No. 11 Virginia at No. 1 Duke\n12 p.m. on ESPN, fuboTV (try for free): Duke is coming off a game in which it blasted Notre Dame by 44 points -- and it did so just three days removed from downing the then-No. 1 Michigan Wolverines on a neutral court. It's hard to pick against this Blue Devils team. So I won't. But Virginia, winners of nine straight, is equipped to keep this one close, even inside Cameron Indoor. I'd take the points here with UVA and expect Ryan Odom's team to play Duke tight in an eventual Duke win. Pick: Virginia +9.5 (Boone)       \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            DUKE -10\n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Virginia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Virginia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Virginia\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Virginia\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Duke\n                    \n    \n    San Diego State vs. New Mexico\n2 p.m. on CBS, CBSSports.com, CBS Sports App, Paramount+ Premium: The MWC remains wide open with a few games remaining, setting SDSU-New Mexico to be a pivotal one on CBS. The Lobos are favored here by three, and I think rightfully so. The Pit will be packed and ready to apply pressure to the visiting Aztecs, with the stakes high. New Mexico and Eric Olen's team take this one after losing the first game of the series in January by four. Pick: New Mexico -3 (Boone)\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            NM -3\n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            San Diego St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            New Mexico\n                    \n    \n       No. 16 Texas Tech vs. No. 4 Iowa State\n4 p.m. on Fox, fuboTV (try for free): No team has won inside Hilton Coliseum this season aside from Iowa State, and despite how well Texas Tech has played of late, I don't think that fact changes. I do think, however, that the Christian Anderson-led Red Raiders can give the Cyclones a real push. Anderson is coming off 21- and 31-point outings in TTU wins, and he is positioned to potentially keep this one close vs. an ISU team that won two of its last three home games by a single possession. Pick: Texas Tech +7 (Boone)       \n\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            ISU -7\n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Texas Tech\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Iowa St.\n                    \n    \n             No. 14 Kansas vs. No. 2 Arizona                      \n4 p.m. on ESPN, fuboTV (try for free): Kansas downed Arizona three weeks ago in Lawrence and is coming off a 69-56 home win over top-five Houston. But, in between that, the Jayhawks have losses by 18 to Iowa State and Cincinnati and a road win over NIT-bound Oklahoma State. Arizona can make inconsistent teams pay with consistency. I think they do that on Saturday. Pick: Arizona -10 (Boone)     \n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            ZONA -10\n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Kansas\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arizona\n                    \n    \n       No. 17 Alabama vs. No. 22 Tennessee\n6 p.m. on ESPN, fuboTV (try for free): Alabama has won seven straight and faces its toughest test in that stretch with a road trip to Tennessee. The Vols have been up and down in SEC play, but more up than down -- and near-perfect at home. I'll take the home team as the narrow favorite to win a close one. Pick: Alabama +4 (Boone)\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            TENN -4\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Tennessee\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Tennessee\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Tennessee\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Alabama\n                    \n    \n    No. 20 Arkansas vs. No. 7 Florida\n4 p.m. on ESPN, fuboTV (try for free): All but one of us on our team is taking Arkansas to cover the spread and Florida to win. So we're expecting the Razorbacks to keep it within a respectable number. Darius Acuff Jr. has looked like one of the sport's biggest stars the last couple of weeks, and his prolific scoring prowess keeps Arkansas in a close one that Florida eventually takes. Pick: Arkansas +8 (Boone)\n\n                    \n    \n                                            \n                    \n                                    Gary Parrish\n                            \n            \n                    \n    \n                                            \n                    \n                                    Matt Norlander\n                            \n            \n                    \n    \n                                            \n                    \n                                    Kyle Boone\n                            \n            \n                    \n    \n                                            \n                    \n                                    David Cobb\n                            \n            \n                    \n    \n                                            \n                    \n                                    Isaac Trotter\n                            \n            \n                    \n    \n                                            \n                    \n                                    Cameron Salerno\n                            \n            UF -8\n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Arkansas\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    STRAIGHT-UP\n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n                            \n    \n                                                \n                    \n    \n        \n                            Florida\n                    \n    \n    \n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "College basketball expert picks for Saturday's loaded Top 25 slate - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/4260d08e-b4ee-4e5a-a68d-36e81676fd84/thumbnail/1200x675/cdfeef0042457e924dc9c29fd69d23aa/arizona-kansas.png"
      ],
      "datePublished": "2026-02-27T21:22:48.000Z",
      "dateModified": "2026-02-27T21:22:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miami (Ohio) beats Western Michigan on last-second shot to remain undefeated - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/college-basketball/news/miami-ohio-college-basketball-undefeated-western-michigan/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/28/1a43d9f6-9c77-4b78-8818-900637955379/thumbnail/1200x675/f27e35cb0c3662154ae768bbb3f79137/trey-perry-miami-ohio-winner-cbs-screenshot.jpg",
    "tag": "Sports",
    "date": "2026-02-28T03:27:45.000Z",
    "description": "\n    \n    \n                    \n                CBS Sports screenshot\n            \n            \n    \n        Miami (Ohio) advanced to 29-0 in dramatic",
    "body": "\n    \n    \n                    \n                CBS Sports screenshot\n            \n            \n    \n        Miami (Ohio) advanced to 29-0 in dramatic fashion on Friday night, as Trey Perry lifted the RedHawks to a 69-67 win at Western Michigan with a game-winning layup in the final second. The win brings Miami within two victories of completing a perfect regular season.It took everything the RedHawks could muster amid adverse circumstances on the road to avoid what would have been a potentially devastating Quad 4 loss. Miami didn't earn its first lead of the second half until the 1:45 mark as it navigated life without two stars. Leading scorer Peter Suder fouled out with 7:03 remaining and the RedHawks down 57-50. He had 18 points on 7 of 13 shooting, and his departure after just 27 minutes of playing time left the RedHawks in a bind. The Redhawks also played without starting point guard Luke Skaljac due to injury. But when the pressure was on, Miami demonstrated the clutch gene that has been part of its DNA all season. Perry finished with 14 points on 6 of 8 shooting. Almar Atlason added 16 points, including 12 in the second half. His 4-point play with 3:26 remaining sliced a 5-point deficit to just one.\nMiami entered as an 11.5-point favorite but struggled from the jump as Western Michigan built a 6-point lead in the opening minutes. WMU closed the first half on a 7-0 run as Miami coach Travis Steele began to take exception with the officiating.\nHe ultimately received a technical foul and went to the locker in a fit of rage. Western Michigan then built a 9-point lead before Miami figured out a way to claw back and keep its storybook start alive. The RedHawks close the regular season next week against Toledo and Ohio as they seek to become the first team since Gonzaga in 2021 to finish the regular season unbeaten.\n            \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miami (Ohio) beats Western Michigan on last-second shot to remain undefeated - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/28/1a43d9f6-9c77-4b78-8818-900637955379/thumbnail/1200x675/f27e35cb0c3662154ae768bbb3f79137/trey-perry-miami-ohio-winner-cbs-screenshot.jpg"
      ],
      "datePublished": "2026-02-28T03:27:45.000Z",
      "dateModified": "2026-02-28T03:27:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Today's top games to watch, best bets: No. 3 Michigan at No. 10 Illinois, NBA and more - CBS Sports",
    "url": "\n                                                https://www.cbssports.com/betting/news/todays-top-games-to-watch-best-bets-odds-no-3-michigan-at-no-10-illinois-nuggets-at-thunder-and-more/\n                    ",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/65b181f9-9fb4-4922-8ea1-b9982c06209e/thumbnail/1200x675/ed57c0325c06efb5c8918adcf658b740/michigan.jpg",
    "tag": "Sports",
    "date": "2026-02-27T21:01:18.000Z",
    "description": "\nFlash back to Jan. 10, 2019. Brad Underwood was in just his second season as coach of the Fighting Illini. John Beilein was in his final season as co",
    "body": "\nFlash back to Jan. 10, 2019. Brad Underwood was in just his second season as coach of the Fighting Illini. John Beilein was in his final season as coach of the Wolverines, and Illinois and Michigan were led in scoring by — wait for it — Ignas Brazdeikis and Trent Frazier, respectively.The second-ranked Wolverines beat the Illini, 79-69, that night in Champaign, Ill. That is noteworthy because that is the last time Michigan has beaten Illinois in men's basketball.The Illinois Fighting Illini have won nine in a row against the Michigan Wolverines, and it is with that backdrop that No. 3 Michigan and No. 10 Illinois meet tonight at the State Farm Center in Champaign. If the Wolverines (26-2, 16-1 in Big Ten) can stop the nine-game losing streak, they would clinch the outright conference regular season title. They are coming off a 77-67 victory over Minnesota on Tuesday.Meanwhile, the Illini (22-6, 13-4) are looking to bounce back from a 95-94 overtime loss at UCLA on Saturday. The team sits in a three-way tie for second in the Big Ten, with Michigan State and Nebraska. Michigan is a slight 1.5-point favorite over Illinois on Friday.While Wolverines vs. Illini is the marquee attraction on Friday, there are other options on a sporting landscape that includes five NBA games and a partial college basketball schedule. Below is a snapshot of what to watch and bet for Friday, Feb. 27. All times Eastern.College basketball best bets, where to watchNo. 3 Michigan at No. 10 IllinoisTime: 8 p.m. | Location: Champaign, Ill. | TV: FOX | Stream: Fubo (Try for free)SportsLine picks -- Model: Illinois +1.5 | Expert: Illinois -105 (Chip Patterson)\nAs Duke showed last weekend, the Wolverines are not unbeatable. The Blue Devils knocked off then No. 1-ranked Michigan by controlling the boards and preventing second shots, outrebounding the Wolverines 41-28. That bodes well for Illinois, which ranks sixth in the country in rebound margin (10.6 rebounds per game). The SportsLine Projection Model, which simulates every game 10,000 times, says the Illini have a 75.0% chance to cover and assigns a B grade to Illinois +1.5. Meanwhile Patterson notes that Illinois hasn't had a game since blowing a 23-point lead in an overtime loss at UCLA last Saturday. \"So while Michigan had a bit of a palate-cleanser from the Duke game with its win against Minnesota at home, I think the Illini are going to be breathing fire,\" he says.NBA best bets, where to watchCavaliers at PistonsTime: 7 p.m. | Location: Detroit | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Detroit -5.5\nTwo Eastern Conference contenders collide when the Detroit Pistons and Cleveland Cavaliers battle at Little Caesars Arena. The Pistons (43-14) lead the East by 5.5 games over the Celtics, while the Cavaliers (37-23) sit in fourth. But Cleveland is actually the +280 betting favorite at DraftKings to win the conference, ahead of Boston (+310) and Detroit (+360). On Friday, however, the Cavaliers will be without All-Star guard Donovan Mitchell, who has a right groin strain. The SportsLine Projection Model says the Pistons have a 52.0% chance to cover and gives a C grade to Detroit -5.5.Nuggets at ThunderTime: 9:30 p.m. | Location: Oklahoma City | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Nuggets +8 | Expert: Nikola Jokic Under 52.5 Points + Assists + Rebounds -121 (Matt Severance)\nWhom do you have for NBA MVP? Shai Gilgeous-Alexander or Nikola Jokic? Gilgeous-Alexander, the reigning MVP, is the -250 favorite at DraftKings, while three-time MVP Jokic is the +425 second choice. On Friday they will go head-to-head when Gilgeous-Alexander and the Oklahoma City Thunder host Jokic and the Denver Nuggets. The game will be the first since Feb. 3 for Gilgeous-Alexander, who has missed the last nine games with an abdominal strain. The SportsLine Projection Model says the Nuggets have a 51.0% chance to cover and assigns a C grade to Denver +8. Meanwhile, Severance notes that Jokic had \"just\" 31 total points, rebounds and assists in his lone game against Oklahoma City this season. \"Jokic could go 30/10/10 and we still win fairly easily,\" he says.Looking aheadCollege basketball: No. 14 Kansas at No. 2 ArizonaTime: 4 p.m. Saturday | Location: Tucson, Ariz. | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Arizona -8.5\nThe first meeting this season between these two teams was one of college basketball's games of the year. In a raucous environment at Allen Fieldhouse, the Jayhawks gave the No. 1 Wildcats their first loss of the season, 82-78. Kansas pulled the upset despite playing without presumptive No. 1 overall pick Darryn Peterson, whose mysterious absences from games this season have been well documented. He, however, has finished back-to-back games now for the Jayhawks (21-7, 11-4 in Big 12). Speaking of absences, Arizona stud freshman Koa Peat is getting closer to a return and could be back in the lineup on Saturday for the Wildcats (26-2, 13-2). The SportsLine Projection Model says there's a 55.0% chance Arizona covers and gives a C grade to Wildcats -8.5.No. 20 Arkansas at No. 7 FloridaTime: 8:30 p.m. Saturday | Location: Gainesville, Fla. | TV: ESPN | Stream: Fubo (Try for free)SportsLine picks -- Model: Arkansas +9.5 | Expert: Over 166.5 (Thomas Casale)\nTwo of the top teams in the SEC collide when the Florida Gators host the Arkansas Razorbacks at the O'Connell Center. The Gators (22-6, 13-2 in SEC) lead the conference by two games over the Razorbacks (21-7, 11-4) and Alabama, and they can clinch the outright regular season title with a win and a Crimson Tide loss at Tennessee on Saturday. But Arkansas has one of the most efficient offenses in the country. Led by freshman Darius Acuff, the Razorbacks average 128.6 points per 100 possessions according to KenPom, which ranks fourth in the nation. The SportsLine Projection Model says there's a 52.0% chance Arkansas covers and assigns a C grade to Razorbacks +9.5. Meanwhile, Casale likes that Arkansas plays at a fast tempo (28th in the country). \"The Gators averaged 92 points in wins over Georgia, Vanderbilt, Alabama and Texas A&M — all teams that rank top 80 in tempo,\" he says.\n            ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today's top games to watch, best bets: No. 3 Michigan at No. 10 Illinois, NBA and more - CBS Sports",
      "image": [
        "https://sportshub.cbsistatic.com/i/r/2026/02/27/65b181f9-9fb4-4922-8ea1-b9982c06209e/thumbnail/1200x675/ed57c0325c06efb5c8918adcf658b740/michigan.jpg"
      ],
      "datePublished": "2026-02-27T21:01:18.000Z",
      "dateModified": "2026-02-27T21:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]