[
  {
    "title": "Apple might take a new approach to announcing its next products",
    "url": "https://techcrunch.com/2026/02/22/apple-might-take-a-new-approach-to-announcing-its-next-products/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/iphone-17-air-pro-apple.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T23:08:08.000Z",
    "description": "Apple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company’s standard press event. Bloomberg’s Mark Gurman reports that instead of...",
    "body": "\nApple has invited the tech press to a “special Apple experience” on March 4, but it might unfold a bit differently than the company’s standard press event.\nBloomberg’s Mark Gurman reports that instead of announcing everything at a single keynote, Apple is planning a “three-day flurry of announcements” — presumably announced online, and culminating in the March 4 “experience” that will consist of be three events in New York, London, and Shanghai, where the press will be offered a chance to get hands-on with the upcoming products.\nSimilarly, Daring Fireball’s John Gruber speculated that the experience could be “a hands-on thing with in-person demos.”\nApple will reportedly be announcing at least five new products during that time, including a low-cost MacBook. Other reported possibilities: the iPhone 17e, an iPad Air with an M4 chip, a new entry-level iPad, and an upgraded MacBook Air and new MacBook Pro models. Gurman said all of those products are due this spring, but he sounded less certain about which ones will be announced when.\n"
  },
  {
    "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
    "url": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-2174641784.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T17:41:27.000Z",
    "description": "In Brief Posted: 9:41 AM PST · February 21, 2026  Image Credits:Tomohiro Ohsumi / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Microsoft announced a major gaming shakeup on Friday, with Microsoft...",
    "body": "\nIn Brief\nPosted:\n9:41 AM PST · February 21, 2026\n\nImage Credits:Tomohiro Ohsumi / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMicrosoft announced a major gaming shakeup on Friday, with Microsoft Gaming CEO Phil Spencer departing the company, along with Xbox President Sarah Bond.\nSpencer will be replaced by former Instacart and Meta executive Asha Sharma. With Sharma’s most recent role as the president of Microsoft’s CoreAI product, these moves suggest that Microsoft might be doubling down on bringing AI into video games.\nThe company had already been experimenting with ways to combine AI and gaming, for example developing an AI gaming companion and releasing a buggy, AI-generated level from “Quake II.” \nIndeed, in an internal memo published by The Verge, Sharma wrote that Microsoft “will invent new business models and new ways to play” and said that “monetization and AI” will both “evolve and influence this future.” At the same time, she said that the company “will not chase short-term efficiency or flood our ecosystem with soulless AI slop.”\n“Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us,” Sharma added.\nThat’s just one of three “commitments” Sharma made in her memo. The others involve building “great games beloved by players” and prioritizing Xbox.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Media & Entertainment\n\n"
  },
  {
    "title": "OpenAI debated calling police about suspected Canadian shooter’s chats",
    "url": "https://techcrunch.com/2026/02/21/openai-debated-calling-police-about-suspected-canadian-shooters-chats/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T15:25:44.000Z",
    "description": "In Brief Posted: 7:25 AM PST · February 21, 2026  Image Credits:Silas Stein/picture alliance / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  An 18-year-old who allegedly killed eight people in a...",
    "body": "\nIn Brief\nPosted:\n7:25 AM PST · February 21, 2026\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAn 18-year-old who allegedly killed eight people in a mass shooting in Tumbler Ridge, Canada, reportedly used OpenAI’s ChatGPT in ways that alarmed the company’s staff.\nJesse Van Rootselaar’s chats describing gun violence were flagged by tools that monitor the company’s LLM for misuse and banned in June 2025. \nStaff at the company debated whether or not to reach out to Canadian law enforcement over the behavior but ultimately did not, according to the Wall Street Journal. An OpenAI spokesperson said Van Rootselaar’s activity did not meet the criteria for reporting to law enforcement; the company reached out to Canadian authorities after the incident.\n“Our thoughts are with everyone affected by the Tumbler Ridge tragedy,” an OpenAI spokesperson said in a statement. “We proactively reached out to the Royal Canadian Mounted Police with information on the individual and their use of ChatGPT, and we’ll continue to support their investigation.”\nChatGPT transcripts weren’t the only concerning part of Van Rootselaar’s digital footprint. She apparently created a game on Roblox, the world simulation platform frequented by children, which simulated a mass shooting at a mall. She also posted about guns on Reddit. \nVan Rootselaar’s instability was also known to local police, who had been called to her family’s home after she started a fire while under the influence of unspecified drugs.\nLLM chatbots built by OpenAI and its competitors have been accused of triggering mental breakdowns in users who lose grip on reality while conversing with digital models. Multiple lawsuits have been filed that cite chat transcripts that encourage people to commit suicide or offer assistance in doing so.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIf you are in a crisis or having thoughts of suicide, call or text 988 to reach the 988 Suicide and Crisis Lifeline.\nThis post has been updated with comment from OpenAI.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n"
  },
  {
    "title": "Wispr Flow launches an Android app for AI-powered dictation",
    "url": "https://techcrunch.com/2026/02/23/wispr-flow-launches-an-android-app-for-ai-powered-dictation/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Wispr-Flow-Android-hero.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-23T08:01:00.000Z",
    "description": "AI-powered dictation startup Wispr Flow has launched its Android app today. The company released its app for Mac and Windows first, then launched on iOS in June 2025. On iOS, users could use Wispr Flow...",
    "body": "\nAI-powered dictation startup Wispr Flow has launched its Android app today. The company released its app for Mac and Windows first, then launched on iOS in June 2025.\nOn iOS, users could use Wispr Flow through a dedicated keyboard. On Android, the interface is a bit different, as you can access the dictionary through a floating bubble. You can hold the bubble and dictate, or press once to start, and then press the close button to stop the process. Just like on other platforms, in addition to dictation, the app cleans up the filter words and also formats the text based on the context of the app and spoken content.\n“Android finally gave us the freedom to build the voice experience we always wanted. Only when the platform gets out of the way can we truly expect voice to replace typing on mobile,” Tanay Kothari, co-founder and CEO of the startup, said. \nThe app can support translation in over 100 languages and can work across other apps. Along with the Android app release, Wispr Flow said that it has done an infrastructure rewrite that makes dictation 30% faster than before. \n\nLoading the player…\n\nWhile there are tons of AI-powered dictation apps available on desktop and iOS, Wispr Flow is one of the few available on Android with this launch, besides Typeless, which launched an app for the platform last month. \nWhat’s more, the company has also released a new model for Hinglish, a mix of Hindi and English, for people in India who speak in mix-coded way. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“If you’re someone like me, English and Hindi weave together when I’m chatting with family and colleagues back home. This is one of those times when I just had to build something for me: the first voice model to actually support transcription in Hinglish instead of traditional Hindi script,” Kothari said.\nImage Credits: Wispr Flow\nThe company noted that even with early rollout to select users, users have spoken over 1.3 million words in English in the last few days.\nWispr Flow has been one of the more popular startups in the category of AI-powered dictation apps that have also attracted significant venture capital attention. In June, the startup raised $30 million in funding led by Menlo Ventures in June. Within a few months, in November, the company secured $25 million in a round led by Notable Capital. Wispr Flow has raised $81 million in total, with its last round valued at $700 million according to sources. \n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The creator economy’s ad revenue problem and India’s AI ambitions",
    "url": "https://techcrunch.com/video/the-creator-economys-ad-revenue-problem-and-indias-ai-ambitions/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/modi-openai-anthropic-2261854815.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T23:00:00.000Z",
    "description": "The creator economy is evolving fast, and ad revenue alone isn't cutting it anymore. YouTubers are launching product lines, acquiring startups, and building actual business empires. Even MrBeast's company bought fintech startup Step, and his chocolate business is outearning his media arm. This isn't just one creator's strategy. It's the new playbook. On this episode of TechCrunch's Equity podcast, hosts Kirsten Korosec, Anthony Ha, and Rebecca Bellan unpack how creators are diversifying beyond ads, whether their model can scale beyond the top 1%, everything happing at India's AI Impact Summit, and more of the week's headlines. Chapters: 00:00 Intro 00:48 Upcoming TechCrunch events: Startup Battlefield 200 and Founders Summit Boston 03:06 Date Drop raises millions to fix college dating 09:25 Heron Power raises $140M for solid-state transformers 14:13 Inside India's AI Impact Summit 19:44 India's first AI IPO flops on public markets 22:19 MrBeast buys fintech startup Step and the evolving creator economy 27:14 ByteDance's Seadance 2.0 30:59 Outro Subscribe to Equity on YouTube, Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.",
    "body": "\n\t\t\n\nLoading the player…\n\nThe creator economy is evolving fast, and ad revenue alone isn’t cutting it anymore. YouTubers are launching product lines, acquiring startups, and building actual business empires. In fact, MrBeast’s company bought fintech startup Step, and his chocolate business is outearning his media arm. This isn’t just one creator’s strategy. For many, it’s the new playbook. \nOn this episode of TechCrunch’s Equity podcast, hosts Kirsten Korosec, Anthony Ha, and Rebecca Bellan unpack how creators are diversifying beyond ads, whether their model can scale beyond the top 1%, everything happing at India’s AI Impact Summit, and more of the week’s headlines.\n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n"
  },
  {
    "title": "Sam Altman would like to remind you that humans use a lot of energy, too",
    "url": "https://techcrunch.com/2026/02/21/sam-altman-would-like-remind-you-that-humans-use-a-lot-of-energy-too/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198353376.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T21:38:01.000Z",
    "description": "OpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week while speaking at an event hosted by The Indian Express. For one thing, Altman — who was in India for a major AI summit —...",
    "body": "\nOpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week while speaking at an event hosted by The Indian Express.\nFor one thing, Altman — who was in India for a major AI summit — said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real issue when “we used to do evaporative cooling in data centers.”\n“Now that we don’t do that, you see these things on the internet where, ‘Don’t use ChatGPT, it’s 17 gallons of water for each query’ or whatever,” Altman said. “This is completely untrue, totally insane, no connection to reality.”\nHe added that it’s “fair” to be concerned about “the energy consumption — not per query, but in total, because the world is now using so much AI.” In his view, this means the world needs to “move towards nuclear or wind and solar very quickly.”\nThere’s no legal requirement for tech companies to disclose how much energy and water they use, so scientists have been trying to study it independently. Data centers have also been connected to rising electricity prices.\nCiting a previous conversation with Bill Gates, the interviewer asked whether it’s accurate to say a single ChatGPT query currently uses the equivalent of 1.5 iPhone battery charges, to which Altman replied, “There’s no way it’s anything close to that much.”\nAltman also complained that many discussions about ChatGPT’s energy usage are “unfair,” especially when they focus on “how much energy it takes to train an AI model, relative to how much it costs a human to do one inference query.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart. And not only that, it took the very widespread evolution of the 100 billion people that have ever lived and learned not to get eaten by predators and learned how to figure out science and whatever, to produce you.”\nSo in his view, the fair comparison is, “If you ask ChatGPT a question, how much energy does it take once its model is trained to answer that question versus a human? And probably, AI has already caught up on an energy efficiency basis, measured that way.”\nYou can watch the full interview below. The conversation about water and energy usage begins at around 26:35.\n\n\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Wikipedia blacklists Archive.today after alleged DDoS attack",
    "url": "https://techcrunch.com/2026/02/21/wikipedia-blacklists-archive-today-after-alleged-ddos-attack/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T20:20:15.000Z",
    "description": "Wikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.",
    "body": "\nWikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\nArchive.today — which also operates under several other domain names, including archive.is and archive.ph — is perhaps most widely used to access content that’s otherwise inaccessible behind paywalls. That also makes it useful as a source for Wikipedia citations.\nHowever, according to the Wikipedia discussion page about this topic, “There is consensus to immediately deprecate archive.today, and, as soon as practicable, add it to the spam blacklist […] and to forthwith remove all links to it.” (Ars Technica first reported on the decision.)\nThe discussion page says that Archive.today was previously blacklisted in 2013, only to be removed from the blacklist in 2016.\nWhy reverse course again? Because, the discussion page says, “Wikipedia should not direct its readers towards a website that hijacks users’ computers to run a DDoS attack.” Plus, “evidence has been presented that archive.today’s operators have altered the content of archived pages, rendering it unreliable.”\nThe distributed denial of service (DDoS) attack in question was allegedly directed at blogger Jani Patokallio. Patokallio wrote that beginning on January 11, users who loaded the archive’s CAPTCHA page have been unknowingly loading and executing JavaScript that sends a search request to his Gyrovague blog, in an apparent attempt to get Patokallio’s attention and increase his hosting bill.\nBack in 2023, Patokallio published a blog post examining Archive.today, whose ownership he described as “an opaque mystery.” And while he wasn’t able to track down a specific owner, he concluded the site was likely “a one-person labor of love, operated by a Russian of considerable talent and access to Europe.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMore recently, Patokallio said the webmaster at Archive.today asked him to take the post down for two or three months.\n“I do not mind the post, but the issue is: journos from mainstream media (Heise, Verge, etc) cherry-pick just a couple of words from your blog, and then construct very different narratives having your post the only citable source; then they cite each other and produce a shitty result to present for a wide audience,” the webmaster said, according to emails shared by Patokallio.\nPatokallio said that after he declined to take the post down, the webmaster responded with “an increasingly unhinged series of threats.”\nWikipedia editors also pointed to webpage snapshots in Archive.today that appeared to have been altered to insert Patokallio’s name — hence the concern that it’s become “unreliable” as an archive.\nWikipedia’s guidance now calls for editors to remove links to Archive.today and related sites, replacing them with links to the original source or to other archives like the Wayback Machine.\nOn a blog linked from the Archive.today website, the site’s apparent owner wrote that Archive.today’s value to Wikipedia was “not about paywalls” but rather “the ability to offload copyright issues.” They later wrote that things had turned out “pretty well” and said they would “scale down the ‘DDoS’.”\n“Why didn’t you write about such events earlier, folks of the tabloids?” they said. “I don’t expect you to write anything good, because then who would read you, but there was plenty of dramas, wasn’t there? Because there was no Jani to nudge you?”\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Trump says Netflix will face ‘consequences’ if it doesn’t fire board member Susan Rice",
    "url": "https://techcrunch.com/2026/02/22/trump-says-netflix-will-face-consequences-if-it-doesnt-fire-board-member-susan-rice/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T17:39:55.000Z",
    "description": "President Donald Trump said in a social media post Saturday that Netflix will “pay the consequences” if it doesn’t fire Susan Rice, who has served on the company’s board of directors since 2018. Trump’s...",
    "body": "\nPresident Donald Trump said in a social media post Saturday that Netflix will “pay the consequences” if it doesn’t fire Susan Rice, who has served on the company’s board of directors since 2018.\nTrump’s comments came after Rice — a former ambassador to the United Nations who held diplomatic and advisory roles in the Obama and Biden administrations — appeared on the “Stay Tuned with Preet” podcast hosted by Preet Bharara and predicted that corporations that “take a knee” to Trump will be “held accountable” when Democrats return to power.\n“If these corporations think that the Democrats, when they come back in power, are going to, you know, play by the old rules, and […] say, ‘Oh, never mind. We’ll forgive you for all the people you fired, all the policies and principles you’ve violated, all, you know, the laws you’ve skirted,’ I think they’ve got another thing coming,” Rice said.\nIn response, Trump posted on his social network Truth Social, “Netflix should fire racist, Trump Deranged Susan Rice, IMMEDIATELY, or pay the consequences. She’s got no talent or skills – Purely a political hack! HER POWER IS GONE, AND WILL NEVER BE BACK. How much is she being paid, and for what???”\nTrump’s post also includes a screenshot of a post from far-right activist Laura Loomer criticizing Rice’s comments and claiming, “The Netflix-Warner Bros. merger would result in a streaming monopoly, which the Obamas will have a significant stake in” due to the deal between Netflix and the Obamas’ production company Higher Ground.\nWhile Trump’s post does not mention specific consequences, Netflix’s massive Warner Bros. acquisition will need to be approved by federal regulators. The streaming company’s co-CEO Ted Sarandos reportedly met with Trump before the deal was announced, with Trump subsequently saying that Netflix is a “great company […] but it’s a lot of market share, so we’ll have to see what happens.”\nLast fall, Trump published a similar post demanding that Microsoft fire its president of global affairs Lisa Monaco, who was also targeted by Loomer. Monaco is still at Microsoft.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "India’s Sarvam launches Indus AI chat app as competition heats up",
    "url": "https://techcrunch.com/2026/02/20/indias-sarvam-launches-indus-ai-chat-app-as-competition-heats-up/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/sarvam-indus-chat-app-jagmeet-singh-techcrunch.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T01:00:00.000Z",
    "description": "Sarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users, entering a fast-growing market dominated by global...",
    "body": "\nSarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users, entering a fast-growing market dominated by global players including OpenAI, Anthropic, and Google.\nThe launch comes as India has become a key battleground for generative AI adoption. Recently, OpenAI CEO Sam Altman said ChatGPT has more than 100 million weekly active users in India, while Anthropic said India accounts for 5.8% of total Claude usage, second only to the U.S.\nIndus serves as a chat interface for its newly announced Sarvam 105B model, the company’s 105-billion-parameter large language model. The app’s launch comes two days after Bengaluru-based Sarvam unveiled its 105B and 30B models at the India AI Impact Summit in New Delhi earlier this week. At the summit, the startup also outlined enterprise initiatives and hardware plans and announced partnerships with companies including HMD to bring AI to Nokia feature phones and Bosch for AI-enabled automotive applications.\nCurrently available in beta on iOS, Android, and the web, the Indus app allows users to type or speak queries and receive responses in text and audio. Users can sign in using their phone number, Google or Microsoft account, or Apple ID, though the service appears to be limited to India for now.\nImage Credits:Jagmeet Singh / TechCrunch\nThe app currently comes with some limitations. Users cannot delete their chat history without deleting their account, and there is no option to turn off the app’s reasoning feature, which can sometimes slow response times. Sarvam has also warned that access may be restricted as it gradually expands its compute capacity.\n“We’re gradually rolling out Indus on a limited compute capacity, so you may hit a waitlist at first. We will expand access over time,” Sarvam co-founder Pratyush Kumar wrote on X, adding that the company is seeking feedback from users.\nFounded in 2023, Sarvam has raised $41 million to date from investors, including Lightspeed Venture Partners, Peak XV Partners, and Khosla Ventures as it builds large language models tailored for India.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSarvam is one of a small but growing group of Indian startups attempting to build domestic alternatives to global artificial intelligence platforms as India seeks greater control over its AI infrastructure.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "7 days until ticket prices rise for TechCrunch Disrupt 2026",
    "url": "https://techcrunch.com/2026/02/21/7-days-until-ticket-prices-rise-for-techcrunch-disrupt-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/Networking_disrupt.png?w=150",
    "tag": "Tech",
    "date": "2026-02-21T15:00:00.000Z",
    "description": "Image Credits:TechCrunch\t \t \t\t\t\t\t\t7:00 AM PST · February 21, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Super Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That gives you one week to secure the...",
    "body": "\n\t\n\t\tImage Credits:TechCrunch\t\n\t\n\t\t\t\t\t\t7:00 AM PST · February 21, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSuper Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That gives you one week to secure the biggest savings of the year — up to $680 off individual passes and up to 30% off community passes. Register now to lock in at the lowest rate.\nFrom October 13-15 at Moscone West in San Francisco, Disrupt will bring together 10,000 founders, investors, and operators for three days engineered for results.\n\nWhat you gain at Disrupt\n\nAccess to active investors and high-growth founders\n\n\nHigh-impact networking built to drive deals\n\n\nTactical insights you can implement immediately\n\n\nVisibility into emerging trends before they scale\n\nExplore 300+ exhibiting startups. Experience Startup Battlefield 200, where one standout company wins a $100,000 equity-free prize. Meet the leaders who can change your company’s trajectory.\nImage Credits:Kimberly White/Getty Images for TechCrunch / Getty Images\nDisrupt has a long track record of bringing together the most influential voices in tech. Previous speakers have included WordPress co-founder Matt Mullenweg, Phia co-founders Phoebe Gates and Sophia Kianni, and renowned investor Elad Gil, alongside leaders from Google Cloud, Netflix, Waymo, and more — all sharing actionable insights for building and scaling what’s next. Stay tuned to the event site to see when the 2026 agenda drops.\nLock in your lowest rate now\nSeven days remain to secure the lowest rate of the year. Whether you’re scaling a company or sourcing your next investment, there’s a pass built for you. Lock in your savings before February 27 at 11:59 p.m. PT.\nImage Credits:Eric Slomonson, The Photo Group\n\n\t\t\t\n\tTopics\n\t\n\t\tAI, Apps, Biotech & Health, Climate, Fintech, Fundraising, Hardware, Media & Entertainment, Robotics, Security, Space, Startups, TC, TechCrunch Disrupt 2026, Transportation, Venture\t\n\n\t\t"
  },
  {
    "title": "Can the creator economy stay afloat in a flood of AI slop?",
    "url": "https://techcrunch.com/2026/02/22/can-the-creator-economy-stay-afloat-in-a-flood-of-ai-slop/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-941290532.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T22:15:58.000Z",
    "description": "Online creators and their business models were on our mind this week after mega-popular YouTuber MrBeast announced that his company is buying fintech startup Step, followed by Hollywood studios sending a...",
    "body": "\nOnline creators and their business models were on our mind this week after mega-popular YouTuber MrBeast announced that his company is buying fintech startup Step, followed by Hollywood studios sending a flurry of cease-and-desist letters to ByteDance over the launch of its new video generation model Seedance 2.0.\nThose seemingly unconnected headlines suggest a media landscape in the midst of transformative change, as popular YouTubers look to diversify their business models, with the threat and promise of increasingly powerful generative AI tools on the horizon.\nOn the latest episode of TechCrunch’s Equity podcast, Kirsten Korosec, Rebecca Bellan, and I debated what’s next for the creator economy, and whether there will be any room for the next generation of creators to stand out.\n“What’s the next saturation point?” Kirsten wondered. “Not all of these folks can go out and spin off products. So then does the pool of successful creators just simply get smaller? Or will something else happen, technologically speaking, or a different medium that will allow them to find an audience to make money off of?”\nYou can read a preview of our conversation, edited for length and clarity, below.\nAnthony: [The news] led our colleague Lauren to do this great piece talking about the creator business model in general, and this sense that they aren’t just relying on ad revenue anymore. I think it’s still a pretty big part of their business, but she broke down a number of the most popular YouTubers and noted that each of them is expanding — usually into e-commerce, but also into other revenue streams.\nMr. Beast, for example, actually has this line of food products, including chocolate, that is making hundreds of millions of dollars and it was actually profitable for him in 2024, whereas his media business was losing money. All that was pretty wild to me.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nKirsten: If Mr. Beast can’t be profitable with his media company, who can? To me, that was a stunning stat.\nI am not surprised that the whole ad revenue biz game is not working out necessarily for creators and influencers because it’s just reached a saturation point. I guess my big question is, what’s the next saturation point? Not all of these folks can go out and spin off products. So then does the pool of successful creators just simply get smaller? Or will something else happen, technologically speaking, or a different medium that will allow them to find an audience to make money off of?\nRebecca: It’s interesting, there’s a lot of ways you can think about what else could happen, right? Maybe they’ll create digital twins of themselves and put their digital twins into a bunch of different situations that can make them [other kinds of] money.\nBut again, going back to this not being surprising, these people are now celebrities, right? Someone told me on the phone recently that a lot of [the] younger generation, they don’t know our celebrities, they know TikTok celebrities. And we’ve seen celebrities for years pass off products and make money off of them, right? I used to watch Rachel [Ray], she was a celebrity chef and she sold her EVOO or her olive oil.\nWe Slow Ventures on [Equity] sometime last year. They have a creator fund and basically what they’re doing is they’ve raised a VC fund to essentially back creators with their businesses, if they have maybe a niche following, maybe they’re really into woodworking and here’s their collection of chisels, I don’t know.\nI think it’s an interesting path forward and it’s something that we see as journalists: How do we also try to be creators and make a brand of ourselves that we could diversify our revenue. It sounds horrible to say it out loud like that.\nAnthony: I’m smiling, but it’s the smile of somebody whose soul is slowly turning into ash inside.\nSo we took a break from talking about AI, but I will obligatorily bring AI back into the conversation. Obviously one of the other related developments over the past week or so is that ByteDance, which is the Chinese company that launched TikTok and is still an investor — we won’t get into all of that — they launched a new version of their model, Seedance 2.0, which at least initially was primarily only available to Chinese users.\nBut you started to see people posting videos generated by Seedance, including this viral video of Brad Pitt fighting Tom Cruise. That prompted both this general conversation of: Is Hollywood doomed? And then more concretely, a bunch of Hollywood studios, including Netflix, sending ByteDance letters being like, “You cannot do this, you’re basically allowing all your users to generate videos using all of our IP, all of our movie stars.” And for a couple of days, there was no response at all from ByteDance, but then they did say, “Sorry, sorry, sorry, for some reason we launched this without any real guardrails, but we’re gonna do better in the future.”\nKirsten: So the timing of this is just perfect because I happen to be editing a story right now that Rebecca wrote. It has nothing to do with Seedance, but it does have to do with AI and filmmaking. So I’m going to give a future ]rops to Rebecca for being timely about that. Rebecca, I know you have a lot to say on that, besides that Hollywood is upset. Is it more complicated than that?\nRebecca: Yeah, definitely. I mean, tying this back to the creators thing, I think that a lot of people are going to be using these tools to produce all kinds of content and we’re just going to be absolutely flooded. And that’s going to be intense. \nBut when we talk about, whether it’s creating films or ads or just content in general using AI video tools, I think there’s this tension between one, this is going to produce a whole lot of low effort slop versus two, it could also democratize access for a lot of people who don’t have funds or budgets or teams to share a lot of the stories that they want to tell. \nAnd also, if you’re a small business and you want to create a little shampoo ad — to be on the nose about it, because there’s a shampoo ad that’s going viral — or you sell coffee and you want to make a little ad for it, [this] could give you the tools to do that. Is that a bad thing? Is it not a bad thing? Do we need more content in the world? There’s a few avenues to walk down. \nKirsten: Is it a bad thing, Anthony?\nAnthony: In terms of the creator side of it, my general feeling is [that] the response to a lot of this kind of slop — frankly, a lot of it is slop, and I think that’s going to continue to be the case — is going to be this valuing of authenticity. And so there is the opportunity for these big creators is be less about the idea of like, “I have digital twins of myself,” but [instead,] “No, I’m the real Mr. Beast, not the digital simulacra wandering around.” \nAnd I think it’s also telling that – of course, every social network has ups and downs, but that OpenAI’s Sora, from what I understand, had skyrocketed at the beginning and then has been struggling to hold on to users more recently, because there is a certain emptiness to the experience when you just feel like there’s not an authentic human being on the other side. \nBut I think it’s also going to make the landscape much more challenging, both for the established creators to monetize […] and then I think it’s going to be especially hard for new creators because there’s just going to be so much more stuff. Trying to actually break out is going to become super difficult.\n\n\n\n"
  },
  {
    "title": "6 days left to lock in the lowest TechCrunch Disrupt 2026 rates",
    "url": "https://techcrunch.com/2026/02/22/6-days-left-to-lock-in-the-lowest-techcrunch-disrupt-2026-rates/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Disrupt-2025-day-3.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T15:00:00.000Z",
    "description": "Image Credits:Kimberly White / Getty Images\t \t \t\t\t\t\t\t7:00 AM PST · February 22, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Super Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That means you have...",
    "body": "\n\t\n\t\tImage Credits:Kimberly White / Getty Images\t\n\t\n\t\t\t\t\t\t7:00 AM PST · February 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSuper Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That means you have just 6 days left to secure the lowest ticket prices of the year.\nIf Disrupt has been on your must-attend list, this is your moment. Save up to $680 on your individual pass or secure up to 30% off with community passes before prices increase. Register here.\nFrom October 13-15 at San Francisco’s Moscone West, TechCrunch will bring together 10,000 founders, investors, operators, and innovators for three focused days built around launching, scaling, and shaping what’s next in tech.\n\nWhat’s at Disrupt?\nDisrupt is where you get:\n\nDirect access to founders, VCs, and operators actively building.\n\n\nConversations that turn into funding, partnerships, and key hires.\n\n\nTactical insights you can apply immediately.\n\n\nEarly visibility into where tech is heading next.\n\nImage Credits:Slava Blazer Photograpy\nYou’ll see 300+ exhibiting startups debut tomorrow’s breakthroughs, experience the high-stakes Startup Battlefield 200 pitch competition — where one standout company wins a $100,000 equity-free prize — and take part in curated networking designed to drive real outcomes.\nYou’ll also hear insights from some of the most influential voices in tech, including WordPress co-founder Matt Mullenweg, General Motors CEO Mary Barra, and legendary VC Vinod Khosla. Keep an eye on the event page for the agenda drop.\nMaximize your experience as a founder or investor\n\nFounder Pass: Built to help you scale faster with the right insights and connections\n\n\nInvestor Pass: Designed to help you discover breakout startups and expand your portfolio\n\nSecure your pass before rates increase\nSix days remain to secure the lowest rate of the year. Lock it in before February 27 at 11:59 p.m. PT. Register here.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:TechCrunch\n\n\t\t\t\n\tTopics\n\t\n\t\tAI, Apps, Biotech & Health, Climate, Fintech, Fundraising, Hardware, Media & Entertainment, Robotics, Security, Space, Startups, TechCrunch Disrupt 2026, Transportation, Venture\t\n\n\t\t"
  },
  {
    "title": "All the important news from the ongoing India AI Impact Summit",
    "url": "https://techcrunch.com/2026/02/22/all-the-important-news-from-the-ongoing-india-ai-summit/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/06/india-ai.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T17:00:00.000Z",
    "description": "India is hosting a four-day AI Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state.",
    "body": "\n\t\n\t\tImage Credits:Jagmeet Singh / TechCrunch\t\n\t\n\t\t\t\t\t\t9:00 AM PST · February 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWith an eye toward luring more AI investment to the country, India is hosting a four-day AI Impact Summit this week that will be attended by executives from major AI labs and Big Tech, including OpenAI, Anthropic, Nvidia, Microsoft, Google, and Cloudflare, as well as heads of state.\nThe event, which expects 250,000 visitors, will see Alphabet CEO Sundar Pichai, OpenAI CEO Sam Altman, Anthropic CEO Dario Amodei, Reliance Chairman Mukesh Ambani, and Google DeepMind CEO Demis Hassabis in attendance.\nIndia’s prime minister, Narendra Modi, is scheduled to deliver a speech with French President Emmanuel Macron on Thursday.\nHere are all the key updates from the event:\n\nIndia earmarks $1.1 billion for its state-backed venture capital fund. The fund will invest in artificial intelligence and advanced manufacturing startups across the country.\nOpenAI CEO Sam Altman said India accounts for more than 100 million weekly active ChatGPT users, second only to the U.S. He also said Indians account for the most students using ChatGPT.\nBlackstone has picked up a majority stake in Indian AI startup Neysa as part of a $600 million equity fundraise. Teachers’ Venture Growth, TVS Capital, 360 ONE Asset, and Nexus Venture Partners also invested. The company now plans to raise another $600 million in debt, and deploy more than 20,000 GPUs.\nBengaluru-based C2i, which is building a power solution for data centers, raised $15 million in a Series A round from Peak XV, with participation from Yali Deeptech and TDK Ventures.\nHCL CEO Vineet Nayyar said Indian IT companies will focus on turning profits and not being job creators. These comments come as Indian IT stocks dip as fears of AI disrupting the IT services sector burgeon.\nVinod Khosla, founder of Khosla Ventures, said that industries like IT services and BPOs (Business Process Outsourcing) can “almost completely disappear” within five years because of AI. He told Hindustan Times that 250 million young people in India should be selling AI-based products and services to the rest of the world.\nAMD is teaming up with Tata Consultancy Services (TCS) to develop rack-scale AI infrastructure based on AMD’s “Helios” platform.\nAnthropic said that it is opening its first office in India in the city of Bengaluru. The company said that the country is the second biggest user of Claude after the U.S.\nAnthropic is partnering with IT giant Infosys to deploy Claude models and tools like Claude code to Indian enterprises. To begin, both will deploy AI tools in the telecommunications sector with a dedicated Anthropic Center of Excellence.\nIndian AI company Sarvam teases its upcoming smart glasses under the name Sarvam Kaze. The company has released several models in the past few weeks, including a dubbing model, a speech-to-text model, a text-to-speech model, and a vision model for Optical Character Recognition (OCR).\n\n\nDrop 12/14: Models, products, impact – today something different, very different. Launching Sarvam Kaze, our foray into getting our models into the your hands with our devices – designed and built here in India! pic.twitter.com/8RnqO16Idg— Pratyush Kumar (@pratykumar) February 17, 2026\n\n\nIndian conglomerate Adani said that it is allocating $100 billion to build AI data centers that would use renewable energy in India by 2035. The company said that this investment will lead to an additional $150 billion investment in areas like server manufacturing, advanced electrical infrastructure, sovereign cloud platforms, and supporting industries.\nVoice AI company Cartesia is teaming up with India-based orchestrator Blue Machines to deploy voice solutions for enterprises with local data residency. \nCohere Labs launches a family of multilingual models with open weights that support over 70 languages. These models can run on local devices. The company said that it has also released models tuned to specific regions. \nOpenAI said it will open two new offices in India in Bengaluru and Mumbai.\nOpenAI also partnered with the Tata group to deploy 100 megawatts of compute in India with an aim to scale it up to 1 gigawatt. \nIndia’s tech minister Ashwini Vaishnaw said that the country wants to attract over $200 billion in investment for AI infrastructure in the next two years. \nIndia’s vibe-coding startup Emergent said that it has reached $100 in ARR and launched a mobile app. \nIndian AI startup Sarvam released two new open-sourced models: Sarvam 30B and Sarvam 105B. \nSarvam also announced a partnership with Qualcomm, HMD, and Bosch to deploy its AI models to devices, including smartphones, feature phones, cars, laptops, and smartglasses.\nVoice AI startup Gnani released a zero-shot voice cloning text-to-speech model called Vachana, which supports 12 languages.\nBharatGen, a government-backed AI consortium, released a 17 billion parameter model called Param 2 that works across 22 languages. \nSteaming service JioHotstar said it will use ChatGPT to aid content discovery with conversational search.\nSarvam launches its ChatGPT competitor called Indus that supports multiple Indian languages. \nOpenAI said that 18-24-year-old users in India drive nearly 50% of the usage in India on ChatGPT.\nIndian tech company Tech Mahindra released an 8 billion parameter Hindi-oriented model for educational use cases.\nUAE’s G42 teamed up with U.S.-based chip maker Cerebras to deploy 8 exaflops of compute in India through a supercomputer. Abu Dhabi’s Mohamed bin Zayed University of Artificial Intelligence (MBZUAI) and India’s Centre for Development of Advanced Computing (C-DAC) are also part of the project.\nOn the sidelines of the India AI summit, Sam Altman said that concerns around how much water AI uses are “totally fake,” but acknowledged the issue of water usage when  “we used to do evaporative cooling in data centers.” \nStrangely, he also said that humans use a lot of energy as they grow up and process things around them. He thinks that the arguments around ChatGPT’s power consumption are “unfair.” \n\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart.”\n\nIndia said that over 88 countries and organizations signed the New Delhi AI declaration for working towards using AI for social and economic good. These countries included the U.S., China, and Russia. \nIndia joined the Pax Silica group led by the U.S. to create a smooth supply chain network of materials used in creating AI infrastructure.  Other members include the U.K, United Arab Emirates, Singapore, Qatar, Japan, Israel, South Korea, and Australia.\n\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Quantonation’s double-sized second fund shows quantum still has believers",
    "url": "https://techcrunch.com/2026/02/22/quantonations-double-sized-second-fund-shows-quantum-still-has-believers/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/01/GettyImages-1393513219.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-22T18:00:00.000Z",
    "description": "Quantonation Ventures, a venture firm investing in quantum and physics-based startups, has closed its oversubscribed second fund at €220 million, or approximately $260 million. That’s more than twice the size of its inaugural fund, and comes in addition to other signals that the quantum winter isn’t coming yet.",
    "body": "\nQuantum computing will not be replacing supercomputers in 2026, let alone reaching industrial scale. And yet, investor appetite for companies pursuing the elusive quantum advantage hasn’t dwindled — it has increased.\nQuantonation Ventures, a venture firm investing in quantum and physics-based startups, has closed its oversubscribed second fund at €220 million, or approximately $260 million. That’s more than twice the size of its inaugural fund, and comes in addition to other signals that the quantum winter isn’t coming yet.\nWhile some warned that too much quantum hype and not enough tangible outcomes would eventually cause funding to collapse, the opposite has happened. Take the prediction that quantum will eventually crack modern encryption: that moment has no clear timeline, and yet governments have joined Big Tech in the race.\nIn the years since Quantonation’s launch in 2018, the quantum technology sector has become less incipient, with both technological breakthroughs and early demand from academic and industrial labs. As a result, there has also been “a shift in the types of investment opportunities that are available” to its second fund, Quantonation partner Will Zeng told TechCrunch. \nOne example is what Zeng describes as the “picks and shovels” opportunity, with companies developing technologies that support the quantum industry. He cited the example of Dutch startup Qblox, a long-boostrapped company that was selling quantum control hardware and software to Quantonation portfolio companies before the VC firm co-led its Series A.\nThis growing ecosystem also explains why backers are doubling down on Quantonation, and why other dedicated quantum funds such as QDNL and 55 North have emerged.\n“VCs recognize that this is not an easy area to invest in at the early stage. The technology is very specific and complex, the markets are often new, and the teams as well,” Zeng said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe firm’s thesis is to invest early to capture more value; but a handful of quantum companies have already gone public, and their shares have surged in recent months. According to Bloomberg, this “quantum frenzy” is partly stocked by Nvidia, whose CEO Jensen Huang declared in June 2025 that “quantum computing is reaching an inflection point.”\nDespite the fact that quantum chips have yet to outperform classical computers outside of purpose-built benchmarks, consensus is growing that real-life applications are only a few years away, from life sciences to new materials. That’s in part thanks to advancements in error correction — the ability to fix the mistakes that quantum systems are prone to.\nGoogle’s Willow chip was a landmark for error correction in 2024, but no architecture has won yet, and smaller players are still in the race. Zeng noted that a surprising number of companies have entered DARPA’s Quantum Benchmarking Initiative. He also believes that beyond the public market excitement, “there are more exciting technologies that are currently private.”\nFor Quantonation, those private opportunities span a wider canvas than quantum chips alone. Fund two has already invested in 12 startups, with a target portfolio of around 25, covering not just the software and industrial layers needed to make quantum advantage real, but also adjacent physics-based technologies such as photonics and lasers.\nThis expanded thesis is backed by investors old and new. According to the firm, major investors from its first vintage, including Singapore’s Vertex Holdings and Bpifrance’s Fonds National d’Amorçage 2, have returned for the second fund, with new limited partners including the European Investment Fund, Grupo ACS, Novo Holdings, Planet First Partners, and Toshiba.\nQuantonation’s geographic scope is equally international. With dual headquarters in Paris and New York City, the firm has backed French quantum companies including Pasqal and Quandela, but also placed bets in Asia and North America — and will continue doing so.\n“In a lot of the areas we invest in, there’s not yet a clear regional winner, […] and a lot of the research has come from universities in many places,” Zeng said.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google VP warns that two types of AI startups may not survive",
    "url": "https://techcrunch.com/2026/02/21/google-vp-warns-that-two-types-of-ai-startups-may-not-survive/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Darren-Mowry-headshot.png?w=150",
    "tag": "Tech",
    "date": "2026-02-21T16:00:00.000Z",
    "description": "Startup founders are being pushed to move faster than ever, using AI while facing tighter funding, rising infrastructure costs, and more pressure to show real traction early. Cloud credits, access to GPUs, and foundation models have made it easier to get started, but those early infrastructure choices can have unforeseen consequences once startups move beyond free credits and into real cloud bills. On this episode of TechCrunch's Equity podcast, Rebecca Bellan caught up with Darren Mowry, Google Cloud’s vice president of global startups who is right at the center of those tradeoffs. Together, they discuss what Mowry’s seeing across the startup ecosystem, how Google Cloud is competing for AI startups, and what founders should be thinking about as they scale. Chapters: 00:00 Intro 03:21 How startups can join the Google Cloud ecosystem 05:00 Beyond credits: Engineering resources & technical support 07:30 TPUs vs. GPUs: Building with choice 09:15 When cloud costs spike after credits run out 11:46 The shift from chips to models and agents 13:40 Trends in AI adoption among early stage companies 16:30 Are agents generating real revenue yet? 18:05 Competing with AWS and Microsoft 20:52 Startup usage vs. durable paying demand 23:30 Check engine lights: LLM wrappers and aggregators 25:45 Green lights: Biotech, climate tech, and world models 30:00 Outro Subscribe to Equity on YouTube, Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.",
    "body": "\n\nLoading the player…\n\nThe generative AI boom minted a startup a minute. But as the dust starts to settle, two once-hot business models are looking more like cautionary tales: LLM wrappers and AI aggregators. \nDarren Mowry, who leads Google’s global startup organization across Cloud, DeepMind, and Alphabet, says startups with these hooks have their “check engine light” on.\nLLM wrappers are essentially startups that wrap existing large language models, like Claude, GPT, or Gemini, with a product or UX layer to solve a specific problem. An example would be a startup that uses AI to help students study.\n“If you’re really just counting on the back-end model to do all the work and you’re almost white-labeling that model, the industry doesn’t have a lot of patience for that anymore,” Mowry said on this week’s episode of Equity. \nWrapping “very thin intellectual property around Gemini or GPT-5” signals you’re not differentiating yourself, Mowry says. \n“You’ve got to have deep, wide moats that are either horizontally differentiated or something really specific to a vertical market” for a startup to “progress and grow,” he said. Examples of the deep-moat LLM wrapper type include Cursor, a GPT-powered coding assistant, or Harvey AI, a legal AI assistant.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn other words, startups can no longer expect to slap a UI on top of a GPT and get traction on their product like they could, perhaps, in mid-2024 when OpenAI launched its ChatGPT store. The challenge now is to build sustainable product value. \nAI aggregators are a subset of wrappers — they’re startups that aggregate multiple LLMs into one interface or API layer to route queries across models and give users access to multiple models. These companies typically provide an orchestration layer that includes monitoring, governance, or eval tooling. Think: AI search startup Perplexity or developer platform OpenRouter, which provides access to multiple AI models via a single API. \nWhile many of these platforms have gained ground, Mowry’s message is clear to incoming startups: “Stay out of the aggregator business.”\nGenerally speaking, aggregators aren’t seeing much growth or progression these days because, he says, users want “some intellectual property built in” to ensure they’re routed to the right model at the right time based on their needs — not because of behind-the-scenes compute or access constraints.\nMowry has been in the cloud game for decades, cutting his teeth at AWS and Microsoft before setting up shop at Google Cloud, and he’s seen how this plays out. He said the situation today mirrors the early days of cloud computing in the late 2000s/early 2010s as Amazon’s cloud business started taking off. \nAt that time, a crop of startups sprang up to resell AWS infrastructure, marketing themselves as easier entry points that provided tooling, billing consolidation, and support. But when Amazon built its own enterprise tools and customers learned to manage cloud services directly, most of those startups were squeezed out. The only survivors were the ones that added real services, like security, migration, or DevOps consulting. \nAI aggregators today face similar margin pressure as model providers expand into enterprise features themselves, potentially sidelining middlemen. \nFor his part, Mowry is bullish on vibe coding and developer platforms, which had a record-breaking year in 2025 with startups like Replit, Lovable, and Cursor (all Google Cloud customers, per Mowry) attracting major investment and customer traction.\nMowry also expects strong growth in direct-to-consumer tech, in companies that put some of these powerful AI tools into the hands of customers. He pointed to the opportunity for film and TV students to use Google’s AI video generator Veo to bring stories to life.\nBeyond AI, Mowry also thinks biotech and climate tech are having a moment — both in terms of venture investment going into the two industries and the “incredible amounts of data” startups can access to create real value “in ways we would never have been able to before.”\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]