[
  {
    "title": "Instagram says there’s been ‘no breach’ despite password reset requests",
    "url": "https://techcrunch.com/2026/01/11/instagram-says-theres-been-no-breach-despite-password-reset-requests/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-11T22:26:03.000Z",
    "description": "\nIn Brief\nPosted:\n2:26 PM PST · January 11, 2026\n\nImage Credits:stockcam (opens in a new window) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n2:26 PM PST · January 11, 2026\n\nImage Credits:stockcam (opens in a new window) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nInstagram says that although some users received suspicious-looking password reset requests, it has not been breached.\nThat seemingly contradicts a Friday Bluesky post from antivirus software company Malwarebytes, which shared a screenshot of an email from Instagram informing users of a request to reset their password. The post claimed, “Cybercriminals stole the sensitive information of 17.5 million Instagram accounts, including usernames, physical addresses, phone numbers, email addresses, and more.”\nThis data, Malwarebytes added, “is available for sale on the dark web and can be abused by cybercriminals.”\nHowever, Instagram subsequently posted (on X, rather than Instagram or Threads) that it had “fixed an issue that let an external party request password reset emails for some people.”\nThe company did not offer any details about the external party or the specific issue, but its post concluded, “You can ignore those emails — sorry for any confusion.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\n\nLatest in Security\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram says there’s been ‘no breach’ despite password reset requests",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?w=150"
      ],
      "datePublished": "2026-01-11T22:26:03.000Z",
      "dateModified": "2026-01-11T22:26:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta hires former Trump advisor Dina Powell McCormick as president and vice chair",
    "url": "https://techcrunch.com/2026/01/12/meta-hires-former-trump-advisor-dina-powell-mccormick-as-president-and-vice-chair/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2152513031.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T14:58:19.000Z",
    "description": "\nIn Brief\nPosted:\n6:58 AM PST · January 12, 2026\n\nImage Credits:Christopher Pike/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nM",
    "body": "\nIn Brief\nPosted:\n6:58 AM PST · January 12, 2026\n\nImage Credits:Christopher Pike/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta announced on Monday that it has appointed former Trump advisor Dina Powell McCormick as president and vice chairman of the company. Meta said Powell McCormick will be a member of the company’s management team and will help guide Meta’s overall strategy and execution.\n“Dina’s experience at the highest levels of global finance, combined with her deep relationships around the world, makes her uniquely suited to help Meta manage this next phase of growth as the company’s President and Vice Chairman,” Meta CEO Mark Zuckerberg said in the blog post.\nPowell McCormick served as deputy national security advisor to President Donald Trump.\nTrump celebrated the news on Truth Social in a post reading: “Congratulations to DINA POWELL MCCORMICK, WHO HAS JUST BEEN NAMED THE NEW PRESIDENT OF META. A great choice by Mark Z!!! She is a fantastic, and very talented, person, who served the Trump Administration with strength and distinction.”\nPowell McCormick previously served under Secretary of State Condoleezza Rice during the George W. Bush administration. She also spent 16 years at Goldman Sachs as a partner in senior leadership roles.\nLast week, Meta hired Curtis Joseph Mahoney, a former Microsoft legal executive who also served as a deputy U.S. trade representative during Trump’s first term.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Apps\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta hires former Trump advisor Dina Powell McCormick as president and vice chair",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2152513031.jpg?w=150"
      ],
      "datePublished": "2026-01-12T14:58:19.000Z",
      "dateModified": "2026-01-12T14:58:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google co-founders may be leaving California",
    "url": "https://techcrunch.com/2026/01/11/google-co-founders-may-be-pulling-out-of-california/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/12/GettyImages-528779824.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-11T22:56:58.000Z",
    "description": "\nIn Brief\nPosted:\n2:56 PM PST · January 11, 2026\n\nImage Credits:James Leynse/Corbis / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSergey B",
    "body": "\nIn Brief\nPosted:\n2:56 PM PST · January 11, 2026\n\nImage Credits:James Leynse/Corbis / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSergey Brin and Larry Page appear to be reducing their presence in the state where they co-founded Google.\nThe New York Times reports that in December, 15 limited liability companies overseeing Brin’s investments and interests were terminated or converted into Nevada entities. Those include LLCs that manage one of his superyachts and his interest in a private terminal at the San Jose International Airport.\nSimilarly, 45 LLCs associated with Page have recently become inactive or moved out of state, and a trust associated with Page bought a $71.9 million mansion in Miami this week, according to the NYT.\nClearly, moving is not a simple, black-and-white thing for the ultra-rich, and Brin and Page both still own homes in the state, the NYT says. Still, these moves suggest that at least two of California’s billionaires are indeed hoping to dodge a prospective ballot measure that would impose a one-time, 5% tax on individuals worth more than $1 billion.\nIf the measure makes it onto the ballot in November and actually passes, it would retroactively apply to anyone who lived in the state as of January 1 of this year.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Government & Policy\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google co-founders may be leaving California",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/12/GettyImages-528779824.jpg?w=150"
      ],
      "datePublished": "2026-01-11T22:56:58.000Z",
      "dateModified": "2026-01-11T22:56:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount files lawsuit against Warner Bros. amidst controversial Netflix merger",
    "url": "https://techcrunch.com/2026/01/12/paramount-files-lawsuit-against-warner-bros-amidst-controversial-netflix-merger/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/03/GettyImages-1865825216.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T17:06:12.000Z",
    "description": "\nAs two major streaming platforms — Warner Bros. and Netflix — prepare for a merger, concerns continue to be voiced about the implications of the deal",
    "body": "\nAs two major streaming platforms — Warner Bros. and Netflix — prepare for a merger, concerns continue to be voiced about the implications of the deal, which represents more consolidation in the media business.\nOn Monday, Paramount CEO David Ellison announced that the company has filed a lawsuit against Warner Bros. Discovery (WBD) in Delaware, demanding greater financial disclosure regarding Netflix’s $82.7 billion acquisition. \nIn a letter to shareholders, Ellison disclosed that the lawsuit has been filed in the Delaware Chancery Court, requesting that WBD provide essential information that it allegedly has failed to share. Ellison argues that shareholders need accurate information to assess whether to accept Paramount’s competing offer of $30 per share in cash, which he claims is superior to Netflix’s deal. \nEllison wrote, “WBD has provided increasingly novel reasons for avoiding a transaction with Paramount, but what it has never said, because it cannot, is that the Netflix transaction is financially superior to our actual offer.” \n“Along with the WBD shareholders, we have asked for the customary financial disclosure a board is supposed to provide shareholders when making an investment recommendation … WBD has failed to include any disclosure about how it valued the overall Netflix transaction, how the purchase price reduction for debt works in the Netflix transaction, or even what the basis is for its ‘risk adjustment’ of our $30 per share all-cash offer. WBD shareholders need this information to make an informed investment decision on our offer,” Ellison added. \nLast week, WBD’s board rejected Paramount’s latest bid once again, saying there’s too much risk of the deal falling through.\nPresident Trump also expressed his dissatisfaction with the merger. Over the weekend, Trump shared on Truth Social an opinion piece by John Pierce titled “Stop the Netflix Cultural Takeover,” published in One America News last month. Pierce believes if Netflix acquires Warner Bros.’ streaming and studio assets, it would establish itself as “the most dominant cultural gatekeeper the United States — and much of the world — has ever seen.”\nAfter meeting with Netflix co-CEO Ted Sarandos in December, Trump indicated that the merger “could be a problem,” due to Netflix’s already significant market share, which would expand greatly with the acquisition.\nThe industry has also generally reacted negatively to the acquisition, raising concerns about job implications, the future of theatrical releases, and the representation of diverse voices in film and TV. \nNetflix co-CEOs Greg Peters and Sarandos attempted to address these fears in a letter last month. However, the Writers Guild of America (WGA) continues to oppose the acquisition, citing antitrust law violations. Lawmakers, including Senators Elizabeth Warren, Bernie Sanders, and Richard Blumenthal, warn that the merger could lead to increased consumer costs, exacerbating financial pressures on middle-class families, especially following Netflix’s recent price hike. \n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount files lawsuit against Warner Bros. amidst controversial Netflix merger",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/03/GettyImages-1865825216.jpg?w=150"
      ],
      "datePublished": "2026-01-12T17:06:12.000Z",
      "dateModified": "2026-01-12T17:06:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fintech firm Betterment confirms data breach after hackers send fake crypto scam notification to users",
    "url": "https://techcrunch.com/2026/01/12/fintech-firm-betterment-confirms-data-breach-after-hackers-send-fake-crypto-scam-notification-to-users/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/betterment-icon-iphone.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T18:14:10.000Z",
    "description": "\nAutomated investment platform Betterment has confirmed that hackers broke into some of its systems last week and accessed the personal information of",
    "body": "\nAutomated investment platform Betterment has confirmed that hackers broke into some of its systems last week and accessed the personal information of an undisclosed number of its customers. \nIn an email sent on Monday, which TechCrunch has seen, Betterment said that hackers gained access to some company systems on January 9 by way of a social engineering attack, which involved “third-party platforms” that the company uses for marketing and operations. \nThe company said customer names, email and postal addresses, phone numbers, and dates of birth were compromised in the attack.\nWith this access, hackers were able to send a fraudulent notification to users, claiming to triple the value of their crypto by sending $10,000 to a wallet controlled by the attacker, as reported by The Verge. \nBetterment, which allows customers to invest in crypto, also published an announcement about the breach on its website, but did not disclose how many customers were targeted, nor how many had their personal information accessed, stolen, or seen by the hackers. \nBetterment added that it detected the attack on the same day and “immediately revoked the unauthorized access and launched a comprehensive investigation, which is ongoing,” with the help of an unspecified cybersecurity firm. Betterment also said it has reached out to the customers targeted by the hackers and “advised them to disregard the message.”\n“Our ongoing investigation has continued to demonstrate that no customer accounts were accessed and that no passwords or other log-in credentials were compromised,” Betterment wrote in the email.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nRepresentatives for Betterment did not immediately respond to a request for comment asking for more details about the attack. \nAs of the time of publication, Betterment’s security incident web page contains a hidden “noindex” tag in its source code, which tells search engines to ignore the page, making it more difficult for anyone searching the web to discover information about the data breach.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fintech firm Betterment confirms data breach after hackers send fake crypto scam notification to users",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/betterment-icon-iphone.jpg?w=150"
      ],
      "datePublished": "2026-01-12T18:14:10.000Z",
      "dateModified": "2026-01-12T18:14:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic’s new Cowork tool offers Claude Code without the code",
    "url": "https://techcrunch.com/2026/01/12/anthropics-new-cowork-tool-offers-claude-code-without-the-code/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/Claude-Chrome-Ext_email-hero-hero.png?w=150",
    "tag": "Tech",
    "date": "2026-01-12T19:30:00.000Z",
    "description": "\n\t\n\t\tImage Credits:Anthropic\t\n\t\n\t\t\t\t\t\t11:30 AM PST · January 12, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nOn Monday, Anthropic announced a new tool called Cowork, designe",
    "body": "\n\t\n\t\tImage Credits:Anthropic\t\n\t\n\t\t\t\t\t\t11:30 AM PST · January 12, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nOn Monday, Anthropic announced a new tool called Cowork, designed as a more accessible version of Claude Code. Built into the Claude Desktop app, the new tool lets users designate a specific folder where Claude can read or modify files, with further instructions given through the standard chat interface. The result is similar to a sandboxed instance of Claude Code, but requires far less technical savvy to set up.\nCurrently in research preview, Cowork is only available to Max subscribers, with a waitlist available for users on other plans.\nThe new tool is inspired in part by the growing number of subscribers using Claude Code to achieve non-coding tasks, treating it as a general-purpose agentic AI tool. Cowork is built on the Claude Agent SDK, which means it’s drawing on the same underlying model as Claude Code. The folder partition gives an easy way to manage what files Cowork has access to, and because the app doesn’t require command-line tools or virtual environments, it’s less intimidating for non-technical users.\nThat opens up a new world of potential use cases. Anthropic gives the example of assembling an expense report from a folder of receipt photos — but Claude Code users have also put the system to work managing media files, scanning social media posts, or analyzing conversations.\nSimilar to Claude Code, Cowork is designed to take strings of actions without user input — a potentially dangerous approach if the tool is given vague or contradictory instructions. In a blog post announcing the new tool, Anthropic explicitly warns about the risk of prompt injection or deleted files, recommending that users make instructions as clear and unambiguous as possible.\n“These risks aren’t new with Cowork,” the post reads, “but it might be the first time you’re using a more advanced tool that moves beyond a simple conversation.”\nLaunched as a command-line tool in November 2024, Claude Code has become one of Anthropic’s most successful products, leading the company to launch a string of new interfaces in recent months. A web interface launched in October, followed by a Slack integration just two months later.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic’s new Cowork tool offers Claude Code without the code",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/Claude-Chrome-Ext_email-hero-hero.png?w=150"
      ],
      "datePublished": "2026-01-12T19:30:00.000Z",
      "dateModified": "2026-01-12T19:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google removes AI Overviews for certain medical queries",
    "url": "https://techcrunch.com/2026/01/11/google-removes-ai-overviews-for-certain-medical-queries/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/Sundar-AI-Overviews-IO-2024.png?w=150",
    "tag": "Tech",
    "date": "2026-01-11T17:56:41.000Z",
    "description": "\nFollowing an investigation by The Guardian that found Google AI Overviews offering misleading information in response to certain health-related queri",
    "body": "\nFollowing an investigation by The Guardian that found Google AI Overviews offering misleading information in response to certain health-related queries, the company appears to have removed the AI Overviews for some of those queries.\nFor example, The Guardian initially reported that when users asked “what is the normal range for liver blood tests,” they would be presented with numbers that did not account for factors such as nationality, sex, ethnicity, or age, potentially leading them to think their results were healthy when they were not.\nNow, The Guardian says AI Overviews have been removed from the results for “what is the normal range for liver blood tests” and “what is the normal range for liver function tests.” However, it found that variations on those queries, such as “lft reference range” or “lft test reference range,” could still lead to AI-generated summaries.\nWhen I tried those queries this morning — several hours after The Guardian published its story — none of them resulted in seeing AI Overviews, though Google still gave me the option to ask the same query in AI Mode. In several cases, the top result was actually The Guardian article about the removal.\nA Google spokesperson told The Guardian that the company does not “comment on individual removals within Search,” but that it works to “make broad improvements.” The spokesperson also said that an internal team of clinicians reviewed the queries highlighted by The Guardian and found “in many instances, the information was not inaccurate and was also supported by high quality websites.”\nTechCrunch has reached out to Google for additional comment. Last year, the company announced new features aimed at improving Google Search for healthcare use cases, including improved overviews and health-focused AI models.\nVanessa Hebditch, the director of communications and policy at the British Liver Trust, told The Guardian that the removal is “excellent news,” but added, “Our bigger concern with all this is that it is nit-picking a single search result and Google can just shut off the AI Overviews for that but it’s not tackling the bigger issue of AI Overviews for health.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google removes AI Overviews for certain medical queries",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/Sundar-AI-Overviews-IO-2024.png?w=150"
      ],
      "datePublished": "2026-01-11T17:56:41.000Z",
      "dateModified": "2026-01-11T17:56:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix had a huge night at the 2026 Golden Globes with 7 wins",
    "url": "https://techcrunch.com/2026/01/12/netflix-had-a-huge-night-at-the-2026-golden-globes-with-7-wins/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Netflix-Adolescence.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T16:12:49.000Z",
    "description": "\nThe 83rd Golden Globes was a standout evening for streaming platforms. Netflix led the pack with seven wins, while Apple TV and HBO Max each secured ",
    "body": "\nThe 83rd Golden Globes was a standout evening for streaming platforms. Netflix led the pack with seven wins, while Apple TV and HBO Max each secured three awards, and Hulu took home one.​\nAmong Netflix’s highlights, the hit series “Adolescence” claimed four awards, including best limited series. The show also earned awards for best actor (Stephen Graham), supporting actor (Owen Cooper), and supporting actress (Erin Doherty) in a miniseries. Netflix’s most-watched title, “KPop Demon Hunters,” won best animated feature and best original song.​\nNetflix’s Golden Globes sweep comes just as the company prepares for the biggest moves in Hollywood: the acquisition of Warner Bros. \n​As for the other streamers, Apple TV earned two awards for “The Studio,” one for best television series (musical or comedy) and another for best actor in a TV series, awarded to Seth Rogen. Rhea Seehorn also secured the best lead actress in a television drama for her performance in “Pluribus.”\nHBO found success with its medical drama “The Pitt,” which picked up two Golden Globes, including one for actor Noah Wylie. HBO’s third award was for best female actor in a TV series – musical or comedy (Jean Smart, “Hacks”). \n​Hulu’s lone win came from Michelle Williams, who earned best lead actress for “Dying for Sex.” However, titles like “Only Murders in the Building,” “The Bear,” “Paradise,” and “Chad Powers” didn’t convert their nominations into wins.​\nMeanwhile, Disney+ received 15 nominations — including for “Andor” and “Elio” — but did not secure any wins this year.​\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe Golden Globes also notably introduced a best podcast category, which Amy Poehler won for “Good Hang with Amy Poehler.” Other nominees included Alex Cooper’s “Call Her Daddy” and “Armchair Expert with Dax Shepard.”\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix had a huge night at the 2026 Golden Globes with 7 wins",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Netflix-Adolescence.jpeg?w=150"
      ],
      "datePublished": "2026-01-12T16:12:49.000Z",
      "dateModified": "2026-01-12T16:12:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google’s Gemini to power Apple’s AI features like Siri",
    "url": "https://techcrunch.com/2026/01/12/googles-gemini-to-power-apples-ai-features-like-siri/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/apple-intelligence-iphone-mac.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T17:12:41.000Z",
    "description": "\nIt’s official. Apple has chosen to work with Google, a longtime partner, to power AI features like Siri. \n“After careful evaluation, we determined th",
    "body": "\nIt’s official. Apple has chosen to work with Google, a longtime partner, to power AI features like Siri. \n“After careful evaluation, we determined that Google’s technology provides the most capable foundation for Apple Foundation Models and we’re excited about the innovative new experiences it will unlock for our users,” Apple and Google said in a statement.\nThe partnership confirms previous reporting on a deal with Google. Neither Apple nor Google have confirmed the price tag, but previous reports indicate Apple could be paying Google around $1 billion for access to its AI technology. The deal also comes after Apple spent some time testing the technology of competitors like OpenAI and Anthropic. \nThe multi-year partnership will involve Apple using Google’s Gemini models and cloud technology for future Apple foundational models. The deal is not exclusive, per a source familiar with the matter. Apple has historically focused on vertical integration, relying on its own hardware and software.\nThe iPhone-maker has faced a fair amount of public chatter criticizing it after its AI efforts, particularly its assistant Siri, lagged behind competitors. That’s not to say Apple hasn’t been quietly building powerful foundational models. The company released the first versions of Apple Intelligence in 2024, which adds AI to existing OS functions like searching for photos and summarizing notifications. Apple has also focused on privacy with its AI rollout, with much of the processing happening on-device or through tightly controlled infrastructure. Apple says it will maintain those privacy standards throughout its partnership with Google. \nThe firm’s strategy has resulted in a subtle, sometimes invisible, occasionally resented form of AI — one that doesn’t have the same wow factor as ChatGPT or Gemini. It also stops short of delivering the kind of Siri overhaul many users have been waiting for.\nApple has delayed the rollout of its “more personalized Siri” voice assistant several times, but a spokesperson told TechCrunch an upgrade is coming this year. Previous reports indicate the overhauled Siri is expected to launch in the spring. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nApple’s partnership with Google also comes as the search and adtech giant is in the midst of multiple antitrust lawsuits, including one that put its relationship with Apple front and center. In August 2024, a federal judge ruled that Google acted illegally to maintain a monopoly in online search by paying companies like Apple to present its search engine as the default on its devices and web browsers. Between 2021 and 2022, Google paid Apple about $38 billion to secure default search placements. \nIn December 2025, Judge Amit Mehta issued his final remedies on the case, which include banning Google from entering into exclusive, default agreements like the one it had with Apple “unless the agreement terminates no more than one year after the date it is entered.”\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google’s Gemini to power Apple’s AI features like Siri",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/apple-intelligence-iphone-mac.jpg?w=150"
      ],
      "datePublished": "2026-01-12T17:12:41.000Z",
      "dateModified": "2026-01-12T17:12:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Motional puts AI at center of robotaxi reboot as it targets 2026 for driverless service",
    "url": "https://techcrunch.com/2026/01/11/motional-puts-ai-at-center-of-robotaxi-reboot-as-it-targets-2026-for-driverless-service/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Motional-hyundai-robotaxi-vegas.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T00:10:54.000Z",
    "description": "\nNearly two years ago, Motional was at an autonomous vehicle crossroads. \nThe company, born from a $4 billion joint venture between Hyundai Motor Grou",
    "body": "\nNearly two years ago, Motional was at an autonomous vehicle crossroads. \nThe company, born from a $4 billion joint venture between Hyundai Motor Group and Aptiv, had already missed a deadline to launch a driverless robotaxi service with partner Lyft. It had lost Aptiv as one of its financial backers, prompting Hyundai to step up with another $1 billion investment to keep it going. Several layoffs, including a 40% restructuring cut in May 2024, had whittled the company from its peak of about 1,400 employees to less than 600. Meanwhile, advancements in AI were changing how engineers were developing the technology. \nMotional was going to have to evolve or die. It paused everything and picked option No. 1.\nMotional told TechCrunch it has rebooted its robotaxi plans with an AI-first approach to its self-driving system and a promise to launch a commercial driverless service in Las Vegas by the end of 2026. The company has already opened up a robotaxi service — with a human safety operator behind the wheel — to its employees. It plans to offer that service to the public with an unnamed ride-hailing partner later this year. (Motional has existing relationships with Lyft and Uber.) By the end of the year, the human safety operator will be pulled from the robotaxis and a true commercial driverless service will begin, the company said. \n“We saw that there was tremendous potential with all the advancements that were happening within AI; and we also saw that while we had a safe, driverless system, there was a gap to getting to an affordable solution that could generalize and scale globally,” Motional president and CEO Laura Major said during a presentation at the company’s Las Vegas facilities. “And so we made the very hard decision to pause our commercial activities, to slow down in the near term so that we could speed up.”\nImage Credits:Kirsten Korosec\nThis meant shifting away from its classic robotics approach to an AI foundation model-based one. Motional was never devoid of AI. Motional’s self-driving system used individual machine learning models to handle perception, tracking, and semantic reasoning. But it also used more rules-based programs for other operations within the software stack. And the individual ML models made it a complex web of software, Major said.\nMeanwhile, AI models originally built for language began to be applied in robots and other physical AI systems, including the development of autonomous driving. That transformer architecture made it possible to build large and complex AI models, ultimately leading to the emergence, and skyrocketing use, of ChatGPT. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMotional searched for ways to combine these smaller models and integrate them into a single backbone, allowing for an end-to-end architecture. It has also maintained the smaller models for developers, which Major explained gives Motional the best of both worlds.\n“This is really critical for two things; one is for generalizing more easily to new cities, new environments, new scenarios,” she said. “And the other is to do this in a cost-optimized way. So for example, the traffic lights might be different in the next city you go to, but you don’t have to redevelop or re-analyze those. You just collect some data, train the model, and it’s capable of operating safely in that new city.”\nTechCrunch got a firsthand look at Motional’s new approach during a 30-minute autonomous drive around Las Vegas. One demo can’t provide an accurate assessment of a self-driving system. It can, however, pinpoint weaknesses and differences from previous iterations, and gauge progress. \nProgress is what I saw as the Hyundai Ioniq 5 I rode in autonomously navigated its way off Las Vegas Boulevard and into the pickup and drop-off area of the Aria Hotel. These bustling areas are notorious in La Vegas and my experience was no different as the autonomous vehicle slowly nudged its way around a stopped taxi and unloading passengers, changed lanes, then back again, passing dozens of people, giant flower pots, and cars along the way. \nMotional previously operated a ride-hailing service in Las Vegas with partner Lyft using vehicles that would autonomously handle portions of a ride. Parking lots and hotel valet and app ride pickup areas were never part of those operations. A human safety operator, always behind the wheel, would take over to navigate parking lots or the busy pickup and drop-off points of hotel lobbies.\nThere is still more progress to be made. The graphics displayed to riders within the vehicle are still under development. And while there was never a disengagement during my demo ride — which means the human safety operator takes over — the vehicle did take its time to nudge itself around a double-parked Amazon delivery van.\nStill, Major argues Motional is on the right path to deploy safely and cost-effectively. And its majority owner Hyundai is in it for the long haul, she said.\n“I think the real long-term vision, you know, for all of this, is putting Level 4 on people’s personal cars,” Major said, referring to a term that mean the system handles all driving with no expectation of human intervention. “Robotaxis, that’s stop number one, and huge impact. But ultimately, I think any OEM would love to also integrate that into their cars.”\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Motional puts AI at center of robotaxi reboot as it targets 2026 for driverless service",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Motional-hyundai-robotaxi-vegas.jpg?w=150"
      ],
      "datePublished": "2026-01-12T00:10:54.000Z",
      "dateModified": "2026-01-12T00:10:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nuclear startups are back in vogue with small reactors, and big challenges",
    "url": "https://techcrunch.com/2026/01/11/nuclear-startups-are-back-in-vogue-with-small-reactors-and-big-challenges/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-157741219.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-11T16:15:00.000Z",
    "description": "\nThe nuclear industry is in the midst of a renaissance. Old plants are being refurbished, and investors are showering startups with cash. In the last ",
    "body": "\nThe nuclear industry is in the midst of a renaissance. Old plants are being refurbished, and investors are showering startups with cash. In the last several weeks of 2025 alone, nuclear startups raised $1.1 billion, largely on investor optimism that smaller nuclear reactors will succeed where the broader industry has recently stumbled.\nTraditional nuclear reactors are massive pieces of infrastructure. The newest reactors built in the U.S. — Vogtle 3 and 4 in Georgia —  contain tens of thousands of tons of concrete, are powered by fuel assemblies 14 feet tall, and generate over 1 gigawatt of electricity each. But they were also eight years late and more than $20 billion over budget.\nThe fresh crop of nuclear startups hopes that by shrinking the reactor, they’ll be able to sidestep both problems. Need more power? Just add more reactors. Smaller reactors, they argue, can be built using mass-production techniques, and as companies produce more parts, they should get better at making them, which should drive down costs.\nThe magnitude of that benefit is something experts are still researching, but today’s nuclear startups are depending on it being greater than zero.\nBut manufacturing isn’t easy. Just look at Tesla’s experience: The company struggled mightily to profitably produce the Model 3 in large numbers — and it had the benefit of being in the automotive industry, where the U.S. still has significant expertise. U.S. nuclear startups don’t have that advantage.\n“I have a number of friends who work in supply chain for nuclear, and they can rattle off like five to 10 materials that we just don’t make in the United States,” Milo Werner, general partner at DCVC, told TechCrunch. “We have to buy them overseas. We’ve forgotten how to make them.”\nWerner knows a thing or two about manufacturing. Before becoming an investor, she worked at Tesla leading new product introduction, and before that, she did the same at Fitbit, launching four factories in China for the wearables company. Today, in addition to investing at DCVC, Werner has co-founded the NextGen Industry Group, which works to advance the adoption of new technologies in the manufacturing sector.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhen companies of any size want to manufacture something, they face two main challenges, Werner said. One is capital, which is often the biggest constraint since factories aren’t cheap. Fortunately for the nuclear industry, that shouldn’t pose much of a problem. “They’re awash in capital right now,” she said.\nBut the nuclear industry isn’t immune from the other challenge all manufacturers face, which is a lack of human capital. “We haven’t really built any industrial facilities in 40 years in the United States,” Werner said. As a result, we’ve lost the muscle memory. “It’s like we’ve been sitting on the couch watching TV for 10 years and then getting up and trying to run a marathon the next day. It’s not good.”\nAfter decades of offshoring, the U.S. lacks people experienced with both factory construction and operations. “There are for sure some people in the United States who have been doing this, but we don’t have the quantum of people that we need for everybody to have a full staff of seasoned manufacturing people.” She is not just talking about machine operators, but everyone from factory floor supervisors all the way up to CFOs and board members.\nThe good news is that Werner sees a lot of startups, nuclear and otherwise, building early versions of their products in close proximity to their technical team. “That is pulling manufacturing in closer to the United States because it allows them to have that cycle of improvement.”\nTo reap the benefits of mass manufacturing, it’s helpful for startups of all stripes to start small and scale up. “Really leaning into modularity is very important for investors,” she said. The modular approach helps companies start producing small volumes early on so they can collect data on the manufacturing process. Ideally, that data will show improvement over time, which can put investors at ease. \nThe benefits of mass manufacturing don’t happen overnight. Companies will often forecast cost reductions that can result from learning through manufacturing, but it might take longer than they expect. “Often it takes years, like a decade, to get there,” Werner said.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nuclear startups are back in vogue with small reactors, and big challenges",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-157741219.jpeg?w=150"
      ],
      "datePublished": "2026-01-11T16:15:00.000Z",
      "dateModified": "2026-01-11T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indonesia and Malaysia block Grok over nonconsensual, sexualized deepfakes",
    "url": "https://techcrunch.com/2026/01/11/indonesia-blocks-grok-over-non-consensual-sexualized-deepfakes/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2223576505.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-11T15:07:49.000Z",
    "description": "\nOfficials from Indonesia and Malaysia have said they are temporarily blocking access to xAI’s chatbot Grok.\nThese are the most aggressive moves so fa",
    "body": "\nOfficials from Indonesia and Malaysia have said they are temporarily blocking access to xAI’s chatbot Grok.\nThese are the most aggressive moves so far from government officials responding to a flood of sexualized, AI-generated imagery — often depicting real women and minors, and sometimes depicting violence — posted by Grok in response to requests from users on the social network X. (X and xAI are part of the same company.)\nIn a statement shared Saturday with the Guardian and other publications, Indonesia’s communications and digital minister Meutya Hafid said, “The government views the practice of non-consensual sexual deepfakes as a serious violation of human rights, dignity, and the security of citizens in the digital space.”\nThe ministry has also reportedly summoned X officials to discuss the issue.\nThe New York Times said the Malaysian government announced a similar ban on Sunday.\nVaried governmental responses over the past week include an order from India’s IT ministry for X to take action to prevent Grok from generating obscene content, as well as an order from the European Commission for the company to retain all documents related to Grok, potentially setting the stage for an investigation.\nIn the United Kingdom, the communications regulator Ofcom has said that it will “undertake a swift assessment to determine whether there are potential compliance issues that warrant investigation.” Prime Minister Keir Starmer said in an interview that Ofcom has his “full support to take action.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAnd while in the United States, the Trump administration appears to be staying silent on the issue (xAI CEO Elon Musk is a major Trump donor and led the administration’s controversial Department of Government Efficiency last year), Democratic senators have called on Apple and Google to remove X from their app stores.\nxAI initially responded by posting a seemingly first-person apology to the Grok account, acknowledging that a post “violated ethical standards and potentially US laws” around child sexual abuse material. It later restricted the AI image-generation feature to paying subscribers on X, though that restriction did not appear to affect the Grok app itself, which still allowed anyone to generate images.\nIn response to a post wondering why the U.K. government wasn’t taking action against other AI image generation tools, Musk wrote, “They want any excuse for censorship.”\nThis post was first published on January 11. It has been updated to reflect Malaysia’s ban on Grok.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indonesia and Malaysia block Grok over nonconsensual, sexualized deepfakes",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2223576505.jpg?w=150"
      ],
      "datePublished": "2026-01-11T15:07:49.000Z",
      "dateModified": "2026-01-11T15:07:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "These Gen Zers just raised $11.75M to put Africa’s defense back in the hands of Africans",
    "url": "https://techcrunch.com/2026/01/12/these-gen-zers-just-raised-11-75m-to-put-africas-defense-back-in-the-hands-of-africans/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Nathan-Nwachuku-Maxwell-Maduka.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T08:00:00.000Z",
    "description": "\nAfter five years of building an edtech company, Nathan Nwachuku, 22, realized that Africa was at a crossroads. The continent is undergoing rapid indu",
    "body": "\nAfter five years of building an edtech company, Nathan Nwachuku, 22, realized that Africa was at a crossroads. The continent is undergoing rapid industrialization, he told TechCrunch. There is money, opportunity, and a young, driven population. He figured, soon enough, the continent was on the “edge of an industrial revolution.” \n“At the same time,” he said, he felt the continent still struggled to address what was one of its biggest Achilles’ heels: “Terrorism and insecurity.” Africa has more terror-related deaths than any region in the world, and it is this problem that could slow down — or even stop completely — the growth of the region, Nwachuku said. \nHe teamed up with a friend, Maxwell Maduka, 24, and launched Terra Industries, a defense company that designs infrastructure and autonomous systems to help governments and organizations monitor and respond to threats. The company announced Monday that it emerged from stealth with an $11.75 million round led by Joe Lonsdale’s 8VC. \nOthers in the round include Valor Equity Partners, Lux Capital, SV Angel, and Nova Global. The company previously raised an $800,000 pre-seed round, and Nwachuku said others took much interest in the company after it appeared on CNN. African investors in the company include Tofino Capital, Kaleo Ventures, and DFS Lab. \n“The goal is to build Africa’s first defense prime, to build autonomous defense systems and other systems to protect our critical infrastructure and resources from armed attacks,” Nwachuku, the company’s CEO, said. Maduka serves as the company’s CTO. \nThe team is stacked with military experience: 40% of its engineers held the same role in the Nigerian military; 8VC’s Alex Moore, who specializes in defense investing, is also on the board, and Nigeria’s Vice Air Marshal Ayo Jolasinmi serves as an advisor. Maduka also served as an engineer in the Nigerian Navy and founded a drone company at 19.\nThe company, based in Nigeria’s capital, Abuja, took a multi-domain approach to product development, considering how to protect critical infrastructure from the ground, water, and air. For the air, the company produces long-range and short-range drones. On the ground, it has surveillance towers and ground drones. The company is still working on developing maritime technology to help protect infrastructure such as offshore rigs and underwater pipelines. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTerra powers its tech with its proprietary software, ArtemisOS, which collects, analyzes, and synthesizes data in real time. Once threats are spotted, they alert response forces (such as security agencies) so they can intercept them. “We want to geofence all of Africa’s critical infrastructure and resources,” Nwachuku said, adding that the problem is not lack of firepower (many African armies already have that).\nInstead, it’s a lack of sovereign intelligence, as much of the intelligence that African countries depend on comes from Western powers, China, and Russia. \n“We want to take the defense of our continent’s resources and infrastructure into Africa’s own hands,” Nwachuku continued. “We are the first truly Pan-African defense company.” \nTerra recently won its first federal contract, though it said it cannot provide more details. The company makes money when governments and commercial customers place orders for Terra systems and then pay an annual fee for data processing and storage. Nwachuku said the company has generated more than $2.5 million in commercial revenue so far and is protecting assets valued at around $11 billion. \nCommercial revenue comes from protecting private infrastructure, like gold mines or power plants. Terra said it is protecting at least two hydro power plants and several smaller mines, with most of the company’s clientele coming from Nigeria. \nThe company hopes to use the fresh capital to help expand and build more defense factories across Africa. It also wants to further expand its software capabilities and grow its AI team. It will open software offices in San Francisco and London, but the company said manufacturing will remain in Africa, with more factories opening across the continent to boost job creation. \n“It’s clear Africa today is undergoing what I see as an epic struggle for its very survival,” Nwachuku said. “The only way for us to truly break ourselves from the shackles that have held us back for the last decade or two is ensuring the core resources, the core infrastructures of the continent, are entirely protected.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "These Gen Zers just raised $11.75M to put Africa’s defense back in the hands of Africans",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Nathan-Nwachuku-Maxwell-Maduka.jpg?w=150"
      ],
      "datePublished": "2026-01-12T08:00:00.000Z",
      "dateModified": "2026-01-12T08:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump’s EPA plans to ignore health effects of air pollution",
    "url": "https://techcrunch.com/2026/01/12/trumps-epa-plans-to-ignore-health-effects-of-air-pollution/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1371458478.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-12T19:23:13.000Z",
    "description": "\nEver since Ronald Reagan was president, the Environmental Protection Agency has assigned a value to human life. If you think too long about it, it’s ",
    "body": "\nEver since Ronald Reagan was president, the Environmental Protection Agency has assigned a value to human life. If you think too long about it, it’s a bit crass, but the upshot was to provide some cost-benefit analysis of pollution controls. Lowering pollution can prolong human life, so if the health benefits of reducing pollution outweighed the costs, then there was an economic argument to be made in favor of those reductions. \nEvery administration since has assigned some value to human life when determining how to regulate air pollution.\nThe Trump administration is planning to throw decades of accepted practice out the window, according to a report in the New York Times. If the EPA follows through on its plans, then it would no longer count the value of human health when regulating ozone and fine particulate matter pollution.\nThe risks of air pollution have been known for decades, which was part of the reason the EPA was founded under President Richard Nixon in the first place.\nOzone and fine particulate matter, also known as PM2.5, have long been linked to cardiovascular ailments like asthma, heart disease, and emphysema.\nOzone high in the atmosphere protects us against UV radiation. But when it forms close to the ground, as happens when oxides of nitrogen are emitted by everything from cars to power plants, it can create smog. On particularly smoggy days, it can be deadly to vulnerable populations.\nPM2.5 might be even more pernicious. Recent research has connected PM2.5 to a broader range of illnesses, including Parkinson’s, kidney disease, Alzheimer’s, dementia, and type 2 diabetes. Even the tiniest, youngest infants aren’t spared, since a mother’s exposure to PM2.5 has been linked to low birth weight. Worldwide, as many as 10 million people per year die from fine particulate matter pollution annually. MAHA indeed.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe policy change comes at a time when data centers have been increasingly reliant on dirtier sources of electricity. Elon Musk’s xAI, for example, used dozens of unpermitted natural gas turbines to power its Colossus data center near Memphis, Tennessee, a region the Asthma and Allergy Foundation of America said was already an “asthma capital” due to pollution from transportation and industry.\nThe U.S. Chamber of Commerce is welcoming the Trump administration’s policy change. “We appreciate the efforts of this administration to rebalance regulations with a common-sense approach. We look forward to examining the proposal from E.P.A,” Marty Durbin, president of the chamber’s Global Energy Institute, told the New York Times.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump’s EPA plans to ignore health effects of air pollution",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1371458478.jpg?w=150"
      ],
      "datePublished": "2026-01-12T19:23:13.000Z",
      "dateModified": "2026-01-12T19:23:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon says 97% of its devices can support Alexa+",
    "url": "https://techcrunch.com/2026/01/12/amazon-says-97-of-its-devices-can-support-alexa/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/alexa-plus-event.png?w=150",
    "tag": "Tech",
    "date": "2026-01-12T19:20:05.000Z",
    "description": "\nAmazon offered a bit more insight into how it sees its AI platform competing in the real world at the Consumer Electronics Show in Las Vegas last wee",
    "body": "\nAmazon offered a bit more insight into how it sees its AI platform competing in the real world at the Consumer Electronics Show in Las Vegas last week. Namely, Amazon plans to leverage the extensive footprint its devices already have in the home as well as consumers’ existing familiarity with its Alexa brand.\n“Ninety-seven percent of devices we ever shipped can support Alexa+,” noted Amazon Alexa and Echo VP Daniel Rausch in an interview at CES. He said the latest figures Amazon has on hand indicate the company has sold more than 600 million devices, and the “vast majority” will support its revamped AI assistant, Alexa+.\nAnnounced early last year, Alexa+ is Amazon’s future in the generative AI market, offering more expressive voices, access to world knowledge similar to other AI assistants, and AI agents that perform tasks on behalf of the customer — like calling an Uber or ordering food. The company has been steadily rolling out access to the AI platform, with more than 1 million Alexa customers gaining access by last June, and now, “tens of millions” can opt in to upgrade to the AI assistant.\nAmazon doesn’t have an exact date for when Alexa+ will be available to everyone; the company is focusing first on bringing the AI to all Prime members.\nWhat Amazon soon has to prove, beyond availability, is whether customers will actually use its AI. That’s where Rausch believes Alexa’s existing footprint will help. \n“I think that there’s going to be a whole range of AI out there for customers. I think that Alexa will be one of the foundational assistants,” he said. While he believes there will always be some specialist AIs on the market, like those that focus on one thing, like being a legal assistant, there will be a few “nameable, foundational AIs that are highly capable,” which is where Alexa slots in.\n“I think some of the advantages Alexa has is the familiarity of customers, the tens of millions of customers already engaging continuously,” Rausch said. “It’s in the home, ambiently available, in voice, in the most natural interface. I do believe that that’s our opportunity to grow,” he added.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAlexa’s plans for the home come as Apple announced it’s teaming up with Google’s Gemini for Siri, as other AI chatbots, like ChatGPT and Claude, compete across a variety of use cases ranging from research to healthcare to coding and more. \nJust ahead of CES, Amazon announced a way to access Alexa on the web and a redesigned Alexa app that puts a chatbot-style interface front and center. At the conference, Amazon partners like Samsung, BMW, and Oura showed off their Alexa integrations.\nThe company also promoted its recent acquisition of Bee, an AI wearable that lets you record conversations and gain insights. Customers can engage with Bee via text or voice chat.\nIn the future, Rausch says Alexa and Bee will become more integrated. But, he added, Bee has value as its own standalone brand, calling it a “an important and lovable experience.”\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon says 97% of its devices can support Alexa+",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/alexa-plus-event.png?w=150"
      ],
      "datePublished": "2026-01-12T19:20:05.000Z",
      "dateModified": "2026-01-12T19:20:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]