[
  {
    "title": "Grok got crucial facts wrong about Bondi Beach shooting",
    "url": "https://techcrunch.com/2025/12/14/grok-gets-the-facts-wrong-about-bondi-beach-shooting/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-14T23:17:47.000Z",
    "description": "\nGrok, the chatbot built by Elon Musk’s xAI and popularized on his social media platform X, appears to have repeatedly spread misinformation about tod",
    "body": "\nGrok, the chatbot built by Elon Musk’s xAI and popularized on his social media platform X, appears to have repeatedly spread misinformation about today’s mass shooting at Bondi Beach in Australia.\nGizmodo pointed to a number of posts where Grok misidentified the bystander — 43-year-old Ahmed al Ahmed — who disarmed one of the gunmen, and where it questioned the authenticity of videos and photos capturing al Ahmed’s actions.\nIn one post, the chatbot misidentified the man in a photo as an Israeli hostage, and in another post brought up irrelevant information about the Israeli army’s treatment of Palestinians. In another post, it claimed a “43-year-old IT professional and senior solutions architect” named Edward Crabtree was the one who actually disarmed a gunman.\nGrok does appear to be fixing some of its mistakes. At least one post that reportedly claimed a video of the shooting actually showed Cyclone Alfred has been corrected “upon reevaluation.”\nAnd the chatbot subsequently acknowledged al Ahmed’s identity, writing that the “misunderstanding arises from viral posts that mistakenly identified him as Edward Crabtree, possibly due to a reporting error or a joke referencing a fictional character.” (The article in question appeared on a largely non-functional news site that may be AI-generated.)\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grok got crucial facts wrong about Bondi Beach shooting",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150"
      ],
      "datePublished": "2025-12-14T23:17:47.000Z",
      "dateModified": "2025-12-14T23:17:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI data center boom could be bad news for other infrastructure projects",
    "url": "https://techcrunch.com/2025/12/13/ai-data-center-boom-could-be-bad-news-for-other-infrastructure-projects/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2152222109.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-13T19:37:47.000Z",
    "description": "\nIn Brief\nPosted:\n11:37 AM PST · December 13, 2025\n\nImage Credits:MONEY SHARMA / AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nImprove",
    "body": "\nIn Brief\nPosted:\n11:37 AM PST · December 13, 2025\n\nImage Credits:MONEY SHARMA / AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nImprovements to roads, bridges, and other infrastructure could take a hit as data center construction accelerates, according to Bloomberg.\nIn 2025, state and local governments reportedly sold a record amount of debt for the second year in a row, with strategists predicting another $600 billion in sales next year. Most of that money is expected to fund infrastructure projects. \nMeanwhile, Census Bureau data reportedly shows that private spending on data center construction was running at annualized run rate of more than $41 billion — roughly the same as state and local government spending on transportation construction.\nAll these projects are likely to compete for construction workers just as the industry faces labor shortages from retirements and President Donald Trump’s immigration crackdown.\nAndrew Anagnost, CEO of architecture and design software maker Autodesk, told Bloomberg there’s “absolutely no doubt” that data center construction “sucks resources from other projects.\n“I guarantee you a lot of those [infrastructure] projects are not going to move as fast as people want,” he said.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI data center boom could be bad news for other infrastructure projects",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2152222109.jpg?w=150"
      ],
      "datePublished": "2025-12-13T19:37:47.000Z",
      "dateModified": "2025-12-13T19:37:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft buys 3.6M metric tons of carbon removal from bioenergy plant",
    "url": "https://techcrunch.com/2025/12/12/microsoft-buys-3-6m-metric-tons-of-carbon-removal-from-bioenergy-plant/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/1765443854968.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T19:16:10.000Z",
    "description": "\nMicrosoft announced Thursday it would buy 3.6 million carbon removal credits from a biofuels plant in Louisiana owned by C2X. The plant, which is sla",
    "body": "\nMicrosoft announced Thursday it would buy 3.6 million carbon removal credits from a biofuels plant in Louisiana owned by C2X. The plant, which is slated to begin operating in 2029, will process forestry waste into methanol, which can be used to power ships and planes and as a raw material for chemical manufacturing. Altogether, the facility will produce more than 500,000 metric tons of methanol. About 1 million metric tons of carbon dioxide will be captured and stored, likely underground.\nThe purchase is one of many that Microsoft has made in the last year or so, including a 4.9 million metric ton deal with Vaulted Deep, a 3.7 million metric ton agreement with CO280, and a 7 million metric ton buy from Chestnut Carbon. Microsoft’s rapid expansion of its data center footprint has imperiled its 2030 pledge to remove more carbon from the atmosphere than it generates. While the company also buys large amounts of renewable and nuclear power, carbon renewal purchases like these will help offset future fossil fuel emissions.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft buys 3.6M metric tons of carbon removal from bioenergy plant",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/1765443854968.jpeg?w=150"
      ],
      "datePublished": "2025-12-12T19:16:10.000Z",
      "dateModified": "2025-12-12T19:16:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Data breach at credit check giant 700Credit affects at least 5.6 million",
    "url": "https://techcrunch.com/2025/12/12/data-breach-at-credit-check-giant-700credit-affects-at-least-5-6-million/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/social-security-cards-104145260.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T17:35:46.000Z",
    "description": "\nIn Brief\nPosted:\n9:35 AM PST · December 12, 2025\n\nImage Credits:Glowimages / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least 5.6 mil",
    "body": "\nIn Brief\nPosted:\n9:35 AM PST · December 12, 2025\n\nImage Credits:Glowimages / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least 5.6 million people had their names, addresses, dates of birth, and Social Security numbers stolen in a data breach at 700Credit, a company that runs credit checks and identity verification services for auto dealerships across the United States.\nIn a statement on its website, the Michigan-based company blamed the October data breach on an unidentified bad actor.\nAccording to Michigan’s attorney general, the hacker stole personal data collected from dealers between May and October 2025.\nThe company said it was now sending letters by mail to individuals whose information had been stolen in the data breach, which offers credit monitoring services.\n“If you get a letter from 700Credit, don’t ignore it,” said Michigan attorney general Dana Nessel. “It is important that anyone affected by this data breach takes steps as soon as possible to protect their information. A credit freeze or monitoring services can go a long way in preventing fraud, and I encourage Michiganders to use the tools available to keep their identity safe.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Data breach at credit check giant 700Credit affects at least 5.6 million",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/social-security-cards-104145260.jpg?w=150"
      ],
      "datePublished": "2025-12-12T17:35:46.000Z",
      "dateModified": "2025-12-12T17:35:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DoorDash driver faces felony charges after allegedly spraying customers’ food",
    "url": "https://techcrunch.com/2025/12/13/doordash-driver-faces-felony-charges-after-allegedly-spraying-customers-food/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/09/doordash.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-13T21:06:51.000Z",
    "description": "\n\t\n\t\tImage Credits:DoorDash / file photo\t\n\t\n\t\t\t\t\t\t1:06 PM PST · December 13, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nA woman is facing felony charges in Evansville, Indi",
    "body": "\n\t\n\t\tImage Credits:DoorDash / file photo\t\n\t\n\t\t\t\t\t\t1:06 PM PST · December 13, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nA woman is facing felony charges in Evansville, Indiana over a DoorDash delivery in which she allegedly sprayed the food with a substance that made the customers vomit.\nIn a press release, the Vanderburgh County Sheriff’s Office said that it was contacted on December 7 by a man who said that he and his wife vomited and experienced a burning sensation in their mouth, nose, throat, and stomachs after eating fast food ordered through DoorDash.\nThe man told NBC News that he noticed something red had been sprayed on the delivery bag, so he checked footage from their doorbell camera. According to the sheriff’s department, the footage shows that after dropping off the food and taking a photo, the woman appeared to spray a substance towards the food from a small aerosol can attached to her keychain.\nThe sheriff’s department said that using DoorDash records, detectives identified the woman as Kourtney Stevenson of Kentucky, who told local police in a phone call that she had been working for DoorDash while visiting her father, and that she’d used pepper spray to spray a spider. But the department also said that with an overnight low of 35 degrees Fahrenheit, “outdoor spiders in Indiana are not active and would not be capable of crawling on exposed surfaces.”\nWhen Stevenson allegedly declined to come in for an interview, detectives obtained a warrant to arrest her for battery resulting in a moderate injury and consumer product tampering. She is now awaiting extradition to Indiana.\nA DoorDash spokesperson said in a statement that Stevenson has been banned from the platform.\n“We have absolutely zero tolerance for this type of appalling behavior,” the spokesperson said. “The Dasher’s access to the platform has been permanently removed, and our team is supporting law enforcement with their investigation.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe New York Times and NBC News both report that it’s not clear if Stevenson has a lawyer who can comment on her behalf.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DoorDash driver faces felony charges after allegedly spraying customers’ food",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/09/doordash.jpg?w=150"
      ],
      "datePublished": "2025-12-13T21:06:51.000Z",
      "dateModified": "2025-12-13T21:06:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google and Apple roll out emergency security updates after zero-day attacks",
    "url": "https://techcrunch.com/2025/12/12/google-and-apple-roll-out-emergency-security-updates-after-zero-day-attacks/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/iphone-trenchant-l3harris-1059636822.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T20:31:36.000Z",
    "description": "\nApple and Google have released several software updates to protect against a hacking campaign targeting an unknown number of their users.\nOn Wednesda",
    "body": "\nApple and Google have released several software updates to protect against a hacking campaign targeting an unknown number of their users.\nOn Wednesday, Google released patches for a handful of security bugs in its Chrome browser, noting that one of the bugs was being actively exploited by hackers before the company had time to patch it. \nUnusually for Google, the company provided no further details at the time. \nBut on Friday, Google updated the page to say that the bug was discovered by Apple’s security engineering team and Google’s Threat Analysis Group, whose security researchers primarily track government hackers and mercenary spyware makers, indicating that the hacking campaign may have been orchestrated by government-backed hackers.\nAt the same time, Apple released security updates for its flagship products, including iPhones, iPads, Macs, Vision Pro, Apple TV, Apple Watches, and its Safari browser.\nAccording to the security advisory for iPhones and iPads, Apple patched two bugs and the company said it was aware “that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals” running devices prior to iOS 26.\nThat language is Apple’s typical way of saying that it knows some of its customers and users were targeted by hackers exploiting zero-days, meaning flaws that at the time of exploitation are unknown to the software makers. Often, these are cases where government hackers used hacking tools and spyware made by companies such as NSO Group or Paragon Solutions to target journalists, dissidents, and human rights activists. \nApple and Google did not immediately respond to a request for comment. \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google and Apple roll out emergency security updates after zero-day attacks",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/iphone-trenchant-l3harris-1059636822.jpg?w=150"
      ],
      "datePublished": "2025-12-12T20:31:36.000Z",
      "dateModified": "2025-12-12T20:31:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home Depot exposed access to internal systems for a year, says researcher",
    "url": "https://techcrunch.com/2025/12/12/home-depot-exposed-access-to-internal-systems-for-a-year-says-researcher/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/home-depot-2200450751.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T16:42:57.000Z",
    "description": "\nA security researcher said Home Depot exposed access to its internal systems for a year after one of its employees published a private access token o",
    "body": "\nA security researcher said Home Depot exposed access to its internal systems for a year after one of its employees published a private access token online, likely by mistake. The researcher found the exposed token and tried to privately alert Home Depot to its security lapse but was ignored for several weeks. \nThe exposure is now fixed after TechCrunch contacted company representatives last week.\nSecurity researcher Ben Zimmermann told TechCrunch that, in early November, he found a published GitHub access token belonging to a Home Depot employee, which was exposed sometime in early 2024. \nWhen he tested the token, Zimmermann said that it granted access to hundreds of private Home Depot source code repositories hosted on GitHub and allowed the ability to modify their contents. \nThe researcher said the keys allowed access to Home Depot’s cloud infrastructure, including its order fulfillment and inventory management systems, and code development pipelines, among other systems. Home Depot has hosted much of its developer and engineering infrastructure on GitHub since 2015, according to a customer profile on GitHub’s website.\nZimmermann said he sent several emails to Home Depot but didn’t hear back. \nNor did he get a response from Home Depot’s chief information security officer, Chris Lanzilotta, after sending a message over LinkedIn.\nZimmermann told TechCrunch that he has disclosed several similar exposures in recent months to companies, which have thanked him for his findings. \n“Home Depot is the only company that ignored me,” he said.\nGiven that Home Depot does not have a way to report security flaws, such as a vulnerability disclosure or bug bounty program, Zimmermann contacted TechCrunch in an effort to get the exposure fixed.\nWhen reached by TechCrunch on December 5, Home Depot spokesperson George Lane acknowledged receipt of our email but did not respond to follow-up emails asking for comment. The exposed token is no longer online, and the researcher said the token’s access was revoked soon after our outreach.\nWe also asked Lane if Home Depot has the technical means, such as logs, to determine if anyone else used the token during the months it was left online to access any of Home Depot’s internal systems. We did not hear back.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home Depot exposed access to internal systems for a year, says researcher",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/home-depot-2200450751.jpg?w=150"
      ],
      "datePublished": "2025-12-12T16:42:57.000Z",
      "dateModified": "2025-12-12T16:42:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mesa shuts down credit card that rewarded cardholders for paying their mortgages",
    "url": "https://techcrunch.com/2025/12/14/mesa-shuts-down-credit-card-that-rewarded-cardholders-for-paying-their-mortgages/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/05/GettyImages-1071635072-e1648082541422.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-14T21:37:44.000Z",
    "description": "\nFintech startup Mesa has shut down its Homeowners Card, which awarded points to cardholders for paying their mortgages.\nA message on the Mesa website",
    "body": "\nFintech startup Mesa has shut down its Homeowners Card, which awarded points to cardholders for paying their mortgages.\nA message on the Mesa website states that as of December 12, “all Mesa Homeowners Card accounts are closed,” adding, “All credit cards have been deactivated and you are no longer able to make any new purchases or earn Mesa Points.”\nA Mesa FAQ about the shutdown described this as “a business decision to close the Mesa Homeowners Card Program entirely.” TechCrunch has reached out to Mesa for additional comment on its future plans.\nThe startup launched just over a year ago, in November 2024, with $9.2 million in funding ($7.2 million in equity funding and $2 million in debt). It offered two products — mortgage loans with 1% cash back, as well as the credit card with rewards including cash back, travel, and offset mortgage payments.\nAt the time, CEO Kelley Halpin told TechCrunch that the startup had “taken what everybody loves about travel and dining cards to re-contextualize that for the homeowner/parent.”\nIn theory, you could earn points for home expenses by using any credit card with rewards, but Mesa said it structured its points program to incentivize spending related to home ownership.\n“So it’s not rewarding you on travel and dining spend; it’s rewarding you on gas, groceries, your HOA, utilities, home goods as well as your mortgage payment,” Halpin said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBilt, which has a rewards card that allows customers to earn points on rent payments, says it will expand with points for mortgage payments when it launches a revamped card next year.\nMesa’s card shutdown has been covered by travel deals websites like One Mile at a Time and Upgraded Points, which say that Mesa cardmembers have been complaining about declined transactions for the past week, with the company initially claiming this was only a temporary outage.\nNow, it seems the only remaining way to redeem points earned on the Mesa card is through a statement credit at a rate of 0.6%.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mesa shuts down credit card that rewarded cardholders for paying their mortgages",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/05/GettyImages-1071635072-e1648082541422.jpg?w=150"
      ],
      "datePublished": "2025-12-14T21:37:44.000Z",
      "dateModified": "2025-12-14T21:37:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India’s Spinny lines up $160M funding to acquire GoMechanic, sources say",
    "url": "https://techcrunch.com/2025/12/13/indias-spinny-lines-up-160m-funding-to-acquire-gomechanic-sources-say/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/spinny.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-14T04:30:07.000Z",
    "description": "\nSpinny, an Indian online marketplace for used cars, is raising around $160 million as it moves to acquire car services startup GoMechanic, TechCrunch",
    "body": "\nSpinny, an Indian online marketplace for used cars, is raising around $160 million as it moves to acquire car services startup GoMechanic, TechCrunch has learned.\nThe Series G round, which includes a mix of primary and secondary transactions, would value the 10-year-old startup at about $1.8 billion post-money, three people familiar with the matter said, broadly in line with its previous valuation. \nNearly $90 million of the round is primary, people said; Existing investor Accel has already wired about $44 million of that amount, with some details of the investment appearing in regulatory filings in India this week, which Indian outlet Entrackr first reported. A new investor is participating in the remaining portion of the primary, but TechCrunch could not confirm its specifics.\nWestBridge Capital is doubling down in the new round with a check of a similar size to its previous investment, the people said. The firm invested about $35 million to $40 million in Spinny’s Series F round earlier this year.\nMuch of the secondary portion of the transaction is being sold by Indian VC firm Fundamentum, according to the people, while Blume Ventures is also expected to pare part of its stake.\nAccel, Fundamentum, and Blume Ventures did not respond to requests for comments. WestBridge Capital declined to comment.\nIn March, Spinny raised $131 million in the first part of its Series F round led by Accel, with participation from Fundamentum, before expanding the raise to about $170 million in June to include WestBridge Capital. Those funds were earmarked to scale Spinny’s core used-car business. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nHowever, the new round is being raised specifically to finance the acquisition of GoMechanic and invest in its platform, without drawing on the startup’s existing cash reserves, the people said. Earlier reports suggested Spinny could buy GoMechanic for around ₹4.5 billion (approximately $49.70 million) in a cash-and-stock deal.\nA consortium led by Lifelong Group acquired GoMechanic in 2023 after the startup admitted to “grave errors” in its financial reporting. The startup had previously been backed by high-profile investors, including Sequoia Capital, Tiger Global, and SoftBank.\nFor Spinny, acquiring GoMechanic would deepen its control across the used-car value chain. The Gurugram-based startup has built a large consumer-facing business, selling about 13,000 used cars a month, primarily directly to buyers and, to a lesser extent, to dealers through its auction platform. Spinny operates its own large reconditioning centers to refurbish vehicles before sale and relies on third-party service shops for after-sales servicing of customer cars — a gap GoMechanic could bring in-house.\nGoMechanic would also act as a “two-way” funnel for Spinny, a person familiar with the matter said. The platform would service vehicles bought or sold through Spinny, and help attract car owners who may not yet be customers. That could help expand Spinny’s vehicle supply without significantly increasing customer acquisition costs.\nThe acquisition comes as India’s used-car market is projected to grow at a compound annual growth rate of about 10% to roughly 9.5 million units by 2030, from nearly 6 million units today, per a recent report by Mahindra First Choice and Volkswagen Pre-owned Certified. \nThe GoMechanic deal would mark Spinny’s latest move to broaden its footprint in India’s automotive market. In recent months, the startup has expanded beyond used-car sales by acquiring auto publications Autocar India, Autocar Professional and What Car? India from London-based media group Haymarket, and by launching a non-banking finance company, Spinny Capital, to offer vehicle loans to customers.\nSpinny co-founder and CEO Niraj Singh declined to comment.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India’s Spinny lines up $160M funding to acquire GoMechanic, sources say",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/spinny.jpg?w=150"
      ],
      "datePublished": "2025-12-14T04:30:07.000Z",
      "dateModified": "2025-12-14T04:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With iOS 26.2, Apple lets you roll back Liquid Glass again — this time on the Lock Screen",
    "url": "https://techcrunch.com/2025/12/12/with-ios-26-2-apple-lets-you-roll-back-liquid-glass-again-this-time-on-the-lock-screen/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/iphone-air.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T20:45:00.000Z",
    "description": "\nApple is releasing another tool to dial down Liquid Glass’ transparency with its release of iOS 26.2, out now. With the update, users will be able to",
    "body": "\nApple is releasing another tool to dial down Liquid Glass’ transparency with its release of iOS 26.2, out now. With the update, users will be able to control the transparency of the Lock Screen’s clock. The release follows an update that introduced a slider for controlling the opacity of Liquid Glass elements through the operating system, following user complaints that the changes made their iPhone or other Apple device too hard to read.\nLaunched with iOS 26, the new design language for Apple devices turns various interface elements like buttons, sliders, and notifications semi-transparent. The elements also refract light, giving them the optical qualities of glass.\nMeant to modernize Apple’s operating systems and potentially prepare for a world where the operating system moves to AI smart glasses, Liquid Glass received mixed reviews. Some found that the transparency made their device difficult to use, as it became tricky to read key items, like notifications or the name of an artist in Apple Music. In response to user complaints, Apple released a Liquid Glass tool in iOS 26.1 that allowed users to return their interface to a more “frosted” look, if desired.\nWith the slider for the Clock’s “glassiness,” Apple is again rolling back the transparency of the Liquid Glass update, but in the form of another user-controlled customization feature, instead of a global change.\nImage Credits:iPhone screenshot by TechCrunch\nThese tweaks are notable as they telegraph that perhaps Apple isn’t standing 100% behind the design overhaul as being perfect as is.\nThe timing of the change is worth noting, too. Earlier this month, Apple confirmed the design executive behind the Liquid Glass makeover, Alan Dye, was leaving the company for Meta. While it didn’t appear that Dye was pushed out, Apple replaced him with longtime Apple designer Stephen Lemay. \nUnlike Dye, Lemay’s career was spent in interface and interaction design — a skill set called for when it comes to fixing Liquid Glass, it can be argued.\n\niOS 26.2 brought other new features beyond the latest Liquid Glass tweak.\nAs in the betas, users can now create AirDrop codes to share with people not in their contacts, allowing them to become a “known” AirDrop contact for a 30-day period. The feature might make sense at work or in other scenarios where you need to share files or photos with someone not stored in your Contacts.\nAlso in iOS 26.2, the Reminders supports alarms; Apple News gains a Following tab at the bottom nav bar along with other navigation changes; Apple Music adds offline lyrics; and the Podcasts app adds AI-generated chapters for podcast episodes, a Podcast Mention feature for linking to other shows, and other changes. \nApple Watch owners will also now get a Sleep Score based on how well they slept and if they met their sleep goals. \nApple also released several important security updates across its flagship products on Friday, including iPhones, iPads, Macs, Apple TVs, and Apple Watches, to patch vulnerabilities used in an active hacking campaign.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With iOS 26.2, Apple lets you roll back Liquid Glass again — this time on the Lock Screen",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/iphone-air.jpg?w=150"
      ],
      "datePublished": "2025-12-12T20:45:00.000Z",
      "dateModified": "2025-12-12T20:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Retro, a photo-sharing app for friends, lets you ‘time-travel’ through your camera roll",
    "url": "https://techcrunch.com/2025/12/12/retro-a-photo-sharing-app-for-friends-lets-you-time-travel-through-your-camera-roll/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/07/Retro.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T16:53:28.000Z",
    "description": "\nRetro, a friend-focused photo-sharing app with roughly a million users, is adding a new feature that lets you time-travel through your old photo memo",
    "body": "\nRetro, a friend-focused photo-sharing app with roughly a million users, is adding a new feature that lets you time-travel through your old photo memories from your phone’s camera roll. While the app today offers a way to share photos of what’s happening during your week with a private group of friends, or create shared albums, this latest addition, dubbed “Rewind,” is private to you — unless you choose to share the photos with others.\nRetro’s co-founder, Nathan Sharp, explains that the idea for Rewind was inspired by a feature the app already offered and was proving popular.\nToday, at the end of the row showcasing the photos your friends shared during the week, there’s a card you can tap that will let you view your own photos from that same week a year ago. \nHowever, that option wasn’t accessible to newer Retro users, since they hadn’t yet uploaded enough photos to the app to take advantage of the photo memories feature.\nImage Credits:Retro\n“If you’re a new user, you don’t really have the opportunity to go time-travel through your memories in this way,” said Sharp, who had spent over six years at Meta working on products like Instagram Stories and Facebook Dating, before leaving to found his own photo-sharing startup with Ryan Olson, Retro’s CTO, in 2022.\n“The other problem that we saw was that people take more photos than ever, but they actually do less with that volume of photos than ever before. So it’s almost as if those photos go into the ether,” he added.\nThe addition, to some extent, is pushback against the growing trend of AI-generated content and “for you” feed-style algorithms.\n“As people engage with those platforms more and more, something that has to be true and will be true is that people will still want to see more of their friends,” Sharp says. “The photos and videos you take will need to find a place where they can reach the intended audience.”\nImage Credits:Retro\nAlthough nearly half (45.7%) of Retro’s users participate in the app on a daily basis, the Rewind feature could boost that engagement even higher.  \nTo try Rewind, you can either launch it from the end of the row of shared photos, just past the “this week in” card, or from its more prominent position as the middle tab in the bottom navigation bar. \nWhen launched, there’s a haptic response as the screen starts cycling through the older photos pulled from your camera roll. These memories aren’t being shared, but you can tap on the share icon if you feel inspired to send them to a friend or post them. In addition, you can opt to hide photos you’d rather not see (like those of an ex), or tap a “dice” icon to be taken to a random memory instead.\nAs the iPod-inspired dial clicks back into your past, you’ll feel a subtle vibration as each new memory loads. You can also spin the dial to move forward or backward in time, watching the photos from months and years past flip by on the screen, pausing at those you want to view longer or share.\nImage Credits:Retro screenshot/TechCrunch\nYou can press and hold on any photo to see it uncropped, and when you share a photo, a timestamp is added at the bottom so friends will understand it’s not a new pic. \nWhile screenshots won’t appear in this photo archive, other photos — like those of receipts or whiteboards at work will show up, as they could still be interesting memories to you. (And if you come across a photo you don’t need to keep, deleting it from the app will also delete it from your camera roll.)\nThe idea to look back at older photo memories is hardly new, of course.\nIn the past, a startup called Timehop popularized the idea of doing something more with our growing digital photo archives by allowing users to revisit old photos through its simple mobile app. Later, Facebook copied the idea for its “On This Day” feature, and photo-hosting services like Google Photos and Apple Photos added memories features of their own.\nStill, Sharp doesn’t believe these will be direct competitors for Retro. Facebook, over the years, has downranked friends’ content as its feed became filled with links, news, and ads. Meanwhile, people tend to think of Apple’s and Google’s photo apps more as utilities for managing and storing photos, not as social apps like Retro.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Retro, a photo-sharing app for friends, lets you ‘time-travel’ through your camera roll",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/07/Retro.jpg?w=150"
      ],
      "datePublished": "2025-12-12T16:53:28.000Z",
      "dateModified": "2025-12-12T16:53:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Translate now lets you hear real-time translations in your headphones",
    "url": "https://techcrunch.com/2025/12/12/google-translate-now-lets-you-hear-real-time-translations-in-your-headphones/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T17:00:00.000Z",
    "description": "\nGoogle is rolling out a beta experience that lets you hear real-time translations in your headphones, the company announced on Friday. The tech giant",
    "body": "\nGoogle is rolling out a beta experience that lets you hear real-time translations in your headphones, the company announced on Friday. The tech giant is also bringing advanced Gemini capabilities to Google Translate and expanding its language-learning tools in the Translate app.\nThe new real-time headphone translations experience keeps each speaker’s tone, emphasis, and cadence intact, so it’s easier to follow the conversation and tell who’s saying what, Google says. The new capability essentially turns any pair of headphones into a real-time, one-way translation device. \n“Whether you’re trying to have a conversation in a different language, listen to a speech or lecture while abroad, or watch a TV show or film in another language, you can now put in your headphones, open the Translate app, tap ‘Live translate’ and hear a real-time translation in your preferred language,” said Rose Yao, Google VP Product Management, Search Verticals, in the blog post.\nImage Credits:Google\nThe beta is rolling out now in the Translate app on Android in the U.S., Mexico, and India. The feature works with any pair of headphones and supports more than 70 languages.\nThe company plans to bring the capability to iOS and more countries in 2026. \nAs for the advanced Gemini capabilities coming to Translate, Google says they will enable smarter, more natural, and accurate text translations. They’ll also enable improved translations of phrases with more nuanced meanings, like slang, idioms, or local expressions.\nFor example, if you’re trying to translate an English idiom like “stealing my thunder,” you’ll now get a more accurate translation instead of a literal word-for-word translation, as Gemini will parse the context to capture what the idiom really means.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Google\nThis update is rolling out now in the U.S. and India, translating between English and nearly 20 languages, including Spanish, Arabic, Chinese, Japanese, and German. The update is available in the Translate app on Android, iOS, and on the web.\nGoogle is also expanding its language learning tools to almost 20 new countries, including Germany, India, Sweden, and Taiwan. English speakers can now practice German, while Bengali, Mandarin Chinese (Simplified), Dutch, German, Hindi, Italian, Romanian, and Swedish speakers can practice English. \nThe tech giant is also adding improved feedback so you can get helpful tips based on your speaking practice. \nAdditionally, Google is adding a feature that tracks how many days in a row you’ve been learning, making it easier to see your progress and stay consistent. While the tools were already designed to take on Duolingo, this new feature brings the experience even closer to the popular language-learning app.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Translate now lets you hear real-time translations in your headphones",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150"
      ],
      "datePublished": "2025-12-12T17:00:00.000Z",
      "dateModified": "2025-12-12T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp’s biggest market is becoming its toughest test",
    "url": "https://techcrunch.com/2025/12/14/whatsapps-biggest-market-is-becoming-its-toughest-test/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/04/GettyImages-1237939625.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-15T01:30:00.000Z",
    "description": "\nWhatsApp, Meta’s messaging app that millions of Indians rely on daily, is facing a critical moment in India as recent government directions threaten ",
    "body": "\nWhatsApp, Meta’s messaging app that millions of Indians rely on daily, is facing a critical moment in India as recent government directions threaten to disrupt how the platform works for everyday users and businesses.\nIssued late last month and made public earlier this month, the directions ask certain app-based communication services to keep accounts continuously linked to an active SIM card and impose stricter controls on how the apps function across devices.\nNew Delhi says the measures are aimed at curbing rising cyber fraud in India, the world’s most populous nation. Digital advocacy groups, policy experts, and industry groups representing major digital platforms — including Meta — have warned, however, that the approach risks regulatory overreach and could disrupt legitimate use, especially in a country where WhatsApp has evolved into everyday infrastructure for personal communication and small-business commerce.\nThe directions, which app providers including Meta, Telegram, and Signal must comply with within 90 days of their issuance on November 28, require messaging apps to remain tied to the SIM card used at sign-up. The web and desktop versions of these apps also require users to log out every six hours and re-link their devices via a QR code to regain access.\n“Mandatory continuous SIM–device binding and periodic logout ensure that every active account and web session is anchored to a live, KYC-verified SIM, restoring traceability of numbers used in phishing, investment, digital arrest, and loan scams,” the telecom ministry said in a press release earlier this month, adding that India suffered cyber-fraud losses exceeding ₹228 billion (about $2.5 billion) in 2024 alone.\nThe Indian government has clarified that the rules do not apply when the SIM remains in the device, and the user is roaming.\nWhile the directions apply broadly to major instant messaging apps, their impact is likely to be felt most acutely by WhatsApp, which is used by more than 500 million people in India. The app’s adoption in India is also unusually deep. As much as 94% of WhatsApp’s Indian monthly user base opened the app daily in November, while 67% of WhatsApp Business users in the country did the same, according to Sensor Tower data shared with TechCrunch. By comparison, 59% of WhatsApp monthly users in the U.S. opened the app daily, alongside 57% for WhatsApp Business.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMany merchants in India rely on the WhatsApp Business app — a smartphone-based version of the service tailored for small enterprises — typically registering the account on a SIM-linked phone while handling customer conversations through WhatsApp’s web or desktop client on another device. Unlike larger companies that use WhatsApp’s Business APIs for automated, CRM-linked communication, these small businesses access their customers through WhatsApp Business and its companion web interface, meaning mandatory SIM binding and frequent forced logouts could break workflows for order-taking, support, and customer engagement.\nThe potential disruption in India comes as WhatsApp has been steadily expanding its multi-device and companion-device capabilities, allowing users and businesses to stay logged in across phones, browsers, and devices without relying on a single active smartphone.\nRapid expansion to deep entrenchment\nThe directions come as WhatsApp is undergoing a significant shift in India, its biggest market, with growth increasingly driven by retaining existing users rather than rapidly expanding its new user base.\nWhatsApp’s monthly active users in India on mobile devices are up 6% year-over-year in the fourth quarter to date, even as downloads have fallen nearly 49%, per Sensor Tower data shared with TechCrunch. Compared with late 2022, WhatsApp’s monthly active users in India are up 24%, while downloads are down 14% over the same period, the market intelligence firm said.\n“It could be fair to say that user (MAU) growth for WhatsApp in India across the past few years has been driven more by retention (successfully re-engaging existing or previous users) than acquiring new users,” said Abraham Yousef, senior insights analyst at Sensor Tower.\nData from Appfigures shows WhatsApp Business has consistently recorded more estimated first-time installs than WhatsApp Messenger in India since early 2024, reflecting how growth has increasingly been driven by merchant adoption rather than broad-based consumer expansion.\nImage Credits:Jagmeet Singh / TechCrunch\nPart of that pattern reflects how WhatsApp is used in India, said Randy Nelson, head of insights at Appfigures. It is common for merchants to maintain separate WhatsApp identities for personal and customer communication, often enabled by dual-SIM phones, while a single business can generate multiple installs across staff and shop devices.\nSensor Tower data points in the same direction. WhatsApp Business monthly active users in India were still growing year over year in late 2025 and are up more than 130% compared with 2021, far outpacing WhatsApp Messenger’s roughly 34% growth over the same period, the market intelligence firm’s data estimates.\nWhile overall engagement remains higher on WhatsApp — with Indian users opening the app daily and spending an average of 38 minutes a day in November, compared with 27 minutes on WhatsApp Business — the gap looks different in the U.S., where users spent about 23 minutes a day on WhatsApp and 27 minutes on WhatsApp Business, Sensor Tower estimates show.\nIndia’s directions raise “serious questions of technical feasibility”\nIn a statement last week, industry body Broadband India Forum (BIF), whose members include Meta, said the measures could result in “material inconvenience and service disruption on ordinary users,” adding that they raise “serious questions of technical feasibility.”\nThe directions hinge on a new and still-contested classification of Telecommunication Identifier User Entities (TIUEs) under India’s telecom cybersecurity rules, said Kazim Rizvi, founding director of New Delhi-based public policy think tank The Dialogue, effectively placing messaging apps within a telecom framework — a shift from their traditional regulation under the country’s IT Act — through executive directions rather than formal legislation.\n“The directions derive their power not from statute but from delegated legislation,” Rizvi told TechCrunch. “Moreover, the lack of public consultations or technical working groups risks creating compliance friction without addressing the underlying fraud vectors.”\nIndia’s telecom ministry did not respond to a request for comments.\nFor now, companies including Meta have limited room to challenge the directions in court, according to tech policy experts.\nChallenging the directions would typically require showing either that they exceed the scope of the underlying law or that they violate constitutional protections, said Dhruv Garg, a tech policy advisor and partner at the Indian Governance and Policy Project — a high bar that may be difficult to meet in this case.\nMeta declined to comment on this article.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp’s biggest market is becoming its toughest test",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/04/GettyImages-1237939625.jpg?w=150"
      ],
      "datePublished": "2025-12-15T01:30:00.000Z",
      "dateModified": "2025-12-15T01:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How iRobot lost its way home",
    "url": "https://techcrunch.com/2025/12/14/how-irobot-lost-its-way-home/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2023-09-08-at-5.04.04PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-15T02:29:22.000Z",
    "description": "\nThere’s something painfully American about the arc of iRobot, the company that taught your vacuum to navigate around the furniture. Founded in 1990 i",
    "body": "\nThere’s something painfully American about the arc of iRobot, the company that taught your vacuum to navigate around the furniture. Founded in 1990 in Bedford, Massachusetts by MIT roboticist Rodney Brooks and his former students Colin Angle and Helen Greiner, the company filed for Chapter 11 bankruptcy on Sunday, punctuating a 35-year run that took it from the dreams of AI researchers to your kitchen floor and, finally, to the tender mercies of its Chinese supplier.\nBrooks, the founding director of MIT’s Computer Science and Artificial Intelligence Lab and the robotics field’s resident provocateur, spent the eighties watching insects and having epiphanies about how simple systems could produce complex behaviors. By 1990, he’d translated those insights into a company that would eventually sell over 50 million robots. The Roomba, launched in 2002, became the rare gadget that transcended its category to become a verb, a meme, and, to the amusement of many, a cat-transportation device.\nThe money soon followed, with the company raising $38 million altogether, including from The Carlyle Group, before going public in a 2005 IPO that raised $103.2 million. By 2015, iRobot was flush enough to launch its own venture arm, prompting TechCrunch to wryly declare that “robot domination may have just taken another step forward.” The plan at the time was to invest $100,000 to $2 million in up to 10 seed and Series A robotics startups each year. It was the kind of move that marks a company’s arrival, the moment when you’re successful enough to fund the next generation’s dreams.\nThen Amazon came knocking. In 2022, the corporate giant agreed to acquire iRobot for $1.7 billion in what would have been Amazon’s fourth-largest acquisition ever at the time. In a press release announcing the tie-up, Angle, who’d been CEO since the company’s inception, spoke about “creating innovative, practical products” and finding “a better place for our team to continue our mission.” It seemed like a fairy tale ending — the scrappy MIT spinoff absorbed into the Everything Store’s sprawling empire.\nExcept European regulators had other ideas. Indeed, amid threats they would block the deal — they believed Amazon could foreclose rivals by restricting or degrading access to its marketplace — Amazon and iRobot agreed to kill the deal in January 2024, with Amazon paying a $94 million breakup fee and walking away. Angle resigned. The company’s shares nosedived. It shed 31% of its workforce.\nWhat followed afterward was a slow-motion collapse. Earnings had been declining since 2021 thanks to supply chain chaos and Chinese competitors flooding the market with cheaper robot vacuums. The Carlyle Group, which provided a $200 million lifeline back in 2023, ultimately just prolonged the inevitable. (Carlyle finally sold that loan last month — presumably at a discount, though it didn’t specify either way.)\nNow it’s over, at least, the version of iRobot that existed previously. Shenzhen PICEA Robotics, iRobot’s main supplier and lender, will take control of the reorganized company. According to a release issued by iRobot on Sunday, the restructuring plan allows iRobot to remain as a going concern and “continue operating in the ordinary course with no anticipated disruption to its app functionality, customer programs, global partners, supply chain relationships, or ongoing product support.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIt also vowed to “meet its commitments to employees and make timely payments in full to vendors and other creditors for amounts owed throughout the court-supervised process.”\nWhat this means for customers longer term is another question, one iRobot was eager to answer when we reached out to the company. “To be clear, today’s news has no impact on our business operations or our ability to serve our customers – which continues to be our top priority,” said spokeswoman Michèle Szynal in an emailed statement to TechCrunch. “We remain focused on delivering intelligent home innovations that make consumers’ lives better and easier.  Our products are not changing.”\nIn its release, iRobot similarly promises to keep supporting existing products during restructuring; at the same time, its legal disclosures acknowledge the inherent uncertainties of bankruptcy — whether suppliers stick around, whether the process goes as planned, whether the company survives at all.\nAs The Verge noted in a story about iRobot’s struggles last month, even if iRobot eventually collapses and takes its cloud services down with it, customers’ Roomba vacuums won’t become useless pucks. The physical controls should keep working — a Roomba owner could still jab the button to send it off to vacuum or tell it to head home. \nWhat Roomba owners would lose is everything that make the devices feel futuristic, including app-based scheduling, the ability to tell it which rooms to clean, and voice commands barked at Alexa while sprawled on the couch.\nUpdate: This story has been updated with comment from iRobot.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How iRobot lost its way home",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/Screenshot-2023-09-08-at-5.04.04PM.jpg?w=150"
      ],
      "datePublished": "2025-12-15T02:29:22.000Z",
      "dateModified": "2025-12-15T02:29:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Making sense of the risky Netflix-Warner Bros. deal",
    "url": "https://techcrunch.com/2025/12/14/making-sense-of-the-risky-netflix-warner-bros-deal/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-1240099721.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-14T17:27:05.000Z",
    "description": "\nWhether or not Netflix’s $82.6 billion acquisition of Warner Bros. goes through, the deal encapsulates a fraught moment for Hollywood, as the enterta",
    "body": "\nWhether or not Netflix’s $82.6 billion acquisition of Warner Bros. goes through, the deal encapsulates a fraught moment for Hollywood, as the entertainment business is increasingly overshadowed by tech giants.\nOn the latest episode of the Equity podcast, Kirsten Korosec and I discussed the deal’s implications, both for Netflix and the larger Hollywood ecosystem. Kirsten noted that it’s just the latest move bringing more consolidation to the media business, and she wondered whether it’s “too big a risk” for Netflix.\nMeanwhile, I discussed a call with Netflix executives where Wall Street analysts also seemed to be struggling to wrap their heads around the deal. And then of course there’s Paramount’s competing hostile bid — whatever happens, Warner Bros.’ days as a standalone company seem to be numbered.\nYou can read an edited preview of our conversation below.\nKirsten: I remember when Netflix was just a little baby startup and I got their [DVDs] in the mail. Here they are, all grown up, bidding for a legacy company. Did that run through your head when you saw the news?\nAnthony: Certainly symbolically, it’s this moment where the upstart has eaten Hollywood. There’ve been all these articles, even before this deal, saying, “Netflix is eating Hollywood, Netflix is transforming Hollywood.” Regardless of whether or not this deal ends up going through, Netflix will have transformed Hollywood, but this seems like the biggest — both symbolically but also substantively — one of the most dramatic things that can happen. \nThen there are all these other questions about: Will Netflix get regulatory approval? Will Paramount’s hostile bid succeed?\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhat jumped out to you is you were catching up on it, Kirsten?\nKirsten: Well, the first thing was I was like, can there be any more consolidation in this market? I mean, that was the big one for me, because if memory serves, Warner Bros. already went through like this consolidation with Discovery, right? So here we are again. There’s been so much consolidation that I have lost track of all of that.\nBut the second thought was what I immediately thought, what I kicked [off our discussion] with, which is really thinking about how Netflix [has grown], and there have been these dips in the road along its way, where the headlines have been about how it’s struggling, and will it remain relevant, and how can it do that? If they’re successful in the actual deal, [it would] potentially reflect [that] they have made it.\nBut then again, they have to execute on [running] an even bigger company than ever before. And so I guess my third thought on this is: Should they be buying this? Is this what it takes for them to expand? Is it a risk for them to take on so much? Why not just stay as they are? And I don’t know if you agree with me on that one. Is it too big of a risk? \nAnthony: I can see how it makes sense for Netflix. It’s a way to take a [content] library that is already quite large, and they’ve obviously had some very successful TV shows — less so on the movie side — [but] potentially, they just become so much stronger on the content side.\n[And] they’re suddenly now involved in all these other businesses, although the question is to what extent are they going to invest in things like the theatrical business, theme parks, making TV shows for other streaming services and networks, which are all businesses that Warner Bros is in, and Netflix says it will continue to support. But we’ll see to what extent that’s true.\nSo it seems like something that can really benefit Netflix in some ways, but, at the same time, it does seem like this is a huge risk. If you go and look at the analyst call that Netflix’s executives did after announcing the deal, you can see that the analysts are wrestling with it and wondering “Okay, I can see that this grows your business, but does it grow your business [so much that it’s] worth an $82 billion deal?”\nAnd then of course, beyond the Netflix perspective, you have everybody else in Hollywood. There are all these maybe accurately hyperbolic headlines about: Is this the end of Hollywood? Is this the end of the movie theater business? All the unions are basically saying either, “This deal should be blocked” or “We’re very, very, very worried about this deal.” The theater owners are saying that\nAnd so I think there’s A) Is this a good deal for Netflix? And B) is this a good deal for the entertainment business? I don’t have a good answer for either, [but] I think it’s more likely to be a good deal for Netflix than it is to be a good deal for the entertainment business.\nThough again, part of what to keep in mind as people weigh those options or think about possible outcomes here, is that because of the way that Paramount has forced Warner Bros. to consider these acquisition offers, it seems unlikely that Warner Bros. is going to be able to continue as an independent company — which, if you’re not a fan of media consolidation, that is disappointing.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Making sense of the risky Netflix-Warner Bros. deal",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-1240099721.jpeg?w=150"
      ],
      "datePublished": "2025-12-14T17:27:05.000Z",
      "dateModified": "2025-12-14T17:27:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]