[
  {
    "title": "Nvidia to license AI chip challenger Groq’s tech and hire its CEO",
    "url": "https://techcrunch.com/2025/12/24/nvidia-acquires-ai-chip-challenger-groq-for-20b-report-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/1_byjKY2ta4_34GHPvmN9Suw.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T22:03:16.000Z",
    "description": "In Brief Posted: 2:03 PM PST · December 24, 2025  Image Credits:Groq  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Nvidia has struck a non-exclusive licensing agreement with AI chip competitor Groq. As part of...",
    "body": "\nIn Brief\nPosted:\n2:03 PM PST · December 24, 2025\n\nImage Credits:Groq\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nNvidia has struck a non-exclusive licensing agreement with AI chip competitor Groq. As part of the deal, Nvidia will hire Groq founder Jonathan Ross, president Sunny Madra, and other employees.\nCNBC reported that Nvidia is acquiring assets from Groq for $20 billion; Nvidia told TechCrunch that this is not an acquisition of the company and did not comment on the scope of the deal. But if CNBC’s numbers are accurate, this purchase is expected to be Nvidia’s largest ever, and with Groq on its side, Nvidia is poised to become even more dominant in chip manufacturing.\nAs tech companies compete to grow their AI capabilities, they need computing power, and Nvidia’s GPUs have emerged as the industry standard. But Groq has been working on a different type of chip called an LPU (language processing unit), which it has claimed can run LLMs at 10 times faster and using one-tenth the energy. Groq’s CEO Jonathan Ross is known for this sort of innovation — when he worked for Google, he helped invent the TPU (tensor processing unit), a custom AI accelerator chip.\nIn September, Groq raised $750 million at a $6.9 billion valuation. Its growth has been quick and significant — the company said that it powers the AI apps of more than 2 million developers, up from about 356,000 last year.\nUpdated, 12/24/25 at 5:40 p.m. ET, with clarification from Nvidia about the nature of the deal.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "John Carreyrou and other authors bring new lawsuit against six major AI companies",
    "url": "https://techcrunch.com/2025/12/23/john-carreyrou-and-other-authors-bring-new-lawsuit-against-six-major-ai-companies/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/04/GettyImages-1371961757.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T19:02:47.000Z",
    "description": "These authors rejected Anthropic's class action settlement, arguing that \"LLM companies should not be able to so easily extinguish thousands upon thousands of high-value claims at bargain-basement rates.\"",
    "body": "\nIn Brief\nPosted:\n11:02 AM PST · December 23, 2025\n\nImage Credits:Yuichiro Chino / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nA group of writers, including Theranos whistleblower and “Bad Blood” author John Carreyrou, is filing a lawsuit against Anthropic, Google, OpenAI, Meta, xAI, and Perplexity, accusing the companies of training their models on pirated copies of their books.\nIf this sounds familiar, it’s because another set of authors already filed a class action suit against Anthropic for these same acts of copyright infringement. In that case, the judge ruled that it was legal for Anthropic and similar AI companies to train on pirated copies of books, but that it was not legal to pirate the books in the first place.\nWhile eligible writers can receive about $3,000 from the $1.5 billion Anthropic settlement, some authors were dissatisfied with that resolution — it doesn’t hold AI companies accountable for the actual act of using stolen books to train their models, which generate billions of dollars in revenue.\nAccording to the new lawsuit, the plaintiffs say that the proposed Anthropic settlement “seems to serve [the AI companies], not creators.”\n“LLM companies should not be able to so easily extinguish thousands upon thousands of high-value claims at bargain-basement rates, eliding what should be the true cost of their massive willful infringement,” the lawsuit says.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "ServiceNow to acquire cybersecurity startup Armis for $7.75B",
    "url": "https://techcrunch.com/2025/12/23/servicenow-to-acquire-cybersecurity-startup-armis-for-7-75b/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Founders-1-credit-Armis-2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T20:40:10.000Z",
    "description": "In Brief Posted: 12:40 PM PST · December 23, 2025  Image Credits:Armis  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Enterprise software company ServiceNow agreed to acquire nine-year-old cybersecurity startup...",
    "body": "\nIn Brief\nPosted:\n12:40 PM PST · December 23, 2025\n\nImage Credits:Armis\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nEnterprise software company ServiceNow agreed to acquire nine-year-old cybersecurity startup Armis for $7.75 billion in cash.\nThe deal is a massive valuation jump for the company. Just last month, Armis raised a $435 million pre-IPO funding round, which valued the company at $6.1 billion.\nArmis co-founder and CEO Yevgeny Dibrov had told TechCrunch last month that the company aims to go public in late 2026 or 2027, adding that an IPO is his “personal dream.”\nGiven the unpredictability of IPO markets and how few cybersecurity companies actually go public, it is not a surprise that Armis ultimately chose an M&A exit.\nAccording to ServiceNow, Armis has reached $340 million in annual recurring revenue (ARR), with year-over-year growth exceeding 50%.\nArmis, which provides security software for critical infrastructure to Fortune 500 companies and governments, will help ServiceNow expand its cybersecurity offerings.\nThe deal caps off a busy acquisition year for ServiceNow, which scooped up Moveworks for $2.85 billion and agreed to acquire cybersecurity startup Veza for $1 billion.\nAccording to PitchBook, Armis has raised a total of $1.45 billion in venture capital from investors, including Sequoia, CapitalG, and Insight Partners.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n"
  },
  {
    "title": "Hackers stole over $2.7B in crypto in 2025, data shows",
    "url": "https://techcrunch.com/2025/12/23/hackers-stole-over-2-7-billion-in-crypto-in-2025-data-shows/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/bitcoin-us-dollars.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T19:00:00.000Z",
    "description": "Cybercriminals stole $2.7 billion in crypto this year, a new record for crypto-stealing hacks, according to blockchain-monitoring firms. Once again, in 2025, there were dozens of crypto heists hitting several...",
    "body": "\nCybercriminals stole $2.7 billion in crypto this year, a new record for crypto-stealing hacks, according to blockchain-monitoring firms.\nOnce again, in 2025, there were dozens of crypto heists hitting several cryptocurrency exchanges and other web3 and decentralized finance (DeFi) projects. The biggest hack by far was the breach at Dubai-based crypto exchange Bybit, where hackers stole around $1.4 billion in crypto. Blockchain analysis firms, as well as the FBI, accused North Korean government hackers — the most prolific group targeting crypto in the last few years — of this massive heist.  \nThis was the largest known loot of crypto of all time, and one of the largest financial heists in the history of humanity. Before the Bybit hack, the largest crypto thefts netted $624 million and $611 million for hackers in the 2022 breaches against the Ronin Network and the Poly Network, respectively. \nCryptocurrency-monitoring firms Chainalysis and TRM Labs both estimated a total of $2.7 billion stolen in crypto in 2025, per data shared with TechCrunch. Chainalysis also tracked another $700,000 stolen from individual crypto wallets, the company said. \nDe.Fi, the web3 security firm running the REKT database that tracks crypto thefts, also estimated $2.7 billion in stolen and hacked crypto last year. \nAs usual, North Korean government hackers were the most successful crypto thieves throughout 2025, after stealing at least $2 billion, according to Chainalysis and Elliptic, which estimated that Kim Jong Un’s hackers have stolen around $6 billion since 2017. North Korea uses crypto thefts to fund its sanctioned nuclear weapons program.\nOther significant crypto hacks this year included the one against Cetus, a decentralized exchange, which netted the hackers $223 million; the breach against Balancer, a protocol built on the Ethereum blockchain, which resulted in a loss of $128 million; and the one against the crypto exchange Phemex, where cybercriminals stole more than $73 million. \nCybercriminals targeting crypto exchanges and other DeFi projects are not slowing down. In 2024, hackers stole $2.2 billion in crypto, while the year before, in 2023, the total was $2 billion. \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "US insurance giant Aflac says hackers stole personal and health data of 22.6 million people",
    "url": "https://techcrunch.com/2025/12/23/us-insurance-giant-aflac-says-hackers-stole-personal-and-health-data-of-22-6-million-people/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-466757609.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T17:14:04.000Z",
    "description": "Aflac, one of the largest insurance companies in the U.S., confirmed hackers stole reams of personal data, including Social Security numbers, identity documents, and health information.",
    "body": "\n\t\n\t\tImage Credits:Kiyoshi Ota/Bloomberg / Getty Images\t\n\t\n\t\t\t\t\t\t9:14 AM PST · December 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nIn June, U.S. insurance giant Aflac disclosed a data breach where hackers stole customers’ personal information, including Social Security numbers and health information, without saying how many victims were affected. \nOn Tuesday, the company confirmed it has begun notifying around 22.65 million people whose data was stolen during the cyberattack.\nIn a filing with the Texas attorney general, Aflac said that the stolen data includes customer names, dates of birth, home addresses, government-issued ID numbers (such as passports and state ID cards) and driver’s license numbers, and Social Security numbers, as well as medical and health insurance information.\nAnd, in a filing with the Iowa attorney general, Aflac said that the cybercriminals responsible for the breach “may be affiliated with a known cyber-criminal organization; federal law enforcement and third-party cybersecurity experts have indicated that this group may have been targeting the insurance industry at large.”\nGiven that Scattered Spider, an amorphous collective of primarily young English-speaking hackers, was targeting the insurance industry at the time of the breach, it’s likely that this is the group Aflac is referring to. \nA spokesperson for Aflac did not respond to TechCrunch’s request for comment. \nThe company says it has around 50 million customers according to its official website. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAflac was one of several insurance companies hacked at around the same time, including data breaches at Erie Insurance and Philadelphia Insurance Companies.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Trump administration’s ban on foreign-made drones starts this week — you can say goodbye to new DJI models",
    "url": "https://techcrunch.com/2025/12/23/trump-administrations-ban-on-foreign-made-drones-starts-this-week-you-can-say-goodbye-to-new-dji-models/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/06/maxresdefault_b469c7.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T21:16:04.000Z",
    "description": "1:16 PM PST · December 23, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t On Monday, the Trump administration’s Federal Communications Commission banned all new foreign-made drone models from distribution in the U.S., citing “national...",
    "body": "\n\t\n\t\t\t\n\t\n\t\t\t\t\t\t1:16 PM PST · December 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nOn Monday, the Trump administration’s Federal Communications Commission banned all new foreign-made drone models from distribution in the U.S., citing “national security concerns.” Americans who already own older foreign drone models will still be able to use those products, the government said. \nIn a fact sheet published Monday, the FCC claimed that “criminals, hostile foreign actors, and terrorists” could use drones “to present new and serious threats to our homeland.” As a result, the agency said that it had updated its Covered List — which is a list of products that have been “deemed to pose an unacceptable risk to the national security” of the country — to include all “UAS and UAS critical components produced abroad.”\nThe FCC’s chairman, Brendan Carr, said Monday that he approved of the policy. “I welcome this Executive Branch national security determination, and I am pleased that the FCC has now added foreign drones and related components, which pose an unacceptable national security risk, to the FCC’s Covered List,” Carr said. “Following President Trump’s leadership, the FCC will work closely with U.S. drone makers to unleash American drone dominance.”\nThe new rule will obviously impact many different companies, but it is destined to strike a blow against Chinese drone maker DJI, which is currently considered the dominant player in drone sales globally. Indeed, DJI is considered to be one of the most popular drone brands for American consumers.\nWhen reached for comment by TechCrunch, DJI said it disapproved of the decision. “DJI is disappointed by the Federal Communications Commission’s action today to add foreign‑made drones to the Covered List. While DJI was not singled out, no information has been released regarding what information was used by the Executive Branch in reaching its determination.”The company, which said that it remained committed to the U.S. market, continued: “As the industry leader, DJI has advocated for an open, competitive market that benefits all US consumers and commercial users, and will continue to do so. DJI products are among the safest and most secure on the market, supported by years of reviews conducted by U.S. government agencies and independent third parties.”\nThroughout his multiple presidential administrations, Trump has repeatedly played hardball with Chinese companies. His administration laid the groundwork for the new drone ban with an executive order passed in June that sought to boost the production of U.S.-made drones and thus foster a “strong and secure domestic drone sector,” while also securing “the United States drone supply chain against foreign control or exploitation.”\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tLucas is a senior writer at TechCrunch, where he covers artificial intelligence, consumer tech, and startups. He previously covered AI and cybersecurity at Gizmodo. \nYou can contact Lucas by emailing lucas.ropek@techcrunch.com.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Can AI fix the operating room? This startup thinks so",
    "url": "https://techcrunch.com/video/can-ai-fix-the-operating-room-this-startup-thinks-so/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Akara-Team.webp?w=150",
    "tag": "Tech",
    "date": "2025-12-24T04:48:00.000Z",
    "description": "There's plenty of hype around AI and robots in healthcare, but the problem that's actually costing hospitals money right now is operating room coordination. Two to four hours of OR time is lost every single day, not because of the surgeries themselves, but because of everything in between from manual scheduling and coordination chaos to guesswork about room turnover. TechCrunch’s Equity podcast caught up with Conor McGinn, co-founder and CEO of Akara, the startup that recently landed a spot on Time's Best Inventions of 2025 and is building what’s essentially air traffic control for hospitals using thermal sensors and AI. Chapters: 00:00 - Introduction 00:54 - Air traffic control for ORs 02:35 - Where hospitals lose hours daily 03:54 - Selling into risk-averse hospitals 06:21 - Thermal sensors and edge AI 09:11 - NHS as proof of concept 13:16 - The AI under the hood 18:12 - Privacy benefits of thermal 21:22 - Infrastructure before robots",
    "body": "\n\t\t\n\nLoading the player…\n\nThere’s plenty of hype around AI and robots in healthcare, but the problem that’s actually costing hospitals money right now is operating room coordination. Two to four hours of OR time is lost every single day, not because of the surgeries themselves, but because of everything in between from manual scheduling and coordination chaos to guesswork about room turnover.  \nToday on TechCrunch’s Equity podcast, we’re bringing you a conversation that TechCrunch AI Editor Russell Brandom had with Conor McGinn, co-founder and CEO of Akara, the startup that recently landed a spot on Time’s Best Inventions of 2025 and is building what’s essentially air traffic control for hospitals using thermal sensors and AI.\nSubscribe to Equity on YouTube, Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n"
  },
  {
    "title": "How Mill closed the deal with Amazon and Whole Foods",
    "url": "https://techcrunch.com/2025/12/24/how-mill-closed-the-deal-with-amazon-and-whole-foods/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Mill-Commercial-bin.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T15:30:00.000Z",
    "description": "Matt Rogers' food waste startup will soon deploy its commercial food waste bins in grocery stores throughout the U.S. Here's how Rogers thinks about preparing a startup for success.",
    "body": "\nMill may have started with households, but co-founder and CEO Matt Rogers says the food waste startup has long aspired to expand to commercial customers. \n“This has been part of our plan since our Series A deck,” Rogers told TechCrunch.\nNow, with an official deal locked in with Amazon and Whole Foods the company’s plan to profit from handling other people’s food waste is a bit more public. \nWhole Foods will deploy a commercial-scale version of Mill’s food waste bin in each of its grocery stores beginning in 2027. The bins will grind and dehydrate waste from the produce department, reducing costly landfill fees while also providing feed for the company’s egg producers. Both trim the company’s overhead and lower its ecological footprint.\nAt the same time, Mill’s bins will collect data to help Whole Foods understand what gets wasted and why, helping the grocer further control costs. “Ultimately, our goal is not just to make their waste operations more efficient, but also to move upstream so they actually waste less food,” Rogers said.\nThe company started selling food waste bins to households a few years ago. As can be expected from a team that made the Nest thermostat, the devices are well designed and — to lean on a Silicon Valley cliché — they can be a delight to use. My kids got a kick out of the bins while testing the first and second generations.\n“Starting in consumer was very intentional because you build the proof points, you build the data, the brand, loyalty,” Rogers said. Many members of the Whole Foods team were already familiar with Mill when the two companies started talking.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“It’s actually kind of our enterprise sales strategy,” Rogers continued. “We have conversations with senior leadership at our various ideal customers, and if they haven’t had Mill at home yet, we say, ‘Hey, try Mill at home, see what your family thinks.’ It is a surefire way of getting folks excited.”\nThe startup began having conversations with Whole Foods about a year ago, Rogers said. In the ensuing months, Mill demonstrated the consumer version in some of the chain’s grocery stores. \nMill has also developed an AI that uses a range of sensors to determine whether food that enters the bin should still be on the shelf. Minimizing “shrink” — the industry’s term for sales lost through waste or theft — can give grocers an edge in a cutthroat market.\nAdvances in large language models have been key, Rogers said. When he and Mill co-founder Harry Tannenbaum were at Nest, it took dozens of engineers and a “Google budget” more than a year to train Nest Cameras to recognize people and packages. With new LLMs, Mill only needed a handful of engineers and far less time to deliver superior results, according to Rogers, who said “AI is a huge enabler.”\nThe use of AI allowed Mill to deliver a commercial version faster, diversifying its customer base and source of revenue. \n“If you are a single channel, single customer business, you’re fragile,” Rogers said. “I grew up at Apple during the iPod era,” he said. “Apple at the time was a single leg business. iPod was like 70% of company revenue. This was why we did the iPhone. Steve [Jobs] pushed us really hard on the iPhone because he was worried that folks like Motorola — who were working on smartphones at the time — would start to eat our lunch on the iPod business and that that would crush us. We needed to build another leg of the stool.” \nAnd it seems that Mill isn’t finished adding legs to its figurative stool. Rogers said it’s working on building out a municipal business as well.\n“We’re continuing to add more legs to the stool and adding more diversity to the business,” he said. \n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Zoox issues software recall over lane crossings",
    "url": "https://techcrunch.com/2025/12/23/zoox-issues-software-recall-over-lane-crossings/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Zoox-San-Francisco-closeup-robotaxi.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T19:50:09.000Z",
    "description": "Amazon-owned Zoox issued a recall Tuesday over concerns its autonomous driving system caused vehicles to cross over the center lane line near intersections or block crosswalks. The voluntary recall of its...",
    "body": "\nAmazon-owned Zoox issued a recall Tuesday over concerns its autonomous driving system caused vehicles to cross over the center lane line near intersections or block crosswalks. The voluntary recall of its software affected 332 vehicles, according to documents filed with the National Highway Traffic Safety Administration (NHTSA).\nWhile there have not been any collisions associated with the issue, Zoox noted in the NHTSA filing that it could increase the risk of a crash. The company provides free rides to the public in its driverless Zoox vehicles in parts of San Francisco and Las Vegas.\nA Zoox spokesperson told TechCrunch the company identified some instances in which its vehicles made maneuvers that, while common for human drivers, didn’t meet its standards. For example, in an effort to avoid blocking certain intersections at a red light, the robotaxi might stop in a crosswalk. In other instances, the robotaxi made a late turn, resulting in a wide turn, according to a spokesperson’s emailed statement.\nThe issue was initially identified on August 26 when a Zoox robotaxi made a wide right turn, crossed partially into the opposing travel lane, and temporarily stopped in front of the oncoming travel lane, according to the NHTSA filing. \nZoox monitored its data for additional lane crossings near intersections, ultimately identifying 62 instances between August 26 and December 5. The company said in the filing it was in “ongoing conversations with NHTSA about the frequency, severity, and root causes of these occurrences.”\nThe company updated its software on November 7 and again in mid-December to address all of the issues.\n“We have successfully identified and deployed targeted software improvements to address the root causes of these incidents,” the statement reads. “Today, we’re submitting a voluntary software recall because transparency and safety is foundational to Zoox, and we want to be open with the public and regulators about how we are constantly refining and improving our technology.”\nThe software recall affected Zoox vehicles operating on public roads between March 13 and December 18, according to the filing. \nZoox has issued several software recalls this year, including one in March to address unexpected hard braking. That recall followed a preliminary investigation by NHTSA that was opened after the agency received two reports of motorcyclists colliding with the back of Zoox vehicles.\nIn May, Zoox filed two software recalls to address concerns about the system’s ability to predict the movement of other road users. \n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Apple pauses app store changes in Texas after court blocks age-assurance law",
    "url": "https://techcrunch.com/2025/12/24/apple-pauses-app-store-changes-in-texas-after-court-blocks-age-assurance-law/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/07/app-store-ios-2022-a.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T15:02:06.000Z",
    "description": "After a federal judge on Tuesday blocked Texas from implementing a new age-verification law for app stores, Apple announced it will pause previously announced plans for the state as it continues to monitor...",
    "body": "\nAfter a federal judge on Tuesday blocked Texas from implementing a new age-verification law for app stores, Apple announced it will pause previously announced plans for the state as it continues to monitor the “ongoing legal process.”\nApple said its previously announced developer tools for age assurance would remain available for testing and use.\nThe law, SB 2420, or the App Store Accountability Act, would have required app stores, like those run by Apple and Google, to verify user ages and require parental consent for those under 18 to download apps or make purchases. In addition, it would have required the age data be shared with developers.\nA judge, citing First Amendment concerns, blocked the law’s enforcement that was set to take effect in January. The ruling was a win for tech giants and a setback to Texas lawmakers, who said the legal fight will continue. The Texas attorney general’s office noted in a court filing that it plans to appeal the decision, a report from Reuters noted.\nTo comply with the coming law, Apple had announced in October a series of new requirements for apps in Texas, which included all users under the age of 18 would have to join a Family Sharing group, where parents or guardians would provide consent for all App Store downloads, app purchases, and in-app transactions. Parents would be able to revoke their consent for an app at any time.\nApple also said its Declared Age Range API, a technology the company debuted to help it comply with the growing number of age-assurance laws worldwide, would be updated in the months ahead to provide the required age categories for new account users in Texas. Apple had planned to launch new APIs for developers to request parental consent again if their app was significantly updated.\nApple had objected to this law, and similar laws arriving next year in Utah and Louisiana, on the grounds of privacy, not kids’ protection. \n“While we share the goal of strengthening kids’ online safety, we are concerned that SB2420 impacts the privacy of users by requiring the collection of sensitive, personally identifiable information to download any app, even if a user simply wants to check the weather or sports scores,” Apple explained in a developer announcement earlier this year.\nApple on Thursday announced other developer tools for complying with new age-assurance laws will remain available for testing, including its Declared Age Range API, Significant Change API under PermissionKit, New age rating property type in StoreKit, and App Store Server Notifications. In addition, the Declared Age Range API is still available worldwide across iOS 26, iPadOS 26, and macOS 26, and later.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Italy tells Meta to suspend its policy that bans rival AI chatbots from WhatsApp",
    "url": "https://techcrunch.com/2025/12/24/italy-tells-meta-to-suspend-its-policy-that-bans-rival-ai-chatbots-from-whatsapp/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/whatsapp-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T14:40:34.000Z",
    "description": "Italy has ordered Meta to suspend its policy that bans companies from using WhatsApp’s business tools to offer their own AI chatbots on the popular chat app. The Italian Competition Authority (AGCM) on...",
    "body": "\nItaly has ordered Meta to suspend its policy that bans companies from using WhatsApp’s business tools to offer their own AI chatbots on the popular chat app.\nThe Italian Competition Authority (AGCM) on Wednesday said it had found enough cause in its ongoing investigation into whether Meta was abusing its dominant position in the market to offer its Meta AI chatbot within WhatsApp to order the suspension of the policy.\n“Meta’s conduct appears to constitute an abuse, since it may limit production, market access, or technical developments in the AI Chatbot services market, to the detriment of consumers,” the Authority wrote. “Moreover, while the investigation is ongoing, Meta’s conduct may cause serious and irreparable harm to competition in the affected market, undermining contestability.”\nThe AGCM in November had broadened the scope of an existing investigation into Meta, after the company changed its business API policy in October to ban general-purpose chatbots from being offered on the chat app via the API.\nMeta has argued that its API isn’t designed to be a platform for the distribution of chatbots and that people have more avenues beyond WhatsApp to use AI bots from other companies. The policy change, which goes into effect in January, would affect the availability of AI chatbots from the likes of OpenAI, Perplexity, and Poke on the app.\nThe policy doesn’t affect businesses that are using AI to serve customers on WhatsApp. For instance, a retailer running an AI-powered customer service bot won’t be barred from using the API. Only AI chatbots like ChatGPT or Claude are prohibited from being distributed via the API.\nThe European Commission this month also launched an investigation into the new policy, raising concerns that it may “prevent third-party AI providers from offering their services through WhatsApp in the European Economic Area (‘EEA’).”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nCalling the Authority’s decision “fundamentally flawed,” Meta said WhatsApp’s business API isn’t a route to the market for AI companies. \n“The emergence of AI chatbots on our Business API put a strain on our systems that they were not designed to support. The Italian authority assumes WhatsApp is somehow a defacto app store. The route to market for AI companies are the app stores themselves, their websites and industry partnerships; not the WhatsApp Business Platform. We will appeal,” Meta said in an emailed statement.\nNote: This story was updated to add Meta’s response to the decision.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The 9 top biotech startups from Disrupt Startup Battlefield",
    "url": "https://techcrunch.com/2025/12/24/the-9-top-biotech-startups-from-disrupt-startup-battlefield/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Startup-stars.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T16:00:00.000Z",
    "description": "Every year, TechCrunch’s Startup Battlefield pitch contest draws thousands of applicants. We whittle those applications down to the top 200 contenders, and of them, the top 20 compete on the big stage to...",
    "body": "\nEvery year, TechCrunch’s Startup Battlefield pitch contest draws thousands of applicants. We whittle those applications down to the top 200 contenders, and of them, the top 20 compete on the big stage to become the winner, taking home the Startup Battlefield Cup and a cash prize of $100,000. But the remaining 180 startups all blew us away as well in their respective categories and compete in their own pitch competition.\nHere is the full list of the biotech and pharma Startup Battlefield 200 selectees, along with a note on why they landed in the competition. \nCasNx\nWhat it does: CasNx has invented a new kind of antivirus treatment for organs from organ donors.\nWhy it’s noteworthy: The startup has invented a gene-editing CRISPR kit that eliminates viruses and installs “universal donor” markers while the organ is being preserved outside the body. \nChipiron \nWhat it does: Chipiron is building a light and inexpensive, open full-body MRI machine intended to make MRI cancer diagnostics more widely available. \nWhy it’s noteworthy: The medical MRI machine is being built using a superconducting quantum interference device (SQUID), a highly sensitive magnetometer that can measure extremely weak magnetic fields, more commonly used in array antennas. \nExactics  \nWhat it does: Exactics is building a platform that creates rapid diagnostic tests. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhy it’s noteworthy: Exactics is attempting to make consumer diagnostic kits more widely available, beginning with at-home screening of Lyme disease, with kits for other illnesses on the roadmap.  \nLumos Strategies OÜ  \nWhat it does: Lumos has created a consumer high-frequency electromagnetic device named Avara, targeted at red blood cells. \nWhy it’s noteworthy: Avara has been designed to provide gentle, non-contact “inductive therapy” to improve sleep, relaxation, and exercise recovery. \nMiraqules \nWhat it does: Miraqules developed a nanotechnology in powder form that mimics blood-clotting proteins. \nWhy it’s noteworthy: This technology provides instant blood clotting and is a unique, potentially lifesaving alternative to traditional wound treatments, particularly when treating patients on the scene of the injury. \nNephrogen \nWhat it does: Nephrogen is creating gene therapy solutions for kidney illnesses. \nWhy it’s noteworthy: Nephrogen is solving the hardest part of the problem when it comes to gene-editing medicines. Its tech uses AI to accurately target gene-editing to the exact cells in the kidney that are causing the illness.  \nPraxisPro \nWhat it does: PraxisPro is an AI-powered training system for sales and marketing roles in life science industries.  \nWhy it’s noteworthy: The system provides compliance-approved content, complete with simulations and real-time analytics to ensure those who represent life science companies are properly prepared to do so. \nReme-D \nWhat it does: Reme-D is developing reliable and affordable diagnostic tests specifically geared toward underserved communities. \nWhy it’s noteworthy: Reme-D is developing rapid diagnostic tests that are not only particularly affordable but also stable in hot and humid climates. \nSurgicure Technologies \nWhat it does: Surgicure has created a patented solution that more safely and reliably secures endotracheal tubes (ET). \nWhy it’s noteworthy: This device makes ET tubes, the flexible tubes inserted through the mouth or nose during surgeries or other treatments, safer and more comfortable for patients. \n"
  },
  {
    "title": "Waymo is testing Gemini as an in-car AI assistant in its robotaxis",
    "url": "https://techcrunch.com/2025/12/24/waymo-is-testing-gemini-as-an-in-car-ai-assistant-in-its-robotaxis/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/waymo2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T16:27:55.000Z",
    "description": "Waymo is testing a Gemini-powered in-car AI assistant, per findings from a 1,200-line system prompt. The assistant can answer general knowledge questions, control certain in-cabin features, and more.",
    "body": "\nWaymo appears to be testing adding Google’s Gemini AI chatbot to its robotaxis in an effort to integrate an AI assistant that would accompany riders and answer their queries, according to findings by researcher Jane Manchun Wong.\n“While digging through Waymo’s mobile app code, I discovered the complete system prompt for its unreleased Gemini integration,” Wong wrote in a blog. “The document, internally titled ‘Waymo Ride Assistant Meta-Prompt,’ is a 1,200+ line specification that defines exactly how the AI assistant is expected to behave inside a Waymo vehicle.”\nThe feature hasn’t shipped in public builds, but Wong says the system prompt makes it clear that this is “more than a simple chatbot.” The assistant is said to have the ability to answer questions, manage certain in-cabin functions like climate control, and, if required, reassure riders. \n“While we have no details to share today, our team is always tinkering with features to make riding with Waymo delightful, seamless, and useful,” Julia Ilina, a spokesperson for Waymo, told TechCrunch. “Some of these may or may not come to our rider experience.”\nThis wouldn’t be the first time Gemini has been integrated into the Alphabet-owned self-driving company’s stack. Waymo says it has used Gemini’s “world knowledge” to train its autonomous vehicles to navigate complex, rare, and high-stakes scenarios. \n\nWong writes the assistant is instructed to possess a clear identity and purpose: “a friendly and helpful AI companion integrated into a Waymo autonomous vehicle” whose primary goal is “to enhance the rider’s experience by providing useful information and assistance in a safe, reassuring, and unobtrusive manner.” The bot is directed to use clear, simple language and avoid technical jargon, and is instructed to keep its responses succinct to one to three sentences. \nAccording to the system prompts, when a rider activates the assistant via the in-car screen, Gemini can choose from a set of pre-approved greetings personalized with the rider’s first name. The system can also access contextual data about the rider, like how many Waymo trips they’ve been on. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe prompts currently let Gemini access and control in-car features, like the temperature, lighting and music. Notably absent from the function list are volume control, route changes, seat adjustment, and window control, Wong pointed out. If a rider asks for a feature that Gemini can’t control, the bot is to reply with “aspirational phrases,” like, “It’s not something I can do yet.”\nInterestingly, the assistant is directed to maintain a clear distinction between its identity as Gemini the AI bot and the autonomous driving technology (the Waymo Driver). So when replying to a question such as, “How do you see the road?” Gemini shouldn’t say “I use a combination of sensors,” and instead should reply, “The Waymo Driver uses a combination of sensors…”\nThe system prompts include a range of compelling tidbits, such as how the bot is meant to handle being asked questions about competitors like Tesla or the now-defunct Cruise, or which trigger keywords will get it to stop talking. \nThe assistant is also directed to avoiding speculating on, explaining, confirming, denying, or commenting on real-time driving actions or specific driving events. So if a passenger asks about a video they saw of a Waymo hitting something, the bot is instructed to not answer directly and deflect.\n“Your role is not to be a spokesperson for the driving system’s performance, and you must not adopt a defensive or apologetic tone,” the prompt reads.\nThe in-car assistant is allowed to answer general knowledge questions like about the weather, the height of the Eiffel Tower, what time the local Trader Joe’s closes, and who won the last World Series. It is not allowed to take real-world actions like ordering food, making reservations, or handling emergencies. \nWaymo isn’t the only company integrating AI assistants into driverless vehicles. Tesla is doing something similar with xAI’s Grok. The two different car assistants serve different functions, however. Gemini appears to be programmed to be more pragmatic and ride-focused, while Grok is pitched more as an in-car buddy that can handle long conversations and remember context from previous questions. \n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Waymo explains why its robotaxis got stuck during the SF blackout",
    "url": "https://techcrunch.com/2025/12/24/waymo-explains-why-its-robotaxis-got-stuck-during-the-sf-blackout/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/waymo-nyc.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-24T16:55:54.000Z",
    "description": "Image Credits:Waymo\t \t \t\t\t\t\t\t8:55 AM PST · December 24, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Waymo is shipping a software update to help its robotaxis navigate disabled traffic lights during power outages “more decisively,”...",
    "body": "\n\t\n\t\tImage Credits:Waymo\t\n\t\n\t\t\t\t\t\t8:55 AM PST · December 24, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWaymo is shipping a software update to help its robotaxis navigate disabled traffic lights during power outages “more decisively,” the company said Tuesday in a blog post that explains why its self-driving vehicles got stuck at intersections during a blackout in San Francisco this past weekend.\nWaymo said the self-driving system in its robotaxis treats dead stop lights as four-way stops, just like humans are supposed to. That should have allowed the robotaxis to operate normally in spite of the massive outage.\nInstead, many of the vehicles requested a “confirmation check” from Waymo’s fleet response team to make sure what they were doing was correct. All Waymo robotaxis have the ability to make these confirmation checks. With such a widespread outage on Saturday, there was a “concentrated spike” in these confirmation requests, Waymo said, which helped create all the congestion caught on video.\nWaymo said it built this confirmation request system “out of an abundance of caution during our early deployment” but that it is now refining it to “match our current scale.” \n“While this strategy was effective during smaller outages, we are now implementing fleet-wide updates that provide the [self-driving software] with specific power outage context, allowing it to navigate more decisively,” the company wrote.\nThe software update will add “even more context about regional outages” to the company’s self-driving software. Waymo also said it will improve its emergency response protocols by “incorporating lessons from this event.” \nWhile a lot of focus has been placed on the instances where Waymo’s robotaxis got stuck during the power outage, the company shared that its vehicles “successfully traversed more than 7,000 dark signals on Saturday.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Navigating an event of this magnitude presented a unique challenge for autonomous technology,” the company wrote. \nSaturday’s mess is the latest example of how Waymo is still uncovering unforeseen issues with its software and its approach to designing a reliable fleet of self-driving vehicles. The company already had to ship multiple software updates to make its robotaxis wait for stopped school buses, which prompted a National Highway Traffic Safety Administration investigation and led to a recall. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Marissa Mayer’s new startup Dazzle raises $8M led by Forerunner’s Kirsten Green",
    "url": "https://techcrunch.com/2025/12/23/marissa-mayers-new-startup-dazzle-raises-8m-led-by-forerunners-kirsten-green/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/03/GettyImages-1172241499.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-23T16:48:45.000Z",
    "description": "Mayer launched Dazzle after shuttering her photo and contact management startup Sunshine. Green’s investment suggests Dazzle is poised for the coming wave of new AI-infused consumer businesses.",
    "body": "\nThe former Yahoo CEO, Marissa Mayer, refuses to sit on the sidelines of the generative AI revolution.\nAfter spending the last six years running Sunshine, a photo-sharing and contact-management startup with little success, the storied tech leader has shuttered the company to launch Dazzle, a new startup focused on building the next generation of AI personal assistants.\nWhile Mayer is not yet sharing specifics about Dazzle’s functionality, she has revealed that the new company has raised an $8 million seed round at a $35 million valuation. The round was led by Forerunner’s Kirsten Green, with participation from Kleiner Perkins, Greycroft, Offline Ventures, Slow Ventures, and Bling Capital. Although Mayer has admitted to investing her own capital in the startup, she emphasized that the round was led by Green, a venture capitalist with a storied record of identifying iconic consumer brands such as Warby Parker, Chime, and Dollar Shave Club.\nGreen’s investment suggests Dazzle is poised for the coming wave of new AI-infused consumer businesses. The founder of Forerunner Ventures previously told TechCrunch that while enterprise AI took the early lead in this tech cycle, consumer-facing AI is a “late bloomer” that’s finally ready for its breakout.\nEven for a founder of Mayer’s fame, landing Green as a lead investor is a significant stamp of credibility for Dazzle, especially after Sunshine was widely considered to be a flop. “I think she really has a great sense for where people and platforms are going,” Mayer said.  \nMayer told TechCrunch that the Sunshine team began prototyping Dazzle last summer, a project that quickly eclipsed their previous work in ambition and opportunity. “We realized that this was something that we were much more excited about,” she said, noting that Dazzle has potential for “a much bigger impact” than what Sunshine was building.\nOriginally founded as Lumi Labs in 2018, Sunshine first launched with a subscription app for contact management dubbed “Sunshine Contacts.” Despite its founder’s high profile, the product struggled to gain traction. Privacy advocates raised alarms over the app’s practice of pulling home addresses from public databases to enrich contact lists, and the company never recovered from the initial skepticism. By 2024, the company broadened its offering by adding event management and “Shine,” an AI-powered photo-sharing tool. The new offering was widely criticized for its outdated design and similarly failed to attract widespread usage.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSunshine raised a total of $20 million from investors, including Felicis, Norwest Venture Partners, and Unusual Ventures. When the company was dissolved, investors received 10% of Dazzle’s equity, Mayer said.\nReflecting on Sunshine’s struggle, Mayer was candid about its limitations, admitting the problems the company was tackling were too “mundane” and not large enough. “I don’t think we got it to the state of overall polish and accessibility that I really wanted it to be,” she added.\nMayer is now betting that the lessons from Sunshine will help her build a much more resilient and impactful business with Dazzle.\nBefore her tenure as Yahoo CEO, Mayer was employee number 20 at Google, where she helped design Google search ‘look and feel’, and oversaw the development of Google Maps and AdWords.\n“I have had the rare privilege of being at two companies that really changed how people do things,” Mayer told TechCrunch. “Yahoo, for many, defined the internet. Google, in terms of Search and Maps, changed everything. I really aspire to build a product that has that kind of impact again.”\nDazzle is expected to come out of stealth mode early next year.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]