[
  {
    "title": "Apple will reportedly unveil its Gemini-powered Siri assistant in February",
    "url": "https://techcrunch.com/2026/01/25/apple-will-reportedly-unveil-its-gemini-powered-siri-assistant-in-february/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/apple-intelligence-iphone-mac.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-25T16:56:31.000Z",
    "description": "\nIn Brief\nPosted:\n8:56 AM PST · January 25, 2026\n\nImage Credits:Nikolas Kokovlis/NurPhoto / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWe",
    "body": "\nIn Brief\nPosted:\n8:56 AM PST · January 25, 2026\n\nImage Credits:Nikolas Kokovlis/NurPhoto / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWe’re about to get our first real look at the results of the recently announced AI partnership between Apple and Google, according to Bloomberg’s Mark Gurman.\nGurman reports that Apple is planning to announce a new version of Siri in the second half of February. Using Google’s Gemini AI models, this Siri update will reportedly be the first to live up to the promises Apple made in June 2024, with the ability to complete tasks by accessing user’s personal data and on-screen content.\nAnd that’s ahead of an even bigger upgrade that Apple plans to announce in June, at its Worldwide Developers Conference, Gurman says. This version of Siri is supposed to be more conversational, in the style of other chatbots like ChatGPT, and it could run directly on Google’s cloud infrastructure.\nEarlier reports suggested that Apple has been struggling to get its AI strategy back on-track. In fact, Gurman says Apple’s Mike Rockwell told foundation team members over the summer that one of Gurman’s earlier reports was “bulls–t.” But with the Google partnership, as well as the recent departure of Apple’s AI chief John Giannandrea, it seems the company has indeed found a new direction.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple will reportedly unveil its Gemini-powered Siri assistant in February",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/apple-intelligence-iphone-mac.jpg?w=150"
      ],
      "datePublished": "2026-01-25T16:56:31.000Z",
      "dateModified": "2026-01-25T16:56:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SEC drops lawsuit against Winklevoss twins’ Gemini crypto exchange",
    "url": "https://techcrunch.com/2026/01/24/sec-drops-lawsuit-against-winklevoss-twins-gemini-crypto-exchange/",
    "image": "https://techcrunch.com/wp-content/uploads/2015/05/winklevoss-brothers4.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T18:06:33.000Z",
    "description": "\nIn Brief\nPosted:\n10:06 AM PST · January 24, 2026\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Securities and Exchange Com",
    "body": "\nIn Brief\nPosted:\n10:06 AM PST · January 24, 2026\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Securities and Exchange Commission has dropped its lawsuit against Gemini, the crypto exchange founded by twins Cameron and Tyler Winklevoss.\nThe Winklevoss twins were donors to Donald Trump’s re-election campaign and also backed his family’s business ventures.\nIn a joint filing on Friday, the SEC and Gemini asked the court to dismiss the lawsuit, which centered on the collapse of an investment product called Gemini Earn, with some investors losing access to their money for 18 months.\nNew York Attorney General Letitia James sued Gemini in 2023 and accused the company of defrauding investors. To justify dismissing the SEC’s case, the new filing points to a 2024 settlement between New York and Gemini, with investors ultimately receiving “one hundred percent of the crypto assets they had loaned […] through the Gemini Earn program.”\nThis appears to be a larger pattern of leniency from the Trump administration towards the crypto industry. The New York Times previously reported that the SEC has either dismissed, paused, or reduced penalties in more than 60 percent of the crypto lawsuits pending when Trump took office last year. \nGemini has also filed to go public.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Government & Policy\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SEC drops lawsuit against Winklevoss twins’ Gemini crypto exchange",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2015/05/winklevoss-brothers4.jpg?w=150"
      ],
      "datePublished": "2026-01-24T18:06:33.000Z",
      "dateModified": "2026-01-24T18:06:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google says it’s fixed Gmail issues with spam and misclassification",
    "url": "https://techcrunch.com/2026/01/25/gmail-is-having-issues-with-spam-and-misclassification/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/10/gmail-icon-2020-ios.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-25T16:16:39.000Z",
    "description": "\nIn Brief\nPosted:\n8:16 AM PST · January 25, 2026\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nIf your Gmail account didn’t see",
    "body": "\nIn Brief\nPosted:\n8:16 AM PST · January 25, 2026\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nIf your Gmail account didn’t seem to be working properly Saturday, you were not alone. But Google says the issue has been be resolved.\nThe official status dashboard for Google Workspace suggests that problems began at around 5am Pacific on Saturday morning, with users experiencing both “misclassification of emails in their inbox and additional spam warnings.”\nFor me, that meant my Primary inbox was filled with messages that would normally appear in the Promotions, Social, or Updates inboxes, and that spam warnings were appearing in emails from known senders. Other users complained on social media that “all the spam is going directly to my inbox” and that Gmail’s filters seem “suddenly completely busted.”\nThe Google dashboard was updated with messages throughout the day on Saturday saying that the company was still working to resolve the issue. Later on Saturday evening, Google posted that the issue had been “fully resolved for all users.”\n“Some Gmail users experienced a misclassification of emails in their inbox, delays in receiving email,” the company said in a dashboard update. “Additionally, misclassified spam warnings from the incident may persist for existing messages received before the issue resolution.”\nThe company also said that it will “publish an analysis of this incident once we have completed our internal investigation.”\nThis post was first published on January 24, 2026. It has been updated to include Google’s statement that the issue has been resolved.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Apps\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google says it’s fixed Gmail issues with spam and misclassification",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/10/gmail-icon-2020-ios.jpg?w=150"
      ],
      "datePublished": "2026-01-25T16:16:39.000Z",
      "dateModified": "2026-01-25T16:16:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How did Davos turn into a tech conference?",
    "url": "https://techcrunch.com/video/how-did-davos-turn-into-a-tech-conference/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256813240.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T20:00:00.000Z",
    "description": "\n\t\t\n\nLoading the player…\n\nThe World Economic Forum’s annual meeting in Davos felt different this year, and not just because Meta and Salesforce took o",
    "body": "\n\t\t\n\nLoading the player…\n\nThe World Economic Forum’s annual meeting in Davos felt different this year, and not just because Meta and Salesforce took over storefronts on the main promenade. AI dominated the conversation in a way that overshadowed traditional topics like climate change and global poverty, and the CEOs weren’t holding back. There was public criticism of trade policy, warnings about AI bubbles popping, and a lot of talk about what comes next for the industry. \nWatch as TechCrunch’s Equity podcast discusses which conversations took over Davos this week, the latest startup raises that caught our eye, and more.\nSubscribe to Equity on YouTube, Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.\n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How did Davos turn into a tech conference?",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256813240.jpg?w=150"
      ],
      "datePublished": "2026-01-23T20:00:00.000Z",
      "dateModified": "2026-01-23T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple iPhone just had its best year in India as the smartphone market stays broadly flat",
    "url": "https://techcrunch.com/2026/01/23/apple-iphone-just-had-its-best-year-in-india-as-the-smartphone-market-stays-broadly-flat/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/iphone-17-air-pro-apple.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T05:00:00.000Z",
    "description": "\nApple’s iPhone is gaining ground fast in India, shipping about 14 million units in 2025, based on market data shared exclusively with TechCrunch.\nYet",
    "body": "\nApple’s iPhone is gaining ground fast in India, shipping about 14 million units in 2025, based on market data shared exclusively with TechCrunch.\nYet the country’s overall smartphone market stayed largely flat at around 152–153 million devices. That means that across the full-year of 2025, Apple’s market share of shipments rose to a record 9%. This is up from 7% in 2024, Counterpoint Research data shows, making it the iPhone’s strongest year yet in the world’s second-largest smartphone market by volume.  \nThe gains were driven by the iPhone’s product portfolio, growing aspirational demand and wider availability across sales channels, Counterpoint Research’s director for devices and ecosystems, Tarun Pathak, said.\nApple has repeatedly pointed to India as a standout market in recent quarters, with CEO Tim Cook saying the company set an “all-time revenue record in India” on its last earnings call in October. CFO Kevan Parekh also said iPhone’s active install base hit an all-time high in India and the company set a quarterly record for upgraders, highlighting Apple’s push to expand its user base beyond just new buyers, though the company did not disclose detailed figures for India on the call.\nBeyond shipments, Apple has been widening its footprint in India by ramping up local manufacturing and broadening its retail reach. Last month, the company opened its fifth Apple Store in the country — its first in Noida — as part of a broader retail expansion that began in 2023.\nApple is also sharpening its services pitch in India. Earlier this month, it introduced Apple Creator Studio — a subscription bundle of creative apps such as Final Cut Pro and Logic Pro — priced at ₹399 a month ($4.35) in India. That’s around 66% cheaper than the $12.99 a month it charges in the U.S., underscoring how the company is tailoring pricing to deepen its reach in the country.\nThat strong iPhone year came against a market that has largely stopped growing. India is set to log its fourth straight year at about the same shipment level of 152 million units, Counterpoint estimates, with the October–December quarter down 8–10% year-over-year despite the festive season.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLonger replacement cycles, fewer feature phone users upgrading to smartphones, and the growing popularity of refurbished devices are among the key reasons the market has struggled to grow, Pathak told TechCrunch.\nEven as overall shipments stagnated, India’s premium segment continued to expand. Smartphones priced above ₹30,000 (around $327) grew 15% year-over-year in 2025 and accounted for a record 23% of total shipments — the highest share ever — according to Counterpoint.\nThat shift has helped brands with stronger premium portfolios, including Apple, gain ground even as the mass market slowed.\nBy volume, China’s Vivo led India’s smartphone market in 2025 with a 23% share of shipments, per Counterpoint, followed by Samsung at 15% and Xiaomi at 13%.\nApple remained outside India’s top three by shipments despite its record year, underlining how the market is still dominated by mass-market Android brands even as premium devices take a growing share.\nCounterpoint expects India’s smartphone market to slip about 2% in 2026, warning that rising memory prices could squeeze demand in the sub-₹15,000 (under-$170) segment and force phone makers to cut cashback offers, trim specifications or raise prices. Even so, average selling prices are forecast to rise 5% in 2026 after a 9% increase in 2025, suggesting the premiumization trend is set to continue.\nApple did not respond to a request for comment.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple iPhone just had its best year in India as the smartphone market stays broadly flat",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/iphone-17-air-pro-apple.jpg?w=150"
      ],
      "datePublished": "2026-01-24T05:00:00.000Z",
      "dateModified": "2026-01-24T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Rippling/Deel corporate spying scandal may have taken another wild turn",
    "url": "https://techcrunch.com/2026/01/23/the-rippling-deel-corporate-spying-scandal-may-have-taken-another-wild-turn/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-1241456780.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T21:13:28.000Z",
    "description": "\nThe Department of Justice has reportedly opened a criminal investigation into HR and payroll startup Deel over allegations that it hired a corporate ",
    "body": "\nThe Department of Justice has reportedly opened a criminal investigation into HR and payroll startup Deel over allegations that it hired a corporate spy to leak information on its biggest rival, Rippling, reports The Wall Street Journal.\nIn an emailed statement to TechCrunch, Deel says that it is “not aware of any investigation. We will always cooperate with the relevant authorities and provide any necessary information in response to valid inquiries.”\nDeel’s statement then makes its own allegations against Rippling. It points to its own lawsuit that alleges its rival has been on a “smear campaign,” claiming it’s beating the competitor in the market, and adding, “the truth will win in court.” Rippling declined comment.\nThis is arguably the biggest drama between two HR startups ever.\nTo recap, Rippling sued Deel in May, and revised the suit in June, alleging that its rival planted a corporate spy. The Rippling employee was caught in a sting operation and confessed to being a paid spy for Deel in an Irish court via a sworn written statement that reads like a Hollywood movie. The employee testified that he took Rippling’s sales leads, product roadmaps, customer account info, names of superstar employees, whatever was asked for, and handed it over to Deel executives.\nRippling’s suit, which is ongoing, charged its rival with violations of the federal racketeering law (known as the RICO statute and typically used against organized crime) among other laws it cited. But despite using phrases like “criminal syndicate,” this was a civil suit, not a criminal prosecution.\nDeel countersuited Rippling, also alleging spying by impersonating a customer, among other claims.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe spy lived in fear\nThe man who confessed to spying agreed to testify in Rippling’s case, and Rippling agreed to pay him for legal and travel expenses, according to the man’s cooperation agreement released as a court document and seen by TechCrunch. Deel is now calling the man Rippling’s “paid witness.”\nBut the man also went back to court alleging that his family was living in terror because he believed men from Deel were following him. Deel’s lawyer initially denied this but later discovered that Deel did hire surveillance.\nPayment to the spy \nRippling scored the most recent win, at the end of November, when it obtained bank records. The records indicated that Deel transferred funds into an account held by the wife of Deel’s COO, and 56 seconds later that account transferred the same amount to an account held by the confessed spy.\nIn the meantime, another court document shows that Deel’s founder and CEO Alexandre Bouaziz, who has been called “the mastermind” of the spying plot in Rippling’s lawsuit, has hired high-powered lawyer William Frentzen to represent him. Frentzen is a partner with Morrison Foerster’s white-collar defense group and was formerly the chief of the corporate and securities fraud unit of the U.S. Attorney’s Office for the Northern District of California.\nRippling’s lawyer is none other than Alex Spiro of white-shoe law firm Quinn Emanuel. Spiro is a former prosecutor for the Manhattan District Attorney’s Office who is known for his big personality and long list of celeb clients, ranging from Elon Musk to Jay-Z.\nSo it’s all sounding like a plot from a John Grisham novel, with a sprinkle of the show “Suits” on top.\nNone of this has stopped investors from backing Deel or Rippling. In October, Deel announced it hit a $17.3 billion valuation after raising $300 million led by Ribbit Capital and Andreessen Horowitz. Rippling hit a $16.8 billion valuation in May after raising $450 million from investors like Elad Gil, Goldman Sachs Alternatives, and Y Combinator.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Rippling/Deel corporate spying scandal may have taken another wild turn",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-1241456780.jpg?w=150"
      ],
      "datePublished": "2026-01-23T21:13:28.000Z",
      "dateModified": "2026-01-23T21:13:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Photos’ latest feature lets you meme yourself",
    "url": "https://techcrunch.com/2026/01/23/google-photos-latest-feature-lets-you-meme-yourself/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/08/Works-with-Google-Photos.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T17:02:22.000Z",
    "description": "\nGoogle Photos will now let you make memes with your own images. On Thursday, Google introduced a new generative AI-powered feature called “Me Meme,” ",
    "body": "\nGoogle Photos will now let you make memes with your own images. On Thursday, Google introduced a new generative AI-powered feature called “Me Meme,” which will allow you to combine a photo template and an image of yourself to generate an image of the meme.\nThe new feature, which will be first available to U.S.-based users, was originally spotted in development last October by the blog Android Authority. It was formally announced by Google via its Photos Community site on Thursday.\n\nAccording to Google, the feature is experimental, so generated images “may not perfectly match the original photo.” It suggests uploading well-lit, focused, and front-facing photos to get the best results.\nThe addition is meant to just be a fun way to explore your photos and experiment with Google’s Gemini AI technology, and specifically Nano Banana. Google’s popular AI image model powers other AI features in the Google Photos app, like the ability to re-create images in new styles, such as cartoons or paintings. \nThough a fairly unserious addition, all things considered, these types of features help remind users to return to the Photos app whenever they want to play around with AI tools, rather than going to a competitor’s product.\nPlus, users tend to gravitate toward features that show themselves in AI edits, as OpenAI found with its successful launch of the Sora app, which lets you make AI videos that can include yourself and your friends. \n“Me Meme” isn’t fully rolled out, so you may not see it in your updated Google Photos app just yet. When available, it will appear under the “Create” tab, Google says. A rep for Google told TechCrunch the feature will reach U.S. iOS and Android users over the “coming weeks.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTo use the feature, you’ll select a template or upload your own, then tap “add photo” and “Generate.” Google notes that more templates are being added over time. After the AI creates the image, you can save the photo, share it on other platforms, or tap “regenerate” to have it re-imagine the image a second time.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Photos’ latest feature lets you meme yourself",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/08/Works-with-Google-Photos.jpg?w=150"
      ],
      "datePublished": "2026-01-23T17:02:22.000Z",
      "dateModified": "2026-01-23T17:02:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Researchers say Russian government hackers were behind attempted Poland power outage",
    "url": "https://techcrunch.com/2026/01/23/researchers-say-russian-government-hackers-were-behind-attempted-poland-power-outage/",
    "image": "https://techcrunch.com/wp-content/uploads/2017/10/kremlin-hacking.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T20:17:24.000Z",
    "description": "\nA failed December effort to bring down parts of Poland’s energy grid was the work of Russian government hackers known for causing past energy disrupt",
    "body": "\nA failed December effort to bring down parts of Poland’s energy grid was the work of Russian government hackers known for causing past energy disruptions, according to a security research firm that investigated the incident. \nLast week, Polish Energy Minister Milosz Motyka told reporters that the attempted cyberattack on December 29 and 30 saw hackers targeting two heat and power plants, as well as trying to disrupt the communication links between renewable installations, such as wind turbines and power distribution operators.\nMotyka called the incident the “strongest attack” on Poland’s energy infrastructure in years, with the Polish government blaming Moscow for the attempt. Local media reported that the attacks could have knocked out heat and power for at least half a million homes across the country. \nOn Friday, cybersecurity firm ESET said it obtained a copy of the destructive malware, which it calls DynoWiper. This type of malware, known as “wiper” malware, is designed to irreversibly destroy data on computers to prevent them from working. \nESET attributed the malware with “medium confidence” to the hacking group known as Sandworm, a unit within Russia’s military intelligence agency GRU, based on a “strong overlap” with its previous research into Sandworm’s past malware, including the group’s use of destructive malware to target Ukraine’s energy sector.\nIndependent journalist Kim Zetter first reported the news.\nAs noted by Zetter, the cyberattacks targeting Poland come almost exactly a decade after Sandworm’s first-known cyberattack on Ukraine’s energy infrastructure in 2015, which caused power outages for more than 230,000 homes around Kyiv, the country’s capital. A similar cyberattack hit Ukraine’s energy systems a year later. \nFollowing the attempted hack, Poland’s prime minister, Donald Tusk, said that the country’s cybersecurity defenses worked, and “at no point was critical infrastructure threatened.”\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Researchers say Russian government hackers were behind attempted Poland power outage",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2017/10/kremlin-hacking.jpg?w=150"
      ],
      "datePublished": "2026-01-23T20:17:24.000Z",
      "dateModified": "2026-01-23T20:17:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Legal AI giant Harvey acquires Hexus as competition heats up in legal tech",
    "url": "https://techcrunch.com/2026/01/23/legal-ai-giant-harvey-acquires-hexus-as-competition-heats-up-in-legal-tech/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-11.50.31-AM.png?w=150",
    "tag": "Tech",
    "date": "2026-01-24T05:27:22.000Z",
    "description": "\nHarvey, the high-flying legal AI startup, has acquired Hexus — a two-year-old startup that builds tools for creating product demos, videos, and guide",
    "body": "\nHarvey, the high-flying legal AI startup, has acquired Hexus — a two-year-old startup that builds tools for creating product demos, videos, and guides — as the company continues its aggressive expansion amid fierce competition in the legal tech market.\nHexus founder and CEO Sakshi Pratap, who previously held engineering roles at Walmart, Oracle, and Google, tells TechCrunch that her San Francisco-based team has already joined Harvey, while the startup’s India-based engineers will come onboard once Harvey establishes a Bangalore office. Pratap adds that she will lead an engineering team focused on accelerating Harvey’s offerings for in-house legal departments.\n“What we’re bringing to Harvey is deep experience building enterprise AI tools in adjacent problem spaces,” Pratap said. “This expertise helps Harvey move faster in a market that’s becoming increasingly competitive.”\nHexus had raised $1.6 million from Pear VC, Liquid 2 Ventures, and angel investors before the acquisition. While Pratap declined to share deal terms, she said the structure was aligned around “long-term team incentives.”\n\nThe acquisition comes as Harvey looks to cement its position as one of AI’s hottest startups. The company confirmed last fall that it’s now valued at $8 billion after raising $160 million, bringing its funding across 2025 to $760 million. Andreessen Horowitz led that newest round, joined by new investors T. Rowe Price and WndrCo, alongside existing backers Sequoia Capital, Kleiner Perkins, Conviction, and angel investor Elad Gil. (It started the year with a $3 billion valuation after Sequoia led a $300 million Series D round in the company.)\nHarvey now claims more than 1,000 clients across 60 countries, including a majority of the top 10 U.S. law firms.\nWhen TechCrunch spoke with co-founder and CEO Winston Weinberg in November, he traced Harvey’s origin story back to a cold email sent to OpenAI CEO Sam Altman. Weinberg, then a first-year associate at O’Melveny & Myers, and co-founder Gabe Pereyra, a researcher who worked at Google DeepMind and Meta and was Weinberg’s roommate at the time, tested GPT-3 on landlord-tenant law questions from Reddit. When they showed the AI-generated answers to attorneys, two out of three said they’d send 86 of 100 responses with zero edits.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“That was the moment when we were like, wow, this entire industry can be transformed by this technology,” Weinberg said.\nThey emailed Altman on July 4, 2022, got on a call that same morning, and landed their first check from the OpenAI Startup Fund shortly after. According to Weinberg, the OpenAI Startup Fund remains Harvey’s second-largest investor.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Legal AI giant Harvey acquires Hexus as competition heats up in legal tech",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Screenshot-2025-11-14-at-11.50.31-AM.png?w=150"
      ],
      "datePublished": "2026-01-24T05:27:22.000Z",
      "dateModified": "2026-01-24T05:27:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta pauses teen access to AI characters ahead of new version",
    "url": "https://techcrunch.com/2026/01/23/meta-pauses-teen-access-to-ai-characters-ahead-of-new-version/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2225880947.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T17:00:00.000Z",
    "description": "\nMeta today said that it is pausing teens’ access to its AI characters globally across all its apps. The company mentioned that it is not abandoning i",
    "body": "\nMeta today said that it is pausing teens’ access to its AI characters globally across all its apps. The company mentioned that it is not abandoning its efforts but wants to develop an updated version of AI characters for teens, the company exclusively told TechCrunch.\nThe move comes days before a case against Meta is set to go to trial in New Mexico, in which the company is accused of not making an effort to protect kids from sexual exploitation on its apps. Wired reported Thursday that Meta has sought to limit discovery related to social media’s impact on teen mental health.\nIn October, the company previewed parental controls for AI characters, allowing parents and guardians to monitor topics and block access to certain characters. Meta said parents would be able to completely turn off chats with AI characters. These features were set to release this year, but the company is now turning off AI characters altogether for teens while it updates the AI characters to a newer version.\nMeta said that it heard from parents that they wanted more insights and control over their teens’ interactions with AI characters, which is why it decided to make these changes.\nThe company has been cracking down on teens’ access to AI content in its apps. Also in October, Meta rolled out parental control features on Instagram, focusing on tailoring the teen experience of interacting with AI on its apps. These features, which were inspired by the PG-13 movie rating, restricted teen access to certain topics like extreme violence, nudity, and graphic drug use.\nMeta’s previously previewed controls around AI characters.Image Credits:Meta\n“Starting in the coming weeks, teens will no longer be able to access AI characters across our apps until the updated experience is ready. This will apply to anyone who has given us a teen birthday, as well as people who claim to be adults but who we suspect are teens based on our age prediction technology,” the company said in an updated blog post. \nMeta added that when it rolls out the new AI characters, they will have built-in parental controls. The company said that the new characters will give age-appropriate responses and will stick to topics like education, sport, and hobbies.\nSocial media companies are under heavy scrutiny from regulators. Apart from the aforementioned case in New Mexico, Meta is also facing a trial next week, where the platform is accused of causing social media addiction. CEO Mark Zuckerberg is expected to take the witness stand in that case once the trial begins.\nBesides social platforms, AI companies have had to modify their experience for teens after facing lawsuits alleging to play a part in aiding self-harm. In October, Character.AI, the startup that allows users to chat with various AI avatars, disallowed open-ended conversations with chatbots for users who were under 18. In November, the startup said it would build interactive stories for kids. In the last few months, OpenAI added new teen safety rules for ChatGPT and started predicting a user’s age to apply content restrictions.\nCorrection: This post was updated to clarify the new version of AI characters will be accessible to everyone, not just teens, when it launches. It will include parental controls. \n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta pauses teen access to AI characters ahead of new version",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2225880947.jpg?w=150"
      ],
      "datePublished": "2026-01-23T17:00:00.000Z",
      "dateModified": "2026-01-23T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo probed by National Transportation Safety Board over illegal school bus behavior",
    "url": "https://techcrunch.com/2026/01/23/waymo-probed-by-national-transportation-safety-board-over-illegal-school-bus-behavior/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/waymo-robotaxi-fifth-gen.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T21:50:47.000Z",
    "description": "\nThe National Transportation Safety Board (NTSB) has opened an investigation into Waymo after its robotaxis have been spotted illegally passing stoppe",
    "body": "\nThe National Transportation Safety Board (NTSB) has opened an investigation into Waymo after its robotaxis have been spotted illegally passing stopped school buses numerous times in at least two states.\nThe NTSB is specifically focusing on the more than 20 incidents that have occurred in Austin, Texas, it said in a post on X on Friday.\n“Investigators will travel to Austin to gather information on a series of incidents in which the automated vehicles failed to stop for loading or unloading students,” the NTSB said in a statement to TechCrunch. A preliminary report is expected within 30 days, and the safety board will publish a more detailed final report in 12 to 24 months.\nIt’s the first time Waymo has been investigated by the NTSB, but it’s the second investigation launched into Waymo over its school bus problem. The National Highway Traffic Safety Administration’s (NHTSA) Office of Defects Investigation opened a similar probe in October.\nWaymo also issued a software recall last year to address the problem. But previous software updates have not been enough to stamp it out, and in Austin, Texas — where the bulk of incidents have been captured on camera — the school district has asked the company to suspend operations during pickup and drop-off times.\nThe new investigation comes as Waymo is in the middle of a rapid expansion around the United States. Just this week, the company started offering a robotaxi service in Miami, adding to its operations in Atlanta, Austin, Los Angeles, Phoenix, and the San Francisco Bay Area.\n“We safely navigate thousands of school bus encounters weekly across the United States, and the Waymo Driver is continuously improving. There have been no collisions in the events in question, and we are confident that our safety performance around school buses is superior to human drivers,” Mauricio Peña, Waymo’s chief safety officer, said in a statement to TechCrunch. “We see this as an opportunity to provide the NTSB with transparent insights into our safety-first approach.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe NTSB is different from the NHTSA in that it is not a federal regulatory agency. It cannot issue fines or penalties. Rather, the safety board usually performs deep investigations to identify root causes of problems in the transportation world. When an investigation is complete, the board often holds hearings and issues non-binding recommendations.\nThe first notable incident where a Waymo vehicle passed a stopped school bus happened last September in Atlanta. The Waymo pulled out of a driveway and crossed perpendicularly in front of the school bus from the bus’ right side. The robotaxi then turned left and proceeded down the street while kids were getting off the bus.\nWaymo said at the time that the vehicle was unable to see the stop sign or flashing lights, and has since said that it addressed this particular scenario with a software update.\nBut as Waymo patched the specific scenario it encountered in Atlanta, some of the company’s vehicles were caught passing stopped school buses in Austin, Texas. Local news outlet KXAN published videos it received from cameras mounted on school buses that showed Waymo vehicles making illegal maneuvers on multiple occasions. \n“We continue to engage productively with the Austin Independent School District and applaud their reported success in reducing human-driven violations around school buses from 10,000+ a year,” Peña said.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo probed by National Transportation Safety Board over illegal school bus behavior",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/waymo-robotaxi-fifth-gen.jpg?w=150"
      ],
      "datePublished": "2026-01-23T21:50:47.000Z",
      "dateModified": "2026-01-23T21:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tech CEOs boast and bicker about AI at Davos",
    "url": "https://techcrunch.com/2026/01/24/tech-ceos-boast-and-bicker-about-ai-at-davos/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256813240.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T20:00:46.000Z",
    "description": "\nThere were times at this week’s meeting of the World Economic Forum when Davos seemed transformed into a high-powered tech conference, with on-stage ",
    "body": "\nThere were times at this week’s meeting of the World Economic Forum when Davos seemed transformed into a high-powered tech conference, with on-stage appearances by Tesla CEO Elon Musk, Nvidia CEO Jensen Huang, Anthropic CEO Dario Amodei, Microsoft CEO Satya Nadella, and even more industry executives.\nThe big topic, unsurprisingly, was AI, with CEOs laying a vision for the technology’s transformative potential while also acknowledging ongoing concerns that they’re inflating a massive bubble. Amidst all that big-picture prognostication, they also found time to take swipes at their competitors, and even at their ostensible partners.\nOn the latest episode of TechCrunch’s Equity podcast, I discussed all things Davos with TechCrunch’s Kirsten Korosec and Sean O’Kane.\nKirsten noted that the conference seemed transformed from past years, with tech companies like Meta and Salesforce taking over the main promenade, while important topics like climate change failed to draw crowds. And Sean said that even if AI execs weren’t quite “panhandling for usage and more customers,” it could sometimes feel that way.\nRead a preview of our full conversation, edited for length and clarity, below.\nKirsten: Some of the discussions around, let’s say, climate change or poverty and big global problems, [are] not really attracting the crowds. Meanwhile, on the main promenade in Davos, Switzerland, some of the biggest storefronts have been converted and taken over by companies like Meta and Salesforce, Tata, also a lot of Middle East countries. And I think the largest was the USA House, which was sponsored by McKinsey and Microsoft. It really felt visually different.\nAnd then Elon Musk being there — Sean, you and I both listened to it. There wasn’t a lot of there there, but I will say that it was interesting that he showed up, because in the past he has avoided Davos.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAnthony: We were trying to pull out the tech content of Davos, [and] there are absolutely things that worth highlighting here, but it’s also striking how, especially as AI has become such a big business story, it’s hard to fully separate that from all the other threads going on in terms of bigger questions about international trade, about world politics.\nOne of the big headlines coming out of [Davos], for us at least, was the remarks by the CEO of Anthropic, where he basically attacked this Trump administration decision to allow Nvidia to send chips to China. It’s a story that is a tech story, but it’s also a trade story, it’s a politics story.\nI think in terms of the substance of what he said, it felt consistent to me in the sense that he’s generally comfortable shooting his mouth off, and also that it’s this interesting line [in AI discourse] where there’s an element of criticism, but it also ties into this really intense AI hype. One of the phrases he used was that an AI data center is like a country full of geniuses. I have questions about that — but he’s like, “How could we possibly send all these chips to China if we’re worried about China? Because essentially we’re sending a country full of geniuses over to China and letting them control it.”\nSean: You could probably fill a notebook with all the different weird phrases that these CEOs use this week. The other one that has been stuck in my mind is that Satya Nadella kept calling the data centers token factories, which is a wonderful abstraction of what he thinks they’re there for.\nYou know, there were two things that really stuck out to me about all the different things that were said by these CEOs in different parts of the week. One is that they are definitely all sort of sniping at each other — not just Anthropic with Nvidia, which is interesting in its own right, because Anthropic is a huge Nvidia customer and uses Nvidia GPUs, and there’s an interesting tension there. But also just seeing them sitting them next to each other and really kind of pulling, know, putting the knives out a little bit more than we’re used to seeing.\nWe know that they’re all jockeying to be the lead and that they’re also trying to hold on to talent without overspending themselves to death. And this was one of the first times where it really felt like that tension was palpable and that they were present for it. Those two things are not often true at the same time.\nThe other thing, to your point about a lot of the geopolitics of it and the business of it — this was the most blatant that I feel like we’ve gotten these CEOs on record as far as what they think they need to continue succeeding.\nSatya Nadella — I think you could maybe unfavorably read it this way, but I don’t think it’s that unfavorable — more or less was like, “More people need to be using this or else it’s going to be a bubble and a popped bubble.” He took a much different position in some ways from Dario Amadei of Anthropic, because Nadella’s focus is really about trying to broadly scoop up as much usage as possible [and] how do we make sure that AI is equitable across all these different communities and throughout the globe, versus concentrated in one place, like only the wealthy places, which I thought was an interesting tension. But there is an element of him giving away the game of not really panhandling for usage and more customers … but kind of.\nAnd to that point, Jensen Huang of Nvidia did something similar, where he was more or less saying, “We’re not investing enough in this and we need more investment to be able to make this work.”\nKirsten: Jensen’s comments were interesting because he really talked about it in terms of job creation, and one could give the counterpoint of, there will be a moment where the build out slows, but no one’s really talking about that right now.\nThe other thing, I think, was a good point that you made, which is we’ve never really seen them all sort of together in a room sniping at each other. Oftentimes you’ll have like Sam Altman at a conference or Satya [Nadella], but here they are all together. So you’re hearing it in real time.\n\n\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tech CEOs boast and bicker about AI at Davos",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256813240.jpg?w=150"
      ],
      "datePublished": "2026-01-24T20:00:46.000Z",
      "dateModified": "2026-01-24T20:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A new test for AI labs: Are you even trying to make money?",
    "url": "https://techcrunch.com/2026/01/24/a-new-test-for-ai-labs-are-you-even-trying-to-make-money/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/ilyausutskever-GettyImages.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T17:00:00.000Z",
    "description": "\nWe’re in a unique moment for AI companies building their own foundation model. \nFirst, there is a whole generation of industry veterans who made thei",
    "body": "\nWe’re in a unique moment for AI companies building their own foundation model. \nFirst, there is a whole generation of industry veterans who made their name at major tech companies and are now going solo. You also have legendary researchers with immense experience but ambiguous commercial aspirations. There’s a clear chance that at least some of these new labs will become OpenAI-sized behemoths, but there’s also room for them to putter around doing interesting research without worrying too much about commercialization.\nThe end result? It’s getting hard to tell who is actually trying to make money. \nTo make things simpler, I’m proposing a kind of sliding scale for any company making a foundation model. It’s a five-level scale where it doesn’t matter if you’re actually making money – only if you’re trying to. The idea here is to measure ambition, not success. \nThink of it in these terms: \n\nLevel 5: We are already making millions of dollars every day, thank you very much. \nLevel 4: We have a detailed multi-stage plan to become the richest human beings on Earth. \nLevel 3: We have many promising product ideas, which will be revealed in the fullness of time. \nLevel 2: We have the outlines of a concept of a plan. \nLevel 1: True wealth is when you love yourself. \n\nThe big names are all at Level 5: OpenAI, Anthropic, Gemini, and so on. The scale gets more interesting with the new generation of labs launching now, with big dreams but ambitions that can be harder to read. \nCrucially, the people involved in these labs can generally choose whatever level they want. There’s so much money in AI right now that no one is going to interrogate them for a business plan. Even if the lab is just a research project, investors will count themselves happy to be involved. If you aren’t particularly motivated to become a billionaire, you might well live a happier life at Level 2 than at Level 5. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe problems arise because it isn’t always clear where an AI lab lands on the scale — and a lot of the AI industry’s current drama comes from that confusion. Much of the anxiety over OpenAI’s conversion from a non-profit came because the lab spent years at Level 1, then jumped to Level 5 almost overnight. On the other side, you might argue that Meta’s early AI research was firmly at Level 2, when what the company really wanted was Level 4. \nWith that in mind, here’s a quick rundown of four of the biggest contemporary AI labs, and how they measure up on the scale. \nHumans& \nHumans& was the big AI news this week, and part of the inspiration for coming up with this whole scale. The founders have a compelling pitch for the next generation of AI models, with scaling laws giving way to an emphasis on communication and coordination tools.  \nBut for all the glowing press, Humans& has been coy about how that would translate into actual monetizable products. It seems it does want to build products; the team just won’t commit to anything specific. The most they’ve said is that they will be building some kind of AI workplace tool, replacing products like Slack, Jira and Google Docs but also redefining how these other tools work at a fundamental level. Workplace software for a post-software workplace! \nIt’s my job to know what this stuff means, and I’m still pretty confused about that last part. But it is just specific enough that I think we can put them at Level 3. \nThinking Machines Lab \nThis is a very hard one to rate! Generally, if you have a former CTO and project lead for ChatGPT raising a $2 billion seed round, you have to assume there is a pretty specific roadmap. Mira Murati does not strike me as someone who jumps in without a plan, so coming into 2026, I would have felt good putting TML at Level 4. \nBut then the last two weeks happened. The departure of CTO and co-founder Barret Zoph has gotten most of the headlines, due in part to the special circumstances involved. But at least five other employees left with Zoph, many citing concerns about the direction of the company. Just one year in, nearly half the executives on TML’s founding team are no longer working there. One way to read events is that they thought they had a solid plan to become a world-class AI lab, only to find the plan wasn’t as solid as they thought. Or in terms of the scale, they wanted a Level 4 lab but realized they were at Level 2 or 3. \nThere still isn’t quite enough evidence to justify a downgrade, but it’s getting close. \nWorld Labs \nFei-Fei Li is one of the most respected names in AI research, best known for establishing the ImageNet challenge that kickstarted contemporary deep learning techniques. She currently holds a Sequoia-endowed chair at Stanford, where she co-directs two different AI labs. I won’t bore you by going through all the different honors and academy positions, but it’s enough to say that if she wanted, she could spend the rest of her life just receiving awards and being told how great she is. Her book is pretty good too! \nSo in 2024, when Li announced she had raised $230 million for a spatial AI company called World Labs, you might think we were operating at Level 2 or lower. \nBut that was over a year ago, which is a long time in the AI world. Since then, World Labs has shipped both a full world-generating model and a commercialized product built on top of it. Over the same period, we’ve seen real signs of demand for world-modeling from both video game and special effects industries — and none of the major labs have built anything that can compete. The result looks an awful lot like a Level 4 company, perhaps soon to graduate to Level 5.\nSafe Superintelligence (SSI) \nFounded by former OpenAI chief scientist Ilya Sutskever, Safe Superintelligence (or SSI) seems like a classic example of a Level 1 startup. Sutskever has gone to great lengths to keep SSI insulated from commercial pressures, to the point of turning down an attempted acquisition from Meta. There are no product cycles and, aside from the still-baking superintelligent foundation model, there doesn’t seem to be any product at all. With this pitch, he raised $3 billion! Sutskever has always been more interested in the science of AI than the business, and every indication is that this is a genuinely scientific project at heart.  \nThat said, the AI world moves fast — and it would be foolish to count SSI out of the commercial realm entirely. On his recent Dwarkesh appearance, Sutskever gave two reasons why SSI might pivot, either “if timelines turned out to be long, which they might” or because “there is a lot of value in the best and most powerful AI being out there impacting the world.” In other words, if the research either goes very well or very badly, we might see SSI jump up a few levels in a hurry. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A new test for AI labs: Are you even trying to make money?",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/ilyausutskever-GettyImages.jpg?w=150"
      ],
      "datePublished": "2026-01-24T17:00:00.000Z",
      "dateModified": "2026-01-24T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How PopWheels helped a food cart ditch generators for e-bike batteries",
    "url": "https://techcrunch.com/2026/01/24/how-popwheels-helped-a-food-cart-ditch-generators-for-e-bike-batteries/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/popwheels-food-cart-demo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T16:00:00.000Z",
    "description": "\nFood carts are a staple of New York City dining, dispensing everything from dosa and doner kebabs to dogs and dim sum in short order. But no matter h",
    "body": "\nFood carts are a staple of New York City dining, dispensing everything from dosa and doner kebabs to dogs and dim sum in short order. But no matter how enticing the aroma of a cart’s food, the smelly gas generators that keep the lights on threaten to put customers off their meals.\nCart owners and customers may not have to suck on fumes much longer. A Brooklyn-based startup is testing the use of its e-bike batteries to power food carts, starting with La Chona Mexican on the corner of 30th and Broadway in Manhattan.\n“This really started out as a lark last summer,” David Hammer, co-founder and CEO of PopWheels, told TechCrunch. “I’m an ex-Googler from the early days, and this felt like a classic, old-school 20% project.”\nNormally, PopWheels battery packs are zipping around the city strapped to food delivery bikes. The team soon realized that connecting them to food carts was an avenue worth pursuing.\n“Are e-bike packs the perfect energy type to be powering food carts? Maybe, maybe not,” Hammer said. “I would argue it doesn’t matter. What matters is, can you solve distribution and charging?”\nIf a food cart needs more power, the owner can swap the battery packs midday.Image Credits:PopWheels\nPopWheels currently operates 30 charging cabinets around Manhattan, which serve gig workers riding e-bikes, most of whom use either Arrow or Whizz models. That’s resulted in a “de facto  decentralized fleet,” Hammer said, allowing the company to stock just a few different types of batteries to serve hundreds of customers.\nMany delivery workers ride into Manhattan from the farther reaches of the city. It’s a trip that can burn a significant portion of their charge, and many workers need two batteries to get through a full day. In response, bodegas started offering e-bike charging services, for which delivery workers typically pay $100 per month. When factoring in battery wear and tear, the total cost nears $2,000 per year, Hammer said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We can make the economics work so that we’re actually saving them money right off the bat,” he said. PopWheels charges customers $75 per month for unlimited access to its network, and Hammer said the company has a long waitlist.\nThe startup’s charging cabinets can hold 16 batteries, and PopWheels designed them to swiftly extinguish a battery fire should anything go awry during charging. (The company’s founding mission was to stamp out e-bike fires in New York City, which became a significant problem few years ago.) After building some initial cabinets, the company raised a $2.3 million seed round last year 2025.\nSwap sites are typically small open spaces like parking lots, which PopWheels has retrofit with fences and the necessary electrical connections to support several cabinets. Each cabinet draws about as much electricity as a Level 2 electric vehicle charger, which is to say not that much.\nAs PopWheels e-bike service grew, the startup began studying other opportunities. \n“There was always a little bit of an underlying thesis that there’s something bigger here,” Hammer said. “If you build urban-scale, fire-safe battery swapping infrastructure, you’re creating an infrastructure layer that lots of people are going to want to get on board with.”\nHammer started to think about alternative uses for the batteries after someone sent an article about how New York City was working to decarbonize food carts. That’s when the PopWheels team started running the numbers.\nFood carts, Hammer estimates, probably spend around $10 a day on gas for their generators to keep the lights on. (Most of the cooking is done via propane, which is a separate matter.) That’s about how much PopWheels would charge someone to subscribe to four of its batteries per day. Conveniently, four of its batteries can supply about five kilowatt-hours of electricity, which is enough to cover the low end of what a typical cart might draw. If they need more juice, Hammer said they can run to a swap station midday.\nAfter realizing the math penciled out, PopWheels built a prototype adapter and trialed it at a small event at the Brooklyn Navy Yard at last year’s New York Climate Week. Since then, the startup has been working with the the non-profit Street Vendor Project to move the idea forward. Last week’s demonstration with La Chona was the first time the batteries powered a food cart for a full day. \n“I had multiple food cart owners come up to me and say, ‘Wait, there’s no noise with this cart. What are you guys doing? Can I get this?’” Hammer said. \n“We are planning to roll this out aggressively starting this summer,” he said. “We think we could be cost neutral with gasoline for a food cart owner while solving all of the quality of life issues.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How PopWheels helped a food cart ditch generators for e-bike batteries",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/popwheels-food-cart-demo.jpg?w=150"
      ],
      "datePublished": "2026-01-24T16:00:00.000Z",
      "dateModified": "2026-01-24T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who’s behind AMI Labs, Yann LeCun’s ‘world model’ startup",
    "url": "https://techcrunch.com/2026/01/23/whos-behind-ami-labs-yann-lecuns-world-model-startup/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2198379447.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-24T00:04:45.000Z",
    "description": "\nYann LeCun’s new venture, AMI Labs, has drawn intense attention since the AI scientist left Meta to found it. This week, the startup finally confirme",
    "body": "\nYann LeCun’s new venture, AMI Labs, has drawn intense attention since the AI scientist left Meta to found it. This week, the startup finally confirmed what it’s building — and several key details have been hiding in plain sight.\nOn its newly launched website, the startup disclosed its plans to develop “world models” in order to “build intelligent systems that understand the real world.” The focus on world models was already hinted at by AMI’s name, which stands for Advanced Machine Intelligence, but it has now officially joined the ranks of the hottest AI research startups.\nBuilding foundational models that bridge AI and the real world has become one of the field’s most exciting pursuits, attracting top scientists and deep-pocketed investors alike — product or no product.\nWorld Labs, a direct rival founded by AI pioneer Fei-Fei Li, became a unicorn shortly after coming out of stealth. After launching its first product, Marble, which generates physically sound 3D worlds, World Labs is now reportedly in talks to raise fresh funding at a valuation of $5 billion. \nThere’s little doubt that VCs would be equally eager to invest in LeCun, adding credibility to rumors that AMI Labs might be raising funding at a $3.5 billion valuation. According to Bloomberg, VCs in talks with the startup include Cathay Innovation, Greycroft, and Hiro Capital, to which LeCun is an advisor. Other potential investors reportedly include 20VC, Bpifrance, Daphni, and HV Capital. \nRegardless of who writes the checks, investors may want to note an important detail: As LeCun has made clear, he is AMI’s executive chairman, not its CEO. Instead, that role belongs to Alex LeBrun, previously co-founder and CEO at Nabla, a health AI startup with offices in Paris and New York.\nLeBrun’s transition from Nabla to AMI is part of a partnership announced last December by Nabla, which develops AI assistants for clinical care and to which LeCun has been an advisor. In exchange for “privileged access” to AMI’s world models, Nabla’s board supported LeBrun’s shift from CEO to chief AI scientist and chairman, clearing the way for his new role.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAs AMI Labs’ CEO, LeBrun will be surrounded by familiar faces. After Facebook acquired his previous startup, Wit.ai, the serial entrepreneur and AI engineer worked under LeCun’s leadership at Meta’s AI research laboratory, FAIR. According to reports, the duo will also be joined by Laurent Solly, who stepped down as Meta’s vice president for Europe last December.\nThe talent overlap between AMI and Meta likely won’t stop there. LeCun told the MIT Technology Review that his former employer could well be AMI’s first client. But he has also been publicly critical of some of Meta’s strategic choices made under Mark Zuckerberg’s direction. More broadly, the Review interprets AMI Labs as a contrarian bet against large language models (LLMs).\nThe limitations of LLMs that LeCun has pointed out include hallucinations, which are a serious concern in contexts like medicine, as LeBrun also knows firsthand. AMI Labs’ CEO told Forbes that a big reason he took the role was the prospect of applying its world models to healthcare. But the startup will also target other high-stakes applied fields.\n“AMI Labs will advance AI research and develop applications where reliability, controllability, and safety really matter, especially for industrial process control, automation, wearable devices, robotics, healthcare, and beyond,” it wrote in its mission statement. “We share one belief: real intelligence does not start in language. It starts in the world.”\nUnlike generative approaches, which LeCun and his team see as poorly suited for unpredictable data such as sensor input, the startup promises that its AI systems will not only understand the real world, but also have persistent memory, the ability to reason and plan, and be controllable and safe.\nThe startup plans to license its technology to industry partners for real-life applications, but says it also plans to contribute to building the future of AI “with the global academic research community via open publications and open source.” LeCun said he plans to keep his professor position at NYU, where he teaches one class per year and supervises PhD and postdoctoral students.\nThis means that the French-born researcher will remain based in New York, but he told the MIT Technology Review that AMI Labs “is going to be a global company [that’s] headquartered in Paris.” The news was welcomed by French President Emmanuel Macron, who expressed his pride that LeCun, who is also a Turing Prize winner, chose Paris. “We will do everything we can to ensure his success from France,” he said.\nThe startup will also have offices in Montreal, New York, and Singapore, but its decision to pick Paris for its headquarters will help consolidate Paris’ reputation as an AI hub, where it will join the ranks of H, Mistral AI and several international labs, including FAIR. It’s fitting, perhaps, that AMI is pronounced a-mee — like “ami” in French, which means “friend,” LeCun has pointed out.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who’s behind AMI Labs, Yann LeCun’s ‘world model’ startup",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2198379447.jpg?w=150"
      ],
      "datePublished": "2026-01-24T00:04:45.000Z",
      "dateModified": "2026-01-24T00:04:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]