[
  {
    "title": "Roblox CEO interview gets heated over child safety",
    "url": "https://techcrunch.com/2025/11/23/roblox-ceo-interview-gets-heated-over-child-safety/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1167248846.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-23T21:58:04.000Z",
    "description": "\nIn Brief\nPosted:\n1:58 PM PST · November 23, 2025\n\nImage Credits:Ian Tuttle / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRoblox CEO Dave ",
    "body": "\nIn Brief\nPosted:\n1:58 PM PST · November 23, 2025\n\nImage Credits:Ian Tuttle / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRoblox CEO Dave Baszucki joined The New York Times’ Hard Fork podcast to discuss the gaming platform’s new age verification feature — but he seemed to get frustrated at the number of questions focused on child safety.\nThe interview began with Baszucki describing the feature, which will require all users who want to submit a face scan if they want to access Roblox’s messaging features. But by the time he was asked about a report claiming the company had prioritized growth over safety, Baszucki seemed to tire of the topic, responding, “Fun. Let’s keep going down this.”\nAnd when co-host Kevin Roose agreed that one of the best ways for Roblox to improve child safety is to improve its AI models, Baszucki insisted, “Good, so you’re aligning with what we did. High-five.”\n“And I want to highlight, I came here because I love your podcast and came to talk about everything,” he added. “So if our PR people said, ‘Let’s talk about age-gating for an hour,’ I’m up for it, but I love your pod. I thought I came here to talk about everything.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Gaming\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Roblox CEO interview gets heated over child safety",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1167248846.jpeg?w=150"
      ],
      "datePublished": "2025-11-23T21:58:04.000Z",
      "dateModified": "2025-11-23T21:58:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration might not fight state AI regulations after all",
    "url": "https://techcrunch.com/2025/11/22/trump-administration-might-not-fight-state-ai-regulations-after-all/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-22T22:20:27.000Z",
    "description": "\nIn Brief\nPosted:\n2:20 PM PST · November 22, 2025\n\nImage Credits:Anna Moneymaker / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Trump a",
    "body": "\nIn Brief\nPosted:\n2:20 PM PST · November 22, 2025\n\nImage Credits:Anna Moneymaker / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Trump administration has been targeting state-level AI regulation, with the president declaring in a social media post this week that the industry needs “one Federal Standard instead of a patchwork of 50 State Regulatory Regimes.”\nThis comes after a 10-year ban on state AI regulation was initially included in Trump’s “Big Beautiful Bill” before ultimately getting removed by the Senate in a 99-1 vote. \nThe idea then apparently took on a new form, with the administration reportedly drafting an executive order that would establish an AI Litigation Task Force with a mission to challenge state AI laws through lawsuits. States with contested AI laws would also reportedly be threatened with the loss of federal broadband funding.\nNow, Reuters reports that the executive order has been put on hold. If signed, the order would probably face significant opposition, including from Republicans who previously criticized the proposed moratorium on state regulation.\nAI regulation has also been a controversial topic in Silicon Valley, with some industry figures — especially those in the Trump administration — attacking companies like Anthropic for supporting AI safety bills including California’s SB 53.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Government & Policy\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration might not fight state AI regulations after all",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=150"
      ],
      "datePublished": "2025-11-22T22:20:27.000Z",
      "dateModified": "2025-11-22T22:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta wants to get into the electricity trading business",
    "url": "https://techcrunch.com/2025/11/22/meta-wants-to-get-into-the-electricity-trading-business/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-22T17:26:36.000Z",
    "description": "\nIn order to accelerate the construction of new power plants needed to provide energy for its data centers, Meta is looking to get into the business o",
    "body": "\nIn order to accelerate the construction of new power plants needed to provide energy for its data centers, Meta is looking to get into the business of trading electricity.\nBloomberg reports that both Meta and Microsoft are asking for federal approval to trade power (Apple has already received this approval). According to Meta, this will allow it to make long-term commitments to buy electricity from new plants, while mitigating the risk by having the ability to resell some of that power on wholesale power markets.\nMeta’s head of global energy, Urvi Parekh, told Bloomberg that power plant developers “want to know that the consumers of power are willing to put skin in the game.”\n“Without Meta taking a more active voice in the need to expand the amount of power that’s on the system, it’s not happening as quickly as we would like,” Parekh said.\nAs an example of the unprecedented energy needs underlying tech companies’ ambitious AI data center plans, Bloomberg notes that at least three new gas-powered plants will need to be built to power Meta’s Louisiana data center campus.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta wants to get into the electricity trading business",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=150"
      ],
      "datePublished": "2025-11-22T17:26:36.000Z",
      "dateModified": "2025-11-22T17:26:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Malaysia may ban users under 16 from social media starting next year",
    "url": "https://techcrunch.com/2025/11/24/malaysia-may-ban-users-under-16-from-social-media-starting-next-year/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/02/malaysia.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:03:32.000Z",
    "description": "\nIn Brief\nPosted:\n6:03 AM PST · November 24, 2025\n\nImage Credits:Senyeorita Osman / EyeEm / Getty Images (Image has been modified)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n6:03 AM PST · November 24, 2025\n\nImage Credits:Senyeorita Osman / EyeEm / Getty Images (Image has been modified)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAs Australia’s ban on social media use for users under 16 looms, it appears Malaysia now plans to implement a similar system starting next year. \nThe country’s communications minister, Fahmi Fadzil, reportedly said the administration is considering systems for implementing age restrictions on social media platforms, barring users under 16 years old from platforms like Facebook, Instagram, and X, Reuters reported.\n“We hope by next year that social media platforms will comply with the government’s decision to bar those under the age of 16 from opening user accounts,” the report quoted Fadzil as saying.\nMalaysia would join a growing list of countries that are implementing age restrictions or verification measures to protect children from the risks associated with social media usage. Australia has already passed a law that will come into force on December 10, mandating social media sites to deactivate accounts belonging to users under 16.\nFrance, Denmark, Italy, and Norway are working on similar age-restriction measures for social media platforms, and in the U.S., 24 states have so far enacted age-verification laws. Utah became the first U.S. state to require app stores to verify users’ ages and obtain parental consent for minors downloading apps.\nThe U.K.’s Online Safety Act also came into effect in July, mandating social media and other online platforms to block children’s access to harmful content or face huge fines. The U.K. requires strong age checks for high-risk content, like self-harm and eating disorder content, to protect users under 18.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Malaysia may ban users under 16 from social media starting next year",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/02/malaysia.jpg?w=150"
      ],
      "datePublished": "2025-11-24T14:03:32.000Z",
      "dateModified": "2025-11-24T14:03:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI is too risky to insure, say people whose job is insuring risk",
    "url": "https://techcrunch.com/2025/11/23/ai-is-too-risky-to-insure-say-people-whose-job-is-insuring-risk/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-16-at-1.22.20-AM.png?w=150",
    "tag": "Tech",
    "date": "2025-11-23T17:45:00.000Z",
    "description": "\nIn Brief\nPosted:\n9:45 AM PST · November 23, 2025\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhat happens when the software that everyone’s racing t",
    "body": "\nIn Brief\nPosted:\n9:45 AM PST · November 23, 2025\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhat happens when the software that everyone’s racing to adopt becomes too risky for anyone to insure? According to reporting from the Financial Times, we’re about to find out.\nMajor insurers including Great American, Chubb, and WR Berkley are asking U.S. regulators for permission to exclude widespread AI-related liabilities from corporate policies. One underwriter describes the AI models’ outputs to the FT as “too much of a black box.”\nAIG, also listed in the FT story, has since sent TechCrunch the following statement: “AIG was not specifically seeking to use these [reported upon] exclusions and has no plans to implement them at this time.”\nThe industry has good reason to be spooked, the story reminds us. Google’s AI Overview falsely accused a solar company of legal troubles, triggering a $110 million lawsuit back in March. Air Canada last year got stuck honoring a discount its chatbot invented. And fraudsters last year used a digitally cloned version of a senior executive to steal $25 million from the London-based design engineering firm Arup during a video call that seemed entirely real.\nWhat really terrifies insurers isn’t one massive payout; it’s the systemic risk of thousands of simultaneous claims when a widely used AI model steps in it. As one Aon executive put it, insurers can handle a $400 million loss to one company. What they can’t handle is an agentic AI mishap that triggers 10,000 losses at once.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI is too risky to insure, say people whose job is insuring risk",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-16-at-1.22.20-AM.png?w=150"
      ],
      "datePublished": "2025-11-23T17:45:00.000Z",
      "dateModified": "2025-11-23T17:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X’s new About This Account feature is going great",
    "url": "https://techcrunch.com/2025/11/23/xs-new-about-this-account-feature-is-going-great/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/11/twitter-impersonation-parody.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-23T21:11:05.000Z",
    "description": "\nIn Brief\nPosted:\n1:11 PM PST · November 23, 2025\n\nImage Credits:Bryce Durbin / TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nX recently began",
    "body": "\nIn Brief\nPosted:\n1:11 PM PST · November 23, 2025\n\nImage Credits:Bryce Durbin / TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nX recently began rolling out a new feature that seemingly revealed many right-wing “America First” accounts are actually based outside the United States. Except the data might not be reliable.\nWhile X’s new “About This Account” feature includes information about when a user joined and how they downloaded the app, geographic location is getting the most attention by far.\nPosting a gallery of MAGA accounts that are apparently based in Japan, New Zealand, Pakistan, and Thailand, left-wing influencer Micah Erfan wrote, “This is total armageddon for the online right.”\nMany of the accounts raising eyebrows, like the apparently Pakistan-based @American, are relatively small, though others have hundreds of thousands of followers.\nX’s director of product Nikita Bier said Saturday that the feature is being rolled out globally, describing this as “an important first step to securing the integrity of the global town square.” However, some users have complained that their listed location is wildly inaccurate. Bier acknowledged that the “data was not 100% for old accounts” and suggested that “a few rough edges … will be resolved by Tuesday.”\nThe Verge noted that while there are definitely rage-bait accounts and troll farms located outside the U.S., many of the listed locations seem highly questionable, with the confusion likely due to travel, global teams, VPNs, or old IP addresses.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X’s new About This Account feature is going great",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/11/twitter-impersonation-parody.jpg?w=150"
      ],
      "datePublished": "2025-11-23T21:11:05.000Z",
      "dateModified": "2025-11-23T21:11:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Momentic raises $15M to automate software testing",
    "url": "https://techcrunch.com/2025/11/24/momentic-raises-15m-to-automate-software-testing/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/20251119-DSC07129.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:00:27.000Z",
    "description": "\nProduct demos get all the attention, but software development more often involves things like debugging, quality assurance and testing. It’s the dull",
    "body": "\nProduct demos get all the attention, but software development more often involves things like debugging, quality assurance and testing. It’s the dull but critical work that keeps software running the way it should, and as developers look to automate more of their workloads, it’s increasingly being done by AI.\nOn Monday, the AI testing startup Momentic said it had raised $15 million in a Series A round led by Standard Capital, with participation from Dropbox Ventures. Existing investors at Y Combinator, FCVC, Transpose Platform and Karman Ventures also participated in the round. The new funding builds on a $3.7 million seed round, which the company announced in March.\nMomentic makes tools for software testing and verification, a niche currently occupied by open-source frameworks like Playwright and Selenium. Those tools offer complex, fine-grained controls, but Momentic is counting on AI to make the process simple and effective.\n“We help our customers make sure their product works,” co-founder Wei-Wei Wu said. “They can describe their critical user flows in plain English and our AI will automate it.”\nWu and his co-founder Jeff An both have backgrounds in developer tooling at companies like Qualtrics and WeWork. (Wu is particularly proud of his contributions to the open-source Node.js.) \nThe biggest constant for all those companies, as Wu saw it, was the problem of verifying code. “Testing has been the biggest pain point for every team I’ve ever worked with,” Wu told TechCrunch.\nMomentic’s AI-driven approach has already won over a number of clients. The company currently boasts 2,600 users across its customer base, which includes companies like Notion, Xero, Bilt, Webflow and Retool. Wu was coy about revenue and profitability figures, but says the product has shown enough growth to convince investors.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nNotably, automating tests makes them much easier to perform at scale, and has the potential to drive up the total volume to levels that would previously have been impossible. Wu estimates that, in the last month, the company automated more than 200 million test steps.\nThe company’s biggest competitor may be the foundation models themselves. Both OpenAI and Anthropic offer tutorials on agentic testing, building on their models’ growing computer use capabilities. As those models grow more sophisticated, the opportunity for enterprise SaaS companies like Momentic could narrow.\nFor now, Wu is focused on fleshing out his product with the new funding. The company launched support for mobile environments in August, and is hoping to build more sophisticated test-case management once it has a few more engineers on board. \nAs Wu sees it, the rise of automated coding will produce a lot of new apps — and a lot more demands for products like his. “All of these apps need testing,” he said. “They care about quality, and we’re going to provide it for them.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Momentic raises $15M to automate software testing",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/20251119-DSC07129.jpg?w=150"
      ],
      "datePublished": "2025-11-24T14:00:27.000Z",
      "dateModified": "2025-11-24T14:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US banks scramble to assess data theft after hackers breach financial tech firm",
    "url": "https://techcrunch.com/2025/11/24/us-banks-scramble-to-assess-data-theft-after-hackers-breach-financial-tech-firm/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-172674485.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:18:55.000Z",
    "description": "\nSeveral U.S. banking giants and mortgage lenders are reportedly scrambling to assess how much of their customers’ data was stolen during a cyberattac",
    "body": "\nSeveral U.S. banking giants and mortgage lenders are reportedly scrambling to assess how much of their customers’ data was stolen during a cyberattack on a New York financial technology company earlier this month.\nSitusAMC, which provides technology for over a thousand commercial and real estate financiers, confirmed in a statement over the weekend that it had identified a data breach on November 12.\nThe company said that unspecified hackers had stolen corporate data associated with its banking customers’ relationship with SitusAMC, as well as “accounting records and legal agreements” during the cyberattack. \nThe statement added that the scope and nature of the cyberattack “remains under investigation.” SitusAMC said that the incident is “now contained,” and that its systems are operational. The company said that no encrypting malware was used, suggesting that the hackers were focused on exfiltrating data from the company’s systems rather than causing destruction.\nAccording to Bloomberg and CNN, citing sources, SitusAMC sent data breach notifications to several financial giants, including JPMorgan Chase, Citigroup, and Morgan Stanley. SitusAMC also counts pension funds and state governments as customers, according to its website.\nIt’s unclear how much data was taken, or how many U.S. banking consumers may be affected by the breach. Companies like SitusAMC may not be widely known outside of the financial world, but provide the mechanisms and technologies for its banking and real estate customers to comply with state and federal rules and regulations. In its role as a middleman for financial clients, the company handles vast amounts of non-public banking information on behalf of its customers. \nAccording to SitusAMC’s website, the company processes billions of documents related to loans annually. \nWhen reached by TechCrunch, Citi spokesperson Patricia Tuma declined to comment on the breach. Tuma would not say if the bank has received any communications from the hackers, such as a demand for money.\nRepresentatives for JPMorgan Chase, and Morgan Stanley did not immediately respond to a request for comment Monday. SitusAMC chief executive Michael Franco also did not respond to our email when contacted for comment Monday.\nA spokesperson for the FBI told TechCrunch that the bureau is aware of the breach.\n“While we are working closely with affected organizations and our partners to understand the extent of potential impact, we have identified no operational impact to banking services,” said FBI director Kash Patel in a statement shared with TechCrunch. “We remain committed to identifying those responsible and safeguarding the security of our critical infrastructure.”\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US banks scramble to assess data theft after hackers breach financial tech firm",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-172674485.jpeg?w=150"
      ],
      "datePublished": "2025-11-24T14:18:55.000Z",
      "dateModified": "2025-11-24T14:18:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Revolut hits $75B valuation in new capital raise",
    "url": "https://techcrunch.com/2025/11/24/revolut-hits-75b-valuation-in-new-capital-raise/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/revolut.png?w=150",
    "tag": "Tech",
    "date": "2025-11-24T13:31:31.000Z",
    "description": "\nRevolut has raised new funding in a share sale that values it at $75 billion, positioning the British neobank as one of Europe’s most valuable privat",
    "body": "\nRevolut has raised new funding in a share sale that values it at $75 billion, positioning the British neobank as one of Europe’s most valuable private tech companies.\nThe company said on Monday the deal was led by Coatue, Greenoaks, Dragoneer and Fidelity. Investors including Nvidia’s NVentures, Andreessen Horowitz, Franklin Templeton, and other backers advised by T. Rowe Price Associates also participated.\nRevolut did not mention how much it raised in the share sale, but it did say it allowed employees to cash out in the deal. As of August 2025, the company had a post-money valuation of $48 billion, and has raised a total of $2.89 billion in venture capital, according to PitchBook.\nFounded in 2015, Revolut offers a range of services spanning multi-currency accounts, payment and transfer services, crypto products, insurance and more. The new funding comes as the neobank has been pouring truckloads of cash into expanding its operations internationally. \nBesides the U.K., where the company is awaiting a final nod to operate as a full-fledged bank, Revolut has a banking license in the European Union, and it operates in Australia, Japan, New Zealand, Singapore, Brazil, and the U.S. It launched operations in India in October, is about to start operating in Colombia in 2026, and has received a banking license in Mexico. \nIt also has plans to launch in Argentina, wants to enter Africa (first with South Africa), and has an in-principal payments license in the UAE.\nThe company’s been doing well financially, too: in 2024, its revenue rose 72% to $4 billion, and it claims it reached $1 billion in annualized revenue this year. Per its last annual report, Revolut reported net profit of $1 billion (£790 million) in 2024. The company also launched a crypto exchange, Revolut X, part of its Wealth division, which saw revenue rise 298% to $647 million in 2024 from just $158 million in 2023.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe company has grand ambitions, aiming to reach 100 million customers by mid-2027, and enter over 30 new markets by 2030.\n“This milestone reflects the remarkable progress we have made in the last twelve months towards our vision of building the first truly global bank, serving 100 million customers across 100 countries,” Nik Storonsky, CEO and co-founder of Revolut, said in a statement.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Revolut hits $75B valuation in new capital raise",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/revolut.png?w=150"
      ],
      "datePublished": "2025-11-24T13:31:31.000Z",
      "dateModified": "2025-11-24T13:31:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo gets regulatory approval to expand across Bay Area and Southern California",
    "url": "https://techcrunch.com/2025/11/22/waymo-gets-regulatory-approval-to-expand-across-bay-area-and-southern-california/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/SF_WAYMO-FREEWAY_FRONT.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-22T21:45:49.000Z",
    "description": "\nWaymo continues to expand its reach, with the robotaxi company posting Friday that it’s now “officially authorized to drive fully autonomously across",
    "body": "\nWaymo continues to expand its reach, with the robotaxi company posting Friday that it’s now “officially authorized to drive fully autonomously across more of the Golden State.”\nWaymo already operates in San Francisco, Silicon Valley, and Los Angeles (and outside California as well, in Atlanta, Austin, and Phoenix). But maps published by California’s Department of Motor Vehicles showed that the company can now test and deploy its autonomous vehicles across a much larger area in both the Bay Area and Southern California.\nIn the Bay Area, Waymo’s approved areas of operation now include most of the East Bay and North Bay (including Napa/Wine Country), as well as Sacramento. In Southern California, the company’s approved territory now stretches from Santa Clarita (north of Los Angeles) to San Diego.\n\nThe company will need additional regulatory approval before it can carry paying passengers in some of these regions, according to the San Francisco Chronicle.\nAlthough Waymo’s post doesn’t offer many details about when it plans to actually start offering rides in all these new areas, the company wrote, “Next stop: welcoming riders in San Diego in mid-2026!”\nThe company had previously announced its intention to launch in San Diego next year, along with Dallas, Denver, Detroit, Houston, Las Vegas, Miami, Nashville, Orlando, San Antonio, Seattle, and Washington, D.C.\nThere’s been plenty of Waymo expansion news in the past couple weeks, as the company announced that it will be entering Minneapolis, New Orleans, and Tampa; is removing safety drivers ahead of its commercial launch in Miami; and will start offering rides that use freeways in Los Angeles, San Francisco, and Phoenix.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWe discussed the growth of Waymo and other robotaxi companies on the latest episode of the Equity podcast. My co-host Sean O’Kane noted that as Waymo begins to provide more unfettered access across the Bay Area, people could be spending a lot more time in their robotaxis — so we might see them using the service in new, weird, or even dangerous ways.\n\n\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo gets regulatory approval to expand across Bay Area and Southern California",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/SF_WAYMO-FREEWAY_FRONT.jpg?w=150"
      ],
      "datePublished": "2025-11-22T21:45:49.000Z",
      "dateModified": "2025-11-22T21:45:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former MrBeast content strategist is building an AI tool for creator ideation and analytics",
    "url": "https://techcrunch.com/2025/11/24/former-mrbeast-content-strategist-is-building-an-ai-tool-for-creator-ideation-and-analytics/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Palo-Track.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T15:15:00.000Z",
    "description": "\nShort videos are in high demand. Across large platforms like Instagram, Facebook, YouTube, and TikTok, users are watching billions of videos every da",
    "body": "\nShort videos are in high demand. Across large platforms like Instagram, Facebook, YouTube, and TikTok, users are watching billions of videos every day, with companies benefitting massively from this content explosion. For creators, this often means there is pressure to create more content than ever before to be relevant and make a living out of it, especially as more AI-generated slop is infiltrating these platforms. \nJay Neo, a creator and former content lead for short videos at MrBeast, thinks AI can help creators understand what is working for them and also help them create new content ideas in that direction. That’s why, along with former Palantir engineer Shivam Kumar and creator Harry Jones, they are building a platform called Palo to aid creators.\nShivam Kumar and Jay Neo. Image Credits: Jack Willingham\nNeo joined MrBeast at 18 to work on viewer retention. In a conversation with TechCrunch, he said that he became fixated with studying different metrics to understand where video viewership dipped.\n“I was so obsessed with retention graphs and figuring out why viewers stayed or why they left. I had a document where I noted all this down. Gradually, my role shifted to getting more responsibility around editing and ideation,” Neo said.\nNeo’s crowning jewel was a video where the creator asks people on the street if they’d fly to Paris to get a baguette, which garnered more than 1.8 billion views across channels. MrBeast ended up making multiple videos with this format.\nIn 2023, Neo left MrBeast and started several channels under the “Creaky” branding with another MrBeast co-writer and scaled these to over a billion views per month.\nWith these experiences, Neo understood there’s power in content formulation and analytics. During his time building Creaky, the team had multiple spreadsheets tracking different metrics around videos. At that time, one of Neo’s advisors suggested that he turn these insights into a product for creators, and he started working with Palo’s other co-founders in early 2024.\nImage Credits: Palo\nPalo has three core parts to its app: an AI-powered ideation and planning tool, analytics, and community. The company onboards a creator and asks them to integrate all their accounts. The tool then analyzes all their short videos and provides insights into what is working and what is not.\nKumar, who is CTO at the startup, said that Palo uses a mix of models to extract a data tree that has insights into hooks, audience sentiment, interest topics, originality, and possible related search terms.\n“The inference engine, which takes these primary data-points and then uses a cocktail of top LLMs to hierarchically aggregate these data-points into cache for hot memory, embeddings which can later be semantically retrieved, and various other structured data formats,” Kumar said. “All of these together help us build a persona for the creator, which is true to them and fully aware of their taste and style.” \nThe AI planner has a conversational interface, like any other chatbot, and creators can ask general questions about their content. Plus, they can ask the tool to create a script based on a formula. If someone is a more visual creator with less speech in their clips, the tool can also create a storyboard with different hooks. \nRight now, the community part is nascent and allows creators to message each other.\nImage Credits: PaloImage Credits:Palo\nIn its test phase, the company worked with around 40 creators with more than 1 million users across channels. Today, the company is opening up its tool to creators with 100,000 followers with a starting price of $250 a month to use the tool, with costlier tiers available for higher usage rates. \nThe company has raised $3.8 million in funding from Peak XV’s (formerly Sequoia India) Surge, with participation from NFX and individual investors. \nPeak XV’s managing director, Rajan Anandan, said the firm was introduced to Palo’s team by one of Neo’s mentors. He said the team’s experience in being part of successful creative teams and technical understanding edged the firm towards investing in the startup. \n“Creators everywhere are looking for tools that make their process smoother without taking away their voice. Jay and the team had unusual clarity about where the real value lies and where it does not, which gave us strong conviction. AI is enabling a new category of identity-aware systems that learn deeply from the world’s best creators,” he told TechCrunch.\nJosh Constine, a former TechCrunch editor and investor in Palo, said that the tool can help creators keep up with heavy content demands. \n“I’ve experienced burnout as a creator myself, which is why I invested in Palo. The challenge today is that to keep up with the latest viral hooks and strategies to beat the algorithm, you have to spend hours per day getting brain-rotted, consuming content, which I think rewires your brain to default to consumption instead of making something new. That can lead to procrastination, writer’s block, and burnout,”  Constine said.\nPalo’s launch comes at a time when there is palpable tension between AI and the creator community. Platforms like TikTok, Meta, and Google have added more AI-powered tools for creators. While creators have started using AI tools, folks like MrBeast have spoken about the negative impact it could have on the industry.\nA core challenge in creating AI tools for creators is to have them fall into a formulaic habit of creating similar content. Neo said that Palo, the tool, tries to nudge creators in a direction where they might be successful and admitted that good videos will still come out of creators’ gut feelings.  \n“Here’s an analogy… when a comedian tries out some new material on the stage, they’re both consciously and subconsciously gathering data on whether the audience was amused or not. Each performance becomes an iteration, and each new audience benefits from what the comedian learned from the show before. We believe AI can give creators a similar advantage,” Neo said. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former MrBeast content strategist is building an AI tool for creator ideation and analytics",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Palo-Track.jpeg?w=150"
      ],
      "datePublished": "2025-11-24T15:15:00.000Z",
      "dateModified": "2025-11-24T15:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This startup wants to build a fusion reactor — on a boat",
    "url": "https://techcrunch.com/2025/11/24/this-startup-wants-to-build-a-fusion-reactor-on-a-boat/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1499124310.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:00:00.000Z",
    "description": "\nThere’s only one fusion device on earth that has been able to meet a key scientific threshold, but Martime Fusion CEO Justin Cohen is already prepari",
    "body": "\nThere’s only one fusion device on earth that has been able to meet a key scientific threshold, but Martime Fusion CEO Justin Cohen is already preparing to put a fusion reactor on a boat.\nStay with me — it’s not entirely far-fetched. Thanks to advances in AI, computing, and superconducting magnets, fusion power is closer than ever to commercial reality. It’s increasingly looking like fusion is more a question of “when” not “if.” And when it does happen, it promises to deliver large amounts of clean power from a plentiful fuel source — water.\nPutting a reactor on a ship isn’t necessarily unreasonable, either. Today, submarines and aircraft carriers powered by nuclear fission reactors routinely prowl the seas. They’re quiet, powerful, and can operate for decades before they need refueling. The civilian sector even toyed with the idea of nuclear-powered cargo ships back in the 1960s and 1970s.\n“Fission has definitely paved the way in terms of nuclear power on ships,” Cohen, who co-founded Maritime Fusion, told TechCrunch. \nFusion promises to give ships similar capabilities but without concerns over meltdowns, proliferation, or radiation. For now, the sector has been focused on building the first reactors on land. “I’m pretty sure we’re the first people to ever really look at what is it like to put a tokamak on a ship,” Cohen said, referring to a leading fusion reactor design.\nIf fusion does pan out, then Maritime’s leap to the seas would put it ahead of the curve. Plus, Cohen argues, it might actually be easier from a business perspective to start out at sea.\nThe first fusion power plants won’t be cheap, and it will take some time before they come down in cost. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Competing against things like solar and wind on the grid is super challenging from a cost perspective,” Cohen said.\nAt sea, the economics look different. Ammonia and hydrogen are two leading contenders to replace diesel and bunker fuel on cargo ships, but they’re still pretty pricey. \n“Those are some of the other really expensive fuels that might actually be the only other things that are as expensive as first-of-a-kind fusion,” Cohen said. “In those cases, we actually do compete, just straight up.”\nTo flesh out its concept and start building parts for its first reactor, Maritime Fusion has raised $4.5 million in a seed round led by Trucks VC with participation from Aera VC, Alumni Ventures, Paul Graham, Y Combinator, and several angel investors, the startup exclusively told TechCrunch. The company was part of Y Combinator’s winter 2025 batch.\nMaritime has begun assembling high-temperature superconducting (HTS) cables from tape it buys from suppliers, which are mostly Japanese companies, Cohen said. Those cables will ultimately form the basis of powerful magnets the tokamak will need to confine the plasma required for fusion reactions. They will also be sold to other companies to generate revenue as the Maritime develops its power plant, he said.\nMaritime Fusion’s superconducting cable undergoes testing at its workshop.Image Credits:Maritime Fusion\nThe startup expects its first power plant, named Yinsen, will generate around 30 megawatts of electricity. \nSome of the biggest engineering challenges, will be designing the support systems that harvest energy and keep the tokamak running, Cohen said. To simplify the onboard equipment, some of the ancillary tasks, like fuel processing, will be carried out on shore, he said.\nThe first Maritime tokamak will be about eight meters across, and the startup is projecting it will be operational in 2032 and will cost around $1.1 billion.\nFor comparison, Commonwealth Fusion Systems (CFS), largely considered to be the leader in fusion race, is building Sparc, a smaller tokamak at just under five meters across. The company has raised almost $3 billion to date, much of which has gone toward building the demonstration plant, which it expects to bring online next year. \nSparc won’t put power on the grid; instead, its goal is to prove that tokamaks can generate more power than they consume. CFS’s full-scale, grid-powering reactor, Arc, won’t be ready until the early 2030s. \nCFS has a considerable head start over many fusion startups, including newcomer Maritime. Yet Cohen is confident that won’t be an impediment. \n“We’re not going to spend billions on a breakeven-style device that doesn’t produce energy on the gird,” he said. “The first tokamak we build will be an energy-producing tokamak for a customer.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This startup wants to build a fusion reactor — on a boat",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1499124310.jpeg?w=150"
      ],
      "datePublished": "2025-11-24T14:00:00.000Z",
      "dateModified": "2025-11-24T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Byju’s founder to appeal U.S. court order to pay over $1B in bankruptcy case",
    "url": "https://techcrunch.com/2025/11/22/byjus-founder-to-appeal-u-s-court-order-to-pay-over-1b-in-bankruptcy-case/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/11/GettyImages-1257740205.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-22T16:17:32.000Z",
    "description": "\nByju Raveendran, the embattled founder of Indian ed-tech giant Byju’s, has blasted a U.S. bankruptcy court’s order directing him to pay more than $1.",
    "body": "\nByju Raveendran, the embattled founder of Indian ed-tech giant Byju’s, has blasted a U.S. bankruptcy court’s order directing him to pay more than $1.07 billion. He is denying wrongdoing, accusing lenders of misleading the court, and vowing to appeal a ruling that marks a dramatic fall for a onetime poster boy of India’s startup boom.\nThe Delaware bankruptcy judge issued a default judgment after finding that Raveendran had repeatedly ignored court orders and provided “evasive, incomplete” responses regarding about $533 million that Byju’s U.S. unit allegedly transferred in 2022 and never recovered. The judge also cited issues with a separate limited-partnership stake later valued at roughly $540.6 million. The ruling, dated November 20, stems from legal action by lenders seeking to claw back funds linked to the $1.2 billion term loan they extended to the ed-tech startup in 2021.\nEarlier this year, in April, a group of U.S. lenders led by GLAS Trust sued Raveendran and his wife, Byju’s co-founder Divya Gokulnath, in the Delaware bankruptcy court over the missing $533 million in loan proceeds. The couple denied wrongdoing at the time and accused lenders of attempting a hostile takeover of the company. They later said they planned to pursue a $2.5 billion lawsuit against GLAS Trust and others in India and other jurisdictions, though no such filing has publicly surfaced. This was in addition to the complaint Byju’s filed in the New York Supreme Court challenging the acceleration of the term loan in 2023.\nThe court’s latest order followed a September 29 hearing on the default request, where the judge cited a months-long pattern of noncompliance. The judge noted that Raveendran skipped hearings, missed extended deadlines, and ignored a prior contempt order imposing $10,000 in daily sanctions that remain unpaid.\nU.S. Bankruptcy Judge Brendan Shannon said the relief granted in the case was “extraordinary,” adding that “the circumstances of this case are, frankly, unique and unlike anything the undersigned has encountered before, thereby making such relief… richly warranted.” The judge has given the parties seven days to respond to the ruling.\n“We consider that the U.S. Court erred in its judgment of this matter and will be filing the necessary appeals and other contestations related to this judgment and related orders,” said J. Michael McNutt, senior litigation advisor at Lazareff Le Bars, representing Raveendran, in a prepared statement to TechCrunch. “The court, in our view, ignored relevant facts.”\nRaveendran’s legal counsel argued that the court issued the judgment without giving him an opportunity to present a defense and instead relied on an earlier contempt order. The counsel also argued that the ruling failed to acknowledge that GLAS Trust was aware the Alpha loan funds were not used for the personal benefit of Raveendran or other founders but rather for Think & Learn, the startup’s parent company, the counsel said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe counsel said Byju’s founders are preparing claims against GLAS Trust and others in multiple jurisdictions, expected to seek at least $2.5 billion in damages and, absent a settlement, to be filed before the end of 2025.\nNonetheless, the default judgment marks a stunning fall for Raveendran and his eponymous company, once India’s most valuable startup with a $22 billion valuation and backed by global investors including Tiger Global, the Chan Zuckerberg Initiative, and Prosus. The company is now mired in lawsuits, funding droughts, mass layoffs, and a battle for control as lenders and creditors race to recover what they can.\nRaveendran previously challenged the Delaware court’s jurisdiction, but the judge rejected that argument in an earlier ruling, writing that “Raveendran’s conduct that gives rise to the litigation here relates to his activities … in the United States fundraising and serving as a director, officer, or manager of a United States corporation.”\nEarlier this week, a filing in the Delaware bankruptcy case alleged that most of the $533 million missing from Byju’s U.S. unit, Alpha, was “round-tripped back to Byju Raveendran and associates.” In a response, Raveendran denied the allegation, saying the funds were not used for personal gain.\nMeanwhile in India, Byju’s is undergoing a court-supervised sale process after insolvency proceedings began last year, with early bidders including Manipal Education and Medical Group (MEMG) and Ronnie Screwvala’s UpGrad.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Byju’s founder to appeal U.S. court order to pay over $1B in bankruptcy case",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/11/GettyImages-1257740205.jpg?w=150"
      ],
      "datePublished": "2025-11-22T16:17:32.000Z",
      "dateModified": "2025-11-22T16:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Facebook takes on Reddit with launch of nicknames for Facebook Groups",
    "url": "https://techcrunch.com/2025/11/24/facebook-takes-on-reddit-with-launch-of-nicknames-for-facebook-groups/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1201955892.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T15:46:16.000Z",
    "description": "\nFacebook Groups are getting more Reddit-like with newly added support for nicknames. The feature, which allows users to post under a custom username ",
    "body": "\nFacebook Groups are getting more Reddit-like with newly added support for nicknames. The feature, which allows users to post under a custom username instead of their real name, provides an alternative to posting anonymously. With anonymous posting, users can share without the post being connected to their Facebook profile and real-life identity, but this approach also doesn’t allow other group members to get to know them or their personality, or to follow their updates over time.\nImage Credits:Facebook\nMeta says that nicknames will allow people to participate in groups more personally while maintaining privacy, particularly in groups where users want privacy but still want to build a recognizable presence. It also could make Facebook Groups function more like other internet forums and message boards — like Reddit or Discord, for instance — where people post under usernames. This marks a deviation from Facebook’s long-standing “real name” policy, which has insisted that people show up on the platform with the name they use in everyday life.\nThat policy worked when Facebook was largely a social network built on top of real-world relationships with family and friends, but the addition of Facebook Groups expanded users’ circles of interactions to include online strangers, which necessitated more privacy protections.\nImage Credits:Facebook\nAfter users in a group customize set their nickname, they can then post, comment, and react under that nickname within groups that support the feature. This allows users to hide their main profile and profile photo from other members but not from group admins, moderators, or Facebook’s own systems.\nHowever, others in the group will be able to view a user’s complete post history under their nickname in that group, as well as the comments and reactions made in the group over the last seven days.\nFacebook will suggest nicknames to users, but users can change this nickname to one of their choosing. The name has to comply with Facebook’s Community Standards and can’t already be used by another group member. The company will also suggest a profile picture for the nickname, though users can pick their own from those available, along with selecting a colored background.\n\nTo access the feature, users will find the option next to “Post anonymously” when creating a post and then choose the option to customize a nickname. The option to use the nickname can be turned off at any time, allowing users to post under their real name again.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhile users can change their nickname, they can only do so once every two days. Additionally, changing a nickname doesn’t allow users to distance themselves from past posts and comments. Instead, when changed, their new nickname will be applied to their past posts, comments, and reactions, though this may take time to appear across devices and groups. If users have different nicknames in different groups, the name change will only impact the posts, comments, and reactions in the group tied to that specific nickname.\n\nThe company says users with nicknames can’t use some features like Live Video, content sharing, or private messaging. Users can block others by nickname, as well.\nThe feature is available globally but requires group admin approval to enable in each group.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Facebook takes on Reddit with launch of nicknames for Facebook Groups",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1201955892.jpeg?w=150"
      ],
      "datePublished": "2025-11-24T15:46:16.000Z",
      "dateModified": "2025-11-24T15:46:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why now is the best time to invest in climate tech",
    "url": "https://techcrunch.com/2025/11/22/why-now-is-the-best-time-to-invest-in-climate-tech/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/06/GettyImages-1328659820.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-22T16:00:00.000Z",
    "description": "\nConventional wisdom suggests that climate tech is entering a winter season, where political and investor interest and investment levels are cooling —",
    "body": "\nConventional wisdom suggests that climate tech is entering a winter season, where political and investor interest and investment levels are cooling — an ironic contrast with the climate itself, which keeps delivering years of record warmth. \nA new report from the International Energy Agency suggests there has never been a better time to go all-in on climate tech. In comparing it with the IEA’s stance from a decade ago, it’s clear the world’s expectations about the future have changed dramatically in less than a generation. \nIn 2014, the International Energy Agency assumed that, absent any international effort to rein in carbon pollution, emissions would continue to go up and to the right. Even the most optimistic forecast at the time predicted a linear increase, just with a lower slope. Those scenarios essentially took the trend line from the previous few years and extended it through 2050.\nFast forward to today, and the IEA’s current worst-case scenario is essentially 2014’s best case. A decade ago, without any major changes, the world was headed toward 46 metric gigatons of CO2 per year by 2040. If countries cut emissions as they had pledged, the best we could have hoped for was 38 metric gigatons per year by 2040.\nForecasts from the IEA have shifted significantly in the last decade.Image Credits:International Energy Agency/TechCrunch under a CC BY 4.0 (opens in a new window) license.\nToday, if countries continue with business as usual, the IEA expects emissions will level off at 38 metric gigatons per year. If countries follow through on their pledges, the IEA suggests we’ll hit about 33 metric gigatons per year by 2040. It’s still far off from what’s needed to hit net zero by 2050, but it’s a significant shift in a short amount of time.\nIf the IEA’s earlier projections turned out to be overly pessimistic compared with where we are today, what does that say about today’s projections?\nHow you answer that question depends on how you interpret trend lines. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhen forecasting the future, do you analyze today’s data? Or do you look at that data in conjunction with how our expectations about the future have changed over time? (An even nerdier way to look at it is, do you view the world through a lens of algebra or calculus?)\nPut another way, will the world hit net zero in 2050? Today’s trend lines suggest we’ll miss that target by a wide margin. But if you look at how expectations have changed over the last decade, you might come up with a different answer. Instead, you might think the rate of change has increased, that we might be in the middle of an inflection point that starts to bend global emissions downward.\nThere are a few recent anecdotes to support the idea that we’re at an inflection point. \nIn Germany, sales of electric vehicles have set new records even after the government repealed incentives in 2023. In developing countries, renewables are reshaping the economies of developing countries, which were long thought to be among the last to adopt clean power. And China, which had previously refused to commit to reducing its carbon emissions, has now said its emissions will peak before 2030. \nHow the world views the future of carbon emissions has changed significantly over the past decade. A range of technologies have made that happen, including cheap solar and wind power paired with inexpensive batteries. \nIn the near future, geothermal energy and grid-optimizing software could propel the next leaps in optimism. For investors who agree, the upside could be dramatic.\nFor many climate tech investors, these days probably feel pretty gloomy. But amidst the gloom, there are still bright patches to be found.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why now is the best time to invest in climate tech",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/06/GettyImages-1328659820.jpg?w=150"
      ],
      "datePublished": "2025-11-22T16:00:00.000Z",
      "dateModified": "2025-11-22T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]