[
  {
    "title": "Trump credits Benioff, Huang for decision not to ‘surge’ Fed troops into San Francisco",
    "url": "https://techcrunch.com/2025/10/23/trump-credits-benioff-huang-for-decision-not-to-surge-fed-troops-into-san-francisco/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/12/GettyImages-962267138.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-23T21:04:00.000Z",
    "description": "\nIn Brief\nPosted:\n2:04 PM PDT · October 23, 2025\n\nImage Credits:Digital First Media/The Mercury News via Getty Images / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n2:04 PM PDT · October 23, 2025\n\nImage Credits:Digital First Media/The Mercury News via Getty Images / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nPresident Trump had planned an operation to “surge” San Francisco by marching National Guard troops into the city, but was convinced to alter course, he said on a post on his social network Truth Social on Thursday. Nvidia’s Jensen Huang and Salesforce CEO Marc Benioff were among the tech industry’s luminaries who called him and convinced him to change his mind, the post said. \nSan Francisco mayor Daniel Lurie confirmed in a statement that the military operation had been planned and called off, although he didn’t name names as to who had conversations with the President.\nBenioff’s involvement is particularly notable. Earlier this month — shortly before Salesforce held its enormous tech conference in San Francisco, where it is headquartered – Benioff (who was born and raised there) said he supported Trump. He also said he thought National Guard troops should be sent to patrol its streets. That comment caused VC legend Ron Conway to resign his decade-long board seat on Salesforce’s philanthropic foundation and condemn both the comments and his friend, Benioff.\nBenioff promptly apologized and walked back his wish for National Guard patrols. “… after the largest and safest Dreamforce in our history, I do not believe the National Guard is needed to address safety in San Francisco,” Benioff said in a post on X earlier this month. So, it appears the CEO doubled down and actually pleaded the case to the White House, too.\nMayor Lurie will be speaking at TechCrunch Disrupt in San Francisco next week. Perhaps we’ll hear more about how the city, ground zero of the AI industry, has improved safety and rallied to de-escalate the situation.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Government & Policy\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump credits Benioff, Huang for decision not to ‘surge’ Fed troops into San Francisco",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2018/12/GettyImages-962267138.jpg?w=150"
      ],
      "datePublished": "2025-10-23T21:04:00.000Z",
      "dateModified": "2025-10-23T21:04:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The browser wars are back, and this time they’re powered by AI",
    "url": "https://techcrunch.com/video/the-browser-wars-are-back-and-this-time-theyre-powered-by-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/02/tc-backlight-e1689786273147.png?w=1200",
    "tag": "Tech",
    "date": "2025-10-24T19:00:00.000Z",
    "description": "\n\t\t\n\n\n\nThe browser wars are heating up again, this time with AI in the driver’s seat. \nOpenAI just launched Atlas, a ChatGPT-powered browser that lets",
    "body": "\n\t\t\n\n\n\nThe browser wars are heating up again, this time with AI in the driver’s seat. \nOpenAI just launched Atlas, a ChatGPT-powered browser that lets users surf the web using natural language and even includes an “agent mode” that can complete tasks autonomously. It’s one of the biggest browser launches in recent memory, but it’s debuting with an unsolved security flaw that could expose passwords, emails, and sensitive data. \nWatch as Max Zeff, Anthony Ha and Sean O’Kane break down Atlas’s debut, the broader wave of alternative browsers, the AWS crash that broke much of the internet, and more of the week’s startup and tech news on TechCrunch’s Equity podcast.\nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.\n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The browser wars are back, and this time they’re powered by AI",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2018/02/tc-backlight-e1689786273147.png?w=1200"
      ],
      "datePublished": "2025-10-24T19:00:00.000Z",
      "dateModified": "2025-10-24T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram’s latest feature lets you go back to see your watched Reels",
    "url": "https://techcrunch.com/2025/10/24/instagrams-latest-feature-lets-you-go-back-see-your-watched-reels/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/1920x1280.png?w=150",
    "tag": "Tech",
    "date": "2025-10-24T16:38:02.000Z",
    "description": "\n\t\n\t\tImage Credits:Instagram\t\n\t\n\t\t\t\t\t\t9:38 AM PDT · October 24, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nInstagram announced on Friday that it will now let you go back an",
    "body": "\n\t\n\t\tImage Credits:Instagram\t\n\t\n\t\t\t\t\t\t9:38 AM PDT · October 24, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nInstagram announced on Friday that it will now let you go back and see your previously watched Reels thanks to a new “Watch History” feature. Rival TikTok has had a Watch History feature for a few years now.\nWith the new feature, you can go back and find videos you might not have had the chance to save. For example, you could be watching an interesting Reel and then receive a phone call, or accidentally close the app while watching, or get distracted by something else and lose your place in the Reels feed.\n“Have you ever tried to get back to a reel that you’d seen on Instagram and you just can’t find it?,” Instagram head Adam Mosseri said in an announcement. “Well, there is a new feature that should help. If you go to ‘Profile’ and under ‘Settings,’ under ‘Your ‘Activity,’ there’s Watch History now, so you can see every reel that you’ve ever watched.”\nJust like on TikTok, you can sort your Watch History by date, the past week or month, or a specific date range. Plus, you can remove Reels from your watch history if you’d like to. \nInstagram’s Watch History offers a bit more flexibility when compared to TikTok’s, as you can sort videos in chronological or reverse chronological order, or by author. \nInstagram says the feature was highly requested among users. Before this, users had found workarounds to recover lost videos, such as downloading their data from the app and sifting through it to retrieve their watch history. The feature makes the process of finding lost videos a lot simpler and gets rid of the need for these sorts of workarounds. Plus, it brings the Instagram Reels viewing experience on par with TikTok’s.\nSince its launch as a TikTok clone, Meta has been building out Instagram Reels with features that are already available on the popular short-form app. Most recently, Instagram started allowing creators to connect multiple reels in a series and launched support for Picture-in-Picture viewing, both of which are already available on TikTok. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram’s latest feature lets you go back to see your watched Reels",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/1920x1280.png?w=150"
      ],
      "datePublished": "2025-10-24T16:38:02.000Z",
      "dateModified": "2025-10-24T16:38:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Big Tech is paying for Trump’s White House ballroom",
    "url": "https://techcrunch.com/2025/10/23/big-tech-is-paying-for-trumps-white-house-ballroom/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T02:54:46.000Z",
    "description": "\nWhile the U.S. government remains in limbo during a shutdown, the White House grounds have been busy this week. Construction workers have begun demol",
    "body": "\nWhile the U.S. government remains in limbo during a shutdown, the White House grounds have been busy this week. Construction workers have begun demolition on the White House’s East Wing, which will be replaced by a 90,000-square-foot ballroom that’s estimated to hold up to 1,000 guests.\nTaxpayers are not funding President Donald Trump’s $250 million project. Rather, he is using private donations to construct his lavish addition to the White House.\nThe White House released a list of the project’s funders on Thursday, which include some of the most influential American tech companies, like Amazon, Apple, Google, Meta, and Microsoft, as well as defense companies like Palantir and Lockheed Martin and telecom providers like Comcast and T-Mobile. The crypto industry is also represented among the White House ballroom donors, with money coming from Coinbase, Ripple, Tether America, and the Winklevoss twins.\nIt is not clear how much each donor has contributed to the project. However, at least $20 million from Google is part of a recent lawsuit settlement over YouTube’s suspension of Trump’s account after the January 6, 2021, riots. TechCrunch asked Google if the money from the settlement represents the full extent of the company’s contributions, but has not yet received an answer.\nSilicon Valley’s relationship with Trump has changed markedly. While much of the tech industry initially resisted Trump when he became president for the first time in 2016, it has cozied up to Trump during his second term. Meta, for instance, did not donate to Trump’s first inauguration fund, but contributed $1 million to the president’s second inauguration; Amazon donated $58,000 the first time, but made a heftier $1 million donation this time around.\nThese donations reflect a greater alignment between Trump and the tech industry.\nThe industry could be more willing to cooperate with Trump’s current administration because many of these major tech companies are facing antitrust litigation. The Trump administration has been much less aggressive in its antitrust enforcement than former President Joe Biden’s FTC was under former FTC Chair Lina Khan.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nTrump has also taken a more aggressive approach to AI development than his predecessor, which is a financial boon for the companies building out that technology. In his AI action plan, which was unveiled in July, Trump and his administration outlined a goal to cut red tape and use government funds to support the construction of data centers.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Big Tech is paying for Trump’s White House ballroom",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2227934246.jpg?w=150"
      ],
      "datePublished": "2025-10-24T02:54:46.000Z",
      "dateModified": "2025-10-24T02:54:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Automattic files counterclaims against WP Engine in WordPress lawsuit, alleging trademark misuse",
    "url": "https://techcrunch.com/2025/10/24/automattic-files-counterclaims-against-wp-engine-in-wordpress-lawsuit-alleging-trademark-misuse/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T14:57:06.000Z",
    "description": "\nOn Friday, WordPress.com maker Automattic filed its counterclaims in the lawsuit initiated by hosting company WP Engine in October 2024, which had ac",
    "body": "\nOn Friday, WordPress.com maker Automattic filed its counterclaims in the lawsuit initiated by hosting company WP Engine in October 2024, which had accused Automattic and its CEO, Matt Mullenweg, of defamation and abuse of power. Automattic believes that WP Engine has been abusing the WordPress trademark and has engaged in deceptive marketing practices, without properly giving back to the open source community.\nAs a result, Automattic took action against WP Engine last year, which included calling the hosting provider a “cancer to WordPress” and sending it a cease-and-desist letter claiming WP Engine had breached its trademark usage rules. As the battle continued, Automattic banned WP Engine from accessing WordPress.org resources and attempted to negotiate a licensing deal with the host. Automattic claims that the company strung it along, negotiating in bad faith.\nWP Engine eventually sued Automattic, portraying itself as the victim of Mullenweg’s attacks. But in Automattic’s telling of events, after the private equity firm Silver Lake invested $250 million in WP Engine, it shifted from fair use to trademark infringement by calling itself “The WordPress Technology Company” and letting its partners refer to it as “WordPress Engine.”\nAutomattic notes that the hosting company also launched products with names like “Core WordPress” and “Headless WordPress,” and claimed to its customers that it had committed 5% of its resources to support the WordPress ecosystem. Automattic says it never kept those promises. Automattic alleges that the trademark infringement was deliberate, saying WP Engine only “pretended to engage in licensing discussions, but actually delayed and negotiated in bad faith.”\nSilver Lake plays a central role in the counterclaims, which imply that the interests of the private equity firm guided much of WP Engine’s behavior. In particular, the counterclaims allege that WP Engine engaged in trademark violations because paying licensing fees would impact the company’s earnings and valuation, and therefore, Silver Lake’s expected return.\nThe counterclaims also allege that Silver Lake was seeking to offload WP Engine at a $2 billion valuation, but couldn’t find a buyer. Notably, the filing says that this included “overtures to Automattic.”\nAutomattic also claims that WP Engine degraded the consumer experience and product quality in an attempt to cut costs during this time by removing essential features. \nWP Engine responded to the counterclaims with the following statement: \n“WP Engine’s use of the WordPress trademark to refer to the open-source software is consistent with longstanding industry practice and fair use under settled trademark law, and we will defend against these baseless claims.”\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Automattic files counterclaims against WP Engine in WordPress lawsuit, alleging trademark misuse",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v2.jpg?w=150"
      ],
      "datePublished": "2025-10-24T14:57:06.000Z",
      "dateModified": "2025-10-24T14:57:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rivian CEO takes top marketing role in shakeup ahead of R2 launch",
    "url": "https://techcrunch.com/2025/10/23/rivian-ceo-takes-top-marketing-role-in-shakeup-ahead-of-r2-launch/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/TechCrunch-Disrupt-Haje-Kamps-524.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-23T20:29:59.000Z",
    "description": "\n\t\n\t\tImage Credits:Haje Kamps / TechCrunch\t\n\t\n\t\t\t\t\t\t1:29 PM PDT · October 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nRivian’s founder and CEO RJ Scaringe is taking on a",
    "body": "\n\t\n\t\tImage Credits:Haje Kamps / TechCrunch\t\n\t\n\t\t\t\t\t\t1:29 PM PDT · October 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nRivian’s founder and CEO RJ Scaringe is taking on a new role at his company as part of a restructuring ahead of next year’s launch of the R2 SUV, which involves a layoff of more than 600 employees.  \nScaringe told employees in an email on Thursday that he will be acting as Rivian’s chief marketing officer on an interim basis as the company searches for someone to fill that position for the first time. The head of Rivian’s “marketing experiences” team and the lead of the company’s creative studio will now report directly to Scaringe, according to a copy of the email obtained by TechCrunch.\nIt’s not clear how many direct reports Scaringe already has — a spokesperson declined to comment — though he told the Decoder podcast last year that it was a “large number.”\nThe cuts announced Thursday are Rivian’s third set of layoffs this year. The company let go of around 140 employees on its manufacturing team in June, as TechCrunch first reported at the time. Rivian made a similarly-sized cut to its sales and service operation in September. These layoffs follow a more dramatic 10% reduction of Rivian’s workforce in early 2024.\n“I am writing to share a difficult update,” Scaringe said in Thursday’s email to Rivian employees. “With the launch of R2 in front of us and the need to profitably scale our business, we have made the very difficult decision to make a number of structural adjustments to our teams. These changes result in a reduction in the size of our team by roughly 4.5%.”\nScaringe said the “changing operating backdrop” — a nod to the loss of the federal EV tax credit, increased tariffs from the Trump administration, and general headwinds against clean energy projects in the U.S. — forced the company to “rethink how we are scaling our go-to-market functions.”\nIn addition to Scaringe taking point on Rivian’s marketing and creative divisions, the company is also “streamlining” the customer experience, according to the email. Scaringe said Rivian is moving its “vehicle operations” team and integrating it with the company’s service division. Meanwhile, Rivian’s delivery and “mobile operations” will now live inside the sales division. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThese structural changes are being made to “ensure the purchase experience is as seamless as possible with a single touchpoint throughout the entire sales process and to delivery,” he wrote. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rivian CEO takes top marketing role in shakeup ahead of R2 launch",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/10/TechCrunch-Disrupt-Haje-Kamps-524.jpg?w=150"
      ],
      "datePublished": "2025-10-23T20:29:59.000Z",
      "dateModified": "2025-10-23T20:29:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arbor’s ‘vegetarian rocket engine’ power plant is actually an omnivore",
    "url": "https://techcrunch.com/2025/10/24/arbors-vegetarian-rocket-engine-power-plant-is-actually-an-omnivore/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/arbor-atlas-pilot-power-plant.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T16:10:12.000Z",
    "description": "\nTwo years ago, former SpaceX engineers used rocket tech to develop a power plant capable of removing carbon dioxide from the atmosphere, with a small",
    "body": "\nTwo years ago, former SpaceX engineers used rocket tech to develop a power plant capable of removing carbon dioxide from the atmosphere, with a small asterisk. To draw down CO2, it burned plant waste, making it a sort of “vegetarian rocket engine” for the grid.\nThis week, Arbor Energy said it had raised a $55 million Series A led by Lowercarbon Capital and Voyager Ventures on the heels of a partial pivot. Its power plant, rather than sticking to a strict vegetarian diet, is going to be more of an omnivore, capable of burning natural gas in addition to biomass. \nThe shift happened this year as electricity demand from data centers has boomed. The existing design was fully capable of powering AI servers, but its reach would be limited by sources of wood and agricultural waste. Natural gas is more widely available.\nArbor still plans to capture CO2 from the power plant, which uses oxy-combustion, which transforms hydrocarbons into syngas and then burns it in the presence of pure oxygen. The result is CO2 that doesn’t need much preparation for sequestration.\nBecause of tax credits, storing the CO2 will be cheaper than dumping the pollutant into the atmosphere, Arbor spokesperson Patrick Mahoney told TechCrunch. The company does not plan to sell its technology to businesses that don’t plan on capturing the carbon for use or sequestration, he said.\nBut waste CO2 isn’t the only climate consideration when it comes to burning natural gas. The main component of natural gas is methane, which is a potent greenhouse gas that generates 84 times more warming than carbon dioxide over 20 years. \nBecause of that, any leaks in the natural gas supply chain can have an outsized effect on the climate impact of a natural gas-fired power plant. Leakage rates as low as 0.2% mean the carbon footprint of a gas-fired power plant could be the same as a coal plant, according to recent research. The U.S. government has estimated leakage rates throughout the oil and gas supply chain to be around 1%, while satellite measurements show rates of about 1.6% across the U.S.\nArbor said it is working with natural gas providers that are certified to have low leakage rates, with a goal of getting the climate impact of one kilowatt of electricity it generates below 100 grams (about a quarter of a pound). \nThe startup confirmed that it is still in the process of building a power plant in Louisiana that will burn biomass. That plant is being funded in part by a $41 million deal with Frontier, the advanced market commitment backed by Stripe, Google, and others. Under that agreement, Arbor must remove 116,000 tons of carbon dioxide by 2030.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arbor’s ‘vegetarian rocket engine’ power plant is actually an omnivore",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/arbor-atlas-pilot-power-plant.jpeg?w=150"
      ],
      "datePublished": "2025-10-24T16:10:12.000Z",
      "dateModified": "2025-10-24T16:10:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rivian will pay $250M to settle lawsuit over R1 price hike",
    "url": "https://techcrunch.com/2025/10/24/rivian-will-pay-250m-to-settle-lawsuit-over-r1-price-hike/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/09/IMG_2290.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T14:43:01.000Z",
    "description": "\nRivian has agreed to pay $250 million to settle a class-action shareholder lawsuit filed after the company suddenly hiked prices on its R1 pickup tru",
    "body": "\nRivian has agreed to pay $250 million to settle a class-action shareholder lawsuit filed after the company suddenly hiked prices on its R1 pickup truck and SUV in 2022.\nThe lawsuit alleged Rivian had included misleading statements and figures in regulatory filings in the run-up to its 2021 IPO about the costs required to build the R1 EVs. Despite agreeing to the payment, Rivian said in a press release that it “denies the allegations in the suit and maintains that this agreement to settle is not an admission of fault or wrongdoing.”\nThe payment still has to be approved by a judge in the U.S. District Court for the Central District of California. If that happens, Rivian plans to pay $67 million of the total settlement through its directors’ and officers’ liability insurance, and the remaining $183 million out of its cash reserves. The company had $4.8 billion in cash (and equivalents) as of June 30.\nThe settlement comes at a pivotal time for Rivian. The company is deep in preparations to launch its second-generation EV, the R2 SUV, in 2026. That vehicle is much cheaper than the R1 lineup — and Rivian plans to make far more of them. The company says it can build as many as 150,000 per year at its factory in Illinois, and it’s also building a new factory in Georgia that will produce the R2 and future vehicles.\nAt the same time, R1 sales have been lagging. The company expects to finish 2025 having shipped far fewer EVs than it did in 2024 or 2023. A combination of President Trump’s tariffs and the loss of the federal EV tax credit has further complicated the market for Rivian’s vehicles.\nTo that end, this week the company laid off more than 600 employees in a restructuring that also saw CEO RJ Scaringe take over as interim chief marketing officer.\nRivian delivered the first R1 pickup trucks in late 2021. In March 2022, the company decided to hike the price of the truck and the SUV by nearly 20%, citing supply chain shortages, inflation, and plans to introduce cheaper models. (Rivian began R1S SUV deliveries in August 2022.) The company applied the price hike to both new orders and to those who had placed pre-orders and were on a waitlist. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nCustomers and fans of the company were irate, and Rivian quickly reversed the decision for customers with preorders. Crucially, the price hike announcement also sank Rivian’s stock price, causing losses for shareholders.\n“It was wrong and we broke your trust in Rivian,” Scaringe wrote in a letter at the time. “I have made a lot of mistakes since starting Rivian more than 12 years ago, but this one has been the most painful.”\nRivian shareholder Charles Larry Crews sued the company just a few days later, claiming, among other things, that the company had misrepresented the true cost of building the R1 vehicles in its IPO documentation. Those misrepresentations, he argued, led to the price hike announcement’s negative impact on the stock price. The lawsuit was granted class action status in July 2024.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rivian will pay $250M to settle lawsuit over R1 price hike",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/09/IMG_2290.jpeg?w=150"
      ],
      "datePublished": "2025-10-24T14:43:01.000Z",
      "dateModified": "2025-10-24T14:43:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EC finds Meta and TikTok breached transparency rules under DSA",
    "url": "https://techcrunch.com/2025/10/24/ec-finds-meta-and-tiktok-breached-transparency-rules-under-dsa/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1456318955.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T15:58:45.000Z",
    "description": "\nAn investigation by EU regulators has found TikTok and Meta in breach of the Union’s rules concerning illegal or harmful online content.\nThe European",
    "body": "\nAn investigation by EU regulators has found TikTok and Meta in breach of the Union’s rules concerning illegal or harmful online content.\nThe European Commission (EC) said on Friday that preliminary findings show both companies are not complying with Digital Services Act (DSA) rules that require them to give researchers adequate access to public data.\nThe Commission called Meta and TikTok’s procedures and tools for requesting access to public data “burdensome,” saying that researchers are consequently often left with partial or unreliable data, which affects “their ability to conduct research, such as whether users, including minors, are exposed to illegal or harmful content.”\nThe Commission also said Meta’s platforms — Instagram and Facebook — were both in breach of obligations to provide EU residents with simple ways to report illegal content. The Commission said both platforms impose several unnecessary steps before users can report content, and accused Facebook and Instagram of using so-called “dark patterns” — design tricks that manipulate users into taking certain actions.\n“Such practices can be confusing and dissuading. Meta’s mechanisms to flag and remove illegal content may therefore be ineffective,” the Commission wrote in a statement.\nThe EC also said both Meta platforms’ moderation appeal mechanisms don’t allow EU residents to fully explain or provide evidence to support their appeals. “This makes it difficult for users in the EU to further explain why they disagree with Meta’s content decision, limiting the effectiveness of the appeals mechanism,” the Commission wrote.\nTikTok says it has made “substantial investments” in data sharing and has given access to data to nearly 1,000 research teams via its research tools. “We are reviewing the European Commission’s findings, but requirements to ease data safeguards place the DSA and GDPR in direct tension. If it is not possible to fully comply with both, we urge regulators to provide clarity on how these obligations should be reconciled,” a TikTok spokesperson said in an emailed statement.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nMeanwhile, Meta claimed it has made changes to its tools and processes to comply with DSA requirements. “We disagree with any suggestion that we have breached the DSA, and we continue to negotiate with the European Commission on these matters. In the European Union, we have introduced changes to our content reporting options, appeals process, and data access tools since the DSA came into force and are confident that these solutions match what is required under the law in the EU,” a Meta spokesperson said.\nThe findings are part of investigations launched into both companies early in 2024. The EC had started looking into TikTok with a focus on advertising transparency, data access for researchers, content moderation, and protection of minors, as well as other concerns. The investigation into Meta was launched after the Commission said it suspected Facebook and Instagram of breaking rules for larger platforms concerning election integrity.\nThe DSA is the EU’s set of rules governing online platforms and content moderation, which broadly addresses concerns over rising risks for consumer welfare in the digital realm. The law imposes a set of extra requirements on big platforms like TikTok and Meta in areas like algorithmic transparency and systemic risk.\nPenalties for confirmed breaches of the DSA can reach up to 6% of global annual revenue.\nThe EC said Meta and TikTok both will be able to review its investigation documents, challenge the findings, and commit to address them.\nNote: This story was updated to add comments from TikTok and Meta.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EC finds Meta and TikTok breached transparency rules under DSA",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1456318955.jpg?w=150"
      ],
      "datePublished": "2025-10-24T15:58:45.000Z",
      "dateModified": "2025-10-24T15:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI buys Sky, an AI interface for Mac",
    "url": "https://techcrunch.com/2025/10/23/openai-buys-sky-an-ai-interface-for-mac/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/ArtCard_SKY_16_9.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-23T20:53:02.000Z",
    "description": "\nOpenAI announced on Thursday it has acquired Software Applications, Inc., the makers of an AI-powered natural language interface for Mac computers ca",
    "body": "\nOpenAI announced on Thursday it has acquired Software Applications, Inc., the makers of an AI-powered natural language interface for Mac computers called Sky. \nThe software product, which had not been released to the public, is designed to work alongside you throughout your day, as you use apps on the computer, writing, planning, coding, and more. Similar to AI browsers, Sky can see what’s on the your screen and take action in your apps for you.\nThe move is a significant step toward embedding OpenAI’s technology into consumers’ everyday lives and within businesses that run on Mac. \n“We’ve always wanted computers to be more empowering, customizable, and intuitive. With LLMs, we can finally put the pieces together. That’s why we built Sky, an AI experience that floats over your desktop to help you think and create. We’re thrilled to join OpenAI to bring that vision to hundreds of millions of people,” Software Applications co-founder and CEO Ari Weinstein said in a statement.\nNotably, the team behind Sky had another prominent exit before this. \nWeinstein and Conrad Kramer previously co-founded Workflow, which they sold to Apple, where it became the technology now known as Shortcuts. Both continued to work at Apple for several years before leaving to found Software Applications in August 2023. Sky’s third co-founder and COO, Kim Beverett, was a senior program and product manager at Apple, where she spent nearly 10 years working on technology like Safari, WebKit, Privacy, Messages, Mail, Phone, FaceTime, and SharePlay.\nApple, which has so far been behind on AI, is expected to launch an overhauled Siri with AI smarts next year. Apple has already shipped other features that use its AI tech known as Apple Intelligence, including writing helpers, live translation, image creation, visual search, and more. It’s also working with OpenAI to shuffle off queries Siri can’t answer to ChatGPT. Apple Intelligence works across platforms, including Mac.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn addition, Apple offers a Foundation Models framework that provides access to local AI models, allowing developers to build AI into their apps directly. \nHowever, Apple values privacy as a core part of its AI offering, and an agentic system that views your screen and takes action on your behalf could raise concerns for some of its more security-minded customers. Agentic AI is still in its early days, and recent reviews indicate that AI browsers have a lot of safety risks. It could take Apple time to launch a Mac AI system comparable to Sky, as a result.\nDeal terms for OpenAI’s acquistion were not revealed, but Sky’s maker had raised $6.5 million from investors, including OpenAI CEO Sam Altman, Figma CEO Dylan Field, Context Ventures, and Stellation Capital, according to data from Pitchbook. OpenAI disclosed that Altman held a passive interest in the startup through an investment fund. \nThe deal was led by Head of ChatGPT Nick Turley and OpenAI’s CEO of Applications, Fidji Simo, and approved by OpenAI’s board. \n\n\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI buys Sky, an AI interface for Mac",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/ArtCard_SKY_16_9.webp?w=150"
      ],
      "datePublished": "2025-10-23T20:53:02.000Z",
      "dateModified": "2025-10-23T20:53:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "With an Intel recovery underway, all eyes turn to its foundry business",
    "url": "https://techcrunch.com/2025/10/23/with-an-intel-recovery-underway-all-eyes-turn-to-its-foundry-business/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2228936694.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T00:09:29.000Z",
    "description": "\nIntel’s third-quarter earnings beat Wall Street expectations Thursday, results buoyed by a bump in revenue combined with larger cuts, and multiple, s",
    "body": "\nIntel’s third-quarter earnings beat Wall Street expectations Thursday, results buoyed by a bump in revenue combined with larger cuts, and multiple, sizable investments over the last two months as CEO Lip-Bu Tan looks to turn around the struggling semiconductor giant.\nIntel’s revenue results and its $4.1 billion in net income provides a far rosier view than its string of quarterly losses. But the company’s recovery story deserves several chapters dedicated to cost cutting via layoffs and other reductions as well as a series of high-profile investments from Softbank, Nvidia, and the U.S. government.\nIntel added $20 billion to its balance sheet during the third quarter, the company announced on its third-quarter earnings presentation on Thursday, sending its stock soaring. This growth was largely due to three sizable investments in the company over the last three months.\nIn August, SoftBank invested $2 billion. A few days later, the U.S. Government took an unprecedented 10% equity stake in Intel. The company has received $5.7 billion of the planned $8.9 billion from the U.S. Government thus far. Nvidia also bought a $5 billion stake in Intel in September as part of a broader deal to develop chips together over time.\n“The actions we took to strengthen the balance sheet give us greater operational flexibility and position us well to continue to execute our strategy with confidence,” Tan said on the company’s earnings call. “In particular, I’m honored by the trust and confidence President Trump and Secretary [Howard] Lutnick have placed in me. Their support highlights Intel’s strategic role as the only U.S.-based semiconductor company with leading edge logic, [research and development] and manufacturing.”\nThe company also received $5.2 billion from closing the sale of its ownership stake of Altera, a hardware company it had owned since 2015, on September 12. It also sold its stake in Mobileye, an autonomous driving tech company.\nIntel grew its quarterly revenue by $800 million in the third quarter to $13.7 billion, compared to $12.9 billion. Intel had net income of $4.1 billion in the third quarter, a steep reversal from the $16.6 billion loss it reported in the same year-ago period. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe foundry biz \nDespite the strong quarter, there weren’t many details on what will happen next with Intel’s foundry business, which makes custom chips for customers. The business has floundered from the start and has been a focus of Tan, who initiated significant layoffs in its foundry business this summer.\nThe business appears to be a priority of the Trump administration; a key condition of the government’s investment in Intel includes language that it will penalize Intel if it divested from its foundry business over the next five years.\nWall Street is keeping a close eye on foundry for signs of the company’s long-term growth. Intel analysts told TechCrunch in August that the company did not need cash to turn itself around but rather a strategy to get its foundry business on track.\nTan said that Intel thinks its foundry business is “uniquely positioned” to capitalize on the swelling demand for chips but was light on the details — beyond saying that the company is actively engaging with potential foundry customers — and added that the growth of the foundry business would remain disciplined.\n“Building a world-class foundry is a long-term effort founded on trust,” Tan said. “As a foundry, we need to ensure that our process can be easily used by a variety of customers, each with their unique way of building their own products. We must learn to delight our customers as they count on us to build wafers, to meet all their needs for powerful performance, yield, cost, and schedule.”\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "With an Intel recovery underway, all eyes turn to its foundry business",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2228936694.jpg?w=150"
      ],
      "datePublished": "2025-10-24T00:09:29.000Z",
      "dateModified": "2025-10-24T00:09:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford isn’t going to make more F-150 Lightnings for a while",
    "url": "https://techcrunch.com/2025/10/23/ford-isnt-going-to-make-more-f-150-lightnings-for-a-while/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/01/REVC_1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-23T23:58:36.000Z",
    "description": "\nFord Motor has put its gas and hybrid F-150 and F-Series Super Duty trucks at the top of the production priority line as it attempts to recover from ",
    "body": "\nFord Motor has put its gas and hybrid F-150 and F-Series Super Duty trucks at the top of the production priority line as it attempts to recover from losses connected to a fire at a critical aluminum supplier’s factory. \nThe automaker’s all-electric F-150 Lightning didn’t make the list. \nFord said Thursday that assembly of the F-150 Lightning truck at the Rouge Electric Vehicle Center in Dearborn, Michigan will remain paused. The reason, according to Ford: the gas and hybrid F-Series trucks are more profitable for Ford and use less aluminum.\nWhile Ford has highlighted sales growth of its all-electric F-150 Lightning truck, those numbers are still dwarfed by its gas-powered F-Series trucks. \nFord sold 10,005 F-150 Lightning pickups in the third quarter, a 39.7% increase year-over-year. To put that into context, Ford delivered 545,522 vehicles in the third quarter, 207,732 of which were F-Series. To date, Ford has sold 23,034 F-150 Lightning  trucks in 2025, about 1% more than the first nine months of 2024, according to recent sales data. \nA Ford spokesperson noted that while F-150 is the best-selling electric pickup in the U.S., the company is focused on producing the gas and hybrid trucks as it recovers from the September 16 fire at aluminum supplier Novelis’ plant in Oswego, New York that severely damaged its hot mill. Novelis said it expects to restart its hot mill by December 2025. \n“We have good inventories of the F-150 Lightning and will bring Rouge Electric Vehicle Center (REVC) back up at the right time, but don’t have an exact date at this time,” said spokesperson Ian Thibodeau.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe Novelis plant fire has been costly for Ford and disrupted production of some of its most popular and profitable vehicles. The fire will cost Ford up to $2 billion in earnings in the fourth quarter, the automaker reported Thursday in its third-quarter earnings. That cost, coupled with up to a $1 billion headwind from tariffs, led Ford to lower its full-year profit guidance for 2025 to $6 billion from $6.5 billion.\nFord’s solution to recover fire-related losses is to increase F-Series production volume by more than 50,000 trucks in 2026 by adding a third shift. The plan is expected to create up to 1,000 new jobs and all hourly employees at the Rouge Electric Vehicle Center will be transferred next door to work the third shift at the Dearborn Truck Plant.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford isn’t going to make more F-150 Lightnings for a while",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/01/REVC_1.jpg?w=150"
      ],
      "datePublished": "2025-10-23T23:58:36.000Z",
      "dateModified": "2025-10-23T23:58:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube paid out $8B to the music industry in 12 months",
    "url": "https://techcrunch.com/2025/10/23/youtube-paid-out-8b-to-the-music-industry-in-12-months/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-23T19:33:04.000Z",
    "description": "\n\t\n\t\tImage Credits:Olly Curtis/Future / Getty Images\t\n\t\n\t\t\t\t\t\t12:33 PM PDT · October 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nYouTube has paid more than $8 billion to",
    "body": "\n\t\n\t\tImage Credits:Olly Curtis/Future / Getty Images\t\n\t\n\t\t\t\t\t\t12:33 PM PDT · October 23, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nYouTube has paid more than $8 billion to the music industry in the 12 months between July 2024 and July 2025, the company announced on Thursday. \n“Today’s $8 billion payout is a testament to the fact that the twin engine of ads and subscriptions is firing on all cylinders,” said YouTube’s Global Head of Music, Lyor Cohen, in a statement. “This number is not an endpoint; it represents meaningful, sustained progress in our journey to build a long-term home for every artist, songwriter, and publisher on the global stage.”\nCohen first announced the milestone during a talk at Billboard Latin Music Week on Wednesday.\nThe milestone marks a new record for the platform, as YouTube’s annual music industry payout increased by $2 billion since 2022, when the company reported contributing $6 billion in revenue to the music industry between July 2021 and June 2022. A year before that, in 2021, YouTube announced that it had paid out $4 billion to the industry in 12 months.\nThursday’s announcement comes as Spotify announced earlier this year that it paid out $10 billion to the music industry in 2024. The company delivered $9 billion in 2023. It’s worth noting that the artists themselves don’t receive all the money — it also goes to labels, publishers, songwriters, and others. \nYouTube says it’s seeing momentum from its twin-engine revenue model, noting that it has over 125 million Music and Premium subscribers globally, including users on trials. The company also said that it has two billion logged-in viewers who watch music videos each month.\n“As the platform’s global footprint continues to expand, so does the potential for artists and songwriters to build long-lasting music careers and forever fans on YouTube,” the company wrote in a blog post.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nYouTube is available in more than 100 countries and supports 80 languages. \nThe company announced last month at its Made on YouTube event that it paid more than $100 billion to creators, artists, and media companies in the last four years. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube paid out $8B to the music industry in 12 months",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=150"
      ],
      "datePublished": "2025-10-23T19:33:04.000Z",
      "dateModified": "2025-10-23T19:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI at the edge: How startups are powering the future of space at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/24/ai-at-the-edge-how-startups-are-powering-the-future-of-space-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/54100789283_605f466d0f_o.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T14:30:00.000Z",
    "description": "\nJust three days until liftoff for TechCrunch Disrupt 2025 — and the Space Stage is ready to explore the future of space tech (and every other frontie",
    "body": "\nJust three days until liftoff for TechCrunch Disrupt 2025 — and the Space Stage is ready to explore the future of space tech (and every other frontier of innovation). Space leaders Adam Maher (Ursa), Dr. Lucy Hoag (Violet Labs), and Dr. Debra L. Emmons (The Aerospace Corporation) will unpack how AI is transforming life in orbit.\nIf you’re after insights, inspiration, and a front-row seat to what’s next, this is the room to be in. Save up to $444 on your pass before doors open on October 27 — plus, grab a guest pass for 60% off or get 15% to 30% off group rates for your team.\n\nRedefining the final frontier: AI at the edge of space\nForget just rockets and satellites. The real revolution in space isn’t in what we launch, but in the intelligence we deploy.\nSpace has become the ultimate data frontier. To truly harness it, we need more than just pipes; we need brains in orbit. This is the age of on-orbit compute and autonomous decision-making, where intelligent edge systems instantly transform raw satellite feeds into actionable insight.\nAI isn’t just optimizing missions — it’s transforming them. It is the engine for unprecedented speed, efficiency, and resilience, enabling missions to be managed and scaled like never before.\nThis Space Stage session, only at TechCrunch Disrupt 2025, cuts through the noise to showcase the true innovators: those pushing intelligence to the absolute edge, fundamentally redefining the speed, efficiency, and resilience of operations in space.\nThree days until liftoff. Save on tickets to Disrupt 2025 while you still can. Save up to $444 on your pass before doors open on October 27, and grab a plus-one ticket for 60% off. Teams save even more with 15% to 30% off group passes.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nAerospace’s tech navigator: CTO driving strategy and innovation\nDr. Debra Emmons is vice president and CTO at The Aerospace Corporation. She’s responsible for providing vital leadership for determining and executing the company’s technology strategy and investments. Emmons leads four offices: eLab, responsible for setting the technical investment strategy and priorities; xLab, responsible for developing, building, and operating prototypes; Commercial Space Futures (CSF) office, responsible for driving the harnessing of commercial solutions for government missions to advance U.S. space; and the new Solution Accelerator, responsible for delivering independent and innovative solutions with speed and national impact. \nFrom vision to vantage: Founding Ursa’s radar revolution\nAdam Maher serves as founder and CEO of Ursa Space Systems, whose services empower users to make better decisions with better data. He founded Ursa in 2014 to develop a vision of connecting people to information-rich data derived from synthetic aperture radar. Previously, Adam worked at Maxar (Space Systems Loral) as a system engineer for complete satellite builds. Adam holds a Bachelor of Mechanical Engineering and a Master of Engineering, Mechanical Engineering, from Cornell University.\nViolet: The data brain revolutionizing complex hardware design\nDr. Lucy Hoag is the founder and CEO of Violet Labs, a San Francisco-based startup seeking to revolutionize how complex hardware is designed and built through Violet — the first data orchestration platform engineered specifically for complex hardware development. Prior to Violet, Hoag worked on satellite, drone, and self-driving car projects for DARPA, Google, Waymo, Lyft, and Amazon. Lucy holds a BS and a PhD from the University of Southern California in Astronautical Engineering.\nT-minus 3 days until launch — grab your ticket before prices skyrocket\nSave on tickets to TechCrunch Disrupt 2025 while you still can. Save up to $444 on your pass before doors open on October 27, or grab a plus-one ticket for 60% off. Teams save even more with 15% to 30% off group passes.\nImage Credits:Kimberly White / Getty Images\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI at the edge: How startups are powering the future of space at TechCrunch Disrupt 2025",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/54100789283_605f466d0f_o.jpg?w=150"
      ],
      "datePublished": "2025-10-24T14:30:00.000Z",
      "dateModified": "2025-10-24T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to use the new ChatGPT app integrations, including Spotify, Figma, Canva, and others",
    "url": "https://techcrunch.com/2025/10/24/how-to-use-the-new-chatgpt-app-integrations-including-spotify-figma-canva-and-others/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-24T19:08:10.000Z",
    "description": "\nOpenAI recently launched new app integrations in ChatGPT to allow you to connect your accounts directly to ChatGPT and ask the assistant to do things",
    "body": "\nOpenAI recently launched new app integrations in ChatGPT to allow you to connect your accounts directly to ChatGPT and ask the assistant to do things for you. For instance, with a Spotify integration, you can tell it to create personalized playlists that will show up right in your Spotify app.\nTo get started, make sure you’re logged into ChatGPT. Then type the name of the app you want to use at the start of your prompt, and ChatGPT will guide you through signing in and connecting your account.\nIf you want to set everything up at once, head over to the Settings menu, then click on Apps and Connectors. You can browse through the available apps, pick the ones you like, and it’ll take you to the sign-in page for each one. \nHowever, it’s important to note that connecting your account means you’re sharing your app data with ChatGPT. Make sure to review the permissions you’re giving when you’re linking your accounts. For example, if you connect your Spotify account, ChatGPT can see your playlists, listening history, and other personal information. (Sharing this info helps personalize the experience, but if you have privacy concerns, consider whether you’re comfortable with this level of access before connecting.)\nYou can also disconnect any app whenever you want, right from the Settings menu.\nAvailable apps \nImage Credits:OpenAI\nBooking.com\nThis integration with the online travel giant is designed to help travelers, especially first-time visitors in need of suggestions for where to stay.\nOnce you link your Booking.com account, you can ask ChatGPT to find hotels in your preferred city based on your dates and budget. You can also specify how many people are coming and whether you want the hotel near public transport. ChatGPT aims to make this process more intuitive than searching directly on the Booking.com site. Plus, you can be more specific, like searching for options “with breakfast included.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhen you find a hotel you like, just open the Booking.com listing to complete your reservation.\nCanva\nImage Credits:Canva\nCanva in ChatGPT is a helpful tool for graphic designers and anyone else who needs to generate visual content quickly. Whether it’s for a social media post, a poster, or a slide deck for a presentation, this may be a good way to help kickstart your project and brainstorm ideas. \nOnce you connect your Canva account, you can ask ChatGPT to design something like “a 16:9 slide deck about our Q4 roadmap” or “a fun poster for a dog-walking business.” You can include specifics such as the fonts you prefer, color schemes, formats (like Instagram posts or stories), and exact dimensions. \nAI-generated designs are seldom perfect, with occasional distorted images or spelling mistakes. However, some users may find this better than starting from scratch, and they can jump into Canva at any time to tweak their design and make it look just how they want.\nCoursera\nImage Credits:Coursera\nCoursera’s integration is designed to help you quickly discover the best online courses for your skill level. For instance, you can then tell ChatGPT to find an “intermediate-level course on Python.” You can then tell the chatbot to compare course options by rating, duration, and cost before enrolling. ChatGPT can also provide a quick rundown of what exactly each course covers.\nExpedia\nImage Credits:Expedia\nChatGPT can display hotel options and flights via Expedia without leaving chat. Whether you’re looking for a quick escape or a longer trip, it can find flights that fit your travel dates, budget, and number of travelers. You can narrow things down by saying stuff like “Only show 4-star hotels.” Once you see something you like, go to Expedia to finalize everything and book your trip.\nFigma\nImage Credits:Figma\nTo use Figma in ChatGPT, you can ask it to generate diagrams, flow charts, and more. This is helpful for turning your ideas and brainstorming sessions into something more tangible. It may also be useful for visualizing complex concepts or workflows.\nYou can also upload files and ask the chatbot to generate a product roadmap for your team. This roadmap can include milestones, deliverables, and deadlines, helping your team stay organized and focused on their goals.\nSpotify \nImage Credits:Spotify\nOne of the most helpful aspects of using Spotify in ChatGPT is the ability to quickly create playlists and listen to new recommended songs tailored to your specific tastes. You can ask it to create a playlist based on your current mood, or just a playlist that only includes tracks by your favorite band. \nIt can also suggest new artists, playlists, audiobooks, and podcast episodes. Additionally, ChatGPT can perform actions on your behalf, including adding and removing items from your Spotify library. \nZillow\nImage Credits:Zillow\nIf you’re looking for a new home, Zillow in ChatGPT could make the search experience more straightforward. Using a simple text prompt, you can find homes that meet your criteria and apply filters to narrow the results. Whether you’re looking for a specific price range, number of bedrooms, or particular neighborhoods, you can specify these details in your prompt, making the search process much more efficient and tailored to your needs. \nWhat’s next?\nAlongside the announcement that OpenAI would bring apps into ChatGPT, the company also said it plans to welcome additional partners soon, including DoorDash, OpenTable, Target, Uber, and Walmart. These will launch later in the year. \nThe rollout of ChatGPT’s app integrations is currently limited to the U.S. and Canada. Users in Europe and the UK are excluded for now.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to use the new ChatGPT app integrations, including Spotify, Figma, Canva, and others",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150"
      ],
      "datePublished": "2025-10-24T19:08:10.000Z",
      "dateModified": "2025-10-24T19:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]