[
  {
    "title": "Amazon reportedly plans to cut around 30,000 corporate jobs",
    "url": "https://techcrunch.com/2025/10/27/amazon-reportedly-plans-to-cut-around-30000-corporate-jobs/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2217247219.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T19:39:04.000Z",
    "description": "In Brief Posted: 12:39 PM PDT · October 27, 2025  Image Credits:Matthias Balk/picture alliance / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Amazon could be implementing the largest job reduction...",
    "body": "\nIn Brief\nPosted:\n12:39 PM PDT · October 27, 2025\n\nImage Credits:Matthias Balk/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAmazon could be implementing the largest job reduction at the company since 2023. \nAs reported by Reuters on Monday, people familiar with the matter said that up to 30,000 corporate positions may be eliminated starting Tuesday. The job cuts are expected to affect various sectors, including human resources, devices and services, and operations, and others.\nAmazon hasn’t eliminated this many jobs since 27,000 were cut beginning in late 2022.\nIn recent years, Amazon has made smaller job cuts across different divisions. In January, Amazon reduced a small number of positions in its Communications and Sustainability departments.\nThis also follows a CNBC report discussing a memo from Amazon CEO Andy Jassy, which stated that, as Amazon continues to implement more AI agents, fewer corporate jobs will be needed.\nAmazon didn’t immediately respond to a request for comment.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Commerce\n"
  },
  {
    "title": "OpenAI says over a million people talk to ChatGPT about suicide weekly",
    "url": "https://techcrunch.com/2025/10/27/openai-says-over-a-million-people-talk-to-chatgpt-about-suicide-weekly/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2194585161.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T19:19:44.000Z",
    "description": "OpenAI released new data on Monday illustrating how many of ChatGPT’s users are struggling with mental health issues, and talking to the AI chatbot about it. The company says that 0.15% of ChatGPT’s active...",
    "body": "\nOpenAI released new data on Monday illustrating how many of ChatGPT’s users are struggling with mental health issues, and talking to the AI chatbot about it. The company says that 0.15% of ChatGPT’s active users in a given week have “conversations that include explicit indicators of potential suicidal planning or intent.” Given that ChatGPT has more than 800 million weekly active users, that translates to more than a million people a week. \nThe company says a similar percentage of users show “heightened levels of emotional attachment to ChatGPT,” and that hundreds of thousands of people show signs of psychosis or mania in their weekly conversations with the AI chatbot.\nOpenAI says these types of conversations in ChatGPT are “extremely rare,” and thus difficult to measure. That said, OpenAI estimates these issues affect hundreds of thousands of people every week.\nOpenAI shared the information as part of a broader announcement about its recent efforts to improve how models respond to users with mental health issues. The company claims its latest work on ChatGPT involved consulting with more than 170 mental health experts. OpenAI says these clinicians observed that the latest version of ChatGPT “responds more appropriately and consistently than earlier versions.”\nIn recent months, several stories have shed light on how AI chatbots can adversely affect users struggling with mental health challenges. Researchers have previously found that AI chatbots can lead some users down delusional rabbit holes, largely by reinforcing dangerous beliefs through sycophantic behavior.\nAddressing mental health concerns in ChatGPT is quickly becoming an existential issue for OpenAI. The company is currently being sued by the parents of a 16-year-old boy who confided his suicidal thoughts with ChatGPT in the weeks leading up to his own suicide. State attorneys general from California and Delaware — which could block the company’s planned restructuring — have also warned OpenAI that it needs protect young people who use their products.\nEarlier this month, OpenAI CEO Sam Altman claimed in a post on X that the company has “been able to mitigate the serious mental health issues” in ChatGPT, though he did not provide specifics. The data shared on Monday appears to be evidence for that claim, though it raises broader issues about how widespread the problem is. Nevertheless, Altman said OpenAI would be relaxing some restrictions, even allowing adult users to start having erotic conversations with the AI chatbot.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn the Monday announcement, OpenAI claims the recently updated version of GPT-5 responds with “desirable responses” to mental health issues roughly 65% more than the previous version. On an evaluation testing AI responses around suicidal conversations, OpenAI says its new GPT-5 model is 91% compliant with the company’s desired behaviors, compared to 77% for the previous GPT‑5 model.\nThe company also says it latest version of GPT-5 also holds up to OpenAI’s safeguards better in long conversations. OpenAI has previously flagged that its safeguards were less effective in long conversations.\nOn top of these efforts, OpenAI says it’s adding new evaluations to measure some of the most serious mental health challenges facing ChatGPT users. The company says its baseline safety testing for AI models will now include benchmarks for emotional reliance and non-suicidal mental health emergencies.\nOpenAI has also recently rolled out more controls for parents of children that use ChatGPT. The company says it’s building an age prediction system to automatically detect children using ChatGPT, and impose a stricter set of safeguards.\nStill, it’s unclear how persistent the mental health challenges around ChatGPT will be. While GPT-5 seems to be an improvement over previous AI models in terms of safety, there still seems to be a slice of ChatGPT’s responses that OpenAI deems “undesirable.” OpenAI also still makes its older and less-safe AI models, including GPT-4o, available for millions of its paying subscribers.\n\n\n\t\tMaxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene.\r\nYou can contact or verify outreach from Maxwell by emailing maxwell.zeff@techcrunch.com or via encrypted message at mzeff.88 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Fitbit’s revamped app, with Gemini-powered health coach, rolls out to Premium users",
    "url": "https://techcrunch.com/2025/10/27/fitbits-revamped-app-with-gemini-powered-health-coach-rolls-out-to-premium-users/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/FitbitGeminiCoach-preview.png?w=150",
    "tag": "Tech",
    "date": "2025-10-27T19:11:50.000Z",
    "description": "Fitbit’s new Gemini-powered health coach, announced back in August, is becoming available as a public preview to Premium subscribers in the U.S. on Android starting tomorrow. It expands to iOS later this...",
    "body": "\nFitbit’s new Gemini-powered health coach, announced back in August, is becoming available as a public preview to Premium subscribers in the U.S. on Android starting tomorrow. It expands to iOS later this year. \nAs the AI race heats up, Google is counting on the Gemini AI assistant to help Fitbit stand out from the crowd. Called “Coach,” this feature is designed to be your all-in-one fitness trainer, sleep coach, and health and wellness advisor.\nImage Credits:Google\nAt the recent Made by Google event, Google showcased Coach’s various capabilities, like how it can create a custom routine based on your goals, preferences, and available equipment. \nFor example, if you want to run longer distances without becoming winded, Coach will create a tailored fitness plan with suggestions and achievable targets. While you work out, it’ll adjust your exercise plan in real time based on feedback to keep you on track. And if you happen to get injured later in the week, the AI will modify the plan accordingly.\nOther capabilities include analyzing your sleep habits and providing insights into how to improve your sleep quality over time.\nWhile the focus will be on Coach, the Fitbit app also features a makeover with a sleek design that’s easier to navigate, organized around four main tabs: Today, Fitness, Sleep, and Health.\nImage Credits:Google\nGoogle published a demo video on its Made by Google channel on YouTube that explains each tab. The Today tab, for instance, serves as the central hub of the app, highlighting key focus metrics, weekly cardio load data, and any other relevant statistics you may want to glance at quickly. You can manually customize which metrics you want to view at any time.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe Fitness tab, meanwhile, houses your workout plans and key metrics, such as your cardio goal and average weekly step count. However, keep in mind that several features are still unavailable, such as nutrition tracking and cycle logging.\nImage Credits:Google\nAdditionally, the Sleep tab allows you to track your sleep patterns, with a new feature that provides AI Coach insights to help you enhance your sleep quality. At the bottom of the tab, a Sleep summary aggregates all information from your last night’s sleep, such as whether you experienced prolonged periods of wakefulness during the night.\nImage Credits:Google\nThe Health tab is dedicated to key metrics, providing quick access to vital signs such as breathing rate, blood oxygen saturation, and resting heart rate, offering a comprehensive overview of your health.\nTo check out the Coach preview on Android, you’ll need an active Fitbit Premium subscription and a compatible Fitbit smartwatch, tracker, or Pixel Watch.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "PSA: Reregister your hardware 2FA key for X before November 10 to avoid getting locked out",
    "url": "https://techcrunch.com/2025/10/27/psa-reregister-your-hardware-2fa-key-for-x-before-november-10-to-avoid-getting-locked-out/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/03/twitter-x-phone-call.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:30:32.000Z",
    "description": "Image Credits:Bryce Durbin/TechCrunch\t \t \t\t\t\t\t\t8:30 AM PDT · October 27, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Social network X said over the weekend that it plans to retire its twitter.com URL for authentication. This means...",
    "body": "\n\t\n\t\tImage Credits:Bryce Durbin/TechCrunch\t\n\t\n\t\t\t\t\t\t8:30 AM PDT · October 27, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSocial network X said over the weekend that it plans to retire its twitter.com URL for authentication. This means users who have enabled two-factor authentication using a hardware key like YubiKey will have to re-enroll their keys before November 10.\n“By November 10, we’re asking all accounts that use a security key as their two-factor authentication (2FA) method to re-enroll their key to continue accessing X. You can re-enroll your existing security key, or enroll a new one,” the social network’s safety account posted last Friday.\nTwo days later, the company explained that this was necessary because the company wanted to retire its old twitter.com domain. The domain change is not expected to impact other 2FA authenticators like Google Authenticator, Microsoft Authenticator, or Authy.\n“To clarify: this change is not related to any security concern, and only impacts Yubikeys and passkeys — not other 2FA methods (such as authenticator apps). Security keys enrolled as a 2FA method are currently tied to the twitter[.]com domain. Re-enrolling your security key will associate it with x[.]com, allowing us to retire the Twitter domain,” the account said.\nChristopher Stanley, a security engineer at X, xAI, and SpaceX, said this move is to ensure domain trust. “Getting off of Twitter enrolled keys so we can stop doing hacky things for domain trust. Physical security keys are cryptographically registered to Twitter’s domain and need to be re-enrolled under X,” he said.\nIf you’re using a hardware key to secure your account, head to Settings > Security and account access > Two-factor authentication > Manage security keys.\nIt is not clear if X plans to retire the twitter.com domain for all activities, or if this is just a security measure. We have asked the company to clarify and will update the story if we hear back.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Mercor quintuples valuation to $10B with $350M Series C",
    "url": "https://techcrunch.com/2025/10/27/mercor-quintuples-valuation-to-10b-with-350m-series-c/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/IMG_9747_3d5c52.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:53:34.000Z",
    "description": "Mercor, which connects AI labs with domain experts for training their foundational AI models, has raised $350 million at a $10 billion valuation, the company confirmed to TechCrunch. Felicis Ventures, which...",
    "body": "\nMercor, which connects AI labs with domain experts for training their foundational AI models, has raised $350 million at a $10 billion valuation, the company confirmed to TechCrunch.\nFelicis Ventures, which led the company’s previous $100 million Series B at a $2 billion valuation, is also leading this round. Existing investors Benchmark and General Catalyst, and new investor Robinhood Ventures also participated.\nTechCrunch reported in September that Mercor was in talks with investors to raise a Series C at a valuation of $10 billion, up from its target of $8 billion a few months prior. The company at the time told potential investors that it already had multiple offers.\nMercor started off as an AI-driven hiring platform but quickly pivoted to providing companies with specialized domain experts to perform AI model training — such as scientists, doctors, and lawyers — and charging an hourly finder’s fee and matching rate for their work.\nThe company has also been adding more software infrastructure for reinforcement learning — a training method where a model’s or agent’s decisions are verified or disputed, enabling it to incorporate feedback and improve over time. The company intends to eventually build an AI-powered recruiting marketplace.\nMercor’s fortunes rose after leading AI labs like OpenAI and Google DeepMind reportedly cut ties with data-labeling startup Scale AI after Meta invested $14 billion in the data vendor and hired its CEO.\nThe company apparently told investors that it’s on track to hit $500 million in ARR faster than Anysphere, the startup behind Cursor, which famously hit the milestone roughly a year after launching its core product.\n“Since we founded Mercor almost three years ago, AI has advanced at an astonishing pace. But it still struggles with the subtleties that drive economically valuable work — balancing trade-offs, understanding intent, developing taste, and deciding what should be done, not just what can be done,” the company wrote in a blog post emailed to TechCrunch.\nThe startup says it currently pays more than $1.5 million per day to its contractors. It has more than 30,000 experts on its roster, who earn over $85 per hour on average.\nMercor said it will focus on three areas: expanding its talent network, improving its systems for matching its contractors with clients, and building new products to automate more of its processes.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Threads adds ‘ghost posts’ that disappear after 24 hours",
    "url": "https://techcrunch.com/2025/10/27/threads-adds-ghost-posts-that-disappear-after-24-hours-and-responses-go-to-dms/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/threads-ribbon-app-text-GettyImages-1508644788.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T16:00:00.000Z",
    "description": "Instagram Threads is launching “ghost posts,” a new disappearing-posts feature that lets users share updates that automatically archive after 24 hours. The ephemeral option — rolling out globally on Monday — aims to encourage more casual, low-pressure sharing.",
    "body": "\nMeta’s X competitor, Threads, is introducing a new “disappearing posts” feature that will allow the app’s over 400 million monthly users to share their thoughts and engage in conversations that are automatically archived after 24 hours.\nThe option, dubbed “ghost posts,” launches on Monday for Threads users worldwide. \nUsers will now be able to create a ghost post on mobile devices by toggling on the new “ghost” icon on the app’s compose screen. When the post is published, it appears in others’ timelines with a dotted conversation bubble around it to differentiate the post from other content.\nOther users on both desktop and mobile devices can reply to the post, but these responses are sent directly to the poster’s DMs (direct messages); these replies don’t appear in the timeline. \nUnderneath the post, people can see if others have liked and replied to the ghost post, which is indicated by smiley-faced icons. But only posters can see the actual number of likes and replies, and who engaged.\nAfter 24 hours, the posts disappear from the timeline but are still available to the original poster from the “archived” section, accessed from the main settings menu.\nImage Credits:Meta/Instagram Threads / Getty Images\n(Note: If you’ve turned off message requests, people you don’t follow won’t be able to reply to your ghost posts. If message requests are enabled, any replies from people you don’t follow go to your message request inbox instead. You can adjust these settings from the drop-down menu in the top right of your profile.)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nParent company Meta told TechCrunch the feature was designed to encourage more low-stakes sharing within the feed.\nThe addition could also give Threads a new way to challenge Elon Musk’s X, where users today have to opt for third-party, often paid services to delete their old tweets if they don’t want to do a lot of manual labor. \nThis is not the first time a text-first social network has tried ephemeral posts. Before it was X, Twitter experimented with this form of sharing back in 2020 with Fleets, which appeared as disappearing Stories. However, the company pulled the feature the following year, citing a lack of adoption.\nMeta, meanwhile, believes there’s still potential in disappearing content — something that has worked well for Stories on Instagram and Facebook, for instance. On Threads, the company says it expects people will be encouraged to share more of their unfiltered thoughts, engage in live threading, or try other sorts of experimental content via ghost posts.\nThe tech giant has been rapidly iterating on Threads since its July 2023 launch, rolling out features like custom feeds, DMs, fediverse sharing (which connects Threads to open social networks like Mastodon), and, more recently, support for up to 10,000 characters through text attachments, tools to hide spoilers, and the launch of interest-based communities.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Apple says US passport digital IDs are coming to Wallet ‘soon’",
    "url": "https://techcrunch.com/2025/10/27/apple-says-u-s-passport-digital-ids-are-coming-to-wallet-soon/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-2141952348.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T16:44:30.000Z",
    "description": "Apple says it will soon introduce an Apple Wallet feature to allow U.S. users to create a digital ID using their passport, which can be used at select TSA checkpoints for domestic travel.",
    "body": "\nApple says it will soon introduce an Apple Wallet feature that will allow U.S. users to create a digital ID using their passport, which will then be able to be used at select TSA checkpoints for domestic travel. The feature, previously announced as part of the iOS 26 release, comes on the heels of Apple’s expansion of Wallet as more than a payment mechanism or ticket holder, but also a secure place to store a user’s digital identity.\nCurrently, support for government IDs in Apple Wallet has rolled out to 12 states and Puerto Rico, or roughly a third of U.S. license holders. However, the passport-tied Digital ID feature didn’t arrive with the debut of iOS 26, as Apple said it would come in a future software update. \nWhile the new digital IDs won’t replace a U.S. passport, they could allow travelers to move through TSA checkpoints more quickly, alongside Wallet’s existing support for digital boarding passes.\nThe change is particularly urgent given the Real ID rules, which began enforcement in May, rendering many state IDs insufficient for TSA checkpoints.\nThe coming launch of passport-associated Digital IDs was announced on Sunday by Jennifer Bailey, VP of Apple Pay and Apple Wallet, at the Money 20/20 USA conference, where the exec also shared other stats about Wallet’s adoption.\n\nFor instance, she noted that Apple Pay was now live in 89 markets around the world, with more than 11,000 banks and networks supporting Apple Pay, including 15 domestic networks. In addition, 90% of U.S. retailers support Apple Pay, up from 3% at launch 11 years ago. \nBailey also pointed to other non-payment features for the Wallet app, like the ability to save car keys, transit passes, hotel keys, and more. Transit options are supported across more than 250 regions and 800 cities globally, and over 2 million hotel room keys have been provisioned, supporting more than 65,000 hotel rooms. In addition, 29 car manufacturers and over 300 models now support Car Key in Wallet, according to the exec.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "TechCrunch Disrupt 2025: How to watch Astro Teller, Startup Battlefield, and more live",
    "url": "https://techcrunch.com/2025/10/27/techcrunch-disrupt-2025-how-to-watch-astro-teller-startup-battlefield-and-more-live/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/Disrupt-2025-Space-Stage-Even-Rogers.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T16:25:17.000Z",
    "description": "TechCrunch Disrupt 2025 is here! If you’re still on the fence about attending in person, dive into the extensive schedule of speakers, networking opportunities, workshops, after-parties, and more that’s...",
    "body": "\nTechCrunch Disrupt 2025 is here! If you’re still on the fence about attending in person, dive into the extensive schedule of speakers, networking opportunities, workshops, after-parties, and more that’s available here. There’s still plenty of time to get a ticket! \nBut if you’re not able to attend in person, the next best thing is to check out our livestream of the Disrupt Stage, which features some of our most prominent speakers and the highly anticipated Startup Battlefield 200 pitch competition. We’re streaming via YouTube, so you can catch the embed below, or just follow this link to watch live. \n\n\n\nHere’s a rundown of what you can expect from the Disrupt Stage on Monday to build your schedule around: \nOpening remarks, Startup Battlefield Session One: 10 a.m. – 11:45 a.m. \nOur first round of Battlefield finalists will deliver their pitches live onstage in front of a lineup of judges featuring Allison Baum Gates (SemperVirens), Cathy Friedman (GV), Katelin Holloway (Seven Seven Six), Charles Hudson (Precursor), and Nicolas Sauvage (TDK Ventures). \nThe Self-Driving Reality Check: 11:15 a.m. – 11:45 a.m. \nTekedra Mawakana, co-CEO of Waymo, takes the stage to talk about where AVs actually stand, what it’s taken to get to real deployments, and why the race isn’t just about tech — it’s about trust. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nStartup Battlefield Session Two: 1:30 p.m. – 2:45 p.m. \nThe second lineup of Battlefield competitors take to the stage, where they’ll be vetted by our panel of judges featuring Eryk Dobrushkin (Index Ventures), Jen Hoskins (Nvidia), Thomas Krane (Insight Ventures), Jon McNeill (DVx), and Katie Stanton (Moxxie Ventures). \nWhat Sequoia Sees Coming Next: 2:45 p.m. – 3:15 p.m. \nRoelof Botha is among the most influential VCs of the modern era, and this is your chance to hear how today’s most ambitious founders are navigating AI, geopolitics, and a shifting capital landscape.  \nMoonshots, AI, and the Future of Alphabet: 3:15 p.m. – 3:45 p.m. \nAstro Teller leads the lab where Alphabet incubates the nearly impossible, and he’s going to provide a rare look into what’s succeeding within X, how the company’s “fail fast” mantra is faring, and his perspective on, you guessed it, AI. \nAnd that’s just the lineup for the first day. On Tuesday hear from renowned investor Vinod Khosla and his thoughts on the future of tech; Netflix CTO Elizabeth Stone on what’s next for the streaming giant; and Slate Auto CEO Chris Barman will bring one of her electric trucks to the stage.  \n"
  },
  {
    "title": "Sequoia unveils $950M in new early-stage funds as it strives to be ‘only as good as our next investment’",
    "url": "https://techcrunch.com/2025/10/27/sequoia-unveils-950m-in-new-early-stage-funds-as-it-strives-to-be-only-as-good-as-our-next-investment/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Investor-wall-Sequoia.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T14:00:00.000Z",
    "description": "Despite the growing chatter of an AI bubble, Sequoia Capital insists its investment approach is unswayed by the market frenzy. “Markets go up and down, but our strategy remains consistent. We’re always...",
    "body": "\nDespite the growing chatter of an AI bubble, Sequoia Capital insists its investment approach is unswayed by the market frenzy.\n“Markets go up and down, but our strategy remains consistent. We’re always looking for outlier founders with ideas to build generational businesses,” said Bogomil Balkansky, a partner on Sequoia’s early-stage investment team.\nTo prove this consistency, Sequoia announced two new funds on Monday that nearly match the sizes launched about three years ago: a $750 million early-stage fund targeting Series A startups and a $200 million seed fund.\nThese funds were introduced after what has been a tumultuous period for the legendary firm. In 2021, Sequoia overhauled its structure into an evergreen main fund supported by strategy-specific “sub-funds,” primarily to enable the firm to retain stock in portfolio companies long after their IPO. The firm took a significant financial hit in late 2022, losing over $200 million when its investment in cryptocurrency exchange FTX blew up, followed by the 2023 separation from its India and China divisions.\nThe storied firm, which famously backed Airbnb, Google, Nvidia, and Stripe in their infancy, is putting recent challenges behind it and returning to its core purpose: investing in promising founders at the earliest stages of creation.\nBalkansky reinforced this mission: “Our ambition has always been and continues to be to identify these founders as early as possible; to roll up our sleeves and be a very active participant in their company-building journey.”\nWith AI startup valuations skyrocketing, Sequoia wants to use the new funds to invest in the most promising founders at the beginning of their startup-building journey. This strategy allows the firm to secure a low price while locking in a significant ownership stake.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis early-stage focus is even more crucial for the firm now. As valuations soar at an unprecedented pace, getting in early is the key to locking in a lower price and securing a substantial stake.\nThis approach is paying off: Sequoia’s seed and Series A investments in Clay, Harvey, n8n, Sierra, and Temporal have appreciated manyfold amid the AI boom.\nEven with its renowned Series A history, Balkansky made it clear that Sequoia aims to defend its legacy by investing even earlier: “We have an amazing track record and tradition to partner with companies at the very earliest stage, which today will be classified as a pre-seed.”\nHe highlighted the firm’s early conviction: Sequoia recently wrote the first check into security tester Xbow, AI reliability engineer Traversal, and DeepSeek alternative Reflection AI — all companies that have since raised significant capital at much higher valuations. Among the ways the firm has helped behind the scenes, it says it recruited a former Databricks CRO to Xbow’s board, connected Traversal with more than 30 potential customers, and arranged a meeting between Reflection AI and Nvidia’s Jensen Huang, leading directly to a $500 million investment from the chipmaker.\nEven with these recent successes, Sequoia is relentlessly focused on upholding its five-decade legacy as Silicon Valley’s top investor. To ensure this mindset persists, the firm’s newly renovated office features a wall where every investor handwrote this reminder: “We are only as good as our next investment.”\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Pinterest experiments with new AI-powered personalized boards",
    "url": "https://techcrunch.com/2025/10/27/pinterest-experiments-with-new-ai-powered-personalized-boards/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Pinterest_Stylesforyou.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:35:38.000Z",
    "description": "Pinterest announced on Monday new AI-powered upgrades to its boards to make them more personalized for users. These features include an AI-driven collage, “Styled for you,” that helps users create outfits...",
    "body": "\nPinterest announced on Monday new AI-powered upgrades to its boards to make them more personalized for users. These features include an AI-driven collage, “Styled for you,” that helps users create outfits from saved fashion Pins, and “Boards made for you,” which are personalized boards curated with AI. \n“Styled for you” collages allow users to combine different clothing and accessories to create new outfits tailored to their individual style preferences. By tapping an item in the collage, users can swipe through AI-recommended saved pins for mixing and matching.\nPinterest is also testing “Boards made for you,” personalized boards curated from a blend of editorial input and AI-powered suggestions. These boards —featuring trending styles, weekly outfit inspiration, and shoppable content — will be featured in users’ home feeds and in their inboxes. \nThe company is initially experimenting with the AI features in the U.S. and Canada. They’ll start rolling out in the next few months.\nImage Credits:Pinterest\nThe company says the aim of these AI features is to evolve Pinterest boards from mere organizational tools into a more personalized way to explore, shop, and find outfit inspiration. This initiative aligns with Pinterest’s goal to position itself as an “AI-enabled shopping assistant,” as indicated by the CEO during the company’s second-quarter earnings call. Pinterest has already integrated AI in various ways, including AI-driven recommendations and visual search.\nHowever, while the platform is introducing more AI features on the one hand, it’s also trying to keep AI-generated content off its platform on the other. In April, the company announced its plan to label AI-generated and AI-modified images. It also introduced controls that let users reduce the number of AI-generated Pins they see in their feed.\nIn addition to the new AI experiments, there will be new tabs that sort Pins into categories, accessible by viewing boards from user profiles. These updates are set to roll out globally in the coming months.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOne of the new tabs, called “Make It Yours,” will recommend fashion and home decor products based on a user’s saved Pins. The “More Ideas” tab will suggest related Pins across categories such as beauty, recipes, and art. Lastly, an “All Saves” tab will let users easily find all their previously saved Pins.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Workout app Ladder launches  nutrition-tracking experience",
    "url": "https://techcrunch.com/2025/10/27/workout-app-ladder-launches-nutrition-tracking-experience/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Nutrition-Main-Screen.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T11:30:00.000Z",
    "description": "As advanced AI models become better at understanding different types of input — such as text, voice, and images — and converting them into nutritional data, fitness apps that let people log their food using...",
    "body": "\nAs advanced AI models become better at understanding different types of input — such as text, voice, and images — and converting them into nutritional data, fitness apps that let people log their food using these methods have exploded in popularity. We have seen new startups like Alma and Cal AI — along with existing apps like LifeSum, Healthify, MyFitnessPal, and MyNetDiary — either launching new apps or adding new functionality around nutritional tracking.\nNow, strength training app Ladder is throwing its hat into the ring by launching its own calorie-tracking platform called Ladder Nutrition within the main app. Like other trackers, Ladder Nutrition allows you to input your food intake in any way: taking a picture, scanning a barcode, typing it in, or describing the food you had through voice. The app will estimate your macronutrients (proteins, carbohydrates, and fats) based on your input, and you can edit the portion sizes as well.\nLadder said that its advantage is that people are already tracking workouts through the Ladder app, with nutrition tracking their inputs (macros, calories)  and outputs (workouts) in one place.\nImage Credits:Ladder\nThe company said it uses a series of AI models for image recognition, ingredient identification, and calculating macros. It noted that by default, most AI food models are trained on U.S.-centric data, which means they may not accurately recognize international cuisines, so it partnered with a nutrition data provider to get accurate data for food from other parts of the world. This approach means that if one model fails to identify a dish or macros, another can step in.\nThe tracker also has a protein mode, which helps you track your daily protein intake. Ladder said that it has also included streaks, badges, and progress reminders to gamify the process of nutrition tracking and help people regularly log their food.\nLadder said that when it surveyed its members last year, the results showed that they wanted a nutrition tracker within the app, rather than having to use another app for it. This is why the company focused on shipping the nutrition tracking feature this year.\nImage Credits:Ladder\nThe company said it has been testing food tracking over the last month and that 70% of testers said that they intended to switch calorie tracking apps after using Ladder’s features.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Nutrition was the next logical step for Ladder, and our members were pleading with us for it,” Ladder CEO Greg Stewart told TechCrunch over email. “They wanted a simple, smarter way to connect what they eat with how they perform — and that’s exactly what Ladder Nutrition delivers.”\nIt’s just the start, Stewart continued. He said that in the future, Ladder will “build on this foundation with features that offer more prescriptive guidance — what to eat, how to fuel, and how to optimize nutrition based on individual training habits and goals continuously.”\nThe nutrition tracking feature is free for all Ladder members, who pay $29.99 per month or $179.99 a year. According to Ladder, the app has more than 300,000 paid members worldwide.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "New corporate espionage claims emerge, centered on two highly valued 401(k) admin startups",
    "url": "https://techcrunch.com/2025/10/27/new-corporate-espionage-claims-emerge-centered-on-two-highly-valued-401k-admin-startups/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/12/dissidentspyware.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T19:11:32.000Z",
    "description": "Another gripping allegation of corporate espionage has emerged from the profoundly boring world of employee onboarding platforms and 401(k) administration. All year, we’re been following the ongoing death...",
    "body": "\nAnother gripping allegation of corporate espionage has emerged from the profoundly boring world of employee onboarding platforms and 401(k) administration.\nAll year, we’re been following the ongoing death match between HR software titans Rippling and Deel, which are currently locked in a litigation featuring accusations of planted moles and systematic data theft. Now, as first spotted by Axios, comes Act Two: the 401(k) management unicorns, Human Interest and Guideline, squaring off in federal court with allegations so brazen that they’re embarrassing.\nHere’s a taste, plucked from Human Interest’s lawsuit against Guidewire, filed this month in Utah federal court: “We are going to tear apart HI. It’s going to be the easiest thing to do.”\nThat’s Brandon Sterri texting his brothers on January 29. According to the complaint, Brandon and his brother Brian were, at that moment, still drawing paychecks from Human Interest, still logging into their company-issued laptops every morning beneath reminders that access was “limited to authorized personnel,” and that they’d agreed “to protect confidential data.” Their third brother, Eirik, worked for the competition, Guideline.\nPer the lawsuit, filed by a law firm in Salt Lake City, the Sterri brothers didn’t just talk big. They allegedly called their operation the “Sterri Takeover,” a name revealing either remarkable hubris or a serious misunderstanding of how corporate espionage is supposed to work, which is to say, very, very quietly.\nThe complaint alleges a months-long scheme in which Brian and Brandon, working as junior inside sales representatives at Human Interest, systematically funneled their employer’s most sensitive intelligence, including partnership leads, customer data, and internal strategy documents, directly to Guideline. \nBut not just to anyone at Guideline; Human Interest claims the brothers were personally sharing it with the company’s chief executive, Kevin Busque, and its chief financial officer, Steven Wu.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nReached for comment earlier, a Guideline spokesperson sent the following statement: “Guideline believes allegations in this lawsuit are false and without merit. We are vigorously defending ourselves and we look forward to presenting the facts and showing that these claims are unfounded.”\nHuman Interest did not respond to TechCrunch’s request for comment.\nAccording to Human Interest’s complaint, two days after Brian Sterri resigned from Human Interest on February 24, he made a request that allegedly exposed the entire operation. “Got a big favor to ask,” he allegedly texted a former colleague named Castro, still employed at Human Interest. Then came the ask: “A screenshot of total lead flow for ISR team this month.”\nAccording to the complaint, Castro, perhaps understanding more than she let on, replied: “Am i allowed to ask why.” Brian responded with a grinning emoji.\nThe screenshot Brian wanted wasn’t just sensitive; it was, according to Human Interest, the crown jewels. Total lead flow represents the fundamental pool of potential clients, the critical determinant of growth trajectory and market penetration. It is information Human Interest has spent years and millions of dollars cultivating through proprietary business processes and partnerships with payroll providers. The kind of information that, in the wrong hands, creates what the lawsuit calls “a significant informational imbalance” and provides “considerable strategic advantage.”\nReading the complaint, it appears that Castro grasped the gravity of what Brian was asking and the transactional nature of the betrayal. “I’m down to play dirty for sure but you need to get me a job lol.”\nBrian, the lawsuit alleges, brazenly promised her employment at Guideline in exchange for the data. When Castro didn’t immediately deliver, Brian tried again the next morning: “I still need that favor.”\n“Brian you know I can’t do that,” Castro allegedly replied.\nAccording to the complaint, Brian didn’t stop there. He allegedly called and texted and texted and when Castro stopped responding, his wife McKenna reached out on his behalf. During conversations with other Human Interest employees, the complaint claims Brian admitted his purpose outright: He wanted the information because “Guideline wanted to know HI’s total lead flow.”\nThe complaint paints a picture of systematic infiltration. Before their resignations, the brothers allegedly downloaded documents with titles like “Leads Data” and emailed files from their work accounts to personal Gmail addresses —Brian’s, and his wife’s. By logging into personal email on company laptops, they could bypass Human Interest’s detection systems entirely.\nOn February 27, allegedly, the same day Castro shut him down, Brian reached out to another Human Interest employee, Chloe Garza, with whom the Sterris had “close personal and/or familial relationship,” per the complaint. The request: internal metrics from a Slack channel. Garza also refused: “Yea so I cannot send you anything HI related.”\nBrian’s response is telling as characterized in the complaint. Allegedly, in the same conversation, he wrote that “Mitch [another HI sales rep] would be the only person that could really give me the information GDL [Guideline] would want.” The complaint argues that the admission is right there, preserved in text.\nAfter Human Interest’s leadership held emergency meetings to remind employees of their confidentiality obligations, the complaint alleges, Brian mocked the effort. “lol Horne using fear tactics lmao,” he texted Castro. “Heard today scared a lot of people.”\nWhat elevates this from garden-variety corporate misbehavior to alleged racketeering is the alleged involvement at the top. Human Interest claims this wasn’t rogue employees gone wild but instead a coordinated operation with executive blessing.\nAfter Human Interest sent cease-and-desist letters in early March, it says, Eirik Sterri texted his brothers with an update. He’d spoken with Andrew Conley, Guideline’s Senior Vice President of Sales. The message: “Andrew is great. Also everyone has your backs for real. Everyone has expressed how fired up they are about the situation. It will blow over and all of us will be so fired up.”\nThen came what Human Interest characterizes as extortion. Guideline had agreed to be acquired by Gusto, the $9.3 billion payroll giant, for what TechCrunch reported earlier this month to be a $600 million deal. As part of the transaction, Guideline planned to divest certain assets and accounts associated with rival payroll companies. When Human Interest inquired about purchasing some of those assets, Guideline’s CFO allegedly delivered an ultimatum: drop the lawsuit, or the deal is off.\nTechCrunch’s Marina Temkin reported that Gusto was looking to sell off Guideline’s accounts associated with rival payroll companies, per several sources, but Gusto declined to comment on those divestment plans at the time. \nTechCrunch reached out to Gusto again earlier today. The biggest question, of course, is whether it plans to go through with its Guideline acquisition. The company has not yet commented.\nNaturally, much is being made in the startup ecosystem about the HR software space becoming a theater of corporate warfare, with Rippling and Deel battling over allegations that include planted spies, and RICO violations, among other things. \nAbsurd as it sounds, this is serious business for Rippling and Deel, and the stakes are high, if not higher, for Human Interest, for the three Sterri brothers, and for Guidelines and its executive team, among others. \nHuman Interest has raised over $700 million at a $1.4 billion valuation from investors including SoftBank, Baillie Gifford, and TPG. Guideline raised $340 million, hitting a $1.2 billion valuation in 2021 with backing from General Atlantic and Felicis.\n"
  },
  {
    "title": "Biotech Nephrogen combines AI and gene therapy to reverse kidney disease — check it out at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/27/biotech-nephrogen-combines-ai-and-gene-therapy-to-reverse-kidney-disease-check-it-out-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/07/gettyimages-450853983.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T18:15:00.000Z",
    "description": "When Demetri Maxim was seven years old, his mother’s kidneys stopped working. She was put on dialysis, which meant that she had to go to the hospital four times a week to have her blood filtered by a machine...",
    "body": "\nWhen Demetri Maxim was seven years old, his mother’s kidneys stopped working. She was put on dialysis, which meant that she had to go to the hospital four times a week to have her blood filtered by a machine since her own kidneys could no longer function independently.\nTwo years later, Maxim’s mother received a kidney transplant. Although the surgery was successful and allowed her to lead a relatively normal life, it wasn’t the end of his family’s struggle with kidney disease. It turned out that Maxim had inherited the disease, Polycystic Kidney Disease (PKD), from her.\nAbout one in seven Americans has Chronic Kidney Disease (CKD), and about 10% of those CKD cases are due to a genetic condition. Maxim has been obsessed with finding a cure for himself and others ever since he was in high school.\nMaxim’s “Aha!” moment occurred in 2021, when Nature Magazine published a study proving that PKD is reversible in mice using CRISPR technology. At the time, he was pursuing his graduate degree in computational biology at Stanford while simultaneously engaging in kidney research under his professor, Vivek Bhalla.\nAlthough Maxim was convinced that gene therapy could reverse PKD, the biggest hurdle was creating a mechanism to deliver the drugs directly to the diseased cells.\nTo solve this critical challenge, he founded Nephrogen in 2022, a biotech startup that uses AI and advanced screening to develop a specialized delivery system for safely getting gene-editing medicines into the exact cells in the kidney. Nephrogen is one of the 20 finalists in Startup Battlefield, part of TechCrunch Disrupt 2025. \nAfter three years of development, Maxim claims Nephrogen has succeeded in creating a delivery mechanism that is 100 times more efficient at transporting medicine to the kidney than the “vehicles” currently approved by the FDA.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe next major step for Nephrogen is to advance its novel delivery mechanism, along with a drug the startup developed, into clinical studies, which Maxim anticipates will begin in 2027. To support this, the company is raising a $4 million seed round.\nMaxim intends to participate in the clinical study himself, given the significant challenges he faces living with PKD.\n“You get a lot of back pain. You have to go to the hospital a lot. You are on this drug that’s supposed to slow the progression, but it doesn’t really do anything. Just makes you pee all the time,” he said, adding that there is always a risk that his disease will progress to require dialysis.\nThis makes Nephrogen’s approach all the more critical, as its success could cure him of PKD entirely.\nIf you want to hear from Nephrogen firsthand, and see dozens of additional pitches, attend valuable workshops, and make the connections that drive business results, head here to learn more about this year’s Disrupt, held October 27 to 29 in San Francisco. \n\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "COI Energy solves a conundrum: Letting businesses sell unused electricity — catch it at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/27/coi-energy-solves-a-conundrum-letting-businesses-sell-unused-electricity-catch-it-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/COI-Energy-founder-SaLisa-Berrien.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T18:15:00.000Z",
    "description": "When it comes to supplying electricity to large enterprises with multi-building campuses, the allocation system is archaic. Unlike homeowners, who pay for what they actually use, campuses buy a standard...",
    "body": "\nWhen it comes to supplying electricity to large enterprises with multi-building campuses, the allocation system is archaic. Unlike homeowners, who pay for what they actually use, campuses buy a standard monthly capacity. This capacity must, by common-sense necessity, be based on max usage needs. This is true even if the company only consumes such max usage rarely, like a single busy season.\nThat was a situation that bothered the hell out of COI Energy founder and CEO, SaLisa Berrien. After earning her degree in mechanical engineering (and later an MBA), she spent 25 years as an energy engineer at major utility companies like PECO, Con Edison, and Exelon, as well as at a few clean energy startups.\nBerrien chose this field because, as a child, there were times when her parents couldn’t pay their electric bill. “We were in the dark a lot. And as a kid, my self-esteem was low,” she told TechCrunch. Other kids who knew her situation teased her.\nSo when she got her degree and took a job with an electric company, “All my friends were like, ‘You’re crazy. That is a stagnated field. It’s a white, male-dominated, older-men field. Why are you doing this?’ And for me, it was personal, because I knew what it felt like being a kid,” she said. Berrien wanted to make electricity more efficient, more affordable, more available so no child ever went without.\nShe worked on customer operations, smart grids, clean energy programs.\n“As an engineer, I would go in and make recommendations on how they could improve the energy performance of their buildings, how they can eliminate bottlenecks on production lines,” Berrien said.\nShe learned how to use big data to optimize energy efficiency. But no one was addressing the basic problem: Companies were reserving, and paying for, far more energy than they used.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nCommercial customers continually asked her why they were being overcharged. “I agree,” she said. “Why can’t you just pay on demand for what you’re using?”\nBerrien’s answer resulted in three patents (and counting) and founding COI Energy on that tech, assembling a team that includes building management, energy engineers, and a former energy exec. She hired people skilled in everything from regulation to pricing.\nCOI’s solution is a marketplace where enterprises within the same utility company can sell some of their energy allotment when COI’s data predicts they won’t need it. COI is a Startup Battlefield Top 20 finalist and will be pitching its tech at TechCrunch Disrupt 2025, this week in San Francisco.\nCOI installs a patented energy gateway at every customer site to measure energy usage. It ties into the building’s systems and into SCADA systems. It is hardware-agnostic, meaning it can work with any existing utility or building energy system, Berrien said. After collecting data for a period, the platform predicts how much electricity a company will truly require. “We can predict out 90 days,” she said.\nThe enterprise can then determine how much of the unused energy it would like to release. COI pays the businesses for that capacity, and buyers on the marketplace pay COI to obtain it. “If a customer gives us 100 kilowatts, we will pay them for that 100 kilowatts, and then the buyers would buy that from us.”\nCOI is still in its pre-seed stage, having raised $3.5 million from investors like former Talen Energy exec Paul Farr, Morgan Stanley Inclusive and Sustainable Ventures, Kachuwa Impact Fund, Chloe Capital, and some crowdfunding on Republic.\nThe startup is, however, already generating revenue through five pilot customers, all of whom have a minimum of 50 buildings. It is operating in California, Florida, Massachusetts, and New York, and has a waitlist. Plus, Berrien said, COI is in talks to be a solution provider to Switzerland as it enacts a national energy policy where businesses and homes can share capacity, starting in 2026.\nMoreover — remembering her plight as a little girl — Berrien’s startup has dedicated 1% of the savings that the businesses earn on the platform to be donated to nonprofit organizations that help the underprivileged with their energy needs. These are organizations that help pay bills, provide weatherization, and offer energy programs like solar.\n“We’re paying it forward with what we call Kilowatt for Good,” Berrien said.\nHer goal is to offer tech that helps overwhelmed energy systems now. “Instead of wasting capacity, you’re sharing it. So we’re making the planet better. We’re making our bottom lines better. And then at the same time, we’re helping and uplifting our communities,” she said.\nIf you want to learn more about COI Energy from the company itself — while also checking out dozens of others, hearing their pitches, and listening to guest speakers on four different stages — join us at Disrupt, Monday to Wednesday, in San Francisco. Learn more here.  \n\n"
  },
  {
    "title": "Miraqules will showcase its blood clotting technology at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/27/miraqules-will-showcase-its-blood-clotting-technology-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2015/02/shutterstock_135245900.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T18:15:00.000Z",
    "description": "Miraqules co-founder and CEO Sabir Hossain always knew he wanted to follow in his father’s footsteps and run his own business. But he never thought he’d launch a biotech company built around a technology that...",
    "body": "\nMiraqules co-founder and CEO Sabir Hossain always knew he wanted to follow in his father’s footsteps and run his own business. But he never thought he’d launch a biotech company built around a technology that would have been able to help his father after a near-tragic accident years earlier left him almost bleeding to death.\nBengaluru-based Miraqules developed a nanotechnology in powder form that mimics blood clotting proteins. The blood clotting powder rapidly produces fibrous compounds at room temperature that are a high volume to ratio and can absorb blood quickly when applied.\n“This is a product that will give you feedback instantly,” Hossain told TechCrunch. “If there is a person bleeding, you apply it, and the bleeding stops. This whole thing happens within one or two minutes.”\nMiraqules is a Top 20 Startup Battlefield finalist and will be presenting this technology on stage at TechCrunch Disrupt 2025, this week in San Francisco.\nHossain said he developed the technology almost by accident.\nHe went to grad school for biomedical engineering and started working in a research lab focused on biomaterials where his job was essentially to mimic the work of a doctorate student.\n“I was really bad at that, actually,” Hossain said. “Her job was to create 3D structures that will help in bone tissue growth, that could help in bone generation. Every time I was synthesizing that material, it was getting dismantled.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOne day he took the dismantled particles and ground it into a powder. He brought this powder to a group working on blood clotting that was struggling to mix their solution properly to see if it could help — and it worked.\n“It clotted the whole blood within maybe five to 10 seconds. I rushed to my professor and then from there we started to think about what made it happen,” Hossain said. “We came up with the completely new process of combining off-the-shelf materials into a nanomaterial that mimics blood clotting proteins.”\nHossain then paired up with his childhood friend, Mubeen Midda, and they started trying to develop the technology so it could be taken out of the lab — with as little funding as possible.\nSince then, the company has been able to secure 11 patents across seven different countries, including India, the United States, and Israel.\nMiraqules’ tech is already being piloted in a trauma care center in India, and the company expects to get its regulatory clearance in India within the next few months. It also is on track to receive clearance from the U.S. Food and Drug Administration in 2026.\n“One thing we did from the beginning, we directly went to the U.S. FDA, there is something called pre-submission. We tried to get their feedback on what other necessary things that we need to do to get this product approved, that helped us a lot.”\nThe company has reached these milestones with less than $700,000 in capital raised, largely from grants.\nMiraqules is looking to ramp up deployment and pilot programs heading into next year. It has already received potential interest from 10 different hospital chains in India and the Israeli Defense Forces.\nIf you want to learn from Miraqules firsthand, and see dozens of additional pitches, attend valuable workshops, and make the connections that drive business results, head here to learn more about this year’s Disrupt, held October 27 to 29 in San Francisco. \n\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  }
]