[
  {
    "title": "AI layoffs or ‘AI-washing’?",
    "url": "https://techcrunch.com/2026/02/01/ai-layoffs-or-ai-washing/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2247697590.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-01T22:15:53.000Z",
    "description": "In Brief Posted: 2:15 PM PST · February 1, 2026  Image Credits:J Studios / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  How many of the companies with recent layoffs are truly adapting their...",
    "body": "\nIn Brief\nPosted:\n2:15 PM PST · February 1, 2026\n\nImage Credits:J Studios / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nHow many of the companies with recent layoffs are truly adapting their workforces to the efficiencies and challenges of artificial intelligence? And how many of them were just using AI as an excuse to cover other problems?\nThat’s the question posed by a New York Times article on the trend of “AI-washing,” where companies will cite AI as the reason for layoffs that might actually be caused by other factors, like over-hiring during the pandemic.\nAI was the stated reason for more than 50,000 layoffs in 2025, with Amazon and Pinterest among the tech companies who blamed the technology for recent cuts.\nBut a Forrester report published in January argued, “Many companies announcing A.I.-related layoffs do not have mature, vetted A.I. applications ready to fill those roles, highlighting a trend of ‘A.I.-washing’ — attributing financially motivated cuts to future A.I. implementation.”\nMolly Kinder, a senior research fellow at the Brookings Institute, noted that saying layoffs were caused by AI is a “very investor-friendly message,” especially when the alternative might mean admitting, “The business is ailing.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n"
  },
  {
    "title": "Waymo reportedly raising a $16B funding round",
    "url": "https://techcrunch.com/2026/01/31/waymo-reportedly-raising-a-16-billion-funding-round/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/SF_WAYMO-FREEWAY_SIDE.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-31T21:56:22.000Z",
    "description": "In Brief Posted: 1:56 PM PST · January 31, 2026  Image Credits:Waymo  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Waymo has nearly finalized a new $16 billion funding round that will value the robotaxi company...",
    "body": "\nIn Brief\nPosted:\n1:56 PM PST · January 31, 2026\n\nImage Credits:Waymo\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWaymo has nearly finalized a new $16 billion funding round that will value the robotaxi company at $110 billion, according to the Financial Times.\nMore than three-fourths of that funding will reportedly come from a source close to home — Alphabet, where Waymo is a subsidiary. (The company was incubated as part of Alphabet’s “moonshot factory” X.)\nThe FT reports that Waymo is bringing on new investors Dragoneer, Sequoia Capital, and DST Global, with existing backers Andreessen Horowitz and Abu Dhabi sovereign fund Mubadala also participating in the round.\nWhen contacted by TechCrunch, a company spokesperson said in a statement, “While we don’t comment on private financial matters, our trajectory is clear: with over 20 million trips completed, we are focused on the safety-led operational excellence and technological leadership required to meet the vast demand for autonomous mobility.”\nThe company is expanding quickly, including with a recent launch in Miami. That growth has come with some challenges, including a number of robotaxis that stalled at traffic lights during a widespread San Francisco blackout.\nWaymo has more than $350 million in annual recurring revenue, according to the FT. The company last raised a $5.6 billion Series C in 2024, valuing the company at $45 billion.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Transportation\n\n"
  },
  {
    "title": "Informant told FBI that Jeffrey Epstein had a ‘personal hacker’",
    "url": "https://techcrunch.com/2026/01/30/informant-told-fbi-that-jeffrey-epstein-had-a-personal-hacker/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/getty-images-jeffrey-epstein.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-30T22:04:00.000Z",
    "description": "The hacker allegedly developed zero-day exploits and offensive cyber tools and sold them to several countries, including an unnamed central African government, the U.K., and the United States.",
    "body": "\nIn Brief\nPosted:\n2:04 PM PST · January 30, 2026\n\nImage Credits:Sandi Bachom / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nA confidential informant told the FBI in 2017 that Jeffrey Epstein had a “personal hacker,” according to a document released by the Department of Justice on Friday.\nThe document, which was released as part of the Justice Department’s legally required effort to publish documents related to its investigation into the late sex offender, does not identify who the alleged hacker was, but does include several details about them. \nAccording to the informant, the hacker was an Italian born in the southern region of Calabria and specialized in finding vulnerabilities in iOS, BlackBerry devices, and the Firefox browser. \nThe hacker allegedly developed zero-day exploits and offensive cyber tools and sold them to several countries, including an unnamed central African government, the U.K., and the United States. The informant told the FBI that Epstein’s hacker sold a zero-day to Hezbollah, which paid him with “a trunk of cash.”  \nPer the informant, the hacker “was very good at finding vulnerabilities.”\n\n\t\t\tContact Us\n\t\t\tDo you have more information about Jeffrey Epstein’s “personal hacker”? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, or email.\t\t\nIt’s important to note that this document contains allegations from only the informant, not from the FBI directly, so it’s unclear how trustworthy the information and allegations are. \nThe FBI declined to comment when reached by TechCrunch. The Justice Department did not respond to a request for comment. \nOn Friday, the Justice Department announced the release of 3.5 million additional pages from the Epstein files. The newly released files, some heavily redacted, include more than 2,000 videos and 180,000 images. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Security\n\n"
  },
  {
    "title": "SpaceX seeks federal approval to launch 1 million solar-powered satellite data centers",
    "url": "https://techcrunch.com/2026/01/31/spacex-seeks-federal-approval-to-launch-1-million-solar-powered-satellite-data-centers/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2074390033.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-31T21:27:25.000Z",
    "description": "In Brief Posted: 1:27 PM PST · January 31, 2026  Image Credits:CHANDAN KHANNA/AFP / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  SpaceX has filed a request with the Federal Communications...",
    "body": "\nIn Brief\nPosted:\n1:27 PM PST · January 31, 2026\n\nImage Credits:CHANDAN KHANNA/AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSpaceX has filed a request with the Federal Communications Commission to launch a constellation of up to 1 million solar-powered satellites that it said will serve as data centers for artificial intelligence.\nThe company’s filing lays out a grandiose vision, not just describing these planned satellites as “the most efficient way to meet the accelerating demand for AI computing power” but also framing them as “a first step towards becoming a Kardashev II-level civilization — one that can harness the Sun’s full power” while also  “ensuring humanity’s multi-planetary future amongst the stars.”\nThe Verge argued that the 1 million satellite number is unlikely to be approved outright and is probably meant as a starting point for negotiations. The FCC recently gave SpaceX permission to launch an additional 7,500 Starlink satellites, but said it would “defer authorization on the remaining 14,988” proposed satellites.\nThere are currently around man-made 15,000 satellites orbiting the Earth, according to the European Space Agency, and they’re already creating issues with pollution and debris.\nThe filing also comes as Amazon — citing a lack of rockets — is seeking an extension on an FCC deadline to have more than 1,600 satellites in orbit. Meanwhile, SpaceX is reportedly considering a merger with two of Elon Musk’s other companies, Tesla and xAI (which already merged with X), ahead of going public.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Space\n\n"
  },
  {
    "title": "Indonesia ‘conditionally’ lifts ban on Grok",
    "url": "https://techcrunch.com/2026/02/01/indonesia-conditionally-lifts-ban-on-grok/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-01T17:20:00.000Z",
    "description": "Image Credits:Klaudia Radecka/NurPhoto / Getty Images\t \t \t\t\t\t\t\t9:20 AM PST · February 1, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Indonesia has followed Malaysia and the Philippines in lifting a ban on xAI’s chatbot Grok. The...",
    "body": "\n\t\n\t\tImage Credits:Klaudia Radecka/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t9:20 AM PST · February 1, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nIndonesia has followed Malaysia and the Philippines in lifting a ban on xAI’s chatbot Grok.\nThe Southeast Asian countries banned Grok after it was used to create a flood of nonconsensual, sexualized imagery on X (now a subsidiary of xAI), including images of real women and minors. In late December and January, Grok was used to create at least 1.8 million sexualized images of women, according to separate analyses by The New York Times and the Center for Countering Digital Hate.\nIn a statement, Indonesia’s Ministry of Communication and Digital Affairs said that it was lifting the ban after X sent a letter “outlining concrete steps for service improvements and the prevention of misuse” (translation via The New York Times). \nAlexander Sabar, the ministry’s director general of digital space monitoring, said the ban is only being lifted “conditionally” and could be reinstated if “further violations are discovered.”\nMalaysia and the Philippines lifted their bans on January 23.\nGrok’s deepfakes have spurred criticism and investigations — but only a few outright bans — from governments around the world. In the United States, California Attorney General Rob Bonta said his office was investigating xAI and had sent a cease-and-desist letter ordering the company to take immediate action to end the production of these images.\nxAI appears to have taken some steps to restrict Grok’s capabilities, including limiting its AI image generation feature to paying subscribers on X. CEO Elon Musk has insisted, “Anyone using Grok to make illegal content will suffer the same consequences as if they upload illegal content” and said he is “not aware of any naked underage images generated by Grok.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nDocuments released by the Justice Department on Friday around the notorious sex offender Jeffrey Epstein include at least 16 emails between Musk and Epstein in 2012 and 2013, with Musk asking to visit Epstein’s Caribbean island and wondering about the “wildest party on your island.” Epstein pleaded guilty to procuring an underage girl for prostitution in 2008.\nxAI, meanwhile, is reportedly in talks to merge with two of Musk’s other companies, SpaceX and Tesla, ahead of a SpaceX IPO.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Nvidia CEO pushes back against report that his company’s $100B OpenAI investment has stalled",
    "url": "https://techcrunch.com/2026/01/31/nvidia-ceo-pushes-back-against-report-that-his-companys-100b-openai-investment-has-stalled/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2205754389.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-31T17:54:12.000Z",
    "description": "Image Credits:Justin Sullivan\t \t \t\t\t\t\t\t9:54 AM PST · January 31, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Nvidia CEO Jensen Huang said Saturday that a recent report of friction between his company and OpenAI was...",
    "body": "\n\t\n\t\tImage Credits:Justin Sullivan\t\n\t\n\t\t\t\t\t\t9:54 AM PST · January 31, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nNvidia CEO Jensen Huang said Saturday that a recent report of friction between his company and OpenAI was “nonsense.”\nHuang’s comments came after The Wall Street Journal published a story late Friday claiming that Nvidia was looking to scale back its investment in OpenAI. The two companies announced a plan in September through which Nvidia would invest up to $100 billion in OpenAI and also build 10 gigawatts of computing infrastructure for the AI company.\nHowever, the WSJ said Huang has begun emphasizing that the deal is nonbinding, and that he’s also privately criticized OpenAI’s business strategy and expressed concerns about competitors like Anthropic and Google.\nIn addition, the WSJ reported that the two companies are rethinking their relationship — though that doesn’t mean cutting things off entirely, with recent discussions reportedly focusing on an equity investment of a mere tens of billions of dollars from Nvidia.\nAn OpenAI spokesperson told the WSJ that the companies are “actively working through the details of our partnership,” adding that Nvidia “has underpinned our breakthroughs from the start, powers our systems today, and will remain central as we scale what comes next.”\nAccording to Bloomberg, reporters asked Huang about the report during a visit to Taipei. In response, he insisted that Nvidia will “definitely participate” in OpenAI’s latest funding round “because it’s such a good investment.”\n“We will invest a great deal of money,” Huang said. “I believe in OpenAI. The work that they do is incredible. They’re one of the most consequential companies of our time.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nHe apparently declined to specify how much Nvidia would be investing, instead saying, “Let [OpenAI CEO Sam Altman] announce how much he’s going to raise — it’s for him to decide.”\nThe WSJ reported in December that OpenAI is looking to raise a $100 billion funding round, while The New York Times said this week that Nvidia, Amazon, Microsoft, and SoftBank are all discussing potential investments.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "OnlyFans considering selling majority stake to Architect Capital",
    "url": "https://techcrunch.com/2026/01/30/onlyfans-considering-selling-majority-stake-to-architect-capital/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2147980350-e1714562288264.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-30T23:54:09.000Z",
    "description": "Image Credits:Nikolas Kokovlis/NurPhoto / Getty Images\t \t \t\t\t\t\t\t3:54 PM PST · January 30, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t OnlyFans — the massive adult creator network where performers and influencers sell...",
    "body": "\n\t\n\t\tImage Credits:Nikolas Kokovlis/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t3:54 PM PST · January 30, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nOnlyFans — the massive adult creator network where performers and influencers sell subscription-based content directly to fans — is considering selling a majority stake of its business to investment firm Architect Capital, a source close to the deal told TechCrunch. The deal would value the platform at $5.5 billion.\nThe source said that of that $5.5 billion, $3.5 billion would be equity and $2 billion would be debt. Under those terms, Architect would assume a 60% stake in the business. The two parties are in exclusivity, meaning that OnlyFans is barred from negotiating with other potential buyers for a set period of time. It’s unclear what the timeline for completing the deal might be. The negotiations were previously reported by The Wall Street Journal.\nTechCrunch reached out to Architect Capital for comment. \nThis isn’t the first time in recent memory that OnlyFans has been in talks to sell off its business. Last year, the New York Post reported that Leonid Radvinsky, the billionaire owner of the site, was looking to “cash out,” and was courting potential buyers. Subsequent reporting showed that the platform’s parent company, Fenix International Ltd., was in talks with a U.S.-based investor group led by the Los Angeles-based investment firm Forest Road Company. It’s unclear what happened to those discussions, although the source told TechCrunch that there had been a number of interested parties since OnlyFans announced its desire to sell a majority stake.\nThe potential business partner in this particular deal, Architect, launched in 2021 as an asset-based lender — a firm that provides loans secured by company assets — that looks to partner with early-stage startups.\nOnlyFans maintains that it’s not a pornography website, despite the fact that a majority of the creators on it produce adult content. A British firm, the site was founded in 2016 by Tim Stokely, who also initially served as its CEO. Stokely sold a majority stake of the site’s parent company, Fenix International, to Radvinsky in 2018. Over the years, it has suffered from a variety of legal controversies, including lawsuits accusing the site of profiting off of abusive videos.\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tLucas is a senior writer at TechCrunch, where he covers artificial intelligence, consumer tech, and startups. He previously covered AI and cybersecurity at Gizmodo. \nYou can contact Lucas by emailing lucas.ropek@techcrunch.com.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "TikTok says its services are restored after the outage",
    "url": "https://techcrunch.com/2026/02/01/tiktok-says-its-services-are-restored-after-the-outage/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2193244774.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-02T06:38:29.000Z",
    "description": "Image Credits:Jaap Arriens/NurPhoto / Getty Images\t \t \t\t\t\t\t\t10:38 PM PST · February 1, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t TikTok, which is under new ownership in the U.S., said Sunday that it has restored service after...",
    "body": "\n\t\n\t\tImage Credits:Jaap Arriens/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t10:38 PM PST · February 1, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nTikTok, which is under new ownership in the U.S., said Sunday that it has restored service after outages last week that marred user experiences. The social network has over 220 million users in the U.S.\nThe company blamed last week’s snowstorm, which caused an outage at an Oracle-operated data center responsible for TikTok operations.\n“We have successfully restored TikTok back to normal after a significant outage caused by winter weather took down a primary U.S. data center site operated by Oracle. The winter storm led to a power outage which caused network and storage issues at the site and impacted tens of thousands of servers that help keep TikTok running in the U.S. This affected many of TikTok’s core features—from content posting and discovery to the real-time display of video likes and view counts,” the company said in a post on X.\n\nIn January, the U.S. finalized the deal to create a separate entity for TikTok. A U.S.-based investor consortium called TikTok USDS took a controlling 80% stake, with the remaining 20% ownership held by ByteDance.\nFollowing the deal finalization — which coincided with the snowstorm — users experienced glitches in features like posting, searching within the app, slower load times, and time-outs. TikTok noted that creators might see zero views on their posts until the problem was resolved. Later, the company said that it was working on solving the issue, but outages persisted, and users faced problems with posting content.\nTikTok’s transition to a new ownership structure, paired with app snafus and user experience glitches, was beneficial for some other social networks. The Mark Cuban-backed short video app Skylight, which is built on the AT protocol, saw its user base soar to more than 380,000 users in the week the deal was finalized. Upscrolled, a social network by Palestinian-Jordanian-Australian technologist Issam Hijazi, also climbed in App Store rankings to reach the second spot in the social media category in the U.S. The app was downloaded 41,000 times within days of the TikTok deal’s finalization, according to analyst firm AppFigures.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Amazon’s ‘Melania’ documentary makes $7M on opening weekend",
    "url": "https://techcrunch.com/2026/02/01/amazons-melania-documentary-makes-7m-on-opening-weekend/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2202598378.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-01T19:16:27.000Z",
    "description": "“Melania,” a documentary about First Lady Melania Trump, is exceeding box office expectations, with Sunday estimates suggesting it will make $7.04 million on its opening weekend. The documentary is coming in...",
    "body": "\n“Melania,” a documentary about First Lady Melania Trump, is exceeding box office expectations, with Sunday estimates suggesting it will make $7.04 million on its opening weekend.\nThe documentary is coming in third overall for the weekend, behind the Sam Raimi-directed thriller “Send Help” ($20 million) and “Iron Lung” ($17.8 million), a video game adaptation from YouTuber Mark Fischbach (better known as Markiplier).\nAmazon paid $40 million to acquire “Melania” and is reportedly spending $35 million to promote it. So even though the documentary is outperforming pre-release estimates predicting a $3 to $5 million opening weekend, it’s unlikely to make a profit in theaters.\nAmazon’s bid came in $26 million ahead of the next highest bidder, Disney, leading critics to suggest the deal had less to do with the film’s box office potential and more with winning over the Trump administration. Veteran film executive Ted Hope, who worked at Amazon from 2015 to 2020, told The New York Times that the film “has to be the most expensive documentary ever made that didn’t involve music licensing.”\n“How can it not be equated with currying favor or an outright bribe?” Hope said. “How can that not be the case?”\nThis is the first film directed by Brett Ratner since 2017, when multiple women accused him of sexual harassment and misconduct. (Ratner has denied those accusations.) Rolling Stone reports that two-thirds of the “Melania”‘s New York crew asked not to be formally credited in the film.\nWhile Apple CEO Tim Cook attended a preview screening of “Melania” at the White House last weekend, “Melania” was not screened in advance for critics, and the subsequent reviews have been brutal. The documentary currently sits at 7% on review aggregator Metacritic, indicating “overwhelming dislike,” and at 10% on Rotten Tomatoes.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nNew York Times film critic Manohla Dargis described it as “a very circumscribed and carefully stage-managed chronicle of Mrs. Trump’s day-to-day life” during the 20 days before President Trump’s 2025 inauguration.\nIn a statement, Amazon MGM’s head of domestic theatrical distribution Kevin Wilson described this weekend as “an important first step in what we see as a long-tail lifecycle for both the film and the forthcoming docu-series,” which he predicted will have a “significant life” on Amazon’s Prime streaming service.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Meet the new European unicorns of 2026",
    "url": "https://techcrunch.com/2026/01/31/meet-the-new-european-unicorns-of-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1464151513.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-01T07:00:00.000Z",
    "description": "January was such a long month that it has already brought us five fresh European unicorns: from Belgium to Ukraine, several tech startups raised funding at valuations above the $1 billion threshold. But...",
    "body": "\nJanuary was such a long month that it has already brought us five fresh European unicorns: from Belgium to Ukraine, several tech startups raised funding at valuations above the $1 billion threshold.\nBut before we take a closer look at who joined the club, two caveats.\nFirst: This count includes startups that may be incorporated elsewhere but have their roots or a large part of their team in Europe. Until a pan-European corporate structure exists (often called “EU Inc”), this split will remain common — and we’ve decided to overlook it. Take Lovable, which is incorporated in Delaware but cannot be dissociated from Stockholm’s startup scene.\nSecond: valuation doesn’t equal commercial success, and it is too early to tell whether all of these companies will achieve the kind of traction that Lovable has, with the company recently crossing $300 million in annual recurring revenue. But in the current climate, the fact that VCs were willing to invest in them at unicorn valuations is a strong signal of where the appetite is. \nWith these caveats out of the way, let’s dive in.\nAikido \nBelgium-based cybersecurity startup Aikido Security reached unicorn status with its $60 million Series B funding round. Valuing the company at $1 billion, the round was led by DST Global, with participation from PSG Equity, Singular, Notion Capital, and others.\nAccording to a press release, the funding will help Aikido enhance its platform, which was built to unify security across the entire software lifecycle and is already used by more than 100,000 teams globally. The company also reported “five-times revenue growth and nearly three-times customer growth” over the last year.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn a blog post, the startup celebrated this milestone and its significance. According to its team, “in an industry dominated by Palo Alto and Tel Aviv heavyweights, Aikido shows that Europe can build a world-class software security company and win globally.”\nCast AI \nCloud optimization company Cast AI is headquartered in Florida, but has Lithuanian roots and a major office in Vilnius — which explains why many now consider it to have become Lithuania’s fifth unicorn.\nCast AI’s valuation now exceeds $1 billion following a strategic investment from Pacific Alliance Ventures (PAV), the U.S.-based corporate venture arm of Korean conglomerate Shinsegae Group. In April 2025, Cast AI raised a $108 million Series C that had reportedly already brought the company close to unicorn territory.\nAlongside its latest funding round, the company also introduced OMNI Compute for AI, which aims to help users deploy more AI workloads on fewer GPUs and remove regional capacity constraints.\nHarmattan AI \nFrench defense tech company Harmattan AI was only founded in 2024, but is already worth $1.4 billion, according to its latest funding round. The $200 million Series B was led by Dassault Aviation, maker of the Rafale fighter jets, and also ties into a broader partnership.\nBefore securing this key partner, Harmattan AI had already signed agreements with the French and British ministries of defense and with Ukrainian drone maker Skyeton, amid growing appetite for autonomous defense aircraft.\nOsapiens \nGerman ESG software firm Osapiens raised a $100 million Series C led by Decarbonization Partners, a joint venture between BlackRock and Temasek, which valued the company at over $1.1 billion.\nFounded in Mannheim in 2018, Osapiens now has more than 2,400 customers worldwide, including large multinational companies that rely on its platforms and tools for sustainability reporting and data compliance, but also to mitigate supply chain risks.\nPreply\nThe 14-year-old language learning marketplace Preply is now a unicorn valued at $1.2 billion — a milestone that also embodies Ukrainian resilience. The edtech company was founded in the United States, but its founders are Ukrainian and supporters of their home country, where Preply has a team of 150 employees.\nAccording to its CEO, Kirill Bigai, who believes in AI-enhanced learning, proceeds from the $150 million Series D round will help the startup hire more AI talent across its four offices — now located in Barcelona, London, New York, and Kyiv.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "a16z partner Kofi Ampadu to leave firm after TxO program pause",
    "url": "https://techcrunch.com/2026/01/30/a16z-partner-kofi-ampadu-to-leave-firm-after-txo-program-pause/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/a16z-Andreessen-Horowitz.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-31T01:23:12.000Z",
    "description": "Ampadu's departure perhaps signals the end of the TxO chapter. The fund and program focused on supporting underserved founders by providing access to tech networks and investment capital through a donor-advised fund.",
    "body": "\n\t\n\t\tImage Credits:Thomas Fuller/SOPA Images/LightRocket / Getty Images\t\n\t\n\t\t\t\t\t\t5:23 PM PST · January 30, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nKofi Ampadu, the partner at a16z who led the firm’s Talent x Opportunity (TxO) fund and program, has left the firm, according to an email he sent to staff that TechCrunch obtained. This comes months after the firm paused TxO and laid off most of its staff. \n“During my time at the firm, I was deeply grateful for the opportunity and the trust to lead this work,” Ampadu wrote in the email, sent Friday afternoon, with the subject line “Closing My a16z Chapter.” \n“Identifying out-of-network entrepreneurs and supporting them as they sharpened their ideas, raised capital, and grew into confident leaders was one of the most meaningful experiences of my career,” he wrote.\nAmpadu led the program, which launched in 2020, for over four years until its pause last November, taking over for the initial leader, Nait Jones. Afterward, Ampadu seems to have worked at a16z’s latest accelerator, Speedrun.\nAmpadu’s departure perhaps signals the end of the TxO chapter. The fund and program focused on supporting underserved founders by providing access to tech networks and investment capital through a donor-advised fund. Though some founders spoke highly of the program, others criticized the controversial donor-advised structure. The program also launched a grant program in 2024 to provide $50,000 to nonprofits that help diverse founders.\nIts last cohort was in March 2025, and its indefinite pause came as many top tech names reframe, cut, or eliminate prior public commitments to diversity, equity, and inclusion. We’ve reached out to a16z and Ampadu for comment. His full note below:\n\nI moved to the United States three months before my 11th birthday. One month later, I started 6th grade in a school more than 5,000 miles from my home, my friends, and everything familiar. Recently, my mom reminded me that my school required me to enroll as an English-as-a-Second-Language student. My memory immediately returned to how confused I felt. Even at 10 years old, I knew it made no sense that a kid from Ghana, an English-speaking country, was being asked to learn a language he already spoke fluently. \nThis was a systems requirement, a blanketed assumption about what students from certain places could or could not do. That same type of systemic assumption is what we set out to challenge through the Talent x Opportunity Initiative. The venture ecosystem often relies on proxies such as schools, networks, and prior credentials, which can obscure exceptional founders who do not follow the most common paths. TxO invested in and supported these overlooked founders to bridge the gap between talent and opportunity. \nDuring my time at the firm, I was deeply grateful for the opportunity and the trust to lead this work. Identifying out-of-network entrepreneurs and supporting them as they sharpened their ideas, raised capital, and grew into confident leaders was one of the most meaningful experiences of my career. \nAs I move on to my next chapter, I leave with pride in what we built and gratitude for everyone who helped shape it. Thank you for the trust, the collaboration, and the belief in what is possible. There is more work to do and I am excited to keep building.\n\n\n\t\t\t\n\tTopics\n\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Instagram might soon let you remove yourself from someone’s Close Friends list",
    "url": "https://techcrunch.com/2026/01/30/instagram-might-soon-let-you-remove-yourself-from-someones-close-friends-list/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-30T21:14:58.000Z",
    "description": "Instagram is developing a feature that will allow users to remove themselves from someone’s “Close Friends” list, Meta told TechCrunch on Friday. The company says the feature is still in the early stages and...",
    "body": "\nInstagram is developing a feature that will allow users to remove themselves from someone’s “Close Friends” list, Meta told TechCrunch on Friday. The company says the feature is still in the early stages and is not being tested publicly yet.\nThe social network’s Close Friends feature lets users share Stories, Reels, and posts with a select group of people, rather than their entire follower base. Since the feature’s launch in 2018, users haven’t been able to remove themselves from someone else’s Close Friends list.\nThe internal prototype was first spotted by reverse engineer Alessandro Paluzzi, who specializes in finding unreleased features while they’re still under development.\nAccording to a screenshot shared by Paluzzi, Meta will warn users that if they leave a Close Friends list, they won’t be able to see that person’s Close Friends content unless that person adds them back to their list.\nWhile some people would undoubtedly feel offended if others leave their Close Friends list, the feature would likely be a welcome addition for those who’d rather not be included on certain people’s lists.\nIt’s worth noting that Snapchat, one of Instagram’s main competitors, already allows its users to remove themselves from someone’s private story — a similar feature.\nAs with any other internal prototype, it’s unknown when or if Instagram plans to release the feature publicly. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBeyond Close Friends updates, Instagram is also working on other new features. Meta told TechCrunch earlier this week that it plans to test new subscriptions that give people access to exclusive features on Instagram, Facebook, and WhatsApp.\nWhile Meta didn’t share details about which specific features these subscriptions will include, Paluzzi shared that a premium subscription on Instagram will allow users to create unlimited audience lists, see which followers don’t follow them back, and view Stories without the poster knowing.\nMeta said its goal with the upcoming subscriptions is to give users access to special features and more control over how they share and connect, while keeping the core experiences free. The company doesn’t appear to be locked into one strategy, as it plans to test a variety of subscription features and bundles with each app subscription offering a distinct set of exclusive features.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "HomeBoost’s app will show you where to save on your utility bills",
    "url": "https://techcrunch.com/2026/01/31/homeboosts-app-will-show-you-where-to-save-on-your-utility-bills/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/homeboost-app.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-31T16:15:00.000Z",
    "description": "A few years ago, Selina Tobaccowala’s daughter started leaving post-it notes around the house, telling everyone to “turn off the lights” and such. Tobaccowala had just sold her last startup, Gixo, to OpenFit...",
    "body": "\nA few years ago, Selina Tobaccowala’s daughter started leaving post-it notes around the house, telling everyone to “turn off the lights” and such.\nTobaccowala had just sold her last startup, Gixo, to OpenFit and was looking for a new challenge. “I saw the kids and thought, ‘Let me see if there’s something there on the sustainability and climate side,’” she told TechCrunch. “There had to be something more than like turning our lights off.”\nWithout a background in climate science or hardware engineering, she wasn’t sure where to start. So Tobaccowala turned to something she knew well: surveys. \n“Given my love of surveys, I surveyed a ton — a ton — of customers,” said Tobaccowala, who used to be president and CTO of SurveyMonkey. \nWhat she found was that people were struggling to figure out how to lower their utility bills. \n“When we talked to consumers, we heard the same thing over and over again: They get that email that says, ‘Hey, you spend more money than your neighbors,’” she said. “They were sort of stuck with what to do about it.”\nTobaccowala co-founded HomeBoost to help people conduct their own home energy assessments. The company was part of the Startup Battlefield 200 at TechCrunch Disrupt 2025.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTobacowalla (second from right) and the HomeBoost team.Image Credits:HomeBoost\nHomeBoost’s assessment process begins by mailing customers a BoostBox, a small kit that includes an infrared camera, a blacklight and a link to an app that takes customers through the process. As people walk around their homes, the infrared camera shows them where cold (or hot) air is seeping into their homes; the blacklight tells people which lights could be upgraded.\nUsing data from the scans, the app then automatically generates a report which suggests the most cost effective upgrades, including rebates based on where the person lives. \nIn many parts of the country, utilities offer a similar service. Utilities, which are incentivized to reduce end users’ energy use, often work with energy auditors to survey people’s homes to identify ways to trim their consumption. But the quality of those services can be very uneven, Tobaccowala said. \n“We talked to a bunch of consumers who’d gotten home energy assessments done, and there this feeling that was like ‘all they did was try to sell me up an upgraded HVAC,’” she said.\nThe HomeBoost app is cheaper and faster than an auditor, and it helps people feel more in control of the process, Tobaccowala said.\nHomeBoost charges customers $99, which is about a quarter the cost of a traditional, in-person assessment. It is also working with utilities, which cover some or all of the cost for customers. The startup has signed deals with Central Hudson, Omaha Public Power District, and more recently Avista. Omaha Power, for example, pays for all but $19 of the cost, while Central Hudson will cover the entire cost if homeowners check out the BoostBox from a public library.\nBut not every homeowner wants to complete the survey process themselves, and not every auditor is a pushy salesperson. Dedicated auditors can spend between two and 10 hours surveying homes, collating data, and building reports, Tobaccowala said. For that, HomeBoost has developed a version of its app for professionals, allowing them to serve more customers.\nThe company is also testing a feature that will link homeowners with contractors who can follow through on the upgrades outlined in the report. For contractors, it’s another source of new business, and it allows them to get information on a project before even setting foot inside a home.\nBy bringing consumers, utilities, and contractors together, Tobaccowalla hopes that HomeBoost can ultimately deliver on the climate front, too. “It’s a very unique situation where everybody’s aligned to actually lower the utility bill, which in the net result is improvement on the climate,” she said.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "OpenClaw’s AI assistants are now building their own social network",
    "url": "https://techcrunch.com/2026/01/30/openclaws-ai-assistants-are-now-building-their-own-social-network/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-1396827010.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-30T23:36:34.000Z",
    "description": "The viral personal AI assistant formerly known as Clawdbot has a new name — again. After a legal challenge from Claude’s maker, Anthropic, it had briefly rebranded as Moltbot, but has now settled on OpenClaw...",
    "body": "\nThe viral personal AI assistant formerly known as Clawdbot has a new name — again. After a legal challenge from Claude’s maker, Anthropic, it had briefly rebranded as Moltbot, but has now settled on OpenClaw as its new name.\nThe latest name change wasn’t prompted by Anthropic, which declined to comment. But this time, Clawdbot’s original creator Peter Steinberger made sure to avoid copyright issues from the start. “I got someone to help with researching trademarks for OpenClaw and also asked OpenAI for permission just to be sure,” the Austrian developer told TechCrunch via email.\n“The lobster has molted into its final form,” Steinberger wrote in a blog post. Molting — the process through which lobsters grow — had also inspired OpenClaw’s previous name, but Steinberger confessed on X that the short-lived moniker “never grew” on him, and others agreed.\nThis quick name change highlights the project’s youth, even as it has attracted over 100,000 GitHub stars (a measure of popularity on the software development platform) in just two months. According to Steinberger, OpenClaw’s new name is a nod to its roots and community. “This project has grown far beyond what I could maintain alone,” he wrote.\nThe OpenClaw community has already spawned creative offshoots, including Moltbook — a social network where AI assistants can interact with each other. The platform has also attracted significant attention from AI researchers and developers. Andrej Karpathy, Tesla’s former AI director, called the phenomenon “genuinely the most incredible sci-fi takeoff-adjacent thing I have seen recently,” noting that “People’s Clawdbots (moltbots, now OpenClaw) are self-organizing on a Reddit-like site for AIs, discussing various topics, e.g. even how to speak privately.”\nBritish programmer Simon Willison described Moltbook as “the most interesting place on the internet right now” in a blog post on Friday. On the platform, AI agents share information on topics ranging from automating Android phones via remote access to analyzing webcam streams. The platform operates through a skill system, or downloadable instruction files that tell OpenClaw assistants how to interact with the network. Willison noted that agents post to forums called “Submolts” and even have a built-in mechanism to check the site every four hours for updates, though he cautioned this “fetch and follow instructions from the internet” approach carries inherent security risks.\nSteinberger had taken a break after exiting his former company PSPDFkit, but “came back from retirement to mess with AI,” per his X bio. Clawdbot stemmed from the personal projects he developed then, but OpenClaw is no longer a solo endeavor. “I added quite a few people from the open source community to the list of maintainers this week,” he told TechCrunch.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThat additional support will be key for OpenClaw to reach its full potential. Its ambition is to let users have an AI assistant that runs on their own computer and works from the chat apps they already use. But until it ramps up its security, it is still inadvisable to run it outside of a controlled environment, let alone give it access to your main Slack or WhatsApp accounts.\nSteinberger is well aware of these concerns, and thanked “all security folks for their hard work in helping us harden the project.” Commenting on OpenClaw’s roadmap, he wrote that “security remains our top priority” and noted that the latest version, released along with the rebrand, already includes some improvements on that front.\nEven with external help, there are problems that are too big for OpenClaw to solve on its own, such as prompt injection, where a malicious message could trick AI models into taking unintended actions. “Remember that prompt injection is still an industry-wide unsolved problem,” Steinberger wrote, while directing users to a set of security best practices. \nThese security best practices require significant technical expertise, which reinforces that OpenClaw is currently best suited for early tinkerers, not mainstream users lured by the promise of an “AI assistant that does things.” As the hype around the project has grown, Steinberger and his supporters have become increasingly vocal in their warnings.\nAccording to a message posted on Discord by one of OpenClaw’s top maintainers, who goes by the nickname of Shadow, “if you can’t understand how to run a command line, this is far too dangerous of a project for you to use safely. This isn’t a tool that should be used by the general public at this time.”  \nTruly going mainstream will take time and money, and OpenClaw has now started to accept sponsors, with lobster-themed tiers ranging from “krill” ($5/month) to “poseidon” ($500/month). But its sponsorship page makes it clear that Steinberger “doesn’t keep sponsorship funds.” Instead, he is currently “figuring out how to pay maintainers properly — full-time if possible.”\nLikely helped by Steinberger’s pedigree and vision, OpenClaw’s roster of sponsors includes software engineers and entrepreneurs who have founded and built other well-known projects, such as Path’s Dave Morin and Ben Tossell, who sold his company Makerpad to Zapier in 2021.\nTossell, who now describes himself as a tinkerer and investor, sees value in putting AI’s potential in people’s hands. “We need to back people like Peter who are building open source tools anyone can pick up and use,” he told TechCrunch.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "India offers zero taxes through 2047 to lure global AI workloads",
    "url": "https://techcrunch.com/2026/02/01/india-offers-zero-taxes-through-2047-to-lure-global-ai-workloads/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-01T16:30:00.000Z",
    "description": "As the global race to build AI infrastructure accelerates, India has offered foreign cloud providers zero taxes through 2047 on services sold outside the country if they run those workloads from Indian data...",
    "body": "\nAs the global race to build AI infrastructure accelerates, India has offered foreign cloud providers zero taxes through 2047 on services sold outside the country if they run those workloads from Indian data centers — a bid to attract the next wave of AI computing investment, even as power shortages and water stress threaten expansion in the South Asian nation.\nOn Sunday, India’s finance minister Nirmala Sitharaman announced (PDF) the proposal in the country’s annual budget, offering a tax holiday — effectively zero taxes — on revenues from cloud services sold outside India if those services are run from data centers in the country. Sales to Indian customers would have to be routed through locally incorporated resellers and taxed domestically, she told parliament. The budget also proposes a 15% cost-plus safe harbour for Indian data-center operators providing services to related foreign entities.\nThe announcement comes as U.S. cloud giants including Amazon, Google, and Microsoft race to add data-center capacity worldwide to support the surge in artificial-intelligence workloads, with India emerging as an increasingly attractive location for new investment. The country offers a large pool of engineering talent and growing demand for cloud services, and has positioned itself as a key alternative to the U.S., Europe, and parts of Asia for expanding compute infrastructure.\nIn October, Google said it would invest $15 billion to build an AI hub and expand data-center infrastructure in India, its largest commitment in the country to date, following a $10 billion commitment in 2020. Microsoft followed in December with plans to invest $17.5 billion by 2029 to expand its AI and cloud footprint, funding new data centers, infrastructure, and training programs. Amazon has also stepped up its spending in December, saying it would invest an additional $35 billion in India by 2030, taking its total planned commitment to about $75 billion as it expands its retail and cloud operations.\nIndia’s domestic data-center sector is also ramping up to meet global demand. In November, Digital Connexion, a joint venture backed by Reliance Industries, Brookfield Asset Management, and Digital Realty Trust, said it would invest $11 billion by 2030 to develop a 1-gigawatt, AI-focused data center campus in the southern state of Andhra Pradesh. The project, spanning about 400 acres in Visakhapatnam, is among the largest announced in India and underscores growing interest from both domestic and global investors in building AI-ready infrastructure in the country. Separately, Adani Group said in December it plans to invest up to $5 billion alongside Google in its AI data center project in the country.\nHowever, scaling up data center capacity in India may prove difficult, as patchy power availability, high electricity costs, and water scarcity pose key constraints for energy-intensive AI workloads. Those challenges could slow construction and raise operating costs for cloud providers.\n“The announcements on data centers signal that they are being treated as a strategic business sector rather than just back-end infrastructure,” said Rohit Kumar, founding partner of New Delhi-based The Quantum Hub, a public policy and tech consulting firm. The push is likely to attract more private investment and strengthen India’s position as a regional data and compute hub, though execution challenges around power availability, land access, and state-level clearances remain, he added.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSagar Vishnoi, co-founder and director of Noida-based think tank Future Shift Labs, said India’s data-center power capacity is projected to surpass 2 gigawatts by 2026, up from just over 1 gigawatt currently, and could expand more than fivefold to exceed 8 gigawatts by 2030, driven by capital investments of more than $30 billion. While the budget signals clear intent to accelerate digital infrastructure and cloud computing, Vishnoi said allowing foreign cloud firms to earn profits tax-free until 2047 reflects a “strategic bet on global Big Tech,” even as India could produce its own technology champions over the next two decades.\nHe added that routing services to Indian users through reseller entities could leave smaller domestic players competing for thin margins, rather than receiving comparable upstream incentives.\nThe federal budget also stepped up incentives to deepen India’s role in electronics and semiconductor manufacturing, as the country seeks to move beyond assembly and capture more value in global supply chains. The federal government would launch a second phase of the India Semiconductor Mission, the finance minister said, focused on producing equipment and materials, developing full-stack domestic chip intellectual property, and strengthening supply chains, while backing industry-led research and training centers to build a skilled workforce.\nAdditionally, the Indian government has raised the outlay for the Electronics Components Manufacturing Scheme to ₹400 billion (around $4.36 billion), from ₹229.19 billion (about $2.50 billion), after the program — launched in April 2025 — attracted investment commitments at more than double its original target, Sitharaman said.\nThis scheme offers incentives tied to incremental production and investment, reimbursing a portion of costs for companies that manufacture key components such as printed circuit boards, camera modules, connectors, and other parts used in smartphones, servers, and data-center hardware. By linking payouts to actual output rather than upfront subsidies, the program is designed to draw global suppliers deeper into India’s electronics supply chain and reduce reliance on imported components — a long-standing criticism of the country’s manufacturing push.\nAlongside increasing the spending allocation for the electronics components scheme, the federal budget also proposed a five-year tax exemption starting in April for foreign companies supplying equipment and tooling to electronics toll manufacturers operating in bonded zones. The change is likely to benefit companies including Apple, which relies heavily on contract manufacturing in India and has previously been reported to have sought clarity from New Delhi on the tax treatment of high-end iPhone production equipment supplied to its partners.\nThe budget also sought to address vulnerabilities in critical minerals, as India grapples with tightening global supplies of rare earth materials used in electric vehicles, electronics devices, and defense systems. The finance minister said the federal government would support mineral-rich states including Odisha, Kerala, Andhra Pradesh, and Tamil Nadu in establishing dedicated rare-earth corridors to promote mining, processing, research, and manufacturing. The move builds on a seven-year incentive program approved in late 2025 to boost domestic production of rare-earth magnets, as access to supplies from China — which dominates global output — has become more constrained.\nBeyond AI infrastructure and electronics manufacturing, the Indian government also moved to boost cross-border e-commerce, aiming to help smaller businesses tap global demand. The finance minister said the existing ₹1 million (around $11,000) value cap per consignment on courier exports would be removed, a move expected to benefit small manufacturers, artisans, and startups selling overseas through online platforms. The federal government would streamline the handling of rejected and returned shipments using technology, addressing a long-standing bottleneck for exporters, Sitharaman said.\nOverall, the latest measures emphasize India’s ambition to position itself as a long-term hub for global technology infrastructure, spanning cloud computing, electronics manufacturing, and critical minerals. The strategy aims to capitalize on surging AI demand and shifting supply chains. Nonetheless, its success will hinge on execution — from reliable power and water for data centers to sustained support for domestic innovation — as global companies and investors weigh whether India can translate policy incentives into durable leadership in the AI era.\n"
  }
]