[
  {
    "title": "Nvidia is reportedly investing up to $1B in Poolside ",
    "url": "https://techcrunch.com/2025/10/30/nvidia-is-reportedly-investing-up-to-1-billion-in-poolside/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T21:10:17.000Z",
    "description": "\nIn Brief\nPosted:\n2:10 PM PDT · October 30, 2025\n\nImage Credits:Li Hongbo/VCG / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSemiconductor ",
    "body": "\nIn Brief\nPosted:\n2:10 PM PDT · October 30, 2025\n\nImage Credits:Li Hongbo/VCG / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSemiconductor giant Nvidia is looking to invest at least $500 million, and up to $1 billion, in Poolside, which builds AI models for software development, according to reporting from Bloomberg, which cited sources. This investment would be part of a $2 billion funding round Poolside is raising at a $12 billion valuation, according to Bloomberg.\nNvidia’s investment could rise to $1 billion if the company successfully completes the rest of the funding round, Bloomberg reported.\nThis wouldn’t be Nvidia’s first investment in Poolside. The company previously backed Poolside in its $500 million Series B round in October 2024.\nNvidia, already a prolific investor in AI startups, has been broadening its portfolio to include diverse sectors. For example, Nvidia said it was exploring a $500 million investment into U.K.-based self-driving company Wayve in October. Last month, the company took a $5 billion stake in Intel with plans for future chip collaboration.\nTechCrunch reached out to Poolside for more information.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia is reportedly investing up to $1B in Poolside ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150"
      ],
      "datePublished": "2025-10-30T21:10:17.000Z",
      "dateModified": "2025-10-30T21:10:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube announces ‘voluntary exit program’ for US staff",
    "url": "https://techcrunch.com/2025/10/29/youtube-announces-voluntary-exit-program-for-us-staff/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-1149449084.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T23:28:39.000Z",
    "description": "\nYouTube is conducting a “voluntary exit program” with severance for U.S.-based employees, the company confirmed to TechCrunch on Wednesday. The news ",
    "body": "\nYouTube is conducting a “voluntary exit program” with severance for U.S.-based employees, the company confirmed to TechCrunch on Wednesday. The news was first reported by Sources.\nYouTube CEO Neal Mohan told employees about the program via an internal memo on Wednesday.\nThe memo also announced that the Google-owned company was reorganizing its product teams into three separate organizations that all report directly to Mohan. The “Subscription Products” team will focus on YouTube’s subscription products across YouTube Music & Premium and OTT.\nThe “Viewer Products” team will focus on the viewer experience across the main YouTube app, YouTube Kids, Learning, Trust & Safety, and more. Last, the “Creator & Community Products” organization will focus on supporting creators and building community. \nThe company says no roles are being eliminated as part of these changes.\nThe move comes as Alphabet released its third-quarter earnings on Wednesday, reporting that YouTube’s advertising revenue hit $10.26 billion in the period, marking a 15% year-over-year increase.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube announces ‘voluntary exit program’ for US staff",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-1149449084.jpg?w=150"
      ],
      "datePublished": "2025-10-29T23:28:39.000Z",
      "dateModified": "2025-10-29T23:28:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp adds passkey protection to end-to-end encrypted backups",
    "url": "https://techcrunch.com/2025/10/30/whatsapp-adds-passkey-protection-to-end-to-end-encrypted-backups/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/English_WhatsApp_passkey-encrypted-backups-1.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T13:00:00.000Z",
    "description": "\n\t\n\t\tImage Credits:WhatsApp\t\n\t\n\t\t\t\t\t\t6:00 AM PDT · October 30, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWhatsApp is adding a new way to access your encrypted backups with",
    "body": "\n\t\n\t\tImage Credits:WhatsApp\t\n\t\n\t\t\t\t\t\t6:00 AM PDT · October 30, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWhatsApp is adding a new way to access your encrypted backups with passkey support. This means if you lose your device, you can use methods like fingerprint, face, or the screen lock code of your previous device to access WhatsApp’s backup.\nFor years, WhatsApp didn’t have an encryption layer for its chat backups. However, in 2021, Meta added a way for users to protect their backups with end-to-end encryption using either passwords or 64-character encryption keys.\nThe trouble with both is that you have to remember your backup password or have the encryption key handy while restoring the backup. With passkeys, you don’t need to look for the password or the key. \nWhatsApp, which crossed 3 billion active users in May, said that this feature will be rolled out to users in the coming weeks and months, so you might have to keep a eye on when it becomes available to you.\nYou can go to Settings > Chats > Chat backup > End-to-end encrypted backup to enable encrypted backups and check if you have an option to use passkeys.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp adds passkey protection to end-to-end encrypted backups",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/English_WhatsApp_passkey-encrypted-backups-1.jpeg?w=150"
      ],
      "datePublished": "2025-10-30T13:00:00.000Z",
      "dateModified": "2025-10-30T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Navan IPO tumbles 20% after historic debut under SEC shutdown workaround",
    "url": "https://techcrunch.com/2025/10/30/navan-ipo-tumbles-20-after-historic-debut-under-sec-shutdown-workaround/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/07/ai-deals.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T21:41:40.000Z",
    "description": "\nNavan, the corporate travel and expense platform, finished its first day of trading on the Nasdaq on Thursday down 20% from its $25 IPO price, result",
    "body": "\nNavan, the corporate travel and expense platform, finished its first day of trading on the Nasdaq on Thursday down 20% from its $25 IPO price, resulting in a valuation of approximately $4.7 billion for the 10-year-old company.\nThe company was the first to use a new SEC rule that allows public listings during a government shutdown.\nUnlike the traditional IPO path, which requires SEC regulators to review and grant final approval, companies using the shutdown workaround can get automatic approval for their IPO documents 20 days after submitting their price range, effectively bypassing the need for manual SEC approval.\nBut the updated mechanism carries a risk: The government can scrutinize the documents later. If the SEC later finds material deficiencies or undisclosed issues, the company may be forced to amend its statements, which could lead to a lower stock price and even potential litigation.\nDespite this risk, Navan decided to proceed with its IPO, primarily because the bulk of its registration statements had already been reviewed by the SEC staff before the government shutdown began on October 1.\nThe stock’s initial decline is likely influenced, at least in part, by this regulatory uncertainty.\nThe market’s reaction to Navan’s offering is being closely monitored by other IPO contenders. Startups looking to go public before the end of the year need to decide soon whether they’re ready to deal with the regulatory unknowns or delay their filing until the next year.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nNavan has been waiting to go public for several years. The company reportedly filed its confidential IPO paperwork in 2022 and planned to debut at a $12 billion valuation in early 2023.  \nThe company, formerly known as TripActions, was last valued at $9.2 billion when it raised a $154 million Series G round in October 2022.\nNavan customers include Shopify, Zoom, Wayfair, OpenAI, and Thomson Reuters. The company claims that its AI-powered assistant, Ava, handles approximately 50% of customer conversations related to booking or changing flight, hotel, and car rental reservations. Navan’s expense management solution helps companies manage employee expenses through features like automated receipt scanning and categorization.\nThe company generated revenue of $613 million over the last 12 months (up 32%), with losses of $188 million, according to its S1.\nNavan’s largest venture capital backers before its IPO included Lightspeed (holding a 24.8% stake), solo VC Oren Zeev (18.6% stake), Andreessen Horowitz (12.6%), and Greenoaks (7.1%).\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Navan IPO tumbles 20% after historic debut under SEC shutdown workaround",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/07/ai-deals.jpg?w=150"
      ],
      "datePublished": "2025-10-30T21:41:40.000Z",
      "dateModified": "2025-10-30T21:41:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Threads now lets you approve and filter your replies",
    "url": "https://techcrunch.com/2025/10/30/threads-now-lets-you-approve-and-filter-your-replies/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/instagram-threads-GettyImages-2159215889.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T15:45:00.000Z",
    "description": "\nThreads, Meta’s X rival, continues to ship new features at a rapid pace. Shortly after the launch of communities and disappearing “ghost posts,” the ",
    "body": "\nThreads, Meta’s X rival, continues to ship new features at a rapid pace. Shortly after the launch of communities and disappearing “ghost posts,” the social networking app on Thursday introduced new tools that will give users more control over their conversations on the platform.\nOne new feature, reply approvals, will allow you to decide which replies from other users will appear on your posts — before anyone else can see them.\nWhile Threads, like other social networks, already offers tools that let you limit replies to people you follow, your followers, or people you mention, the new feature allows you to keep your replies open to all without the negative consequences of having discussions derailed.\nImage Credits:Meta / Threads\nAs the company explains, these tools will help you “set the tone of the conversation,” and give users more choice. It’s a unique way to balance users’ interest in engaging in more public conversations, but one where the poster — not those replying — still has the power. \nIn addition, the company is rolling out new Activity feed filters that will allow you to more easily view the replies from people you follow or those that include mentions. These join other options like Verified, Quotes, Reposts, and more as other ways to filter replies. \nImage Credits:Meta / Threads\nMeta announced during its third-quarter earnings call this week that Threads has now reached 150 million daily active users, up from over 100 million in December 2024. In August, the company said the network had topped more than 400 million monthly active users, as well.\nAs the app grows, Meta has been working to quickly monetize its traction, having now rolled out ads on the platform globally. It’s now moving to launch video ads.\nThreads is still developing more consumer-facing features, too, as Instagram head Adam Mosseri announced this week that Threads is now testing controls that will allow users to tune their algorithm by adding and removing topics based on their interests.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Threads now lets you approve and filter your replies",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/instagram-threads-GettyImages-2159215889.jpg?w=150"
      ],
      "datePublished": "2025-10-30T15:45:00.000Z",
      "dateModified": "2025-10-30T15:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Solana co-founder Anatoly Yakovenko is a big fan of agentic coding",
    "url": "https://techcrunch.com/2025/10/29/solana-co-founder-anatoly-yakovenko-is-a-big-fan-of-agentic-coding/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-29-at-2.59.52-PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T22:44:00.000Z",
    "description": "\n\t\n\t\tImage Credits:TechCrunch (screenshot)\t\n\t\n\t\t\t\t\t\t3:44 PM PDT · October 29, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe rise of agentic coding tools has been a sea cha",
    "body": "\n\t\n\t\tImage Credits:TechCrunch (screenshot)\t\n\t\n\t\t\t\t\t\t3:44 PM PDT · October 29, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe rise of agentic coding tools has been a sea change for software engineers across the industry — but for Solana Labs CEO Anatoly Yakovenko, it seems to have landed particularly hard. Speaking at TechCrunch Disrupt, Yakovenko said he’s become increasingly comfortable taking a back seat in software development tasks.\n“AI has been a great force multiplier for somebody who’s an expert,” said Yakovenko, describing his experience with agentic coding after more than 15 years developing software. “Now I can just watch Claude churning through its thing and I can almost smell when it’s going off the rails.”\n“If people are in a meeting with me and I’m not paying attention,” he continued, “it’s because I’m watching Claude.”\nCo-founder of the Solana cryptocurrency protocol, Yakovenko has seen immense success this year, even as many cryptocurrencies have struggled. The system announced $2.85 billion in annual revenue earlier this month, fueled largely by crypto trading platforms. Even more impressive was the Solana coin’s first exchange-traded fund (or ETF), launched the day before Yakovenko took the stage. Launched by the crypto asset manager Bitwise, the fund saw nearly $70 million of inflows in a single day.\nOnstage, Yakovenko attributed the success to a growing acceptance of crypto, especially from the conventional finance industry. “If you are a back-office finance person, you actually get crypto much, much faster,” Yakovenko said. “Finance people deal with settlement risk all the time. They deal with banking risk all the time.”\nOver the same period, cryptocurrency has drawn significant new criticism for enabling public bribery, particularly in connection with the Solana-hosted Trumpcoin. The coin has directed an estimated $350 million to the president, which critics see as a form of bribery — particularly in the wake of Trump’s high-profile pardons for Tron founder Justin Sun and Binance founder Changpeng Zhao.\nBut as long as Solana is an open protocol, Yakovenko has little control over the coins it hosts. “I could send you an email with a link to Trumpcoin or Fartcoin,” Yakovenko explained onstage, “and both of those are protocols, both the email and the underlying protocol that creates that market.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Solana co-founder Anatoly Yakovenko is a big fan of agentic coding",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-29-at-2.59.52-PM.jpg?w=150"
      ],
      "datePublished": "2025-10-29T22:44:00.000Z",
      "dateModified": "2025-10-29T22:44:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Figma acquires AI-powered media generation company Weavy",
    "url": "https://techcrunch.com/2025/10/30/figma-acquires-ai-powered-media-generation-company-weavy/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Figma_Weavy_Static_Icons.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T13:15:00.000Z",
    "description": "\nDesign platform Figma said today that it has acquired AI-powered image and video generation company Weavy. The startup will join Figma under a new br",
    "body": "\nDesign platform Figma said today that it has acquired AI-powered image and video generation company Weavy. The startup will join Figma under a new brand called Figma Weave.\nFigma said that 20 people from Weavy will join the company but didn’t disclose the valuation of the deal. The Tel Aviv-based startup was founded in 2024 and raised $4 million in a seed round in June led by Entrée Capital, with participation from Designer Fund, Founder Collective, and Fiverr founder Micha Kaufman.\nFigma said that Weavy will exist as a stand-alone product for now and that, in the future, it will be integrated with the Figma Weave brand, along with the rest of the Figma platform.\nWeavy’s web tools enable users to combine different AI models and offer users pro editing tools to create high-quality images and videos for use in product mock-ups or brand styling. Users can edit these media generations with layer edits, adjust lighting, and change colors and angles through prompts to achieve the final result they want.\nImage Credits:Figma\nUsers start with an element like a prompt for an image generation on an infinite canvas, look at results from different models, pick one image, add another prompt for video generation, and look at different results produced by various models. At any point, users can use the edit tools to change the look of a video. Designers can also combine multiple prompts and models to get to the output they want.\nThe startup offers different models such as Seedance, Sora, and Veo for video, and Flux, Ideogram, Nano Banana, and Seedream for image generation.\nImage Credits:Figma\n“This node-based approach brings a new level of craft and control to AI generation. Outputs can be branched, remixed, and refined, combining creative exploration with iteration and craft. The Weavy team has inspired us with the balance they’ve struck between simplicity, approachability, and power. They’ve also created a tool that’s just a joy to use,” Figma CEO Dylan Field said in a statement.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nAI-powered design platforms are in demand to create media generation and design workflow capabilities. Earlier this month, AI search platform Perplexity acquired the team behind the Sequoia-backed design platform Visual Electric. In April, Krea announced that it had raised $83 million across various rounds from firms like Bain Capital, a16z, and Abstract Ventures.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Figma acquires AI-powered media generation company Weavy",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Figma_Weavy_Static_Icons.jpeg?w=150"
      ],
      "datePublished": "2025-10-30T13:15:00.000Z",
      "dateModified": "2025-10-30T13:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NBA champion Tristan Thompson and World Mobile launch community-owned network Uplift",
    "url": "https://techcrunch.com/2025/10/29/nba-champion-tristan-thompson-and-world-mobile-launch-community-owned-network-uplift/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2244055209.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T23:39:06.000Z",
    "description": "\nNBA champion Tristan Thompson announced at TechCrunch Disrupt 2025 that he’s partnering with global telecom company World Mobile to launch a communit",
    "body": "\nNBA champion Tristan Thompson announced at TechCrunch Disrupt 2025 that he’s partnering with global telecom company World Mobile to launch a community-owned mobile network called Uplift. The network offers unlimited data plans starting at $9.99 per month.\nUplift is built on blockchain technology and a decentralized physical infrastructure network (DePIN).\nWith Uplift, every subscription will contribute to neighborhood-level network expansion, while local hosts that are known as “AirNode operators” will earn a portion of network revenue by providing community coverage. The idea behind Uplift is to challenge the $2 trillion telecom industry’s centralized model by allowing users and local operators to share in the value they create.\n“For me, it’s about, how can I help people that have walked the same life that I walked, and I think for us, what we’re doing is providing connectivity and connection for unlimited data at a way lower cost,” Thompson said onstage. “It’s like, how can I help my community have a better tomorrow? And that’s what this is about. And I’ve been very blessed and fortunate to have a team that understands this vision. And we want to help people in America, help the inner city, and just give people hope.”\nWhile Thompson is known for his basketball career and winning the NBA championship with the Cleveland Cavaliers, he’s also an outspoken advocate for innovation and inclusion. Thompson currently holds four C-suite roles across the web3 and fintech landscape. He’s the chief digital equity officer at World Mobile and the chief advisory officer at AxonDAO, an AI-powered medical research platform inspired by his brother’s epilepsy journey.\nImage Credits:Getty Images for TechCrunch\nHe’s also the co-founder of Basketball Fun, a web3 platform that tokenizes NBA players, and he’s the chief content officer at Tracy AI, an AI platform for real-time sports analytics.\nWith this latest endeavor, Thompson and World Mobile are looking to drive affordable community-owned internet access. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nWorld Mobile says this is a tested and scalable model, as it piloted it in Reno, Nevada, where community hosts have earned more than $10,000 annually by providing coverage to underserved areas. Uplift operates on infrastructure already proven through World Mobile’s U.S. deployments, World Mobile says.\n“We brought about 20% of Reno back to connectivity,” Thompson said. “When the hurricane happened in North Carolina and Asheville, Starlink went out there and tried to bring connectivity, and they weren’t able to, so they reached out to the World Mobile team, and we were able to get out there and send a couple of our guys on helicopters to fly in, and we were actually the ones that brought connectivity back to Asheville, North Carolina, during that hurricane.”\nThe new service will begin rolling out in Cleveland, Ohio, soon and will launch in additional cities in 2026.\nWorld Mobile notes that more than 50 million Americans live at or near the poverty line, with many lacking access to affordable high-speed data. Uplift aims to expand access while ensuring that wealth generated by mobile usage stays in the neighborhoods that create it.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NBA champion Tristan Thompson and World Mobile launch community-owned network Uplift",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/2244055209.jpg?w=150"
      ],
      "datePublished": "2025-10-29T23:39:06.000Z",
      "dateModified": "2025-10-29T23:39:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "And the winner of Startup Battlefield at Disrupt 2025 is: Glīd",
    "url": "https://techcrunch.com/2025/10/29/and-the-winner-of-startup-battlefield-at-disrupt-2025-is-glid/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Kevin-Damoa-Glid.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T23:15:39.000Z",
    "description": "\nFor three days this week, 20 startups participated in the Startup Battlefield at TechCrunch Disrupt 2025. Each was selected to represent the best of ",
    "body": "\nFor three days this week, 20 startups participated in the Startup Battlefield at TechCrunch Disrupt 2025. Each was selected to represent the best of the Startup Battlefield 200 and competed for a chance to take home the Startup Battlefield Cup and $100,000. After all that intense pitching, we have a winner.\nThese startups were handpicked to compete in Startup Battlefield, and all of them presented a live demo in front of the VCs and tech leaders who judged the competition.\nAfter hours of deliberations, TechCrunch editors pored over the judges’ notes and narrowed the list down to five finalists: Charter Space, Glīd, MacroCycle, Nephrogen, and Unlisted Homes.\nThe final five made their way to the finale to demo in front of our final panel of judges, which included Aileen Lee, founder and managing partner of Cowboy Ventures, and Digg founder Kevin Rose. \nWe’re now ready to announce that the winner of TechCrunch Startup Battlefield 2024 is:\nWinner: Glīd\nGlīd (pronounced “Glide”) aims to streamline the complex, multistep process involved in moving a container from a ship to a freight train. The company, founded by Kevin Damoa (pictured), has developed several hardware and software products to speed up and reduce the cost of getting shipping containers to the railhead and eventually their destination. Its first product is GliderM, a hybrid-electric vehicle with a hook on the back that can pick up and move 20-foot containers directly to the rail without the need for forklifts of hostler trucks.\nRead more about Glīd in our separate post.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\nRunner-up: Nephrogen\nNephrogen is a biotech startup that uses AI and advanced screening to develop a specialized delivery system for safely getting gene-editing medicines into the exact cells in the kidney. Founder Demetri Maxim says that after three years of development, Nephrogen has succeeded in creating a delivery mechanism that is 100 times more efficient at transporting medicine to the kidney than the “vehicles” currently approved by the FDA. And he plans to participate in the clinical study himself, given the challenges he faces living with polycystic kidney disease.\nRead more about Nephrogen in our separate post.\nThese two companies follow in the footsteps of Startup Battlefield legends like Dropbox, Discord, Cloudflare, and Mint on the Disrupt Stage. With more than 1,500 alumni having participated in the program, Startup Battlefield Alumni have collectively raised over $29 billion in funding with more than 200 successful exits.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "And the winner of Startup Battlefield at Disrupt 2025 is: Glīd",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Kevin-Damoa-Glid.jpg?w=150"
      ],
      "datePublished": "2025-10-29T23:15:39.000Z",
      "dateModified": "2025-10-29T23:15:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Digg founder Kevin Rose on the need for trusted social communities in the AI era",
    "url": "https://techcrunch.com/2025/10/29/digg-founder-kevin-rose-on-the-need-for-trusted-social-communities-in-the-ai-era/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2244048690.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T23:28:58.000Z",
    "description": "\n“The dead internet theory is real,” Reddit co-founder Alexis Ohanian told Digg founder Kevin Rose, referring to the idea that much of the internet is",
    "body": "\n“The dead internet theory is real,” Reddit co-founder Alexis Ohanian told Digg founder Kevin Rose, referring to the idea that much of the internet isn’t human — it’s mostly bots. \nThe two entrepreneurs have since teamed up to re-envision how to build a social community in this world where, very soon, it will be hard to tell who’s a real person online. \nEarlier this year, the two bought the remaining assets belonging to Digg, the long-shuttered news aggregation site originally founded by Rose that was a staple of the Web 2.0 era. \nNow again under Rose’s control, the new Digg is creating a place for people to socialize and connect online within communities, similar to Reddit, but it has different ideas about how such a platform should work at a time when bots are nearly indistinguishable from humans. \nBackstage at the TechCrunch Disrupt 2025 conference on Wednesday, Rose explained that he sees the future of social as being more focused on protected online spaces and “micro communities of trusted users.” \n“I just have to imagine that, as the cost to deploy agents drops to next to nothing, we’re just gonna see…bots act as though they’re humans,” he said. “So, small trusted communities, proof of heartbeat — there’s an actual human on the other end…is important.” \nBut today’s verification methods often involve things like facial recognition, ID uploads, or small payments with a credit card to ensure that someone is a person and not a bot. Not everyone online will feel comfortable doing something like that to access an online social community, of course.  \nThat’s why Digg is looking to use newer technology, like a ZK proof (ZKP) to verify people using its platform in the future.\nSays Rose, the ZKP is a “fancy piece of math” which doesn’t expose who someone is, but can verify something essential that would be important for their participation in an online community. \nFor instance, a moderator of a community for Oura ring owners could use the technology to verify that someone is actually an Oura ring owner before allowing them to post. That identity could stay with them so they’re known as a trusted member, but not necessarily one where they have to go by their real name. This could be particularly useful in communities focused on sensitive topics or health issues, as well. \nConnie Loizos, Editor-in-Chief & GM of TechCrunch, and Kevin Rose, Founder, Digg, speak onstage during day three of TechCrunch Disrupt 2025 at Moscone Center on October 29, 2025 in San Francisco, California Image Credits:Kimberly White/Getty Images for TechCrunch\nThe idea that moderators should have more of a say over their communities is also essential to the new Digg — and, Rose believes, these founding members should be compensated for their efforts. \n“When we first started Digg in 2004 — before Reddit launched — we were very lucky because we had thousands and thousands of people, and eventually millions of people, that would come in and contribute content,” said Rose, during his panel at the TechCrunch Disrupt event.  “And they’re not getting paid.”\nHe said that some Reddit moderators are essentially working around the clock to handle things like spam and fighting, but aren’t receiving any slice of the revenue, nor do they control the audience. \n“So you’re talking about something where you’re signing up and creating all this value for a platform, but you can’t port that platform anywhere else. You can’t capture any email addresses. You can’t stay in touch on that platform. You can be ousted [from] that platform,” he said. \nRose also pointed to issues where larger Reddit communities can become trademarked — something that prevented the founder of the r/WallStreetBets subreddit from writing a book using the name of the community they had created. \n“If anything, we should be more similar to Substack or Patreon, or some others that are actually giving you much more control of your community,” he said. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Digg founder Kevin Rose on the need for trusted social communities in the AI era",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/2244048690.jpg?w=150"
      ],
      "datePublished": "2025-10-29T23:28:58.000Z",
      "dateModified": "2025-10-29T23:28:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Box CEO Aaron Levie on how AI is changing the enterprise SaaS landscape",
    "url": "https://techcrunch.com/2025/10/29/box-ceo-aaron-levie-on-how-ai-is-changing-the-enterprise-saas-landscape/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2244026103.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T18:45:19.000Z",
    "description": "\nBox co-founder and CEO Aaron Levie doesn’t think AI agents will replace enterprise SaaS (software-as-a-service) companies. Instead, he believes that ",
    "body": "\nBox co-founder and CEO Aaron Levie doesn’t think AI agents will replace enterprise SaaS (software-as-a-service) companies. Instead, he believes that the more likely future is a hybrid combination of SaaS plus agents, he said, speaking onstage at the TechCrunch Disrupt 2025 conference on Wednesday.\n “Generally, once you have a business process, you want to be able to define that in, effectively, business logic with deterministic systems — just because the risk of that changing any given day is very high,” explained Levie.\n“If you’re doing something mission critical — we’ve already seen great examples of either data being leaked because of agents, or an agent going and, you know, maybe blowing up your database or doing something in production you didn’t expect. So you want to have some sort of ‘church and state’ between the deterministic side of your software and the non-deterministic side.”\nHe painted a picture of a future of enterprise software where the SaaS is used for the core business workflow, and then the agents ride on top of that. These agents would be helpful with making decisions, automating workflows, or, essentially, just accelerating whatever process the person was trying to do in the system, the exec said. \nIn addition, Levie pointed out that this reconfiguration would dramatically impact the business model of enterprise SaaS. \n“The thing that I’m very convinced of is we’ll have about 100 times more, maybe 1,000 times more, agents than we have people. So you’ll have way more users of that software system, or SaaS, as agents,” Levie said.\nAs a result, the typical “per-seat” business model would no longer work, and instead, companies would have to sell some form of consumption and volume-oriented use cases with AI agents. \nThese changes are a market opportunity for startups, particularly those that are building for the agent-first era, rather than bigger companies that are trying to integrate agents into existing processes. \nSmaller startups, he said, have no business processes to change, so they can design a new process in an agent-first way.\nThis presents an opportunity for startups to build solutions for the enterprise space to make the change management process easier and more palatable, Levie said.\nHe encouraged entrepreneurs to capitalize on this shift by building. \n“We are in this window right now that we have not been in for about 15 years, which is — there’s a complete platform shift happening in tech that’s opening up a spot for a new set of companies to emerge,” Levie said.\n“And I would just, you know, try and fully exploit that.” \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Box CEO Aaron Levie on how AI is changing the enterprise SaaS landscape",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/2244026103.jpg?w=150"
      ],
      "datePublished": "2025-10-29T18:45:19.000Z",
      "dateModified": "2025-10-29T18:45:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2024’s Startup Battlefield runner-up geCKo Materials reveals four new products at TechCrunch Disrupt",
    "url": "https://techcrunch.com/2025/10/29/2024s-startup-battlefield-runner-up-gecko-materials-reveals-four-new-products-at-techcrunch-disrupt/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2244029449.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T20:06:35.000Z",
    "description": "\nThe 2024 runner-up in the TechCrunch Disrupt Startup Battlefield, geCKo Materials, returned to the stage at this year’s show to debut new products as",
    "body": "\nThe 2024 runner-up in the TechCrunch Disrupt Startup Battlefield, geCKo Materials, returned to the stage at this year’s show to debut new products as it pushes deeper into commercializing its tech.\nFounder Dr. Capella Kerst revealed four new uses of geCKo’s super-strong dry adhesive: a semiconductor wafer handling tool, a robotic gripper for smooth surfaces (like solar panels or glass), a curved robotic “end effector” for more irregular shapes, and an all-purpose gripper for robotic arms.\nThe geCKo tech is inspired by the way real-life lizards use their feet to grip surfaces. Kerst positions it like a new form of Velcro, but one that leaves no residue, can quickly attach and detach, and requires no electrical charge or suction. A one-inch tile of the material can hold 16 pounds, and the geCKo dry adhesive can attach as many as 120,000 times — and can stay attached for seconds, minutes, or years.\nThe ability to quickly adapt the dry adhesive to existing manufacturing, picking, and other robotic applications has proven popular. Kerst’s company won over Ford, NASA, and Pacific Gas & Electric as customers before she even competed on last year’s Battlefield stage.\n“Has this year flown by as quickly for anybody else as it has for us?” Kerst said on the TechCrunch Disrupt stage on Wednesday. The geCKo CEO said her company has tripled the size of her team since last year’s show and completed an $8 million fundraise. And geCKo’s dry adhesive was used on six space missions in the last year — a testament to the material’s ability to work in multiple environments, including a vacuum, according to Kerst.\nOnstage Wednesday, Kerst showed off a Fanuc robotic arm using six geCKo tiles to quickly grab and move objects around, before showing videos of the other commercialized applications.\nIn one of those videos, Kerst showed geCKo’s material being used to safely move semiconductor wafers faster than current suction or vacuum tech allows.\n“Our customers at TSMC, Samsung, Intel, and Kawasaki said we have a goal to [move the wafers] at 2Gs of acceleration,” she said. “We decided to blow them out of the water and do 5.4Gs of acceleration repeatedly, reliably, using geCKo materials.”  \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2024’s Startup Battlefield runner-up geCKo Materials reveals four new products at TechCrunch Disrupt",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/2244029449.jpg?w=150"
      ],
      "datePublished": "2025-10-29T20:06:35.000Z",
      "dateModified": "2025-10-29T20:06:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canva launches its own design model, adds new AI features to the platform",
    "url": "https://techcrunch.com/2025/10/30/canva-launches-its-own-design-model-adds-new-ai-features-to-the-platform/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Creative-OS.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T17:00:00.000Z",
    "description": "\nCreative suite company Canva launched its own design model on Thursday that understands design layers and formats to power its features. The company ",
    "body": "\nCreative suite company Canva launched its own design model on Thursday that understands design layers and formats to power its features. The company also introduced new products and features, updates to its AI assistant, and the ability to use its spreadsheet tool alongside its app-building feature to create data visualization widgets.\nCanva said that it is launching its own foundational model, trained on its design elements, that generates designs with editable layers and objects rather than flat images. The model works across different formats, including social media posts, presentations, whiteboards, and websites.\n“We started by creating flat images with diffusion models. Omni models have taken that a step further, where you’re able to edit those flat images with a lot of sophistication through prompting. But the tools have made you prompt your way to the final result, which, for a visual medium, is challenging,” Canva’s global head of product, Robert Kawalsky, told TechCrunch over a call. \n“What we’ve found is that people . . . want the ability to start with a prompt and get far, but also be able to iterate directly themselves.”\nEarlier this year, the company unveiled an AI assistant called Canva AI that has a chat-like interface for generating visual content from text prompts. The platform is now making that assistant available throughout the interface, including the design and elements tabs.\nUsers can also tag (@mention) the bot in comments to get text or media suggestions while working on a project with others. Plus, the AI tool can now generate 3D objects and allows users to copy the art style of any design.\nThe company also added a spreadsheet product and a feature that lets users create mini apps through prompts. Now it’s connecting these two products, allowing users to use data stored in the spreadsheet and create widgets from that.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nCanva also acquired an ad analytics company called MagicBrief earlier this year. Using its own platform for creation along with the new measurement tool, Canva is launching Canva Grow, an all-in-one marketing platform that uses AI for both asset creation and performance analytics. It also allows marketers to publish their ads directly on platforms like Meta.\nAlong with AI features, the Australian design company announced several new products and features for its platform. Users can now create forms with Canva to collect responses from their clients or audiences as an alternative to services like Google Forms.\nThe company is also adding email design to the platform for users to create templates and layouts for marketing or transactional emails that follow their brand’s aesthetics.\nCanva acquired the professional design suite Affinity last year to better compete with Adobe. With this release, the company said that it is making Affinity free forever for users.\nCanva is also redesigning the Affinity interface to merge vector, pixel, and layout tools under one interface. It’s tightly integrating Affinity with Canva so designers can create objects in the professional tool and move them into Canva. Users can also take advantage of Canva AI to generate images or designs within Affinity, the company said.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canva launches its own design model, adds new AI features to the platform",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Creative-OS.jpeg?w=150"
      ],
      "datePublished": "2025-10-30T17:00:00.000Z",
      "dateModified": "2025-10-30T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cluely’s Roy Lee on the rage-bait strategy for startup marketing",
    "url": "https://techcrunch.com/2025/10/29/cluelys-roy-lee-on-the-ragebait-strategy-for-startup-marketing/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-29-at-4.12.02-PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T00:58:26.000Z",
    "description": "\nCluely’s Roy Lee has a message for startup founders: You should be thinking harder about how to go viral.\n“Generally, if you’re not in deep tech, the",
    "body": "\nCluely’s Roy Lee has a message for startup founders: You should be thinking harder about how to go viral.\n“Generally, if you’re not in deep tech, then you need to low-key deep focus on distribution,” Lee told the crowd at TechCrunch Disrupt 2025.\nBut he also made it clear that not everyone was cut out for this kind of viral marketing. \n“If you’re any good at engineering, you’re probably not funny and you’re probably not going to be a content creator because you don’t have it in your blood. Realistically, most of these people have no chance of going viral.”\nCluely’s AI assistant grew famous this April with a viral claim that its undetectable windows could “help you cheat on anything” — a claim that was quickly disproven when a string of proctoring services showed they could, in fact, detect use of the AI assistant. But in a matter of months, the company had raised $15 million from Andreessen Horowitz, becoming one of the most visible products in the crowded AI assistant space.\nAs Lee frames it, it’s part of his talent for going viral, which often means making lots of people very angry at him. “I think I’m particularly good at framing myself in a way that’s controversial,” he said onstage. “I do a lot of things that are different. And everything I do that’s different, I frame it through the filter of my voice. And my voice is naturally just very enraging to a lot of people.”\nFor Lee, it’s part of a broader theory of social media, in which attention is the only currency. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Reputation is sort of a thing of the past,” Lee said. “You can try to be the New York Times and guard your ironclad reputation, but realistically you’ve got Sam Altman on the timeline talking about hot guys and you’ve got Elon Musk going bats— crazy.”\n“You just have to realize that the world is trending to a different place,” he continued, “where you have to be extreme, you have to be authentic, and you have to be personal.”\nIt’s hard to say how well that strategy is working, though. When asked for Cluely’s revenue numbers or user numbers, Lee demurred.\n“What I’ve learned is that you should never share revenue numbers because if you’re doing well, nobody will talk about how well you’re doing. And if you’re doing poorly, people will only talk about how poorly you’re doing,” Lee said. “I’ll say we’re doing better than I expected, but it’s not the fastest growing company of all time.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cluely’s Roy Lee on the rage-bait strategy for startup marketing",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-29-at-4.12.02-PM.jpg?w=150"
      ],
      "datePublished": "2025-10-30T00:58:26.000Z",
      "dateModified": "2025-10-30T00:58:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bevel raises $10M Series A from General Catalyst for its AI health companion",
    "url": "https://techcrunch.com/2025/10/30/bevel-raises-10m-series-a-from-general-catalyst-for-its-ai-health-companion/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/IMG_2447.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-30T16:05:00.000Z",
    "description": "\nMost people tracking their health today end up with scattered clues. Their smartwatch shows sleep duration. A fitness app logs steps. A nutrition app",
    "body": "\nMost people tracking their health today end up with scattered clues. Their smartwatch shows sleep duration. A fitness app logs steps. A nutrition app counts calories. Yet few tools help people understand how all of this fits together.\nBevel, a New York–based startup, believes that’s the missing piece in the shift toward proactive health. The company has raised a $10 million Series A from General Catalyst to scale its AI health companion, which unifies data from wearables and daily habits across sleep, fitness, and nutrition into personalized insights.\nThe investment follows a breakout year for the two-year-old health tech company.\nBevel says it has grown more than eightfold within the past year and now reaches over 100,000 daily active users, making it one of the fastest-growing health apps in the U.S. Additionally, the company says the average user opens the app eight times per day, and retention remains above 80% at 90 days — rare metrics in a category where people often churn after reaching a short-term fitness goal.\n“We think of health as a continuous journey, not a phase,” said co-founder and CEO Grey Nguyen in an interview with TechCrunch. “Bevel meets you where you are, learns from your habits, and helps you make small changes that compound over time.”\nBut with so many health companion brands, from Whoop to Oura to Eight Sleep, why does the world need another one?\nAccording to Aditya Agarwal, a Bevel co-founder and board member who is also a partner at venture firm South Park Commons, many of these health apps rely on accompanying hardware devices that customers must buy and maintain. Because such devices can be pricey, there’s an opportunity to create a product that’s purely software-based, giving people the flexibility to use the wearables they already own.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“A $500 ring or band is out of reach for a lot of people,” said Agarwal. “[People] already generate so much valuable health data from our primary wearables and other everyday sources. We wanted to make something that was more accessible across a much larger set of people.” Bevel users pay $6 monthly or $50 annually.\nUnlike typical wellness apps that focus on a single area — such as steps, sleep, or nutrition — Bevel combines them into one experience. It integrates with Apple Watch and other popular wearables through Apple Health and directly syncs with continuous glucose monitors like Dexcom and Libre. Garmin and additional integrations are in development, the company said.\nAll this information feeds into Bevel Intelligence, the company’s core software, which analyzes and adapts recommendations to each user, learning how their body responds to stress, movement, or nutrition.\nImage Credits:Bevel\nBevel’s story started with pain — literally.\nBefore starting the company in late 2023, Nguyen, who previously led products at Sam Altman–backed Campus, and co-founder/CTO Ben Yang, who worked on machine learning at Opendoor, were building stablecoin infrastructure for enterprises. The demanding nature of startup life led Nguyen to neglect his health, and he developed chronic back pain that went undiagnosed for months despite using wearables and seeing doctors regularly.\n“Nothing pointed out what was actually causing my back pain, not even my doctors, which is crazy, right?” he said. “That’s when this idea came up. Everyone’s life is so nuanced. There are so many small things you do that stack on each other and, over time, create a chronic condition.”\nNguyen says he began piecing together his health data, tracking sleep, nutrition, and steps, and realized that issues across these areas had compounded over time. Low mobility from sitting too long, sleep problems caused by his mattress setup, and sodium-heavy meals that increased inflammation all played a role.\nSimilarly, Agarwal, formerly CTO at Dropbox and an early engineer at Facebook, had gone through his own health overhaul after years of intense work left him burned out. What helped was logging his data manually — through spreadsheets and connected trackers — to rebuild his energy.\nWhen he connected with Yang and Nguyen about what they were building with Bevel, he saw they had a similar vision and joined the team as a co-founder and board member.\n“We shared the same North Star, which is helping people become more intelligent about their own health,” said Agarwal, who is also a partner at South Park Commons. The venture capital firm, alongside General Catalyst, invested $4 million into Bevel earlier this year in a seed round.\nWith fresh capital and no plans to develop its own wearables, Bevel intends to grow its team and expand into additional health services and partnerships that make proactive health accessible.\n“Bevel’s mission to democratize health through intelligence and design deeply resonates with us,” said Neeraj Arora, managing director at General Catalyst. “The level of engagement they’re seeing from users is remarkable, and it’s become part of people’s daily lives — not just another app” that they download and forget.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bevel raises $10M Series A from General Catalyst for its AI health companion",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/IMG_2447.jpeg?w=150"
      ],
      "datePublished": "2025-10-30T16:05:00.000Z",
      "dateModified": "2025-10-30T16:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]