[
  {
    "title": "TikTok users can now share tracks and more from Amazon Music",
    "url": "https://techcrunch.com/2025/11/14/tiktok-users-can-now-share-tracks-and-more-from-amazon-music/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/thumbnail_LE-SSERAFIM_Share-to-TikTok_Insights.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T14:00:00.000Z",
    "description": "With a new \"Share to TikTok\" button, Amazon Music users can share songs, albums, playlists, and personal listening highlights from their Insights on Amazon Music directly to TikTok. ",
    "body": "\nIn Brief\nPosted:\n6:00 AM PST · November 14, 2025\n\nImage Credits:TikTok\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTikTok is rolling out a new feature that will allow users to share content from Amazon Music to the social network, the company told TechCrunch exclusively. \nWith a new “Share to TikTok” button, Amazon Music users can share songs, albums, playlists, and personal listening highlights from their Insights on Amazon Music directly to TikTok. \nFor context, Amazon Music Insights is a new personalized feature that gives listeners a detailed look at their music habits and stats. It includes “Monthly Recaps” that spotlight your top artists, songs, podcasts, and total listening time. Amazon Music users can now share these stats directly to TikTok. \nTikTok already supports “Share to TikTok” features for both Spotify and Apple Music. \nTikTok says the update builds on its current partnership with Amazon Music through its “Add to Music App” feature that allows users to save the songs they discover on TikTok directly to Amazon Music and other leading streaming services. \nThursday’s announcement makes sense for TikTok, an app known for influencing which songs top the charts. By adding Amazon Music to its “Share to TikTok” options, TikTok gains an increased ability to connect users with their favorite songs and artists.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n"
  },
  {
    "title": "Tesla might finally bring CarPlay to its EVs",
    "url": "https://techcrunch.com/2025/11/13/tesla-might-finally-bring-carplay-to-its-evs/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1201201983.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T17:05:25.000Z",
    "description": "In Brief Posted: 9:05 AM PST · November 13, 2025  Image Credits:Sjoerd van der Wal / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  While automakers like General Motors have started to sour on Apple...",
    "body": "\nIn Brief\nPosted:\n9:05 AM PST · November 13, 2025\n\nImage Credits:Sjoerd van der Wal / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhile automakers like General Motors have started to sour on Apple CarPlay, Tesla is reportedly working on integrating the system into its vehicles’ software stack.\nThe feature is in development, according to a Bloomberg report, which noted the effort could be canceled before it is released to the public.\nThe move would mark a dramatic change for the automaker. Tesla has avoided requests from current and prospective customers to add CarPlay capability to its infotainment system. Apple CarPlay, as well as rival Android Auto, allows drivers to project their smartphone and many of its apps onto the car’s infotainment display. Tesla is focused on the standard CarPlay and not Apple’s next-generation and more capable version called CarPlay Ultra.\nIn lieu of CarPlay or Android Auto, Tesla has added native apps for streaming music services, including Apple Music, Spotify, and Tidal. Based on user reports, the quality of those apps has been uneven. Those apps also require customers to subscribe to Tesla’s premium connectivity package, which costs $9.99 monthly or $99 annually.\nThe addition of CarPlay could entice some drivers who had written off Tesla to reconsider their decisions. Half of drivers surveyed by McKinsey a couple years ago said that they wouldn’t buy any vehicle lacking CarPlay or Android Auto.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "WhatsApp to launch third-party chat integration in Europe soon",
    "url": "https://techcrunch.com/2025/11/14/whatsapp-to-launch-third-party-chat-integration-in-europe-soon/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T15:32:50.000Z",
    "description": "Image Credits:Jakub Porzycki/NurPhoto / Getty Images\t \t \t\t\t\t\t\t7:32 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Meta is getting ready to launch third-party chat integration on WhatsApp in Europe, the company...",
    "body": "\n\t\n\t\tImage Credits:Jakub Porzycki/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t7:32 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta is getting ready to launch third-party chat integration on WhatsApp in Europe, the company announced on Friday. The tech giant notes that the EU’s Digital Markets Act (DMA) requires it to give users in Europe the option to chat with people using third-party messaging services that have chosen to make their apps interoperable.\n“Following successful small-scale tests over the past months, the option for WhatsApp users to chat with users of messaging apps BirdyChat and Haiket directly via third-party chats will soon be rolling out across Europe,” Meta wrote in a blog post. “This marks a significant milestone in Meta’s compliance with the EU’s Digital Markets Act (DMA) interoperability requirements.”\nUsers in Europe who have opted in to the third-party integration will be able to share messages, images, voice messages, videos, and files. The option to create groups with third-party users will launch once Meta’s partners are ready to support it, the company says.\nOver the coming months, users in the European Region will begin seeing a notification in the “Settings” tab that will explain the process of opting in to connect with people on third-party apps. Third-party integrations will only work on Android and iOS, not on desktops, web, or tablets.\nImage Credits:Meta\nOf course, connecting with people on other messaging apps is optional, and users can turn third-party chats on or off at any time.\nMeta says its partnerships with BirdyChat and Haiket are the result of a three-year collaboration with the European messaging services and the European Commission to develop a third-party chat solution that complies with DMA requirements. \nAdditionally, the company notes that third-party messaging must use the same level of end-to-end encryption as WhatsApp. Meta also says it has ensured that users will understand the differences between chats on WhatsApp and third-party chats.\nBack in September 2024, Meta shared what third-party chats on WhatsApp will look like, noting that users will be able to set up a designated folder for third-party messages or opt for a combined inbox. The company also said at the time that it would notify users each time a new third-party messaging app became available. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Newsletter platform beehiiv adds AI website building, creator tools in major expansion",
    "url": "https://techcrunch.com/2025/11/13/newsletter-platform-beehiiv-adds-ai-website-building-creator-tools-in-major-expansion/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Tyler-Denk.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T18:50:00.000Z",
    "description": "Image Credits:beehiiv\t \t \t\t\t\t\t\t10:50 AM PST · November 13, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Newsletter platform beehiiv announced a massive expansion to its platform on Thursday, including offering real-time analytics...",
    "body": "\n\t\n\t\tImage Credits:beehiiv\t\n\t\n\t\t\t\t\t\t10:50 AM PST · November 13, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nNewsletter platform beehiiv announced a massive expansion to its platform on Thursday, including offering real-time analytics and AI website creation, among other things. \nIn a video announcing the release, Tyler Denk, the co-founder and CEO of beehiiv, said that what makes newsletter platforms powerful is ownership. \n“Owning your audience, distribution, brand, and even your revenue potential,” he said. “In the age of AI and algorithms. Ownership isn’t just nice to have, it’s essential.”\nThe hope is to further give creators (and journalists) more control — and opportunities — to expand and grow their businesses on the platform.  \nThe full product expansion includes: \n\n Allowing creators to sell digital products, such as e-books, without beehiiv receiving commissions. Next year, creators will soon be able to sell courses and merchandise. \n\n\nA feature that lets creators build websites using AI without the use of sophisticated code or developers. A version product was actually launched a few months ago and followed beehiiv’s acquisition of the AI website builder Typedream last year.   Thursday’s announcement revealed the product now lets users build full websites by simply chatting with AI — or, vibe code a website. However, users don’t need to simply talk in words to the AI; they can also drag and drop images, for example, upload images or screenshots of other people’s websites to the AI, and have it re-create them.\n\n\nThe ability to host and release podcasts on a creator’s respective beehiive platform. This lets creators put their podcasts, newsletters, and websites under one platform, rather than having three separate ones. \n\n\nReal-time analytics to track engagement and traffic, in addition to a breakdown of what channels drive the most users. \n\n\nOffering “link in bio,” so creators can link to other digital platforms, as well as their own beehiiv creations, without having to use a third-party link-in-bio company.  \nOffering professionally designed website templates, so that the website and newsletters look more high-quality. It’s also releasing newsletter templates so that websites and newsletters can have a cohesive brand look. \n\n\nThe ability to audience segment — meaning creators can create specific content for specific segments of their audience. Creators can now group followers by location, age, or even gender.   \n\n\nAutomated workflows — for example, when a user subscribes, creators can set it up so that a welcome email is automatically sent to them. beehiiv started releasing features of automated workflows a few weeks ago. \n\n\nEnhanced advertiser tools, including easier browsing of ad opportunities and seeing estimated payouts. Denk said that creators can upload assets, set a budget, and launch campaigns on the platform. In addition, beehiiv has a new ad dashboard, letting creators track the performance of their campaigns and build their own custom reports.  \n\n\nPaid subscriptions, without any fees taken by beehiiv (it says it is the only platform that doesn’t take a cut of paid subscription revenue). The feature comes with subscription tiers and analytics. \n\nBeehiiv now considers itself the first platform to encapsulate the entire content-creation workflow, as users on the platform can “create, publish, grow, analyze, and monetize,” without fees, plugins, code, or giving up equity.\nIn the video, Denk said that beehiiv is no longer just a newsletter platform, but rather the operating system for the creator economy. With this expansion, it hopes to compete with the likes of Lovable, WordPress, and Patreon. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe company was founded in 2021 and says that since then, it has sent more than 35 billion emails, with more than 55,000 creators on the platform, including Oliver Darcy with Status. Beehiiv last raised a $33 million Series B in April 2024 with Lightspeed Venture Partners and NEA as investors.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "German court rules Google must pay €572M for violating antitrust rules in price comparison sector",
    "url": "https://techcrunch.com/2025/11/14/german-court-rules-google-must-pay-e572m-for-violating-antitrust-rules-in-price-comparison-sector/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T15:40:13.000Z",
    "description": "A German court has found that Google has abused its dominant market position in the price comparison sector, ruling that the company must pay a total of €572 million ($665.6 million) in damages to two German price comparison companies.",
    "body": "\n\t\n\t\tImage Credits:Matthias Balk/picture alliance / Getty Images\t\n\t\n\t\t\t\t\t\t7:40 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nA German court has found that Google has abused its dominant market position in the price comparison sector and ruled that the company must pay a total of €572 million ($665.6 million) in damages to two German price comparison companies, according to a report by Reuters.\nGoogle must pay the price comparison platform Idealo about €465 million (about $540 million) in damages, and €107 million (about $124 million) to Producto, another price comparison tool, the report said.\nIdealo had claimed damages of €3.3 billion from Google, arguing that its lawsuit was a direct response to the European Court of Justice’s ruling in 2024 that found the search giant was self-preferencing its own shopping comparison service, breaking competition rules, and fined it about $2.7 billion. \nIdealo said on Friday that it intends to continue its case against Google and seek the full damages it had sued for. \n“We welcome the court of Google holding accountable. But the consequences of self-favoring go far beyond the amount awarded. We will continue to fight – because market abuse must have consequences and must not become a lucrative business model that is worthwhile despite fines and compensation payments,” Idealo’s co-founder and CEO Albrecht von Sonntag said in a statement.\nGoogle said it intends to appeal both rulings. “The changes we made in 2017 are working well, with no intervention from the European Commission. The number of price comparison sites in Europe using the remedy Shopping Unit has multiplied from seven then to 1,550 today,” a Google spokesperson said in an emailed statement.\nThe company added that it offers rival comparison shopping services the same opportunity as Google Shopping to display ads, and said Google Shopping operates as if it were a separate business, participating in auctions the same as everyone else.\nThe ruling follows close on the heels of an EU investigation into how Google’s spam policy affects publishers’ search rankings. The company was recently fined €2.95 billion (just under $3.5 billion) by the EU for allegedly breaching EU antitrust rules by favoring its own advertising services. \nNote: This story was updated to add a comment from Google.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Build Mode starts at the beginning: How Forethought AI found product-market fit",
    "url": "https://techcrunch.com/2025/11/13/build-mode-starts-at-the-beginning-how-forethought-ai-found-product-market-fit/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/maxresdefault-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T21:47:30.000Z",
    "description": "In the debut episode of the Build Mode podcast, we sat down with Deon Nicholas, co-founder of Forethought AI, to unpack what it really takes to build a lasting company with and for your customers from day one.",
    "body": "\nIn the debut episode of the Build Mode podcast, host Isabelle Johannessen sits down with Deon Nicholas, co-founder of Forethought AI, to unpack what it really takes to build a lasting company with and for your customers from day one.\nBuild Mode is TechCrunch’s new podcast that pulls back the curtain on how startups actually get built — the messy, tactical, real-talk version. Season 1: Product, Meet Market, goes beyond product-market fit to explore every aspect of getting your product into customers’ hands, from finding the right audience and earning their trust to turning early traction into lasting momentum.\n\n\n\nFrom the start, Nicholas and his team focused on solving real problems rather than chasing hype or inflated valuations. He is a firm believer that conviction should come from customers, not VCs, and that once Forethought delivered tangible value to real users, the hype and valuations naturally followed.\nHis “7-Failure Rule” urges founders to embrace iteration over perfection and to expect a few misses before finding what truly clicks. \nThe Forethought team stayed lean, obsessed over its ideal customer profile, and focused relentlessly on real pain points instead of shiny features. Nicholas notes that early users aren’t always direct about what isn’t working, so founders have to learn to look between the lines.\nThat mindset powered Forethought’s breakout moment at TechCrunch Disrupt 2018, where the company went on to win Startup Battlefield. Leading up to the competition, Nicholas described the process as a “friendly pressure cooker,” sprinting to secure as many paying customer logos as possible before hitting the stage. The focus paid off, fueling investor FOMO and a $9 million Series A and helping to define the early wave of the AI boom. \nWhile investor momentum built quickly, Nicholas maintains the company’s longevity stemmed from focus, not frenzy. To him, startup success isn’t about hype or rock-star energy — it’s about building something customers love enough to stick around for.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFor founders, the takeaway is simple: Build from day one with your customers, validate every step with feedback, and don’t get distracted by valuations or buzz. Product-market fit isn’t about perfection; it’s about proving consistent value to the people who matter most.\nEpisodes of Build Mode drop every Thursday. Subscribe now on Apple Podcasts, Spotify, or wherever you get your podcasts. And be sure to check out the video version on TechCrunch’s YouTube.\n\n\n\t\tIsabelle leads Startup Battlefield, TechCrunch’s iconic launchpad and competition for the world’s most promising early-stage startups.\r\nYou can contact or verify outreach from Isabelle by emailing isabelle.johannessen@techcrunch.com.\r\n\r\nShe scouts top founders across 99+ countries and prepares them to pitch on the Disrupt stage in front of tier-one investors and global media. Before TechCrunch, she designed and led international startup acceleration programs across Japan, Korea, Italy, and Spain—connecting global founders with VCs and helping them successfully enter the U.S. market. With a Master’s in Entrepreneurship & Disruptive Innovation—and a past life as a professional singer—she brings a blend of strategic rigor and stage presence to help founders craft compelling stories and stand out in crowded markets.\n\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "VCs abandon old rules for a ‘funky time’ of investing in AI startups",
    "url": "https://techcrunch.com/2025/11/13/vcs-abandon-old-rules-for-a-funky-time-of-investing-in-ai-startups/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/54888675035_dae88c3d06_c.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T23:18:49.000Z",
    "description": "If there’s one thing that VCs agree on when backing AI startups, it’s that AI requires a different investment approach than prior technological shifts. “It’s a funky time,” said Aileen Lee, founder and...",
    "body": "\nIf there’s one thing that VCs agree on when backing AI startups, it’s that AI requires a different investment approach than prior technological shifts.\n“It’s a funky time,” said Aileen Lee, founder and managing partner of Cowboy Ventures, onstage at TechCrunch Disrupt 2025. The longtime VC noted that the rules of investing have significantly shifted now that some AI companies are leaping from “zero to $100 million in revenue in a single year.”\nHowever, Lee also noted that, based on her firm’s research, Series A investors aren’t just seeking rapid revenue growth. “It’s an algorithm with different variables and different coefficients.”\nSome of the factors investors now measure, according to Lee, include whether the startup is generating data, the strength of its competitive moat, the founders’ past accomplishments, and the technical depth of the product. “Depending on what your company is, the output of the algorithmic formula is going to be different,” she said.\nJon McNeill, co-founder and CEO of startup creation firm DVx Ventures, stated that even startups that grow rapidly from inception to $5 million in revenue often struggle to secure follow-on funding. “I think this game has changed, and it is changing dynamically,” he said.\nMcNeill noted that Series A investors are now applying the same rigorous standards to seed-stage startups that they previously reserved for more mature companies.\n“I think a lot of investors have figured out that the breakout companies, in most cases, don’t have the best tech,” McNeill said about why Series A VCs are looking so closely at startups’ ability to attract and retain customers. “They have the best go-to market.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSteve Jang, founder and managing partner of Kindred Ventures, disagreed that a strong go-to-market (GTM), an industry term for sales and marketing, holds greater weight for investors. “I don’t think it’s 100% true to say mediocre technology, great GTM wins and raises money and gets customers. I think that it’s a necessary requirement to have both.”\nWhile McNeill later clarified that having a solid product is important, he indicated that his initial comment was related to the founders’ need to develop an exceptionally strong sales and marketing strategy right out of the gate. “Investors are getting much more sophisticated on the go-to market than they have in the past,” he said.\n(The debate over marketing versus tech was brought to the forefront later during the conference when Roy Lee, founder of the viral startup Cluely, said onstage that launching a product that barely worked, even with massive social media fame, may not always be the best idea.)\nAileen Lee added that AI startups are now under pressure to deliver product updates and new features at an unprecedented pace, preempting existing companies that might try to introduce similar products.  “If you look at how much OpenAI and Anthropic are shipping, you’re going to have to figure out how to match how much you ship, how quickly and the quality of it,” she said.\nDespite the expectations for breakneck growth and fast product development, panelists agreed that the AI industry is still in its very early stages. As Jang put it, “There are no clear, outright winners, even in LLMs. There are competitors nipping at their heels.”\nThis means startups still have a path to unseating perceived leaders, whether they are decades-old companies or fast-moving newcomers.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "ChatGPT launches pilot group chats across Japan, New Zealand, South Korea, and Taiwan",
    "url": "https://techcrunch.com/2025/11/14/chatgpt-launches-pilot-group-chats-across-japan-new-zealand-south-korea-and-taiwan/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/ChatGPT-Groupchat-pilot-launch.png?w=150",
    "tag": "Tech",
    "date": "2025-11-14T10:58:08.000Z",
    "description": "OpenAI on Thursday unveiled a group chat feature for ChatGPT, currently in pilot across Japan, New Zealand, South Korea, and Taiwan, allowing users to collaborate directly within the app.",
    "body": "\nOpenAI on Thursday introduced a group chat feature for ChatGPT. The feature, currently being tested in select regions including Japan, New Zealand, South Korea, and Taiwan, lets users collaborate directly within the app.\nThe group chat is available to Free, Plus, and Team users on both mobile and web platforms. OpenAI says the pilot is designed to explore how people use group conversations in ChatGPT.\nThe announcement comes after earlier reports that OpenAI had been testing a direct-message-style tool. \nThe ChatGPT maker describes this pilot as just a “small first step” toward creating a more “shared experience” in the app. Early users will be invited to provide feedback, which the company says will help shape how the feature eventually expands to more regions and offerings.\nAccording to OpenAI, private chats and personal ChatGPT memory stay completely private. Group chats are invitation-only, and members can leave at any time. Most participants can remove others, though the group’s creator can only leave voluntarily. For users under 18, content is filtered, with extra safeguards and parental controls in place.\nStarting a group chat is easy. Just tap the people icon and add participants, either directly or by sharing a link. Groups can include 1 to 20 people. If you add someone to an existing chat, a new group is created, leaving the original conversation unchanged. Each group has a short profile, and all chats are organized in a labeled sidebar for easy access.\nGroup chats work just like regular ChatGPT conversations but with multiple people joining in. GPT‑5.1 Auto handles responses and comes loaded with features such as search, image generation, file uploads, and dictation. In group chats, ChatGPT’s usage limits — which restrict how many AI responses users can receive per hour — only count when ChatGPT responds. Messages between human participants don’t count toward these limits.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nChatGPT has learned new social skills for group chats, knowing when to jump in and when to stay quiet. You can tag “ChatGPT” to get it to respond. It can also react with emojis and use profile photos to create personalized images for the conversation.\nThe group chat feature represents the latest step in OpenAI’s gradual transformation from a simple AI assistant into something resembling a social platform. In late September, the company launched Sora 2, a standalone social media app with a TikTok-style feed for sharing AI-generated videos, complete with algorithmic recommendations based on user activity and location, parental controls, and direct messaging capabilities.\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "After 5 months, the $1,200 bottles of Besties All-In tequila are finally starting to ship",
    "url": "https://techcrunch.com/2025/11/13/after-5-months-the-1200-bottles-of-besties-all-in-tequila-are-finally-starting-to-ship/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/The-Besties-All-In-Tequila.png?w=150",
    "tag": "Tech",
    "date": "2025-11-13T18:39:52.000Z",
    "description": "When the hosts of the popular All-In podcast launched their own tequila brand at a star-studded party last June, all 750 bottles of the $1,200 spirit quickly sold out. But getting those bottles into customers' hands has proven harder than expected.",
    "body": "\nWhen the hosts of the popular All-In podcast launched their own tequila brand at a star-studded party last June, all 750 bottles of the $1,200 spirit quickly sold out. But getting those bottles into customers’ hands has proven harder than expected.\nThe long-awaited bottles of Besties All-In tequila began shipping last week to those who ordered them, ending a nearly five-month-long wait, Jason Calacanis, one of the podcast’s hosts, told TechCrunch. \nThe holdup was the unusual bottle, Calacanis said: “Handcrafted bottles took a bit longer to create than expected, but the bottles started shipping last week!” The bottle was designed as a collector item and looks like a stack of poker chips illuminated from the bottom. It gives homage to poker, another of the podcast hosts’ favorite pastimes besides drinking tequila.\nBuyers were told at that time that they could expect delivery by the end of summer. But summer came and went. The customers not only dished out the $1,200 but also paid taxes and other fees.  \nA TechCrunch reader told us that delivery was repeatedly delayed: pushed back to October, then November, and most recently, one person was told the delivery would be “after November,” according to a letter seen by TechCrunch from the distributor Flaviar, the spirits marketplace handling distribution.\nBoth the product’s official website and Flaviar’s communications reflected the shifting timeline — the website originally promised end-of-summer delivery but now says shipments will “begin in November.” The Flaviar letter indicated that deliveries were happening in batches.\nWhile it’s still not clear how long it will take the distributor to fulfill all orders, we at least know that shipments have begun and what the holdup was. With any luck, fans of the VCs, pod bros, and “besties” who host All-In will be sipping on the pricey, handcrafted liquor during the upcoming holiday season.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFlaviar has not yet responded to our request for comment.  \n"
  },
  {
    "title": "Apple halves commissions for mini app makers",
    "url": "https://techcrunch.com/2025/11/13/apple-halves-commissions-for-mini-app-makers/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/app-store-2024-v2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T17:32:39.000Z",
    "description": "Apple announced on Thursday the launch of a new developer program, the Mini Apps Partner Program, which will offer a reduced commission rate of 15% on in-app purchases for the mini applications. The iPhone...",
    "body": "\nApple announced on Thursday the launch of a new developer program, the Mini Apps Partner Program, which will offer a reduced commission rate of 15% on in-app purchases for the mini applications.\nThe iPhone maker defines a mini app as a “self-contained” experience that’s built using web technologies like HTML5 and JavaScript, which are distributed within a larger, native app. The technology has been supported on the App Store for nearly a decade, but this is the first time it’s offered a reduced commission on mini app transactions.\nApple in 2017 added a rule to its App Review Guidelines, which lists the specific requirements for mini apps. In guideline 4.7, the company gives developers permission to run mini apps, mini games, streaming games, chatbots, plug-ins, and game emulators that offer software not in the main app’s binary. It also describes how they’re to process sensitive data or filter objectionable material, similar to native apps.\nTo qualify for the new Mini App program, Apple says the main app must be available on iOS or iPadOS and hosted on the App Store, and will need to follow the Apple Developer Program License Agreement and the existing App Review Guidelines, including those for mini apps.\nHowever, the program also adds the new requirements for the apps to support specific Apple technologies, including the Advanced Commerce API and Declared Age Rating API, which ensures apps offer age-appropriate content. They must also use Apple’s in-app purchase system and send information about a user’s in-app purchase to Apple when refunds are requested.\nApple positions the program as a way for developers who host mini apps and games to grow their business on the App Store. It also incentivizes developers to leverage Apple’s technologies, including its trust and safety tools, by offering the benefit of a reduced commission. That additional savings could allow the developers to re-invest in their own mini apps program.\nIn addition, it ensures that Apple will retain its ability to extract a commission from mini applications, even as the market evolves to offer new experiences. \nToday, there are a variety of native iOS apps that offer mini apps, including messengers like LINE or WeChat, or those that offer mini games, like Discord, for example. More recently, AI providers have begun moving into the mini app space. Notably, ChatGPT recently launched apps that run inside its chatbot, allowing users to engage with apps like Booking.com, Expedia, Spotify, Figma, Coursera, Zillow, and Canva. Some have theorized that this platform could eventually evolve to threaten the App Store’s business model if app engagement and transactions moved inside ChatGPT.\nBloomberg recently reported Apple and Tencent agreed to a 15% commission on mini apps in WeChat, but not that the program would be open to other developers.\nDevelopers who want to join Apple’s Mini Apps Partner Program can make a request, and then provide information about their host app, eligibility, and mini app. They also have to agree to the program’s terms and conditions. When their app is ready, they then have to submit it for review. (Apple already asks app developers to include a manifest that allows Apple to review the software and metadata included in the app, plus the links that lead to the mini apps it offers.)\nIn-app purchases inside mini apps qualify for the reduced commission if they are for digital goods and services, including consumable, non-consumable, auto-renewable subscriptions, and non-renewing subscriptions, Apple says.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Apple’s new App Review Guidelines clamp down on apps sharing personal data with ‘third-party AI’",
    "url": "https://techcrunch.com/2025/11/13/apples-new-app-review-guidelines-clamp-down-on-apps-sharing-personal-data-with-third-party-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/app-store-2024-v1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T21:14:35.000Z",
    "description": "Apple on Thursday introduced a new set of App Review Guidelines for developers, which now specifically state that apps must disclose and obtain users’ permission before sharing personal data with third-party...",
    "body": "\nApple on Thursday introduced a new set of App Review Guidelines for developers, which now specifically state that apps must disclose and obtain users’ permission before sharing personal data with third-party AI.\nThe change comes ahead of the iPhone maker’s plan to introduce its own AI-upgraded version of Siri in 2026.\nThat update will see Apple’s digital assistant offer users the ability to take actions across apps using Siri commands, and will be powered, in part, by Google’s Gemini technology, according to a recent Bloomberg report.\nAt the same time, Apple is ensuring other apps aren’t leaking personal data to AI providers or other AI businesses. \nWhat’s interesting about this particular update is not the requirements being described but that Apple has specifically called out AI companies as needing to come into compliance. \nBefore the revised language, the guideline known as rule 5.1.2(i) included language around disclosure and obtaining user consent for data sharing, noting that apps could not “use, transmit or share” someone’s personal data without their permission. This rule served as part of Apple’s compliance with data privacy regulations like the EU’s GDPR (General Data Protection Regulation), California’s Consumer Privacy Act, and others, which ensure that users have more control over how their data is collected and shared. Apps that don’t follow the policy can be removed from the App Store.\nThe newly revised guideline adds the following sentence (emphasis ours): \n\nYou must clearly disclose where personal data will be shared with third parties, including with third-party AI, and obtain explicit permission before doing so.\n\nThis change could impact apps that intend to use AI systems to collect or process information about their users, perhaps to personalize their apps or provide certain functionality. It’s unclear how stringently Apple will enforce the rule, given that the term “AI” could include a variety of technologies — not just LLMs, but also things like machine learning.\nThe updated rule is one of several revisions to the App Review Guidelines out on Thursday. Other changes are focused on supporting Apple’s new Mini Apps Program, also announced today, as well as tweaks to rules involving creator apps, loan apps, and more.\nOne addition also added crypto exchanges to the list of apps that provide services in highly regulated fields.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Uber quietly pilots in-app video recording for drivers in India",
    "url": "https://techcrunch.com/2025/11/13/uber-quietly-pilots-in-app-video-recording-for-drivers-in-india/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/uber-driver-app.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T19:11:18.000Z",
    "description": "Uber's in-app video recording pilot is currently live in 10 cities across India. The tool is meant to deter misconduct in a market where most drivers do not use dashcams, according to Uber.",
    "body": "\nUber has quietly begun piloting in-app video recording for its drivers in India, TechCrunch has learned and confirmed with the company. The tool is meant to deter misconduct in a market where most drivers do not use dashcams, according to Uber.\nHalf a dozen Uber drivers in the Delhi–NCR region told TechCrunch they sometimes face misconduct from riders and, in some cases, are threatened with false complaints about their behavior — allegations that can lead to penalties or even account suspensions.\n“Even female passengers traveling late at night insist that we follow the route they want instead of what’s shown on the map. If we refuse, they threaten to file false complaints,” said one driver, who requested anonymity out of fear of losing his account.\nDrivers said the in-app video recording feature could help protect them in such situations by providing evidence when disputes arise. Still, some questioned whether Uber would back them in cases involving riders, noting that passengers pay for the trip and can easily switch to competing platforms if dissatisfied.\nThe pilot, which began rolling out in phases in May, is now live in 10 cities across India, including Delhi, Mumbai, Bengaluru, Chennai, Pune, Hyderabad, Chandigarh, Kolkata, Jaipur, and Lucknow, the company confirmed to TechCrunch.\nRiders receive an in-trip notification when video recording is active.\nUber’s notification for in-app video recording.Image Credits:Jagmeet Singh / TechCrunch\n“All recordings are double-encrypted, stored on the device, and cannot be accessed by anyone — including Uber — unless a user chooses to share them as part of a safety report,” an Uber spokesperson said, adding that the recordings are automatically deleted after a week if they are not shared.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe video tool builds on Uber’s in-app audio recording feature, which launched in India in 2023. Video recording was first tested in the U.S. in 2022 and is already available in Canada and Brazil.\nAs the pilot expands, Uber will have to balance the feature’s potential to defuse disputes with broader questions about privacy and surveillance in one of its prominent markets. It is unclear when the video recording tool will be rolled out more widely, though the pilot’s performance in the coming months is likely to shape whether Uber extends it across India or to other regions.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The 10 companies that just launched from Betaworks’ latest startup camp",
    "url": "https://techcrunch.com/2025/11/13/the-10-companies-that-just-launched-from-betaworks-latest-startup-camp/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Betaworks-Camp-Interfaces.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T17:06:13.000Z",
    "description": "Early-stage venture fund Betaworks announced the latest 10 companies launching from its prestigious Camp program, the 13-week biannual residence program launched in 2016 that has given way to names like...",
    "body": "\nEarly-stage venture fund Betaworks announced the latest 10 companies launching from its prestigious Camp program, the 13-week biannual residence program launched in 2016 that has given way to names like Hugging Face and Graze Social. \nThe theme for this year’s Camp is Interfaces, as in companies that are designing products that impact how users experience AI. (Previous Camp themes focused on application layers and agents). Applications opened in June, and the camp began in August, with DemoDay being November 4. \nThese are the companies taking part in the 13th Betaworks Camp:\nNora — A browser extension, founded by Sid Banothu, that tracks shopping habits. \nPrimitive — A web app that lets people use voice to dump ideas that the platform then turns into a list of tasks and to-dos. The product, founded by Kasey Klimes, can also link with other productivity tools such as Notion and calendars. \nPatina — Founded by Sean Raspet and Laura Sisson, the company is working on olfactory technology to create “scent photographs,” through a combination of protein folding, scent receptors, and graph neural networks. \nMy Place, by Orange — A platform, founded by Helen Huang, that lets users play games that are realistic simulations of everyday human life. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nPutty (no website yet) — Though the company is still in stealth, Betaworks said it wanted to work with the founder, Kevin Chang, because he was “deeply engaged with concepts” the firm cared about, including “memory systems, ambient interfaces” and “technology fitted to the more sporadic rhythm of life.” \nTelepath — A computer built with AI and no apps, founded by Stephen Hood, Josh Whiting, and Rupert Manfredi. \nFeather — A digital assistant that helps create automated workflows for tedious tasks, like apartment hunting. It was founded by ShaoBo Zhang and Marco Yu. \nNubrain — Founded by Priyanka Jain and Ingo Marquardt, this company is creating EEG data (the test used to record the electrical activity of the brain) to help translate human thoughts into speech, text, and images. \nPresq — This platform, founded by Adam Saleh, Steve Burstyn, and Mikey Robins, lets influencers upload data to create prompt options that let them create manufacturable footwear. It plans to soon expand to other product areas, like eyewear and home goods.\nIntension — Founded by Conor Sanchez O’Shea and Gabriel Duemichen, this company helps people focus while working on a desktop by removing from sight anything that operates as a distraction. It tracks users’ attention and maps out the workflow habits of those working on desktops. \nThis story was updated to clarify what Presq does.\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Facebook Marketplace gets new collaborative and social features, Meta AI integrations",
    "url": "https://techcrunch.com/2025/11/13/facebook-marketplace-gets-new-collaborative-and-social-features-meta-ai-integrations/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/facebook-logo-on-phone.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T17:00:00.000Z",
    "description": "Meta is overhauling Facebook Marketplace with new collaborative tools, social features, an improved checkout experience, and Meta AI integrations, the company announced Thursday. Marketplace is getting a new...",
    "body": "\nMeta is overhauling Facebook Marketplace with new collaborative tools, social features, an improved checkout experience, and Meta AI integrations, the company announced Thursday.\nMarketplace is getting a new “collections” feature that lets users create groups of listings and invite friends to join. Users can get started by saving a listing, starting a new collection, and then choosing whether to make it public or private. They can then add friends to their collection and share updates through Feed, Messenger, WhatsApp, and more. \nMeta’s also testing collaborative buying, which means users can invite a friend to join their chat with a seller. The company says this makes it easier to coordinate pickup, negotiate prices, and get answers to questions.\nImage Credits:Meta\nThese new collaborative features could be useful in instances when a group of roommates is looking to furnish their new apartment or when someone wants to keep their partner in the loop when discussing potential purchases. \nWhile Meta says the changes announced on Thursday are designed to make Marketplace more useful, they also mark the company’s ongoing efforts to bring Meta AI into all of its services and products. Additionally, by blending social, commerce, and AI, the company is looking to boost time spent on Marketplace while also enhancing its competitiveness against other e-commerce platforms.\nIn terms of the Meta AI integrations, Meta is going to start using its AI tools to help buyers ask the right questions when making a purchase. Now, when users start a chat with a seller, they will see a “Suggested questions to ask” button. If they tap it, Meta AI will use the details from the listing and the conversation to suggest questions they might want to ask.\nAdditionally, Meta is bringing AI insights to vehicle listings on Marketplace, noting that vehicles are among the top five searches for young adults. Now, when users view a vehicle listing, they’ll see AI-generated insights that bring together key details like engine options, safety ratings, transmission type, seating and cargo capacity, reviews, and price information.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Meta\nMeta also announced that users can react and comment directly on listings. The company says this will help others learn about item quality and discover new finds. It’ll be interesting to see how people react to this change, as Marketplace has had a simple design since its launch. Some might find the addition of reactions and comments as distracting, or even cluttering the service.\nMeta notes that if a user likes an item, Marketplace will learn what they’re interested in and display more items aligned with their preferences.\nAs part of its announcement, Meta said it began integrating eBay and Poshmark inventory into Marketplace earlier this year to give people more options when it comes to buying across categories like fashion and electronics.\n“Partner listings are marked with an icon on the listing image, and are integrated throughout your Marketplace feed so you’ll see them while you’re browsing,” Meta explained in a blog post. “You can also see the listing and seller’s information on the Marketplace product details page, and when you’re ready to buy, you’ll be taken to the partner’s site for checkout.”\nAs for the improved checkout experience, buyers will now see total costs, including shipping and tax, upfront. They’ll now also receive notifications as the status of their order changes. \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Police take down three cybercrime operations in latest round of ‘whack-a-mole’",
    "url": "https://techcrunch.com/2025/11/13/police-take-down-three-cybercrime-operations-in-latest-round-of-whack-a-mole/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/europol-operation-endgame-rhadamanthys.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T17:25:47.000Z",
    "description": "Authorities from nine countries took down three cybercrime operations, including the Rhadamantys infostealer, which allegedly had access to the crypto wallets of more than 100,000 victims.",
    "body": "\nAn international coalition of law enforcement agencies coordinated by Europol targeted and took down three cybercrime operations in its latest round of what authorities call “Operation Endgame.”\nIn a press release, Europol said that the police operation targeted the infostealing malware Rhadamanthys, a botnet called Elysium, and the remote access trojan VenomRAT. The authorities say all three “played a key role in international cybercrime.” Police seized more than 1,000 servers as part of the operation. \nEuropol said police arrested the unnamed “main suspect” behind VenomRAT in Greece on November 3.\n“The dismantled malware infrastructure consisted of hundreds of thousands of infected computers containing several million stolen credentials,” the press release read. “Many of the victims were not aware of the infection of their systems.”\nAccording to Europol, the main suspect behind Rhadamantys had access to over 100,000 crypto wallets, “potentially worth millions of euros.”\nAs an infostealer, Rhadamantys is designed to steal various kinds of information from infected devices, including passwords and cryptocurrency wallet keys. Rhadamantys spiked in popularity in October after authorities took down the popular infostealer Lumma earlier in the year, showing that after takedowns, criminals adapt by using different hacking tools that might be less known at the time.\nWhen Rhadamantys launched in 2022, it initially relied on spreading through malicious Google advertisements, and later grew thanks to word-of-mouth on underground forums, according to Lumen’s Black Lotus Labs, one of the cybersecurity industry partners in Operation Endgame. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe firm wrote in a blog post that Rhadamantys had a “dramatic uptick” and a “consistent rise in the number of victims” after the Lumma takedown, making it “the largest information-stealer malware by volume.” In October, the infostealer had compromised more than 12,000 victims, according to the firm.\nRyan English, a researcher at Black Lotus Labs, told TechCrunch that Rhadamantys “emerged as the ‘next’ go-to infostealer” after Lumma went down.\n“We know that others will take their place, so we just keep tracking to see who’s emerging from that,” said English, adding that law enforcement and the wider industry “can only do so much at any time.” \n“So in a very real sense, it’s whack-a-mole forever,” said English.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  }
]