[
  {
    "title": "Jennifer Garner’s Once Upon a Farm resumes IPO plans",
    "url": "https://techcrunch.com/2026/01/28/jennifer-garners-once-upon-a-farm-resumes-ipo-plans/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-09-at-1.56.59-PM.png?w=150",
    "tag": "Tech",
    "date": "2026-01-28T19:09:24.000Z",
    "description": "\nIn Brief\nPosted:\n11:09 AM PST · January 28, 2026\n\nImage Credits:Once Upon a Farm\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOrganic food company Once",
    "body": "\nIn Brief\nPosted:\n11:09 AM PST · January 28, 2026\n\nImage Credits:Once Upon a Farm\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOrganic food company Once Upon a Farm, known for its baby food and kids’ snacks, is resuming its IPO plans, per an SEC filing and Reuters. The company had initially planned to hold its IPO last year, though it paused it amid the government shutdown.\nBut it filed an updated S-1 on Tuesday, which offered a price range of $17-$19 a share, indicating that the process has resumed, perhaps signaling that the overall IPO market is starting to thaw. The company is expected to make its debut on February 6, according to IPOScoop.\nOnce Upon a Farm was founded in 2015 and counts actress Jennifer Garner among its co-founders (alongside serial founders Cassandra Curtis and Ari Raz; Garner joined later). With Goldman Sachs and J.P. Morgan as the lead bankers, the company is looking to raise at least $208.9 million at a $764.4 million valuation.\nThe company has raised almost $100 million in funding to date, according to PitchBook, with investors including S2G Ventures and CAVU Consumer Partners. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Startups\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jennifer Garner’s Once Upon a Farm resumes IPO plans",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2018/10/Screen-Shot-2018-10-09-at-1.56.59-PM.png?w=150"
      ],
      "datePublished": "2026-01-28T19:09:24.000Z",
      "dateModified": "2026-01-28T19:09:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk reportedly wants a June SpaceX IPO to align with his birthday, the planets",
    "url": "https://techcrunch.com/2026/01/28/elon-musk-reportedly-wants-a-june-spacex-ipo-to-align-with-his-birthday-the-planets/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1229893101.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T17:12:38.000Z",
    "description": "\nElon Musk is eyeing sometime in June for SpaceX’s blockbuster IPO, according to the Financial Times. The billionaire reportedly wants the offering to",
    "body": "\nElon Musk is eyeing sometime in June for SpaceX’s blockbuster IPO, according to the Financial Times. The billionaire reportedly wants the offering to coincide with both his birthday (June 28th) and the rare alignment of Mercury, Venus, and Jupiter (which is happening in early June).\nRegardless of when it happens, though, SpaceX’s IPO will likely be one of the largest in history: It’s looking to raise at least $50 billion at a $1.5 trillion valuation, per the FT (which also noted that those figures are likely to change).\nThe company wants more funding as it builds its Starship rocket, aiming to reach Mars. SpaceX is one of the nation’s most valuable private companies, and it last held a secondary sale in December that would give it an $800 billion valuation. \n\n\tTopics\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk reportedly wants a June SpaceX IPO to align with his birthday, the planets",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1229893101.jpg?w=150"
      ],
      "datePublished": "2026-01-28T17:12:38.000Z",
      "dateModified": "2026-01-28T17:12:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump’s acting cybersecurity chief uploaded sensitive government docs to ChatGPT",
    "url": "https://techcrunch.com/2026/01/28/trumps-acting-cybersecurity-chief-uploaded-sensitive-government-docs-to-chatgpt/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Madhu-Gottumukkala-2257442289.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T15:22:37.000Z",
    "description": "\nIn Brief\nPosted:\n7:22 AM PST · January 28, 2026\n\nImage Credits:Heather Diehl / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe acting hea",
    "body": "\nIn Brief\nPosted:\n7:22 AM PST · January 28, 2026\n\nImage Credits:Heather Diehl / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe acting head of U.S. cybersecurity agency CISA uploaded sensitive contracting documents marked “for official use only” to ChatGPT, according to Politico.\nThe outlet, citing officials, reported Tuesday that CISA’s acting director, Madhu Gottumukkala, appointed by Trump, triggered multiple automated security warnings that are designed to prevent the theft or inadvertent disclosure of government files from federal networks. \nGottumukkala was reportedly granted an exception to use ChatGPT earlier in his tenure as CISA director at a time when other employees were prohibited. Officials at the Department of Homeland Security, which houses CISA, sought to determine if there was any harm to government security as a result of his uploads.\nUploading unclassified but internal government documents to a public version of a large language model is problematic, as it allows the model to train itself on that information, potentially allowing its contents to be shared with others who use it.\nA CISA spokesperson told Politico that Gottumukkala’s use of ChatGPT was “short-term and limited.”\nPrior to his appointment at CISA, Gottumukkala served as the chief information officer of South Dakota under then-governor Kristi Noem. Following his appointment to CISA, Gottumukkala reportedly failed a counterintelligence polygraph, which Homeland Security later claimed was “unsanctioned,” and subsequently suspended six career staff from accessing classified information.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Security\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump’s acting cybersecurity chief uploaded sensitive government docs to ChatGPT",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Madhu-Gottumukkala-2257442289.jpg?w=150"
      ],
      "datePublished": "2026-01-28T15:22:37.000Z",
      "dateModified": "2026-01-28T15:22:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon says it is laying off 16,000 employees",
    "url": "https://techcrunch.com/2026/01/28/amazon-says-it-is-laying-off-16000-employees/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/09/amazon-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T14:17:30.000Z",
    "description": "\nAmazon said today that it is cutting 16,000 jobs across the company. This reduction comes after the e-commerce company laid off 14,000 people in Octo",
    "body": "\nAmazon said today that it is cutting 16,000 jobs across the company. This reduction comes after the e-commerce company laid off 14,000 people in October.\nIn a letter to employees, Senior VP of People Experience and Technology Beth Galetti said that these layoffs were made for “reducing layers, increasing ownership, and removing bureaucracy.” She noted that the reason for the second round of massive layoffs within three months was that several teams in the company hadn’t finished their restructuring.\nGaletti didn’t outright deny that there might be more job slashes in the company, but said that the company is not trying to create a pattern of large layoffs every few months.\n“Some of you might ask if this is the beginning of a new rhythm – where we announce broad reductions every few months. That’s not our plan. But just as we always have, every team will continue to evaluate the ownership, speed, and capacity to invent for customers, and make adjustments as appropriate,” she said in a blog post.\nIn October, Amazon said that it had 1.57 million employees, and had registered single-digit growth in the past five quarters prior to that, according to the company’s Q3 2025 filings. The company is set to publish its Q4 2025 results next week.\nIn its latest blog post, Galetti said that despite these job cuts, the company will continue to hire in strategic areas. \nLast year, Amazon CEO Andy Jassy wrote a memo that said because of AI, the company will need fewer people “doing some of the jobs that are being done today, and more people doing other types of jobs.” He also indicated that the company’s corporate workforce will see a reduction in the next few years.\nAmazon sent an erroneous meeting invite to numerous AWS employees that addressed job cuts and a “Project Dawn” initiative, confusing workers, as reported by Business Insider. The invite was canceled shortly after.\nOn Tuesday, Amazon said that it is closing its physical Amazon Go and Amazon Fresh Stores to concentrate on increasing capacity for same-day grocery delivery. The company instead plans to expand Whole Foods’ footprint and open 100 new stores over the next few years. \n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon says it is laying off 16,000 employees",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/09/amazon-logo.jpg?w=150"
      ],
      "datePublished": "2026-01-28T14:17:30.000Z",
      "dateModified": "2026-01-28T14:17:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI data labeler Handshake buys  Cleanlab, an acquisition target of multiple others",
    "url": "https://techcrunch.com/2026/01/28/ai-data-labeler-handshake-buys-cleanlab-an-acquisition-target-of-multiple-others/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Cleanlab.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T19:00:00.000Z",
    "description": "\nAI data-labeling startup Handshake has acquired data label-auditing startup Cleanlab, the companies tell TechCrunch.\nHandshake began in 2013 as a pla",
    "body": "\nAI data-labeling startup Handshake has acquired data label-auditing startup Cleanlab, the companies tell TechCrunch.\nHandshake began in 2013 as a platform for hiring college grads and launched a human data-labeling business about a year ago to serve foundational AI model companies. Cleanlab, founded in 2021, is a startup that provides software for improving the quality of data produced by human labelers.\nThe deal’s purpose is primarily to acquire talent, aka an acqui-hire, adding nine key Cleanlab employees to Handshake’s research organization. This includes the startup’s co-founders, who earned their PhDs in computer science from MIT: Curtis Northcutt (pictured above), Jonas Mueller, and Anish Athalye. The terms of the transaction were not disclosed (though, as we previously reported, sometimes an acqui-hire can be surprisingly lucrative for founders.)\nCleanlab has raised a total of $30 million from investors, including Menlo Ventures, TQ Ventures, Bain Capital Ventures, and Databricks Ventures. At its peak, the startup had more than 30 employees.\nCleanlab’s researchers are experts in developing algorithms that flag incorrect data without a second human reviewer. The goal is to improve the quality of the data Handshake produces for AI labs.\n“We have an in-house research team that thinks a lot about where our models are weak, what data should we be producing? How high quality is that data?” Sahil Bhaiwala, chief strategy and innovation officer at Handshake told TechCrunch. “The Cleanlab team has been focusing on this problem for years.”\nNorthcutt, the Cleanlab CEO who’s credited with pioneering its automated data-labeling auditing, said the company received acquisition interest from other AI data-labeling companies. But the startup chose to sell to Handshake because, he said, data-labeling competitors, including Mercor, Surge, and Scale AI, frequently use Handshake’s platform to source human experts such as doctors, lawyers, and scientists for their data-labeling projects.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“If you’re going to pick one, you should probably pick the source, not the middleman,” Northcutt told TechCrunch.\nHandshake, which was last valued at $3.3 billion in 2022, was forecasted to end 2025 at $300 million in annualized revenue run rate (ARR) and is reportedly on track to reach an ARR of “high hundreds of millions” this year. The company has provided data for eight top AI labs, including OpenAI.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI data labeler Handshake buys  Cleanlab, an acquisition target of multiple others",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Cleanlab.jpg?w=150"
      ],
      "datePublished": "2026-01-28T19:00:00.000Z",
      "dateModified": "2026-01-28T19:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp will now charge AI chatbots to operate in Italy",
    "url": "https://techcrunch.com/2026/01/28/whatsapp-will-now-charge-ai-chatbots-to-operate-in-italy/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T19:18:59.000Z",
    "description": "\nMeta announced Wednesday that it will charge developers for running chatbots on WhatsApp in regions where regulators are forcing the company to allow",
    "body": "\nMeta announced Wednesday that it will charge developers for running chatbots on WhatsApp in regions where regulators are forcing the company to allow them. The move comes after the company’s ban on third-party chatbots on WhatsApp took effect on January 15. \nFor now, Meta will charge developers in Italy, where the country’s competition watchdog asked the company to suspend its policy last December. The company said that the new pricing for non-template responses will begin on February 16. Meta plans to charge $0.0691/ €0.0572 / £0.0498 per message to developers for AI responses. This could result in steep bills for developers if users are exchanging thousands of queries with AI chatbots every day.\nEarlier this month, Meta sent notices to developers creating an exemption for Italian phone numbers and allowing AI chatbots to serve those customers. At that time, the company didn’t mention any plans to charge developers.\nCurrently, WhatsApp already charges companies for using its API for various template responses to customers, which include use cases like marketing, utility, or authentication. This includes messages users receive about payment reminders and shipping updates. \n“Where we are legally required to provide AI chatbots through the WhatsApp business API, we are introducing pricing for the companies that choose to use our platform to provide those services,” a Meta spokesperson told TechCrunch. This could also establish a precedent for other geographies if Meta has to cave in and allow developers to operate their chatbots.\nMeta first announced this past October that it would block all third-party AI chatbots from using WhatsApp through its WhatsApp Business API. \nMeta said its systems weren’t designed to handle responses from AI bots and were being strained. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“The emergence of AI chatbots on our Business API put a strain on our systems that they were not designed to support. This logic assumes WhatsApp is somehow a de facto app store. The route to market for AI companies is the app stores themselves, their websites, and industry partnerships; not the WhatsApp Business Platform,” the company said at that time.\nSince then, various regions, including the EU, Italy, and Brazil, have started anticompetitive probes. Brazil’s watchdog initially asked Meta to suspend the policy. However, a court in Brazil sided with Meta last week and overturned the preliminary order blocking the new policy. As a result, the company has asked developers not to provide their AI chatbots to users in Brazil, TechCrunch has learned. \nSince the policy has kicked in, developers are forced to send a pre-defined message to users of their AI chatbot on WhatsApp to redirect them to their site or app. Providers like OpenAI, Perplexity, and Microsoft announced last year that their WhatsApp bots would not work after January 15, urging users to access them on other platforms.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp will now charge AI chatbots to operate in Italy",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150"
      ],
      "datePublished": "2026-01-28T19:18:59.000Z",
      "dateModified": "2026-01-28T19:18:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Modelence raises $3M to smooth out the vibe-coding stack",
    "url": "https://techcrunch.com/2026/01/28/modelence-raises-13-million-to-smooth-out-the-vibe-coding-stack/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/modelence.jpeg?w=143",
    "tag": "Tech",
    "date": "2026-01-28T17:00:00.000Z",
    "description": "\nAs AI tools have democratized software engineering, a new generation of users have emerged, eager to build their own apps. But just as LLMs speed up ",
    "body": "\nAs AI tools have democratized software engineering, a new generation of users have emerged, eager to build their own apps. But just as LLMs speed up the coding process, the old problems of hosting, security, and general DevOps problems have persisted.\nThere’s an obvious business opportunity in solving that problem, but with the system changing so quickly, it’s hard to know how to grab hold of it.\nOne of the more interesting answers comes from Modelence, a Y Combinator startup from this summer’s batch that announced on Wednesday it raised a $3 million seed round. Y Combinator led the round, with participation from Rebel Fund, Acacia Venture Capital Partners, Formosa VC, and Vocal Ventures.\nModelence isn’t the only company going after this sector. Giants like Google and Amazon, as well as smaller startups like Shuttle, are all trying to solve the infrastructure issue.California-based Modelence stands out for how it’s diagnosing the problem. For CEO Aram Shatakhtsyan, the issue isn’t individual services; it’s the connections between them.\n“You don’t want to ask AI to go build authentication and then set up a database and then connect them together, because it’s very likely to break,” Shatakhtsyan told TechCrunch in a recent interview.\nIt’s an interesting diagnosis because it explains how there can be so many world-class service providers contributing to such a rickety system.\n“Vercel covers most of your front end, and Supabase covers the database and the layer on top of it. But you still have to stitch the rest of it together,” he said, explaining the various products software engineers use today. “In the best case, you get two cloud systems.” In short, there is a lot of room to make mistakes.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nModelence’s approach is to provide something like an all-in-one service. Their framework, or toolkit, works on TypeScript, with the company handling authentication, databases, hosting, LLM observability tools, and even their own Lovable-style app builder just to eliminate the extra friction.\nIt’s an interesting idea, and it will be fun to see if they can draw in users. But with the landscape for code-adjacent tools changing this fast, it will be a real challenge just keeping up.\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Modelence raises $3M to smooth out the vibe-coding stack",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/modelence.jpeg?w=143"
      ],
      "datePublished": "2026-01-28T17:00:00.000Z",
      "dateModified": "2026-01-28T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LinkedIn will let you show off your vibe-coding chops with a certificate",
    "url": "https://techcrunch.com/2026/01/28/linkedin-will-let-you-show-off-your-vibe-coding-chops-with-a-certificate/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-2150483457-e1717774844734.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T15:06:27.000Z",
    "description": "\n\t\n\t\tImage Credits:Artur Widak/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t7:06 AM PST · January 28, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nFinally, a way to prove to your LinkedI",
    "body": "\n\t\n\t\tImage Credits:Artur Widak/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t7:06 AM PST · January 28, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nFinally, a way to prove to your LinkedIn followers that you’re proficient in vibe coding.\nLinkedIn announced a new partnership on Wednesday allowing users to display official certifications in AI skills, drawing on usage data from prominent AI apps. The integration includes the video and podcast editor Descript, coding apps Lovable and Replit, and AI agent building platform Relay.app.\nThese platforms will use AI to assess your skills as you use them, and generate a certificate based on your usage patterns, product outcomes, and proficiency within the tools. The Microsoft-owned social network didn’t provide exact details on what users would need to do to qualify as proficient on the platform.\nImage Credits:LinkedIn\nOnce granted, certifications will appear on your LinkedIn profile alongside other professional skills. \nLinkedIn plans to add more partners to the program in the coming months, including Gamma, GitHub, and Zapier. The platform is also inviting companies to register interest in being a partner in the new verified skills program.\nImage Credits:LinkedIn\n“Jobs require fluency in the technology your employer depends on and AI proficiency; the ability to use these tools to deliver today is now the most in-demand skill. Today, trust matters more than ever. More than 100 million professionals have verified their identity on LinkedIn. Now, with the addition of verified skills, you can add an additional way to prove what you can actually do,” Hari Srinivasan, VP of Product at LinkedIn, said in a statement.\nAccording to a report by the learning platform edX published last August, the number of job postings that required AI as a skill doubled in the trailing 12 months. A separate report from Indeed’s Hiring Lab echoed the same trend and noted that the number of U.S. job postings mentioning AI-related keywords rose to 4.2% by the end of 2025. The report mentioned that tech is still the most common sector where companies use AI-related words in postings, but other sectors like banking and marketing are also rising.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LinkedIn will let you show off your vibe-coding chops with a certificate",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-2150483457-e1717774844734.jpg?w=150"
      ],
      "datePublished": "2026-01-28T15:06:27.000Z",
      "dateModified": "2026-01-28T15:06:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The AI infrastructure boom shows no sign of slowing down",
    "url": "https://techcrunch.com/2026/01/28/the-ai-infrastructure-boom-shows-no-sign-of-slowing-down/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/ASML-GettyImages-2258043611.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T15:21:35.000Z",
    "description": "\nOne way to track the speed of the AI boom is to follow the hardware supply chain. Nvidia is the classic example: As AI companies build out data cente",
    "body": "\nOne way to track the speed of the AI boom is to follow the hardware supply chain. Nvidia is the classic example: As AI companies build out data centers, they’re buying up billions of dollars of GPUs each month, turning Nvidia into the most valuable company on earth. But Nvidia has suppliers too, and looking at them can give us an even longer-term view of the market.\nThat’s why we care about ASML, a Dutch photolithography company that has become a key linchpin for the semiconductor industry. ASML is the sole supplier of the EUV equipment needed to make cutting-edge chips, making it a central supplier for the entire industry. When ASML does well, it’s because companies are expecting to sell a lot of semiconductors.\nAnd based on the quarterly earnings released Wednesday morning, the company is doing very well indeed.\nThe topline figure is 32.7 billion euros in net sales, which is a lot of money by any standard. But for our purposes, the most important figure is “new bookings,” which represent the new orders that came in this quarter. Looking at those orders tells us how much capacity chip manufacturers think they’ll need, based on the orders they expect from data center buildouts in the years to come.\nBy that metric, the AI infrastructure boom is still going strong. Last quarter, ASML brought in 13 billion euros’ worth of new orders, a new record for the company and more than double the orders that came in the quarter before.\nIn an earnings statement, ASML CEO Christophe Fouquet made it clear the extra demand was coming from AI. \n“In the last months, many of our customers have shared a notably more positive assessment of the medium-term market situation, primarily based on more robust expectations of the sustainability of AI-related demand,” Fouquet wrote. In non-CEO English, that means their customers expect AI labs will really need all the data centers they’re building, and they’re spending money now so they can be ready to supply the chips.\nTo be clear: None of this is guaranteed to happen. The future is unwritten! It may be years before all those orders are filled, and some clients may pull out before delivery time. The dreaded Zitron predictions could still come true and bring it all crashing down.\nBut if you were waiting for companies to back-pedal on the trillions of dollars in projected infrastructure spending… you may be waiting for a while.\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The AI infrastructure boom shows no sign of slowing down",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/ASML-GettyImages-2258043611.jpg?w=150"
      ],
      "datePublished": "2026-01-28T15:21:35.000Z",
      "dateModified": "2026-01-28T15:21:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple tells Patreon to move creators to in-app purchase for subscriptions by November",
    "url": "https://techcrunch.com/2026/01/28/apple-tells-patreon-to-move-creators-to-in-app-purchase-for-subscriptions-by-november/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/patreon-logo-v1.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T17:45:00.000Z",
    "description": "\nCreator platform Patreon is taking issue with Apple’s new mandate that forces all creators to move to a subscription billing model, which now has a n",
    "body": "\nCreator platform Patreon is taking issue with Apple’s new mandate that forces all creators to move to a subscription billing model, which now has a new transition deadline of November 1, 2026. \nWhile the coming changes will only impact the 4% of creators who are still using Patreon’s legacy billing models, the company’s announcement stressed that Apple’s lack of consistency around its changing terms has made it hard for creators to build healthy, long-term businesses.\nWhat Patreon is referring to is the mandate Apple announced in 2024 around subscription billing changes. It said that Patreon must move all its creators to subscription billing using Apple’s in-app purchase system by November 2025 or else Patreon would risk removal from the App Store. Apple made this decision because Patreon was managing the billing for some percentage of creators’ subscriptions, and the tech giant saw that as skirting its App Store commission structure.\nTo Apple’s credit, Patreon was given plenty of time to migrate its customers to Apple’s in-app purchases. \nThe company said it would switch creators to subscription billing in November 2024, and creators could choose whether to increase their subscription prices to cover Apple’s fees. In addition, creators could opt to delay changes until November 2025 if they needed more time. However, they wouldn’t be able to offer subscriptions in the app until they adopted Apple’s in-app purchases.\nLast May, Patreon took advantage of newly loosened App Store guidelines resulting from the U.S. court ruling in Epic v. Apple to offer creators the ability to process web payments from links in Patreon’s app. At the time, Patreon told creators that the earlier November 2025 deadline was no longer in effect. This gave creators even more time to decide what to do about their subscription businesses.\nThe company says now that its decision to pause the transition for its creators may have added to the confusion given that Apple is now reimposing a transition deadline of November 2026.\nWhile Patreon is complying with Apple’s decision, it’s clearly bristling at the idea that the tech giant should have a say in how creators run their businesses.\n“We strongly disagree with this decision,” its blog post states. \n“Creators need consistency and clarity in order to build healthy, long-term businesses. Instead, creators using legacy billing will now have to endure the whiplash of another policy reversal — the third such change from Apple in the past 18 months. Over the years, we have proposed multiple tools and features to Apple that we could’ve built to allow creators using legacy billing to transition on their own timelines, with more support added in. Unfortunately, Apple has continually declined them,” it says.\nCreators can read more about the transition plan on Patreon’s website. It has also built several tools to support these changes, including a benefit eligibility tool to see who has paid or is scheduled to pay, tier repricing tools, and gifting and discount tools to offer payment flexibility. An option for annual-only memberships will be introduced before November 2026 as well.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple tells Patreon to move creators to in-app purchase for subscriptions by November",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/patreon-logo-v1.jpg?w=150"
      ],
      "datePublished": "2026-01-28T17:45:00.000Z",
      "dateModified": "2026-01-28T17:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Allbirds is closing its last brick-and-mortar store in San Francisco",
    "url": "https://techcrunch.com/2026/01/28/allbirds-closing-last-store-san-francisco/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/11/GettyImages-1337507283.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T16:48:07.000Z",
    "description": "\nIf the final San Francisco Allbirds store closes its doors and no one is around to hear them shut, did it make a sound?\nOnce symbolic of a mid-2010s ",
    "body": "\nIf the final San Francisco Allbirds store closes its doors and no one is around to hear them shut, did it make a sound?\nOnce symbolic of a mid-2010s San Francisco tech bro, the shoe brand Allbirds is closing almost all of its physical stores by the end of February. Just two outlet stores in the U.S. and two full-price stores in London will remain.\n“This is an important step for Allbirds, as we drive toward profitable growth under our turnaround strategy,” Allbirds CEO Joe Vernachio said in a statement. “We have been opportunistically reducing our brick-and-mortar portfolio over the past two years. By exiting these remaining unprofitable doors, we are taking actions to reduce costs and support the long-term health of the business.”\nThe typical Allbirds wearer knows that this kind of corporate speak is a thinly veiled way to say the current financial outlook of the company isn’t great.\nAllbirds was founded in San Francisco in 2015 and quickly became the “it” shoe among startup employees (even TechCrunch staffers once received branded gray Allbirds shoes as company swag — is our current lack of matching footwear a recession indicator?). \nThe shoes are admittedly quite comfortable, but ugly in a way that only unstylish tech bros would seek out (the white wool runners are cool in a minimalist way, though). They’re like Skechers, embracing comfort above all else, but they’re more expensive. And unlike Skechers, Allbirds did not create a line of footwear with the one and only Martha Stewart.\nLike the companies that its customers probably work for, Allbirds raised enough venture capital to secure an overly inflated unicorn valuation, only to go public in 2021 and flounder. The company’s market capitalization is now about $32 million and its stock hovers at just a few dollars per share, but at least it has the very cool Nasdaq ticker symbol $BIRD.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis isn’t quite the end of the Allbirds era. The shoes remain available online, and while expensive, they are genuinely pretty good shoes. But perhaps it marks the end of an era in which working in tech seemed like the ticket to lifelong stability. Now your company can only afford branded Patagonia vests if you’re working in AI, and even then, you might be haunted by an undercurrent of anxiety that the AI bubble might burst.\nPerhaps this anxiety is fueling the next era of Silicon Valley style, in which everything needs to be as efficient as possible. Tech bros now wear Oura rings to track their biometric data, log their macros on MyFitnessPal, and eat Sweetgreen “Power Max” protein bowls with over 100 grams of protein.\nIn that light, maybe it makes sense that people are so nostalgic for 2016.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Allbirds is closing its last brick-and-mortar store in San Francisco",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/11/GettyImages-1337507283.jpg?w=150"
      ],
      "datePublished": "2026-01-28T16:48:07.000Z",
      "dateModified": "2026-01-28T16:48:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "San Francisco Police Department investigating Zoox collision with a parked car",
    "url": "https://techcrunch.com/2026/01/28/san-francisco-police-department-investigating-zoox-collision-with-a-parked-car/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/zoox-san-francisco.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T17:04:12.000Z",
    "description": "\nThe San Francisco Police Department is investigating an accident involving a Zoox autonomous vehicle that crashed into the driver’s-side door of a pa",
    "body": "\nThe San Francisco Police Department is investigating an accident involving a Zoox autonomous vehicle that crashed into the driver’s-side door of a parked car, TechCrunch has learned.\nOfficers responded to the crash, which occurred at around 2 p.m. local time on January 17 near the intersection of 15th and Mission Streets, according to the department. The Zoox robotaxi was traveling along 15th street when a street ambassador named Jamel Durden opened the driver’s-side door of his 1977 Cadillac Coupe DeVille, according to Mission Local, which first reported the crash.\nDurden’s hand was reportedly smashed during the crash, and the Zoox vehicle suffered damage to its glass doors. The San Francisco Police Department (SFPD) told TechCrunch the Zoox vehicle was carrying a passenger at the time, which has not been previously reported. That passenger was an employee of Zoox, according to the company, and was not injured, which the SFPD confirmed.\nThe police department declined to provide TechCrunch with an incident report “[d]ue to the fact it is still an open investigation.” Zoox filed its own police report about the incident, the company told TechCrunch, but said no additional details have been requested. In a statement on January 20, Zoox said it was “cooperating with local authorities to provide an accurate account of the incident.”\nThe California Department of Motor Vehicles, which regulates autonomous vehicles in the state, has also met with Zoox about the January 17 crash. The DMV told TechCrunch that Zoox filed a crash report “in compliance with California regulations.” That report is not yet publicly available. \nZoox is in the early stages of building out its robotaxi service in San Francisco. In November, the company started offering free rides to members of the public who are part of the “Zoox Explorer” early-rider program. The company is operating a similar program in Las Vegas, Nevada.\nThis rollout has come with challenges. The Amazon-owned company issued a recall in December to fix an issue where some of its vehicles were crossing center lanes and blocking crosswalks. (Zoox also issued two different software updates during recalls earlier in 2025 before it started offering public rides.)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe January crash in San Francisco happened when Durden “suddenly opened” the door of his car into the path of the robotaxi, according to Zoox. The company said the robotaxi “identified the opening door and tried to avoid it but contact was unavoidable.” (Durden could not be reached for comment.)\nZoox also said it offered medical attention to Durden, who allegedly declined. According to Mission Local, Durden refused medical treatment until his car was towed.\n“Safety and transparency are foundational to Zoox, and we are cooperating with local authorities to provide an accurate account of the incident,” the company said in a statement.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "San Francisco Police Department investigating Zoox collision with a parked car",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/04/zoox-san-francisco.jpg?w=150"
      ],
      "datePublished": "2026-01-28T17:04:12.000Z",
      "dateModified": "2026-01-28T17:04:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Samsung teases new privacy feature to hide your Galaxy phone screen from onlookers",
    "url": "https://techcrunch.com/2026/01/28/samsung-teases-new-privacy-feature-to-hide-your-galaxy-phone-screen-from-onlookers/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/Samsung-Mobile-Galaxy-Unpacked-2025-Galaxy-S25-Series-A-True-AI-Companion_dl1.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T14:44:18.000Z",
    "description": "\n\t\n\t\tImage Credits:Samsung\t\n\t\n\t\t\t\t\t\t6:44 AM PST · January 28, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSamsung today previewed a privacy feature that will prevent others ",
    "body": "\n\t\n\t\tImage Credits:Samsung\t\n\t\n\t\t\t\t\t\t6:44 AM PST · January 28, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSamsung today previewed a privacy feature that will prevent others from peeking at your phone screen and viewing its content.\nWhile the company didn’t provide specifics about the technology, it said that Galaxy smartphone owners will be able to control what others around them can see on their phone, based on the privacy protection they need. \nThe Korean tech company said that users will be able to customize this feature to work with specific apps or while entering passcodes, PINs, patterns, or passwords, with multiple settings for adjusting visibility of on-screen content. \nThe feature is likely to launch with the company’s upcoming Galaxy S26 Ultra. \n“Our phones are our most personal space, but we use them in the least private places…That’s why Samsung will soon unveil a new layer of privacy to shield your phone from shoulder surfing wherever you go. You’ll have the space to check your messages or enter a password on public transit without thinking twice about who might be watching,” the company noted in a newsroom announcement.\n\nThe company added that you will also be able to hide certain parts of the phone from onlookers, such as the notification pop-up area. Samsung said that it is using a mix of hardware and software to achieve its results.\nAn online tipster who goes by the name of Ice Universe posted screenshots on X about the feature, showing how the notification area blanks out at an angle. That means smartphone owners will be able to see the content, but someone sitting next to them might not be able to. If the feature works, people may no longer need to buy separate privacy guard protectors.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\nExclusive！The privacy screen on the Samsung S26 Ultra goes far beyond a global privacy mode. It also supports partial, localized privacy control.Here is how it works.You can apply privacy protection to only a specific part of the screen, for example a message notification… pic.twitter.com/RWJPtR0qc8— Ice Universe (@UniverseIce) January 28, 2026\n\nUsing smartphones in public places can be risky. As users enter private information, such as passwords, any onlooker could view these details. A few years ago, The Wall Street Journal reported that thieves often watched users enter their passcodes and used that info to lock victims out of their accounts. To prevent this from happening, Apple released a “Stolen Device Protection” update in iOS 17.3 that required users to use Face ID or Touch ID before changing sensitive settings or accessing saved payment methods.\nSamsung hasn’t given a definitive date of release of the feature or the Galaxy S26 Ultra. Reports suggest that the company will hold an event in February to launch the device.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung teases new privacy feature to hide your Galaxy phone screen from onlookers",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/Samsung-Mobile-Galaxy-Unpacked-2025-Galaxy-S25-Series-A-True-AI-Companion_dl1.jpg?w=150"
      ],
      "datePublished": "2026-01-28T14:44:18.000Z",
      "dateModified": "2026-01-28T14:44:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Standard Nuclear raises $140M as nuclear power enters its gold rush era",
    "url": "https://techcrunch.com/2026/01/28/standard-nuclear-raises-140m-as-nuclear-power-enters-its-gold-rush-era/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/standard-nuclear-lab.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T15:07:37.000Z",
    "description": "\nAs the nuclear power gold rush enters into full swing — spurred by AI companies’ desperate need for electricity —  the sellers of “picks and shovels”",
    "body": "\nAs the nuclear power gold rush enters into full swing — spurred by AI companies’ desperate need for electricity —  the sellers of “picks and shovels” are starting to cash in, too.\nBy the end of 2025, nuclear startups had raised $1.1 billion, all for small modular reactors. The deal flow is now extending to those critical suppliers in the nuclear industry. And Standard Nuclear, which makes nuclear fuel to feed those reactors, is one of them.\nThe company said it has raised $140 million in a Series A round led by Decisive Point with participation from Andreessen Horowitz, Chevron Technology Ventures, Crucible Capital, Fundomo, StepStone Group, Washington Harbour Partners, Welara, and XTX Ventures.\nThe round was completed in two tranches of $70 million each after Standard Nuclear hit milestones sooner than expected in the wake of President Donald Trump’s nuclear-related executive orders last year, a company spokesperson told TechCrunch. \nThe new round comes seven months after Standard Nuclear emerged from “stealth” with $42 million in funding. Air quotes are required here; Standard Nuclear is built on the ashes of the Ultra Safe Nuclear Corporation (USNC), which went bankrupt in October 2024. The bankrupt company had been working to commercialize a nuclear fuel called TRi-structural ISOtropic particle fuel, or TRISO, for years. Decisive Point’s founder, Thomas Hendrix, bought USNC’s fuel-related assets in the bankruptcy auction for $28 million.\nTRISO fuel was originally conceptualized in the 1950s. Uranium particles about the size of a poppy seed are coated in ceramic and carbon. Those are then packed into larger spheres. Altogether, the design of the fuel pellets is supposed to be more resistant to melting down.\nTRISO isn’t widely used today. And yet, many nuclear startups say they’ll be using TRISO in their reactors. Standard Nuclear has said it has $100 million in non-binding sales for 2027. Its customers include Radiant Energy, another Decisive Point portfolio company, and Nano Nuclear Energy, which bought USNC’s reactor assets.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nStandard Nuclear’s years of experience could put it in the lead. But if nuclear startups can’t deliver large numbers of reactors on the timelines they’ve promised — they all face steep challenges in scaling manufacturing — Standard Nuclear could, just like its predecessor, find itself too far ahead of the puck.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Standard Nuclear raises $140M as nuclear power enters its gold rush era",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/standard-nuclear-lab.jpeg?w=150"
      ],
      "datePublished": "2026-01-28T15:07:37.000Z",
      "dateModified": "2026-01-28T15:07:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chrome takes on AI browsers with tighter Gemini integration, agentic features for autonomous tasks",
    "url": "https://techcrunch.com/2026/01/28/chrome-takes-on-ai-browsers-with-tighter-gemini-integration-agentic-features-for-autonomous-tasks/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/chrome_rollercoaster-1.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-28T18:00:00.000Z",
    "description": "\nLast year, a swarm of AI browsers from companies like OpenAI, Perplexity, Opera, and The Browser Company launched with the aim to replace Chrome with",
    "body": "\nLast year, a swarm of AI browsers from companies like OpenAI, Perplexity, Opera, and The Browser Company launched with the aim to replace Chrome with features like sidebar assistants and automated tasks. Now Google is flexing its own AI muscle by adding similar features to Chrome, the world’s largest browser by market share.\nWhile Google had introduced Gemini to Chrome last September, the assistant lived in a floating window. With this update, the company will put its AI helper into a persistent sidebar, so you can ask questions about the current website or other open tabs.\nOne interesting feature Google demoed to press ahead of today’s launch involved multiple tabs. When you open different tabs from a single web page, the Gemini sidebar understands them as a context group. This is helpful when you are comparing prices or different products you’re considering purchasing.\nImage Credits:Google\nBefore today, the Gemini in Chrome feature was available only to Windows and macOS users. With this rollout, the sidebar will be available to Chromebook Plus users as well.\nGoogle is also taking advantage of its newly launched personal intelligence feature, which connects to your Gmail, Search, YouTube, and Google Photos accounts, allowing you to ask questions based on your own data. This feature will roll out in Chrome in the coming months, meaning that you can ask Gemini in the sidebar about things like your family’s schedule, or ask it to draft an email and send it without switching to Gmail.\nThere’s a new Nano Banana integration coming to Chrome, too, that allows you to modify an existing image with another image or product that you find while browsing.\nHowever, the most ambitious feature is called auto-browse, which aims to handle tasks for you by using your personal information and traversing websites on your behalf. For instance, you can ask the agentic feature to go to a particular website and buy an item for you, and find a discount coupon. The agent will ask for your intervention when performing data-sensitive tasks, such as logging into a website or making a final purchase. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLast year, the company explained that these features would use Chrome’s password manager or saved card details, but said its AI models wouldn’t be exposed to any of these details.\nThis feature is rolling out initially to AI Pro and Ultra subscribers in the U.S. \n\nLoading the player…\n\nBrowser-based agents are finicky and often fail to complete tasks. Google’s demo, just like tons of other AI demos, involved shopping and travel planning. In real-world use cases, agents often don’t get the intent or break during traversing different sites, and that would be a challenge for wider adoption.  \nThe company said that in its early testing, users have used the feature for tasks such as scheduling appointments, filling out tedious online forms, collecting their tax documents, getting quotes for plumbers and electricians, and filing expense reports.\nThe company said that the Gemini sidebar support and Nano Banana integration are arriving starting today, while the personal intelligence feature will be available in the “coming months.”\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chrome takes on AI browsers with tighter Gemini integration, agentic features for autonomous tasks",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/chrome_rollercoaster-1.jpeg?w=150"
      ],
      "datePublished": "2026-01-28T18:00:00.000Z",
      "dateModified": "2026-01-28T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]