[
  {
    "title": "Open source agentic startup LangChain hits $1.25B valuation",
    "url": "https://techcrunch.com/2025/10/21/open-source-agentic-startup-langchain-hits-1-25b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/unicorns-evergreen_720.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T22:12:46.000Z",
    "description": "\nIn Brief\nPosted:\n3:12 PM PDT · October 21, 2025\n\nImage Credits:Bryce Durbin\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLangChain raised $125 million ",
    "body": "\nIn Brief\nPosted:\n3:12 PM PDT · October 21, 2025\n\nImage Credits:Bryce Durbin\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLangChain raised $125 million at a $1.25 billion valuation, the company announced on Monday. TechCrunch reported in July that the provider of a popular open source framework for building AI agents was raising fresh funds at a valuation of at least $1 billion. The deal was led by IVP, as we previously reported. New investors CapitalG and Sapphire Ventures joined in, as did existing investors Sequoia, Benchmark, and Amplify.\nLangChain began in 2022 as an open source project founded by machine learning engineer Harrison Chase. The startup was an early darling of the AI era, solving problems that made building apps with early-stage LLMs difficult, such as searching the web, calling APIs, and interacting with databases. It became a smash hit project, and Chase launched a startup with a $10 million seed round from Benchmark in April 2023. A week later, Chase raised a $25 million Series A led by Sequoia, reportedly valuing LangChain at $200 million.\nAs state-of-the-art model makers have added more infrastructure, LangChain has evolved to become a platform for building agents. In addition to announcing its unicorn status, the company launched updates to all of its major products, including its agent builder LangChain, its orchestration and context/memory tool LangGraph, and its testing/observability tool LangSmith. LangChain remains hugely popular among open source devs, with 118,000 stars and 19.4 forks on GitHub.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Open source agentic startup LangChain hits $1.25B valuation",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/unicorns-evergreen_720.jpg?w=150"
      ],
      "datePublished": "2025-10-21T22:12:46.000Z",
      "dateModified": "2025-10-21T22:12:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bill Gates’s old climate lobbyists launch a new firm",
    "url": "https://techcrunch.com/2025/10/21/bill-gatess-old-climate-lobbyists-launch-a-new-firm/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-950173010.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T18:54:52.000Z",
    "description": "\nIn Brief\nPosted:\n11:54 AM PDT · October 21, 2025\n\nImage Credits:Melinda Podor / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nBack in March",
    "body": "\nIn Brief\nPosted:\n11:54 AM PDT · October 21, 2025\n\nImage Credits:Melinda Podor / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nBack in March, Bill Gates’s Breakthrough Energy organization disbanded its energy policy team, cutting dozens of staffers. Now, some of them have founded a new organization, the nonprofit Clean Economy Project.\nSimilar to Breakthrough Energy, the organization is betting that clean energy can beat fossil fuels on cost, if not today then in the near future. \nGates cut Breakthrough’s lobbying group after deciding it wouldn’t make much headway with the Trump administration, according to a New York Times report in March.\nCleanEcon, as it’s informally called, is backed by an undisclosed group of more than 10 funders that includes philanthropists and venture capitalists. The team, which is 10 strong, says it has three goals: “building energy projects faster; accelerating innovation to lower costs; and derisking private investment into clean industries,” it said in a press release.\nAliya Haq, who was vice president of U.S. policy and advocacy at Breakthrough Energy for nearly six years, is the organization’s president.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Climate\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bill Gates’s old climate lobbyists launch a new firm",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-950173010.jpg?w=150"
      ],
      "datePublished": "2025-10-21T18:54:52.000Z",
      "dateModified": "2025-10-21T18:54:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Fi to add AI-enhanced audio and RCS web messaging",
    "url": "https://techcrunch.com/2025/10/21/google-fi-to-add-ai-enhanced-audio-and-rcs-web-messaging/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/rubaitul-azad-pBaJRaF4x9Q-unsplash.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T18:23:12.000Z",
    "description": "\nGoogle announced on Tuesday that Google Fi, its telecommunications service, is getting several new updates, including AI noise filters and RCS web me",
    "body": "\nGoogle announced on Tuesday that Google Fi, its telecommunications service, is getting several new updates, including AI noise filters and RCS web messaging.\nThe tech giant says calls will now use AI-enhanced audio to reduce background noise and improve voice clarity, even when speaking to someone on a landline or older device. The company says the update should allow for “more natural-sounding conversations.” \nWhile the feature will be turned on automatically, users will have the option to turn it off. AI-enhanced audio is rolling out next month.\nAs for the RCS web messaging, Google is updating its “Messages for web” integration with a new interface that includes full RCS support for sharing hi-res photos and videos in message threads. The update will roll out in December.\nAdditionally, Google Fi is expanding the availability of its Wi-Fi Auto Connect+ feature, which puts users on premium Wi-Fi so their connection is more reliable in crowded places like airports or malls.\n“We’re expanding availability of this feature to millions of locations, including supported major airports like LAX, ORD, and JFK, and participating shopping malls and stores,” wrote Jane Harnett, Senior Product Manager, Google Fi Wireless, in the blog post. “It works automatically, and it’s available at no extra cost. Plus, we’re the only major carrier to automatically secure your online activity with an encrypted connection when you’re on premium Wi-Fi.”\nThe company says users will know they’re connected via Wi-Fi Auto Connect+ when they see the W+ icon in their status bar.\nGoogle also announced that the Google Fi app is introducing personalized AI-powered summaries that explain charges, monthly changes, and how plan adjustments could affect future costs.\nAs part of Tuesday’s announcement, Google Fi is launching a limited-time promotion for new Google Fi subscribers that offers 50% off for 15 months when they bring a phone and join the service’s “Unlimited Essentials” or “Unlimited Plan.” \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Fi to add AI-enhanced audio and RCS web messaging",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/rubaitul-azad-pBaJRaF4x9Q-unsplash.jpg?w=150"
      ],
      "datePublished": "2025-10-21T18:23:12.000Z",
      "dateModified": "2025-10-21T18:23:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Serval raises $47M to bring AI agents to IT service management",
    "url": "https://techcrunch.com/2025/10/21/serval-raises-47-million-to-bring-ai-agent-to-it-service-management/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Serval-co-founders.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T15:48:45.000Z",
    "description": "\nSome startups pride themselves on having prestigious financial backers — but just as important is having prestigious customers.\nIt’s one of the main ",
    "body": "\nSome startups pride themselves on having prestigious financial backers — but just as important is having prestigious customers.\nIt’s one of the main points of pride for Serval, an enterprise AI company that announced a $47 million Series A round on Tuesday. The round was led by Redpoint Ventures, with participation from heavy-hitting venture firms like First Round, General Catalyst, and Box Group. But even more impressive than the funders is the company’s list of clients, which include major AI players like Perplexity, Mercor, and Together AI.\nIn broad strokes, Serval is using agentic AI models to automate IT service management, but the company has a unique approach that takes advantage of agentic AI’s powers while avoiding many of its pitfalls. One agent is used to code internal automations for everyday tasks, like authorizing software or provisioning a device. The founders see it as a kind of vibe-coding tool, overseen by an IT manager, but doing most of the work on its own. A separate help desk agent responds to user requests by calling those tools on command, following rules established by the tool.\nServal CEO Jake Stauch says the key was to make the process of building a tool as simple as possible. \n“We don’t want them to feel the marginal cost of building these automations,” Stauch told TechCrunch. “We want to make it easier to automate something forever than do it manually once.”\nSplitting the task into two agents — one to build tools and one to use them — also gives managers a way to keep an eye on permissions. When an automation is created, the manager will set rules for when it can be used, which provides an extra line of defense against overeager help desk agents.\nEnterprise clients are keenly aware of the risks of a rogue AI system, which is part of why Serval decided against a single all-purpose Help Desk Agent. \n“You don’t want someone to go into Slack and say, ‘Hey, I want to delete all the data at the company,’ and the very helpful AI agent responds, ‘Great, I’ll delete all the data,” Stauch told TechCrunch. “Instead it will say, ‘Hey, I don’t have a tool for deleting all the data the company. But I do have a tool for resetting your password or doing one of these other tasks.’”\nBecause the tools themselves are deterministic, they can include extremely complex permissions, like only allowing certain actions after a certain multi-factor authentication process or within a certain time frame. And any time those rules need to be changed, there’s an AI agent at the ready to dive into the codebase and change it.\nIt’s a new approach to the very common problem of how to oversee agentic AI systems. “You want to have full visibility and control into what that AI agent is doing,” says Stauch. “And you do that by using Serval to build those tools and customize the permissions and approvals behind them.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Serval raises $47M to bring AI agents to IT service management",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Serval-co-founders.jpg?w=150"
      ],
      "datePublished": "2025-10-21T15:48:45.000Z",
      "dateModified": "2025-10-21T15:48:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sesame, the conversational AI startup from Oculus founders, raises $250M and launches beta",
    "url": "https://techcrunch.com/2025/10/21/sesame-the-conversational-ai-startup-from-oculus-founders-raises-250m-and-launches-beta/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/5.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-21T21:34:17.000Z",
    "description": "\nSesame, a conversational AI startup and smart glasses maker, has raised a $250 million Series B round and is opening up its beta to a select group of",
    "body": "\nSesame, a conversational AI startup and smart glasses maker, has raised a $250 million Series B round and is opening up its beta to a select group of testers, the company announced Tuesday. \nThe startup, headed by former Oculus co-founder and CEO Brendan Iribe and Ankit Kumar, former CTO of AR startup Ubiquity6, is working to create a personal AI agent that interacts with users using a natural-sounding human voice. The company plans to embed the personal AI agent into lightweight eyewear designed to be worn throughout the day and which users can interact with via voice.\nThe startup first emerged from stealth in February, offering two demos of its technology — AI voices named “Maya” and “Miles.” The voices were soon accessed by more than a million people within the first few weeks, who generated more than five million minutes of conversation, according to a new post by Sesame investor Sequoia about its participation in the startup’s Series B.\n“[T]he experience was unlike anything we’d used before. Sesame’s conversational layer felt different,” the post states. “It doesn’t just translate LLM output into audio—it generates speech directly, capturing the rhythm, emotion, and expressiveness of real dialogue.”\nEarly reviews of the tech demo seem to agree, as one report by The Verge described Sesame as “genuinely fun” and “natural-sounding.” \nSesame says its upcoming glasses will offer “high-quality audio” and access to an AI companion that will “observe the world alongside you.” \n\nSequoia also noted the smartglasses Sesame is building will be fashion-forward, so they look like something you’d choose to wear even if they didn’t offer built-in AI technology. A timeframe for their availability is not yet being shared; as Sequoia noted, “hardware takes time.”\nOn that front, Sesame may have an advantage. Its founding team also includes Oculus co-founder Nate Mitchell as its Chief Product Officer, former Oculus COO and Fitbit exec Hans Hartmann as COO, as well as former Oculus engineer manager and Reality Labs engineering director Ryan Brown, and longtime Facebook and Meta exec Angela Gayles. \nIn addition to sharing the news of its Series B, Iribe announced on X that Sesame is now opening an early beta of the Sesame iOS app. The app experience will allow testers to get hands-on with the AI technology being built, as the app will have the ability to “search, text and think,” he says. \nBeta testers are asked to keep their testing experiences confidential for the time being, which includes not discussing features or results beyond the official beta test forums.\nInvestors in the Sesame Series B include Sequoia, Spark, and other undisclosed backers, according to Iribe.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sesame, the conversational AI startup from Oculus founders, raises $250M and launches beta",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/5.webp?w=150"
      ],
      "datePublished": "2025-10-21T21:34:17.000Z",
      "dateModified": "2025-10-21T21:34:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sources: Multimodal AI startup Fal.ai already raised at $4B+ valuation",
    "url": "https://techcrunch.com/2025/10/21/sources-multimodal-ai-startup-fal-ai-already-raised-at-4b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/2025-vc-predictions.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T20:12:41.000Z",
    "description": "\nFal.ai, a startup that hosts image, video, and audio AI models for developers, has closed a new round valuing the company at over $4 billion, four pe",
    "body": "\nFal.ai, a startup that hosts image, video, and audio AI models for developers, has closed a new round valuing the company at over $4 billion, four people familiar with the deal said. The company raised approximately $250 million, two of the people said.\nMajor investors in the round are Kleiner Perkins and Sequoia, according to our sources. Fal didn’t respond to a request for comment. Sequoia and Kleiner Perkins declined to comment.\nThe new round is coming less than three months after Fal announced a $125 million Series C at a $1.5 billion valuation led by Meritech. At that time, the company’s revenue crossed $95 million and it’s platform was used by over two million developers, Todd Jackson, a partner at First Round Capital wrote on LinkedIn. That was massive growth from a year ago, when TechCrunch reported Fal had $10 million in annualized recurring revenue (ARR) and 500,000 developers.\nSince Fal provides the infrastructure layer for multimodal AI models (as well as media-specific ones), the company’s explosive growth is directly tied to the user adoption of applications built on top of it. And multimodal AI is in heavy demand right now, especially video, as evidenced by the soaring popularity of OpenAI’s Sora, which surged to the top of the U.S. App Store even faster than ChatGPT did.  This massive consumer demand for applications like Sora underscores the market potential of Fal’s offering.\nFal provides developers with over 600 image, video, audio and 3D models, it says, boasts that its cloud has thousands of Nvidia H100 and H200 GPUs and is fine-tuned for speedy inference. It offers tools for customizing models as well.  Its offerings include access via API, hosted via a flexible serverless offering, or via enterprise-ready compute clusters. While there are certainly other competitors offering model and app hosting services (Microsoft, Google, CoreWeave, to name a few), Fal’s singular focus on media and multimodal is its competitive selling point, VCs like Jackson say.\nThe startup’s customers range from individual developers to large companies including Adobe, Canva, Perplexity, and Shopify.  Some of the popular use cases include media creation for advertising, e-commerce, and gaming content.\nThe startup was co-founded in 2021 by Burkay Gur, a former Coinbase machine learning leader and Oracle engineer, and Gorkem Yurtseven, who was previously a developer at Amazon. Gur and Yurtseven saw an opportunity for personalized multimedia generation. While other technologists pursued LLMs, they zeroed in on optimizing Stable Diffusion for speed and scale, and have since expanded to hosting many other such models.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nFal previously raised nearly $200 million, according to PitchBook data. The company’s existing investors include Bessemer Venture Partners, Kindred Ventures, Andreessen Horowitz, Notable Capital, First Round Capital, Unusual Ventures and Village Global.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sources: Multimodal AI startup Fal.ai already raised at $4B+ valuation",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/2025-vc-predictions.jpg?w=150"
      ],
      "datePublished": "2025-10-21T20:12:41.000Z",
      "dateModified": "2025-10-21T20:12:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "a16z-backed Codi launches AI agent office manager",
    "url": "https://techcrunch.com/2025/10/21/a16z-backed-codi-launches-ai-agent-office-manager/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Christelle_Rohaut.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T17:45:14.000Z",
    "description": "\nCodi, an Andreessen Horowitz-backed startup founded by Christelle Rohaut and Dave Schuman, is launching what it hails as the first AI-powered platfor",
    "body": "\nCodi, an Andreessen Horowitz-backed startup founded by Christelle Rohaut and Dave Schuman, is launching what it hails as the first AI-powered platform to fully automate office management.  \nCodi was founded in 2018, in a pre-pandemic world, with a mission to help companies find flexible office spaces. It was more of a marketplace, as TechCrunch previously reported, that matched companies to buildings that offered flexible office arrangements. Codi then assisted with the move-in processes.\nRohaut, the company’s CEO, said she and her team back then used to manually manage office spaces and vendors for their clients, but the recent advancements in AI have allowed them to essentially automate themselves. \n“The previous model of Codi, you had to get the space with Codi. Now, whatever office you lease, you can use this to automate your office logistics,” she said of her new AI SaaS product.\nThe startup released its beta version of the new AI office management product in May and officially launched it on Tuesday. The company last raised a $16 million Series A in 2022 led by a16z, and has raised $23 million to date.\nThe technology comes as return-to-office continues to take hold throughout corporate America. “Office management remains very manual and broken,” Rohaut, the company’s CEO, told TechCrunch. She added that it can cost companies at least $80,000 a year just in administrative costs to run an office.  \nThe role of an office manager has also changed throughout the years. In this post-pandemic world, as companies moved toward remote and hybrid work, the formal job of office manager has often been left unfilled. When companies do have an office manager, they are often spending more time on planning events rather than the logistics of the office, she said. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nRohaut said she and the team trained the Codi AI on all the expertise and data they’ve accumulated over the past few years. The vendors a company uses are put into the AI system, and then the AI coordinates for office needs such as pantry restocking and cleaning. The company said it took only five weeks for it to reach $100,000 in ARR after it released its beta.  \n“This new platform is estimated to save hundreds of hours a year in admin tasks,” she said. Codi takes a management fee per month, like a subscription, which is “a fraction of the cost of an office manager or part-time office manager or even a fractional EA,” Rohaut continued.  \nRohaut said “a good portion” of their clients, from whom they managed office spaces, are transitioning to using the AI platform. Just in the beta, the new Codi product has already signed 40 new companies, like TaskRabbit and Northbeam, Rohaut said.  \nRohaut sees Codi’s competitors as being legacy management companies and workplace experience platforms, like Envoy. She said, unlike legacy management companies, Codi replaces the need for staff members to review, hire, and coordinate with each vendor because the execution is autonomous and the platform integrates a curated network of serviced providers, Rohaut said.\nAlso, compared to workplace platforms, Codi helps coordinate the handling of physical operations in an office, she continued. \n“Codi is building the future where offices can run themselves, just like cars can drive themselves,” she continued. “We want to entirely remove the logistical burden of managing physical spaces and free human talent to focus on the workplace culture and growth.” \nThis piece was updated to reflect the proper spelling of Rohaut‘s name. \n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "a16z-backed Codi launches AI agent office manager",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Christelle_Rohaut.jpeg?w=150"
      ],
      "datePublished": "2025-10-21T17:45:14.000Z",
      "dateModified": "2025-10-21T17:45:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI’s new browser is a broadside shot at Google ",
    "url": "https://techcrunch.com/2025/10/21/openais-new-browser-is-a-broadside-shot-at-google/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-21-at-5.13.11-PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T21:17:50.000Z",
    "description": "\nToday, OpenAI launched its new Atlas web browser in a surprise livestream. The show started with CEO Sam Altman himself, speaking directly to the aud",
    "body": "\nToday, OpenAI launched its new Atlas web browser in a surprise livestream. The show started with CEO Sam Altman himself, speaking directly to the audience.  \n“We think AI represents a rare, once-a-decade opportunity to rethink what a browser can be,” Altman said. “In the same way that, for the previous way people used the internet, the URL bar and the search box were a great analogue, what we’re starting to see is that the chat experience and the web browser can be a quick analogue.” \nIt was an inspiring note, in the classic Steve Jobs mode. But even more important than Altman’s browser was the detritus he was sweeping aside to make room. It wasn’t just casting present-day browsers as old, but part of a whole package of goods that are about to be replaced by AI — as Altman put it, part of “the previous way people used the internet.” And most of those soon-to-be obsolete services trace back to a single company: Google. \nOpenAI’s browser project has been an open secret in Silicon Valley since at least this summer — and it was clear from the beginning that it would be a potential threat to Google, current owner of the world’s most popular browser. But Tuesday’s product and presentation details made it clear exactly how much the web giant has to lose in the AI era — and how little the Google’s success with Gemini seems to have helped. \nThe immediate threat is simple enough: ChatGPT draws 800 million users a week, and if those users switch to Atlas, they’re most likely switching away from Chrome. Losing those users doesn’t have an immediate dollar cost for Google (it’s a free product, after all) but it limits Google’s ability to target ads to those users or nudge them to Google Search — a particular sore point because, just last month, Google was barred by the US Department of Justice from making any search exclusivity deals. \nThen, there’s how OpenAI deals with search itself. AI has already strained the search model of the web, surfacing processed information instead of content that can be advertised against. But on OpenAI’s livestream, Atlas head of engineering Ben Goodger (himself a central figure in developing both Firefox and Chrome) described the new kind of chat-oriented search as a paradigm shift. \n“This new model of search is really powerful,” Goodger said. “It’s a multi-turn experience. You can have this back-and-forth with your search results instead of just being sent off to a web page.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOf course, Google has done a lot to integrate AI into the normal search experience — but the company has mostly approached it the same way as product listings or reviews: by adding a box to the results page. But OpenAI’s kind of engaged back-and-forth is beyond anything you can get on Chrome, and given its profoundly different approach, it’s not something that can be easily copied. If OpenAI’s search interface proves popular, it could be a serious threat to Google’s dominance. \nThen there’s the advertising question. OpenAI doesn’t serve advertising at the moment, but it has been careful not to rule it out. The company has also been listing a lot of adtech jobs lately, fueling speculation that an ad pivot might be on the way. With Atlas, ChatGPT can now collect context directly from a user’s browser window — providing a lot of extremely valuable data for ad targeting. It’s an unprecedented level of direct browser access: literally looking at the words on your screen as you type them. And after decades of privacy scares, it’s not the kind of sensitive information that users are likely to give to Google or Meta. \nIt’s still early days for Atlas and a lot will depend on the product itself — and whether users really want what OpenAI is offering here. But the company has plotted a surprisingly commercial path here, one focused on user and revenue growth rather than hazy ambitions around AGI. As infrastructure wonks ponder the $300 billion question of whether OpenAI’s revenues can ever live up to its enormous data center buildout, products like Atlas may be the first place to look for an answer. \n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI’s new browser is a broadside shot at Google ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-21-at-5.13.11-PM.jpg?w=150"
      ],
      "datePublished": "2025-10-21T21:17:50.000Z",
      "dateModified": "2025-10-21T21:17:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cloudflare CEO Matthew Prince is pushing UK regulator to unbundle Google’s search and AI crawlers",
    "url": "https://techcrunch.com/2025/10/21/cloudflare-ceo-matthew-prince-is-pushing-uk-regulator-to-unbundle-googles-search-and-ai-crawlers/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/videoframe_402382.png?w=150",
    "tag": "Tech",
    "date": "2025-10-21T19:34:21.000Z",
    "description": "\nAfter earlier this year launching a marketplace that allows websites to charge AI bots for scraping their content, web infrastructure provider Cloudf",
    "body": "\nAfter earlier this year launching a marketplace that allows websites to charge AI bots for scraping their content, web infrastructure provider Cloudflare is pushing for increased regulation in the AI sector. \nThe company’s chief executive Matthew Prince says he’s in London to speak with the U.K.’s Competition and Markets Authority (CMA), where he’s proposing stricter rules on how Google should be able to compete in the AI race, given its search dominance.\nThe CMA earlier this month designated Google with a special status in the search and advertising markets because of its “substantial and entrenched” position. The move will allow the regulator to impose more stringent regulations beyond just search and ads, including in areas like Google’s AI Overviews and AI Mode, the Discover feed, Top Stories, and News tab. \nAccording to Prince, Cloudflare is in a good position to make recommendations because it’s not in the AI business itself, but has a large number of relationships with the AI companies themselves.\n“We don’t have a dog directly in the fight. We’re not an AI company,” Prince said, speaking at the Bloomberg Tech conference in London this week. “We’re not a media publisher, but we’re this network that sits between them. 80% of the AI companies are our customers,” he added. \nThe Cloudflare boss believes that Google should have to compete on the same footing as other AI companies, which is not what it’s doing today, he said. Rather, Google uses its existing web crawler to crawl content for its AI products and services, in addition to its search engine. This, Prince said, gives Google an unfair advantage. (Prince is referring to Googlebot, which crawls for Search, including its AI features, like AI Overviews. A Google spokesperson, Ned Adriance, said that site owners can opt out of having content used for training AI products with Google Extended, which doesn’t impact a site’s inclusion in Google Search. Some media companies would likely prefer to opt fully out of AI features, however, so the point largely stands.)\n“Google is saying, ‘we have an absolute God-given right to all of the content in the world, even if we don’t pay for it, because look what we did for the last 27 years,” Prince explained. “And, they’re saying we can take it and use the same crawler we use for search in order to power our AI systems. And if you want to opt out of one, you have to opt out of both,” he noted.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis, obviously, is not feasible for most, particularly those in the media business, where losing search means losing about 20% of your revenue, the executive said.\n“But it gets even worse. If you block Google’s crawler, it blocks their ad safety team, which means that your advertisements across all of your platforms stop working, which is just a non-starter,” Prince added. \nBecause Google bundles its crawler, it’s able to get access to content that others, like Anthropic, OpenAI, and Perplexity, would have to pay for.\n“The problem is that we then will have effectively handed the game to Google,” he said. \nThe solution, Prince said, is to foster a lot of competition in the market, where potentially thousands of AI companies could compete to buy content from thousands of media businesses and millions of small businesses. He suggested that what the U.K.’s CMA was doing by flagging Google as a potential regulatory target was a thoughtful move, and one that indicates they’re aware of Google’s unique advantage.\nCloudflare has also provided the CMA with data that shows how Google’s crawler works and why it’s nearly impossible for other players to replicate the same success Google could have. \nPrince isn’t the only one to share these opinions in recent days. Last month, Neil Vogel, CEO of People, Inc., the largest digital and print publisher in the United States, which operates over 40 media brands, said essentially the same thing. In an interview, he called out Google as a “bad actor,” saying that media companies had no choice but to let Google crawl their sites for AI content because of the way the crawlers were combined.\nVogel, whose company had adopted Cloudflare’s solution to block AI crawlers that don’t pay, claimed the system was working, as he said deal discussions were underway with several large LLM providers. \nUpdated with Google comment. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cloudflare CEO Matthew Prince is pushing UK regulator to unbundle Google’s search and AI crawlers",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/videoframe_402382.png?w=150"
      ],
      "datePublished": "2025-10-21T19:34:21.000Z",
      "dateModified": "2025-10-21T19:34:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp and Messenger add new warnings to help older people avoid online scams",
    "url": "https://techcrunch.com/2025/10/21/whatsapp-and-messenger-add-new-warnings-to-help-older-people-avoid-online-scams/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/elderly-adult-GettyImages-1390895748.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T15:50:56.000Z",
    "description": "\nMeta on Tuesday introduced new scam detection features for its messaging apps, WhatsApp and Messenger, as part of its broader initiative to crack dow",
    "body": "\nMeta on Tuesday introduced new scam detection features for its messaging apps, WhatsApp and Messenger, as part of its broader initiative to crack down on online scams that target older people. The company said it will begin to show warnings in WhatsApp when users try to share their screen during calls, and it will flag possible scam messages in Messenger, which can be sent to AI for review.\nThe tech giant said it’s detected and disrupted about 8 million accounts engaging in scam operations during the first half of 2025, including those associated with scam centers in areas like Myanmar, Laos, Cambodia, the United Arab Emirates, and the Philippines. It also took action on over 21,000 Facebook Pages and accounts that were pretending to be customer support operations that were attempting to trick people into sharing their information. \nThe latter is so prevalent on the platform that many Page operators essentially know to ignore anything that claims to be a customer support message.  Meanwhile, scam syndicates target older adults across a number of industries, including not only social media, but also messaging apps, dating apps, crypto, and others. \nImage Credits:Meta\nOn WhatsApp, the company will now display a warning when you try to share your screen with an unknown contact during a video call. This technique is often used to trick victims into giving away sensitive information like bank details and verification codes, Meta says. \nMeanwhile, on Messenger, the company is testing more advanced scam detection techniques to analyze whether an inbound message is suspicious. If so, it flags that signs of a scam have been detected and warns you to “be cautious, you could be at risk of losing money.”\nImage Credits:Meta\nThe screen also lists a variety of common scam techniques, like those involving work-from-home jobs or offers to make easy cash, and will suggest either blocking or reporting the suspicious account. \nMy own family member has been a victim of these types of scams, and it’s fair to say these problems can have broader impacts beyond those affecting the individual being taken advantage of. Families often have to get involved, which embarrasses the victim or sees them digging in their heels, believing the scam to be a real opportunity of some kind.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nScammers often use social engineering techniques or romantic interest to lure in victims who are not as online savvy or who may be suffering from early dementia. They also often target people who are lonely and appreciate the attention. Scammers take advantage of these factors to milk seniors out of their life savings.\nMeta should have done more to address these concerns on its platforms before now, especially given how simple it is to add a warning or alert to the user experience in the apps. Though it may not have access to the more sophisticated AI technologies to review possible scams, even informational alerts could have mitigated some of the prior elder abuse. \nThe company responded that it had, in fact, added other context cards, reminders, and warnings about shipping scams and instant payments, as well as a WhatsApp safety center. It warned about romance scams on Valentine’s Day with safety notices. These were not targeted specifically at the elderly, however. \nThe tech giant says it’s also joining the National Elder Fraud Coordination Center, a newer nonprofit that brings law enforcement together with companies like AARP, Amazon, Capital One, Google, Microsoft, and Walmart to combat fraud targeting older adults.\nUpdated with more information about previous Meta warnings and actions. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp and Messenger add new warnings to help older people avoid online scams",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/elderly-adult-GettyImages-1390895748.jpg?w=150"
      ],
      "datePublished": "2025-10-21T15:50:56.000Z",
      "dateModified": "2025-10-21T15:50:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube’s likeness-detection technology has officially launched",
    "url": "https://techcrunch.com/2025/10/21/youtubes-likeness-detection-technology-has-officially-launched/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T15:57:18.000Z",
    "description": "\nYouTube revealed on Tuesday that its likeness-detection technology has officially rolled out to eligible creators in the YouTube Partner Program, fol",
    "body": "\nYouTube revealed on Tuesday that its likeness-detection technology has officially rolled out to eligible creators in the YouTube Partner Program, following a pilot phase. The technology allows creators to request the removal of AI-generated content that uses their likeness.\nThis is the first wave of the rollout, a YouTube spokesperson informed TechCrunch, adding that eligible creators received emails this morning.\nYouTube’s detection technology identifies and manages AI-generated content featuring the likeness of creators, such as their face and voice. \nThe technology is designed to prevent people from having their likeness misused, whether for endorsing products and services they have not agreed to support or for spreading misinformation. There have been plenty of examples of AI likeness misuse in recent years, such as the company Elecrow using an AI clone of YouTuber Jeff Geerling’s voice to promote its products.\nImage Credits:Screenshot of YouTube video\nOn its Creator Insider channel, the company provided instructions on how creators can use the technology. To begin the onboarding process, creators need to go to the “Likeness” tab, consent to data processing, and use their smartphone to scan a QR code displayed on the screen, which will direct them to a web page for identity verification. This process requires a photo ID and a brief selfie video.\nOnce YouTube grants access to use the tool, creators can view all detected videos and submit a removal request according to YouTube’s privacy guidelines, or they can make a copyright request. There is also an option to archive the video.\nImage Credits:Screenshot of YouTube video\nCreators can opt out of using the technology at any time, and YouTube will stop scanning for videos 24 hours after they do so.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nLikeness-detection technology has been in pilot mode since earlier this year. YouTube first announced last year that it had partnered with Creative Artists Agency (CAA) to help celebrities, athletes, and creators identify content on the platform that uses their AI-generated likeness.\nIn April, YouTube expressed its backing for the legislation referred to as the NO FAKES Act, which seeks to address the issue of AI-generated replicas that imitate a person’s image or voice to deceive others and generate harmful content.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube’s likeness-detection technology has officially launched",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=150"
      ],
      "datePublished": "2025-10-21T15:57:18.000Z",
      "dateModified": "2025-10-21T15:57:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI launches an AI-powered browser: ChatGPT Atlas",
    "url": "https://techcrunch.com/2025/10/21/openai-launches-an-ai-powered-browser-chatgpt-atlas/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/openAI-spiral-teal.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T17:15:40.000Z",
    "description": "\nOpenAI announced Tuesday the launch of its AI-powered browser, ChatGPT Atlas, a major step in the company’s quest to unseat Google as the main way pe",
    "body": "\nOpenAI announced Tuesday the launch of its AI-powered browser, ChatGPT Atlas, a major step in the company’s quest to unseat Google as the main way people find information online.\nThe company says Atlas will first roll out on macOS, with support for Windows, iOS, and Android coming soon. OpenAI says the product will be available to all free users at launch.\nBrowsers have quickly become the AI industry’s next battleground. While Google Chrome has long dominated the space, there’s a sense that AI chatbots and agents are fundamentally changing how people get work done online. A handful of startups have tried to capture this by launching AI-powered browsers of their own, such as Perplexity’s Comet and The Browser Company’s Dia. Google and Microsoft have also tried to update Chrome and Edge, respectively, with AI-powered features to make their legacy products stand out.\nOpenAI’s Engineering Lead for Atlas, Ben Goodger, said in a livestream Tuesday that ChatGPT is core to the company’s first browser. Users in ChatGPT Atlas can chat with their search results, much like in Perplexity or in Google’s AI Mode.\nThe killer feature for other AI-powered browsers has been the built-in chatbot that sits in a side panel and automatically has context for whatever’s on your screen. It may sound minor, but many users spend all day copying and pasting text or dragging files and links into ChatGPT, just to provide context. The sidecar feature removes that friction and makes for a smoother user experience.\nOpenAI’s Product Lead, Adam Fry, said during the livestream that ChatGPT Atlas will have the sidecar feature, too. Further, ChatGPT Atlas has “browser history,” meaning that ChatGPT can now log the websites you visit and what you do on them, and use that information to make its answers more personalized.\nAI-powered browsers also commonly feature an AI agent that aims to automate web-based tasks on behalf of users. In TechCrunch’s testing, we’ve found the early versions of web-browsing AI agents leave something to be desired. While Perplexity’s Comet and OpenAI’s ChatGPT agent work well for simple tasks, they struggle to reliably automate the more cumbersome problems users might want to offload to an AI system.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nSure enough, OpenAI’s browser has a web-browsing agent too. By using “agent mode,” users can ask ChatGPT to complete small tasks in the browser on their behalf. The company says agent mode is only available to ChatGPT users on the Plus, Pro, and Business tier at launch.\nIn an interview at OpenAI’s DevDay conference, Head of ChatGPT Nick Turley told TechCrunch that he’s inspired by the way browsers have redefined what an operating system can look like. Turley noted that browsers have revolutionized the way people get work done online, and he thinks ChatGPT is a similar phenomenon.\nWhether OpenAI’s browser can put a dent in Google Chrome, which has more than 3 billion users around the globe, remains to be seen. AI browsers are quite buzzy in Silicon Valley today, but their impact in the broader world is limited.\n\n\n\t\tMaxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene.\r\nYou can contact or verify outreach from Maxwell by emailing maxwell.zeff@techcrunch.com or via encrypted message at mzeff.88 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI launches an AI-powered browser: ChatGPT Atlas",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/openAI-spiral-teal.jpg?w=150"
      ],
      "datePublished": "2025-10-21T17:15:40.000Z",
      "dateModified": "2025-10-21T17:15:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "General Motors gives up on BrightDrop electric vans",
    "url": "https://techcrunch.com/2025/10/21/general-motors-gives-up-on-brightdrop-electric-vans/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/gm-brightdrop-ev600.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T15:31:45.000Z",
    "description": "\nGeneral Motors is abandoning its BrightDrop electric delivery vans, just four years after introducing the vehicles.\nThe company announced Tuesday alo",
    "body": "\nGeneral Motors is abandoning its BrightDrop electric delivery vans, just four years after introducing the vehicles.\nThe company announced Tuesday alongside third-quarter earnings that it made the decision because the “commercial electric delivery van market developed much slower than expected.” GM also blames the “changing regulatory environment and the elimination of tax credits in the United States” — the result of the second Trump administration’s hostility toward EVs.\nBrightDrop production has been suspended at GM’s CAMI Assembly facility in Ontario, Canada, since May, when the company also cut 500 jobs. GM said Tuesday that it needs to have “meaningful discussions” with government leaders in Canada about “opportunities” for the plant. In the meantime, GM told TechCrunch that BrightDrop dealers will “continue to sell and service vehicles as we work through remaining inventory.”\nThe decision to kill off BrightDrop comes at an odd moment for electric vehicles in the United States. Companies like GM set new EV sales records in the third quarter, though that enthusiasm was driven in part by the expiration of the federal tax credit, which Republicans in Congress decided to end.\nMeanwhile, major automakers like GM have spent much of the last year walking back once-lofty promises about how many EVs they plan to make and sell in the coming years. GM, which once pledged to have a fully electric fleet by 2035, boasted on Tuesday that it is “well positioned to meet strong, sustained demand” for internal combustion vehicles. (Investors have rewarded that decision. GM’s stock price is up 14% at the time of publish.)\nBrightDrop’s short existence has been chaotic. GM revealed the program as a pseudo-startup in 2021. The automaker created BrightDrop in its “Global Innovation” organization (which is where OnStar was built) and spun it out as a privately held company.\nBrightDrop launched at the Consumer Electronics Show that year. The automaker touted a lower total cost of ownership and less frequent maintenance as advantages over its internal combustion counterparts. BrightDrop vans seemed poised to quickly take advantage of the fact that major companies like FedEx were pushing to go carbon-neutral and emissions-free. BrightDrop also came into existence at a time when the pandemic was fueling a huge e-commerce surge, upping the need for delivery vans.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nJust two years later, GM absorbed BrightDrop into its overall fleet business, GM Envolve. The unit’s CEO, Travis Katz, stepped down. Some of the vans started catching fire, sparking a recall in early 2024. Then GM moved BrightDrop again, this time to within Chevrolet’s commercial division. The automaker continued to struggle to sell BrightDrop vans this year, barely topping 1,500 sold in the first half.\nIt’s unclear why, exactly, GM struggled so mightily to sell its BrightDrop vans. And while there were plenty of indicators the unit was struggling, the decision appears to have come somewhat abruptly. Earlier this month, GM Envolve vice president Ian Hucker was touting BrightDrop’s vans in a press release about a partnership with delivery driver organization Frontdoor Collective and infrastructure company Circuit EV. That partnership is supposed to provide 50 BrightDrop vans for Target to use in the Dallas-Fort Worth area.\nGM isn’t alone. Sales of Ford’s E-Transit van are well below where they were in 2024. But Rivian has put more than 25,000 electric vans on the road with Amazon over the last few years. And Los Angeles-based startup Harbinger has sold more than 200 of its electric truck chassis since starting production in April. On Tuesday morning, Harbinger also announced it is expanding sales to Canada.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "General Motors gives up on BrightDrop electric vans",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/01/gm-brightdrop-ev600.jpg?w=150"
      ],
      "datePublished": "2025-10-21T15:31:45.000Z",
      "dateModified": "2025-10-21T15:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic CEO claps back after Trump officials accuse firm of AI fear-mongering  ",
    "url": "https://techcrunch.com/2025/10/21/anthropic-ceo-claps-back-after-trump-officials-accuse-firm-of-ai-fear-mongering/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/Dario.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T15:32:09.000Z",
    "description": "\nAnthropic CEO Dario Amodei published a statement Tuesday to “set the record straight” on the company’s alignment with the Trump administration’s AI p",
    "body": "\nAnthropic CEO Dario Amodei published a statement Tuesday to “set the record straight” on the company’s alignment with the Trump administration’s AI policy, responding to what he called “a recent uptick in inaccurate claims about Anthropic’s policy stances.” \n“Anthropic is built on a simple principle: AI should be a force for human progress, not peril,” Amodei wrote. “That means making products that are genuinely useful, speaking honestly about risks and benefits, and working with anyone serious about getting this right.” \nAmodei’s response comes after last week’s dogpiling on Anthropic from AI leaders and top members of the Trump administration, including AI czar David Sacks and White House senior policy advisor for AI Sriram Krishnan — all accusing the AI giant of stoking fears to damage the industry.  \nThe first hit came from Sacks after Anthropic co-founder Jack Clark shared his hopes and “appropriate fears” about AI, including that AI is a powerful, mysterious, “somewhat unpredictable” creature, not a dependable machine that’s easily mastered and put to work.  \nSacks’s response: “Anthropic is running a sophisticated regulatory capture strategy based on fear-mongering. It is principally responsible for the state regulatory frenzy that is damaging the startup ecosystem.”  \nCalifornia senator Scott Wiener, author of AI safety bill SB 53, defended Anthropic, calling out President Trump’s “effort to ban states from acting on AI w/o advancing federal protections.” Sacks then doubled down, claiming Anthropic was working with Wiener to “impose the Left’s vision of AI regulation.” \nFurther commentary ensued, with anti-regulation advocates like Groq COO Sunny Madra saying that Anthropic was “causing chaos for the entire industry” by advocating for a modicum of AI safety measures instead of unfettered innovation. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn his statement, Amodei said managing the societal impacts of AI should be a matter of “policy over politics,” and that he believes everyone wants to ensure America secures its lead in AI development while also building tech that benefits the American people. He defended Anthropic’s alignment with the Trump administration in key areas of AI policy and called out examples of times he personally played ball with the president.  \nFor example, Amodei pointed to Anthropic’s work with the federal government, including the firm’s offering of Claude to the federal government and Anthropic’s $200 million agreement with the Department of Defense (which Amodei called “the Department of War,” echoing Trump’s preferred terminology, though the name change requires congressional approval). He also noted that Anthropic publicly praised Trump’s AI Action Plan and has been supportive of Trump’s efforts to expand energy provision to “win the AI race.” \nDespite these shows of cooperation, Anthropic has caught heat from industry peers from stepping outside the Silicon Valley consensus on certain policy issues. \nThe company first drew ire from Silicon Valley-linked officials when it opposed a proposed 10-year ban on state-level AI regulation, a provision that faced widespread bipartisan pushback. \nMany in Silicon Valley, including leaders at OpenAI, have claimed that state AI regulation would slow down the industry and hand China the lead. Amodei countered that the real risk is that the U.S. continues to fill China’s data centers with powerful AI chips from Nvidia, adding that Anthropic restricts the sale of its AI services to China-controlled companies despite revenue hits.  \n“There are products we will not build and risks we will not take, even if they would make money,” Amodei said. \nAnthropic also fell out of favor with certain power players when it supported California’s SB 53, a light-touch safety bill that requires the largest AI developers to make frontier model safety protocols public. Amodei noted that the bill has a carve-out for companies with annual gross revenue below $500 million, which would exempt most startups from any undue burdens.  \n“Some have suggested that we are somehow interested in harming the startup ecosystem,” Amodei wrote, referring to Sacks’ post. “Startups are among our most important customers. We work with tens of thousands of startups and partner with hundreds of accelerators and VCs. Claude is powering an entirely new generation of AI-native companies. Damaging that ecosystem makes no sense for us.” \nIn his statement, Amodei said Anthropic has grown from a $1 billion to $7 billion run-rate over the last nine months while managing to deploy “AI thoughtfully and responsibly.” \n“Anthropic is committed to constructive engagement on matters of public policy. When we agree, we say so. When we don’t, we propose an alternative for consideration,” Amodei wrote. “We are going to keep being honest and straightforward, and will stand up for the policies we believe are right. The stakes of this technology are too great for us to do otherwise.” \n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic CEO claps back after Trump officials accuse firm of AI fear-mongering  ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/Dario.jpg?w=150"
      ],
      "datePublished": "2025-10-21T15:32:09.000Z",
      "dateModified": "2025-10-21T15:32:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple alerts exploit developer that his iPhone was targeted with government spyware ",
    "url": "https://techcrunch.com/2025/10/21/apple-alerts-exploit-developer-that-his-iphone-was-targeted-with-government-spyware/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/07/brianstack-mspy-email-leak-2024.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T14:45:08.000Z",
    "description": "\nEarlier this year, a developer was shocked by a message that appeared on his personal phone: “Apple detected a targeted mercenary spyware attack agai",
    "body": "\nEarlier this year, a developer was shocked by a message that appeared on his personal phone: “Apple detected a targeted mercenary spyware attack against your iPhone.”  \n“I was panicking,” Jay Gibson, who asked that we don’t use his real name over fears of retaliation, told TechCrunch.  \nGibson, who until recently built surveillance technologies for Western government hacking tools maker Trenchant, may be the first documented case of someone who builds exploits and spyware being themselves targeted with spyware. \n“What the hell is going on? I really didn’t know what to think of it,” said Gibson, adding that he turned off his phone and put it away on that day, March 5. “I went immediately to buy a new phone. I called my dad. It was a mess. It was a huge mess.”  \nAt Trenchant, Gibson worked on developing iOS zero-days, meaning finding vulnerabilities and developing tools capable of exploiting them that are not known to the vendor who makes the affected hardware or software, such as Apple.  \n“I have mixed feelings of how pathetic this is, and then extreme fear because once things hit this level, you never know what’s going to happen,” he told TechCrunch.  \nBut the ex-Trenchant employee may not be the only exploit developer targeted with spyware. According to three sources who have direct knowledge of these cases, there have been other spyware and exploit developers in the last few months who have received notifications from Apple alerting them that they were targeted with spyware. \nApple did not respond to a request for comment from TechCrunch. \n\n\t\t\tContact Us\n\t\t\tDo you have more information about the alleged leak of Trenchant hacking tools? Or about this developer’s story? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram, Keybase and Wire @lorenzofb, or by email. \t\t\nThe targeting of Gibson’s iPhone shows that the proliferation of zero-days and spyware is starting to ensnare more types of victims.  \nSpyware and zero-day makers have historically claimed their tools are only deployed by vetted government customers against criminals and terrorists. But for the past decade, researchers at the University of Toronto’s digital rights group Citizen Lab, Amnesty International, and other organizations have found dozens of cases where governments used these tools to target dissidents, journalists, human rights defenders, and political rivals all over the world.   \nThe closest public cases of security researchers being targeted by hackers happened in 2021 and 2023, when North Korean government hackers were caught targeting security researchers working in vulnerability research and development. \nSuspect in leak investigation \nTwo days after receiving the Apple threat notification, Gibson contacted a forensic expert who has extensive experience investigating spyware attacks. After performing an initial analysis of Gibson’s phone, the expert did not find any signs of infection, but still recommended a deeper forensic analysis of the exploit developer’s phone.  \nA forensic analysis would have entailed sending the expert a complete backup of the device, something Gibson said he was not comfortable with.  \n“Recent cases are getting tougher forensically, and some we find nothing on. It may also be that the attack was not actually fully sent after the initial stages, we don’t know,” the expert told TechCrunch. \nWithout a full forensic analysis of Gibson’s phone, ideally one where investigators found traces of the spyware and who made it, it’s impossible to know why he was targeted or who targeted him.  \nBut Gibson told TechCrunch that he believes the threat notification he received from Apple is connected to the circumstances of his departure from Trenchant, where he claims the company designated him as a scapegoat for a damaging leak of internal tools.  \nApple sends out threat notifications specifically for when it has evidence that a person was targeted by a mercenary spyware attack. This kind of surveillance technology is often invisibly and remotely planted on someone’s phone without their knowledge by exploiting vulnerabilities in the phone’s software, exploits that can be worth millions of dollars and can take months to develop. Law enforcement and intelligence agencies typically have the legal authority to deploy spyware on targets, not the spyware makers themselves. \nSara Banda, a spokesperson for Trenchant’s parent company L3Harris, declined to comment for this story when reached by TechCrunch before publication.  \nA month before he received Apple’s threat notification, when Gibson was still working at Trenchant, he said he was invited to go to the company’s London office for a team-building event.  \nWhen Gibson arrived on February 3, he was immediately summoned into a meeting room to speak via video call with Peter Williams, Trenchant’s then-general manager who was known inside the company as “Doogie.” (In 2018, defense contractor L3Harris acquired zero-day makers Azimuth and Linchpin Labs, two sister startups that merged to become Trenchant.) \nWilliams told Gibson the company suspected he was double employed and was thus suspending him. All of Gibson’s work devices would be confiscated and analyzed as part of an internal investigation into the allegations. Williams could not be reached for comment. \n“I was in shock. I didn’t really know how to react because I couldn’t really believe what I was hearing,” said Gibson, who explained that a Trenchant IT employee then went to his apartment to pick up his company-issued equipment.  \nAround two weeks later, Gibson said Williams called and told him that following the investigation, the company was firing him and offering him a settlement agreement and payment. Gibson said Williams declined to explain what the forensic analysis of his devices had found, and essentially told him he had no choice but to sign the agreement and depart the company. \nFeeling like he had no alternative, Gibson said he went along with the offer and signed.  \nGibson told TechCrunch he later heard from former colleagues that Trenchant suspected he had leaked some unknown vulnerabilities in Google’s Chrome browser, tools that Trenchant had developed. Gibson, and three former colleagues of his, however, told TechCrunch he did not have access to Trenchant’s Chrome zero-days, given that he was part of the team exclusively developing iOS zero-days and spyware. Trenchant teams only have strictly compartmentalized access to tools related to the platforms they are working on, the people said.  \n“I know I was a scapegoat. I wasn’t guilty. It’s very simple,” said Gibson. “I didn’t do absolutely anything other than working my ass off for them.”  \nThe story of the accusations against Gibson and his subsequent suspension and firing was independently corroborated by three former Trenchant employees with knowledge.  \nTwo of the other former Trenchant employees said they knew details of Gibson’s London trip and were aware of suspected leaks of sensitive company tools. \nAll of them asked not to be named but believe Trenchant got it wrong. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple alerts exploit developer that his iPhone was targeted with government spyware ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/07/brianstack-mspy-email-leak-2024.jpg?w=150"
      ],
      "datePublished": "2025-10-21T14:45:08.000Z",
      "dateModified": "2025-10-21T14:45:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]