[
  {
    "title": "Open source agentic startup LangChain hits $1.25B valuation",
    "url": "https://techcrunch.com/2025/10/21/open-source-agentic-startup-langchain-hits-1-25b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/unicorns-evergreen_720.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T22:12:46.000Z",
    "description": "In Brief Posted: 3:12 PM PDT · October 21, 2025  Image Credits:Bryce Durbin  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  LangChain raised $125 million at a $1.25 billion valuation, the company announced on...",
    "body": "\nIn Brief\nPosted:\n3:12 PM PDT · October 21, 2025\n\nImage Credits:Bryce Durbin\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLangChain raised $125 million at a $1.25 billion valuation, the company announced on Monday. TechCrunch reported in July that the provider of a popular open source framework for building AI agents was raising fresh funds at a valuation of at least $1 billion. The deal was led by IVP, as we previously reported. New investors CapitalG and Sapphire Ventures joined in, as did existing investors Sequoia, Benchmark, and Amplify.\nLangChain began in 2022 as an open source project founded by machine learning engineer Harrison Chase. The startup was an early darling of the AI era, solving problems that made building apps with early-stage LLMs difficult, such as searching the web, calling APIs, and interacting with databases. It became a smash hit project, and Chase launched a startup with a $10 million seed round from Benchmark in April 2023. A week later, Chase raised a $25 million Series A led by Sequoia, reportedly valuing LangChain at $200 million.\nAs state-of-the-art model makers have added more infrastructure, LangChain has evolved to become a platform for building agents. In addition to announcing its unicorn status, the company launched updates to all of its major products, including its agent builder LangChain, its orchestration and context/memory tool LangGraph, and its testing/observability tool LangSmith. LangChain remains hugely popular among open source devs, with 118,000 stars and 19.4 forks on GitHub.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n"
  },
  {
    "title": "Meta cuts 600 AI jobs amid ongoing reorganization",
    "url": "https://techcrunch.com/2025/10/22/meta-cuts-600-ai-jobs-amid-ongoing-reorganization/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T15:08:18.000Z",
    "description": "In Brief Posted: 8:08 AM PDT · October 22, 2025  Image Credits:Hollie Adams/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Meta’s chief AI officer, Alexandr Wang, wrote in a memo to staff...",
    "body": "\nIn Brief\nPosted:\n8:08 AM PDT · October 22, 2025\n\nImage Credits:Hollie Adams/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta’s chief AI officer, Alexandr Wang, wrote in a memo to staff on Wednesday that the company will cut about 600 jobs from its superintelligence lab, according to a report from Axios.\nMeta declined to comment, but told TechCrunch that Axios’ reporting is accurate.\nAs Meta, OpenAI, Anthropic, Google, and other companies race to build the most powerful AI systems, Meta had a busy summer on the hiring front. The company poached more than 50 researchers from its competitors by offering multimillion-dollar pay packages, though OpenAI CEO Sam Altman claimed that “none of [OpenAI’s] best people” took the offers.\n“By reducing the size of our team, fewer conversations will be required to make a decision, and each person will be more load-bearing and have more scope and impact,” Wang wrote in the memo to staff.\nThis line of thinking tracks with Meta’s recent “year of efficiency” — a more sanitized way to describe the company’s mass layoffs. At the time, Meta CEO Mark Zuckerberg told staff that “leaner is better.”\nNow, it seems that Meta isn’t lowering its overall headcount by much, but rather, reorganizing its efforts. The company claims that most of these people impacted today should be able to find another job within Meta. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "David Sacks’ Craft leads $42 million Series A in govtech startup Starbridge",
    "url": "https://techcrunch.com/2025/10/22/david-sacks-craft-leads-42-million-series-a-in-govtech-startup-starbridge/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Starbridge-Team.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T14:00:00.000Z",
    "description": "Justin Wenig remembers his days at Y Combinator in 2019. Back then, he was working with his first startup, Coursedog, which looked to provide more modern tools to higher educational facilities, including...",
    "body": "\nJustin Wenig remembers his days at Y Combinator in 2019. \nBack then, he was working with his first startup, Coursedog, which looked to provide more modern tools to higher educational facilities, including those that work with state departments. He learned quickly that his peers didn’t like working with the public sector — too much bureaucracy.\nEven finding out basic information, like what a school district purchased in the past year, required a lot of paperwork.\n“Out of hundreds of startups, only a handful of us were trying to modernize how government and education worked,” Wenig told TechCrunch. “Investors thought it was too slow, too bureaucratic, too hard to scale. And to be fair, they weren’t wrong. Selling to the public sector was painful.”\nHe sold Coursedog in 2021 for nine-figures to JMI Equity and remaisn on the board. In 2024, he launched Starbridge a platform that helps business sales teams monitor opportunities in the public sector so they can then take action, such as submitting proposals or drafting bids for grants and budgets. On Wednesday, Starbridge announced a $42 million Series A led by David Sacks’ firm Craft Ventures.\nWenig said the greatest challenges in public sector is that data is fragmented and inaccessible.\n“Critical buying information is scattered across PDFs, agency websites, meeting minutes, and outdated directories,” he said, adding that vendors spend hours trying to piece together who to contact and other insights.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Starbridge\nStarbridge pulls public web data sources from such sources and puts the information in one place. The sales team using the platform can see a ranked scoring, courtesey of Starbridge, of which public sector accounts are most likely to purchase new technology, and see updates like leadership changes or new initiatives.\n“Instead of chasing noise, our customers have a clear, data-backed view of where to focus and when to act,” he said. \nWenig described his fundraising journey as “fun,” and said the company met Craft through a friend. Others in the Series A round include Owl Ventures, CommonWeal Ventures, and Autotech Ventures. The company has raised $52 million to date, after previously raising a $10 million seed. \nNext, the startup plans to launch “Starbridge integrated experience,” so users do not have to always go to the Starbridge platform to use its technology.\n“Every competitor goes right to your CRM, every question about an account can be answered right from a slackbot, every job change loads right into your sequencer,” Wenig said.\nOthers in this space include GovWin and GovSpend. Starbridge said its different because it has built AI workflows on top of the datasets to make it easier for sales teams to use.\nHe remembers back when he was fundraising for Coursedog. “No VC was interested in talking to us,” he said. But now, in the AI, era, the tides are shifting, he said.\n“Maybe nobody wants to run for office anymore, but they do want to build,” he continued. “Seeing this new wave of mission-driven founders tackling real, systemic challenges makes me incredibly hopeful for the future.”\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Samsung takes on Apple’s Vision Pro with new Galaxy XR headset",
    "url": "https://techcrunch.com/2025/10/22/samsung-takes-on-apples-vision-pro-with-new-galaxy-xr-headset/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/galaxy-xr.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T14:53:22.000Z",
    "description": "After months of speculation, Samsung has finally unveiled its Galaxy XR headset to take on Apple’s Vision Pro. The headset runs on Google’s Android XR operating system and Qualcomm’s Snapdragon XR2+ Gen 2...",
    "body": "\nAfter months of speculation, Samsung has finally unveiled its Galaxy XR headset to take on Apple’s Vision Pro. The headset runs on Google’s Android XR operating system and Qualcomm’s Snapdragon XR2+ Gen 2 platform.\nGalaxy XR costs $1,800, nearly half the price of the Vision Pro. It’s available now in the U.S. and Korea. The headset offers up to two hours of general use and up to two and a half hours of video playback. \nThe headset’s micro OLED display has 27 million pixels, six million more than the Vision Pro, and a resolution of 3,552 x 3,840. It has a 90Hz refresh rate, compared to the Vision Pro’s 120Hz. Galaxy XR features two high-resolution pass-through cameras, six world-facing tracking cameras, and four eye-tracking cameras.\nThe headset weighs 545g, while the latest Apple Vision Pro weighs around 750g-800g. \nImage Credits:Samsung\n“Through a combination of its shape, advanced materials and the structural optimization of each component, Galaxy XR achieves an optimal balance between lightweight design and robustness for daily use,” Samsung wrote in a blog post. “The headset’s ergonomically balanced frame distributes pressure across the forehead and the back of the head, minimizing facial discomfort while providing steady support.”\nSamsung says the headset features many experiences optimized for XR, such as Google Maps, YouTube, Circle to Search, and Google Photos.\nUsers can ask Gemini to navigate to places on Google Maps while exploring the world in immersive 3D Maps. On YouTube, users can ask Gemini to find content they want to see and learn more about the video they’re watching. Users can also convert 2D images into 3D in Photos.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn pass-through mode, users can see the physical world around them and draw a circle with their hand to search for information about anything in front of them.\nImage Credits:Google\nWith the headset, users can multitask by having multiple apps open at any size, such as their browser, documents, and music app. \nAs for entertainment, users can stream content on a 4K Micro-OLED screen. Streaming services, including Crunchyroll, HBO Max, and Peacock, have reworked their apps for Android XR.\nPeople who purchase the Galaxy XR by the end of the year will get an Explorer Pack that comes with 12 months of Google AI Pro, YouTube Premium, and Google Play Pass. It also comes with a $1 per month trial of YouTube TV for 3 months, access to the 2025-2026 season of NBA League Pass, and access to Status Pro’s NFL PRO ERA, Project Pulsar from Adobe, Asteroid, and Calm.\nThe move comes as Apple last week unveiled the latest version of its Vision Pro headset that’s powered by an M5 chip, replacing the current M2. The M5 chip enhances display rendering by 10%, and supports refresh rates up to 120Hz (up from 100Hz). The headset also features 30 more minutes of battery life over the previous model, coming in at two and a half hours of general use and three hours of video playback.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sesame, the conversational AI startup from Oculus founders, raises $250M and launches beta",
    "url": "https://techcrunch.com/2025/10/21/sesame-the-conversational-ai-startup-from-oculus-founders-raises-250m-and-launches-beta/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/5.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-21T21:34:17.000Z",
    "description": "Former Oculus CEO Brendan Iribe’s new startup, Sesame, is building AI-powered smart glasses with natural, humanlike voice interaction. Backed by Sequoia and Spark, the company also launched an invite-only iOS beta to preview its conversational AI.",
    "body": "\nSesame, a conversational AI startup and smart glasses maker, has raised a $250 million Series B round and is opening up its beta to a select group of testers, the company announced Tuesday. \nThe startup, headed by former Oculus co-founder and CEO Brendan Iribe and Ankit Kumar, former CTO of AR startup Ubiquity6, is working to create a personal AI agent that interacts with users using a natural-sounding human voice. The company plans to embed the personal AI agent into lightweight eyewear that is designed to be worn throughout the day and that users can interact with via voice.\nThe startup first emerged from stealth in February, offering two demos of its technology — AI voices named “Maya” and “Miles.” The voices were soon accessed by more than a million people within the first few weeks, who generated more than 5 million minutes of conversation, according to a new post by Sesame investor Sequoia about its participation in the startup’s Series B.\n“[T]he experience was unlike anything we’d used before. Sesame’s conversational layer felt different,” the post states. “It doesn’t just translate LLM output into audio — it generates speech directly, capturing the rhythm, emotion, and expressiveness of real dialogue.”\nEarly reviews of the tech demo seem to agree, as one report by The Verge described Sesame as “genuinely fun” and “natural-sounding.”\nSesame says its upcoming glasses will offer “high-quality audio” and access to an AI companion that will “observe the world alongside you.” \nImage Credits:Sesame\nSequoia also noted the smartglasses Sesame is building will be fashion-forward, so they look like something you’d choose to wear even if they didn’t offer built-in AI technology. A timeframe for their availability is not yet being shared — as Sequoia noted, “hardware takes time.”\nOn that front, Sesame may have an advantage. Its founding team also includes Oculus co-founder Nate Mitchell as its chief product officer, former Oculus COO and Fitbit exec Hans Hartmann as COO, former Oculus engineer manager and Reality Labs engineering director Ryan Brown, and longtime Facebook and Meta exec Angela Gayles.\nIn addition to sharing the news of its Series B, Iribe announced on X that Sesame is now opening an early beta of the Sesame iOS app. The app experience will allow testers to get hands-on with the AI technology being built, as the app will have the ability to “search, text and think,” he says.\nBeta testers are asked to keep their testing experiences confidential for the time being, which includes not discussing features or results beyond the official beta test forums.\nInvestors in the Sesame Series B include Sequoia, Spark, and other undisclosed backers, according to Iribe.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "UK designates Apple and Google as having ‘strategic market status,’ opening door for more regulation",
    "url": "https://techcrunch.com/2025/10/22/u-k-designates-apple-and-google-as-having-strategic-market-status-opening-door-for-more-regulation/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/10/apple-fighting-google.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T15:03:37.000Z",
    "description": "The U.K.’s competition regulator has designated Apple and Google with “strategic market status” in their mobile platforms, giving the regulator new powers to enforce competition in areas like app stores, browsers, and operating systems.",
    "body": "\nThe U.K.’s Competition and Markets Authority (CMA) said on Wednesday that it’s designating Apple and Google with strategic market status in their respective mobile platforms. The decision, which affects the companies’ operating systems, app stores, browsers, and browser engines, will enable the regulator to take targeted actions to enhance competition in the space.\nThe CMA had launched investigations into Apple and Google in January, and had proposed interventions in July that indicated the tech giants could be designated with strategic market status (SMS). To reach its conclusions, the CMA consulted over 150 stakeholders and had discussions with both Apple and Google. It then arrived at the decision that Apple and Google had “substantial, entrenched market power and a position of strategic significance in their respective mobile platforms.”\nAmong other findings, the CMA discovered that U.K. mobile device owners are unlikely to switch between Apple and Google’s mobile platforms once they have adopted the ecosystem of their choice. It noted that both platforms require businesses to distribute apps through their app stores to reach consumers.\nNotably, it also said that new technologies, like AI, were “unlikely to eliminate Apple or Google’s market power over the five-year designation period.” \n“Apple and Google’s mobile platforms are used by thousands of businesses right across the economy to market and sell products and services to millions of customers, but the platforms’ rules may be limiting innovation and competition,” Will Hayter, executive director for digital markets at the CMA, said in a statement.\nThe CMA added that designating the platforms with SMS was not a finding of wrongdoing, however. Instead, it allows the regulator to consider “proportionate, targeted interventions to ensure that mobile platforms are open to effective competition, and that consumers and businesses that rely on Google and Apple can have confidence that they are treated fairly,” the announcement states.\nApple and Google have pushed back against the decision, with Apple warning that the decision could mean that users in the U.K. would lose access to getting new features in a timely fashion — something that already happened with Apple Intelligence. Google also said it didn’t see the rationale for the decision.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "GM is bringing Google Gemini-powered AI assistant to cars in 2026 ",
    "url": "https://techcrunch.com/2025/10/22/gm-is-bringing-google-gemini-powered-ai-assistant-to-cars-in-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2233653192.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T15:51:03.000Z",
    "description": "GM is the latest automaker to lean into generative AI-based assistants that promise to respond to driver requests in a more natural-sounding way. Stellantis is collaborating with French AI firm Mistral, Mercedes is integrating ChatGPT, and Tesla has brought xAI’s Grok to its vehicles.  ",
    "body": "\nGeneral Motors will add a conversational AI assistant powered by Google Gemini to its cars, trucks, and SUVs starting next year, the U.S. automaker said Wednesday during an event in New York City. \nThe Google Gemini rollout is one of several tech-centric announcements made at the automaker’s GM Forward event, and it will be one of the first to get into consumers’ hands. Others, including an overhaul of its electrical architecture and computing platform and an automated driving feature that allows drivers to keep their hands off the wheel and eyes off the road, aren’t coming to GM brands until 2028.\nGM is the latest automaker to lean into generative AI-based assistants that promise to respond to driver requests in a more natural-sounding way. Stellantis is collaborating with French AI firm Mistral, Mercedes is integrating ChatGPT, and Tesla has brought xAI’s Grok to its vehicles.  \nGM’s integration with Gemini is the next logical step for the automaker. Vehicles produced by GM brands Buick, Chevrolet, Cadillac, and GMC already have “Google built-in,” an operating system that gives drivers access to Google Assistant, Google Maps, and other apps directly from the car’s infotainment screen. In 2023, Google began using Google Cloud’s Dialogflow chatbot to handle non-emergency OnStar features, including common driver queries like routing and navigation assistance. \nGM’s Gemini-powered AI assistant will have similar levels of capability — it’ll just perform better, according to Dave Richardson, senior vice president of software and services. \n“One of the challenges with current voice assistants is that, if you’ve used the, you’ve probably also been frustrated by them because they’re trained on certain code words or they don’t understand accents very well or if you don’t say it quite right, you don’t get the right response,” Richardson told TechCrunch. “What’s great about large language models is they don’t seem to be affected by that. They have context about previous conversations that they can bring up. They’re flexible in how you speak to them…so overall you’re getting a better, more natural experience.”\nThat might make drafting and sending messages, planning routes with additional stops (like a charging station or a favorite coffee shop), or even prepping for a meeting on the go, a more pain-free experience. The assistant will also have access to the web to be able to answer certain questions, like “What’s the history of this bridge I’m driving over?”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe Gemini assistant will be made available to via the Play Store as an over-the-air upgrade to OnStar-equipped vehicles, model year 2015 and above.\nGM’s new voice assistant is a step towards the automaker’s goal of developing its own custom-built AI that connects to your vehicle’s systems through OnStar, GM’s in-car concierge. The way GM executives described the technology at the NYC event, it seems like a mix of a health wearable and an AI pendant, but for your car. \nThe assistant promises to access vehicle data to provide maintenance alerts and route suggestions, explain car features like one-pedal driving, and turn your heat or air conditioning on before you enter the vehicle. \n“The idea here is you take [an existing] large language model, and you train it and refine it on a specific domain,” Richardson said. “We’ll take a base model and train it on the vehicle’s specifications, distill that down, and have that running on the vehicle.”\nWhile GM has a close relationship with Google and will already be implementing Gemini into certain vehicles, Richardson said GM plans to test several foundational models from other AI firms, which could include OpenAI, Anthropic, and others. \nRichardson said drivers will be able to control what information the assistant can access and use, and it can learn from your habits to offer personalized recommendations. GM’s emphasis on user controls is notable given the company’s recent controversy over selling customer driving and geolocation data to insurance brokers. \nRichardson said any data GM gets from drivers goes directly towards improving the product and won’t be sold to bring in additional revenue for the automaker. Over the last nearly two years, GM has brought on a new data team — including Christina Montgomery, who spent 30 years as IBM’s chief privacy and trust officer — to put standard processes and data governance technology in place. \n“Everything that we’re going to do is going to be driven by customer consent, so you can always opt in or opt out,” he said. “Our viewpoint is that data and privacy has to be built into everything that we do.”\nThis article has been updated with comments from Dave Richardson.\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sources: Multimodal AI startup Fal AI already raised at $4B+ valuation",
    "url": "https://techcrunch.com/2025/10/21/sources-multimodal-ai-startup-fal-ai-already-raised-at-4b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/2025-vc-predictions.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T20:12:41.000Z",
    "description": "Fal provides developers with over 600 image, video, audio, and 3D models, it says, and boasts that its cloud has thousands of Nvidia H100 and H200 GPUs and is fine-tuned for speedy inference.",
    "body": "\nFal.ai, a startup that hosts image, video, and audio AI models for developers, has closed a new round valuing the company at over $4 billion, four people familiar with the deal said. The company raised approximately $250 million, two of the people said.\nMajor investors in the round are Kleiner Perkins and Sequoia, according to our sources. Fal didn’t respond to a request for comment. Sequoia and Kleiner Perkins declined to comment.\nThe new round is coming less than three months after Fal announced a $125 million Series C at a $1.5 billion valuation led by Meritech. At that time, the company’s revenue crossed $95 million and its platform was used by over 2 million developers, Todd Jackson, a partner at First Round Capital, wrote on LinkedIn. That was massive growth from a year ago, when TechCrunch reported Fal had $10 million in annualized recurring revenue (ARR) and 500,000 developers.\nSince Fal provides the infrastructure layer for multimodal AI models (as well as media-specific ones), the company’s explosive growth is directly tied to the user adoption of applications built on top of it. And multimodal AI is in heavy demand right now, especially video, as evidenced by the soaring popularity of OpenAI’s Sora, which surged to the top of the U.S. App Store even faster than ChatGPT did. This massive consumer demand for applications like Sora underscores the market potential of Fal’s offering.\nFal provides developers with over 600 image, video, audio, and 3D models, it says, and boasts that its cloud has thousands of Nvidia H100 and H200 GPUs and is fine-tuned for speedy inference. It offers tools for customizing models as well. Its offerings include access via API, hosted via a flexible serverless offering, or via enterprise-ready compute clusters. While there are certainly other competitors offering model and app hosting services (Microsoft, Google, CoreWeave, to name a few), Fal’s singular focus on media and multimodal is its competitive selling point, VCs like Jackson say.\nThe startup’s customers range from individual developers to large companies, including Adobe, Canva, Perplexity, and Shopify. Some of the popular use cases include media creation for advertising, e-commerce, and gaming content.\nThe startup was co-founded in 2021 by Burkay Gur, a former Coinbase machine learning leader and Oracle engineer, and Gorkem Yurtseven, who was previously a developer at Amazon. Gur and Yurtseven saw an opportunity for personalized multimedia generation. While other technologists pursued LLMs, they zeroed in on optimizing Stable Diffusion for speed and scale, and have since expanded to hosting many other such models.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nFal previously raised nearly $200 million, according to PitchBook data. The company’s existing investors include Bessemer Venture Partners, Kindred Ventures, Andreessen Horowitz, Notable Capital, First Round Capital, Unusual Ventures, and Village Global.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Netflix goes ‘all in’ on generative AI as entertainment industry remains divided",
    "url": "https://techcrunch.com/2025/10/21/netflix-goes-all-in-on-generative-ai-as-entertainment-industry-remains-divided/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-1240099721.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T22:21:46.000Z",
    "description": "As the entertainment industry reckons with when and how to use generative AI in filmmaking, Netflix is leaning in. In its quarterly earnings report released on Tuesday afternoon, Netflix wrote in its letter...",
    "body": "\nAs the entertainment industry reckons with when and how to use generative AI in filmmaking, Netflix is leaning in. In its quarterly earnings report released on Tuesday afternoon, Netflix wrote in its letter to investors that it is “very well positioned to effectively leverage ongoing advances in AI.”\nNetflix isn’t planning to use generative AI as the backbone of its content but believes the technology has potential as a tool to make creatives more efficient.\n“It takes a great artist to make something great,” Netflix CEO Ted Sarandos said on Tuesday’s earnings call. “AI can give creatives better tools to enhance their overall TV/movie experience for our members, but it doesn’t automatically make you a great storyteller if you’re not.”\nEarlier this year, Netflix said it used generative AI in final footage for the first time in the Argentine show “The Eternaut” to create a scene of a building collapsing. Since then, the filmmakers behind “Happy Gilmore 2” used generative AI to make characters look younger in the film’s opening scene, while the producers of “Billionaires’ Bunker” used the technology as a pre-production tool to envision wardrobe and set design.\n“We’re confident that AI is going to help us and help our creative partners tell stories better, faster, and in new ways,” Sarandos said. “We’re all in on that, but we’re not chasing novelty for novelty’s sake here.”\nAI has been a contentious topic in the entertainment industry, as artists worry that LLM-powered tools that nonconsensually used their work as training data have the potential to negatively impact their jobs.\nWith Netflix as a bellwether, it seems that studios are more likely to use generative AI for special effects rather than to replace the role of actors — even if an AI actor recently caused an uproar among Hollywood actors, despite not yet booking any gigs (that we know of). These behind-the-scenes AI uses still have the potential to impact visual effects jobs, however.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThese debates recently escalated when ChatGPT maker OpenAI unveiled its Sora 2 audio and video generation model, which was released without guardrails that prevent users from generating videos of some actors and historical figures. Just this week, the Hollywood trade organization SAG-AFTRA and actor Bryan Cranston urged OpenAI to institute stronger guardrails against deepfaking actors like Cranston himself.\nWhen an investor asked Sarandos about the impact of Sora on Netflix, he said that it “starts to make sense” that content creators could be impacted, but he’s less worried about the movie and TV business — or so he tells investors.\n“We’re not worried about AI replacing creativity,” he said.\nNetflix’s quarterly revenue grew 17% year-over-year to $11.5 billion, though this fell below the company’s forecast.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nSend tips through Signal, an encrypted messaging app, to @amanda.100. For anything else or to verify outreach, email amanda@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "One startup’s quest to store electricity in the ocean",
    "url": "https://techcrunch.com/2025/10/22/one-startups-quest-to-store-electricity-in-the-ocean/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Sizable-floating-reservoir-prototype.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T11:00:00.000Z",
    "description": "When Manuele Aufiero was a child, his parents would take him hiking along a reservoir in northern Italy. It wasn’t a typical reservoir, though. This one drained and refilled constantly, with pumps raising the...",
    "body": "\nWhen Manuele Aufiero was a child, his parents would take him hiking along a reservoir in northern Italy. It wasn’t a typical reservoir, though. This one drained and refilled constantly, with pumps raising the water level when electricity was cheap. When nearby cities needed electricity, the pumps would reverse, turning into generators as the water drained out of the reservoir.\nThe technology, known as pumped-storage hydropower, or pumped hydro for short, has been around for over a century. Such facilities are some of the biggest “batteries” humans have ever built. Globally, pumped hydro reservoirs store 8,500 gigawatt-hours of electricity, according to the International Energy Agency.\nPumped hydro can generate electricity for hours on end, and the power plants have grown in importance as intermittent energy sources like wind and solar have become more widespread. But there are only so many places on Earth with suitable topography to host a pumped hydro reservoir.\n“I’m in love with pumped hydro,” Aufiero told TechCrunch. “It’s just not enough to keep up with renewables.”\nSo Aufiero decided to solve that problem by moving the technology to the sea. He co-founded a startup, Sizable Energy, to turn his idea into reality.\nSizable recently raised $8 million in a funding round led by Playground Global with participation from EDEN/IAG, Exa Ventures, Satgana, Unruly Capital, and Verve Ventures, the company exclusively told TechCrunch.\nThe startup’s power plant looks something like an hourglass. Sizable’s concept specifies two sealed, flexible reservoirs, one that floats at the top and another that sits at the bottom on the seabed. They’re connected by a plastic tube and some turbines.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\nWhen power is cheap, the turbines will pump super salty water from the bottom reservoir to the top. When the grid needs energy, Sizable will open a valve, and because the water in the reservoir contains more salt than the surrounding seawater, it’s heavier and will fall down to the lower reservoir. As it flows through the pipe, it spins the turbines, which act as generators.\n“From the energy balance point of view, what we are doing is lifting block of salt. But instead of using cranes, we dissolve it and pump it just because it’s easier, simpler,” Aufiero said. “Other than that, we are just lifting a heavy amount of salt.”\nBy moving pumped hydro to the ocean, Sizable is hoping to mass produce the technology, something that isn’t really possible on land.\n“Every time you build pumped hydro on shore, you have to design a concrete dam for that specific site, and you have to adapt the technology there,” Aufiero said. “Building offshore allows us to streamline the production, and everything we do is identical, regardless of the final deployment site.”\nSizable has tested a small model of the reservoirs in wave tanks and off the coast of Reggio Calabria, Italy. It’s now deploying a pilot of the floating components in advance of a full demonstration plant. By 2026, it’s hoping to deploy several commercial projects at sites around the world. \nAt full size, the turbines would generate around 6 to 7 megawatts of electricity each, and there will be one for every 100 meters of pipe. Deeper sites would have more storage potential, and each commercial site would host multiple reservoirs. Sizable hopes to deliver energy storage for €20 per kilowatt-hour (about $23), about one-tenth what a grid-scale battery costs.\nThe technology would pair well with offshore wind projects since sharing an electrical connection to the shore would reduce costs. But Aufiero said that Sizable’s reservoirs could connect to any grid that’s near waters that are at least 500 meters (1,640 feet) deep.\n“We believe that long duration energy storage is required not only for renewable integration, but also for just making the grid resilient,” he said. “There is no way we can keep up with that with traditional pumped hydro or batteries. We need something new.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Several users reportedly complain to FTC that ChatGPT is causing psychological harm",
    "url": "https://techcrunch.com/2025/10/22/several-users-reportedly-complain-to-ftc-that-chatgpt-is-causing-psychological-harm/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T14:16:45.000Z",
    "description": "As AI companies claim their tech will one day grow to become a fundamental human right, and those backing them say slowing down AI development is akin to murder, the people using the tech are alleging that...",
    "body": "\nAs AI companies claim their tech will one day grow to become a fundamental human right, and those backing them say slowing down AI development is akin to murder, the people using the tech are alleging that tools like ChatGPT sometimes can cause serious psychological harm.\nAt least seven people have complained to the U.S. Federal Trade Commission that ChatGPT caused them to experience severe delusions, paranoia and emotional crises, Wired reported, citing public records of complaints mentioning ChatGPT since November 2022.\nOne of the complainants claimed that talking to ChatGPT for long periods had led to delusions and a “real, unfolding spiritual and legal crisis” about people in their life. Another said during their conversations with ChatGPT, it started using “highly convincing emotional language” and that it simulated friendships and provided reflections that “became emotionally manipulative over time, especially without warning or protection.”\nOne user alleged that ChatGPT had caused cognitive hallucinations by mimicking human trust-building mechanisms. When this user asked ChatGPT to confirm reality and cognitive stability, the chatbot said they weren’t hallucinating. \n“Im struggling,” another user wrote in their complaint to the FTC. “Pleas help me. Bc I feel very alone. Thank you.”\nAccording to Wired, several of the complainants wrote to the FTC because they couldn’t reach anyone at OpenAI. And most of the complaints urged the regulator to launch an investigation into the company and force it to add guardrails, the report said.\nThese complaints come as investments in data centers and AI development soar to unprecedented levels. At the same time, debates are raging about whether the progress of the technology should be approached with caution to ensure it has safeguards built in. \nChatGPT, and its maker OpenAI, itself has come under fire for allegedly playing a role in the suicide of a teenager. \n“In early October, we released a new GPT-5 default model in ChatGPT to more accurately detect and respond to potential signs of mental and emotional distress such as mania, delusion, psychosis, and de-escalate conversations in a supportive, grounding way,” OpenAI spokesperson Kate Waters said in an emailed statement. “We’ve also expanded access to professional help and hotlines, re-routed sensitive conversations to safer models, added nudges to take breaks during long sessions, and introduced parental controls to better protect teens. This work is deeply important and ongoing as we collaborate with mental health experts, clinicians, and policymakers around the world.”\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "YouTube adds a timer for you to stop scrolling Shorts",
    "url": "https://techcrunch.com/2025/10/22/youtube-adds-at-timer-for-you-to-stop-scrolling-shorts/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/youtube-shorts.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T13:00:00.000Z",
    "description": "It’s common for people to open a short video, thinking they’ll just watch the one — then realize they’re still on the app an hour later. YouTube is adding a new timer feature to help users manage this...",
    "body": "\nIt’s common for people to open a short video, thinking they’ll just watch the one — then realize they’re still on the app an hour later. YouTube is adding a new timer feature to help users manage this behavior, a move that reflects both growing public pressure on tech platforms and the company’s interest in fostering long-term engagement rather than risking user burnout.\nUsers can set a daily time limit for Shorts viewing through the app’s settings. Once they reach their limit, they see a pop-up notifying them that scrolling on the Shorts feeds is paused — though the pop-up is dismissible.\nEarlier this year, after Android Authority spotted the feature in development in one of the Android APKs (app files), YouTube confirmed it was exploring the time-limit feature for Shorts consumption.\nYouTube notes that the limit is currently not integrated with parental controls, meaning parents or guardians can’t just set a specific limit on how much their kids scroll the Shorts feed. However, the company says parental controls are coming next year, when children won’t be able to dismiss their prompts.\nIn the past, YouTube has rolled out digital well-being features, including “take a break” and “bedtime” reminders to curb users’ doomscrolling habits. \nWith “Take a Break,” for example, users can set a reminder to appear every 15, 30, 60, 90 or 180 minutes, at which point the video will pause. Users can then choose to dismiss the reminder and keep watching, or close the app.\nSimilarly, with its bedtime reminder feature, users set a specific time window (start and end time) when they want to be reminded to stop watching and go to bed. When that bedtime arrives, YouTube shows a notification reminding them to stop watching.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhile features like these help demonstrate corporate responsibility, their optional nature means they may not actually reduce engagement, allowing YouTube to address concerns about addictive design while maintaining its core business model.\nRight now, according to a recent Bloomberg Law report, nearly 2,000 lawsuits are pending in the U.S. against social media companies, with families, school districts, and state attorneys general alleging that platforms have intentionally designed addictive features that harm children’s mental health.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "OpenAI’s new browser is a broadside shot at Google ",
    "url": "https://techcrunch.com/2025/10/21/openais-new-browser-is-a-broadside-shot-at-google/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-21-at-5.13.11-PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-21T21:17:50.000Z",
    "description": "Today, OpenAI launched its new Atlas web browser in a surprise livestream. The show started with CEO Sam Altman, speaking directly to the audience.   “We think AI represents a rare, once-a-decade opportunity...",
    "body": "\nToday, OpenAI launched its new Atlas web browser in a surprise livestream. The show started with CEO Sam Altman, speaking directly to the audience.  \n“We think AI represents a rare, once-a-decade opportunity to rethink what a browser can be,” Altman said. “In the same way that, for the previous way people used the internet, the URL bar and the search box were a great analogue, what we’re starting to see is that the chat experience and the web browser can be a quick analogue.” \nIt was an inspiring note, in the classic Steve Jobs mode. But even more important than Altman’s browser was the detritus he was sweeping aside to make room. It wasn’t just casting present-day browsers as old, but part of a whole package of goods that are about to be replaced by AI — as Altman put it, part of “the previous way people used the internet.” And most of those soon-to-be obsolete services trace back to a single company: Google. \nOpenAI’s browser project has been an open secret in Silicon Valley since at least this summer — and it was clear from the beginning that it would be a potential threat to Google, current owner of the world’s most popular browser. But Tuesday’s product and presentation details made it clear exactly how much the web giant has to lose in the AI era — and how little the Google’s success with Gemini seems to have helped. \nThe immediate threat is simple enough: ChatGPT draws 800 million users a week, and if those users switch to Atlas, they’re most likely switching away from Chrome. Losing those users doesn’t have an immediate dollar cost for Google (it’s a free product, after all) but it limits Google’s ability to target ads to those users or nudge them to Google Search — a particular sore point because, just last month, Google was barred by the U.S. Department of Justice from making any search exclusivity deals. \nThen, there’s how OpenAI deals with search itself. AI has already strained the search model of the web, surfacing processed information instead of content that can be advertised against. But on OpenAI’s livestream, Atlas head of engineering Ben Goodger (himself a central figure in developing both Firefox and Chrome) described the new kind of chat-oriented search as a paradigm shift. \n“This new model of search is really powerful,” Goodger said. “It’s a multi-turn experience. You can have this back-and-forth with your search results instead of just being sent off to a web page.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOf course, Google has done a lot to integrate AI into the normal search experience — but the company has mostly approached it the same way as product listings or reviews: by adding a box to the results page. But OpenAI’s kind of engaged back-and-forth is beyond anything you can get on Chrome, and given its profoundly different approach, it’s not something that can be easily copied. If OpenAI’s search interface proves popular, it could be a serious threat to Google’s dominance. \nThen there’s the advertising question. OpenAI doesn’t serve advertising at the moment, but it has been careful not to rule it out. The company has also been listing a lot of adtech jobs lately, fueling speculation that an ad pivot might be on the way. With Atlas, ChatGPT can now collect context directly from a user’s browser window — providing a lot of extremely valuable data for ad targeting. It’s an unprecedented level of direct browser access: literally looking at the words on your screen as you type them. And after decades of privacy scares, it’s not the kind of sensitive information that users are likely to give to Google or Meta. \nIt’s still early days for Atlas and a lot will depend on the product itself — and whether users really want what OpenAI is offering here. But the company has plotted a surprisingly commercial path here, one focused on user and revenue growth rather than hazy ambitions around AGI. As infrastructure wonks ponder the $300 billion question of whether OpenAI’s revenues can ever live up to its enormous data center buildout, products like Atlas may be the first place to look for an answer. \n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sumble emerges from stealth with $38.5M to bring AI-powered context to sales intelligence",
    "url": "https://techcrunch.com/2025/10/22/sumble-emerges-from-stealth-with-38-5m-to-bring-ai-powered-context-to-sales-intelligence/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Sumble-Team-e1761063941876.png?w=150",
    "tag": "Tech",
    "date": "2025-10-22T13:30:00.000Z",
    "description": "Ask any salesperson how much information they’d like on a prospective customer and you’ll never hear the end of it. That’s the premise driving the crowded sales intelligence market, which today has services...",
    "body": "\nAsk any salesperson how much information they’d like on a prospective customer and you’ll never hear the end of it. That’s the premise driving the crowded sales intelligence market, which today has services that can do everything from helping to identify prospects and surface background about them, to even writing the pitch and performing autonomous follow-ups.\nBut sales teams need more than data; they want context. Sumble, a startup out of San Francisco, is trying to provide that context by trawling the web across social media, job boards, company sites, regulatory filings and so on, to surface information about what’s happening inside companies.\nThe brainchild of Anthony Goldbloom and Ben Hamner, the founders of data science and machine learning community Kaggle, Sumble uses a knowledge graph underpinned by large language models to connect the various data points it gathers. The result, Goldbloom told TechCrunch, is a comprehensive view of a company’s technographic data — which tools are used in which departments, any projects being launched or run, its organizational chart, what tech a company might be looking to adopt, and crucially, who to contact.\nBut given how crowded this market already is, from incumbents to myriad AI sales development reps agents, the question is: does the world really need more?\nGoldbloom believes so, and says the startup’s approach seems to be working: He told TechCrunch that since the startup launched in April 2024, it’s signed 19 enterprise customers, including Snowflake, Figma, Wiz, Vercel and Elastic, and it has tens of thousands of users in total. About 30% of its users pay for a Pro subscription (either themselves or their company does) and so far, growth has been driven by word of mouth. The startup declined to share details of its revenue, but we understand revenue increased by 550% year-over-year.\n “What tends to happen is, we go viral inside a company,” Goldbloom said. “We’ll go from 1 to 500 MAUs [monthly active users] in a company over a six-month period. And the way the spread happens is normally within a Slack channel, then within a single team, then within an office, and then within that company.”\nGoldbloom said traction, the quality of customers, and strong customer retention played a big role in catching investors’ attention. The startup on Wednesday emerged from stealth with $38.5 million in funding — Coatue led an $8.5 million seed round, while Canaan Partners led a $30 million Series A. AIX Ventures, Square Peg, Bloomberg Beta, Zetta, and angel investors, including Salesforce CEO Marc Benioff and former GitHub CEO Nat Friedman, also invested.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nNotably, Sumble’s co-founders have attracted investors they’re quite familiar with. Rich Boyle, currently a general partner at Canaan, was a board observer at Kaggle, while Bloomberg Beta and Zetta also were on Kaggle’s cap table. And Goldbloom co-founded AIX Ventures and is an investment partner, though he told TechCrunch he’d “stepped out of the room” when the firm considered the investment in Sumble.\nStill, Sumble faces a lot of competition. Challengers include Apollo.io, Slintel, SalesLoft, Cognism, Reply.io, ZoomInfo, HubSpot and Outreach, among others who deliver either more focused point solutions or all-in-one sales IT toolkits. And since Sumble currently uses publicly available data, there’s little to stop others from doing what it does currently.\nGoldbloom, however, is confident that Sumble’s moat is deeper than it looks at first sight, thanks to how its knowledge graph is structured, covering about 2.6 million companies around the world.\n“The way we think about it is, the more data that we add into the knowledge graph, the richer the corpus will be. We view the richness of the knowledge graph as a massive source of defensibility,” he said.\nSumble is also counting on the continued adoption of large language models to help it continue to scale as it expects to see people using AI along with its service. “The way we structure our data is so the knowledge graph is and always will be very query-able by large language models […] The idea being that you can ask ChatGPT about the Apple text stack, or you can ask ChatGPT about the Apple tech stack grounded by our data,” Goldbloom said.\n“We think AI is going to change the data vendor landscape a lot such that having a knowledge graph structure as a way to feed context into the large language model is going to be a key part of the LLM ecosystem,” he added.\nThe service is currently offered as a web app and via an API, and there’s also a paid plan that offers more features like integrations into workflows and CRMs, as well as notifications when a development at a prospect may be of interest.\n"
  },
  {
    "title": "Life360 ventures into pet tech with the launch of a new GPS tracker",
    "url": "https://techcrunch.com/2025/10/22/life360-ventures-into-pet-tech-with-the-launch-of-a-new-gps-tracker/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Pet-GPS-Pink-Punch.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-22T12:00:00.000Z",
    "description": "The family safety app Life360 is venturing into pet tech with the launch of its new tracking device, the Pet GPS. Designed to attach to a collar or harness, this new device aims to offer pet owners peace of...",
    "body": "\nThe family safety app Life360 is venturing into pet tech with the launch of its new tracking device, the Pet GPS. Designed to attach to a collar or harness, this new device aims to offer pet owners peace of mind by delivering real-time location updates for their dogs and cats.\nThe launch of the Pet GPS feels like a natural evolution for Life360, particularly following its acquisition of the tracking device company Tile in 2021. Since then, the company has integrated Tile’s item-finding capabilities into its app, including the ability to assign a Tile tracker to their pet.\nRetailing at $49.99, Life360’s Pet GPS stands as the priciest offering in its lineup. However, it comes with a range of features that pet owners may find worthwhile.\nImage Credits:Life360\nKey features include geofencing (virtual boundary alerts), escape alerts, and access to a Pet Finder Network. Pet owners can set up safe zones, and if a pet runs off, an escape alert will be triggered.\nUsers can also alert the nearby community about a lost pet. When issuing a lost pet alert, the app shares important information with nearby members, such as the pet’s name, image, breed, and emergency contact details.\nLife360 says its network comprises over 88 million members, providing users with a substantial community to help locate their missing pet.\nImage Credits:Life360\nThe pet tracker combines cellular, GPS, Wi-Fi, and Bluetooth to provide the most accurate location, updating every 2 to 4 seconds when the pet is away from home. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOther helpful features include a built-in light, which can be activated through the app to help find a pet in the dark. The device also features a chime noise function, allowing owners to call their pets when needed — as when they are taking too long to relieve themselves in the yard or they’re hiding under the couch. \nWith an IP68 rating, Life360 says the device is water-resistant, dustproof, and resistant to pet bites. \nThe device includes a charger with a battery life lasting up to 14 days. There’s also a “Bluetooth Reserve Mode,” which extends battery life to keep a pet locatable for up to six months. \nLife360’s Pet GPS comes in three colors: pink, navy, and black. It’s available for purchase in the U.S., UK, Canada, Australia, and New Zealand at Life360.com. To access all features, users need a Gold ($14.99/month) or Platinum ($24.99/month) subscription. \n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]