[
  {
    "title": "Ramp hits $32B valuation, just 3 months after hitting $22.5B ",
    "url": "https://techcrunch.com/2025/11/17/ramp-hits-32b-valuation-just-three-months-after-hitting-22-5b/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/03/GettyImages-1434828961.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T19:31:47.000Z",
    "description": "In Brief Posted: 11:31 AM PST · November 17, 2025  Image Credits:Kelly Sullivan / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  The one area outside of AI where investors are still enthusiastic is...",
    "body": "\nIn Brief\nPosted:\n11:31 AM PST · November 17, 2025\n\nImage Credits:Kelly Sullivan / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe one area outside of AI where investors are still enthusiastic is expense management fintech, at least if Ramp’s 2025 is anything to judge by. Every few months, Ramp has raised another large sum at another giant new valuation. On Monday, the fintech announced it had raised $300 million led by Lightspeed, which also included an employee tender offer.\nThis is just a few months after a $500 million Series E-2 at a $22.5 billion valuation led by Iconiq, announced on July 30. That round was just a few weeks after a $200 million Series E at a $16 billion valuation led by Founders Fund, announced in mid-June. And that Series E was just three months after a $150 million secondary share sale at a $13 billion valuation in March.  \nIn April 2024, Ramp had raised a $150 million Series D co-led by Khosla and Founders Fund at a $7.65 billion valuation. \nWith Monday’s round, Ramp has raised $2.3 billion in total equity financing, it says. And in 2025 alone, the company leapt from being worth $13 billion to $32 billion. \nRamp in October said it had surpassed $1 billion in annualized revenue, meaning it was on a trajectory to bring in that much on a 12-month basis. \nRamp today offers corporate expense management. While it has an AI story to tell — automating some approvals and processes via agentic offerings — it is not an AI company per se. It offers corporate credit cards, expense management/purchase order software, and corporate travel. The company says it has surpassed 50,000 customers.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n"
  },
  {
    "title": "Ford turns to Amazon to give used cars sales a boost",
    "url": "https://techcrunch.com/2025/11/17/ford-turns-to-amazon-to-give-used-cars-sales-a-boost/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1988747725.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T20:37:42.000Z",
    "description": "In Brief Posted: 12:37 PM PST · November 17, 2025  Image Credits:Jacek Boczarski/Anadolu / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  One year ago, e-commerce giant Amazon kicked off its new...",
    "body": "\nIn Brief\nPosted:\n12:37 PM PST · November 17, 2025\n\nImage Credits:Jacek Boczarski/Anadolu / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOne year ago, e-commerce giant Amazon kicked off its new online car sales business with Hyundai. Now, Ford is joining in with a certified used car twist.\nFord announced Monday that customers will be able to shop for, finance, and purchase certified pre-owned Ford vehicles on Amazon Autos. The partnership still keeps dealerships — a key revenue driver for Ford — in the loop. Customers can browse a participating local dealer’s inventory directly through Amazon’s website, complete most of the paperwork online, and then schedule a time to pick up the selected vehicle, according to Ford.\nFord said any certified pre-owned vehicle sold by dealers on Amazon Autos comes with a money-back guarantee. Customers can return the vehicle within 14 days or 1,000 miles, whichever comes first.\nAmazon Autos functions like the rest of the broader Amazon e-commerce ecosystem. Shoppers can search for available vehicles from participating dealers by model, trim, color, and features. Customers can also secure financing and e-sign paperwork via the Amazon Autos site. \nWhen Amazon Autos launched last year, it was focused on new car sales, namely Hyundai. The addition of Ford opens up a different, although related, market of certified pre-owned vehicles.\nFord vehicles on Amazon Autos will initially be offered in just a few markets, including Los Angeles, Seattle, and Dallas. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "Jeff Bezos reportedly returns to the trenches as co-CEO of new AI startup, Project Prometheus",
    "url": "https://techcrunch.com/2025/11/17/jeff-bezos-reportedly-returns-to-the-trenches-as-co-ceo-of-new-ai-startup-project-prometheus/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2208733347.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T14:33:30.000Z",
    "description": "In Brief Posted: 6:33 AM PST · November 17, 2025  Image Credits:Emma McIntyre/WireImage  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Amazon’s founder Jeff Bezos seems to be getting his hands dirty once again:...",
    "body": "\nIn Brief\nPosted:\n6:33 AM PST · November 17, 2025\n\nImage Credits:Emma McIntyre/WireImage\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAmazon’s founder Jeff Bezos seems to be getting his hands dirty once again: The billionaire is partly backing a new AI startup called Project Prometheus that has raised $6.2 billion in funding, and will take on duties as co-chief executive of the new venture, The New York Times reported, citing several sources familiar with the project.\nBezos will share the position with Vik Bajaj, who previously led and co-founded Google’s life sciences division. Bajaj also co-founded Verily, a biotech startup owned by Alphabet, and is the co-founder of Foresite Labs, an AI-focused affiliate of investment firm Foresite Capital, though the report notes he recently left the firm to start Prometheus, the report said.\nBezos would be returning to operations for the first time since he stepped away from Amazon in 2021.\nAccording to the NYT, the startup is going to build AI products for engineering and manufacturing in various fields like computers, aerospace, and automobiles. Project Prometheus is focused on “AI for the physical economy,” per its LinkedIn page, and the report noted that its work will resemble that of Periodic Labs, which is building technology to speed up scientific research by simulating the physical world to train AI models.\nThe company already has almost 100 staff, including researchers from AI firms like Meta, OpenAI, and Google DeepMind, the report said.\nAmazon and Bajaj did not immediately respond to a request for comment. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "DoorDash confirms data breach impacting users’ phone numbers and physical addresses",
    "url": "https://techcrunch.com/2025/11/17/doordash-confirms-data-breach-impacting-users-phone-numbers-and-physical-addresses/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-1147932669.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T15:27:38.000Z",
    "description": "In Brief Posted: 7:27 AM PST · November 17, 2025  Image Credits:Tibrina Hobson / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  DoorDash disclosed a data breach that exposed the personal information...",
    "body": "\nIn Brief\nPosted:\n7:27 AM PST · November 17, 2025\n\nImage Credits:Tibrina Hobson / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nDoorDash disclosed a data breach that exposed the personal information of an unspecified number of users, which included names, email addresses, phone numbers, and physical addresses.\nDespite the fact that hackers stole phone numbers and physical addresses, DoorDash said that “no sensitive information was accessed by the unauthorized third party and we have no indication the data has been misused for fraud or identity theft at this time.”\nDoorDash said in the post that the breach impacted a mix of customers, delivery workers, and merchants. \nCompany spokesperson Michelle Babin did not respond when asked exactly how many users were victims of the breach. Instead, Babin sent a statement that largely echoed the blog post about the breach.\nThe breach originated from an employee falling for a social engineering attack. When the company identified the breach, it shut down the hackers’ access to its systems, started an investigation, and reported the incident to law enforcement, according to a post published last week by the company.\nDoorDash said no “Social Security numbers, other government-issued identification numbers, driver’s license information, or bank or payment card information” were stolen as part of the breach. \nThe company said it has notified impacted users.\nThis story has been updated to include DoorDash’s spokesperson response.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n"
  },
  {
    "title": "Databricks reportedly in talks to raise funding at a $130B+ valuation",
    "url": "https://techcrunch.com/2025/11/18/databricks-reportedly-in-talks-to-raise-funding-at-a-130b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-2157160096.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-18T11:31:44.000Z",
    "description": "In Brief Posted: 3:31 AM PST · November 18, 2025  Image Credits:Smith Collection/Gado / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Data intelligence company Databricks is reportedly already in...",
    "body": "\nIn Brief\nPosted:\n3:31 AM PST · November 18, 2025\n\nImage Credits:Smith Collection/Gado / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nData intelligence company Databricks is reportedly already in talks to raise fresh capital, just a few months after its last fundraise.\nDatabricks is holding conversations to raise a funding round that values the company at a minimum of $130 billion, according to reporting from The Information. The company hasn’t signed a term sheet yet, the report added.\nThat would prove a valuation bump of at least 30% over the $100 billion price tag Databricks achieved in its $1 billion Series J funding round in August.\nAt the time, Databricks co-founder and CEO Ali Ghodsi told TechCrunch that the company raised the round to fund two specific projects: a database for AI agents and its AI agent platform.\n“The database market is $105 billion of TAM [total addressable market], of revenue, sitting there, kind of unaffected in the last 40 years,” Ghodsi told TechCrunch at the time. “Here’s the interesting statistic nobody’s paying attention to: a year ago, we saw in the data that 30% of the databases were not created by humans. For the first time, they were created by AI agents. And this year, the statistic is 80%.”\nDatabricks bought open-source database startup Neon for $1 billion in May, which was one of the first transactions that kicked off a wave of consolidation in the database space.\nDatabricks did not immediately respond to a request for confirmation and more information.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Enterprise\n"
  },
  {
    "title": "Luminal raises $5.3 million to build a better GPU code framework",
    "url": "https://techcrunch.com/2025/11/17/luminal-raises-5-3-million-to-build-a-better-gpu-code-framework/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Studio-Session-71723.jpeg?w=100",
    "tag": "Tech",
    "date": "2025-11-17T14:03:33.000Z",
    "description": "Inference optimization startup Luminal has announced $5.3 million in a seed funding round led by Felicis Ventures, with angel investment from Paul Graham, Guillermo Rauch, and Ben Porterfield. ",
    "body": "\nThree years ago, Luminal co-founder Joe Fioti was working on chip design at Intel when he came to a realization. While he was working on making the best chips he could, the more important bottleneck was in software.\n“You can make the best hardware on earth, but if it’s hard for developers to use, they’re just not going to use it,” he told me.\nNow, he’s started a company that focuses entirely on that problem. On Monday, Luminal announced $5.3 million in seed funding, in a round led by Felicis Ventures with angel investment from Paul Graham, Guillermo Rauch, and Ben Porterfield. \nFioti’s co-founders, Jake Stevens and Matthew Gunton, come from Apple and Amazon, respectively, and the company was part of Y Combinator’s Summer 2025 batch.\nLuminal’s core business is simple: the company sells compute, just like neo-cloud companies like Coreweave or Lambda Labs. But where those companies focus on GPUs, Luminal has focused on optimization techniques that let the company squeeze more compute out of the infrastructure it has. In particular, the company focuses on optimizing the compiler that sits between written code and the GPU hardware — the same developer systems that caused Fioti so many headaches in his previous job.\nAt the moment, the industry’s leading compiler is Nvidia’s CUDA system — an underrated element in the company’s runaway success. But many elements of CUDA are open-source, and Luminal is betting that, with many in the industry still scrambling for GPUs, there will be a lot of value to be gained in building out the rest of the stack.\nIt’s part of a growing cohort of inference-optimization startups, which have grown more valuable as companies look for faster and cheaper ways to run their models. Inference providers like Baseten and Together AI have long specialized in optimization, and smaller companies like Tensormesh and Clarifai are now popping up to focus on more specific technical tricks.\nLuminal and other members of the cohort will face stiff competition from optimization teams at major labs, which have the benefit of optimizing for a single family of models. Working for clients, Luminal has to adapt to whatever model comes their way. But even with the risk of being out-gunned by the hyperscalers, Fioti says the market is growing fast enough that he’s not worried.\n“It is always going to be possible to spend six months hand tuning a model architecture on a given hardware, and you’re probably going to beat any sorts of, any sort of compiler performance,” Fioti says. “But our big bet is that anything short of that, the all-purpose use case is still very economically valuable.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Bone AI raises $12M to challenge Asia’s defense giants with AI-powered robotics",
    "url": "https://techcrunch.com/2025/11/17/bone-ai-raises-funding-to-challenge-asias-defense-giants-with-next-gen-ai-powered-robotics/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/DK_InLex-5.png?w=150",
    "tag": "Tech",
    "date": "2025-11-17T13:00:00.000Z",
    "description": "South Korea’s major defense giants have amassed roughly $69 billion in order backlogs as of late 2024, according to media reports. Seoul is also accelerating investment in advanced weapons systems and...",
    "body": "\nSouth Korea’s major defense giants have amassed roughly $69 billion in order backlogs as of late 2024, according to media reports. Seoul is also accelerating investment in advanced weapons systems and expanding its defense ties, particularly with Europe. With the new EU-South Korea Security and Defence Partnership in 2024 and growing exports of vehicles and artillery, the country has become the second-largest arms supplier to European NATO members.\nYet despite that enormous industrial footprint, remarkably few startups have emerged to match or challenge the incumbents. The country’s defense-tech startup scene is still nascent, exposing a wide gap between Korea’s manufacturing strength and its early-stage innovation.\nBone AI, a new startup based in Seoul and Palo Alto, California, launched earlier this year with an ambitious plan to build a fully unified AI platform that ties together software, hardware, and manufacturing. \nThe company develops next-generation autonomous air (UAVs), ground (UGVs), and marine (USVs) vehicles for defense and government clients, focusing largely on B2G contracts. While it ultimately aims to operate all three types of systems, Bone is starting with its defense-focused aerial drones, which are designed to streamline missions such as logistics support, wildfire detection, and anti-drone defense.\nThe company, founded by DK Lee (who also co-founded MarqVision), has raised a $12 million seed round led by Third Prime with participation from Kolon Group, a South Korean strategic investor that has expertise in developing advanced materials and manufacturing. Kolon is an ideal strategic partner for Bone, which operates across AI, robotics, and next-generation manufacturing, Lee said in an exclusive interview with TechCrunch.\nThe startup is already generating revenue, landing a seven-figure B2G contract and pulling in $3 million in its first year of operation, Lee noted. In addition, Bone has been selected as a winner in a South Korean government-backed end-to-end logistics program that will deploy UAVs and UGVs powered by its autonomy stack.\nWhen asked how a company less than a year old is already securing contracts and generating revenue, Lee told TechCrunch that Bone acquired a South Korean drone company called D-Makers, and its intellectual property (IP), just six months after launch. Originally focused on AI models for robotics, Bone is now integrating its existing AI division with the newly acquired company, and more acquisitions are on the horizon, he added.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLee personally committed more than 10% of the round, approximately $1.5 million, he told TechCrunch. “That was important to me because I wanted to show both investors and my team that I’m fully invested, financially and emotionally, in this mission,” he said.\nBone is Lee’s second venture. His experience co-founding MarqVision gave him firsthand insight into building and scaling AI products worldwide, but it also convinced him that the next frontier of AI isn’t just digital; it’s physical.\n“After leaving MarqVision, I basically started from zero — going to robotics conferences like IEEE ICRA, cold-emailing the engineers behind Google RT-1/RT-2, and even walking up to Jim Keller, CEO of Tenstorrent, at a cafe just to introduce myself and grab a coffee later,” Lee said.\nBone AI shouldn’t be pigeonholed as just a defense tech company, the founder continued. With broader ambitions, Lee frames it as a “physical AI” firm, bringing together advanced AI simulation, autonomy algorithms, embedded engineering, hardware design, and large-scale manufacturing under one roof.\nWhile preparing his second company, Lee observed that AI and hardware were advancing in silos.\n“No one was building the connective tissue, the industrial backbone that allows intelligent machines to exist at scale. Even Nvidia, the most valuable AI company today, relies on a vast ecosystem of fabrication and manufacturing partners across Asia and Europe,” he told TechCrunch.\nLee points to South Korea’s track record of building global hardware manufacturing powerhouses like Hyundai, Samsung, and LG. “This is why we should see more drone and small-robotics companies emerging here, and why Korea is fully capable of supporting them,” the CEO said. “Our mission at Bone is to build the supply chain for physical AI within South Korea, and then expand that capability to the U.S., Europe, and other allied countries.”\nAnduril has become a household name in the U.S., boasting a valuation north of $30 billion, while in Europe, Helsing last raised funding at around $13 billion. Even in smaller markets like Israel, companies such as Kela Technologies have achieved similar recognition.\nAsia has yet to see the same level of adoption, Michael Kim, general partner at Third Prime, told TechCrunch. “As economies around the world focus on reindustrialization, not just the U.S., Bone sits at the intersection of sovereign AI, multipolarity, and reindustrialization,” he said, highlighting both the company’s mission and the problem it aims to solve.\nSouth Korea has high-quality, cost-competitive hardware manufacturing across multiple sectors such as heavy industry, shipbuilding, cars, and semiconductors.\n“Many niche hardware players exist but haven’t received Bay Area VC funding; Bone has a strong ‘buy versus build strategy’ to acquire and integrate these assets, accelerating product maturity and commercial traction,” Kim said.\n"
  },
  {
    "title": "Cisco acquires translation startup EzDubs",
    "url": "https://techcrunch.com/2025/11/17/cisco-acquires-translation-startup-ezdubs/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1424498694.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T18:33:03.000Z",
    "description": "Networking giant Cisco has acquired EzDubs, a Y Combinator-backed consumer startup that provides real-time translation services. Cisco announced the acquisition over the weekend, but the company didn’t...",
    "body": "\nNetworking giant Cisco has acquired EzDubs, a Y Combinator-backed consumer startup that provides real-time translation services. Cisco announced the acquisition over the weekend, but the company didn’t disclose the size of the deal.\nEzDubs was founded by Padmanabhan Krishnamurthy, Amrutavarsh Kinagi, and Kareem Nassar in 2023. Notably, Nassar had previously worked at Cisco’s Speech AI group before co-founding the startup. The company raised $4.2 million in seed funding led by Venture Highway, which was founded by Neeraj Arora, who was previously WhatsApp’s chief business officer. Other investors in EzDubs include Replit CEO Amjad Masad; Replit President Michele Catasta; Qasar Younis, who is CEO of the autonomous vehicle software company Applied Intuition; and Ben Firshman, CEO of the cloud startup Replicate (which was itself acquired by Cloudflare in a deal that was announced on Monday).\nCisco said it plans to integrate EzDubs’ tech into its communication platform, Cisco Collaboration, which spans hardware and software. This means users can get features like live translation in products like Webex video calling and messaging. Cisco’s blog post also indicated that it could make the translation tech — which preserves the speaker’s original voice — available to partners and developers.\n“The EzDubs team will join Cisco Collaboration, working side-by-side with our product, engineering, and go-to-market teams. Together, we will chart a new course for the industry, one where AI doesn’t just support collaboration, but truly empowers it,” Snorre Kjesbu, SVP of Collaboration at Cisco, said in the post.\nCisco didn’t clarify whether all members of EzDubs’ team are joining the company. We have asked the company to clarify and will update the story if we hear back.\nEzDubs is sunsetting its consumer apps, which supported call translations for more than 30 languages, by December 15. \n“From launching the world’s first video dubbing tool that garnered millions of views on X (fka Twitter) to enabling real-time, voice and emotion preserving phone call translation across 30+ languages, this journey has been extraordinary. But what has truly meant the most is the support, feedback, and stories you’ve shared along the way,” the startup said in a blog post.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn recent months, there have been a few acquisitions in the translation space. This month, Seven Seven Six-backed Palabra AI acquired live communication platform Talo. In July, language localization company TransPerfect acquired Unbabel, a translation startup founded in Portugal.\nEzDubs’ acquisition also raises the question of whether it’s viable to build a translation focused on consumers when there is more money and demand in the enterprise communication market. According to various reports, the translation services market is valued at approximately $40 billion.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Luminar is fighting with its biggest customer as bankruptcy threat looms",
    "url": "https://techcrunch.com/2025/11/17/luminar-is-fighting-with-its-biggest-customer-as-bankruptcy-threat-looms/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/volvo-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T18:00:44.000Z",
    "description": "Swedish automaker Volvo has canceled a five-year-old contract with Luminar, the latest escalation in an increasingly ugly brawl between the lidar sensor company and its biggest customer. The fight is...",
    "body": "\nSwedish automaker Volvo has canceled a five-year-old contract with Luminar, the latest escalation in an increasingly ugly brawl between the lidar sensor company and its biggest customer.\nThe fight is happening during an existential moment for Luminar. The company recently defaulted on several of its loans. While it’s working with those lenders on a resolution, Luminar has warned investors it may have to declare bankruptcy.\nTo stave that off, Luminar recently laid off 25% of its staff and is trying to sell itself — or parts of itself — to potential buyers. One of them is Luminar founder Austin Russell, who resigned from the CEO role in May during an ethics inquiry. Luminar is also being investigated by the Securities and Exchange Commission, recent filings reveal.\n“Volvo Cars has made this decision to limit the company’s supply chain risk exposure and it is a direct result of Luminar’s failure to meet its contractual obligations to Volvo Cars,” the automaker said in a statement to TechCrunch. Luminar did not respond to a request for comment.\nVolvo is not just a Luminar customer. The two companies have spent much of the last decade working together. Volvo invested in Luminar and helped the Florida-based startup get into some of its first production vehicles. \nThe relationship has been mutually beneficial. Luminar’s tech gave Volvo the confidence to dish out big promises about making the roads safer by offering automated driving features. Volvo gave Luminar credibility ahead of a 2020 SPAC merger that made Russell one of the youngest self-made billionaires ever.\nBut Luminar has faced challenges as a public company. It struggled to diversify away from Volvo, and in 2024 cut a fifth of its staff while deciding to outsource manufacturing of its sensors. Then, in May of this year, Russell abruptly resigned as Luminar revealed its board had opened a “code of business conduct and ethics” inquiry. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe fight with Volvo bubbled to the surface on October 31. \nThe company told shareholders in a regulatory filing on that day that Volvo decided to no longer make Luminar’s “Iris” lidar a standard sensor on its EX90 and ES90 vehicles. Volvo also told Luminar that it had “deferred” the decision of whether to include its next-generation “Halo” sensor in the Swedish automaker’s future vehicles.\nLuminar said in the filing that it had “made a claim against Volvo for significant damages” and “suspended further commitments of Iris” for the automaker. \n“The Company is in discussions with Volvo concerning the dispute; however, there can be no assurance that the dispute will be resolved favorably or at all,” Luminar wrote.\nVolvo told TechCrunch Monday that its “products can deliver a high level of safety and driver support, enabled by the cars’ powerful core computing coupled with their advanced sensor set — with or without a lidar.” But, it added, the “situation has an effect on some customer orders.” It did not immediately explain whether that meant a delay, or something else.\nVolvo’s decisions were not just a threat to Luminar’s revenue — they also had knock-on effects for Luminar. In the October filing, Luminar said it stopped spending money on Iris sensors for Volvo, and in turn, the supplier that makes the sensors claimed this was a breach of their agreement.\nThis story has been updated with comments from Volvo. \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sequoia-backed fintech Aspora will let Indian diaspora pay bills back home",
    "url": "https://techcrunch.com/2025/11/17/sequoia-backed-fintech-aspora-will-let-indian-diaspora-pay-bills-back-home/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Image-1.png?w=150",
    "tag": "Tech",
    "date": "2025-11-17T17:22:21.000Z",
    "description": "The startup said that until now, users had to either transfer the money to their Indian accounts or ask someone to handle the bills for them. The other option for them was to use their foreign cards and try and pay bills while facing high charges and payment failures.",
    "body": "\nSequoia-backed fintech platform Aspora, which lets the Indian diaspora send money back to India, is launching a new feature for users to pay bills. This means non-resident Indians (NRIs) can pay utility bills or recharge their mobile prepaid plans for their family.\nThe startup said that until now, users had to either transfer the money to their Indian accounts or ask someone to handle the bills for them. The other option for them was to use their foreign cards and try and pay bills while facing high charges and payment failures.\nAspora has hooked up to the Bharat Bill Payment System (BBPS), which handles bill payments in India, using Yes Bank’s domestic pipeline. Through this system, it has enabled payment for more than 22,000 billers in India, ranging from electricity providers such as BSES and BESCOM, broadband providers like Jio and Airtel, and loan payments for major banks.\nThe startup said it’s not charging any fees for these payments, and the users get the best exchange rates to pay the bill directly in foreign currency.\n“For millions of Indians living overseas, paying bills in India has always been unnecessarily complex — involving transfers, delays, and double fees. Aspora has now solved this large-scale problem at the tap of a button,” Aspora founder and CEO Parth Garg told TechCrunch in a recent phone interview.\nGarg said bill payments might reduce remittances, but only by 4% to 5% of total transfers. Garg believes giving users the ability to pay bills will create long-term stickiness.\n“Today, the goal for any Neo bank is to try to get more and more transactions on your app. With remittances, people used to use the app once or twice a month. Because of this new bill payment system. The new feature increases velocity on our platform and has our users visit the platform more frequently,” Garg mentioned.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nHe said Aspora has been testing this feature with a few thousand users for a several weeks now, and it has seen positive results. The startup noted that mobile recharges were a big use case that emerged out of this test. BBPS doesn’t support some categories, like mobile recharge or credit card payments for foreign payers. That is why Apsora has partnered with international mobile recharge company Ding to facilitate these transactions.\nThe feature is available for customers in the U.K., and the company plans to make it available to users in the U.S. and the United Arab Emirates (UAE) soon.\nIn June, Aspora raised $50 million in Series B funding at a $500 million valuation, led by Sequoia. Other investors Greylock, Hummingbird, Quantum Light Ventures, and Y Combinator also contributed to the round. The company has raised more than $99 million in funding to date. The startup opened up its services in July to NRIs in the U.S. market, which accounts for the top inward remittance market for India, with nearly 28% market share according to the country’s central bank.\nAspora has now reached 800,000 customers, who have done transactions of $4 billion and saved $25 million in transfer fees, according to the company. \nAspora aims to launch NRE (non-resident external) accounts to let users manage foreign income and NRO (non-resident ordinary) accounts to let users manage income earned in India next year.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Surveillance tech provider Protei was hacked, its data stolen, and its website defaced",
    "url": "https://techcrunch.com/2025/11/17/surveillance-tech-provider-protei-was-hacked-its-data-stolen-and-its-website-defaced/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/flashing-router-datacenter-wiretap.gif?w=150",
    "tag": "Tech",
    "date": "2025-11-17T13:09:47.000Z",
    "description": "The defacement of Protei's website said \"another DPI/SORM provider bites the dust,\" apparently referring to the company selling its web intercept and surveillance products to phone and internet providers.",
    "body": "\nA Russian telecom company that develops technology to allow phone and internet companies to conduct web surveillance and censorship was hacked, had its website defaced, and had data stolen from its servers, TechCrunch has learned.\nFounded in Russia, Protei makes telecommunications systems for phone and internet providers across dozens of countries, including Bahrain, Italy, Kazakhstan, Mexico, Pakistan and much of central Africa. The company, now headquartered in Jordan, sells video conferencing technology and internet connectivity solutions, as well as surveillance equipment and web-filtering products, such as deep packet inspection systems.\nIt’s not clear exactly when or how Protei was hacked, but a copy of the company’s website saved on the Internet Archive’s Wayback Machine shows it was defaced on November 8. The website was restored soon after.\nDuring the breach, the hacker obtained the contents of Protei’s web server — around 182 gigabytes of files — including emails dating back years.\nA copy of Protei’s data was provided to DDoSecrets, a nonprofit transparency collective that indexes leaked datasets in the public interest, including data from law enforcement, government agencies, and companies involved in the surveillance industry.\nImage Credits:TechCrunch (screenshot)\nMohammad Jalal, the managing director of Protei’s branch in Jordan, did not respond to a request for comment about the breach. \nThe identity of the hacker is not known, nor their motivations, but the defaced website read: “another DPI/SORM provider bites the dust.” The message likely references the company’s sales of deep packet inspection systems and other internet filtering technology for the Russian-developed lawful intercept system known as SORM.\nSORM is the main lawful intercept system used across Russia as well as several other countries that use Russian technology. Phone and internet providers install SORM equipment on their networks, which allows their country’s governments to obtain the contents of calls, text messages, and web browsing data of the networks’ customers. \nDeep-packet inspection devices allow telecom companies to identify and filter web traffic depending on its source, such as a social media website or a specific messaging app, and selectively block access. These systems are used for surveillance and censorship in regions where freedom of speech and expression are limited.\nThe Citizen Lab reported in 2023 that Iranian telecoms giant Ariantel had consulted with Protei about technology for logging internet traffic and blocking access to certain websites. Documents seen and published by The Citizen Lab show that Protei touted its technology’s ability to restrict or block access to websites for specific people or entire swathes of the population.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "PowerLattice attracts investment from ex-Intel CEO Pat Gelsinger for its power-saving chiplet",
    "url": "https://techcrunch.com/2025/11/17/powerlattice-attracts-investment-from-ex-intel-ceo-pat-gelsinger-for-its-power-saving-chiplet/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Chiplet-on-finger-for-scale.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T15:08:23.000Z",
    "description": "PowerLattice, a startup founded by veteran electrical engineers from Qualcomm, NUVIA, and Intel in 2023, claims to have developed a groundbreaking approach that reduces the power needs of computer chips by more than 50%.",
    "body": "\nIf you pay attention to what the biggest tech companies are saying about AI demand, you’ll notice a common thread: they’re running short of compute capacity. That means the large language models underpinning AI products today need even more data centers to be trained and for inferencing, and therefore, they need more power. Against that backdrop, energy efficiency has suddenly become a critical priority for semiconductor manufacturers. \nPowerLattice, a startup founded by veteran electrical engineers from Qualcomm, NUVIA, and Intel in 2023, claims to have developed a groundbreaking approach that reduces the power needs of computer chips by more than 50%. On Monday, the startup emerged from stealth with a $25 million Series A funding round led by Playground Global and Celesta Capital, bringing its total funding to $31 million.\n“This is the hard stuff: How do you get power into the device? There are very few teams and people that can do it,” said Pat Gelsinger, general partner at Playground Global. “We have assembled what I’d argue is the dream team of power delivery.”\nAs the former CEO of Intel, Gelsinger carries significant authority in the semiconductor world, which makes his participation a powerful stamp of approval for PowerLattice.\nIn fact, when the startup’s CEO Dr. Peng Zou and its founding team pitched their idea at Playground’s offices in March, they were so star-struck by Gelsinger’s fame that they asked him for a selfie, Gelsinger told TechCrunch. The admiration proved mutual, as Gelsinger came away genuinely impressed with PowerLattice’s technology.\nThe startup’s tech sounds simple in concept: a tiny power delivery chiplet that’s designed to bring power closer to the processor, significantly minimizing energy loss.\nTwo years in, PowerLattice has already achieved its first key milestone: Its first batch of chiplets is being produced by TSMC, in partnership with an unnamed manufacturer that is testing the startup’s functionality, Gelsinger said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBeyond its initial customer, the startup plans to make its product available for testing by other customers in the first half of 2026. The trials should prove instructive, given that PowerLattice’s potential customer set includes major chip manufacturers Nvidia, Broadcom, and AMD, as well as specialized AI chip developers, such as Cerberus, Grok, and Playground-backed startups d-Matrix and NextSilicon.\nAlthough every chip company has internal teams working on improving energy efficiency, Gelsinger hopes that PowerLattice’s innovative approach will pique their interest.\n“They may say, ‘I’m going to take some volume to this approach, some volume to my more traditional approach’,” he said. “But we think our ability to capture meaningful share will quickly emerge.”\nPowerLattice is not the only startup attempting to help chip manufacturers address the energy problem. The company would compete most closely with Empower Semiconductor, a startup that raised a $140 million Series D, led by Fidelity Management & Research Company, in September.\nHowever, Gelsinger is certain that PowerLattice’s 50% energy efficiency gain is an “extraordinary” result, and he expects the company to soon raise a much larger funding round to fund production.\n“The idea is bold, the benefits are large, and I expect others will be saying, ‘That’s a great idea. Let me try as well,’” Gelsinger said.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "As consumers ditch Google for ChatGPT, Peec AI raises $21M to help brands adapt",
    "url": "https://techcrunch.com/2025/11/17/as-consumers-ditch-google-for-chatgpt-peec-ai-raises-21m-to-help-brands-adapt/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/a5fadec4-271b-4ce6-bdd2-504484c36964.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-18T05:10:17.000Z",
    "description": "With consumers increasingly asking questions to ChatGPT, not Google, product discovery is changing — and the promise to give brands visibility and control over this fast-growing search channel has made Peec AI one of Europe's hottest startups.",
    "body": "\nWith consumers increasingly asking questions of ChatGPT — not Google — product discovery is changing. And the promise to give brands visibility and control over this fast-growing search channel has made Peec AI one of Europe’s hottest startups.\nJust four months after its Seed round led by 20VC, the Berlin-based startup has raised a $21 million Series A led by European VC firm Singular. CEO Marius Meiners declined to disclose the valuation, but said it had tripled and was now above $100 million. \nThis comes after Peec AI grew its annual recurring revenue to more than $4 million in only ten months since its launch, attracting 1,300 companies and agencies to its platform. \nThese customers use Peec AI to monitor how their brands appear in AI-powered searches. But beyond analytics on visibility and ranking, Peec AI also tracks sentiment — and which sources shape these answers. \nThese insights are what make Generative Engine Optimization (GEO) possible — a way for marketing teams to optimize their brand’s presence in AI search results, similar to how SEO works for traditional search engines. With this promise, the startup says it is now adding some 300 customers a month, and its new funding will accelerate this growth while also supporting expansion plans.\nThanks to its new round, which was also backed by Antler, Combination VC, identity.vc, and S20, the startup plans to hire some 40 people in the next six months. These roles are mostly based in Berlin, where Meiners met his two cofounders in Antler’s Winter 2024 cohort: Tobias Siwonia is now Peec AI’s CTO, and Daniel Drabo is its CRO.\nExpanding fast and being visible may be key to winning in an emerging category that could soon become crowded, with competitors already including New York-based Profound and Austrian startup OtterlyAI. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTo help attract more talent, the 20-person startup is currently advertising itself on large outdoor ads throughout Germany’s capital city. But beyond its Berlin plans, Meiners told TechCrunch that Peec AI also plans to open a sales-focused office in New York City in the second quarter of next year. \nAs more GEO-focused tools become available, and SEO dashboards add AI tracking capabilities, Peec AI hopes to differentiate itself by offering marketing teams a dashboard that expands in scope while remaining simple to use, despite the fast-changing nature of AI searches.\nInstead of revolving around keywords like SEO tools, Peec AI’s dashboard centers on prompts for which brands would like to show up well in search results. Customers can track up to 25 prompts for €75 per month ($87), increasing to 100 prompts for €169 per month ($196). Both plans offer free trials, unlike its enterprise offering, which starts from €424 per month ($493).\nTo make these insights actionable, the dashboard also suggests actions that can improve visibility and positive sentiment. For instance, its home page suggests that a company that wants to be the answer to a query on “the best CRMs for fast-growing companies” may want to “join r/CRM subreddit discussions” on Reddit.\nThis recommendation also relates to the “source insights” that are at the core of Peec AI and could guide the content strategy of its users. The startup observed that mentions in tier 1 media outlets don’t give more visibility than articles by lesser-known publications whose headlines are closer to the original question — for instance, on “the best healthcare investors in Berlin.” \nCompanies that already use its tools include Axel Springer, Chanel, n8n, ElevenLabs, TUI, and more, as AI searches gain ground across sectors, both for B2C and for B2B searches. However, users also turn to ChatGPT and the like for many other tasks and requests, which means that the startup has to cut through noise behind the scenes.\nTo achieve this, Peec AI bought raw datasets of these requests, but that’s just the beginning. “We have to filter all these out to really get the questions that people ask around brands or purchases and products and services,” Meiners said. \nFor all the simplicity on the outside, that proprietary data pipeline may be the key to Peec AI’s success. This also serves as a reminder that the AI value chain is not only about models and that the AI application layer and underlying data have become a prime territory for European startups, now including Peec AI.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google rolls out its AI ‘Flight Deals’ tool globally, adds new travel features in Search",
    "url": "https://techcrunch.com/2025/11/17/google-rolls-out-its-ai-flight-deals-tool-globally-adds-new-travel-features-in-search/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-2186206744.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T17:00:00.000Z",
    "description": "Google is rolling out new AI-powered features to book and plan travel in Search, the company announced on Monday. The tech giant is expanding availability for its AI-powered “Flight Deals” tool, adding the...",
    "body": "\nGoogle is rolling out new AI-powered features to book and plan travel in Search, the company announced on Monday. The tech giant is expanding availability for its AI-powered “Flight Deals” tool, adding the ability for users to organize travel plans with its “Canvas” tool in AI Mode, and launching agentic booking capabilities to more people.\nGoogle first launched Flight Deals back in August in the U.S., Canada, and India. Now, the company is expanding the AI-powered search tool within Google Flights globally to help people quickly find affordable destinations.\nTo get started, users need to describe where, when, and how they want to travel. Flight Deals will then use AI to display the best bargains available. \nFlight Deals is now rolling out to more than 200 countries and territories worldwide, including the U.K., France, Germany, Mexico, Brazil, Indonesia, Japan, and Korea. The tool is also getting support for more than 60 languages.\nImage Credits:Google\nAs for the new AI Mode features, Google says users can now use the built-in Canvas tool to create travel plans. Canvas, which first launched as a way to build study plans and organize information over multiple sessions in a side panel, can now help users plan their upcoming trips.\nUsers need to tell AI mode what type of trip they’re looking for and then select the “Create with Canvas” option. \n“Right away, you’ll get a plan in the Canvas side panel that brings together real-time Search data for flights and hotels, details from Google Maps like photos and reviews and relevant information from sites across the web,” Google explained in a blog post. “You’ll find suggestions that fit your criteria, like hotel comparisons based on pricing and amenities or ideas for restaurants and activities optimized by travel time from where you’re staying.”\nUsers can then ask follow-up questions and get help with tradeoffs, like choosing a hotel that’s closer to a brunch place you want to try but a bit farther from the hiking trails you want to explore.\nImage Credits:Google\nTravel planning with Canvas is available on desktop in the U.S. for users who are opted into the AI Mode experiment in Labs.\nAdditionally, Google announced that it’s bringing AI Mode’s agentic capabilities to more people. Earlier this year, Google announced that users who were opted into Labs could now get help with booking restaurant reservations, event tickets, and beauty and wellness appointments in AI Mode. Now, the company is making this capability available to all U.S. users. \nUsers can request dinner reservations based on multiple preferences, such as party size, date, time, location, and preferred cuisine. AI Mode will then search across different reservation platforms to find real-time availability for restaurants that match the inquiry. It then surfaces a curated list of options to choose from.\nIn the future, Google says it will make it possible to finish booking flights and hotels directly in AI Mode. Users will be able to describe what they’re looking for and then compare different flights or hotels and browse information like schedules, prices, room photos, amenities, and reviews. \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Roblox will require all users to perform age-checks to access chat from January",
    "url": "https://techcrunch.com/2025/11/18/roblox-will-require-all-users-to-perform-age-checks-to-access-chat-from-january/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/roblox-heading.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-18T12:00:00.000Z",
    "description": "Following a spate of lawsuits and investigations over its child safety systems, Roblox is going to implement mandatory facial verification for all users who want to access communication features, starting in...",
    "body": "\nFollowing a spate of lawsuits and investigations over its child safety systems, Roblox is going to implement mandatory facial verification for all users who want to access communication features, starting in January. The platform is also introducing age-based chat, meaning users can only communicate with others in a similar age group.\nStarting Tuesday, users can voluntarily verify their age to secure their access to communication features. In the first week of December, Roblox will begin enforcing the age-check requirement in select markets, including Australia, the Netherlands and New Zealand. From January, all users around the world will be required to verify their age to access chat features.\nThe move comes amid multiple lawsuits, including from the attorneys general of Texas and Louisiana, against Roblox over child safety concerns. The lawsuits were filed following reports that Roblox was exposing young users to dangerous risks, such as grooming and explicit content.\nFor the age-check process, users would have to open their camera app and follow a series of on-screen instructions for facial verification. Once the age-check is processed, Roblox says it will delete any images or videos of users. The verification is being processed through a third-party vendor, Persona, which would also delete images and videos after completing the process, Roblox says.\nOnce the age-check is complete, users will be informed which age group they have been assigned to. There are six age groups: under 9, 9 to 12, 13 to 15, 16 to 17, 18 to 20, and 21 plus. \nImage Credits:Roblox\nUsers will be able to chat with others in their own age group and similar age groups as appropriate, Roblox explained during a briefing with reporters on Monday. \nFor example, if someone has an estimated age of 12, they will be assigned to the 9 to 12 age group. They will then be able to chat with users aged 15 and younger. All users aged 16 or older will be prevented from chatting with this user.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We see these changes as a way to help ensure users are able to socialize with others in age groups that are appropriate, but also help limit contact between minors and adults that they do not know,” said Raj Bhatia, Roblox’s VP and head of user and discovery product, during the briefing.\nThe company says the new age-check requirement will provide a more accurate way to verify users’ ages, compared with simply having users enter their birth year when creating an account.\n“We believe that this is something that is first for a company like Roblox in the gaming space and social media and messaging to require explicit age estimation before anybody has access to communication,” said Matt Kaufman, Roblox’s chief safety officer, during the briefing.\nRoblox also said it’s launching a new Safety Center that will provide parents and caregivers with guidance and tools, and let them set up Parental Controls.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]