[
  {
    "title": "Etsy names former head of Depop, Kruti Patel Goyal, as its new CEO",
    "url": "https://techcrunch.com/2025/10/29/etsy-names-former-head-of-depop-kruti-patel-goyal-as-its-new-ceo/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/07/gettyimages-526663110.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T15:04:17.000Z",
    "description": "In Brief Posted: 8:04 AM PDT · October 29, 2025  Image Credits:Richard Levine/Corbis / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Online marketplace Etsy said on Wednesday that its long-time CEO,...",
    "body": "\nIn Brief\nPosted:\n8:04 AM PDT · October 29, 2025\n\nImage Credits:Richard Levine/Corbis / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOnline marketplace Etsy said on Wednesday that its long-time CEO, Josh Silverman, would step down by the end of the year.\nKruti Patel Goyal, Etsy’s president and chief growth officer, will become the company’s next CEO. Silverman, who headed the marketplace for eight years, will become its executive chairman.\nGoyal worked at Etsy for more than 10 years until she was named the CEO of social-commerce platform Depop, which Etsy bought four years ago. She has been in her current role for about seven months.\nEtsy has faced challenges in growing its business and may be looking to Goyal’s experience leading Depop to help revive growth. In its third quarter ended September 30, the number of active buyers on Etsy fell 5% to 86.6 million from a year earlier. The company experienced a user boycott in July after allowing the sale of merchandise branded with “Alligator Alcatraz” on its site.\nSellers on Etsy declined by 10.9% to 5.5 million in the third quarter, compared to a year earlier. Gross merchandise sales (GMS) for the quarter dropped 2.4% to $2.4 billion.\nIn contrast, Depop performed well, with the number of active sellers rising 40% to 3 million and active buyers increasing 38% to 6.6 million. Depop’s GMS jumped 39.4% to $292.1 million.\nFollowing the news, Etsy’s shares were down nearly 9%.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Commerce\n"
  },
  {
    "title": "LG Uplus is latest South Korean telco to confirm cybersecurity incident",
    "url": "https://techcrunch.com/2025/10/28/lg-uplus-is-latest-south-korean-telco-to-confirm-cybersecurity-incident/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/lg-uplus-breach-2204244148.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T03:55:08.000Z",
    "description": "Image Credits:Ramon Costa / SOPA Images / LightRocket / Getty Images\t \t \t\t\t\t\t\t8:55 PM PDT · October 28, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t LG Uplus, one of the largest telecom operators in South Korea, has confirmed to...",
    "body": "\n\t\n\t\tImage Credits:Ramon Costa / SOPA Images / LightRocket / Getty Images\t\n\t\n\t\t\t\t\t\t8:55 PM PDT · October 28, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nLG Uplus, one of the largest telecom operators in South Korea, has confirmed to TechCrunch that it has reported a suspected data breach to Korea’s national cybersecurity watchdog KISA, but did not say when the results of its investigation would be available.\nAll three major South Korean telecom providers, SK Telecom, KT Telecom, and now LG Uplus, have reported cybersecurity incidents over the past six months, pending confirmation from the Korean government.\nSouth Korea’s Ministry of Science and ICT told TechCrunch that its investigation into KT and LG Uplus, launched last month, is still ongoing, amid a report that the companies may have faced cyberattacks similar to the recent breach at SK Telecom.\nBack in July, KISA also reportedly spotted signs of a possible hack and asked LG Uplus to file a formal report. In August, LG’s telecom division initially denied any signs of a breach, even as KT reported that data from users had been exposed following the connection of unauthorized micro base stations to its network. KISA declined to comment.\nThe move comes about two months after the hacking magazine Phrack claimed that hackers from China or North Korea had stolen data from close to 9,000 LG Uplus servers.\nLG Uplus’s report comes amid a wave of high-profile hacks in South Korea affecting telecoms, credit card companies, tech startups, and government agencies, highlighting vulnerabilities previously reported by TechCrunch. \nSouth Korea’s fragmented cybersecurity system and a shortage of experts have hindered the country’s response to the cyber threats.\n\n\t\t\t\n\tTopics\n\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "YouTube looks to improve its TV app with QR codes for shopping, AI-powered upscaling",
    "url": "https://techcrunch.com/2025/10/29/youtubes-latest-updates-are-aimed-at-improving-the-tv-experience/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/11/GettyImages-1311780018.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T13:00:00.000Z",
    "description": "YouTube on Wednesday showed off several new updates aimed at improving its TV user interface.  Key updates include the introduction of QR codes that let you identify and shop for items in tagged videos,...",
    "body": "\nYouTube on Wednesday showed off several new updates aimed at improving its TV user interface. \nKey updates include the introduction of QR codes that let you identify and shop for items in tagged videos, AI-powered upscaling, and improved search.\nThe updates come as the platform focuses on solidifying its position in the living room. YouTube accounted for 12.4% of the total audience time spent watching television, beating media platforms like Disney, Paramount and Netflix, per a report by Nielsen in April. \nImage Credits:YouTube\nAugmenting its shopping offerings, YouTube is now supporting QR codes in videos where creators can link specific products to their content, enabling viewers to scan the codes with their phones to quickly access product pages. \nThis feature aims to boost revenue, particularly for shopping-related content, which has seen significant viewership — 35 billion hours in the last year alone, according to the company. Additionally, the number of channels earning six figures or more in revenue from TV screens has increased by over 45% in the past year.\nWhile shoppable QR codes are not a new concept—Roku, Peacock, and others have implemented them—YouTube says its functionality aims to help content creators sell their merchandise more effectively by linking directly to their online stores.\nThe platform is also starting to test the ability to showcase products at specific, timed moments within videos.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:YouTube\nOther updates focus on improving the overall TV-watching experience. For instance, YouTube is expanding the thumbnail file limit from 2MB to 50MB to support 4K-resolution thumbnails, and it’s also experimenting with larger video uploads with select creators to enable higher-quality videos. \nAn AI-powered feature is being introduced to automatically convert videos uploaded at lower resolutions to full HD, and the company plans to add support for upscaling to 4K resolution in the future. YouTube notes that creators will maintain control over their content and preserve original files, and viewers can still choose to watch in the original resolution.\nThis aims to bring YouTube’s TV viewing experience in line with competitors, but the effectiveness of the technology remains to be seen. Netflix was accused of using AI to upscale older shows, like “A Different World,” but ran into problems that led to distorted faces and generally unsatisfactory results.\nImage Credits:YouTube\nOther new features include immersive previews to help viewers flip through videos, and better content discovery with contextual search — when viewers initiate a search directly from a creator’s channel page, the platform prioritizes videos from that channel at the top of search results instead of showing results from across YouTube. \n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Nvidia becomes first public company worth $5 trillion",
    "url": "https://techcrunch.com/2025/10/29/nvidia-becomes-first-public-company-worth-5-trillion/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T15:52:53.000Z",
    "description": "Image Credits:Li Hongbo/VCG / Getty Images\t \t \t\t\t\t\t\t8:52 AM PDT · October 29, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t The biggest beneficiary of the ongoing AI boom, Nvidia has become the first public company to pass the $5...",
    "body": "\n\t\n\t\tImage Credits:Li Hongbo/VCG / Getty Images\t\n\t\n\t\t\t\t\t\t8:52 AM PDT · October 29, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe biggest beneficiary of the ongoing AI boom, Nvidia has become the first public company to pass the $5 trillion market cap milestone.\nThe company’s shares rose more than 5.6% on Wednesday to as much as $212.19, on the back of news on Wednesday that U.S. President Donald Trump said he expects to discuss the company’s Blackwell chips with Chinese President Xi Jinping on Thursday. \nInvestors are also likely stoked by Nvidia CEO Jensen Huang’s comments on Tuesday that the company expects $500 billion in AI chip sales, and that it is building seven new supercomputers for the U.S. in areas like security, energy, and science that will require thousands of Nvidia GPUs. The company on Tuesday also said it had invested $1 billion in Nokia and would use some of its products to “enable communication service providers to launch AI-native 5G-Advanced and 6G networks on NVIDIA platforms.”\nThe milestone comes just three months after Nvidia became the first company to cross the $4 trillion milestone. Its stock has surged more than 50% so far this year, buoyed by seemingly insatiable demand for its graphics processing units (GPU), which are being used widely in data centers for training large language models, inference and more. Nvidia’s GPUs are valuable because they’re scarce — and by trading them directly into an ever-inflating data center scheme, Nvidia is making sure they stay that way.\nMore generally, tech stocks have surged this year on optimism that AI tech stands to revolutionize industries across the world, similar to how the advent of the internet changed business. Over the past year, investors have been encouraged by a spree of multi-billion-dollar deals — several of which had Nvidia at the center — to spur the development of data centers and infrastructure to build the compute capacity for resource-intensive AI models. In September, Nvidia announced that it would invest up to $100 billion in OpenAI, another beneficiary of the AI boom, in the coming years. Both companies said at the time that they intend to deploy 10GW worth of Nvidia systems to power OpenAI’s systems.  \nWith a market cap of $5 trillion, Nvidia is now worth more than the aggregated stock markets of all countries, apart from the United States, China and Japan.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "‘Silicon Valley’ star Thomas Middleditch makes a surprise appearance at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/28/silicon-valley-star-thomas-middleditch-makes-a-surprise-appearance-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2017/04/kumail-nanjiani-thomas-middleditch-martin-starr-zach-woods-photo-cred-john-p-johnson-for-hbo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T00:00:18.000Z",
    "description": "Image Credits:Courtesy of Silicon Valley/HBO\t \t \t\t\t\t\t\t5:00 PM PDT · October 28, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t If you were wandering the Expo Hall at TechCrunch Disrupt 2025, or watching our pitch stage earlier...",
    "body": "\n\t\n\t\tImage Credits:Courtesy of Silicon Valley/HBO\t\n\t\n\t\t\t\t\t\t5:00 PM PDT · October 28, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nIf you were wandering the Expo Hall at TechCrunch Disrupt 2025, or watching our pitch stage earlier Tuesday, you might have noticed a familiar face from Pied Piper. Thomas Middleditch, who starred in HBO’s popular “Silicon Valley” show that prominently featured Disrupt back in 2014, had a planned takeover of Australian startup (and Battlefield 200 competitor) Othelia’s presentation at the pitch showcase stage. \n\n\n\nYou can take a look at his full rundown below, including the actual pitch for Othelia’s mission to build a Cursor-like platform for storytellers.\n\n\n\nMiddleditch, amid being pitched, photographed, and mildly swarmed at the Expo hall, also took some time to chat with us about his POV on the conference, AI, and how he uses AI platforms for his own Improv With Robots YouTube channel.\n\n\n\t\t\t\n\tTopics\n\n\n\n\t\tMorgan Little is TechCrunch’s Director of Audience Development, having joined the team in 2023. He helps steer the site’s efforts across social media, SEO, newsletters and external partners, and is based in San Francisco.\r\nIn prior roles, Morgan led the audience teams for sites like CNET and GameSpot, juggled social media and political reporting for the Los Angeles Times and had a stint at marketing agencies that has given him a fear of timesheets. \nHe’s worked within the space long enough to have professionally run a Tumblr account, and still has Peach downloaded on his phone.\nYou can contact or verify outreach from Morgan by emailing morgan.little@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Phia’s founders on how AI is changing online shopping",
    "url": "https://techcrunch.com/2025/10/29/phias-founders-on-how-ai-is-changing-online-shopping/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2243869768.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T12:43:50.000Z",
    "description": "When Phia‘s founders Phoebe Gates and Sophia Kianni decided to build an AI startup, they targeted an area they understood well: online shopping. The founders, who met at Stanford when they were randomly...",
    "body": "\nWhen Phia‘s founders Phoebe Gates and Sophia Kianni decided to build an AI startup, they targeted an area they understood well: online shopping.\nThe founders, who met at Stanford when they were randomly paired up as roommates, understood e-commerce because they had spent hours upon hours trying to find the right items to expand their wardrobe. And AI, they realized, had the potential to help people discover, shop and buy in new ways. They also realized that capability was a market opportunity.\n“There felt like there was this giant white space for, like, what should we actually buy, and why doesn’t everyone have a personal shopper in their pocket?” said Gates on stage at TechCrunch Disrupt 2025 on Tuesday.\nThe startup emerged from a class project where it proved its initial demand. But the service didn’t launch to the public until Phia found the right product-market fit, Kianni says.\nThe tool, available as a browser extension and app, lets shoppers compare prices, including for second-hand items, adding a sustainability factor to the shopping experience.\nPhia says it integrates with more than 150 second-hand platforms, and has over 350 million items in its in-house search database. Kianni pointed out that buying second-hand represents an 80% reduction in carbon footprint, compared with buying new. Plus, it’s cheaper.\nSophia Kianni, Co-Founder of Phia. Image Credits: Kimberly White/Getty Images for TechCrunchImage Credits:Getty Images for TechCrunch / Getty Images\nKianni said the service also helps users understand the value of what they’re buying. “If you’re looking at a $500 handbag on Phia, you can quickly understand, can you resell that item for $300 or $400? Or, on the contrary, if it’s a fast-fashion piece and you’re buying it for $100 bucks, is it only reselling for $10? Does it immediately depreciate and lose 90% of its value?”\nThe startup is also developing an AI shopping advisor that will help users understand value factors like a good deal, or what an item’s retained value may be, as well as fashion basics like whether the item will fit based on the user’s previous orders and returns. The founders said the sizing insights feature is currently in beta with a small group of users.\nThe founders have used a variety of tactics to attract an audience, including an ambassador program, making their own content about the product’s development, and even starting a podcast. \n“The ability to acquire hundreds of thousands of downloads at a very low cost through the podcast and the various different distribution vehicles has been really important,” said Kianni.\nPlus, Gates said, sharing the realities of building a startup with their audience helped Phia’s potential users connect with the founders and their story.\n“I think there was a bit of an ego death that we had to go through,” Gates said. “At first, it’s like, ‘I want to look good in all of our content.’ But if you want people to engage with it, and you want to make content at the volume that we need to, you need to be able to just pull back the curtain.”\nGates, whose dad is yes, that Gates, acknowledges that she’s come to the startup experience from a position of privilege, but says they don’t necessarily go to him for advice.\n“So, while my dad — I think he’s a genius — he’s not the one shopping on Phia, right? Like, he’s not hunting for the best deal across different sites. He’s not comparing his wish list items for his spring break trip,” she said. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Uber to launch a premium robotaxi service in Waymo’s turf of San Francisco",
    "url": "https://techcrunch.com/2025/10/29/uber-to-launch-a-premium-robotaxi-service-in-waymos-turf-of-san-francisco/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/uber-lucid.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T12:00:00.000Z",
    "description": "Uber has picked San Francisco to launch a premium robotaxi service that will use Lucid Motors’ all-electric Gravity SUVs equipped with self-driving tech developed by Nuro, in 2026 — a move that puts the...",
    "body": "\nUber has picked San Francisco to launch a premium robotaxi service that will use Lucid Motors’ all-electric Gravity SUVs equipped with self-driving tech developed by Nuro, in 2026 — a move that puts the ride-hailing giant in direct competition with Waymo.\nThe announcement was made as the last day of TechCrunch Disrupt 2025 kicked off in San Francisco. Nuro president and co-CEO Dave Ferguson, and Uber chief product officer Sachin Kansal are scheduled to be interviewed on the Disrupt stage Wednesday afternoon.\n“The Bay Area has long been the birthplace of transformative technology, and it’s only fitting that Uber’s next-generation robotaxi program with Lucid and Nuro will begin here — launching to the public next year,” Kansal said in a statement. “By combining deep expertise in electric vehicles, autonomy, and ridehailing, we’re laying the groundwork for safe and scalable autonomous rides in the Bay Area and beyond.”\nEarlier this year, Uber said it would invest $300 million in Lucid and separately buy “at least” 20,000 of its new Gravity SUVs over the next six years as part of a plan to develop and launch a premium robotaxi service. Those EVs would be equipped with Nuro’s autonomous vehicle system, and owned and operated by Uber or its third-party fleet partners. At the time, the three companies had not identified their launch market.\nThe decision to launch in San Francisco could add tension to Uber’s relationship with Waymo. The companies had squared off in 2018 in a trade secrets theft case, but have since patched up — earlier this year, they launched a robotaxi service in Austin and Atlanta. In 2023, the companies partnered to make Waymos available on the Uber app in Phoenix. \nNow, Uber is entering a domain dominated by the Alphabet-owned self-driving division. Waymo, based in Mountain View, California, operates commercial robotaxi services in the San Francisco Bay Area, as well as Atlanta, Austin, Los Angeles, and Phoenix. The company has said it plans to launch in six more cities in 2026.\nUber, Nuro and Lucid are already developing a fleet of test vehicles. Lucid recently delivered vehicles to Nuro, which is integrating its self-driving system into the fleet for testing and validation. The test fleet is expected to reach about 100 vehicles, according to the companies.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nTesting on public roads will be the most visible sign of the partnership, but Nuro also plans to use simulation and closed courses for testing.\nOver the past two years, Uber has locked in a bevy of partnerships with autonomous vehicle technology companies, covering the spectrum of how self-driving systems can be applied to the physical world — although its deals with Waymo, Nuro and Lucid might be the meatiest. The ride-hailing giant has partnered with more than 18 companies globally, across ride-hailing, delivery and trucking. This year alone, it announced deals with Ann Arbor, Michigan-based May Mobility and Volkswagen, as well as Chinese self-driving firms Momenta, WeRide and Baidu.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "MoviePass opens fantasy league game Mogul to the public",
    "url": "https://techcrunch.com/2025/10/29/moviepass-opens-fantasy-league-game-mogul-to-the-public/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Mogul-Mock.png?w=150",
    "tag": "Tech",
    "date": "2025-10-29T12:00:00.000Z",
    "description": "Mogul, the film studio fantasy platform created by the movie theater subscription service MoviePass, on Wednesday launched out of private beta, the company announced. The platform is now available as a public...",
    "body": "\nMogul, the film studio fantasy platform created by the movie theater subscription service MoviePass, on Wednesday launched out of private beta, the company announced. The platform is now available as a public beta for everyone.\nDesigned specifically for the Hollywood industry, players own their own film studio and draft a team of actors, directors, and movies to earn points based on their performance. Mogul draws inspiration from daily fantasy sports, where players assume the role of team managers, forming teams made up of real-life athletes.\nToday, the web version of Mogul is open for the over 400,000 users on the waiting list. The platform has also begun rolling out to the public.\nAround 5,000 users, including myself, have tested the platform. Although I’ve only experienced the pre-season phase, which lacks active gameplay and a leaderboard, I still have a general idea of the mechanics. Overall, it was relatively straightforward to figure out, which I was surprised about, given my limited knowledge of fantasy sports.\nHere’s how to play\nAfter you create a name for your studio, you’ll receive a budget of one million “Mogul Coin,” the platform’s virtual currency (since you’re not playing with real money). This initial budget is yours to use to assemble your team. \nFor example, the sequel “Wicked: For Good” is $100,000, and the actresses Cynthia Erivo (playing Elphaba) and Ariana Grande (as Glinda) are $25,000 each. Director Jon M. Chu is also $25,000. \nYou have a week to finalize your choices, and you can make two free swaps each week. \nImage Credits:MoviePass\nMoviePass founder Stacy Spikes told TechCrunch that the company tried to develop a game that emulates a real film studio and “how you have to act like a mogul.” \nSo, when conducting these swaps, you need to be strategic just like a studio head would. For instance, “Tron: Ares” star Jared Leto is currently facing sexual misconduct allegations, and this may affect the movie’s performance. \nSpikes gave us some additional tips during our discussion. For example, it’s important to keep an eye out for up-and-coming stars, as sometimes they’re the ones who’ll really take off. Also, consider looking at Bollywood films as they can be overlooked by people who think only about big franchises, like Marvel. Independent films can also bring in significant returns.\nAnother key point to remember is that you’re competing based on net profitability rather than total gross revenue. Timing is also critical; betting on a movie earlier typically costs less, whereas choosing one closer to its release date might be more expensive. \nImage Credits:MoviePass\nMogul operates on Sui, a layer 1 blockchain, which records every selection and trade. As users climb the leaderboard, they can earn digital collectibles, such as signed posters and memorabilia. \nCurrently, everyone will participate in a global league. The fall season will last 12 weeks, spanning October, November, and December, coinciding with awards season. For this first season, users have a chance to share in a prize pool worth up to $100,000 in tokens, aimed at encouraging more people to sign up.\nMoviePass is also granting exclusive in-app badges and Founding Member status to users who activate their accounts by 11:59 p.m. ET on October 31.\nPlans for private leagues among friends are in development, along with an app for iOS and Android devices. By next year, Spikes claims a licensing deal may be established, enabling you to compete for real money.\n"
  },
  {
    "title": "Waabi unveils autonomous truck made in partnership with Volvo",
    "url": "https://techcrunch.com/2025/10/28/waabi-unveils-autonomous-truck-made-in-partnership-with-volvo/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/waabi-volvo.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-28T22:17:45.000Z",
    "description": "The move comes as Waabi announced earlier this year that it was partnering with Volvo Autonomous Solutions to build a custom purpose truck based on Volvo’s auto autonomy platform using Waabi's software stack.",
    "body": "\nSelf-driving truck startup Waabi shared Tuesday at TechCrunch Disrupt 2025 the launch of a new autonomous truck made in partnership with Volvo, the Volvo VNL Autonomous truck.\nThe unveiling comes eight months since the Uber- and Nvidia-backed startup announced it was partnering with Volvo Autonomous Solutions to build a custom truck based on Volvo’s autonomy platform using Waabi’s software stack.\nWaabi CEO Raquel Urtasun said on TechCrunch Disrupt’s AI stage the company has the potential to be the first to commercialize self-driving trucks without a human safety driver or observer. The comment was a slight dig at Aurora, a competitor that launched a commercial driverless service earlier this year. The company later added a human observer in the truck cab several weeks later. \n“We can drive in generalized surface streets across right now in Texas, and you will be able to see us across the entire U.S. over the next few years as well,” said Urtasun, who previously served as chief scientist at Uber ATG before launching Waabi in 2021.\nWaabi rival Aurora has a similar deal with Volvo, and the two companies unveiled a self-driving truck in May 2024. Aurora launched a commercial service, which has a human observer on board, earlier this year on a route between Dallas and Houston. On Tuesday, it announced it was expanding to El Paso. Waabi is using the same truck, but it features Waabi’s tech, including its sensor suite, compute, and the Waabi Driver software. \nWaabi’s self-driving system called the Waabi Driver is an end-to-end AI model that enables the truck to scale autonomous driving across different geographies, including highways and general surface streets. Waabi says this enables commercial operations that are scalable, meet the needs of customers, and work within existing logistics operations.  \n“Volvo VNL has been built from the ground up for the redundancies so that you can remove the human driver and you can build a global, safe, robust product,” Urtasun said. “Our sensor pods are super lightweight; it’s very easy to integrate at the factory line.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nWaabi’s partnership with Volvo builds on the automaker’s investment into the startup in 2023 via its venture arm, Volvo Group Venture Capital. Volvo participated in Waabi’s $200 million Series B in 2024.   \nClarification: Aurora did not initially launch its commercial service with a human observer in the cab. \n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t"
  },
  {
    "title": "US signs collaboration agreements with Japan and South Korea for AI, chips and biotech",
    "url": "https://techcrunch.com/2025/10/29/us-signs-collaboration-agreements-with-japan-and-south-korea-for-ai-chips-and-biotech/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/03/us-japan-south-korea-flags.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T13:50:02.000Z",
    "description": "The U.S. inked Technology Prosperity Deals (TPD) with Japan and South Korea with an eye towards spurring collaboration on AI, semiconductors, quantum computing, biotech, space, 6G and other technologies.",
    "body": "\nU.S. President Donald Trump touched down in Asia this week, not just for diplomacy, but to sign deals that could shape the next chapter of the global technology race. The U.S. inked Technology Prosperity Deals (TPD) with Japan and South Korea with an eye towards spurring collaboration on AI, semiconductors, quantum computing, biotech, space, 6G and other technologies.\nThe agreements aim to enhance cooperation, strengthen strategic ties, align regulations, and support economic and national security objectives, among other objectives. The new agreements follow roughly a month after the U.S. strengthened tech ties with the U.K.\nThe U.S. is effectively locking in partnerships to tap Japan and Korea’s expertise — Japan leads in advanced materials, robotics and space technologies, while South Korea dominates memory chip production.\nThe U.S.-Japan agreement aims to boost AI exports, enhance technology protections, and refocus collaboration on AI standards and innovation, per the White House. Meanwhile, the U.S. and Korea will collaborate to ease “operational burdens” for tech companies, focusing on removing obstacles to “innovative data localization and hosting architectures.”\nJapan and the U.S. plan to “advance pro-innovation AI policy frameworks and initiatives to support a U.S.- and Japan-led AI ecosystem and promote exports across the full stack of U.S. and Japanese AI infrastructure, hardware, models, software, applications, and related standards,” according to a White House press release on October 28.\n“The U.S.-Korea TPD will advance American interests with coordinated U.S.-Republic of Korea AI exports, strengthening both countries’ export controls and enforcement, and refocusing the partnership between the U.S. Center for AI Standards and Innovation, and the Korea AI Safety Institute on metrology and standards innovation,” the White House said on Wednesday.\nThe deals also address a broader goal: reducing dependence on China’s tech supply chain, and shaping the rules for technologies like AI and quantum computing. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nFor the tech industry, these deals are a signal to watch these allied markets closely, as collaboration could create new opportunities for both startups and major tech companies. With the U.S., Japan, and South Korea aligning their tech strategies, future breakthroughs in AI, semiconductors, quantum computing, space, and 6G may come not just from individual labs, but from strategic partnerships aimed at staying ahead in the global tech race.\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Character AI is ending its chatbot experience for kids",
    "url": "https://techcrunch.com/2025/10/29/character-ai-is-killing-the-chatbot-experience-for-minors/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/U18-Product-Image.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T13:00:00.000Z",
    "description": "After facing lawsuits and public outcry following the suicides of two teenagers, Character.AI says it's making changes to its platform to protect children, changes that could affect the startup’s bottom line.",
    "body": "\nTeenagers are trying to figure out where they fit in a world changing faster than any generation before them. They’re bursting with emotions, hyper-stimulated, and chronically online. And now, AI companies have given them chatbots designed to never stop talking. The results have been catastrophic.\nOne company that understands this fallout is Character.AI, an AI role-playing startup that’s facing lawsuits and public outcry after at least two teenagers died by suicide following prolonged conversations with AI chatbots on its platform. Now, Character.AI is making changes to its platform to protect teenagers and kids, changes that could affect the startup’s bottom line. \n“The first thing that we’ve decided as Character.AI is that we will remove the ability for under 18 users to engage in any open-ended chats with AI on our platform,” Karandeep Anand, CEO of Character.AI, told TechCrunch.  \nOpen-ended conversation refers to the unconstrained back-and-forth that happens when users give a chatbot a prompt and it responds with follow-up questions that experts say are designed to keep users engaged. Anand argues this type of interaction — where the AI acts as a conversational partner or friend rather than a creative tool — isn’t just risky for kids, but misaligns with the company’s vision.\nThe startup is attempting to pivot from “AI companion” to “role-playing platform.” Instead of chatting with an AI friend, teens will use prompts to collaboratively build stories or generate visuals. In other words, the goal is to shift engagement from conversation to creation. \nCharacter.AI will phase out teen chatbot access by November 25, starting with a two-hour daily limit that shrinks progressively until it hits zero. To ensure this ban remains with under 18 users, the platform will deploy an in-house age verification tool that analyzes user behavior, as well as third-party tools like Persona. If those tools fail, Character.AI will use facial recognition and ID checks to verify ages, Anand said. \nThe move follows other teenager protections that Character.AI has implemented, including introducing a parental insights tool, filtered characters, limited romantic conversations, and time spent notifications. Anand has told TechCrunch that those changes lost the company much of their under-18 user base, and he expects these new changes to be equally unpopular.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“It’s safe to assume that a lot of our teen users probably will be disappointed… so we do expect some churn to happen further,” Anand said. “It’s hard to speculate — will all of them fully churn or will some of them move to these new experiences we’ve been building for the last almost seven months now?” \nAs part of Character.AI’s push to transform the platform from a chat-centric app into a “full-fledged content-driven social platform,” the startup recently launched several new entertainment-focused features. \nIn June, Character.AI rolled out AvatarFX, a video generation model that transforms images into animated videos; Scenes, an interactive, pre-populated storylines where users can step into narratives with their favorite characters; and Streams, a feature that allows dynamic interactions between any two characters. In August, Character.AI launched Community Feed, a social feed where users can share their characters, scenes, videos, and other content they make on the platform.  \nIn a statement addressed to users under 18, Character.AI apologized for the changes. \n“We know that most of you use Character.AI to supercharge your creativity in ways that stay within the bounds of our content rules,” the statement reads. “We do not take this step of removing open-ended Character chat lightly — but we do think that it’s the right thing to do given the questions that have been raised about how teens do, and should, interact with this new technology.” \n“We’re not shutting down the app for under 18s,” Anand said. “We are only shutting down open-ended chats for under 18s because we hope that under 18 users migrate to these other experiences, and that those experiences get better over time. So doubling down on AI gaming, AI short videos, AI storytelling in general. That’s the big bet we’re making to bring back under 18s if they do churn.” \nAnand acknowledged that some teens might flock to other AI platforms, like OpenAI, that allow them to have open-ended conversations with chatbots. OpenAI has also come under fire recently after a teenager took his own life following long conversations with ChatGPT.  \n“I really hope us leading the way sets a standard in the industry that for under 18s, open-ended chats are probably not the path or the product to offer,” Anand said. “For us, I think the tradeoffs are the right ones to make. I have a six-year-old, and I want to make sure she grows up in a very safe environment with AI in a responsible way.” \nCharacter.AI is making these decisions before regulators force its hand. On Tuesday, Sens. Josh Hawley (R-MO) and Richard Blumenthal (D-CT) said they would introduce legislation to ban AI chatbot companions from being available to minors, following complaints from parents who said the products pushed their children into sexual conversations, self-harm, and suicide. Earlier this month, California became the first state to regulate AI companion chatbots by holding companies accountable if their chatbots fail to meet the law’s safety standards.  \nIn addition to those changes on the platform, Character.AI said it would establish and fund the AI Safety Lab, an independent non-profit dedicated to innovating safety alignment for the future AI entertainment features.  \n“A lot of work is happening in the industry on coding and development and other use cases,” Anand said. “We don’t think there’s enough work yet happening on the agentic AI powering entertainment, and safety will be very critical to that.” \n"
  },
  {
    "title": "Mappa’s AI voice analysis helps you find the best job candidates and will show off its tech at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/28/mappas-ai-voice-analysis-helps-you-find-the-best-job-candidates-and-will-show-off-its-tech-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/07/shutterstock_2232451751.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-28T22:15:00.000Z",
    "description": "Even after reviewing résumés, cover letters, and interviews, choosing the right candidate for a job can be a mysterious process. Hiring managers often rely on their biases about the world or gut feelings to...",
    "body": "\nEven after reviewing résumés, cover letters, and interviews, choosing the right candidate for a job can be a mysterious process. Hiring managers often rely on their biases about the world or gut feelings to inform their decision, making the process far from an exact science.\nThat’s why Sarah Lucena built Mappa, an AI-powered behavioral intelligence platform that aims to take some of the guesswork out of hiring. Mappa trained an AI model to detect voice patterns that correlate with certain traits, such as communication style, empathy, and confidence. Applicants simply answer some questions from Mappa’s AI agent, and then the platform sends hiring managers a shortlist of candidates with traits that are compatible with the role.\nMappa is a Startup Battlefield Top 20 finalist at TechCrunch Disrupt 2025 in San Francisco.\n“Mappa comes to the market with the goal of really, truly understanding people,” Lucena said in an interview with TechCrunch. “We don’t really categorize traits as good or bad. We understand traits as compatible or not.”\nLucena founded Mappa in 2023 with her two co-founders, Pablo Bérgolo and Daniel Moretti, and has raised $3.4 million in a seed round led by Tim Draper’s investment firm, Draper Associates. In less than three years, the startup has scaled to more than 130 customers in the U.S. and more than $4 million in annualized recurring revenue.\nMappa claims one of its biggest advantages is data. The startup built highly curated datasets specifically for understanding human behavior. Mappa originally attempted to assess candidates based on video submissions and their online presence; however, they’ve found voice analysis to be the most effective method.\nMappa’s platform has already helped companies find employees who stick around longer, according to Lucena. While the standard annual turnover rate for companies is around 30%, she says employees hired through Mappa have a turnover rate of just 2%.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nLucena says Mappa’s focus is always helping companies find the best people, but that often results in a more equitable hiring process. Mappa has facilitated over 3,000 hires to date, and more than 60% of them were women, LGBTQ+, or immigrants. Lucena, who was born and raised in Brazil, says she’s proud to have created more opportunities for these people.\nMoving forward, Lucena says she sees Mappa evolving from a services company into an infrastructure provider. The startup’s API has seen traction among companies who want to use its behavioral analysis in situations beyond hiring. Tim Draper personally uses Mappa to assess founders his firm is considering investing in, and the educational platform Re-Skilling.ai uses the platform to understand skills that students can improve on.\nIn the future, Lucena sees that Mappa could be used to help approve candidates for loans who don’t have an extensive credit history. She sees Mappa as a tool to help assess people more fairly in all kinds of settings.\nIf you want to hear from Mappa firsthand, and see dozens of additional pitches, attend valuable workshops, and make the connections that drive business results, head here to learn more about this year’s Disrupt, held October 27 to 29 in San Francisco. \n\n\n\n\t\tMaxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene.\r\nYou can contact or verify outreach from Maxwell by emailing maxwell.zeff@techcrunch.com or via encrypted message at mzeff.88 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Grammarly rebrands to ‘Superhuman,’ launches a new AI assistant",
    "url": "https://techcrunch.com/2025/10/29/grammarly-rebrands-to-superhuman-launches-a-new-ai-assistant/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Static_Google-Calendar-Agent.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-29T13:00:00.000Z",
    "description": "Typically, when a company acquires another, it will absorb the new company’s branding or integrate it with its own identity. Grammarly is doing something different: After acquiring email client Superhuman in...",
    "body": "\nTypically, when a company acquires another, it will absorb the new company’s branding or integrate it with its own identity. Grammarly is doing something different: After acquiring email client Superhuman in July, the company is renaming itself “Superhuman.” \nDespite the branding change, Grammarly, the product, will continue to be known as it has. However, the company says it is thinking about rebranding products like Coda, a productivity platform it acquired last year, in the long run.\nThe company is also launching an AI assistant called Superhuman Go that’s built into Grammarly’s existing extension. The assistant can provide writing suggestions, give feedback on emails, and you can even connect it with other apps like Jira, Gmail, Google Drive and Google Calendar to arm it with more context. The assistant can use these connections to do tasks like logging tickets or fetching your availability when you’re scheduling a meeting.\nImage Credits: Superhuman\nSuperhuman said it plans to add functionality to enable the assistant to fetch data from sources like CRMs and internal systems to suggest changes to your emails. \nUsers can try Superhuman Go by turning on a toggle in the Grammarly extension, which will let them connect it to different apps. Users can also try out different agents in the company’s agent store, which include a plagiarism checker and a proofreader, launched in August.\nAll Grammarly users can try out Superhuman Go right now, though the company is also selling product bundles. Its Pro subscription plan will cost $12 per month (billed annually) and will enable grammar and tone support in multiple languages. The Business plan will cost $33 per month (billed annually) and will give users access to Superhuman Mail.\nImage Credits: Superhuman\nSuperhuman said it also wants to add more AI-powered features to the Coda document suite and Superhuman email clients, such as fetching details from external and internal sources to create additional details in documents and email drafts automatically.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nGrammarly has for the past few years made a concerted effort to increase its viability as a productivity suite, exemplified through its acquisitions of Coda and Superhuman. With this AI assistant, the company is positioning itself to compete better with the likes of Notion, ClickUp and Google Workspace, which have launched multiple AI-powered features in the past few years. \n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Super Teacher is building an AI tutor for elementary schools — catch it at Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/28/super-teacher-is-building-an-ai-tutor-for-elementary-schools-catch-it-at-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/SJrlH6OgSnq4oZil7k0J_Super20Teacher20Icon.png?w=150",
    "tag": "Tech",
    "date": "2025-10-28T22:15:00.000Z",
    "description": "Super Teacher’s app features animated tutors with AI-generated voices that guide students through interactive lessons. Students talk to the app using voice, like a conversation with a teacher.",
    "body": "\nTutoring is one of the most effective tools for improving a child’s education, yet very few kids in the U.S. receive it. A 2023 survey of the nation’s largest school districts found that fewer than 10% of students received tutoring. One factor is that tutoring is too expensive for many families, often costing hundreds or thousands of dollars a month.\nTim Novikoff, a former Google product manager and educator, wants to change that. His startup, Super Teacher, offers an AI-powered tutoring app for elementary school students that costs $15 a month, or $10 with an annual plan. Super Teacher aims to make private tutoring accessible to families nationwide.\nThe four-year-old startup is gaining traction. Novikoff says roughly 20,000 families have signed up for Super Teacher, and public schools in New York, New Jersey, and Hawaii now use the app. Super Teacher is a Startup Battlefield Top 20 finalist at TechCrunch Disrupt 2025 in San Francisco.\nNovikoff was previously a math teacher in New York City, first in Harlem and then at a highly rated public school, Stuyvesant High School. In an interview with TechCrunch, he said almost all the students at Stuyvesant received tutoring, whereas many of the students in Harlem didn’t, and the difference in their educational experience was stark.\n“[Tutoring] is by far the most effective intervention that can be provided to kids for education, and it’s not even close,” Novikoff said. “It’s really unfair that not everyone gets this opportunity. That’s why I’m pursuing a mission to democratize access to private tutoring.”\nSuper Teacher’s app features animated tutors with AI-generated voices that guide students through interactive lessons. Students talk to the app using voice, like a conversation with a teacher. But unlike many edtech tools, Super Teacher doesn’t use large language models to generate responses. Instead, its content comes from a deterministic system designed to always give correct answers — avoiding the inaccuracies that can plague LLMs.\nNovikoff thinks AI tutors can have a valuable impact on children’s lives, but he’s adamant that AI will never replace teachers in a school setting. He refers to AI tutors as a tool that teachers can use, such as smart boards or calculators, rather than a replacement altogether.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nSuper Teacher is only available for elementary school students, a decision Novikoff made to help his own children and because few edtech companies target that age group. Looking ahead, he hopes to expand to younger and older grades and partner with more school districts across the U.S.\nNovikoff previously founded Fly Labs, a mobile video-editing app acquired by Google in 2015.\nIf you want to learn more about Super Teacher from the company itself — while also checking out dozens of others, hearing their pitches, and listening to guest speakers on four different stages — join us at Disrupt, October 27 to 29 in San Francisco. Learn more here.  \n\n\n\n\t\tMaxwell Zeff is a senior reporter at TechCrunch specializing in AI. Previously with Gizmodo, Bloomberg, and MSNBC, Zeff has covered the rise of AI and the Silicon Valley Bank crisis. He is based in San Francisco. When not reporting, he can be found hiking, biking, and exploring the Bay Area’s food scene.\r\nYou can contact or verify outreach from Maxwell by emailing maxwell.zeff@techcrunch.com or via encrypted message at mzeff.88 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Unlisted connects homeowners with prospective buyers before they even put their homes up for sale and is part of TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/28/unlisted-homes-connects-homeowners-with-prospective-buyers-before-they-even-put-their-homes-up-for-sale-and-is-part-of-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-1308318231.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-28T22:15:00.000Z",
    "description": "Katie Hill’s dream home isn’t on the market — but one day, it will be, and she wants dibs. That, and a bit of neighborly envy, is how she got the idea for her startup, Unlisted Homes, which is a Top 20...",
    "body": "\nKatie Hill’s dream home isn’t on the market — but one day, it will be, and she wants dibs. That, and a bit of neighborly envy, is how she got the idea for her startup, Unlisted Homes, which is a Top 20 Startup Battlefield finalist at TechCrunch Disrupt 2025.\n“I’ve always imagined myself as an old lady with a big hat and big sunglasses, sipping a martini by the pool,” said Hill, a longtime entrepreneur. As her children grow into adults and move away from home, her neighbor’s lot across the street seems perfect: It’s a smaller home that’s perfect for downsizing, but more importantly, it has a pool.\n“I mentioned to my neighbor one day while he was cutting his grass that if he ever wants to sell his house, I was interested in buying it, which I knew was kind of a bold move, but I don’t know, I was possessed to do it,” she told TechCrunch. “He lit up, and he was like, ‘Are you serious? Because I’m starting to think about retirement.’”\nA casual conversation turned into something potentially life-changing; Hill and her neighbor decided that when he finally puts the house on the market, she will get a right of first refusal, getting her one step closer to her dream poolside retirement.\n“I’m not really in the market to buy a house, and he’s not really in the market to sell a house, but we were having a pretty meaningful conversation about a future transaction,” she said. “I felt a sense of relief that I was going to hear from him before I drove home from the grocery store and saw a sign in the front yard and had to scramble, so I was thinking, how many other people up and down the block are thinking the same thing?”\nUnlisted is like Zillow, but for houses that are not yet on the market — previously, this was a web platform only, but the company announced onstage at Disrupt that it’s launching an iOS app. Using public records of 21 million homes, Unlisted created “profiles” for each property, providing the same kind of information that you would find on any other real estate listings site.\nImage Credits:Unlisted\n“We put a waitlist on every single property profile, so a buyer that admires a home can add themselves to a waiting list, and then what they’re doing is definitely expressing interest in a property,” Hill said. “We notify the homeowner that there’s a waitlist for their home and drive them back to the site.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nFrom there, homeowners can update the listing of their home, add more information, and chat with the people on the waitlist.\nUnlisted doesn’t plan to facilitate real estate transactions through the platform, since the resources for those transactions already exist. Rather, Unlisted will sell sponsorships on individual ZIP codes to real estate agents, whose information will be linked to every home in that ZIP code as a local expert. Later, the company hopes to connect local homeowners with resources that a homeowner might need, like roofers or electricians.\n“Our goal is to be a national platform, but at the end of the day, real estate ends up local, and so we want to connect people to those local resources,” she said. “So far, most of those have been real estate agents … We just had our first mortgage company join.”\nIn June, Unlisted launched the waitlist feature, which Hill says has generated waitlists for 5,700 homes, or about $4 billion worth of potential real estate transactions.\n“One of the really important components of getting this business off the ground was the mentorship that I have received,” Hill said.\nAfter listening to Kayak co-founder Paul English tell his story on an episode of the podcast How I Built This, she emailed him an early pitch deck and asked if he knew someone she could talk to for technical assistance. English was intrigued enough that he connected her with Kayak’s former chief architect, Bill O’Donnell, who became an angel investor and board member for Unlisted.\n“They’ve been absolutely incredible,” she said. “Their experience is so wild. They took [Kayak] public for $2 billion, took it back private for another $2 billion … They’ve seen it all.”\nHill founded the company in 2022, devoting nights and weekends with one other engineer. Over time, Hill was able to make the company her full-time job, raising close to $1 million from angel investors. Last November, she raised another $2.25 million led by HearstLab, which funds early-stage companies founded by women.\nIf you want to learn from Unlisted firsthand, and see dozens of additional pitches, attend valuable workshops, and make the connections that drive business results, head here to learn more about this year’s Disrupt, held this week in San Francisco. \n\n"
  }
]