[
  {
    "title": "Blue Origin plans second launch of New Glenn mega-rocket on November 9",
    "url": "https://techcrunch.com/2025/11/05/blue-origin-plans-second-launch-of-new-glenn-mega-rocket-on-november-9/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/blue-origin-new-glenn-launch.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T23:41:51.000Z",
    "description": "\nJeff Bezos’ space company Blue Origin is finally ready to try a second launch of its super heavy-lift rocket New Glenn. The company announced on Wedn",
    "body": "\nJeff Bezos’ space company Blue Origin is finally ready to try a second launch of its super heavy-lift rocket New Glenn. The company announced on Wednesday that it will attempt the launch as early as Sunday, November 9, from Launch Complex 36 in Cape Canaveral, Florida.\nNew Glenn’s first flight took place back in January, and it was mostly successful. The rocket’s second stage made it into orbit, but the first stage exploded on its return to Earth before Blue Origin could attempt to land it on a drone ship in the ocean.\nEarlier this year, the company said it would try to launch New Glenn for a second time in “late spring.” That timeline slipped a few times, though. Blue Origin is being extra careful with the second launch in part because it will be carrying cargo on behalf of paying customers this time. The main cargo is NASA’s twin ESCAPADE spacecraft, which are headed to Mars. A Viasat tech demonstrator will also be on board.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Origin plans second launch of New Glenn mega-rocket on November 9",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/blue-origin-new-glenn-launch.jpg?w=150"
      ],
      "datePublished": "2025-11-05T23:41:51.000Z",
      "dateModified": "2025-11-05T23:41:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google gets the US government’s green light to acquire Wiz for $32B",
    "url": "https://techcrunch.com/2025/11/05/google-gets-the-us-governments-green-light-to-acquire-wiz-for-32b/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/Assaf-Rappaport-Wiz.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T14:58:07.000Z",
    "description": "\nGoogle’s $32 billion acquisition of cloud security company Wiz has moved a step closer toward the finish line.\nWiz CEO Assaf Rappaport said at a Wall",
    "body": "\nGoogle’s $32 billion acquisition of cloud security company Wiz has moved a step closer toward the finish line.\nWiz CEO Assaf Rappaport said at a Wall Street Journal event on Tuesday, as reported by Reuters, that the acquisition had cleared its antitrust review by the U.S. Department of Justice. Rappaport added that while a milestone, the deal still has a way to go before it officially closes.\nTechCrunch reached out to Wiz for more information regarding the timeline to close.\nGoogle initially approached Wiz in 2024 with an offer to buy the startup for $23 billion. Wiz walked away from that offer and Rappaport said, at the time, that he felt the business could grow to be a lot bigger than that.\nHe was right. Google and Wiz revived acquisition talks in the first few months of 2025, and Google announced it was buying Wiz for $32 billion in March.\nBloomberg initially reported that the deal was under antitrust review in June. The deal is expected to close in early 2026, according to Reuters.\n\n\tTopics\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google gets the US government’s green light to acquire Wiz for $32B",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/Assaf-Rappaport-Wiz.jpg?w=150"
      ],
      "datePublished": "2025-11-05T14:58:07.000Z",
      "dateModified": "2025-11-05T14:58:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Motion Picture Association hits Meta with cease-and-desist over use of ‘PG-13’ label",
    "url": "https://techcrunch.com/2025/11/05/motion-picture-association-hits-meta-with-cease-and-desist-over-use-of-pg-13-label/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T15:46:58.000Z",
    "description": "\nIn Brief\nPosted:\n7:46 AM PST · November 5, 2025\n\nImage Credits:stockcam (opens in a new window) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n7:46 AM PST · November 5, 2025\n\nImage Credits:stockcam (opens in a new window) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Motion Picture Association (MPA) has sent Meta a cease-and-desist letter demanding that it stop using the term “PG-13,” as first reported by The Wall Street Journal.\nLast month, Meta announced that teens on Instagram would, by default, only see content that adheres to PG-13 movie ratings. Two weeks later, the MPA sent Meta a cease-and-desist letter, asserting that Meta’s claim that content on teen Instagram accounts would follow PG-13 guidelines is “literally false and highly misleading.”\nThe company states that its movie-rating system can’t be compared to Meta’s content restrictions, which it says “appear to rely heavily on artificial intelligence.”\n“The MPA has worked for decades to earn the public’s trust in its rating system,” said the letter. “Any dissatisfaction with Meta’s automated classification will inevitably cause the public to question the integrity of the MPA’s rating system.”\nIn response to the letter, Meta stated that it hasn’t claimed its teen accounts were certified by the MPA or officially PG-13 rated. Additionally, the company says its content restrictions are “guided” by PG-13, rather than directly linked to the MPA. Meta also says its use of the term qualifies as fair use.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Apps\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Motion Picture Association hits Meta with cease-and-desist over use of ‘PG-13’ label",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?w=150"
      ],
      "datePublished": "2025-11-05T15:46:58.000Z",
      "dateModified": "2025-11-05T15:46:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple nears deal to pay Google $1B annually to power new Siri, report says",
    "url": "https://techcrunch.com/2025/11/05/apple-nears-deal-to-pay-google-1b-annually-to-power-new-siri-report-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/apple-on-phone.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T20:37:47.000Z",
    "description": "\nIn Brief\nPosted:\n12:37 PM PST · November 5, 2025\n\nImage Credits:Cheng Xin / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nApple is nearing ",
    "body": "\nIn Brief\nPosted:\n12:37 PM PST · November 5, 2025\n\nImage Credits:Cheng Xin / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nApple is nearing a deal with Google that would see the iPhone maker pay the tech giant roughly $1 billion a year for a custom version of Google’s Gemini AI model to power its overhaul of Siri, according to a new report from Bloomberg.\nThe move is a big one for Apple, which has traditionally relied on its own technology but plans to use Google’s model as a temporary solution until its own AI becomes powerful enough, including to power a slate of upcoming features for the voice assistant. \nThe custom AI model’s 1.2 trillion parameters — a measure of the software’s complexity and capability — would far exceed the level of Apple’s current models. For context, the current cloud-based version of Apple Intelligence uses 150 billion parameters, meaning Google’s model would be roughly eight times more complex.\nApple had also considered using AI models from OpenAI and Anthropic earlier this year. After testing models from all three companies, Apple chose to move forward with Google.\nAccording to Bloomberg, the overhauled Siri is expected to launch next spring. However, since the launch is still months away, plans for the revamp could change.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple nears deal to pay Google $1B annually to power new Siri, report says",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/06/apple-on-phone.jpg?w=150"
      ],
      "datePublished": "2025-11-05T20:37:47.000Z",
      "dateModified": "2025-11-05T20:37:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Perplexity to pay Snap $400M to power search in Snapchat",
    "url": "https://techcrunch.com/2025/11/06/perplexity-to-pay-snap-400m-to-power-search-in-snapchat/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Snap-Inc-Perplexity-White-16x9-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T11:33:13.000Z",
    "description": "\nSnap said on Thursday that it has signed a deal to integrate Perplexity’s AI search engine directly within Snapchat. As part of the deal, Perplexity ",
    "body": "\nSnap said on Thursday that it has signed a deal to integrate Perplexity’s AI search engine directly within Snapchat. As part of the deal, Perplexity will pay Snap $400 million in cash and equity.\nThe deal gives Perplexity exposure to more than 940 million Snapchat users, who will get answers from its AI engine when they ask questions to the company’s My AI chatbot.\nThe new feature will be integrated into the app’s interface early next year. Snap said it will start recording revenue from this deal from 2026.\nThe deal was announced alongside Snap’s Q3 2025 results. The company reported revenue of $1.51 billion, up 10% from a year earlier, though it narrowed its loss to $104 million from $153 million a year ago. The company said its subscription tier, Snapchat+, now has more than 17 million users.\n\n\tTopics\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Perplexity to pay Snap $400M to power search in Snapchat",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Snap-Inc-Perplexity-White-16x9-1.jpg?w=150"
      ],
      "datePublished": "2025-11-06T11:33:13.000Z",
      "dateModified": "2025-11-06T11:33:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lucid Motors’ chief engineer leaves after 10 years",
    "url": "https://techcrunch.com/2025/11/05/lucid-motors-chief-engineer-leaves-after-10-years/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/lucid-motors-gravity-17.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T21:21:15.000Z",
    "description": "\nLucid Motors’ chief engineer Eric Bach is leaving the company after more than a decade, the company has announced.\nBach, who also served as Lucid Mot",
    "body": "\nLucid Motors’ chief engineer Eric Bach is leaving the company after more than a decade, the company has announced.\nBach, who also served as Lucid Motors’ Senior Vice President of Product, has been with the company since 2015. He joined Lucid after spending three years as Tesla’s Director of Engineering, where he worked alongside Lucid Motors’ former CEO and CTO Peter Rawlinson. Bach spent more than 10 years at Volkswagen before Tesla.\nTechCrunch has learned that Lucid’s VP of Engineering, James Hawkins, is also no longer with the company after spending 10 years there. Lucid Motors declined to specifically comment on his departure.  \nBach’s and Hawkins’ departures are part of a wider shake-up announced Wednesday. Lucid Motors’ Vice President of Quality, Jeri Ford, is retiring as well. She will be replaced by Marnie Levergood, who is coming to the company from Scout Motors.\nAt the same time, Lucid Motors’ current Senior Vice President of Powertrain, Emad Dlala, is being elevated to oversee all of “Engineering and Digital.” Dlala was promoted once already earlier this year and has been with the company since 2015.\nThe executive shake-up comes as Lucid enters its ninth month without a permanent CEO after Peter Rawlinson suddenly resigned in February. Former chief operating officer Marc Winterhoff has been serving as CEO on an interim basis ever since.\nThe loss of Bach and Ford is the latest in a line of executive departures at Lucid Motors. The company’s head of investor relations, Senior Vice President of Operations, Managing Director for Europe, and the Vice Presidents of Software Quality and Marketing have all left within the last year.\nThe changes are happening at a critical moment in Lucid Motors’ history. The company finally launched its long-awaited luxury SUV, the Gravity, which the company expects will ultimately be more successful than the Air sedan, which it has struggled to sell. \nLucid Motors is also working on a midsized vehicle that will be priced closer to $50,000 in 2026, though it has said it likely needs to raise more money before that happens. On Wednesday, Lucid Motors announced that its majority owner — Saudi Arabia’s sovereign wealth fund — had boosted the cap of a loan agreement from $750 million to around $2 billion, which provides the company liquidity until 2027.\nThis story has been updated with more information about departures and the amended loan agreement announced Wednesday.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucid Motors’ chief engineer leaves after 10 years",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/lucid-motors-gravity-17.jpg?w=150"
      ],
      "datePublished": "2025-11-05T21:21:15.000Z",
      "dateModified": "2025-11-05T21:21:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Discord’s Family Center update now lets parents monitor weekly purchases",
    "url": "https://techcrunch.com/2025/11/05/discords-family-center-update-now-lets-parents-monitor-weekly-purchases/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/03-FCv2-Dashboard-EN.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T04:07:32.000Z",
    "description": "\nDiscord has rolled out updates to its Family Center, giving guardians more insights into their teens’ usage patterns, including purchases, top intera",
    "body": "\nDiscord has rolled out updates to its Family Center, giving guardians more insights into their teens’ usage patterns, including purchases, top interactions, and time spent. The goal is to help parents monitor whether their teen is spending excessive time or money on Discord.\nThe communication platform first launched Family Center in 2023 with an activity dashboard showing which servers their teens have joined and a weekly email summary for guardians about their teen’s activity. The platform is now expanding these monitoring abilities.\nGuardians can now see total purchases made by the teen in the last week, including items from Discord’s Shop and Nitro subscriptions (Discord’s premium membership service).\nImage Credits: Discord\nThey can also view the total time spent on voice and video calls in DMs, groups, and servers over the past week. Plus, Discord will display the top five users and servers teens interacted with in the last seven days. This comes after other social networks Instagram, Facebook, and Snapchat have also implemented restrictions on who can contact teens.\nDiscord is also adding new parental controls to the app with settings that can only be altered by guardians. They can now control who can DM their teen and whether sensitive content should be filtered. Guardians can also manage data privacy controls for teens, determining how Discord uses their data, including whether to show them personalized ads.\nImage Credits: Discord\nThe company also said that when teens report content on the platform, they now have an option to notify their parents or guardians of their action. However, Discord said it won’t disclose what content was reported and encourages teens to discuss this directly with their guardians instead.\n“The new features allow guardians who have linked Family Center accounts to play a more active role in creating a safer space online for teens while still respecting their privacy,” Discord said in a blog post. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn recent months, several companies, including Meta, YouTube, and OpenAI, have rolled out updates to bolster their tools around teen safety. Companies like OpenAI and Character.AI have had to iterate on their AI products to make them safer for teens.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Discord’s Family Center update now lets parents monitor weekly purchases",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/03-FCv2-Dashboard-EN.jpeg?w=150"
      ],
      "datePublished": "2025-11-06T04:07:32.000Z",
      "dateModified": "2025-11-06T04:07:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tinder to use AI to get to know users, tap into their Camera Roll photos",
    "url": "https://techcrunch.com/2025/11/05/tinder-to-use-ai-to-get-to-know-users-tap-into-their-camera-roll-photos/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/05/tinder-icon-ios.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T18:22:17.000Z",
    "description": "\nTinder is looking to AI to revitalize its dating app, which has now reported nine straight quarters of paying subscriber declines, as of the third qu",
    "body": "\nTinder is looking to AI to revitalize its dating app, which has now reported nine straight quarters of paying subscriber declines, as of the third quarter this year. The dating app maker, Match Group, told investors on Tuesday’s earnings call that Tinder is testing a feature called Chemistry that will get to know users through questions and, with permission, will access Camera Roll photos on users’ phones to learn more about their interests and personality.\nThe feature is already being piloted in New Zealand and Australia and will be a “major pillar of Tinder’s upcoming 2026 product experience,” said Match Group CEO Spencer Rascoff.\nMatch isn’t alone in requesting access to users’ private Camera Roll photos. Meta also launched a feature last month that asks to use its AI on photos on your phone that you haven’t yet shared in order to suggest AI edits.\nIn both cases, the benefits to the end user for permitting this kind of expanded access are negligible. \nIn Match’s case, the company says it will engage users with interactive questions and learn more about them using AI technology so it can recommend better, more compatible matches. Presumably, that would look something like this: If you had photos of yourself outside hiking or climbing, you might be matched with someone who shared the same outdoor hobbies.\nWhile the company experiments with Tinder, Match’s bottom line is taking a hit. \nIts fourth-quarter guidance includes a $14 million negative impact on Tinder’s direct revenue as a result of the product testing, Match said. This, alongside other dating industry trends, has pulled down Match’s Q4 guidance to land somewhere between $865 million and $875 million, while analysts were expecting $884.2 million. \nThe company is using AI in other areas as well, including in an LLM-powered system where Tinder nudges users before they send potentially offensive messages, asking them, “Are you sure?” It also uses AI to help users pick their best photos.\nAI isn’t the only thing Tinder is trying to boost subscribers and engagement. The company has rolled out other features, like dating “modes,” double dates, facial verification, and redesigned profiles, which feature bio information on the first photo card and prompts integrated into the photo carousel.\nDespite the product changes, Tinder faces a tough market where some young people are leaning away from online dating in favor of more real-world experiences, while online daters in the U.S. may be spending less due to their disposable income shrinking as the country flirts with recession.\nMatch reported in Q3 that Tinder’s revenue declined 3% year-over-year, and it saw a 7% decline in paying users. \nOverall, Match’s revenue and earnings were largely in line with estimates, with revenue up 2% to $914.2 million, versus an expected $915 million, and EPS of 62 cents (profit of $160.8 million), versus an expected 63 cents.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tinder to use AI to get to know users, tap into their Camera Roll photos",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/05/tinder-icon-ios.jpg?w=150"
      ],
      "datePublished": "2025-11-05T18:22:17.000Z",
      "dateModified": "2025-11-05T18:22:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google makes it easier to access AI Mode in Chrome on iOS and Android",
    "url": "https://techcrunch.com/2025/11/05/google-makes-it-easier-to-access-ai-mode-in-chrome-on-ios-and-android/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T17:00:00.000Z",
    "description": "\n\t\n\t\tImage Credits:Matthias Balk/picture alliance / Getty Images\t\n\t\n\t\t\t\t\t\t9:00 AM PST · November 5, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nGoogle announced on Wednesday",
    "body": "\n\t\n\t\tImage Credits:Matthias Balk/picture alliance / Getty Images\t\n\t\n\t\t\t\t\t\t9:00 AM PST · November 5, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nGoogle announced on Wednesday that it’s making it easier to access AI Mode on mobile. Users will now be able to access AI Mode, which allows users to ask complex questions and follow-ups to dig deeper on a topic directly within Search, via a new dedicated shortcut button under the search bar when opening a “New Tab” page in Chrome. \nThe new shortcut for AI Mode in Chrome is launching in the U.S. starting Wednesday and will soon be coming to 160 new countries and other languages, including Hindi, Indonesian, Japanese, Korean, Portuguese, and more.\nBy making it easier to access AI Mode on mobile, Google likely hopes that people will use its service rather than navigate to competitors’ tools.\nImage Credits:Google\nThe launch of the new shortcut comes as Google recently expanded AI Mode globally, bringing the feature to 180 new countries. The tech giant also made the feature available in more languages, including Hindi, Indonesian, Japanese, Korean, and Brazilian Portuguese.\nGoogle first launched AI Mode in March to take on popular services like Perplexity AI and OpenAI’s ChatGPT Search. Since then, the tech giant has continuously updated the tool with added functionality. \nYesterday, Google launched new agentic capabilities in AI Mode to allow users to get help with booking event tickets and beauty and wellness appointments in AI Mode. Google first introduced agentic capabilities to AI Mode back in August, when it rolled out the ability for people use the feature to find restaurant reservations. \nAI Mode launched a Canvas feature in July that helps you build study plans and organize information over multiple sessions in a side panel. It also now lets you use Google Lens to ask about what’s on your desktop screen.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google makes it easier to access AI Mode in Chrome on iOS and Android",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150"
      ],
      "datePublished": "2025-11-05T17:00:00.000Z",
      "dateModified": "2025-11-05T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft built a fake marketplace to test AI agents — they failed in surprising ways",
    "url": "https://techcrunch.com/2025/11/05/microsoft-built-a-synthetic-marketplace-for-testing-ai-agents/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/photo-mosh-getty-windows-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T17:00:00.000Z",
    "description": "\nOn Wednesday, researchers at Microsoft released a new simulation environment designed to test AI agents, along with new research showing that current",
    "body": "\nOn Wednesday, researchers at Microsoft released a new simulation environment designed to test AI agents, along with new research showing that current agentic models may be vulnerable to manipulation. Conducted in collaboration with Arizona State University, the research raises new questions about how well AI agents will perform when working unsupervised — and how quickly AI companies can make good on promises of an agentic future.\nThe simulation environment, dubbed the “Magentic Marketplace” by Microsoft, is built as a synthetic platform for experimenting on AI agent behavior. A typical experiment might involve a customer-agent trying to order dinner according to a user’s instructions, while agents representing various restaurants compete to win the order.\nThe team’s initial experiments included 100 separate customer-side agents interacting with 300 business-side agents. Because the source code for the marketplace is open source, it should be straightforward for other groups to adopt the code to run new experiments or reproduce findings.\nEce Kamar, managing director of Microsoft Research’s AI Frontiers Lab, says this kind of research will be critical to understanding the capabilities of AI agents. “There is really a question about how the world is going to change by having these agents collaborating and talking to each other and negotiating,” said Kamar. “We want to understand these things deeply.”\nThe initial research looked at a mix of leading models, including GPT-4o, GPT-5, and Gemini-2.5-Flash, and found some surprising weaknesses. In particular, the researchers found several techniques businesses could use to manipulate customer agents into buying their products. The researchers noticed a particular falloff in efficiency as a customer agent was given more options to choose from, overwhelming the attention space of the agent.\n“We want these agents to help us with processing a lot of options,” Kamar says. “And we are seeing that the current models are actually getting really overwhelmed by having too many options.”\nThe agents also ran into trouble when they were asked to collaborate toward a common goal, apparently unsure of which agent should play what role in the collaboration. Performance improved when the models were given more explicit instructions on how to collaborate, but the researchers still saw the models’ inherent capabilities as in need of improvement.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We can instruct the models — like we can tell them, step by step,” Kamar said. “But if we are inherently testing their collaboration capabilities, I would expect these models to have these capabilities by default.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft built a fake marketplace to test AI agents — they failed in surprising ways",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/photo-mosh-getty-windows-logo.jpg?w=150"
      ],
      "datePublished": "2025-11-05T17:00:00.000Z",
      "dateModified": "2025-11-05T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps upgrades navigation in India with Gemini, safety alerts",
    "url": "https://techcrunch.com/2025/11/06/google-maps-upgrades-navigation-in-india-with-gemini-safety-alerts/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/12/google-maps-getty.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T11:56:51.000Z",
    "description": "\nGoogle is adding Gemini to Maps in India, along with road safety alerts and more information about routes.\nThe AI integration, launched in the U.S. o",
    "body": "\nGoogle is adding Gemini to Maps in India, along with road safety alerts and more information about routes.\nThe AI integration, launched in the U.S. on Wednesday, brings hands-free AI assistance to Maps, as well as contextual suggestions while navigating and information about places of interest. \nMiriam Daniel, vice president and head of Google Maps, said the rollout required significant localization.\n“When we say localizing for India, it’s not just the language,” she said at a virtual briefing. “It’s also adapting to how Indians use the product, how Indians will talk, how they will ask for questions, how they will identify places, the geopolitical places, the street names, you know, everything is sort of different in India.”\nGemini in Maps will be available to all Android and iOS users in India in the coming weeks, Google said. At launch, Gemini will support nine Indian languages.\nGoogle is also adding a set of India-specific navigation and commuting updates. Drivers will now get visual and audio alerts when they’re passing accident-prone stretches. Google said it is working on these alerts with local authorities, and the feature will roll out to Android users in Gurugram, the Cyberabad region of Hyderabad, Chandigarh and Faridabad.\nImage Credits:Google\nGoogle has come under scrutiny in India over the reliability of some navigation routes, after a car drove off an unfinished bridge in Uttar Pradesh, killing three men, late last year.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“The real world conditions can keep changing, and it’s very dynamic, and sometimes it changes in an instant. Maps can’t be accurate 100% of the time,” said Anal Ghosh, senior program manager for Google Maps, when asked about warnings for incomplete roads or unfinished bridges. “So we would encourage users to ensure that they’re keeping their eyes on the road.”\nGoogle said it has partnered with the country’s highways regulator, National Highways Authority of India (NHAI), to receive near real-time data on road closures, diversions and repair work. The company said the partnership will also allow Maps to show wayside amenities such as public restrooms, restaurants and fuel stations along national highways.\nOther new features include proactive notifications about major disruptions or delays on routes, even when users are not navigating. These alerts are rolling out to Android users for highways and major roads in New Delhi, Mumbai and Bengaluru. \nImage Credits:Google\nThe app will also display speed limits during navigation, using data from local traffic authorities. This feature is rolling out to Android and iOS users in nine cities: Faridabad, Ghaziabad, Gurugram, Hyderabad (including the Cyberabad region), Jaipur, Kolkata, Lucknow, Mumbai and Noida.\nBuilding on the flyover navigation feature launched last year, Maps is now getting voice support for flyovers. This feature is rolling out to Android and iOS users over the coming weeks.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps upgrades navigation in India with Gemini, safety alerts",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/12/google-maps-getty.jpg?w=150"
      ],
      "datePublished": "2025-11-06T11:56:51.000Z",
      "dateModified": "2025-11-06T11:56:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ventures Platform, one of Africa’s most active early-stage investors, has raised another $64 million",
    "url": "https://techcrunch.com/2025/11/06/nigeria-backs-ventures-platform-as-seed-fund-hits-64m-first-close/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/IMG_2483.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T09:00:00.000Z",
    "description": "\nLagos-based Ventures Platform, one of Africa’s most active early-stage investors, has raised $64 million so far for its second fund, targeting a fina",
    "body": "\nLagos-based Ventures Platform, one of Africa’s most active early-stage investors, has raised $64 million so far for its second fund, targeting a final close of $75 million, founding partner Kola Aina tells TechCrunch.\nAmong the investors is the Nigerian government, through its Investment in Digital and Creative Enterprises (iDICE) program, which marks the first time this government has invested in a VC fund. That’s significant, since Nigeria’s burgeoning startup community is home to the largest number of startup unicorns on the continent.\nOther limited partners in Ventures Platform’s second fund include IFC, British International Investment (BII), Proparco, Standard Bank, MSMEDA, and AfricaGrow, along with European family offices such as Alder Tree Investment and prominent global backers like former Y Combinator CEO Michael Seibel. Aina says 70% of the investors from its previous fund returned. \nNigeria choosing this firm for a debut investment is perhaps not surprising. Since its founding in 2016, Ventures Platform has built a reputation for spotting breakout startups in the country early, something it hopes to replicate in other African markets.\nVentures Platform launched its first institutional fund, a $46 million vehicle, in 2022 to focus primarily on pre-seed and seed rounds.\nWith the second fund, the firm will also pursue Series A investing, while “investing with more conviction” and seeking larger ownership stakes, Aina said. This should be good news for the region’s founders, as Series A funding has become harder to obtain after years of pullback from Silicon Valley firms.\nWhile Ventures Platform plans to deepen its presence in Nigeria, the firm has begun establishing a presence in Francophone West Africa and North Africa, regions where it has already made a few investments, to gain earlier access to promising deals.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSo far, the pan-African venture capital firm has funded over 90 startups across the continent. Most of these investments, the firm says, are “painkiller” businesses across fintech, healthtech, agritech, edtech, and AI—companies that solve for non-consumption, or in simpler terms, serve markets where people have little to no access to a service.\nAina points to portfolio companies Visa-backed unicorn Moniepoint and Stripe-owned Paystack, two fintechs that unlocked new markets for online payments and small business banking.\n“Many small businesses couldn’t sell beyond their immediate vicinity before Paystack because they couldn’t accept online payments,” he said. “Moniepoint, on the other hand, has driven financial inclusion to the nooks and crannies of this country. That’s market creating innovation.”\nOther notable portfolio companies include Left Lane-backed remittance app LemFi, Gates Foundation-backed SeamlessHR, Norfund-backed OmniRetail, QED-backed fintech Raenest, and healthtech Remedial Health.\nEven as innovation accelerates and funding in Africa’s tech ecosystem has surpassed $12 billion since 2015, stakeholders are voicing fresh concerns about the shortage of exits and liquidity events. That reality has made fundraising harder for many of the continent’s VCs, most of them emerging managers who, as a collective globally, have faced a tough climate over the past two years.\nVentures Platform, however, in that time, managed to attract both local and international LPs for two funds despite the market uncertainty.\n“We have LPs who understand how venture ecosystems in other markets have developed and know we’ll get there in the long term. Another reason is that we’ve recycled capital from our prior syndicates,” Aina said, referring to the firm returning four out of its six vintages (including five angel syndicates) between 2016 and 2022. The investor also claims that the first fund ranks among the top performers globally based on TVPI and IRR for its vintage year.\nStill addressing questions around exits as well as the continent’s funding slowdown (from $5 billion in 2021 to $2 billion last year), Aina adds that Africa’s long-term potential hasn’t waned and describes the continent as the “purest asymmetric play for non-consensus alpha”—venture-speak for high-risk, high-upside bets.\n“If you’re a global capital allocator looking for true diversification, Africa is the place,” he said. “By 2050, one in four humans will be African. Our GDP growth rate is double that of the U.S., and yet most of the value is still offline. The opportunity is huge if you have the patience and the local context.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ventures Platform, one of Africa’s most active early-stage investors, has raised another $64 million",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/IMG_2483.jpeg?w=150"
      ],
      "datePublished": "2025-11-06T09:00:00.000Z",
      "dateModified": "2025-11-06T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anker-backed hybrid RV startup Evotrex comes out of stealth",
    "url": "https://techcrunch.com/2025/11/06/anker-backed-hybrid-rv-startup-evotrex-comes-out-of-stealth/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Evotrex-RV-Trailer.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T10:00:00.000Z",
    "description": "\nA slew of new companies have emerged in recent years offering fresh takes on RVs, like Lightship, Pebble, and Grounded. Now another startup called Ev",
    "body": "\nA slew of new companies have emerged in recent years offering fresh takes on RVs, like Lightship, Pebble, and Grounded. Now another startup called Evotrex is coming out of stealth with its own twist: a hybrid RV travel trailer with an integrated gas engine.\nThe new RV will have an onboard battery pack that will power the living quarters and onboard electronics, but the gas engine will recharge that battery pack and extend its range for far longer than a full charge — potentially making Evotrex’s trailer attractive for longer camping trips. \nThe Evotrex RV will debut at the 2026 Consumer Electronics Show, but the company detailed some of its plans ahead of that reveal in an exclusive interview with TechCrunch.\nUsing a gas engine to get more out of a big battery pack has become a trendy idea in the automotive world, as carmakers and customers hesitate to transition to fully-electric vehicles. In fact, the CEO of startup automaker Scout Motors recently revealed that 80% of the customers who preordered its upcoming vehicles have chosen the hybrid “extended range” powertrain option over the all-electric ones.\nEvotrex co-founder Alex Xiao, a former product manager for consumer electronics company Anker, believes the idea will appeal to RV customers and dealers alike.\nXiao told TechCrunch that he and co-founder Stella Qin (another Anker alum) spent seven months researching the RV market before they started building anything. What they found was a customer base that was getting much younger and had the desire to take these kinds of vehicles further out in the world, far beyond the typical plug-and-stay campsites and RV parks.\nThese customers “want to bring their gadgets and other equipment on skiing, hunting, fishing, and other activities, and stay in the wild for like four or five days, which is different,” Xiao said. “They’re off-grid — off-grid living was not supported before within the RV life.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTo do all that, you need power. \nRV owners are no strangers to gas generators, but Xiao and Qin believe the way they’ve integrated their engine into the Evotrex trailer offers a number of benefits. They claim it’s quieter and more efficient, and they say they’re even using the excess heat created to help keep the cabin warm.\nXiao said Evotrex plans to ship the first of its RV trailers by the end of 2026, and it’s raised $16 million in seed funding so far from his former employer Anker, as well as Chinese early-stage venture firms Unity Ventures, Kylinhall Partners, and Vision Plus Capital.\nEvotrex has about 40 employees so far, Xiao said, with some in China and some in the U.S. Evotrex’s CTO formerly led automotive R&D at Chinese automaker Geely Group, and the startup’s COO (and a third co-founder) has held supply chain leadership positions at IBM, Lenovo, and Anker.\nXiao said the plan is to do most of the production in China with final assembly in California. Combined with the fact that much of the supply chain for RVs remains in China, he said he’s aware that there will be challenges due to the Trump’s administrations trade policies.\nSolving those problems won’t be easy, Xiao said. But neither is making a successful RV company from scratch, he added.\n“The purpose of this company is to bring those kinds of new experiences to the customer,” Xiao said.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anker-backed hybrid RV startup Evotrex comes out of stealth",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Evotrex-RV-Trailer.jpg?w=150"
      ],
      "datePublished": "2025-11-06T10:00:00.000Z",
      "dateModified": "2025-11-06T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pinterest CEO touts open source AI: ‘tremendous performance’ with reduced costs",
    "url": "https://techcrunch.com/2025/11/05/pinterest-ceo-touts-open-source-ai-tremendous-performance-with-reduced-costs/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/bill-ready-pinterest-GettyImages-2213037081.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T19:00:28.000Z",
    "description": "\nOn an earnings call on Tuesday, Pinterest CEO Bill Ready highlighted the promise of open source AI models in helping the company keep its costs down ",
    "body": "\nOn an earnings call on Tuesday, Pinterest CEO Bill Ready highlighted the promise of open source AI models in helping the company keep its costs down as it expands the use cases for visual AI.\nThe image pinboarding site, which often serves as consumers’ first step in their shopping journey, leverages AI technology to power a variety of features, including its personalized recommendations, a multimodal search experience that combines text and images, ad targeting, and, most recently, product discovery with the launch of its AI-powered Pinterest Assistant. \nHowever, investors wanted to know what Pinterest’s opportunity in agentic commerce — AI systems that can act autonomously on behalf of users — was given the rapidly changing AI landscape and how that could impact its bottom line and growth potential.\nThat question has become more pressing. During the company’s third-quarter earnings announcement, it predicted a weaker holiday shopping season than expected, citing President Donald Trump’s tariffs and their negative impact on the home furnishings category. As a result, Pinterest’s fourth-quarter revenue is expected to come in between $1.31 billion and $1.34 billion, while analysts were estimating $1.34 billion, on average. The news sent the stock tumbling by more than 21% on Wednesday.\nDespite the near-term revenue concerns, Ready pointed to ways the business could maximize its use of AI and LLMs (large language models), without dramatically increasing its costs. In addition to its own proprietary models that are already accounted for in its cost structure, Ready said the company tests leading off-the-shelf models against open source options on a regular basis and found the open source models promising.\n“One of the really, really interesting things that we’re seeing is that we are just getting tremendous performance from open source models specifically for Pinterest use cases on visual AI,” Ready told investors. “Given current market rates and per token costs, in early testing, we’re seeing orders of magnitude reduction in cost with comparable performance using fine-tuned open source models versus leading off-the-shelf proprietary models.” \nHe said the company planned to move forward with many open source models for its various use cases, which would come at “a fraction of the cost” of the larger model providers.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We feel really good about the value that we’re bringing to the user there, our ability to align that with monetization, and our ability to control those costs and deliver that effectively,” said Ready.\nThe exec also touched on other areas where Pinterest is considering how to best use AI, including agentic shopping. Ready said that Pinterest already offers “push-button type buying” via its Amazon partnership, and it will wait to see if users actually want the AI to “push the button for them.”\nImage Credits:Pinterest\nIn the meantime, Ready suggested that Pinterest’s biggest differentiator is that it guides the user through the shopping experience — something it hopes to improve with Pinterest Assistant, an AI companion users can talk to, asking for advice and recommendations. The assistant understands the user based on their boards, collages, saves, and how they compare to people with similar tastes, the company says.\nPinterest is also rolling out personalized boards curated with AI, which Ready said combine expert human curation and AI. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pinterest CEO touts open source AI: ‘tremendous performance’ with reduced costs",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/bill-ready-pinterest-GettyImages-2213037081.jpg?w=150"
      ],
      "datePublished": "2025-11-05T19:00:28.000Z",
      "dateModified": "2025-11-05T19:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "University of Pennsylvania confirms hacker stole data during cyberattack",
    "url": "https://techcrunch.com/2025/11/05/university-of-pennsylvania-confirms-hacker-stole-data-during-cyberattack/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/upenn-2228317629.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-05T15:25:49.000Z",
    "description": "\nThe University of Pennsylvania confirmed on Tuesday that a hacker stole university data as part of last week’s data breach, during which alumni and o",
    "body": "\nThe University of Pennsylvania confirmed on Tuesday that a hacker stole university data as part of last week’s data breach, during which alumni and other affiliates received suspicious emails from official university email addresses.\n“We got hacked,” the message from the hackers read. “We love breaking federal laws like FERPA (all your data will be leaked),” the message added. “Please stop giving us money.”\nWhile Penn initially told TechCrunch that the email was “fraudulent,” the university has now confirmed the hacker’s claim that data was taken during the breach.\n“On October 31, Penn discovered that a select group of information systems related to Penn’s development and alumni activities had been compromised,” the university wrote in a statement, which was emailed to alumni and shared online. “Penn’s staff rapidly locked down the systems and prevented further unauthorized access; however, not before an offensive and fraudulent email was sent to our community and information was taken by the attacker.”\n(Disclosure: As an alumna and former employee of the university, the hackers sent the message to my personal email three times, each coming from different official @upenn.edu email addresses, including one from a senior Penn staff member.)\nA partially redacted email sent by hackers from a university of Pennsylvania email address.Image Credits:TechCrunch (Screenshot)\nThe university said that the breach occurred due to a social engineering attack, a hacking technique in which individuals are tricked into handing over sensitive information like log-in credentials, perhaps through phishing or a phone call.\nA Penn employee, who we are not naming, as they were not authorized to speak to the press, told TechCrunch that the university requires students, staff, and alumni to use multi-factor authentication (MFA) on their accounts as a security measure; however, the employee said that some high-ranking officials were granted exemptions to MFA requirements.\nTechCrunch asked Penn about these alleged MFA exceptions, and if the university could provide a percentage of MFA adoption among staff. Penn spokesperson Ron Ozio declined to comment to TechCrunch beyond Penn’s official data incident page.\nAs required by law, Penn said it will contact individuals whose personal information was accessed by hackers. The university has not said when these notifications will occur, how many people are affected, or what information was accessed.\nThe Daily Pennsylvanian reports that the alleged Penn hacker claimed to have taken documents relating to university donors, bank transaction receipts, and personally identifiable information. The hacker said they were financially motivated.\nEarlier this year, hackers breached Columbia University, accessing sensitive information about around 870,000 students and applicants, including their Social Security numbers and citizenship status.\nBoth the Penn and Columbia hacks appear motivated by discontent with affirmative action policies. In the email that the Penn hacker sent to the university community, the hacker wrote, “We hire and admit morons because we love legacies, donors, and unqualified affirmative action admits.” Meanwhile, the Columbia hacker told Bloomberg that they sought to access data from the university to investigate its affirmative action practices.\nIf you have more information about the Penn hack, you can contact Amanda Silberling securely on Signal at @amanda.100, or by email, from a non-work device.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "University of Pennsylvania confirms hacker stole data during cyberattack",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/upenn-2228317629.jpg?w=150"
      ],
      "datePublished": "2025-11-05T15:25:49.000Z",
      "dateModified": "2025-11-05T15:25:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]