[
  {
    "title": "Data breach at credit check giant 700Credit affects at least 5.6 million",
    "url": "https://techcrunch.com/2025/12/12/data-breach-at-credit-check-giant-700credit-affects-at-least-5-6-million/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/social-security-cards-104145260.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T17:35:46.000Z",
    "description": "700Credit, a company that runs credit checks and identity verification services for auto dealerships across the U.S., had a data breach that allowed a hacker to steal names, addresses, dates of birth, and Social Security numbers.",
    "body": "\nIn Brief\nPosted:\n9:35 AM PST · December 12, 2025\n\nImage Credits:Glowimages / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least 5.6 million people had their names, addresses, dates of birth, and Social Security numbers stolen in a data breach at 700Credit, a company that runs credit checks and identity verification services for auto dealerships across the United States.\nIn a statement on its website, the Michigan-based company blamed the October data breach on an unidentified bad actor.\nAccording to Michigan’s attorney general, the hacker stole personal data collected from dealers between May and October 2025.\nThe company said it was now sending letters by mail to individuals whose information had been stolen in the data breach, which offers credit monitoring services.\n“If you get a letter from 700Credit, don’t ignore it,” said Michigan attorney general Dana Nessel. “It is important that anyone affected by this data breach takes steps as soon as possible to protect their information. A credit freeze or monitoring services can go a long way in preventing fraud, and I encourage Michiganders to use the tools available to keep their identity safe.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n"
  },
  {
    "title": "Microsoft buys 3.6M metric tons of carbon removal from bioenergy plant",
    "url": "https://techcrunch.com/2025/12/12/microsoft-buys-3-6m-metric-tons-of-carbon-removal-from-bioenergy-plant/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/1765443854968.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T19:16:10.000Z",
    "description": "Microsoft announced Thursday it would buy 3.6 million carbon removal credits from a biofuels plant in Louisiana owned by C2X. The plant, which is slated to begin operating in 2029, will process forestry waste...",
    "body": "\nMicrosoft announced Thursday it would buy 3.6 million carbon removal credits from a biofuels plant in Louisiana owned by C2X. The plant, which is slated to begin operating in 2029, will process forestry waste into methanol, which can be used to power ships and planes and as a raw material for chemical manufacturing. Altogether, the facility will produce more than 500,000 metric tons of methanol. About 1 million metric tons of carbon dioxide will be captured and stored, likely underground.\nThe purchase is one of many that Microsoft has made in the last year or so, including a 4.9 million metric ton deal with Vaulted Deep, a 3.7 million metric ton agreement with CO280, and a 7 million metric ton buy from Chestnut Carbon. Microsoft’s rapid expansion of its data center footprint has imperiled its 2030 pledge to remove more carbon from the atmosphere than it generates. While the company also buys large amounts of renewable and nuclear power, carbon renewal purchases like these will help offset future fossil fuel emissions.\n"
  },
  {
    "title": "Netflix is showing Hollywood what happens when a startup grows up ",
    "url": "https://techcrunch.com/video/netflix-is-showing-hollywood-what-happens-when-a-startup-grows-up/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/02/GettyImages-1240099721.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T13:42:00.000Z",
    "description": "A baby was born in a Waymo this week, and it wasn't even the first one. What started as a novelty story quickly became a reminder of how autonomous vehicles have quietly become part of everyday life, complete with all the messiness that entails. The real coming-of-age story this week, however, wasn't happening in San Francisco's robotaxis. It was playing out in Hollywood, where Netflix made an $82 billion bid to acquire Warner Bros. Discovery's streaming and studio business. Today on TechCrunch's Equity podcast, hosts Kirsten Korosec and Anthony Ha discuss what happens when the startup that used to mail you DVDs grows up and tries to buy a legacy entertainment empire as well as the other headlines that caught their eye. Plus they discuss the rise of AI circular deals and what CoreWeave's CEO says about companies investing in their own customers Subscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.",
    "body": "\n\t\t\n\nLoading the player…\n\nA baby was born in a Waymo this week, and it wasn’t even the first one. \nWhat started as a novelty story quickly became a reminder of how autonomous vehicles have quietly become part of everyday life, complete with all the messiness that entails. The real coming-of-age story this week, however, wasn’t happening in San Francisco’s robotaxis. It was playing out in Hollywood, where Netflix made an $82 billion bid to acquire Warner Bros. Discovery’s streaming and studio business. \nToday on TechCrunch’s Equity podcast, hosts Kirsten Korosec and Anthony Ha discuss what happens when the startup that used to mail you DVDs grows up and tries to buy a legacy entertainment empire as well as the other headlines that caught their eye. \nListen to the full episode to hear about: \n\nHow Boom Supersonic is selling jet engines to data centers to fund its supersonic flight dreams \n\n\nWhy Hinge’s CEO is leaving to start an AI dating app, and whether AI can actually fix dating \n\n\nThe rise of AI circular deals and what CoreWeave’s CEO says about companies investing in their own customers \n\n\nA fertility startup using AI-designed antibodies to expand beyond ovulation tracking \n\nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n"
  },
  {
    "title": "Home Depot exposed access to internal systems for a year, says researcher",
    "url": "https://techcrunch.com/2025/12/12/home-depot-exposed-access-to-internal-systems-for-a-year-says-researcher/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/home-depot-2200450751.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T16:42:57.000Z",
    "description": "A security researcher said Home Depot exposed access to its internal systems for a year after one of its employees published a private access token online, likely by mistake. The researcher found the exposed...",
    "body": "\nA security researcher said Home Depot exposed access to its internal systems for a year after one of its employees published a private access token online, likely by mistake. The researcher found the exposed token and tried to privately alert Home Depot to its security lapse but was ignored for several weeks. \nThe exposure is now fixed after TechCrunch contacted company representatives last week.\nSecurity researcher Ben Zimmermann told TechCrunch that, in early November, he found a published GitHub access token belonging to a Home Depot employee, which was exposed sometime in early 2024. \nWhen he tested the token, Zimmermann said that it granted access to hundreds of private Home Depot source code repositories hosted on GitHub and allowed the ability to modify their contents. \nThe researcher said the keys allowed access to Home Depot’s cloud infrastructure, including its order fulfillment and inventory management systems, and code development pipelines, among other systems. Home Depot has hosted much of its developer and engineering infrastructure on GitHub since 2015, according to a customer profile on GitHub’s website.\nZimmermann said he sent several emails to Home Depot but didn’t hear back. \nNor did he get a response from Home Depot’s chief information security officer, Chris Lanzilotta, after sending a message over LinkedIn.\nZimmermann told TechCrunch that he has disclosed several similar exposures in recent months to companies, which have thanked him for his findings. \n“Home Depot is the only company that ignored me,” he said.\nGiven that Home Depot does not have a way to report security flaws, such as a vulnerability disclosure or bug bounty program, Zimmermann contacted TechCrunch in an effort to get the exposure fixed.\nWhen reached by TechCrunch on December 5, Home Depot spokesperson George Lane acknowledged receipt of our email but did not respond to follow-up emails asking for comment. The exposed token is no longer online, and the researcher said the token’s access was revoked soon after our outreach.\nWe also asked Lane if Home Depot has the technical means, such as logs, to determine if anyone else used the token during the months it was left online to access any of Home Depot’s internal systems. We did not hear back.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Reddit argues it isn’t like other social platforms in case against Australia’s social media ban",
    "url": "https://techcrunch.com/2025/12/12/reddit-argues-it-isnt-like-other-social-platforms-in-case-against-australias-social-media-ban/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/11/snoo_expressions.png?w=150",
    "tag": "Tech",
    "date": "2025-12-12T13:51:29.000Z",
    "description": "Reddit, one of the world's largest social platforms, is arguing that it doesn't meet the definition of \"social media platforms\" as it seeks to overturn Australia's law banning children under 16 years of age from social media.",
    "body": "\nIn a move worthy of a post on the Not Like The Other Girls subreddit, Reddit, one of the world’s largest social platforms, is arguing that it isn’t like other, actual social media sites, as the company seeks to overturn Australia’s law banning children under 16 years of age from social media.\nIn a lawsuit filed with Australia’s top court, Reddit argues the law, which came into force on December 10, limits free political discourse by preventing children from airing their views online, and should be overturned.\nAnd if the legislation isn’t overturned, the company says it should be exempted from the law because it doesn’t meet the legislation’s definition of a “social media platform.”\nReddit is essentially asking the Australian High Court to address some of the questions raised about the legislation, which requires 10 major services to deactivate under-16s’ accounts and prevent them from using the app. Critics argue that the law infringes on children’s rights, and companies have sought to raise questions about what “social media” even defines.\nIndeed, calling itself a “collection of public fora arranged by subject,” Reddit brought up definitions of the word “social” in its filing to make the case that “it is not the sole or a significant purpose of Reddit to enable persons to interact ‘in a social manner’.”\n“Reddit enables online interactions about the content that users post on the site. It facilitates knowledge sharing from one user to other users. It is not a significant purpose of the site to enable interactions engaged in because of a particular user’s relationship with or interest in another user as a person […] Reddit is significantly different from other sites that allow for users to become ‘friends’ with one another, or to post photos about themselves, or to organise events,” the filing reads.\nIn a post accompanying the filing, Reddit admin LastBluejay said the law carries “some serious privacy and political expression issues for everyone on the internet.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“While we agree with the importance of protecting people under 16, this law has the unfortunate effect of forcing intrusive and potentially insecure verification processes on adults as well as minors, isolating teens from the ability to engage in age-appropriate community experiences (including political discussions), and creating an illogical patchwork of which platforms are included and which aren’t,” the post reads.\nReddit also points out that a significant portion of content on social media platforms is accessible without an account, and kids under 16 years old would be more easily protected if they were allowed to have accounts that could then be restricted.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google launched its deepest AI research agent yet — on the same day OpenAI dropped GPT-5.2",
    "url": "https://techcrunch.com/2025/12/11/google-launched-its-deepest-ai-research-agent-yet-on-the-same-day-openai-dropped-gpt-5-2/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1147600063.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T00:18:56.000Z",
    "description": "Google released on Thursday a “reimagined” version of its research agent Gemini Deep Research based on its much-ballyhooed state-of-the-art foundation model, Gemini 3 Pro.   This new agent isn’t just designed...",
    "body": "\nGoogle released on Thursday a “reimagined” version of its research agent Gemini Deep Research based on its much-ballyhooed state-of-the-art foundation model, Gemini 3 Pro.  \nThis new agent isn’t just designed to produce research reports — although it can still do that. It now allows developers to embed Google’s SATA-model research capabilities into their own apps. That capability is made possible through Google’s new Interactions API, which is designed to give devs more control in the coming agentic AI era. \nThe new Gemini Deep Research tool is an agent equipped to synthesize mountains of information and handle a large context dump in the prompt. Google says it’s used by customers for tasks ranging from due diligence to drug toxicity safety research. \nGoogle also says it will soon be integrating this new deep research agent into services, including Google Search, Google Finance, its Gemini App, and its popular NotebookLM. This is another step toward preparing for a world where humans don’t Google anything anymore — their AI agents do. \nThe tech giant says that Deep Research benefits from Gemini 3 Pro’s status as its “most factual” model that is trained to minimize hallucinations during complex tasks. \nAI hallucinations — where the LLM just makes stuff up — are an especially crucial issue for long-running, deep reasoning agentic tasks, in which many autonomous decisions are made over minutes, hours, or longer. The more choices an LLM has to make, the greater the chance that even one hallucinated choice will invalidate the entire output. \nTo prove its progress claims, Google has also created yet another benchmark (as if the AI world needs another one). The new benchmark is unimaginatively named DeepSearchQA and is intended to test agents on complex, multi-step information-seeking tasks. Google has open sourced this benchmark.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIt also tested Deep Research on Humanity’s Last Exam, a much more interestingly named, independent benchmark of general knowledge filled with impossibly niche tasks; and BrowserComp, a benchmark for browser-based agentic tasks.\nAs you might expect, Google’s new agent bested the competition on its own benchmark, and Humanity’s. However, OpenAI’s ChatGPT 5 Pro was a surprisingly close second all the way around and slightly bested Google on BrowserComp. \nBut those benchmark comparisons were obsolete almost the moment Google published them. Because on the same day, OpenAI launched its highly anticipated GPT 5.2 — codenamed Garlic. OpenAI says its newest model bests its rivals — especially Google — on a suite of the typical benchmarks, including OpenAI’s homegrown one. \nPerhaps one of the most interesting parts of this announcement was the timing. Knowing that the world was awaiting the release of Garlic, Google dropped some AI news of its own.\n"
  },
  {
    "title": "Google and Apple roll out emergency security updates after zero-day attacks",
    "url": "https://techcrunch.com/2025/12/12/google-and-apple-roll-out-emergency-security-updates-after-zero-day-attacks/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/iphone-trenchant-l3harris-1059636822.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T20:31:36.000Z",
    "description": "Apple and Google have released several software updates to protect against a hacking campaign targeting an unknown number of their users. On Wednesday, Google released patches for a handful of security bugs...",
    "body": "\nApple and Google have released several software updates to protect against a hacking campaign targeting an unknown number of their users.\nOn Wednesday, Google released patches for a handful of security bugs in its Chrome browser, noting that one of the bugs was being actively exploited by hackers before the company had time to patch it. \nUnusually for Google, the company provided no further details at the time. \nBut on Friday, Google updated the page to say that the bug was discovered by Apple’s security engineering team and Google’s Threat Analysis Group, whose security researchers primarily track government hackers and mercenary spyware makers, indicating that the hacking campaign may have been orchestrated by government-backed hackers.\nAt the same time, Apple released security updates for its flagship products, including iPhones, iPads, Macs, Vision Pro, Apple TV, Apple Watches, and its Safari browser.\nAccording to the security advisory for iPhones and iPads, Apple patched two bugs and the company said it was aware “that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals” running devices prior to iOS 26.\nThat language is Apple’s typical way of saying that it knows some of its customers and users were targeted by hackers exploiting zero-days, meaning flaws that at the time of exploitation are unknown to the software makers. Often, these are cases where government hackers used hacking tools and spyware made by companies such as NSO Group or Paragon Solutions to target journalists, dissidents, and human rights activists. \nApple and Google did not immediately respond to a request for comment. \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google Translate now lets you hear real-time translations in your headphones",
    "url": "https://techcrunch.com/2025/12/12/google-translate-now-lets-you-hear-real-time-translations-in-your-headphones/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T17:00:00.000Z",
    "description": "Google is rolling out a beta experience that lets you hear real-time translations in your headphones, the company announced on Friday. The tech giant is also bringing advanced Gemini capabilities to Google...",
    "body": "\nGoogle is rolling out a beta experience that lets you hear real-time translations in your headphones, the company announced on Friday. The tech giant is also bringing advanced Gemini capabilities to Google Translate and expanding its language-learning tools in the Translate app.\nThe new real-time headphone translations experience keeps each speaker’s tone, emphasis, and cadence intact, so it’s easier to follow the conversation and tell who’s saying what, Google says. The new capability essentially turns any pair of headphones into a real-time, one-way translation device. \n“Whether you’re trying to have a conversation in a different language, listen to a speech or lecture while abroad, or watch a TV show or film in another language, you can now put in your headphones, open the Translate app, tap ‘Live translate’ and hear a real-time translation in your preferred language,” said Rose Yao, Google VP Product Management, Search Verticals, in the blog post.\nImage Credits:Google\nThe beta is rolling out now in the Translate app on Android in the U.S., Mexico, and India. The feature works with any pair of headphones and supports more than 70 languages.\nThe company plans to bring the capability to iOS and more countries in 2026. \nAs for the advanced Gemini capabilities coming to Translate, Google says they will enable smarter, more natural, and accurate text translations. They’ll also enable improved translations of phrases with more nuanced meanings, like slang, idioms, or local expressions.\nFor example, if you’re trying to translate an English idiom like “stealing my thunder,” you’ll now get a more accurate translation instead of a literal word-for-word translation, as Gemini will parse the context to capture what the idiom really means.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Google\nThis update is rolling out now in the U.S. and India, translating between English and nearly 20 languages, including Spanish, Arabic, Chinese, Japanese, and German. The update is available in the Translate app on Android, iOS, and on the web.\nGoogle is also expanding its language learning tools to almost 20 new countries, including Germany, India, Sweden, and Taiwan. English speakers can now practice German, while Bengali, Mandarin Chinese (Simplified), Dutch, German, Hindi, Italian, Romanian, and Swedish speakers can practice English. \nThe tech giant is also adding improved feedback so you can get helpful tips based on your speaking practice. \nAdditionally, Google is adding a feature that tracks how many days in a row you’ve been learning, making it easier to see your progress and stay consistent. While the tools were already designed to take on Duolingo, this new feature brings the experience even closer to the popular language-learning app.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Flaw in photo booth maker’s website exposes customers’ pictures",
    "url": "https://techcrunch.com/2025/12/12/flaw-in-photo-booth-makers-website-exposes-customers-pictures/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/photo-booth.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T15:37:36.000Z",
    "description": "A company that makes photo booths is exposing pictures and videos of its customers online thanks to a simple flaw in its website where the files are stored, according to a security researcher.   The...",
    "body": "\nA company that makes photo booths is exposing pictures and videos of its customers online thanks to a simple flaw in its website where the files are stored, according to a security researcher.  \nThe researcher, who goes by Zeacer, alerted TechCrunch to the security issue in late November after reporting the vulnerability in October to Hama Film, the photo booth maker that has franchise presence in Australia, the United Arab Emirates, and the United States, but did not hear back.\nZeacer shared with TechCrunch a sample of pictures taken from Hama Film’s servers, which showed groups of clearly young people posing in photo booths. Hama Film’s booths not only print out the photos like a typical photo booth, but booths also upload the customers’ photos to the company’s servers.\nVibecast, which owns Hama Film, has yet to respond to his messages alerting the company of the issues. Vibecast also hasn’t responded to several requests for comment from TechCrunch, nor did Vibecast’s co-founder Joel Park respond to a message we sent via LinkedIn.\nAs of Friday, the researcher said the company has still not fully resolved the security flaw and continues to expose customers’ data. As such, TechCrunch is withholding specific details of the vulnerability from publication.\nWhen Zeacer first found this flaw, he noted that it appeared that photos were deleted from the photo booth maker’s servers every two to three weeks. \nNow, he said, the pictures stored on the servers appear to get deleted after 24 hours, which limits the number of pictures exposed at any given time. But a hacker could still exploit the vulnerability he discovered each day and download the contents of every photo and video on the server. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBefore this week, Zeacer said at one point he saw more than 1,000 pictures online for the Hama Film booths in Melbourne. \nThis incident is the latest example of a company that, at least for a time, was not implementing certain basic and widely accepted security practices, such as rate-limiting. Last month, TechCrunch reported that government contractor giant Tyler Technologies was not rate-limiting its websites used for allowing courts to manage their jurors’ personal information. This meant anyone could break into any juror’s profile by running a computer script capable of mass-guessing their date of birth and their easy-to-guess numerical identifier. \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "With iOS 26.2, Apple lets you roll back Liquid Glass again — this time on the Lock Screen",
    "url": "https://techcrunch.com/2025/12/12/with-ios-26-2-apple-lets-you-roll-back-liquid-glass-again-this-time-on-the-lock-screen/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/iphone-air.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T20:45:00.000Z",
    "description": "Apple is releasing another tool to dial down Liquid Glass’ transparency with its release of iOS 26.2, out now. With the update, users will be able to control the transparency of the Lock Screen’s clock. The...",
    "body": "\nApple is releasing another tool to dial down Liquid Glass’ transparency with its release of iOS 26.2, out now. With the update, users will be able to control the transparency of the Lock Screen’s clock. The release follows an update that introduced a slider for controlling the opacity of Liquid Glass elements through the operating system, following user complaints that the changes made their iPhone or other Apple device too hard to read.\nLaunched with iOS 26, the new design language for Apple devices turns various interface elements like buttons, sliders, and notifications semi-transparent. The elements also refract light, giving them the optical qualities of glass.\nMeant to modernize Apple’s operating systems and potentially prepare for a world where the operating system moves to AI smart glasses, Liquid Glass received mixed reviews. Some found that the transparency made their device difficult to use, as it became tricky to read key items, like notifications or the name of an artist in Apple Music. In response to user complaints, Apple released a Liquid Glass tool in iOS 26.1 that allowed users to return their interface to a more “frosted” look, if desired.\nWith the slider for the Clock’s “glassiness,” Apple is again rolling back the transparency of the Liquid Glass update, but in the form of another user-controlled customization feature, instead of a global change.\nImage Credits:iPhone screenshot by TechCrunch\nThese tweaks are notable as they telegraph that perhaps Apple isn’t standing 100% behind the design overhaul as being perfect as is.\nThe timing of the change is worth noting, too. Earlier this month, Apple confirmed the design executive behind the Liquid Glass makeover, Alan Dye, was leaving the company for Meta. While it didn’t appear that Dye was pushed out, Apple replaced him with longtime Apple designer Stephen Lemay. \nUnlike Dye, Lemay’s career was spent in interface and interaction design — a skill set called for when it comes to fixing Liquid Glass, it can be argued.\n\niOS 26.2 brought other new features beyond the latest Liquid Glass tweak.\nAs in the betas, users can now create AirDrop codes to share with people not in their contacts, allowing them to become a “known” AirDrop contact for a 30-day period. The feature might make sense at work or in other scenarios where you need to share files or photos with someone not stored in your Contacts.\nAlso in iOS 26.2, the Reminders supports alarms; Apple News gains a Following tab at the bottom nav bar along with other navigation changes; Apple Music adds offline lyrics; and the Podcasts app adds AI-generated chapters for podcast episodes, a Podcast Mention feature for linking to other shows, and other changes. \nApple Watch owners will also now get a Sleep Score based on how well they slept and if they met their sleep goals. \nApple also released several important security updates across its flagship products on Friday, including iPhones, iPads, Macs, Apple TVs, and Apple Watches, to patch vulnerabilities used in an active hacking campaign.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Zevo wants to add robotaxis to its car-share fleet, starting with newcomer Tensor",
    "url": "https://techcrunch.com/2025/12/12/zevo-wants-to-add-robotaxis-to-its-car-share-fleet-starting-with-newcomer-tensor/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/tensor-car.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T14:52:19.000Z",
    "description": "Driverless cars are no longer restricted to the realm of sci-fi thanks to companies like Waymo deploying commercial robotaxi services in multiple cities. And a number of automakers, big and small, are trying...",
    "body": "\nDriverless cars are no longer restricted to the realm of sci-fi thanks to companies like Waymo deploying commercial robotaxi services in multiple cities. And a number of automakers, big and small, are trying to bring that same level of autonomy to personally owned vehicles over the next few years.\nIf that happens, what kinds of things could you do with a personal AV? Maybe you’ll be able to send it to pick up food or run errands — the hope of a company called Autolane. Or, if you’re Tesla CEO Elon Musk, you think owners will want to deploy their cars into the world to offer rides to other people, creating a tidy, nearly effortless side-hustle.\nHebron Sher, co-founder of Dallas-based Zevo, is eager to capitalize on all of the above. The company has been operating an EV-only car-share fleet for a little over a year, and it’s now adding robotaxis, starting with a new company called Tensor.\nTensor is kind of an odd duck. The startup sort of emerged earlier this year from a previous Silicon Valley startup called AutoX that also had operations in China, and boldly claims that it will be the first to sell a fully autonomous car to regular consumers — in 2026, no less. Zevo says it will purchase up to 100 of Tensor’s cars and add them to its network.\nThere aren’t a lot of details on timing, and Tensor still needs to show that it can build cars at any kind of scale and reliability, which are massive hurdles that have tripped up many other newcomers in recent years. (The company said in a statement that its “path to shipping is driven by the pacing of global regulatory approvals, not product limitations.) If it works, Zevo customers would essentially be able to borrow the Tensor AVs in what amounts to a sort of decentralized robotaxi service.\nThe announcement resembles the many heady-yet-ultimately-unmet promises that were made a decade ago, when the self-driving car hype first peaked. But with real robotaxis on the roads now, the idea seems a little more tangible this time.\n“Tensor’s vision is to build a future where everyone owns their own Artificial General Intelligence — a personal AGI that enables more time, freedom and autonomy,” Hugo Fozzati, Tensor’s chief business officer, said in a statement. “For us, this partnership with Zevo is not only just a batch sale of our vehicles, but also enables individuals and micro-entrepreneurs to participate and profit from AV business in this AI era.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIt won’t be Sher’s first bet on an unproven company. In October, Zevo announced a non-binding order of 1,000 vans from perpetually imperiled EV startup, Faraday Future. Faraday, which has struggled for a decade to make and sell its flagship FF91 luxury SUV, recently resorted to importing more affordable electric vans from China and assembling them in the U.S. The company is supposed to assemble the first of those later this month.\nSher’s willingness to bet on these companies stems from two reasons. One is cost: Tensor and Faraday Future have nonexistent and bad track records, respectively, and so they’re willing to cut an attractive deal. More importantly, Sher said, these companies are more willing than a major OEM to allow Zevo to tightly integrate with their vehicles’ software — a crucial factor if you’re going to allow peer-to-peer sharing, especially of robotaxis.\nNot only is it tougher to get legacy automakers to be similarly flexible, but Sher said their “tech freaking sucks.” With newcomers, he said, “the synergy of startup and startup, sort of mingling, commingling together, and saying, ‘Let’s build a solution side by side…’ I think I’ve really enjoyed that experience.”\nSher paints the Tensor deal as a win-win for both companies: Tensor gets an early customer and a shot to prove that its robocars are real and can do what it promises; Zevo gets a good deal and that deep software integration. \nBut, he admits it’s a “calculated risk.”\n“I think that’s what makes America great, you know, the fact that we do encourage startups to take risk,” he said.\nThis story has been updated to reflect that AutoX was headquartered in Silicon Valley.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Stanford’s star reporter takes on Silicon Valley’s ‘money-soaked’ startup culture",
    "url": "https://techcrunch.com/2025/12/11/stanfords-star-reporter-takes-on-silicon-valleys-money-soaked-startup-culture/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Screenshot-2025-12-11-at-4.37.19-PM.png?w=150",
    "tag": "Tech",
    "date": "2025-12-12T00:52:20.000Z",
    "description": "His reporting on a Stanford University president put Theo Baker on the map, but his upcoming book may cement his reputation as the rare young journalist willing to challenge Silicon Valley's startup machine.",
    "body": "\nTheo Baker is truly an outlier. \nWhile journalism as a major has seen shrinking enrollment for years and is even being dropped by some schools entirely, Baker, a senior at Stanford University, has doubled down on old-school investigative reporting, and it is paying off spectacularly.\nBaker first made headlines as a college freshman when his reporting for The Stanford Daily led to the resignation of Stanford president Marc Tessier-Lavigne. After uncovering allegations of research misconduct spanning two decades, Baker — just one month into college — found himself “receiving anonymous letters, conducting stakeouts, and tracking down confidential sources,” according to his publisher. Meanwhile, high-powered lawyers tried to discredit his work. By year’s end, Tessier-Lavigne had resigned, and Baker became the youngest-ever recipient of the George Polk Award, one of journalism’s most prestigious honors.\nShortly after, Warner Bros. and famed producer Amy Pascal won a competitive auction for the film rights to his story.\nBut if that scandal put Baker on the map, his upcoming book may cement his reputation as the rare young journalist willing to challenge Silicon Valley’s startup machine. \n“How to Rule the World,” out May 19 — three weeks before he graduates — promises an explosive look at how venture capitalists treat Stanford students as “a commodity,” wooing favored undergrads with slush funds, shell companies, yacht parties, and funding offers before they even have business ideas in their hunt for the next trillion-dollar founder.\n“I watched in real time as my peers were taught to cut corners and plied with enormous wealth by people who wanted to exploit their talent,” Baker, who turns 21 next month, tells Axios. Drawing on more than 250 interviews with students, CEOs, VCs, Nobel laureates, and three Stanford presidents, the book aims to expose what Baker describes to Axios as a “weird, money-soaked subculture that has so much influence over the rest of the world.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIt’s perhaps an unsurprising move from someone who grew up around top journalists. His father is New York Times chief White House correspondent Peter Baker, and his mother is The New Yorker’s Susan Glasser. While his peers chase venture capital funding and six-figure startup salaries, Baker spent his sophomore year reporting and took his junior year off to write, including two months at the Yaddo writers’ retreat.\nThat choice becomes even more striking against the backdrop of journalism’s current struggles. While traditional journalism programs fail to fill classes and media outfits face seemingly relentless layoffs, Baker represents something both exciting and increasingly uncommon: a star student betting his career on accountability journalism. Whether he’s a harbinger of renewed interest in investigative reporting remains to be seen, but we’d guess his book will capture the attention of plenty of college students — and it will almost certainly make waves in Silicon Valley while doing it.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "1X struck a deal to send its ‘home’ humanoids to factories and warehouses",
    "url": "https://techcrunch.com/2025/12/11/1x-struck-a-deal-to-send-its-home-humanoids-to-factories-and-warehouses/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/1X_NEO-Home-Duster.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T22:03:36.000Z",
    "description": "Robotics company 1X found some big potential buyers for its humanoid robots designed for consumers — the portfolio companies of one of its investors. The company announced a strategic partnership to make...",
    "body": "\nRobotics company 1X found some big potential buyers for its humanoid robots designed for consumers — the portfolio companies of one of its investors.\nThe company announced a strategic partnership to make thousands of its humanoid robots available for EQT’s portfolio companies on Thursday. EQT is a large Swedish multi-asset investor, and its venture fund EQT Ventures, is one of 1X’s backers.\nThis deal involves shipping up to 10,000 1X Neo humanoid robots between 2026 and 2030 to EQT’s more than 300 portfolio companies with a concentration on manufacturing, warehousing, logistics, and other industrial use cases.\n1X will sign individual deals with each of EQT’s interested portfolio companies, 1X confirmed to TechCrunch. \nThis partnership is particularly interesting because 1X’s Neo has been marketed as a humanoid for personal use and tagged as the “first consumer-ready humanoid robot designed to transform life at home.” Unlike some of 1X’s peers, like Figure, it has not been marketed as a bot for commercial purposes.\n1X does have a robot designed for industrial purposes, Eve Industrial, but this deal specifically involves the Neo humanoid.\nWhen the company opened up preorders for the $20,000 robot in October, the announcement was focused on how the robot would operate in someone’s home from descriptions of the different chores that the robot is able to perform and how it interacts with people.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis deal is quite a different use case.\nThat’s likely because humanoids for the home will remain a hard sell for quite some time while industrial use cases are an easier sell. The $20,000 price tag automatically limits the potential pool of consumer customers too.\nThe Neo specifically also comes with a privacy element that would be hard to swallow for many people — human operators from 1X are able to look through the robots eyes into someone’s home.\nHumanoids also come with potential safety issues around pets and small children due to their size and instability. Multiple VCs and scientists in the robotics field told TechCrunch this summer that humanoid adoption wouldn’t be for multiple years, if not a decade away.\nThe company declined to share how many preorders it received for its Neo bot but a spokesperson said preorders “far exceeded” the company’s goal.\nFounded in 2014, 1x has since raised more than $130 million in venture capital from firms, including EQT Ventures, Tiger Global, and the OpenAI Startup Fund, among others.\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Riding onboard with Rivian’s race to autonomy",
    "url": "https://techcrunch.com/2025/12/12/riding-onboard-with-rivians-race-to-autonomy/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/rj-scaringe.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T21:44:50.000Z",
    "description": "The robot swerved through the cafeteria of Rivian’s Palo Alto office, shelves adorned with chilled canned coffees — until it didn’t. Five minutes later, a man carefully pushed it out of everyone’s way, the...",
    "body": "\nThe robot swerved through the cafeteria of Rivian’s Palo Alto office, shelves adorned with chilled canned coffees — until it didn’t. Five minutes later, a man carefully pushed it out of everyone’s way, the words “I’m stuck” flashing yellow on the poor droid’s screen.\nIt was an inauspicious start to Rivian’s “Autonomy & AI Day,” a showcase for the company’s plans to make its vehicles capable of driving themselves. Rivian doesn’t make the cafeteria robot and isn’t responsible for its abilities, but there was a familiar message in its foibles: this stuff is hard.\nHours later, as I rode in a 2025 R1S SUV during my 15-minute demo of Rivian’s new self-described “Large Driving Model,” I was reminded of that message.\nThe EV equipped with the automated-driving software drove myself and two Rivian employees on a switchback route near the company’s campus. As we glided past Tesla’s engineering office, I noticed a Model S in front of us slow to turn into the rival company’s lot. The R1S eventually noticed this, too, braking hard just before the Rivian employee nearly intervened.\nDuring my demo drive, there was one actual disengagement. The employee in the driver’s seat took over as we passed through a one-lane section of road due to some tree-trimming. Minor stuff overall. But it wasn’t exactly rare either; I spotted multiple other demo rides that had disengagements, too.\nThe rest of the drive went well enough for software that is not ready to be shipped, especially when you consider that Rivian threw out its old rules-based driver assistance system and adopted an end-to-end approach — which is how Tesla developed Full Self-Driving (Supervised). It stopped at stoplights, it handled turns, it slowed for speed bumps, all without programmed rules telling it to do these things.\nA quiet pivot in 2021\nImage Credits:Rivian\nRivian’s old system “was all very deterministic, and it was all very structured,” CEO RJ Scaringe said in an interview Thursday. “Everything that the vehicle did was the result of a prescribed control strategy written by humans.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nScaringe said that when Rivian saw transformer-based artificial intelligence taking off in 2021, he quietly “reconstituted the team and started with a clean sheet and said, let’s design our self-driving platform for an AI-centric world.”\nAfter spending “a lot of time in the basement,” Rivian launched the new ground-up driving software in 2024 on its second-generation R1 vehicles, which use Nvidia’s Orin processors. \nScaringe said it was only recently that his company started to see dramatic progress “once the data started really pouring in.”\nRivian is betting it can train its Large Driving Model (LDM) on fleet data so quickly that it will allow the company to roll out what it calls “Universal Hands-Free” driving in early 2026. That means Rivian owners will be able to take their hands off the wheel on 3.5 million miles of roads in the U.S. and Canada (so long as there are visible painted lines). In the back half of 2026, Rivian will allow “point-to-point” driving, or the consumer version of the demo we received Thursday.\nThe ‘eyes off’ to ‘hands off’ challenge\nBy the end of 2026, after Rivian has started shipping its smaller, more affordable R2 SUVs, it will ditch the Nvidia chips and outfit those vehicles with a new custom autonomy computer unveiled Thursday. That computer, plus a lidar sensor, will eventually allow drivers to take their hands and eyes off the road. True autonomy — where a driver doesn’t have to worry about re-taking control of the vehicle — lies well beyond that and will largely depend on how fast Rivian can train its LDM.\nThis rollout introduces a near-term challenge for Rivian. The new autonomy computer and lidar won’t be ready until months after the R2 goes on sale. If customers want a vehicle that can handle eyes-off driving (or more), they’ll have to wait. But the R2 is a crucial product for Rivian, and the company needs it to sell well — especially in the wake of declining sales of its first-generation vehicles.\n“When tech is moving as fast as it is, there’s always going to be some level of obsolescence, and so what we want to do here is to be really direct” about what’s coming, Scaringe said. The early R2s will still get Rivian’s promised “point-to-point” driving, which will be based on the new software and will be hands-off but not eyes-off.\n“So [if] you’re buying an R2 and you buy it in the first nine months, it’s just going to be more constrained,” he said. “I think what will happen is some customers will say ‘that matters a lot to me, and I’m going to wait.’ And some will say ‘I want the newest, best things now, and I’m going to get the R2 now, and maybe I’ll trade it in a year or two, and I’ll get the next version later. Fortunately, there’s so much demand backlog for R2 that we think, by being upfront with this, customers can make the decision themselves.”\n“In a perfect world, everything times at the same time, but the timeline of the vehicle and the timeline of the autonomy platform are just not perfectly aligned,” he said.\nWhen I first interviewed Scaringe in 2018, before Rivian even showed what its vehicles looked like, he shared a goal that still rattles around my head. He wanted to make Rivian’s vehicles so capable of driving themselves that: “if you go for a hike, and you start at one point and you finish at another point, you have the vehicle meet you at the end of the trail.”\nIt was the kind of pie-in-the-sky promise about self-driving cars that was all the rage seven years ago, but it stuck with me at least because it was something that felt true to Rivian’s whole brand of aspirational adventure.\nScaringe told me Thursday he still thinks it’s possible for Rivian to enable a use case like that in the next few years. It certainly won’t happen until the company tests and builds its more-capable R2 vehicles, which is at least a year away in a best-case scenario.\n“We could [do that]. It’s not been a huge focus,” he said. That could change as the company gets closer to level 4 autonomy, though, since by then the company will have its LDM trained on trickier roads without guiding features like lane lines.\n“Then, it becomes a bit of a like, what’s the ODD [operational design domain]? Dirt roads, off road? Easy,” he said. Just don’t expect a Rivian driving itself up Hell’s Gate in Moab.\n“We’re not putting any resources into rock crawling autonomously,” he said. “But in terms of getting to the trail head? For sure.”\n"
  },
  {
    "title": "Retro, a photo-sharing app for friends, lets you ‘time-travel’ through your camera roll",
    "url": "https://techcrunch.com/2025/12/12/retro-a-photo-sharing-app-for-friends-lets-you-time-travel-through-your-camera-roll/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/07/Retro.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-12T16:53:28.000Z",
    "description": "Retro, a friend-focused photo-sharing app with roughly a million users, is adding a new feature that lets you time-travel through your old photo memories from your phone’s camera roll. While the app today...",
    "body": "\nRetro, a friend-focused photo-sharing app with roughly a million users, is adding a new feature that lets you time-travel through your old photo memories from your phone’s camera roll. While the app today offers a way to share photos of what’s happening during your week with a private group of friends, or create shared albums, this latest addition, dubbed “Rewind,” is private to you — unless you choose to share the photos with others.\nRetro’s co-founder, Nathan Sharp, explains that the idea for Rewind was inspired by a feature the app already offered and was proving popular.\nToday, at the end of the row showcasing the photos your friends shared during the week, there’s a card you can tap that will let you view your own photos from that same week a year ago. \nHowever, that option wasn’t accessible to newer Retro users, since they hadn’t yet uploaded enough photos to the app to take advantage of the photo memories feature.\nImage Credits:Retro\n“If you’re a new user, you don’t really have the opportunity to go time-travel through your memories in this way,” said Sharp, who had spent over six years at Meta working on products like Instagram Stories and Facebook Dating, before leaving to found his own photo-sharing startup with Ryan Olson, Retro’s CTO, in 2022.\n“The other problem that we saw was that people take more photos than ever, but they actually do less with that volume of photos than ever before. So it’s almost as if those photos go into the ether,” he added.\nThe addition, to some extent, is pushback against the growing trend of AI-generated content and “for you” feed-style algorithms.\n“As people engage with those platforms more and more, something that has to be true and will be true is that people will still want to see more of their friends,” Sharp says. “The photos and videos you take will need to find a place where they can reach the intended audience.”\nImage Credits:Retro\nAlthough nearly half (45.7%) of Retro’s users participate in the app on a daily basis, the Rewind feature could boost that engagement even higher.  \nTo try Rewind, you can either launch it from the end of the row of shared photos, just past the “this week in” card, or from its more prominent position as the middle tab in the bottom navigation bar. \nWhen launched, there’s a haptic response as the screen starts cycling through the older photos pulled from your camera roll. These memories aren’t being shared, but you can tap on the share icon if you feel inspired to send them to a friend or post them. In addition, you can opt to hide photos you’d rather not see (like those of an ex), or tap a “dice” icon to be taken to a random memory instead.\nAs the iPod-inspired dial clicks back into your past, you’ll feel a subtle vibration as each new memory loads. You can also spin the dial to move forward or backward in time, watching the photos from months and years past flip by on the screen, pausing at those you want to view longer or share.\nImage Credits:Retro screenshot/TechCrunch\nYou can press and hold on any photo to see it uncropped, and when you share a photo, a timestamp is added at the bottom so friends will understand it’s not a new pic. \nWhile screenshots won’t appear in this photo archive, other photos — like those of receipts or whiteboards at work will show up, as they could still be interesting memories to you. (And if you come across a photo you don’t need to keep, deleting it from the app will also delete it from your camera roll.)\nThe idea to look back at older photo memories is hardly new, of course.\nIn the past, a startup called Timehop popularized the idea of doing something more with our growing digital photo archives by allowing users to revisit old photos through its simple mobile app. Later, Facebook copied the idea for its “On This Day” feature, and photo-hosting services like Google Photos and Apple Photos added memories features of their own.\nStill, Sharp doesn’t believe these will be direct competitors for Retro. Facebook, over the years, has downranked friends’ content as its feed became filled with links, news, and ads. Meanwhile, people tend to think of Apple’s and Google’s photo apps more as utilities for managing and storing photos, not as social apps like Retro.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  }
]