[
  {
    "title": "Stellantis teams up with Pony.ai to develop robotaxis in Europe ",
    "url": "https://techcrunch.com/2025/10/17/stellantis-teams-up-with-pony-ai-to-develop-robotaxis-in-europe/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/stellantis-pony-ai.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T15:12:55.000Z",
    "description": "\nAutomaker Stellantis and Chinese autonomous vehicle company Pony.ai have signed a non-binding agreement to build robotaxis for deployment in Europe. ",
    "body": "\nAutomaker Stellantis and Chinese autonomous vehicle company Pony.ai have signed a non-binding agreement to build robotaxis for deployment in Europe.  \nThe collaboration will integrate Pony’s self-driving software into Stellantis’s electric medium-size van platform, which is built with advanced sensors to support autonomous vehicles. \nThe companies plan to first deploy test vehicles based on the Peugeot e-Traveller model. Testing will begin in Luxembourg, Pony’s European headquarters, in the coming months, with plans to roll out more vehicles across European cities starting in 2026.  \nThe tie-up comes a few months after Pony announced a partnership with Uber to deploy in international markets, including Europe and the Middle East. It also comes after the company received an autonomous vehicle testing permit from Luxembourg in April. \nAs Pony.ai works to expand beyond its existing markets in China and carve out market share in Europe, the company is also chasing a second IPO. Already listed on the Nasdaq, Pony is also pursuing a secondary listing on the Stock Exchange of Hong Kong.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stellantis teams up with Pony.ai to develop robotaxis in Europe ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/stellantis-pony-ai.jpeg?w=150"
      ],
      "datePublished": "2025-10-17T15:12:55.000Z",
      "dateModified": "2025-10-17T15:12:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reddit expands its AI-powered search to five new languages",
    "url": "https://techcrunch.com/2025/10/16/reddit-expands-its-ai-powered-search-to-five-new-languages/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/reddit-ipo-v2.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-17T04:18:03.000Z",
    "description": "\nIn Brief\nPosted:\n9:18 PM PDT · October 16, 2025\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nReddit announced Thursday that i",
    "body": "\nIn Brief\nPosted:\n9:18 PM PDT · October 16, 2025\n\nImage Credits:TechCrunch\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nReddit announced Thursday that it is expanding its AI-powered search experience to five new languages: French, German, Spanish, Italian, and Portuguese. With this expansion, the feature is now available in countries like Brazil, France, Germany, Spain, Mexico, and Italy.\nUsers who have set one of these languages as their default, instead of English, can now chat with the AI in question-and-answer format. Reddit uses a Google AI model to power the feature.\nReddit first debuted AI-powered search last year and has been working to expand it in different ways. The feature is part of Reddit Answers, which lives alongside the platform’s traditional search.\nReddit CEO Steve Huffman said in August that Reddit search has more than 70 million weekly users, while Reddit Answers is used by more than 6 million people. He also discussed plans to unify the search experience during the company’s quarterly earnings call. \nQ&A-style search and chat interfaces have been gaining popularity since ChatGPT integrated web search. Incumbent search engines like Google and Brave have introduced similar features to improve user engagement and retention. Newer startups like Perplexity have also gained steam with chat-based search interfaces.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Apps\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reddit expands its AI-powered search to five new languages",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/reddit-ipo-v2.webp?w=150"
      ],
      "datePublished": "2025-10-17T04:18:03.000Z",
      "dateModified": "2025-10-17T04:18:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp will curb the number of messages people and businesses can send without a response",
    "url": "https://techcrunch.com/2025/10/17/whatsapp-will-curb-the-number-of-messages-people-and-businesses-can-send-without-a-response/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T14:11:33.000Z",
    "description": "\nWhatsApp is attempting to solve its spam problem by putting a curb on how many messages individual users and businesses can send to unknown people wi",
    "body": "\nWhatsApp is attempting to solve its spam problem by putting a curb on how many messages individual users and businesses can send to unknown people without getting a response.\nWhile the app started as an easy way to send messages to personal contacts, over time, it has become more complex with groups, communities, and business messaging. With those changes, people are getting more messages than ever, and it is hard to catch up with all of them.\nAll messages users and businesses send to others will count against this new per-month limit, unless they get a response. For instance, if you meet someone at a conference and send three messages, that counts against the limit.\nWhatsApp hasn’t said what the limit will be, as it’s testing different limits during this time.  \nHowever, when a business or an individual is about to hit the limit, the app will display a warning to those users with a pop-up showing the count, so they can avoid getting blocked from sending messages.\nThe company told TechCrunch that this test will be live in multiple countries in the coming weeks. It also said that average users won’t usually hit the limit, and their messaging experience won’t be affected. Instead, the controls are designed to be effective against people and businesses that blast messages and spam people.\nPersonally, when I look at my WhatsApp inbox, I often find over 50 unread messages. When I try to see who sent them, a number of them are from businesses and unknown people. People around me have had similar experiences as WhatsApp acts as a multi-use communication tool for a market like India, where I’m based. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOver the last year, WhatsApp has tried to curb some of this spammy behaviour through tools and guardrails. In July 2024, the company started testing limits on how many marketing messages a business can send to people in a month. In 2024, it started floating an option for users to unsubscribe from marketing messages from businesses. This way, they can receive updates or get support from a business without getting spammed. \nEarlier this year, WhatsApp started experimenting by putting a limit on the number of broadcast messages users and businesses can send to others. The company said that it has started expanding this experiment in more than a dozen countries, including India, one of the company’s biggest markets with over 500 million users.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp will curb the number of messages people and businesses can send without a response",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150"
      ],
      "datePublished": "2025-10-17T14:11:33.000Z",
      "dateModified": "2025-10-17T14:11:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crypto’s next chapter with Solana’s Anatoly Yakovenko at TechCrunch Disrupt 2025",
    "url": "https://techcrunch.com/2025/10/17/cryptos-next-chapter-with-solanas-anatoly-yakovenko-at-techcrunch-disrupt-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/disrupt-2022-anatoly-yakovenko.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T15:00:00.000Z",
    "description": "\nSolana Labs CEO and Solana co-founder Anatoly Yakovenko takes the Disrupt Stage at TechCrunch Disrupt 2025, happening October 27–29 at San Francisco’",
    "body": "\nSolana Labs CEO and Solana co-founder Anatoly Yakovenko takes the Disrupt Stage at TechCrunch Disrupt 2025, happening October 27–29 at San Francisco’s Moscone West, to chart where crypto goes next — from the meme coin frenzy to real-world finance and everything in between.\nThis is one fintech conversation you will not want to miss. Save up to $624 on your pass before the sale ends tonight at 11:59 p.m. PT. Groups save up to 30% on passes.\n\nSharing lessons on scaling blockchain and crypto adoption at Disrupt\nYakovenko will unpack Solana’s breakout year, the growing demand for scalable, low-cost blockchain infrastructure, and how the network is powering a new generation of decentralized apps. He’ll also share lessons from building through market cycles, what it takes to drive developer adoption at scale, and why he’s betting big on crypto’s mainstream future.\nAs one of the most technically respected voices in blockchain, Yakovenko brings more than a decade of engineering experience — from Qualcomm to founding one of the world’s fastest-growing blockchain ecosystems.\nPowering the future of finance and the rise of Solana\nAnatoly Yakovenko is the CEO of Solana Labs and co-founder of Solana, an open, decentralized, high-performance blockchain powering next-gen finance and applications. Before founding Solana, he spent over a decade at Qualcomm as a systems engineer. He holds a B.S. in Computer Science from the University of Illinois Urbana–Champaign.\nRegister before tonight to save up to $624 and hear this fintech talk live\nWith more than 10,000 founders, investors, and operators set to gather at TechCrunch Disrupt 2025, this is a must-see session for anyone building in blockchain, fintech, or infrastructure. Attendees will also have access to 200+ sessions, 250+ top tech voices, and more than 300 showcasing startups across the venue.\nRegister before tonight at 11:59 p.m. PT to save up to $624 on your pass. These are the final hours to register at the biggest savings before Disrupt doors open. Bringing your team? Save up to 30% on group passes. Lock in group savings here.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crypto’s next chapter with Solana’s Anatoly Yakovenko at TechCrunch Disrupt 2025",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/10/disrupt-2022-anatoly-yakovenko.jpg?w=150"
      ],
      "datePublished": "2025-10-17T15:00:00.000Z",
      "dateModified": "2025-10-17T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Less than 24 hours to spotlight your startup at TechCrunch Disrupt 2025 in front of 10,000 tech leaders and VCs ",
    "url": "https://techcrunch.com/2025/10/17/less-than-24-hours-to-spotlight-your-startup-at-techcrunch-disrupt-2025-in-front-of-10000-tech-leaders-and-vcs/",
    "image": "https://techcrunch.com/wp-content/uploads/2014/03/8697162730_891d808f92_o.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T14:30:00.000Z",
    "description": "\n\t\n\t\tImage Credits:TechCrunch\t\n\t\n\t\t\t\t\t\t7:30 AM PDT · October 17, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nYou’re looking for big ways to grow your startup, whether that m",
    "body": "\n\t\n\t\tImage Credits:TechCrunch\t\n\t\n\t\t\t\t\t\t7:30 AM PDT · October 17, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nYou’re looking for big ways to grow your startup, whether that means securing investors, landing enterprise deals, or generating a nonstop pipeline of leads. This is your final moment. \nYou have less than 24 hours — and only a couple of tables left — to lock in the most valuable growth opportunity of the year at TechCrunch Disrupt 2025. \nPicture this: more than 10,000 tech leaders, investors, decision-makers, and innovators walking through the Expo Hall. They stop at your table. They see your brand across the venue. They connect with you in multiple ways. Book now before a competitor takes the final tables. Exhibit tables close tonight at 11:59 p.m. PT.\nImage Credits:Eric Slomonson, The Photo Group\nHere is what you get with your table\n\nA 6’ x 30” branded exhibit table in the high-traffic Expo Hall for all three days. \n\n\n10 team passes (5 Attendee and 5 Expo+) for nonstop access and networking. \n\n\nFeatured branding across TechCrunch channels including the event page, app, venue signage, sponsor announcements, and more. \n\n\nAccess to the Disrupt press list, lead-gen tools, and exclusive founder data. \n\n\nBrand mentions during key event moments and the closing ceremony. \n\n\nA direct path to traction, investor interest, and game-changing conversations. \n\nLearn more about exhibitor benefits here. \nWhat you lose if you don’t exhibit at Disrupt 2025 \n\nVisibility where it counts: No table means no chance to showcase your product to thousands of investors, partners, and press walking the Expo Hall. \n\n\nAccess to key decision-makers: Without passes, your team misses direct connections with high-level founders, investors, and enterprise leaders. \n\n\nBrand amplification across the ecosystem: Without placement, you miss exposure across TechCrunch channels before, during, and after the event. \n\n\nA smart investment skipped: For just $10,000, you unlock massive reach, high-quality networking, and powerful lead-generation tools. Skipping this leaves serious value behind. \n\nLess than 24 hours to book your table \nYour competitors are circling the same opportunity. Act now to own the attention, the leads, and the momentum at the tech epicenter of the year, bringing together 10,000+ founders, VCs, key decision-makers, and innovators. Book your table now. Exhibit tables close tonight at 11:59 p.m. PT.\nImage Credits:Halo Creative / Halo Creative\n\n\t\t\t\n\tTopics\n\t\n\t\tAI, Biotech & Health, Climate, Fintech, Fundraising, Robotics, Space, Startups, TC, TechCrunch Disrupt 2025, Transportation, Venture\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Less than 24 hours to spotlight your startup at TechCrunch Disrupt 2025 in front of 10,000 tech leaders and VCs ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2014/03/8697162730_891d808f92_o.jpg?w=150"
      ],
      "datePublished": "2025-10-17T14:30:00.000Z",
      "dateModified": "2025-10-17T14:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo dips its wheels back into delivery, this time with DoorDash",
    "url": "https://techcrunch.com/2025/10/16/waymo-dips-its-wheels-back-into-delivery-this-time-with-doordash/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Waymo-DoorDash-.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T19:56:33.000Z",
    "description": "\nThe sprawling metropolis of Phoenix continues to be a testbed for Waymo, and not just on the technical front. The Alphabet-owned company has used its",
    "body": "\nThe sprawling metropolis of Phoenix continues to be a testbed for Waymo, and not just on the technical front. The Alphabet-owned company has used its first testing and commercial market to experiment with its business model, too, including delivery.\nWaymo is known for its robotaxis, but it has tested how its tech could be used for delivery. The company previously tapped UPS and Uber Eats for pilot programs, and it put considerable staff and resources toward developing self-driving trucks under its Waymo Via arm, before shuttering that program in 2023 to focus on robotaxis.\nNow it seems Waymo is ready to test the delivery waters through a strategic, multi-year partnership with DoorDash. Waymo doesn’t have any other active delivery-focused testing, operations, or partnerships, according to a company spokesperson.\nThe partnership will match DoorDash customers ordering food and groceries within a 315-square-mile area of Phoenix with a self-driving Waymo, the company wrote in a blog post.\nNot every DoorDash order will result in a Waymo delivery. Initially, the Waymo delivery service will deliver orders from DashMart — DoorDash’s convenience, grocery, and retail stores. The companies said that, over time, more local Phoenix merchants and a wider variety of offerings will be added.\nDavid Richter, vice president of business and corporate development at DoorDash, said the deal with Waymo will give customers a “new and delightful experience, while advancing our vision for a multi-modal autonomousfuture of local commerce.”\nDoorDash isn’t new to the autonomous vehicle technology arena. The company has partnered with sidewalk delivery bot company Serve Robotics to cover parts of Los Angeles. It also has its own in-house autonomous vehicle tech team that developed and produced an autonomous delivery bot called Dot. The delivery bot, which was revealed in September, is being tested in the Phoenix area.\nThe deal with Waymo won’t involve DoorDash’s Dot vehicle, however. Instead, food or groceries will be placed in the trunk of a Waymo vehicle — a driverless Jaguar I-Pace that will navigate on its own to the customer. From here, the customer will have to retrieve the items from the trunk via the DoorDash app. \nThis last step, which requires the customer to walk out to the car and grab the delivered items, will be the big test for both companies, as they try to determine whether the novelty of receiving groceries delivered by an autonomous vehicle outweighs the convenience of a human handing over the items at their door. \n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo dips its wheels back into delivery, this time with DoorDash",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Waymo-DoorDash-.jpg?w=150"
      ],
      "datePublished": "2025-10-16T19:56:33.000Z",
      "dateModified": "2025-10-16T19:56:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EFF, unions sue Trump administration over alleged mass social media surveillance of legal residents",
    "url": "https://techcrunch.com/2025/10/16/eff-unions-sue-trump-administration-over-alleged-mass-social-media-surveillance-of-legal-residents/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/05/hacking-surveillance1.png?w=150",
    "tag": "Tech",
    "date": "2025-10-16T19:50:50.000Z",
    "description": "\n\t\n\t\tImage Credits:Bryce Durbin/TechCrunch\t\n\t\n\t\t\t\t\t\t12:50 PM PDT · October 16, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nDigital rights group the Electronic Frontier Found",
    "body": "\n\t\n\t\tImage Credits:Bryce Durbin/TechCrunch\t\n\t\n\t\t\t\t\t\t12:50 PM PDT · October 16, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nDigital rights group the Electronic Frontier Foundation (EFF) filed a lawsuit on Thursday against the Trump administration over the government’s alleged social media monitoring of people who are lawfully living in the United States.\nThe suit contends that the government is using AI and other methods to watch the social media posts of virtually every single non-citizen who is in the United States legally and on a valid visa, as well as many people who have obtained permanent resident status. The U.S. government is, according to these allegations, looking for posts that express views that the current government disfavors.\nThe lawsuit states that the list of forbidden posts include those that criticize the American culture and the U.S. government; that express antisemitic/pro-Palestine support, including support of university protests on the matter; those that rationalize or make light of Charlie Kirk’s murder; or that criticize the Trump administration or its actions.\nThe EFF also alleges that the government is threatening non-citizens with punishments, which includes revoking their visas to immigration confinement.\nThe lawsuit points to posts on the State Department’s X account. This includes the currently pinned thread documenting the visas that the department revoked over comments about Charlie Kirk.\n\nThe United States has no obligation to host foreigners who wish death on Americans.The State Department continues to identify visa holders who celebrated the heinous assassination of Charlie Kirk. Here are just a few examples of aliens who are no longer welcome in the U.S.:— Department of State (@StateDept) October 14, 2025\n\nThe lawsuit was filed in the U.S. District Court for the Southern District of New York on behalf of the auto union, teachers union, and communication workers union.\nThe EFF’s suit claims that these punitive actions, as well as the “viewpoint based” surveillance itself, is an unlawful violation of freedom of speech of these unions’ members.\nThe full lawsuit can be found here.\n\n\t\t\t\n\tTopics\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EFF, unions sue Trump administration over alleged mass social media surveillance of legal residents",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2016/05/hacking-surveillance1.png?w=150"
      ],
      "datePublished": "2025-10-16T19:50:50.000Z",
      "dateModified": "2025-10-16T19:50:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta previews new parental controls for its AI experiences",
    "url": "https://techcrunch.com/2025/10/17/meta-previews-new-parental-controls-for-its-ai-experiences/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2225880947.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T10:00:00.000Z",
    "description": "\n\t\n\t\tImage Credits:Getty Images\t\n\t\n\t\t\t\t\t\t3:00 AM PDT · October 17, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta on Friday previewed its upcoming parental control feature",
    "body": "\n\t\n\t\tImage Credits:Getty Images\t\n\t\n\t\t\t\t\t\t3:00 AM PDT · October 17, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta on Friday previewed its upcoming parental control features for teens’ conversations with AI characters on its platforms. The features, which will be rolled out next year, include the ability to block certain characters and monitor conversation topics.\nStarting in the coming months, parents will be able to turn off chats with AI characters entirely for teens. This action won’t block access to the Meta AI chatbot — the company’s general-purpose AI chatbot — which will only discuss age-appropriate content.\nParents will also be able to turn off chats with individual characters if they prefer more selective control. Plus, they will receive information about the topics teens are discussing with AI characters and Meta AI.\nThe company said it plans to roll out these controls on Instagram early next year. They will be available in English in the U.S., U.K., Canada, and Australia.\n“We recognize parents already have a lot on their plates when it comes to navigating the internet safely with their teens, and we’re committed to providing them with helpful tools and resources that make things simpler for them, especially as they think about new technology like AI,” the company said in a post written by Instagram head Adam Mosseri and newly appointed Meta AI head Alexandr Wang.\nEarlier this week, Meta said that its content and AI experiences for teens will follow a PG-13 movie rating standard and will avoid sensitive topics such as extreme violence, nudity, and graphic drug use.\nThe company added that currently, teens are only allowed to interact with a limited number of characters that follow age-appropriate content guidelines. Parents can also set time limits on teens’ interactions with AI characters. Earlier this year, Instagram announced that it is using AI to identify attempting to skirt age limits by faking their age on the app.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIn the past few weeks, multiple platforms, including OpenAI, Meta, and YouTube, have released tools and controls focused on teen safety. These changes come amid growing concerns about the impact of social media on teen mental health and lawsuits against AI companies that allege they played a part in teen suicides.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta previews new parental controls for its AI experiences",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2225880947.jpg?w=150"
      ],
      "datePublished": "2025-10-17T10:00:00.000Z",
      "dateModified": "2025-10-17T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kayak launches an ‘AI Mode’ for travel questions, search, and bookings",
    "url": "https://techcrunch.com/2025/10/16/kayak-launches-an-ai-mode-for-travel-questions-search-and-bookings/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Desktop1280-1439-3.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T19:23:07.000Z",
    "description": "\nTravel search engine Kayak will now allow users to research trips ahead of booking using AI. The company this week launched an “AI Mode” feature that",
    "body": "\nTravel search engine Kayak will now allow users to research trips ahead of booking using AI. The company this week launched an “AI Mode” feature that lets users ask travel-related questions as well as compare and book flights, hotels, and cars, through an AI chatbot integrated on the company’s website.\nThe feature is currently available across both desktop and mobile web, and takes advantage of Kayak’s integration with ChatGPT to deliver contextual results. \nThe rollout follows the company’s April launch of Kayak.ai, built as a testing ground for working with AI technology. That site also combined Kayak’s data and tools with OpenAI’s technology, letting its tech team try out AI features ahead of bringing them over to Kayak.com\nEssentially, the AI Mode feature offers the same functionality as the Kayak.ai website but is now built directly into Kayak’s website. The company suggests users could ask the chatbot for travel ideas, like locations to fly to for under a certain price point, the best deals to a preferred destination, comparing hotel amenities, finding nonstop flights and rental car options, and more.\nImage Credits:Kayak\nPlus, users can ask the AI more open-ended questions, like “I want to party for NYE — where should I go?” to get recommendations without having specific destinations in mind. Or they could learn when the best time to fly somewhere would be, based on ticket prices. (Kayak has shared other AI prompt ideas on its own blog.)\nThe feature could be useful in helping consumers in the earlier stages of travel planning, when they’re just exploring ideas. However, it remains to be seen if AI users readily convert to paying customers using these methods. \nAI Mode is initially available in English in the United States but will expand to other countries and languages later in the month. The company also plans to roll out the feature to more platforms and add support for voice-based requests “soon.”\nImage Credits:Kayak\nTravel is an area that’s being explored by AI providers and travel companies alike, as online booking can be a frustrating and tedious experience for consumers as it stands today. To test consumer demand for AI solutions, OpenAI recently announced deals with travel companies like Expedia and Booking.com (the latter is also owned by Kayak’s parent company, Booking Holdings). As a result, those services can now operate as apps inside ChatGPT.\nBy comparison, Kayak’s decision to run the AI chatbot on its own site could provide the company with more direct access to consumer insights about the AI’s use.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kayak launches an ‘AI Mode’ for travel questions, search, and bookings",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Desktop1280-1439-3.jpg?w=150"
      ],
      "datePublished": "2025-10-16T19:23:07.000Z",
      "dateModified": "2025-10-16T19:23:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VC legend Ron Conway quits Salesforce Foundation after Benioff’s National Guard comments",
    "url": "https://techcrunch.com/2025/10/16/vc-legend-ron-conway-quits-salesforce-foundation-after-benioffs-national-guard-comments/",
    "image": "https://techcrunch.com/wp-content/uploads/2017/09/ron-conway-147a4106.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T20:57:45.000Z",
    "description": "\nRon Conway, the founder of venture firm SV Angel, known for its early investments into Google, Airbnb, and Meta, has resigned from the Salesforce Fou",
    "body": "\nRon Conway, the founder of venture firm SV Angel, known for its early investments into Google, Airbnb, and Meta, has resigned from the Salesforce Foundation, the New York Times reported. The resignation follows Salesforce CEO Marc Benioff saying last week that he “fully supported” President Trump and proposing that National Guard troops should patrol San Francisco streets to combat crime and homelessness.\nIn an interview with the New York Times last week, Benioff argued that San Francisco needs “a show of force” and called for deploying the National Guard to address what he described as the city’s deteriorating conditions. He also praised Elon Musk’s government efficiency efforts and said that he wasn’t keeping up with reports on immigration raids or Trump’s attacks on the press, despite owning the news magazine Time, which he purchased in 2018.\nConway has been on the board of the Salesforce Foundation, whose mission is to support education and workforce development for disadvantaged youth, for a decade. The philanthropic organization donated $36 million in 2023 and ended that year with $400 million in assets, according to tax filings, the New York Times reported.\nBenioff and Conway have been friends for 25 years and shared left-leaning political views for the majority of that time. But the Salesforce CEO’s current ideological viewpoints upset Conway.\n“It saddens me immensely to say that with your recent comments, and failure to understand their impact, I now barely recognize the person I have so long admired,” Conway wrote on Thursday in an email to Benioff obtained by the New York Times.\nA Salesforce spokesperson confirmed to TechCrunch that Conway has resigned. “We have deep gratitude for Ron Conway and his incredible contributions to the Salesforce Foundation Board for over a decade,” the spokesperson said. \nBenioff is one of the many high-profile tech leaders and investors who, despite having previously supported the Democratic Party, have now voiced their support for Trump. The rift between Benioff and Conway unfolded during Salesforce’s Dreamforce conference, one of the largest events held annually in San Francisco.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nNeither Salesforce nor Conway immediately responded to a request for comment.\nUpdate: The post has been updated with a statement from a Salesforce spokesperson.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VC legend Ron Conway quits Salesforce Foundation after Benioff’s National Guard comments",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2017/09/ron-conway-147a4106.jpg?w=150"
      ],
      "datePublished": "2025-10-16T20:57:45.000Z",
      "dateModified": "2025-10-16T20:57:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VLGE is making it easier to world build and shop on Roblox",
    "url": "https://techcrunch.com/2025/10/17/vlge-is-making-it-easier-to-world-build-and-shop-on-roblox/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/VLGE-.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T12:30:00.000Z",
    "description": "\nIn Evelyn Mora’s early career, she realized that fashion designers, although often deeply focused on sustainability, couldn’t stage environmentally f",
    "body": "\nIn Evelyn Mora’s early career, she realized that fashion designers, although often deeply focused on sustainability, couldn’t stage environmentally friendly large-scale fashion shows.  \nIn 2021, she launched VLGE, a gaming and immersive-world-building platform that specializes in working with brands. It lets brands build their own worlds, fill them with interactive content and games, and export said worlds to other platforms like Roblox. The product is revolutionizing what shopping could be in the future — a world where brands can create interactive worlds to connect with Gen Z rather than hosting fashion shows and filming campaigns. \nVLGE has worked with names such as Lancome, Charlotte Tilbury, and Vogue Scandinavia, and has raised a total of $5 million in capital from investors such as Lammont J. du Pont of the du Pont family, L’Oreal Group, and the British Fashion Council.\nIt made headlines for launching the world’s first 3D and gamified fashion week. On Thursday, it announced plans to take things one step further. It said 50 fashion brands would launch their shoppable worlds for World Fashion Week, all powered by VLGE. World Fashion Week is an initiative of VLGE and is supposed to act as a bridge for creators to launch shoppable games on other platforms, like Roblox. \nImage Credits:Lucie Baudi\nMora said this is the brand’s first large-scale activation, showing how the platform can let users build across browsers and, first, on Roblox, in real time. She decided to focus on making Roblox easier for brands to use because of the market potential, she said. VLGE is also compatible with Unreal Engine and is working on compatibility with Meta Horizon World.\n“This is significant because Roblox has become fashion’s most powerful youth frontier, yet until now, world-building there has been costly, technical, and complex,” Mora told TechCrunch. “We make it instant, affordable, scalable, and interoperable, bridging the gap between e-commerce, gaming, and cultural creation.” \nIn other words, anyone building on VLGE can launch on Roblox instantly, without needing to know Roblox’s coding language or having any substantive background in tech at all. “They also don’t need to pay tens of thousands and wait for months to launch.” (It can cost anywhere between $10,000 to $100,000 for a brand to pay an agency to build it a world on Roblox.)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nVLGE offers four payment tiers: Freemium, and three paid tiers for creators, small businesses, and enterprises, respectively. \nMora is banking on gamified commerce becoming the next frontier in fashion and said VLGE plans to launch an online store, an e-tail store, that will sell both physical items by emerging brands, as well as 3D assets that can be exported into Roblox. The technology showcases how the fashion world is trying to make use of the increasing prominence of games and immersive worlds when it comes to connecting with the next generation. \n“This moment isn’t just about fashion, it’s about the infrastructure that will power the next generation of commerce for the new generation,” Mora said. \n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VLGE is making it easier to world build and shop on Roblox",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/VLGE-.jpg?w=150"
      ],
      "datePublished": "2025-10-17T12:30:00.000Z",
      "dateModified": "2025-10-17T12:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SK Telecom’s AI unit offers staff voluntary retirement program just weeks after launch",
    "url": "https://techcrunch.com/2025/10/17/sk-telecoms-ai-unit-offers-staff-voluntary-retirement-program-just-weeks-after-launch/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Image-1-%E2%80%98Innovation-Gate-the-entrance-to-the-SK-booth-at-CES-2025-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T11:56:27.000Z",
    "description": "\nSouth Korean telco giant SK Telecom is making big changes at its new AI division, AI CIC, just weeks after it was launched. Staff employed by the uni",
    "body": "\nSouth Korean telco giant SK Telecom is making big changes at its new AI division, AI CIC, just weeks after it was launched. Staff employed by the unit are being offered a voluntary retirement program as part of a broader effort to bring together the company’s various AI-related divisions, SK Telecom confirmed to TechCrunch. \n“In late September, SK Telecom announced the launch of the AI CIC (Company-in-Company) unit and confirmed that detailed organizational restructuring would be specified by the end of October,” a spokesperson at SK Telecom told TechCrunch. “This special retirement program is entirely a supportive measure and is not intended as a restructuring or downsizing measure.”\nThe voluntary retirement program will not involve forced layoffs, and is meant to support employees whose roles, organizations or work locations may change, the spokesperson said. Employees who opt to stay with the company may be reassigned to regional offices.\nDetails of the voluntary retirement program have been communicated to staff across all experience levels, including both junior and senior employees, industry sources told TechCrunch. The AI unit has about 1,000 employees, per media reports.\nAI CIC is meant to bring together SK Telecom’s various AI-related units under a centralized organization, per the spokesperson. “This integration involves streamlining overlapping roles and functions, which may inevitably lead to changes such as role transitions, organizational realignments, or relocations,” they said.\nThe new division will oversee the development of SK Telecom’s personal AI agent, A. (pronounced “A-dot”), its AI data center operations, enterprise AI business, as well as global AI partnerships and investments.\nSeverance packages are reportedly expected to vary based on employees’ tenure and position, but the spokesperson told TechCrunch the company has set no such internal targets. “As participation is entirely voluntary, it is difficult at this stage to predict [how many employees] it may impact on the organization as a whole,” the spokesperson said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe restructuring comes as SK Telecom seeks to streamline operations and boost efficiency, with a specific focus on AI. The company plans for the AI division to record annual revenue of ₩5 trillion (around $3.5 billion) by 2030, and expects AI-driven B2C and B2B services as well as related infrastructure to drive that growth.\nThe telecom giant recently unveiled an AI infrastructure effort, offering Nvidia Blackwell GPUs-as-a-service, and earlier this month partnered with OpenAI to develop AI data centers in southwestern Korea as part of the ‘Stargate Korea’ initiative. \n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SK Telecom’s AI unit offers staff voluntary retirement program just weeks after launch",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Image-1-%E2%80%98Innovation-Gate-the-entrance-to-the-SK-booth-at-CES-2025-1.jpg?w=150"
      ],
      "datePublished": "2025-10-17T11:56:27.000Z",
      "dateModified": "2025-10-17T11:56:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple and Formula 1 ink five-year US streaming deal, bringing all races to Apple TV ",
    "url": "https://techcrunch.com/2025/10/17/apple-and-formula-1-ink-five-year-us-streaming-deal-bringing-all-races-to-apple-tv/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-2177833542.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T13:45:18.000Z",
    "description": "\nApple announced on Friday that it has secured exclusive U.S. broadcasting rights to Formula 1. The new five-year agreement between the tech giant and",
    "body": "\nApple announced on Friday that it has secured exclusive U.S. broadcasting rights to Formula 1. The new five-year agreement between the tech giant and Formula 1 will make Apple TV the exclusive streaming home for all Formula 1 races starting in the 2026 season, taking over from current broadcaster ESPN.\nAll practice, qualifying, Sprint sessions, and Grands Prix will be available to Apple TV subscribers. Select races and all practice sessions will also be available for free in the Apple TV app throughout the season, Apple says.\nApple reportedly bid $140-$150 million annually for the rights, which is significantly more than the $85 million annually that ESPN currently pays for Formula 1. Apple’s deal is valued at about $750 million over the five-year term.  \nThe move comes a few days after Apple rebranded its streaming service from “Apple TV+” to just “Apple TV,” ditching the plus sign. \nIt also follows Apple’s partnership with Formula 1 for the original film “F1 The Movie” starring Brad Pitt, which grossed $629 million worldwide this year, making it the highest-grossing sports movie of all time. The film is set to debut on Apple TV on December 12.\nIn addition to broadcasting Formula 1, Apple says it will amplify the sport across Apple News, Apple Maps, Apple Music, and Apple Fitness+. Plus, the Apple Sports app will feature live updates for every qualifying, Sprint, and race for each Grand Prix across the season, with real-time leaderboards, season driver and constructor standings, Live Activities to follow on the Lock Screen, and a Home Screen widget.\n“We’re thrilled to expand our relationship with Formula 1 and offer Apple TV subscribers in the U.S. front-row access to one of the most exciting and fastest-growing sports on the planet,” said Eddy Cue, Apple’s senior vice president of Services, in a press release. “2026 marks a transformative new era for Formula 1, from new teams to new regulations and cars with the best drivers in the world, and we look forward to delivering premium and innovative fan-first coverage to our customers in a way that only Apple can.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nFormula 1 is the latest sport to join Apple TV’s lineup, alongside Major League Soccer and Major League Baseball. \nApple notes that Formula 1 is one of the fastest-growing leagues in the world, with a U.S. fanbase that reached 52 million in 2024. \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple and Formula 1 ink five-year US streaming deal, bringing all races to Apple TV ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-2177833542.jpg?w=150"
      ],
      "datePublished": "2025-10-17T13:45:18.000Z",
      "dateModified": "2025-10-17T13:45:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ousted Luminar CEO Austin Russell wants to buy the company",
    "url": "https://techcrunch.com/2025/10/17/ousted-luminar-ceo-austin-russell-wants-to-buy-the-company/",
    "image": "https://techcrunch.com/wp-content/uploads/2017/04/austin_russell_luminar_ceo_cofounder.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-17T13:38:34.000Z",
    "description": "\nAustin Russell, the billionaire founder of Luminar, has made a bid to acquire the lidar-maker five months after he was replaced as CEO following an e",
    "body": "\nAustin Russell, the billionaire founder of Luminar, has made a bid to acquire the lidar-maker five months after he was replaced as CEO following an ethics inquiry.\nThe takeover effort was disclosed in an SEC filing by Russell early Friday morning. It would involve his new company, Russell AI Labs, purchasing 100% of the outstanding shares of Luminar’s Class A Common Stock for an undisclosed price. \nIf it happens, Luminar would remain publicly traded, and Russell AI Labs may “acquire a different, larger global automotive technology company” and merge it with Luminar “to create a unified technology platform business (‘Luminar 2.0’),” according to the filing. If that happens, Russell himself may also invest in the newly combined company.\nThe proposal was made on October 14, “at the suggestion of certain shareholders” of Luminar and “the invitation of certain members of the board” — though the filing does not name names. Luminar and Russell AI Labs did not immediately respond to a request for comment.\nThe proposed acquisition is just as sudden and surprising as Russell’s replacement in May. Luminar announced Russell’s resignation on May 19, the same day that the company reported its first-quarter earnings. The company tapped former Xerox executive Paul Ricci to take over.\nThe company offered no details about why Russell was out aside from saying the board’s audit committee had conducted a “code of business conduct and ethics inquiry.” Luminar has yet to explain what that inquiry found. It has been sued by shareholders multiple times over the move and the way it was disclosed.\nThat said, Russell is no stranger to takeover attempts. In 2023, he launched a bid to buy Forbes. But that ultimately failed after some of the investors in the acquisition reportedly didn’t follow through. The bid process was also marred by an alleged connection to a Russian oligarch.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nRussell has remained on Luminar’s board and was supposed to be “available to the incoming Chief Executive Officer on transition and technology matters,” according to the release. But he’s been absent in at least one way, by failing to have signed (in his capacity as a board member) any of the company’s filings with the Securities and Exchange Commission since being replaced.\nIn the meantime, Russell co-founded Russell AI Labs in September along with Markus Schäfer, CTO and board member of Mercedes-Benz Group AG, and Murtaza Ahmed, a former partner at the SoftBank Vision Fund. The new company claims it “backs and builds transformative AI and frontier technology companies” and has already taken a $300 million stake in agentic AI company Emergence. \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ousted Luminar CEO Austin Russell wants to buy the company",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2017/04/austin_russell_luminar_ceo_cofounder.jpg?w=150"
      ],
      "datePublished": "2025-10-17T13:38:34.000Z",
      "dateModified": "2025-10-17T13:38:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Together, we make TechCrunch Disrupt 2025 unforgettable — thank you to our sponsors",
    "url": "https://techcrunch.com/2025/10/17/together-we-make-disrupt-unforgettable-thank-you-to-our-sponsors/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/TC25_Disrupt_General_Article_No-Anniversary_Headers_1920x1080.png?w=150",
    "tag": "Tech",
    "date": "2025-10-17T16:00:00.000Z",
    "description": "\nTechCrunch Disrupt 2025 wouldn’t be what it is without the incredible companies that power the innovation behind the scenes. From headline partners t",
    "body": "\nTechCrunch Disrupt 2025 wouldn’t be what it is without the incredible companies that power the innovation behind the scenes. From headline partners to emerging collaborators, our sponsors help make Disrupt the ultimate destination for founders, investors, and visionaries shaping the future of tech. Their insights, technologies, and support bring each stage, session, and startup moment to life — turning bold ideas into real-world impact.\nSpotlight sessions you won’t want to miss\nOur sponsors are shaping the future of industries — and you can catch them live at Disrupt:\nTuesday October 28\nAI Stage\nAI Isn’t Failing. You’re Just Solving the Wrong Problems\n2:35 p.m. – 2:55 p.m.Presented by SymphonyAI\nThe headlines say AI pilots are stalling, but global leaders are already scaling AI in production. From manufacturing to payments to retail, they’re proving success comes from focus: solving complex, domain-specific problems. This discussion goes beyond hype to reveal what breaks when AI meets business reality — and how enterprises are fixing it. Expect real-world insights on deployment barriers, the human impact of automation, and why deep expertise drives measurable results.\nWednesday October 29\nBuilders Stage\nStablecoins, Startups, Salaries: The New Playbook for Global Hiring\n10:40 a.m. – 11:00 a.m.Presented by: Pebl\nAs startups scale globally, their biggest challenge isn’t finding talent — it’s paying them. Legacy payroll and banking systems can’t keep up with a distributed, digital-first workforce. Rising visa costs and shifting U.S. policies are accelerating the move to global hiring. Now fintech innovation is redefining payroll through digital wallets, stablecoins, and crypto rails, making payments faster, cheaper, and borderless. This session dives into why payroll is the next frontier of financial infrastructure, where compliance meets innovation and startups turn global teams into a competitive edge.\nNetworking is at the heart of Disrupt, and our sponsors make those memorable moments possible:\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\nLunch Reception“Future Forward Your Business”Presented by SAP\nWomen of Tech(Crunch) Cocktail Reception“Unlocking Success: Building Networks, Champions, and a Growth Mindset”Presented by J.P. Morgan\n\nStartup Battlefield, powered by MongoDB\nHuge thanks to our Startup Battlefield sponsor, MongoDB, for helping us champion breakthrough ideas and bold founders taking their first big stage at Disrupt. Your support fuels the next generation of game-changing startups.\nMongoDB will also be hosting a Breakout session:\nLeading for Impact: Engineering at the Speed of AITuesday, October 2810:30 a.m. – 11:20 a.m.\nIn the fast-moving world of AI, traditional product cycles no longer work. Constant model releases, fierce competition, and intense work demands call for a new kind of engineering leadership. Leaders from Factory, Mercor, Fireworks, TinyFish, and MongoDB’s Voyage AI share how they’re building resilient teams, driving rapid growth with leaner resources, and leading with impact at the speed of AI.\nJoin the conversation\nOur Roundtables bring founders, investors, and experts together for candid, interactive discussions that spark real insights and connections you won’t get anywhere else. Check out these Roundtable hosts:\n\n10times\nFireworks AI \nSilicon Valley Venture \nSuperconnected \nUC Berkeley SCET \nUptin \nVently \n\nA special thank-you to our marketing partners\nOur marketing partners help amplify the voice of Disrupt — sharing stories, showcasing innovation, and extending our impact far beyond the stage. We’re grateful for your collaboration and continued support.\n\nBeta University \nFounder Tactics \nHiHello \n\nTo all of our partners — thank you for fueling the conversations, connections, and breakthroughs that define Disrupt. Your commitment to innovation helps push the global startup ecosystem forward. We’re proud to build this platform together and can’t wait to see what’s next. Until then, here’s to every company, creator, and changemaker who will help make this year’s Disrupt unforgettable.\n\n1WAV / Ballast Networks  \nAerisyn Inc  \nAI Organizer Company  \nAI71  \nAll Talentz  \nBrave  \nDescope  \nDraper Startup House  \nElectronic Frontier Foundation (EFF) \nFriendli.ai\nFyeLabs  \nHallo  \nHeadAI\nHeidi Health  \niMerit\nLean Solutions Group  \nLightfield  \nLutra Inc  \nMinDD  \nNMI  \nOKTA\nprotofy.xyz  \nPulumi  \nQapita  \nScale Venture Partners\nSustainaVerse  \nSnapshot AI  \nTAC Security\nTechstars  \nTempo  \nTerragrit  \nTreble PR\nWhy Tenerife  \nWomen in Security and Privacy  \nWorkerBee  \nYSK\n\nThank you for being part of the Disrupt journey. We couldn’t do it without you.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Together, we make TechCrunch Disrupt 2025 unforgettable — thank you to our sponsors",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/TC25_Disrupt_General_Article_No-Anniversary_Headers_1920x1080.png?w=150"
      ],
      "datePublished": "2025-10-17T16:00:00.000Z",
      "dateModified": "2025-10-17T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]