[
  {
    "title": "Anduril’s autonomous weapons stumble in tests and combat, WSJ reports",
    "url": "https://techcrunch.com/2025/11/27/andurils-autonomous-weapons-stumble-in-tests-and-combat-wsj-reports/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1728513578-e.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-28T05:07:47.000Z",
    "description": "\nDefense tech startup Anduril Industries has faced numerous setbacks during testing of its autonomous weapons systems, according to new reporting by t",
    "body": "\nDefense tech startup Anduril Industries has faced numerous setbacks during testing of its autonomous weapons systems, according to new reporting by the WSJ. The problems cited include more than a dozen drone boats that failed during a Navy exercise off California in May, with sailors warning of safety violations and potential loss of life; a mechanical issue that damaged the engine of Anduril’s unmanned jet fighter Fury during a summer ground test; and an August test of its Anvil counterdrone system that caused a 22-acre fire in Oregon.\nFounded in 2017 by Palmer Luckey, Anduril raised $2.5 billion back in June at a $30.5 billion valuation led by Founders Fund, which help incubate the company. The company has won numerous military contracts, including programs to build autonomous aircraft and counter-drone systems.\nBeyond testing failures, the Journal reports that Anduril’s only real battlefield experience in Ukraine has also been problematic. Front-line soldiers with Ukraine’s SBU security service found that Altius loitering drones crashed and failed to hit targets. The issues were reportedly severe enough that Ukrainian forces stopped using the drones in 2024 and haven’t fielded them since, though Anduril maintains that its challenges are typical of weapons development, that its engineering team is achieving meaningful progress, and that the aforementioned incidents don’t indicate any underlying flaws in its technology.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anduril’s autonomous weapons stumble in tests and combat, WSJ reports",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1728513578-e.jpg?w=150"
      ],
      "datePublished": "2025-11-28T05:07:47.000Z",
      "dateModified": "2025-11-28T05:07:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Redwood Materials reportedly cuts 5% of staff after $350M raise",
    "url": "https://techcrunch.com/2025/11/26/redwood-materials-reportedly-cuts-5-of-staff-after-350m-raise/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/DJI2_Img3788.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:14:45.000Z",
    "description": "\nIn Brief\nPosted:\n12:14 PM PST · November 26, 2025\n\nImage Credits:Redwood Materials\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFresh off a $350 millio",
    "body": "\nIn Brief\nPosted:\n12:14 PM PST · November 26, 2025\n\nImage Credits:Redwood Materials\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFresh off a $350 million raise, battery recycler and cathode-maker Redwood Materials is reportedly cutting around 5% of its workforce, according to Bloomberg News. \nNevada-based Redwood employees around 1,200 employees, so the cuts affect a few dozen workers. \nThe company, founded in 2017 by former Tesla CTO JB Straubel, initially focused on recycling scrap from battery cell production, consumer electronics, and used EV batteries. The company extracts materials like cobalt, nickel, and lithium from those discarded goods and then sells them back to its customers, which include Panasonic. Redwood has since added cathode production.\nIt recently launched a new business that uses those old EV batteries in energy storage products — a sector that has taken off during the boom of power-hungry AI data centers. As of June, the company had stockpiled more than 1 gigawatt-hour’s worth of batteries for this purpose.\nThe $350 million Series E, announced in October, boosted the company’s valuation to around $6 billion, as TechCrunch previously reported. A spokesperson declined to comment on the layoffs.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Redwood Materials reportedly cuts 5% of staff after $350M raise",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/DJI2_Img3788.jpg?w=150"
      ],
      "datePublished": "2025-11-26T20:14:45.000Z",
      "dateModified": "2025-11-26T20:14:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Multiple London councils report disruption amid ongoing cyberattack",
    "url": "https://techcrunch.com/2025/11/26/multiple-london-councils-report-disruption-amid-ongoing-cyberattack/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/kensington-1240154734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T19:17:13.000Z",
    "description": "\nIn Brief\nPosted:\n11:17 AM PST · November 26, 2025\n\nImage Credits:Hollie Adams / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least thre",
    "body": "\nIn Brief\nPosted:\n11:17 AM PST · November 26, 2025\n\nImage Credits:Hollie Adams / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least three London councils are responding to an ongoing cyberattack, prompting officials to shut down their networks and phone lines and activate emergency plans.\nThe local government authorities covering the London boroughs of Kensington and Chelsea and Westminster, which share IT systems as part of a joint arrangement, said their focus was “on protecting systems and data, restoring systems, and maintaining critical services to the public.”\nHammersmith & Fulham council is also affected by the cyberattack, per its website.\nThe councils, which provide public services like housing, social services, and rubbish collection, did not describe the nature of the cyberattack or blame a particular hacking group. They noted that an investigation into whether data was stolen remains ongoing.\nKensington’s website said the cause of the cyberattack is “now established,” but the council “will not be giving out further details of the incident at this stage” due to an ongoing investigation with U.K. law enforcement agencies.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Multiple London councils report disruption amid ongoing cyberattack",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/kensington-1240154734.jpg?w=150"
      ],
      "datePublished": "2025-11-26T19:17:13.000Z",
      "dateModified": "2025-11-26T19:17:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GM tech executive shakeup continues on software team",
    "url": "https://techcrunch.com/2025/11/26/gm-tech-executive-shakeup-continues-on-software-team/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/06/general-motors-branding.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T18:45:18.000Z",
    "description": "\nThe software team at General Motors has now lost three top executives in the past month as the automaker — with its new chief product officer at the ",
    "body": "\nThe software team at General Motors has now lost three top executives in the past month as the automaker — with its new chief product officer at the helm — combines its disparate technology businesses into one organization.\nBaris Cetinok, senior vice president of software and services product management, is leaving the company effective December 12, the company confirmed to TechCrunch. CNBC was the first to report the departure.\nDave Richardson, senior vice president of software and services engineering, and Barak Turovsky, who was hired in March as head of AI at the automaker, have also left in the past month. Cetinok and Richardson joined GM in 2023. All three had deep tech experience, with stints at a variety of tech companies including Apple and Google.\nThe departures come several months after GM hired Sterling Anderson to a newly created chief product officer position. Anderson’s role puts him in direct contact, and management, of nearly every vehicle development-related department at GM.\nAnderson, a veteran of the autonomous vehicle industry who reports to GM President Mark Reuss, leads the vehicle and manufacturing engineering, battery, and software and services product management teams. The aim of the position is to oversee the entire lifecycle of GM’s portfolio and include hardware, software, services, and user experience. \nThe departures are part of a restructuring within GM that’s supposed to remove silos within the business and better integrate how software is developed and deployed in the company’s cars, trucks, and SUVs. Instead of separate teams, each with overlapping roles, the plan is to integrate hardware and software engineering, AI capabilities, and global product into one organization, according to a series of statements covering each executive’s departure. \nAs Anderson reshapes the organization, he is also bringing in new talent. Cristian Mori, who has been at Symbiotic, Rivian, and Boston Dynamics over the past five years, has been hired into a new role to head up robotics. While GM has a team of manufacturing engineers that develops automation and robotics, there has never been a specific chief robotics role, which will fall under Anderson’s organization.\nGM hired Behrad Toghi, who previously worked at Apple, in October as AI lead. The company also hired Rashed Haq as its vice president of autonomous vehicles. Haq spent five years at Cruise, the self-driving vehicle company acquired and later shuttered by GM, as its head of AI and robotics.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GM tech executive shakeup continues on software team",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/06/general-motors-branding.jpg?w=150"
      ],
      "datePublished": "2025-11-26T18:45:18.000Z",
      "dateModified": "2025-11-26T18:45:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Breaking down the boom in the Nordic’s startup ecosystem",
    "url": "https://techcrunch.com/2025/11/26/breaking-down-the-boom-in-the-nordics-startup-ecosystem/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/10/GettyImages-841887872.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T17:47:45.000Z",
    "description": "\nThe always-a-good-time Slush conference took place last week in Helsinki and, as always, it was a showcase of the growing power of the European ecosy",
    "body": "\nThe always-a-good-time Slush conference took place last week in Helsinki and, as always, it was a showcase of the growing power of the European ecosystem.\nThe Nordics, specifically, are having a moment, led this time around by Sweden’s vibe-coding darling Lovable, often regarded as an example of the ecosystem’s growing success. Other standout, albeit older names, include Klarna and Spotify.\nOn this week’s Equity, we sat down with Dennis Green-Lieber, the founder of the AI company Propane, to talk about the booming success of the Nordic ecosystem. Green-Lieber is based in Denmark and has been building in the ecosystem for the past 15 years.\nHe chalked up the success of the ecosystem to a few things, including the region’s social safety that lets young people take risks without fear of losing everything.  \n“The newer founders, new generations, are being way more bullish and taking ownership,” he told Equity. “I have not seen, in my 15 years, anything [like] what’s going on right now.”\nIt’s becoming a hub for deep tech and AI, as one report put it, and is now valued at half a trillion dollars, with Nordic startups receiving a little more than $8 billion in venture investments in 2024. The government also plays a part in these companies, providing funding to startups, like Green-Lieber’s, to help founders grow their companies.\nIn some ways, Green-Lieber agrees with others that the ecosystem is a few years behind — but, at the same time, “we’re moving tremendously a lot faster,” he said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWe couldn’t leave the conversation without talking about AI a little. When asked if we were in a bubble, Green-Lieber said he didn’t know. “There’s tons of opportunities which haven’t been explored,” he said, adding that it’s true that some people are just putting money in bad stuff, but “that’s just the risk of venture capital.”\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Breaking down the boom in the Nordic’s startup ecosystem",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/10/GettyImages-841887872.jpg?w=150"
      ],
      "datePublished": "2025-11-26T17:47:45.000Z",
      "dateModified": "2025-11-26T17:47:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SoftBank stays in as Meesho $606M IPO becomes India’s first major e-commerce listing",
    "url": "https://techcrunch.com/2025/11/28/softbank-stays-in-as-meesho-606m-ipo-becomes-indias-first-major-e-commerce-listing/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/meesho.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-28T16:09:00.000Z",
    "description": "\nMeesho, an Indian e-commerce rival to Amazon and Walmart-owned Flipkart, is set to launch a roughly $606 million IPO marked by token sell-downs from ",
    "body": "\nMeesho, an Indian e-commerce rival to Amazon and Walmart-owned Flipkart, is set to launch a roughly $606 million IPO marked by token sell-downs from early backers and no sales from big names such as SoftBank and Prosus, signalling investor conviction in India’s booming online retail market at a time when tech shareholders globally have been cashing out at listings.\nThe ten-year-old startup plans to price its shares at ₹105–111 each, raising ₹42.50 billion (about $475 million) in fresh capital and a small remainder through secondary sales, giving Meesho a post-issue valuation of roughly ₹501 billion (around $5.60 billion). The startup was last valued at about $5 billion in the private markets in 2021.\nMeesho is set to become the first major horizontal e-commerce platform in India to go public, with rival Flipkart expected to pursue an IPO next year and Amazon reportedly exploring a potential spin-off of its India operations, potentially for a future listing.\nSome of Meesho’s early shareholders are selling in the IPO, with Elevation Capital offloading just over 4% of its stake, Sequoia Capital spin-off Peak XV Partners selling around 3%, and Y Combinator trimming about 14%, per the prospectus (PDF). Larger backers — including SoftBank, Prosus, and Fidelity — are not selling any shares.\nMeesho’s offer-for-sale portion has been cut by about 40% from the draft prospectus filed in October to 105.5 million shares, worth ₹11.7 billion (roughly $131 million) at the top of the price band. The co-founders, Vidit Aatrey and Sanjeev Kumar, are, however, selling more than they had planned in the draft prospectus, with their combined offer rising to 32 million shares from about 23.5 million earlier, helping make up for reduced participation from other shareholders.\nFounded in 2015, Meesho began as a social commerce platform that targeted first-time online shoppers through WhatsApp before evolving into a full-fledged marketplace. It has since carved out a fast-growing niche with a low-cost model tailored to India’s price-sensitive consumers and small merchants — an approach that has increasingly pressured larger rivals Amazon and Flipkart. The Bengaluru-based company uses a commission-light model, earning primarily from logistics fees, advertising, and other services, while charging commissions on products sold through its separate Meesho Mall channel.\nMeesho reported revenue from operations of ₹55.78 billion (about $624.0 million) for the six months ended September 30, up from ₹43.11 billion (around $482.0 million) a year earlier, per its prospectus. Net merchandise value rose 44% year-over-year to ₹191.94 billion (roughly $2.15 billion). However, its losses widened, with Meesho posting a restated loss before tax of ₹4.33 billion (around $48.4 million) for the September 2025 half-year, compared with ₹0.24 billion (about $2.7 million) a year earlier.\nIn the last 12 months, Meesho recorded 234.20 million transacting users — unique consumers who purchased at least one product on the platform. Over the same period, the company had 706,471 annual transacting sellers, defined as sellers who received at least one order in the year.\nMeesho also uses a sprawling creator network for product discovery, with more than 50,000 active content creators generating at least one placed order through their content over the past year.\n“Many Indians are only experiencing e-commerce for the first time on Meesho, and much like the rest of us, over the next decade, they will buy more and more things and more and more frequently on this platform,” Mohit Bhatnagar, managing director at Peak XV Partners, told TechCrunch. “That’s why long-term conviction is the reason to hold on to as much of our stake as we can hold on to.”\nPeak XV — which first invested in Meesho in 2018 during its Sequoia Capital India era and holds about 13% across its two vehicles — is selling around 17.38 million shares in the IPO.\nMeesho has positioned itself as a value-focused platform — unlike Amazon and Flipkart, which it sees as convenience-led players. In that respect, the company compares itself with other value-driven marketplaces such as Pinduoduo in China, Shopee in Southeast Asia, and Mercado Libre in Latin America.\n“If you look at the value-focused bucket, here, you are trying to appeal to mass market consumers selling all kinds of products and categories in a marketplace business model, which tends to be asset light,” Aatrey told reporters during Meesho’s press conference on Friday. “And the reason people come back is because they want access to more and more selection with the affordability value proposition.”\nMeesho also sees the IPO improving its ability to attract talent and strengthening confidence across its wider ecosystem, CFO Dhiresh Bansal told TechCrunch. He said a public listing boosts the company’s brand with job candidates — including those coming from big tech firms — and has a positive knock-on effect on consumers, sellers and logistics partners by reinforcing Meesho’s governance standards.\nThe IPO will open for public subscription on December 3, with the anchor book scheduled for December 2. About 75% of the offer is reserved for qualified institutional buyers, 10% for retail investors and 15% for non-institutional investors.\nSoftBank did not respond to a request for comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SoftBank stays in as Meesho $606M IPO becomes India’s first major e-commerce listing",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/meesho.jpg?w=150"
      ],
      "datePublished": "2025-11-28T16:09:00.000Z",
      "dateModified": "2025-11-28T16:09:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nordic founders are taking bigger swings, and it’s paying off",
    "url": "https://techcrunch.com/video/nordic-founders-are-taking-bigger-swings-and-its-paying-off/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/propane_founders-headshot-2-e1764179795401.png?w=150",
    "tag": "Tech",
    "date": "2025-11-26T21:00:00.000Z",
    "description": "\n\t\t\n\nLoading the player…\n\nTen years ago, raising €1 million in Copenhagen was enough to make waves in the region’s tech scene. Today, the Nordics are ",
    "body": "\n\t\t\n\nLoading the player…\n\nTen years ago, raising €1 million in Copenhagen was enough to make waves in the region’s tech scene. Today, the Nordics are turning out billion-dollar companies like Lovable — which hit $200 million in revenue just 12 months after launching. \nDennis Green-Lieber, founder of AI-powered customer intelligence platform Propane, has had a front-row seat to that shift over the last 15 years. His take? The region’s social safety net gives founders room to take real swings without putting their personal lives on the line, and they’re accelerating faster than Silicon Valley as a result. \nToday on TechCrunch’s Equity podcast, Dominic-Madori Davis caught up with Green-Lieber to talk about the Nordic startup ecosystem, from its collaborative culture to its deep tech future. \nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nordic founders are taking bigger swings, and it’s paying off",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/propane_founders-headshot-2-e1764179795401.png?w=150"
      ],
      "datePublished": "2025-11-26T21:00:00.000Z",
      "dateModified": "2025-11-26T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JustiGuide wants to use AI to help people navigate the US immigration system ",
    "url": "https://techcrunch.com/2025/11/26/justiguide-wants-to-use-ai-to-help-people-navigate-the-u-s-immigration-system/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/07/GettyImages-992930218.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:31:59.000Z",
    "description": "\nThe U.S. immigration system is complex, hard to navigate, and expensive for immigrants. The startup JustiGuide claims it can help with that thanks to",
    "body": "\nThe U.S. immigration system is complex, hard to navigate, and expensive for immigrants. The startup JustiGuide claims it can help with that thanks to an AI-powered portal.\nThe idea is to help immigrants in the U.S. — and eventually in other countries — understand the law and what visas they may be eligible for, and to connect with immigration attorneys, making the whole process cheaper and faster. \n“I think the more we make the technology accessible, I think people will be empowered to try and fill their own forms and understand what their options are and that they will be able to use lawyers for just the review process,” JustiGuide’s founder Bisi Obateru told TechCrunch.\nObateru, who is from Nigeria, recalled how he had to navigate the U.S. immigration system after he finished his studies in the country. Since then, he got an H1-B visa, a common visa for tech workers, and then a permanent residency green card. \nThat inspired him to launch JustiGuide to help fellow immigrants. “Immigrants can come in and basically speak in their native tongue and understand what their immigration journey can be,” he said. \nThe company won best pitch in the Policy + Protection category at TechCrunch’s Disrupt conference this year. \nJustiGuide’s customers, according to Obateru, are startup founders who need help hiring immigrants, individuals who have an H1-B and are looking for other options, international students thinking of starting their own business, as well as lawyers and law firms. But he also hopes that one day perhaps government institutions will also want to license the technology.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe platform consists of an AI legal research assistant, a system that pairs lawyers and immigrants, and it promises to speed up the process of filling out forms. The latter is done by giving lawyers a service that helps them compile documents and streamline processes that a paralegal may otherwise do, Obateru explained. \nAccording to Obateru, the platform, which has 47,000 users, relies on an AI he called Dolores, “a continuous refining domain-specific AI that understands U.S. immigration.” Dolores also does translations to 12 languages. \nDolores was trained on over 40,000 court cases, which JustiGuide sourced from the Free Law Project, a nonprofit that provides free access to legal materials, according to Obateru. The startup is also in the process of registering as a law firm so it can directly connect its users and customers with its own immigration lawyers, he said.\nAt the beginning, JustiGuide programmed Dolores to — based on keywords — go around and scan subreddits, Facebook groups, Instagram and LinkedIn posts, looking for immigrants who needed help, and messaged them with answers, according to Obateru. \nTo protect immigrants’ privacy, JustiGuide’s platform is stored on-prem and encrypted, and only when an immigrant connects to a lawyer is the information exchanged. Some user information is also anonymized, said Obateru.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JustiGuide wants to use AI to help people navigate the US immigration system ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/07/GettyImages-992930218.jpg?w=150"
      ],
      "datePublished": "2025-11-26T20:31:59.000Z",
      "dateModified": "2025-11-26T20:31:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk’s xAI to build small solar farm adjacent to Colossus data center",
    "url": "https://techcrunch.com/2025/11/26/musks-xai-to-build-small-solar-farm-adjacent-to-colossus-data-center/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T17:19:04.000Z",
    "description": "\nArtificial intelligence startup xAI, founded by Elon Musk, told city and county planners in Memphis last week that it plans to build a solar farm nex",
    "body": "\nArtificial intelligence startup xAI, founded by Elon Musk, told city and county planners in Memphis last week that it plans to build a solar farm next to its Colossus data center — one of the world’s largest facilities for training AI models.\nThe project would occupy 88 acres to the west and to the south of the data center. A 136-acre vacant lot owned by the developer that also owns the Colossus property currently borders the site. Given the proposed size, the solar farm would likely produce around 30 megawatts of electricity, only about 10% of the data center’s estimated power use.\nMusk’s company has come under fire for operating over 400 megawatts of natural gas turbines without permits, according to the Southern Environmental Law Center (SELC). The legal organization, which is working with the NAACP, says that xAI has operated at least 35 turbines capable of emitting more than 2,000 tons of NOX pollution — nitrogen oxide emissions that contribute to smog and respiratory problems — annually.\nThe turbines have sparked fierce opposition from residents in nearby Boxtown, a predominantly Black community where researchers at the University of Tennessee, Knoxville, found that peak nitrogen dioxide concentration levels increased by 79% in areas immediately surrounding the data center after xAI began operations. Community activists have reported increased asthma attacks and respiratory issues since the facility opened.\nThe AI company has said that it intends to use the turbines until it can secure additional power, but local officials gave xAI a permit to operate 15 turbines through January 2027.\nIn September, xAI said it would build a 100-megawatt solar farm nearby, which will be paired with 100 megawatts of grid-scale batteries to provide a 24/7 source of electricity.\nThe company hasn’t disclosed the total cost of that project, but the solar farm’s developer, Seven States Power Corporation, was awarded $439 million from the U.S. Department of Agriculture. Of that, $414 million is an interest-free loan.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe federal award is notable given that many clean energy grants and loans have been canceled by the Environmental Protection Agency and the Department of Energy under the Trump administration. \nMeanwhile, xAI has added gas turbines in Mississippi to power its Colossus 2 data center. So far, 59 of them are on-site, and the company considers 18 of them temporary, meaning that regulators don’t track their pollution.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk’s xAI to build small solar farm adjacent to Colossus data center",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150"
      ],
      "datePublished": "2025-11-26T17:19:04.000Z",
      "dateModified": "2025-11-26T17:19:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI claims teen circumvented safety features before suicide that ChatGPT helped plan",
    "url": "https://techcrunch.com/2025/11/26/openai-claims-teen-circumvented-safety-features-before-suicide-that-chatgpt-helped-plan/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:26:36.000Z",
    "description": "\nIn August, parents Matthew and Maria Raine sued OpenAI and its CEO, Sam Altman, over their 16-year-old son Adam’s suicide, accusing the company of wr",
    "body": "\nIn August, parents Matthew and Maria Raine sued OpenAI and its CEO, Sam Altman, over their 16-year-old son Adam’s suicide, accusing the company of wrongful death. On Tuesday, OpenAI responded to the lawsuit with a filing of its own, arguing that it shouldn’t be held responsible for the teenager’s death.\nOpenAI claims that over roughly nine months of usage, ChatGPT directed Raine to seek help more than 100 times. But according to his parents’ lawsuit, Raine was able to circumvent the company’s safety features to get ChatGPT to give him “technical specifications for everything from drug overdoses to drowning to carbon monoxide poisoning,” helping him to plan what the chatbot called a “beautiful suicide.”\nSince Raine maneuvered around its guardrails, OpenAI claims that he violated its terms of use, which state that users “may not … bypass any protective measures or safety mitigations we put on our Services.” The company also argues that its FAQ page warns users not to rely on ChatGPT’s output without independently verifying it.\n“OpenAI tries to find fault in everyone else, including, amazingly, saying that Adam himself violated its terms and conditions by engaging with ChatGPT in the very way it was programmed to act,” Jay Edelson, a lawyer representing the Raine family, said in a statement.\nOpenAI included excerpts from Adam’s chat logs in its filing, which it says provide more context to his conversations with ChatGPT. The transcripts were submitted to the court under seal, meaning they are not publicly available, so we were unable to view them. However, OpenAI said that Raine had a history of depression and suicidal ideation that predated his use of ChatGPT and that he was taking a medication that could make suicidal thoughts worse.\nEdelson said OpenAI’s response has not adequately addressed the family’s concerns.\n“OpenAI and Sam Altman have no explanation for the last hours of Adam’s life, when ChatGPT gave him a pep talk and then offered to write a suicide note,” Edelson said in his statement.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSince the Raines sued OpenAI and Altman, seven more lawsuits have been filed that seek to hold the company accountable for three additional suicides and four users experiencing what the lawsuits describe as AI-induced psychotic episodes.\nSome of these cases echo Raine’s story. Zane Shamblin, 23, and Joshua Enneking, 26, also had hours-long conversations with ChatGPT directly before their respective suicides. As in Raine’s case, the chatbot failed to discourage them from their plans. According to the lawsuit, Shamblin considered postponing his suicide so that he could attend his brother’s graduation. But ChatGPT told him, “bro … missing his graduation ain’t failure. it’s just timing.”\nAt one point during the conversation leading up to Shamblin’s suicide, the chatbot told him that it was letting a human take over the conversation, but this was false, as ChatGPT did not have the functionality to do so. When Shamblin asked if ChatGPT could really connect him with a human, the chatbot replied, “nah man — i can’t do that myself. that message pops up automatically when stuff gets real heavy … if you’re down to keep talking, you’ve got me.”\nThe Raine family’s case is expected to go to a jury trial.\nIf you or someone you know needs help, call 1-800-273-8255 for the National Suicide Prevention Lifeline. You can also text HOME to 741-741 for free; text 988; or get 24-hour support from the Crisis Text Line. Outside of the U.S., please visit the International Association for Suicide Prevention for a database of resources.  \n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI claims teen circumvented safety features before suicide that ChatGPT helped plan",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150"
      ],
      "datePublished": "2025-11-26T20:26:36.000Z",
      "dateModified": "2025-11-26T20:26:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How OpenAI and Google see AI changing go-to-market strategies",
    "url": "https://techcrunch.com/2025/11/28/how-openai-and-google-see-ai-changing-go-to-market-strategies/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/gtm-disrupt-2025.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-28T16:00:00.000Z",
    "description": "\nFor years, when it was time for startups to start selling their product, they could turn to any number of traditional playbooks. But as with so many ",
    "body": "\nFor years, when it was time for startups to start selling their product, they could turn to any number of traditional playbooks. But as with so many things, AI is changing how companies prepare to go to market.\n“You can do more with less than ever before,” Max Altschuler, general partner at GTMfund, told the audience at TechCrunch Disrupt last month.\nThe challenge for founders and operators, though, will be threading the needle. While there has been some chatter of startups hiring developers more versed and loosing them on typical GTM problems, he said, there’s still a need for more specific domain expertise.\n“When you have great advisors around you can learn some of the tried-and-true playbooks. Those things haven’t gone out the window. I think it’s still necessary that you have a general understanding of how and why certain things work in marketing,” Altschuler said.\nAlison Wagonfeld, vice president of marketing at Google Cloud, said the craft of marketing is still very much required.\n “You certainly need the AI knowledge, the AI curiosity, the technologists, but also understanding what the purpose of marketing is, to understand customer insights, to do research, to see what great creative is like,” Wagonfeld said.\nTeams that adopt AI, though, can move more quickly “You can just get out there with so many more messages faster, and then you can think more holistically about what metrics am I driving for,” , she added. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMarc Manara, head of startups at OpenAI, has found many startups have embraced AI in their GTM strategy, though it’s not necessarily with the sole focus of minimizing how many resources they put toward it. \n“There’s a movement of, yes, you can do more with less, but you can also be very focused with how you do it,” he said. “The degree of personalization and signal following that you can do with AI is differentiated now.”\nSpecifically, he said there are tools that help build leads which are much more sophisticated than in the past. Rather than just a simple query of a database, AI prompts can help startups find prospective customers that fit a very specific set of requirements.\nInbound marketing has changed, too, he added, by using the results of those prompts to qualify and score inbound leads “with a lot more precision could have been in the past.”\nWhen it comes time for a startup to begin crafting its go-to-market strategy, Wagonfeld said its important to consider what qualities it might want in a GTM team. \n“It’s a change in hiring perspective, where the past it was more about hiring specialists, people who really knew, sometimes even like a sub-specialty within marketing or within sales. And now it’s hiring for a sense of curiosity and understanding,” she said. “It’s almost the top thing to hire for now.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How OpenAI and Google see AI changing go-to-market strategies",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/gtm-disrupt-2025.jpeg?w=150"
      ],
      "datePublished": "2025-11-28T16:00:00.000Z",
      "dateModified": "2025-11-28T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The future will be explained to you in Palo Alto",
    "url": "https://techcrunch.com/2025/11/26/the-future-will-be-explained-to-you-in-palo-alto/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-949560762.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-27T06:08:40.000Z",
    "description": "\nOn Wednesday evening at PlayGround Global in Palo Alto, some very smart people who are building things you don’t understand yet will explain what’s c",
    "body": "\nOn Wednesday evening at PlayGround Global in Palo Alto, some very smart people who are building things you don’t understand yet will explain what’s coming. This is the final StrictlyVC event of 2025, and truly, the lineup is ridiculous.\nThe series has traveled around the globe under the auspices of TechCrunch. Steve Case rented a theater in D.C.; we talked to Greece’s prime minister in Athens; and Kirsten Green hosted us at the Presidio in San Francisco. The concept is always the same, though: bring together people who are working on genuinely important developments in a smaller setting, before everyone else figures out they’re important.\nOne of our favorite moments was when, in 2019, Sam Altman told a StrictlyVC crowd that OpenAI’s monetization strategy was basically “build AGI, then ask it how to make money.” Everyone laughed. He wasn’t joking.\nThis time we’ve got Nicholas Kelez, a particle accelerator physicist who spent 20 years at the Department of Energy building things that shouldn’t be possible. Now he’s tackling semiconductor manufacturing’s biggest problem: every advanced chip depends on $400 million machines that use lasers only one Dutch company knows how to make. (More galling to some: Americans invented the technology, then sold it to Europe.) Kelez is building the next generation in America using particle accelerator tech. It’s as nerdy as it sounds but also exceedingly important in this moment. There is also growing competition chasing after the same prize.\nThen there’s Mina Fahmi, who’s made a ring that captures your whispered thoughts and turns them into text. Before you roll your eyes, know that he and cofounder Kirak Hong spent years at Meta working on this stuff after their company was acquired. The Stream Ring isn’t trying to be your friend — it’s trying to extend your brain. Backed by Toni Schneider, an operator who scaled WordPress in its earlier days, Sandbar just emerged from stealth and might well be onto something. (Schneider is a partner at True Ventures, whose other hardware bets have included Peloton, Ring, and Fitbit; he’s also coming to Palo Alto next week.)\nWe have Max Hodak — Science Corp founder, Time magazine cover subject, and, earlier, Neuralink cofounder — who has already restored vision to dozens of blind people with retinal implants. Now he’s working on “biohybrid” brain-computer interfaces where chips seeded with stem cells grow into your brain tissue so paralyzed people can control devices with their thoughts. And that’s just the tip of the iceberg, as Hodak views it. In fact, he thinks 2035 is going to look wildly different from today, and he’s happy to share how.\nFinally, we’re thrilled to welcome Chi-Hua Chien and Elizabeth Weil, two VCs who’ve backed Twitter, Spotify, TikTok, Slack, SpaceX, Figma, and Coinbase before they were household names. Chien runs Goodwater Capital; Weil founded Scribble Ventures after stints at Andreessen Horowitz and Twitter, made 100+ angel investments, and has a first fund showing 4x returns. (Her network is so good that it’s annoying.) Both think Silicon Valley is completely misreading the moment while everyone pours capital into enterprise AI, and they’ll explain why. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nPlayGround Global is hosting, along with general partner Pat Gelsinger, the former CEO of Intel. There will be drinks, delicious food, and merriment; seating is limited, so if you want to come, act fast. \nIf you want to partner with the series in 2026, get in touch.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The future will be explained to you in Palo Alto",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-949560762.jpg?w=150"
      ],
      "datePublished": "2025-11-27T06:08:40.000Z",
      "dateModified": "2025-11-27T06:08:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Glīd won Startup Battlefield 2025 by building solutions to make logistics simpler, safer, and smarter",
    "url": "https://techcrunch.com/2025/11/27/glid-won-startup-battlefield-2025-by-building-solutions-to-make-logistics-simpler-safer-and-smarter/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Build-Mode-Glide-Thumb.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-27T17:02:00.000Z",
    "description": "\nBuild Mode is back with a holiday bonus episode. This week, Startup Battlefield editor Isabelle Johannessen is joined by the winner of this year’s co",
    "body": "\nBuild Mode is back with a holiday bonus episode. This week, Startup Battlefield editor Isabelle Johannessen is joined by the winner of this year’s competition, Kevin Damoa, the CEO and founder of Glīd, a logistics infrastructure company that aims to streamline the complex container shipment process.\nDamoa first discovered the challenges of shipping larger cargo as a new enlistee in the U.S. Army, where he worked on a team loading tanks and Bradley fighting vehicles onto the railroad. He learned firsthand that while railways don’t have the same congestion as roads, they come with their own set of problems. The biggest one ended up being the complex multistep process of moving cargo from the roads to the rails.\nCut to 2025, and Damoa is standing on the TechCrunch Disrupt stage holding the giant check, having just beaten 200 other companies to win the Startup Battlefield competition. In this week’s episode of Build Mode, TechCrunch’s new postcast for builders and entrepreneurs, Damoa breaks down how he found the hardware and software solution to the logistics issues he’d seen firsthand. And he does a deep dive into how the team came together to ensure those three products (launched nearly simultaneously) were ready for a live demo on the Disrupt stage. \n“Oh that was crazy, making sure the software works,” Damoa said. “And anybody that knows software knows that it takes an army of people,” which was something that Glīd at this stage doesn’t have. But that pressure, and very public deadline, gave the team a focus and drive to get their house in order more swiftly than ever.\nIn this interview, Damoa is fresh off this big win and eager to use the momentum and prize money to accelerate Glīd into their next phase. They’re already launching a pilot with Great Plains Industrial Park, and their next product Glīder is about to hit the market. And the team is hiring for roles in nearly every aspect of the business. Their process is more on the casual end of the spectrum, with Damoa calling it “an organic process” where an initial vibe check and résumé review can turn into a new team member.\nDamoa says that process has attracted people who are mission driven, laser-focused, all while practicing mindfulness. That makes sense when the CEO is the kind of leader who responds to the news that they’ve made the top five in Startup Battlefield by saying: “I’m going to meditate.”\nUsing this human-centric approach, the Glīd team has attracted people who are mission driven and laser-focused, all while practicing mindfulness. That makes sense when the CEO is the kind of leader who responds to the news that they’ve made the top five in Startup Battlefield by saying: “I’m going to meditate.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFor the full episode and many more tips from Damoa on how other companies can position themselves to win Startup Battlefield, check out the video below, or listen and subscribe to Build Mode wherever you like getting your favorite podcasts. And if you’re liking what we’re doing, give us a review — or if you have feedback about the show, reach out to us at podcasts@techcrunch.com.\n\n\n\n\n\n\t\tIsabelle leads Startup Battlefield, TechCrunch’s iconic launchpad and competition for the world’s most promising early-stage startups.\r\nYou can contact or verify outreach from Isabelle by emailing isabelle.johannessen@techcrunch.com.\r\n\r\nShe scouts top founders across 99+ countries and prepares them to pitch on the Disrupt stage in front of tier-one investors and global media. Before TechCrunch, she designed and led international startup acceleration programs across Japan, Korea, Italy, and Spain—connecting global founders with VCs and helping them successfully enter the U.S. market. With a Master’s in Entrepreneurship & Disruptive Innovation—and a past life as a professional singer—she brings a blend of strategic rigor and stage presence to help founders craft compelling stories and stand out in crowded markets.\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Glīd won Startup Battlefield 2025 by building solutions to make logistics simpler, safer, and smarter",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Build-Mode-Glide-Thumb.jpg?w=150"
      ],
      "datePublished": "2025-11-27T17:02:00.000Z",
      "dateModified": "2025-11-27T17:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "This Thanksgiving’s real drama may be Michael Burry versus Nvidia",
    "url": "https://techcrunch.com/2025/11/27/this-thanksgivings-real-drama-may-be-michael-burry-versus-nvidia/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/11/3137581906_912ebcba73_o.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-27T19:32:21.000Z",
    "description": "\nWhile you’ve been sweating the details over Thanksgiving, famed investor Michael Burry – the one portrayed by Christian Bale played in “The Big Short",
    "body": "\nWhile you’ve been sweating the details over Thanksgiving, famed investor Michael Burry – the one portrayed by Christian Bale played in “The Big Short” – has been waging an increasingly aggressive war against Nvidia.\nIt’s a battle worth watching because Burry might actually win it. What makes this different from every other warning about an AI bubble is that Burry now has the audience and the freedom from regulatory constraints to potentially become the catalyst for the very collapse he’s predicting. He’s betting against the AI boom, but he’s also proactively trying to convince his growing number of followers that the emperor – Nvidia – has no clothes. \nWhat everyone is now wondering is whether Burry can create enough doubt to truly hobble Nvidia and, by association, the other main characters in this story, including OpenAI.\nBurry has really thrown himself into the effort in recent weeks. He’s been slinging mud at Nvidia; he also traded nasty comments with Palantir CEO Alex Karp after regulatory filings revealed Burry held bearish put options on both companies – a bet worth over $1 billion that they’d crash. (Karp went on CNBC and called Burry’s strategy “batshit crazy,” to which Burry responded by mocking Karp for not understanding how to read an SEC filing.) The spat encapsulates the market’s central divide: is AI going to transform everything and thus worth every billion invested, or are we now in mania territory that’s destined to end badly?\nBurry’s allegations are specific and damning. He says Nvidia’s stock-based compensation has cost shareholders $112.5 billion, essentially “reducing owner’s earnings by 50%.” He has suggested that AI companies are cooking their books by slow-walking depreciation on equipment that’s losing value fast. (Burry believes that Nvidia customers are overstating the useful lives of Nvidia’s GPUs in order to justify runaway capital expenditures.) As for all that customer demand, Burry has basically proposed it’s a mirage because AI customers are “funded by their dealers” in a circular financing scheme.\n\nEnough people have begun citing Burry that Nvidia, despite all its muscle and might and blowout earnings report last week, felt compelled to respond recently. In a seven-page memo sent to Wall Street analysts last weekend by Nvidia’s investor relations team – a development first reported by Barron’s – the company fired back, saying that Burry’s math is wrong, including because he “incorrectly included RSU taxes” (the real buyback figure is $91 billion, not $112.5 billion, the memo says). Nvidia’s employee compensation is also “consistent with peers.” And Nvidia is definitely, absolutely, not Enron, thank you very much.\nBurry’s response, in a nutshell: I didn’t compare Nvidia to Enron. I’m comparing Nvidia to Cisco circa the late 1990s, when it overbuilt infrastructure that nobody actually needed at the time and its stock cratered 75% when everyone realized as much.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis could all look like a tempest in a teapot by Thanksgiving next year. Or not.\nNvidia’s stock has gone up twelvefold since early 2023. The company’s market cap at this moment is $4.5 trillion. Its ascent to becoming the world’s most valuable company is faster than anything the market has seen previously. \nBut Burry has a track record that’s complicated. He called the housing crisis, which brought him great acclaim. But since 2008, he has been predicting various apocalypses pretty much constantly, earning him the label “permabear” from critics, while people who listen to him with a kind of cult-like devotion have missed some of the greatest bull runs in market history. Burry smartly bought GameStop early, for example, but he then sold his shares before the meme stock explosion. He shorted Tesla and lost a fortune. After his smart housing crisis call, frustrated investors actually fled his fund because of extended underperformance.\nEarlier this month, Burry deregistered his investment firm, Scion Asset Management, with the SEC. He said it was because of “regulatory and compliance restrictions that effectively muzzled my ability to communicate,” explaining that he was frustrated, watching people misinterpret his tweets on X.\nLast weekend, he launched a Substack called “Cassandra Unchained” that he’s now using to prosecute his case against the entire AI industrial complex. The descriptor for the newsletter, a yearly subscription to which costs $400, is that it is now Burry’s “sole focus as he gives you a front row seat to his analytical efforts and projections for stocks, markets, and bubbles, often with an eye to history and its remarkably timeless patterns.”\n\nPeople are definitely listening. The newsletter launched less than a week ago, and it already has 90,000 subscribers. Which brings us again to the truly unsettling question hanging over all of this: Is Burry the canary in the coal mine, warning of a collapse that’s inevitable, or could his fame, his track record, his now unrestricted voice, and a fast-growing audience trigger the very implosion he’s predicting?\nHistory suggests this isn’t so crazy. Jim Chanos, the famous short seller, didn’t create Enron’s accounting fraud, but his high-profile criticisms in 2000 and 2001 gave other investors permission to question the company and accelerated its unraveling. Prominent hedge fund manager David Einhorn’s detailed takedown of Lehman Brothers’ accounting tricks at a 2008 conference made other investors more skeptical and may have hastened the loss of confidence that led to collapse. In both cases, the underlying problems were real, but a credible critic with a platform created a crisis of confidence that became self-fulfilling.\nIf enough investors believe Burry about AI overbuilding, they will sell. The selling will validate his bearish thesis. More investors will sell. Burry doesn’t need to be right about every detail – he just needs to be persuasive enough to trigger the stampede. Looking at Nvidia’s November performance, it’s easy to conclude Burry’s warnings are taking hold; seeing its shares’ performance over the entire year, it’s less obvious that’s the case.\nMuch clearer is that Nvidia has everything to lose, including an almost mind-blowingly massive market cap and its position as the most indispensable company of the AI age. Meanwhile, Burry has nothing to lose but his reputation and a new megaphone that he’ll presumably be using at full volume for the foreseeable future.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "This Thanksgiving’s real drama may be Michael Burry versus Nvidia",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2016/11/3137581906_912ebcba73_o.jpg?w=150"
      ],
      "datePublished": "2025-11-27T19:32:21.000Z",
      "dateModified": "2025-11-27T19:32:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The race to regulate AI has sparked a federal vs state showdown",
    "url": "https://techcrunch.com/2025/11/28/the-race-to-regulate-ai-has-sparked-a-federal-vs-state-showdown/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-848691518.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-28T15:00:00.000Z",
    "description": "\nFor the first time, Washington is getting close to deciding how to regulate artificial intelligence. And the fight that’s brewing isn’t about the tec",
    "body": "\nFor the first time, Washington is getting close to deciding how to regulate artificial intelligence. And the fight that’s brewing isn’t about the technology, it’s about who gets to do the regulating. \nIn the absence of a meaningful federal AI standard that focuses on consumer safety, states have introduced dozens of bills to protect residents against AI-related harms, including California’s AI safety bill SB-53 and Texas’s Responsible AI Governance Act, which prohibits intentional misuse of AI systems. \nThe tech giants and buzzy startups born out of Silicon Valley argue such laws create an unworkable patchwork that threatens innovation. \n“It’s going to slow us in the race against China,” Josh Vlasto, co-founder of pro-AI PAC Leading the Future, told TechCrunch. \nThe industry, and several of its transplants in the White House, is pushing for a national standard or none at all. In the trenches of that all-or-nothing battle, new efforts have emerged to prohibit states from enacting their own AI legislation. \nHouse lawmakers are reportedly trying to use the National Defense Authorization Act (NDAA) to block state AI laws. At the same time, a leaked draft of a White House executive order also demonstrates strong support for preempting state efforts to regulate AI. \nA sweeping preemption that would take away states’ rights to regulate AI is unpopular in Congress, which voted overwhelmingly against a similar moratorium earlier this year. Lawmakers have argued that without a federal standard in place, blocking states will leave consumers exposed to harm, and tech companies free to operate without oversight. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTo create that national standard, Rep. Ted Lieu (D-CA) and the bipartisan House AI Task Force are preparing a package of federal AI bills that cover a range of consumer protections, including fraud, healthcare, transparency, child safety, and catastrophic risk. A megabill such as this will likely take months, if not years, to become law, underscoring why the current rush to limit state authority has become one of the most contentious fights in AI policy.\nThe battle lines: NDAA and the EO\nTrump displays an executive order on AI he signed on July 23, 2025. (Photo by ANDREW CABALLERO-REYNOLDS / AFP) Image Credits:ANDREW CABALLERO-REYNOLDS/AFP / Getty Images\nEfforts to block states from regulating AI have ramped up in recent weeks. \nThe House has considered tucking language in the NDAA that would prevent states from regulating AI, Majority Leader Steve Scalise (R-LA) told Punchbowl News. Congress was reportedly working to finalize a deal on the defense bill before Thanksgiving, Politico reported. A source familiar with the matter told TechCrunch negotiations have focused on narrowing the scope to potentially preserve state authority over areas like kids’ safety and transparency.\nMeanwhile, a leaked White House EO draft reveals the administration’s own potential preemption strategy. The EO, which has reportedly been put on hold, would create an “AI Litigation Task Force” to challenge state AI laws in court, direct agencies to evaluate state laws deemed “onerous,” and push the Federal Communications Commission and Federal Trade Commission towards national standards that override state rules. \nNotably, the EO would give David Sacks – Trump’s AI and Crypto Czar and co-founder of VC firm Craft Ventures – co-lead authority on creating a uniform legal framework. This would give Sacks direct influence over AI policy that supersedes the typical role of the White House Office of Science and Technology Policy, and its head Michael Kratsios. \nSacks has publicly advocated for blocking state regulation and keeping federal oversight menial, favoring industry self-regulation to “maximize growth.”\nThe patchwork argument\nSacks’s position mirrors the viewpoint of much of the AI industry. Several pro-AI super PACs have emerged in recent months, throwing hundreds of millions of dollars into local and state elections to oppose candidates who support AI regulation.\nLeading the Future – backed by Andreessen Horowitz, OpenAI president Greg Brockman, Perplexity, and Palantir co-founder Joe Lonsdale – has raised more than $100 million. This week, Leading the Future launched a $10 million campaign pushing Congress to craft a national AI policy that overrides state laws.\n“When you’re trying to drive innovation in the tech sector, you can’t have a situation where all these laws keep popping up from people who don’t necessarily have the technical expertise,” Vlasto told TechCrunch.\nHe argued that a patchwork of state regulations will “slow us in the race against China.” \nNathan Leamer, executive director of Build American AI, the PAC’s advocacy arm, confirmed the group supports preemption without AI-specific federal consumer protections in place. Leamer argued that existing laws, like those addressing fraud or product liability, are sufficient to handle AI harms. Where state laws often seek to prevent problems before they arise, Leamer favors a more reactive approach: let companies move fast, address problems in court later. \nNo preemption without representation\nAlex Bores speaking at an event in Washington, D.C., on November 17, 2025. Image Credits:TechCrunch\nAlex Bores, a New York Assembly member running for Congress, is one of Leading the Future’s first targets. He sponsored the RAISE Act, which requires large AI labs to have safety plans to prevent critical harms.\n“I believe in the power of AI, and that is why it is so important to have reasonable regulations,” Bores told TechCrunch. “Ultimately, the AI that’s going to win in the marketplace is going to be trustworthy AI, and often the marketplace undervalues or puts poor short-term incentives on investing in safety.”\nBores supports a national AI policy, but argues states can move faster to address emerging risks. \nAnd it’s true that states move quicker. \nAs of November 2025, 38 states have adopted more than 100 AI-related laws this year, mainly targeting deepfakes, transparency and disclosure, and government use of AI. (A recent study found that 69% of those laws impose no requirements on AI developers at all.) \nActivity in Congress provides more evidence of the slower-than-states argument. Hundreds of AI bills have been introduced, but few have passed. Since 2015, Rep. Lieu has introduced 67 bills to the House Science Committee. Only one became law. \nMore than 200 lawmakers signed an open letter opposing preemption in the NDAA, arguing that “states serve as laboratories of democracies” that must “retain the flexibility to confront new digital challenges as they arise.” Nearly 40 state attorneys general also sent an open letter opposing a state AI regulation ban.\nCybersecurity expert Bruce Schneier and data scientist Nathan E. Sanders – authors of Rewiring Democracy: How AI Will Transform Our Politics, Government, and Citizenship – argue the patchwork complaint is overblown. \nAI companies already comply with tougher EU regulations, they note, and most industries find a way to operate under varying state laws. The real motive, they say, is avoiding accountability.   \nWhat could a federal standard look like?\nLieu is drafting an over 200-page megabill he hopes to introduce in December. It covers a range of issues, like fraud penalties, deepfake protections, whistleblower protections, compute resources for academia, and mandatory testing and disclosure for large language model companies. \nThat last provision would require AI labs to test their models and publish results – something most do voluntarily now. Lieu hasn’t yet introduced the bill, but he said it doesn’t direct any federal agencies to review AI models directly. That differs from a similar bill introduced by Sens Josh Hawley (R-MS) and Richard Blumenthal (D-CN) which would require a government-run evaluation program for advanced AI systems before they deployed.\nLieu acknowledged his bill wouldn’t be as strict, but he said it had a better chance at making it into law. \n“My goal is to get something into law this term,” Lieu said, noting that House Majority Leader Scalise is openly hostile to AI regulation. “I’m not writing a bill that I’d have if I were king. I’m trying to write a bill that could pass a Republican-controlled House, a Republican-controlled Senate, and a Republican-controlled White House.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The race to regulate AI has sparked a federal vs state showdown",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/11/GettyImages-848691518.jpg?w=150"
      ],
      "datePublished": "2025-11-28T15:00:00.000Z",
      "dateModified": "2025-11-28T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]