[
  {
    "title": "Google pays $68M to settle claims its voice assistant spied on users",
    "url": "https://techcrunch.com/2026/01/26/google-pays-68-million-to-settle-claims-its-voice-assistant-spied-on-users/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2198713751.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-27T00:43:35.000Z",
    "description": "\nIn Brief\nPosted:\n4:43 PM PST · January 26, 2026\n\nImage Credits:Klaudia Radecka/NurPhoto / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoo",
    "body": "\nIn Brief\nPosted:\n4:43 PM PST · January 26, 2026\n\nImage Credits:Klaudia Radecka/NurPhoto / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoogle agreed to pay $68 million to settle claims its voice assistant illegally spied on users to, among other things, serve them advertisements, Reuters reports.\nGoogle did not admit wrongdoing in the settlement of the class-action case, which accused the firm of “unlawful and intentional interception and recording of individuals’ confidential communications without their consent and subsequent unauthorized disclosure of those communications to third parties.” The suit further claimed that “information gleaned from these recordings was wrongly transmitted to third parties for targeted advertising and for other purposes.” \nThe case centered on “false accepts,” wherein Google Assistant is alleged to have activated and recorded the user’s communications even if they had not intentionally prompted it to do so with a wake word. TechCrunch reached out to Google for comment.\nAmericans have long suspected that their devices inappropriately spy on them. Those suspicions have led, increasingly, to claims of legal wrongdoing. In 2021, Apple agreed to pay $95 million to settle claims its voice assistant, Siri, had recorded their conversations without a prompt from users.\nGoogle, like other tech giants, has faced other privacy-related litigation in recent years. Last year, the company agreed to pay $1.4 billion to the state of Texas to settle two lawsuits that claimed it had violated the state’s data privacy laws.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Privacy\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google pays $68M to settle claims its voice assistant spied on users",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/GettyImages-2198713751.jpg?w=150"
      ],
      "datePublished": "2026-01-27T00:43:35.000Z",
      "dateModified": "2026-01-27T00:43:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI chip startup Ricursive hits $4B valuation two months after launch",
    "url": "https://techcrunch.com/2026/01/26/ai-chip-startup-ricursive-hits-4b-valuation-two-months-after-launch/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2026266993.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-27T00:13:15.000Z",
    "description": "\nIn Brief\nPosted:\n4:13 PM PST · January 26, 2026\n\nImage Credits:BlackJack3D / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRicursive Intell",
    "body": "\nIn Brief\nPosted:\n4:13 PM PST · January 26, 2026\n\nImage Credits:BlackJack3D / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRicursive Intelligence, a startup building an AI system to design and automatically improve AI chips, has raised $300 million at a $4 billion valuation. The company said Monday the round was led by Lightspeed.\nRicursive says the system will be able to create its own silicon substrate layer and speed up AI chip improvements. Rinse and repeat to get to AGI, the founders say.\nThe Series A comes just two months since the company formally launched with a seed investment led by Sequoia. It has raised $335 million total, reports The New York Times.\nRicursive was founded by former Google researchers CEO Anna Goldie and CTO Azalia Mirhoseini. Their work on a novel reinforcement learning method for designing chip layouts, called AlphaChip, has been used in four generations of Google’s TPU chip, the startup says.\nDST Global, Nvidia’s venture capital arm NVentures, Felicis Ventures, 49 Palms Ventures, and Radical AI are also investors.\nRicursive is not to be confused with the similarly named startup Recursive, reportedly founded by well-known natural language processing neural networks researcher Richard Socher. That Recursive is also in talks to raise a giant round at a $4 billion valuation, Bloomberg reported last week. And it is also working on AI systems that improve themselves.\nAnd these two are not the only new startups working on the concept. As TechCrunch previously reported, Naveen Rao’s new AI hardware startup, named Unconventional AI, is also working on an intelligent substrate. In December it raised a $475 million seed round at a $4.5 billion valuation led by Andreessen Horowitz and Lightspeed Ventures, with participation from Lux Capital and DCVC. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Startups\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI chip startup Ricursive hits $4B valuation two months after launch",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2026266993.jpg?w=150"
      ],
      "datePublished": "2026-01-27T00:13:15.000Z",
      "dateModified": "2026-01-27T00:13:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Some international attendees are skipping 2026 GDC due to safety fears and growing ICE presence",
    "url": "https://techcrunch.com/2026/01/26/some-international-attendees-are-skipping-2026-gdc-due-to-safety-fears-and-growing-ice-presence/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GDC-LinkedInpost.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T22:47:49.000Z",
    "description": "\nThe 2026 Game Developers Conference is shaping up to be a little less international this year if commentary on social media platforms like LinkedIn i",
    "body": "\nThe 2026 Game Developers Conference is shaping up to be a little less international this year if commentary on social media platforms like LinkedIn is an indicator. \nMany members of the international games industry have announced they will skip the event, mainly over concerns about safety, tougher U.S. immigration rules, and a stronger immigration and Customs Enforcement presence. Developers, past GDC attendees, and other industry professionals have taken to platforms like LinkedIn to publicly voice their concerns.\nICE activity in numerous U.S. cities as well as the recent fatal shootings in Minneapolis involving ICE agents have compounded concerns. Renee Nicole Good was killed on January 7, and ICU nurse Alex Pretti lost his life on January 24. Many travelers also said they’re worried about unpredictable border checks and safety concerns.\nAs one person put it, “It’s not worth taking the risk of going.” Another chimed in: “The U.S. is just a very problematic location for an international event.”\nGDC, now rebranded as the “GDC Festival of Gaming,” is scheduled to take place in San Francisco from March 9 to 13.\nOthers cited general concerns over safety as well as cost as factors in their decision not to attend. Some indie developers and small studios have said the costs, which include hotel, food, travel, and the ticket price, are just too high.\nIn response to these concerns, GDC president Nina Brown told Mobilegamer.biz, that the “safety of our community is always our top priority.” In a statement, Brown said the GDC works closely with “local officials and legal experts to monitor U.S. policy changes” and to provide the most up-to-date guidance. Brown also advised international attendees to start their visa applications early and consult with their embassies regarding any special requirements.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n​Brown also outlined several safety measures, including that GDC offers a 24/7 safety hotline, safety training for event staff, and security escorts upon request. San Francisco’s Safety Community Ambassadors program will also be present, providing additional support to attendees throughout the event.\nTechCrunch has also reached out to GDC for comment and will update this article if the organization responds. \nOn the cost front, GDC has introduced a simpler, more affordable ticketing system to make the event more accessible to smaller developers and indie studios. The new Festival Pass replaces the previous All-Access pass and is 45% cheaper, with pricing starting at $649 and providing access to all main event programming.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Some international attendees are skipping 2026 GDC due to safety fears and growing ICE presence",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GDC-LinkedInpost.jpg?w=150"
      ],
      "datePublished": "2026-01-26T22:47:49.000Z",
      "dateModified": "2026-01-26T22:47:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic launches interactive Claude apps, including Slack and other workplace tools",
    "url": "https://techcrunch.com/2026/01/26/anthropic-launches-interactive-claude-apps-including-slack-and-other-workplace-tools/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/mcp-asana-crop.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T18:00:00.000Z",
    "description": "\nClaude users will now be able to call up interactive apps within the chatbot interface, thanks to a new feature announced by Anthropic on Monday.\nIn ",
    "body": "\nClaude users will now be able to call up interactive apps within the chatbot interface, thanks to a new feature announced by Anthropic on Monday.\nIn keeping with Anthropic’s enterprise focus, the launch apps are mostly workplace tools, including Slack, Canva, Figma, Box, and Clay, with a Salesforce implementation expected soon. In each case, the app will enable a logged-in instance of the service that’s accessible to Claude, enabling users to send Slack messages, generate charts, or access cloud files, depending on which apps have been enabled.\n“Analyzing data, designing content, and managing projects all work better with a dedicated visual interface,” Anthropic said in a blog post announcing the feature. “Combined with Claude’s intelligence, you can work and iterate faster than either could offer alone.”\nThe new feature is available to Pro, Max, Team, and Enterprise subscribers, but not free users. Eligible users can activate the tools at claude.ai/directory.\nThe system is similar to OpenAI’s Apps system, which launched in October and enables interactive third-party tools. Both systems of app integrations are built on the Model Context Protocol (MCP), an open standard introduced by Anthropic in 2024. MCP launched support for apps in November, drawing on work from both companies.\nThe new apps will be particularly powerful when integrated with Claude Cowork, an all-purpose agent tool launched by Anthropic last week. Built on top of Claude Code, Cowork lets users assign multistage tasks that draw on large and open-ended datasets — tasks that would have previously required terminal commands. Combined with the new apps feature, Cowork could be granted access to cloud files or ongoing work projects. For example, Cowork could update a marketing graphic in Figma or use new data from the company’s Box instance.\nApps are not available in Cowork at launch, but Anthropic said the integration would be “coming soon.”\nAgentic systems can be unpredictable, and Anthropic’s own safety documentation for Cowork encourages users to monitor the agent closely and not grant any unnecessary permissions.\n“Be cautious about granting access to sensitive information like financial documents, credentials, or personal records,” the company recommends. “Consider creating a dedicated working folder for Claude rather than granting broad access.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic launches interactive Claude apps, including Slack and other workplace tools",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/mcp-asana-crop.jpg?w=150"
      ],
      "datePublished": "2026-01-26T18:00:00.000Z",
      "dateModified": "2026-01-26T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saudi satirist hacked with Pegasus spyware wins damages in court battle",
    "url": "https://techcrunch.com/2026/01/26/saudi-satirist-hacked-with-pegasus-spyware-wins-damages-in-court-battle/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Ghanem_al-Dosari-wiki.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T17:20:07.000Z",
    "description": "\nThe London High Court awarded a Saudi satirist and human rights activist more than £3 million ($4.1 million USD) in damages on Monday after finding “",
    "body": "\nThe London High Court awarded a Saudi satirist and human rights activist more than £3 million ($4.1 million USD) in damages on Monday after finding “compelling evidence” that his phone had been hacked with government-grade spyware.\nGhanem Al-Masarir, a London-based comic whose popular YouTube channel featured videos of him criticizing Saudi Arabia, while earning him millions of viewers, sued the Saudi government in 2019 after claiming his phone was targeted a year earlier with Pegasus, a mobile spyware sold by NSO Group exclusively to governments.\nAl-Masari was also physically assaulted in London in 2018, around the time his phone was targeted. He accused agents working for the de facto leader of Saudi Arabia, Crown Prince Mohammed bin Salman, of staging the attack. Real-world attacks are often used in conjunction with digital surveillance tools like Pegasus, researchers have found.\nThe comic and activist said the attacks on his phone and the physical assault caused deep depression, ending his YouTube career.\nSaudi Arabia rebuffed Al-Masarir’s legal challenge, saying it had state immunity from prosecution, a claim it had successfully argued in an earlier case in which the Saudi leader was accused of orchestrating the murder of Washington Post journalist Jamal Khashoggi in a Saudi consulate in Turkey.\nBut the High Court rejected Saudi’s claim of immunity in Al-Masarir’s legal case, prompting the Kingdom to take no part in the litigation going forward, according to Reuters, which first reported the court ruling.\n“There is a compelling basis for concluding that [al-Masarir’s] iPhones were hacked by Pegasus spyware which resulted in the exfiltration of data from those mobile phones,” wrote Justice Pushpinder Saini in his ruling.\nThe judge said that the hacking was “directed or authorised” by the Saudi government or its agents. Justice Saini also found that the Saudi government was probably responsible for Al-Masarir’s assault.\nIt’s not clear if Saudi Arabia will pay Al-Masarir, or if the government plans to appeal.\nA spokesperson for NSO Group, which makes and sells access to the Pegasus spyware, did not immediately respond to TechCrunch’s request for comment. Neither did a spokesperson for the Saudi Embassy in Washington, D.C.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saudi satirist hacked with Pegasus spyware wins damages in court battle",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Ghanem_al-Dosari-wiki.jpg?w=150"
      ],
      "datePublished": "2026-01-26T17:20:07.000Z",
      "dateModified": "2026-01-26T17:20:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta to test premium subscriptions on Instagram, Facebook, and WhatsApp",
    "url": "https://techcrunch.com/2026/01/26/meta-to-test-premium-subscriptions-on-instagram-facebook-and-whatsapp/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-2152655802.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T23:12:33.000Z",
    "description": "\nMeta plans to test new subscriptions that give people access to exclusive features on it apps, the company told TechCrunch on Monday. The tech giant ",
    "body": "\nMeta plans to test new subscriptions that give people access to exclusive features on it apps, the company told TechCrunch on Monday. The tech giant said the new subscriptions will unlock more productivity and creativity, along with expanded AI capabilities.\nIn the coming months, Meta said it will offer a premium experience on Instagram, Facebook, and WhatsApp that gives users access to special features and more control over how they share and connect, while keeping the core experiences free. Meta doesn’t appear to be locked into one strategy, noting that it will test a variety of subscription features and bundles, and that each app subscription will have a distinct set of exclusive features. \nMeta also shared that it plans to scale Manus, an AI agent it recently acquired for a reported $2 billion, as part of its subscription plans. \nMeta is taking a two-fold approach to Manus. The company is going to integrate Manus into Meta products, while continuing to sell standalone subscriptions to businesses. Meta has already been spotted working on adding a shortcut to Manus AI on Instagram, according to a screenshot shared by reverse engineer Alessandro Paluzzi, who often finds unreleased features while they’re still under development.\nAdditionally, Meta plans to test subscriptions for AI features, such as Vibes video generation. Vibes is Meta’s AI-powered short-form video experience built into the Meta AI app that lets people create and remix AI-generated videos. Although Vibes has been free since its launch last year, Meta now plans to offer freemium access to Vibes video creation, with the option to subscribe to unlock additional video creation opportunities each month. \nWhile it’s unknown what the paid features on WhatsApp and Facebook will look like, Paluzzi notes that the new subscription on Instagram will let users create unlimited audience lists, the ability to see a list of followers who don’t follow you back, and the option to view a Story without the poster seeing that you viewed it. \nIt’s worth noting that the new subscriptions will be separate from Meta Verified. The tech giant says it’s going to use what it learned from Meta Verified to evolve its subscription business to include more offerings it thinks everyday users, creators, and businesses will want.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMeta Verified is aimed at content creators and businesses, as it comes with a verified badge, 24/7 direct support, impersonation protections, search optimization, exclusive stickers, and more. While these features aren’t aimed at everyday users or non-creators, the new subscriptions will be designed for a broader audience.\nThe launch of additional subscriptions will allow Meta to generate more revenue; however, many users may be deterred by subscription fatigue. With so many paid services competing for monthly spending, Meta will have to offer a compelling product to get users to sign up for yet another subscription.\nSnap has proven there is a market for social media subscriptions, as its Snapchat+ offering continues to be a revenue driver. Snapchat+, which starts at $3.99 per month for exclusive features, has topped 16 million subscribers, more than doubling since early 2024.\nMeta says it plans to listen to its community of users and gather feedback as it starts rolling out the subscriptions in the coming months.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta to test premium subscriptions on Instagram, Facebook, and WhatsApp",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-2152655802.jpg?w=150"
      ],
      "datePublished": "2026-01-26T23:12:33.000Z",
      "dateModified": "2026-01-26T23:12:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok attributes recent glitches to a power outage at a US data center",
    "url": "https://techcrunch.com/2026/01/26/tiktok-attributes-recent-glitches-to-a-power-outage-at-a-u-s-data-center/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/09/tiktok-glitch1.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T17:48:50.000Z",
    "description": "\nAs snowstorms pelted the U.S. on Sunday, TikTok users reported widespread issues with the app, like problems loading comments or unexpected behavior ",
    "body": "\nAs snowstorms pelted the U.S. on Sunday, TikTok users reported widespread issues with the app, like problems loading comments or unexpected behavior from the For You page algorithm. For some users, the problems continue to persist.\nThe timing of these outages lines up with the long-awaited creation of a separate U.S. TikTok entity last week, which the U.S. government mandated due to concerns about the Chinese government potentially accessing user data via the app’s former parent company, ByteDance. (Now, ByteDance owns less than 20% of the new TikTok USDS Joint Venture, while managing investors Oracle, Silver Lake, and MGX own 15% each.)\nHowever, the TikTok USDS Joint Venture stated in a post on X that these issues were caused by a power outage at a U.S. data center.\n“Since yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate,” the company said. “We’re working with our data center partner to stabilize our service. We’re sorry for this disruption and hope to resolve it soon.”\n\nSince yesterday we’ve been working to restore our services following a power outage at a U.S. data center impacting TikTok and other apps we operate. We're working with our data center partner to stabilize our service. We're sorry for this disruption and hope to resolve it soon.— TikTok USDS Joint Venture (@tiktokusdsjv) January 26, 2026\n\nAccording to user-reported data from Downdetector, the outage is impacting users across the country.\nTikTok’s reasoning for the glitches is logical, given that more than one million people in the U.S. have been impacted by power outages after the massive storm. But some users are suspicious given how soon the outages occurred after the U.S. joint venture was formally established.\nThe outage also overlaps with ongoing protests in Minneapolis, Minnesota, where thousands of ICE agents have been deployed since early January in what ICE Acting Director Todd Lyons called the “largest immigration operation ever.”\nOn Saturday, border patrol agents shot and killed Alex Pretti, marking ICE’s second murder of a civilian in Minneapolis this month.\nIn the wake of the killing, some TikTok users said they had trouble searching on the app for information about the events in Minneapolis. The app malfunctions then led to panic about the possibility of government censorship. However, TikTok attributes these issues to its concurrent data center outage.\nPeople had also expressed concern over the weekend about TikTok’s updated privacy policy, which includes language that allows TikTok to collect data about users, including their “sexual life or sexual orientation, status as transgender or nonbinary, citizenship or immigration status.” However, as TechCrunch reported, some of these disclosures are not new and had appeared in TikTok’s privacy policy prior to the ownership deal’s close, primarily to comply with California’s Consumer Privacy Act.\nWhile the recent TikTok outages and privacy policy changes seem to be run-of-the-mill problems with bad timing, Americans do have reason to be cautious about social media surveillance — especially in times of political unrest.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok attributes recent glitches to a power outage at a US data center",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/09/tiktok-glitch1.jpg?w=150"
      ],
      "datePublished": "2026-01-26T17:48:50.000Z",
      "dateModified": "2026-01-26T17:48:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Social network UpScrolled sees surge in downloads following TikTok’s US takeover",
    "url": "https://techcrunch.com/2026/01/26/social-network-upscrolled-sees-surge-in-downloads-following-tiktoks-us-takeover/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/upscrolled.png?w=150",
    "tag": "Tech",
    "date": "2026-01-26T20:11:33.000Z",
    "description": "\nIn the wake of TikTok’s U.S. ownership change last week, some users are seeking out alternative platforms. One app gaining traction is UpScrolled, a ",
    "body": "\nIn the wake of TikTok’s U.S. ownership change last week, some users are seeking out alternative platforms. One app gaining traction is UpScrolled, a social network that pledges to remain impartial to political agendas. The app currently ranks 12th overall in Apple’s App Store and second in the social networking category.\nUpScrolled blends familiar features from Instagram and X, letting users share photos, videos, and text posts, discover new content, and send direct messages.\nThe app was founded last year by Issam Hijazi, a Palestinian-Jordanian-Australian technologist, with the aim of giving users a place to “freely express thoughts, share moments, and connect with others,” according to the app’s website. The team behind the app says they’re “building a platform that belongs to the people who use it — not to hidden algorithms or outside agendas.”\n“UpScrolled is the foundation for a digital ecosystem that puts power back into the hands of the people — not the corporations,” Hijazi said in a statement on UpScrolled’s website. “It’s more than just an alternative to Meta, X, or TikTok — it’s a reimagining of what social media should be: a space where creators, communities, and businesses thrive independently, with real control, transparency, and accountability.”\nThe app, available on both iOS and Android, is grappling with a surge of new users but says it’s scaling to keep up with the demand.\nAccording to data from the market intelligence provider Appfigures, UpScrolled saw approximately 41,000 downloads between Thursday, the day the TikTok deal was finalized, and Saturday, accounting for nearly one-third of its lifetime installs. UpScrolled has seen an average of about 14,000 daily downloads since Thursday, representing a 2,850% increase in daily downloads.\nIn total, the app has been downloaded 140,000 times to date, with 75,000 of those being U.S.-based installs.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Well, this is new … You showed up so fast our servers tapped out,” the company wrote in a post on X. “Frustrating? Yes. Emotional? Also yes. We’re a tiny team building what Big Tech stopped being. Right now we’re scaling on caffeine to keep up with what YOU started. Bear with us. We’re on it.”\nThe surge comes as TikTok announced last Thursday that it signed a deal with a group of non-Chinese investors to form a majority American-owned joint venture to keep the social app operating in the U.S. TikTok’s Chinese parent ByteDance owns less than 20% of the new entity, while the venture’s three managing investors — Oracle, private equity firm Silver Lake, and Abu Dhabi-based investment company MGX — each hold a 15% stake. Some users worry that TikTok’s new U.S. investors may have political allegiances to Trump.\nFollowing the takeover, some users accused the app of potentially censoring certain political content. This criticism included a handful of high-profile users, including Senator Chris Murphy and singer Billie Eilish, who raised concerns that TikTok was suppressing or limiting posts criticizing ICE. Additionally, some said they were unable to search for information about ongoing protests in Minneapolis following the killing of Alex Pretti by border patrol agents.\nHowever, TikTok attributed these issues to an ongoing data center outage, which has been impacting its app’s functionality.\nConcerns also grew when TikTok released an updated privacy policy that allows the app to track users’ GPS coordinates, among other things. This led to some users encouraging people to delete the app in favor of alternatives, with UpScrolled being one of the popular choices, largely due to its promise to not shadowban anyone and give “every post a fair chance to be seen.”\nUpScrolled isn’t the only app that’s seeing a surge in users following the takeover. Skylight, a TikTok alternative built on open source technology, says it has now topped over 380,000 sign-ups and is continuing to grow.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Social network UpScrolled sees surge in downloads following TikTok’s US takeover",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/upscrolled.png?w=150"
      ],
      "datePublished": "2026-01-26T20:11:33.000Z",
      "dateModified": "2026-01-26T20:11:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VC firm 2150 raises €210M fund to solve cities’ climate challenges",
    "url": "https://techcrunch.com/2026/01/26/vc-firm-2150-raises-e210m-fund-to-solve-cities-climate-challenges/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/2150-Partners.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T17:29:35.000Z",
    "description": "\nIf you want to solve climate change, there are few better places to start than cities. \n“The city is kind of like this beautiful vampire squid that s",
    "body": "\nIf you want to solve climate change, there are few better places to start than cities. \n“The city is kind of like this beautiful vampire squid that sucks in all the resources,” Jacob Bro, co-founder and partner at 2150, told TechCrunch. “They basically aggregate all the prosperity in the world — 80% of GDP — but also 70% of emissions and all the other resources, all the waste, and all the downsides of the good life.”\nPlenty of investors have raised large funds to tackle climate change in recent years, with many measuring success by returns and carbon reductions. 2150 does the same, but to find fertile ground for investments, it starts by looking at problems and opportunities in cities, specifically.\n“If we look at all the stuff we consume, all the stuff we need to build, to make the urban platform of prosperity operate and thrive, you can identify technologies and the bottlenecks,” Bro said. \nThe climate angle helps give the fund an edge, he said. “Sustainability, if done well, is just better business, right? It’s cheaper, faster, and more independent from geopolitics.”\nThat dual focus has helped 2150 raise a new €210 million second fund from a range of institutional investors and family funds, including Chr. Augustinus Fabrikker, Church Pension Group, the Danish sovereign fund EIFO, Fund of Funds Carbon Equity, Novo Holdings, Islandbridge Capital, Security Trading Oy, and Viessmann Generations Group. The new fund brings the European firm’s assets under management to €500 million.\nIn total, the new fund has 34 limited partners, said Christian Hernandez, co-founder and partner at 2150. “Pretty meaty checks,” he added.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSo far, 2150 has invested in seven companies from the new fund, including AtmosZero, which makes industrial heat pumps; GetMobil, an e-waste recycling startup; Metycle, a scrap and recyclable metals marketplace; and MissionZero, a direct air capture startup. Three others have yet to be announced.\nIn total, 2150 is looking to invest in 20 companies in the second fund. Most startups it writes checks to will be raising Series A rounds, and the checks will total around €5 million to €6 million, Hernandez said. Half of the fund will be reserved for follow-on investments.\nThe partners said they’ll be looking for a range of startups, similar to before. Specifically, though, they’re excited by opportunities in data centers and automation, both of which have been spurred by the recent surge in AI. But for them, AI is more than just an opportunity to invest in energy-related companies. \n“The impact there is more societal than it is climate-related,” Hernandez said. “Europe is expected to lose 100 million people between now and 2040 — just people getting older. The Netherlands already has 50% of their population over the age of 50. So what role does industrial automation help with helping those people be productive, but also generating GDP and funding those people’s pensions?” he said.\nBro said the focus on industrial applications was perhaps obvious in hindsight. “Cities are all supplied by large or small industries at the end of the day,” he said.\nThe focus appears to be paying off. 2150’s portfolio companies mitigated one megaton of carbon emissions last year, Hernandez said. “The fact that a small venture capital fund can already get to the megaton-level scale in only four years, that level of impact, along with the commercial traction, makes me feel like we’re doing the right thing.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VC firm 2150 raises €210M fund to solve cities’ climate challenges",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/2150-Partners.jpeg?w=150"
      ],
      "datePublished": "2026-01-26T17:29:35.000Z",
      "dateModified": "2026-01-26T17:29:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northwood Space secures a $100M Series B and a $50M Space Force contract",
    "url": "https://techcrunch.com/2026/01/27/northwood-space-secures-a-100m-series-b-and-a-50m-space-force-contract/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Disrupt-2024-Bridgit-Mendler.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-27T10:30:00.000Z",
    "description": "\nSpace is an increasingly crowded place thanks to the constant influx of new satellites and it’s only to get more cramped as the cost to get to orbit ",
    "body": "\nSpace is an increasingly crowded place thanks to the constant influx of new satellites and it’s only to get more cramped as the cost to get to orbit falls. \nThose dynamics have brought attention to startup Northwood Space, which has spent the last few years developing more modern and efficient ground-based communications infrastructure. The startup capitalized on that interest in two ways this week. \nThe El Segundo, California-based company announced on Tuesday it has closed a $100 million Series B funding round, led by Washington D.C.-based firm Washington Harbour Partners (which has been on a run of space investments) and co-led by Andreessen Horowitz.\nNorthwood has also secured a $49.8 million contract with the United States Space Force to help upgrade what’s known as the “satellite control network,” which “handles a huge variety of consequential space missions for our government” including tracking and controlling GPS satellites, founder and CEO Bridgit Mendler said on a call with reporters.\nThe funding round and government contract are major milestones for the company, which is just a few years old and only closed its $30 million Series A less than a year ago. \nBut with so much interest in funding space tech, hard tech, and defense tech right now, Mendler said this was an opportunity for her company to grow responsibly and quickly.\n“Yes, this is happening faster than we thought — you know, two fundraises in the same year and large sums of capital,” she said. But, she pointed out, “that’s really what we’re ready for from a production standpoint.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMendler also said the fresh capital will help Northwood keep pace with growing demand, marking an “inflection point in the business.” \n“We get customers coming to us all the time requiring a ground solution, wanting us to help think through a ground problem with them, and we don’t want there to be a resource constraint that blocks us from being able to support that mission,” she said. “And so the resources were very intentionally brought on at this point to support the missions that that are coming forward for us.”\nPart of the attention on Northwood has to do with the fact that what it’s doing — making smaller phased-array antenna systems meant to support or replace older systems that rely on larger dish antennas — remains novel, especially as a vertically-integrated play.\nBut with the volume of data being transmitted to and from satellites likely to keep growing, it’s an advantage Mendler is keen to press.\n“It’s a hard thing to do. It requires a lot of risk, a lot of capital. It requires a lot of diverse skill sets to come together, to be able to really wrap your head around the entire ground [station] problem,” Mendler said. “And so yeah, it’s a big undertaking for us to take, and our bet is that if we can actually do that, if we can really think about ground holistically under one roof, then that produces a ton of value for the industry, and that’s really the right model to have.” \nThis pitch has made sense for prospective commercial customers for a while now. Companies like SpaceX and Amazon, which have massive satellite internet networks in the works, build and operate their own ground stations. But capacity is constrained for other players who typically have to rent space from third-party providers that may not always have availability. \nNorthwood CTO Griffin Cleverly expects the expanded capacity — that the new fundraising will help create — will be most valuable to customers who are “scaling into large constellations, so that may be going from like one or two satellites to dozens or more.”\nRight now, Northwood’s “portal” sites can handle eight satellite links, he said. By the end of 2027, though, he expects the next-generation of Northwood’s ground stations to handle 10 to 12, with the company’s overall network capable of communicating with “hundreds” of satellites.” \nWith the Space Force contract, what Northwood is selling has clearly become an attractive option for the government. \nIt’s not surprising the newest armed forces branch is starting with the satellite control network (SCN), though. In 2023, a Government Accountability Office (GAO) report noted that the Department of Defense has been aware of capacity issues with the SCN since 2011.\n“Satellite users who rely on the SCN and whom GAO interviewed said that this increased demand, and resulting limits on system availability, could compromise their missions in the future,” the report stated. \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northwood Space secures a $100M Series B and a $50M Space Force contract",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Disrupt-2024-Bridgit-Mendler.jpg?w=150"
      ],
      "datePublished": "2026-01-27T10:30:00.000Z",
      "dateModified": "2026-01-27T10:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTubers sue Snap for alleged copyright infringement in training its AI models",
    "url": "https://techcrunch.com/2026/01/26/youtubers-sue-snap-for-alleged-copyright-infringement-in-training-its-ai-models/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/evan-spiegel.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T21:43:14.000Z",
    "description": "\nA group of YouTubers who are suing tech giants for scraping their videos without permission to train AI models has now added Snap to their list of de",
    "body": "\nA group of YouTubers who are suing tech giants for scraping their videos without permission to train AI models has now added Snap to their list of defendants. The plaintiffs — internet content creators behind a trio of YouTube channels with roughly 6.2 million collective subscribers — allege that Snap has trained its AI systems on their video content for use in AI features like the app’s “Imagine Lens,” which allows users to edit images using text prompts.\nThe plaintiffs earlier filed similar lawsuits against Nvidia, Meta, and ByteDance over similar matters.\nIn the newly filed proposed class action suit, filed on Friday in the U.S. District Court for the Central District of California, the YouTubers specifically call out Snap for its use of a large-scale, video-language dataset known as HD-VILA-100M, and others that were designed for only academic and research purposes. To use these datasets for commercial purposes, the plaintiffs claim Snap circumvented YouTube’s technological restrictions, terms of service, and licensing limitations, which prohibit commercial use.\nThe suit is seeking statutory damages and a permanent injunction to stop the alleged copyright infringement going forward.\nThe case itself is being led by the creators behind the h3h3 YouTube channel, with 5.52 million subscribers, and the smaller golfing channels MrShortGame Golf and Golfholics.\nIt’s now one of many lawsuits pitting content creators against AI model providers, which have included copyright disputes from publishers, authors, newspapers, user-generated content sites, artists, and more. It’s also not the first case to hail from a YouTuber. According to the nonprofit organization Copyright Alliance, over 70 copyright infringement cases have been filed against AI companies.\nIn some cases, like one between Meta and a group of authors, a judge has ruled in favor of the tech giant. In others, like the case between Anthropic and a group of authors, the AI giant has settled with and paid out the plaintiffs to resolve their claims. Many cases are still in active litigation.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSnap was asked for comment. TechCrunch will update if one is provided. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTubers sue Snap for alleged copyright infringement in training its AI models",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/01/evan-spiegel.jpg?w=150"
      ],
      "datePublished": "2026-01-26T21:43:14.000Z",
      "dateModified": "2026-01-26T21:43:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vinod Khosla publicly disavows Keith Rabois’ comments on ICE shooting",
    "url": "https://techcrunch.com/2026/01/26/vinod-khosla-publicly-disavows-keith-rabois-comments-on-ice-shooting/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/2243821602.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-26T21:49:12.000Z",
    "description": "\nTo understand the stance of an unwavering Trump loyalist after a federal border patrol agent shocked the nation this weekend by shooting an American ",
    "body": "\nTo understand the stance of an unwavering Trump loyalist after a federal border patrol agent shocked the nation this weekend by shooting an American citizen in Minneapolis, look no further than Khosla Ventures partner Keith Rabois.\nRabois’ public support for Border Patrol’s actions in the killing of Alex Pretti, made via posts on X, was so vehement that Khosla Ventures partner Ethan Choi and firm founder Vinod Khosla both publicly disavowed it.\nRabois argued that Pretti was at fault, writing that the protester was committing a “felony.” One of Rabois’ posts said, “no law enforcement has shot an innocent person. illegals are committing violent crimes every day.” Another said: “he unequivocally attempted to draw his weapon. fuck you.” In another post that discussed citizens’ ability to exercise their First, Second, and Fourth Amendment rights, the VC weighed in: “yes but interfering w a law enforcement operation is not protected by any of those amendments.”\nAmong other comments, Rabois went on to say he doesn’t believe that the Minneapolis police could be credible sources in an investigation: “i don’t think you should ask any law enforcement in MN. But i am very open to reading views from any other urban jurisdiction.” He instead blamed the city’s police for the situation: “Because the MN police’s refusal to cooperate is exactly what is leading to these treacherous conditions (for everyone).”\nAnd so on.\nX reacted as you might expect. Other Trump supporters cheered Rabois on, while those who condemn ICE’s actions argued with and condemned the investor.\nThe situation spiraled so much that when one person suggested that founders remove Khosla Ventures from their cap tables altogether, Khosla partner Choi piped up to distance himself.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nChoi posted: “I want to make it clear that Keith doesn’t represent everyone’s views here at @khoslaventures, at least not mine. What happened in Minnesota is plain wrong. Don’t know how you could really see it differently. Sad to see a person’s life taken unnecessarily.”\nThen the founder of the firm, Khosla himself, stood by Choi. “I agree with @EthanChoi7. Macho ICE vigilantes running amuck [sic] empowered by a conscious-less administration,” he said in his post on X.\n\nI agree with @EthanChoi7 . Macho ICE vigilantes running amuck empowered by a conscious-less administration. The video was sickening to watch and the storytelling without facts or with invented fictitious facts by authorities almost unimaginable in a civilized society. ICE… https://t.co/ASvjZQB0Gg— Vinod Khosla (@vkhosla) January 26, 2026\n\nUnder normal circumstances, opposing political points of view can be a strength for a VC firm. Whatever anyone thinks of Rabois’ politics, he’s been a very successful investor backing such companies as DoorDash, Affirm, Faire, and Stripe, as well as co-founding Opendoor, among other startups.\nBut sometimes they are internally disruptive. \nSequoia was embroiled in a controversy over partner Shaun Maguire’s comments attacking New York City mayoral candidate Zohran Mamdani. Maguire (whose comments over the weekend on ICE align with Rabois’) remains as an investor at Sequoia. But its leader at the time of the Mamdani controversy, Roelof Botha, stepped down as senior steward in November. Botha was replaced by Alfred Lin and Pat Grady (neither of whom weighed in over the weekend).\nIn this case, the rift between Khosla partners spilled out publicly. But note that Khosla did not directly chastise Rabois. (The company did not respond to our request for comment.)\nWhen Khosla Ventures rehired Rabois in 2024, the firm knew it was bringing in an outspoken, self-proclaimed “contrarian” into its ranks, of the ilk that liked to blame the “woke” and praise President Trump. For Rabois’ part, he knew he would be working for a vocal Trump critic (Vinod Khosla has made his point of view on Trump very clear for years).\nWill there be continued fallout? Perhaps — but only if founders really do start dumping Khosla Ventures from their cap tables.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vinod Khosla publicly disavows Keith Rabois’ comments on ICE shooting",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/2243821602.jpg?w=150"
      ],
      "datePublished": "2026-01-26T21:49:12.000Z",
      "dateModified": "2026-01-26T21:49:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rad Power Bikes reaches deal to sell itself for $13.2M",
    "url": "https://techcrunch.com/2026/01/26/rad-power-bikes-reaches-deal-to-sell-itself-for-13-2-million/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/588593-Footagepull.02_48_44_09.Still174-1ced35-original-1745969357.png?w=150",
    "tag": "Tech",
    "date": "2026-01-26T19:56:33.000Z",
    "description": "\nElectric bike company Rad Power Bikes has reached a deal to sell itself to a company called Life Electric Vehicles Holdings (or Life EV) for around $",
    "body": "\nElectric bike company Rad Power Bikes has reached a deal to sell itself to a company called Life Electric Vehicles Holdings (or Life EV) for around $13.2 million, a little more than a month after entering the bankruptcy process.\nFlorida-based Life EV bills itself as a “developer, manufacturer, and distributor in the light electric vehicle industry.” It offers a number of electric bikes for sale on its website, although most of them were labeled as “sold out” at the time this article was published.\nA filing to the bankruptcy docket over the weekend shows that five entities participated in an auction on the Rad Power assets on January 22. The first bid came in at $8 million, and parties traded bids until Life Electric Vehicles came away as the winner. When accounting for Rad Power’s liabilities, the total value of the bid is $14.9 million.\nAnother e-bike company called Retrospec had the second-highest bid of $13 million and is being labeled as the “backup bidder” in case the deal with Life EV falls through. The bids were a steep discount to Rad Power’s peak $1.65 billion valuation, which was reached in October 2021, per PitchBook. The company has raised a total of $329.2 million, according to PitchBook data.\nThe acquisition still needs to be approved by the bankruptcy judge.\nRad Power is not the only company in the micromobility world to seek bankruptcy protection in recent years. Peers like VanMoof and Cake went through restructurings and found new owners. Scooter company Bird also went through the bankruptcy process. \nIt’s not clear what Life EV plans to do with Rad Power; Life EV CEO Robert Provost directed questions to Rad Power. “There is still a process underway and there is an exciting future being planned for Rad Power,” he wrote in a message.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTechCrunch was unable to reach Rad Power for comment; this article will be updated if the company responds.\nLike many of those peers, Rad Power saw a huge increase in sales during the pandemic but struggled as that momentum dried up.\nThe company went through multiple rounds of layoffs in recent years, juggled CEOs, and more recently had trouble with some of its older batteries catching fire. The Consumer Product Safety Commission found 31 reported fires tied to the batteries.\nRad Power told TechCrunch at the time that it “firmly stands behind our batteries and our reputation as leaders in the e-bike industry, and strongly disagrees with the CPSC’s characterization of certain Rad batteries as defective or unsafe.”\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rad Power Bikes reaches deal to sell itself for $13.2M",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/588593-Footagepull.02_48_44_09.Still174-1ced35-original-1745969357.png?w=150"
      ],
      "datePublished": "2026-01-26T19:56:33.000Z",
      "dateModified": "2026-01-26T19:56:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok alternative Skylight soars to 380K+ users after TikTok US deal finalized",
    "url": "https://techcrunch.com/2026/01/26/tiktok-alternative-skylight-soars-to-380k-users-after-tiktok-u-s-deal-finalized/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/Three-Screens.png?w=150",
    "tag": "Tech",
    "date": "2026-01-26T18:20:48.000Z",
    "description": "\nSkylight, a TikTok alternative built on open source technology, is benefiting from concerns that arose over TikTok U.S.’s change in ownership last we",
    "body": "\nSkylight, a TikTok alternative built on open source technology, is benefiting from concerns that arose over TikTok U.S.’s change in ownership last week. The startup, a maker of a short-form, vertical video app similar to TikTok, says it has now topped over 380,000 users and is continuing to grow after a busy weekend.\nLaunched last year and backed by Mark Cuban and other investors, Skylight’s mobile app is built on the AT Protocol, the technology that also powers the decentralized X rival Bluesky, which now has north of 42 million users.\nSkylight, co-founded by CEO Tori White and CTO Reed Harmeyer, offers a built-in video editor; user profiles; support for likes, commenting, and sharing; and the ability for community curators to create custom feeds for others to follow.\nImage Credits:Skylight\nThe app now has over 150,000 videos uploaded directly to the platform. It can also stream videos from Bluesky because of its AT Protocol integration. \nHarmeyer said Saturday that 1.4 million videos were played on the app the day before, up 3x over the past 24 hours. The app had also seen sign-ups increase more than 150%. Other noteworthy stats include over a 50% increase in returning users, over 40% rise in video played on average, and over 100% increase in posts created.\nThis surge was likely triggered by concerns over TikTok’s change in ownership and its unfortunately timed technical glitches.\nTikTok had announced on January 22 the establishment of the TikTok USDS Joint Venture LLC, designed to comply with Trump’s executive order requiring the company’s U.S. operations be sold to a group of American investors. TikTok’s Chinese parent ByteDance will now own less than 20% of the new entity.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe deal was a result of increased tensions between the U.S. and China, which led to concerns that TikTok could be a threat to national security, both by collecting data on U.S. citizens and through algorithmic influence. Now, however, some of TikTok’s users are more worried about the new American investors and their allegiance to Trump.\nThose concerns grew to a head when TikTok pushed out an updated privacy policy, which includes permission to track users’ GPS coordinates, among other things. Users also pointed to language in the privacy policy that said the app would track immigration status. Although that language was not new, and its inclusion has to do with adherence to state privacy laws, some users began encouraging people to delete the app.\nWhile it’s unknown how many TikTok users actually followed through, what is clear is that some people sought out alternatives. Over the weekend, Skylight’s CEO, Tori White, said the app added around 20,000 new users and is continuing to grow. So far this January, the app has seen around 95,000 monthly active users.\nWhite credited the app’s more open and customizable nature as the force behind its growth. \nWhile Skylight has made notable gains, it’s still overshadowed by TikTok and its 200 million monthly active U.S. users. Still, Skylight’s founders believe their approach provides an opening for growth. \n“We’ve seen what happens when one person dictates what’s pushed into people’s feeds,” White told TechCrunch. “Not only does it harm a creator’s connection with their followers, but the entire health of the platform. That’s why we built Skylight Social on open standards. We wanted creator and user power to be guaranteed by the technology. Not an empty promise, but an irrevocable right.”\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok alternative Skylight soars to 380K+ users after TikTok US deal finalized",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/Three-Screens.png?w=150"
      ],
      "datePublished": "2026-01-26T18:20:48.000Z",
      "dateModified": "2026-01-26T18:20:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Obvious Ventures lands fund five with a 360-degree view of planetary, human, economic health",
    "url": "https://techcrunch.com/2026/01/26/obvious-ventures-lands-fund-five-with-a-360-degree-view-of-planetary-human-economic-health/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Obvious-Five-high-rez39.png?w=150",
    "tag": "Tech",
    "date": "2026-01-26T18:00:00.000Z",
    "description": "\nObvious Ventures, the firm co-founded by Twitter’s Evan Williams, has raised a fifth fund, and this one, just like its predecessors, comes with a “fu",
    "body": "\nObvious Ventures, the firm co-founded by Twitter’s Evan Williams, has raised a fifth fund, and this one, just like its predecessors, comes with a “fun” number: $360,360,360.\n“We invest in the frontiers of math and science and physics, and we like to celebrate math in our fund numbers as well,” James Joaquin (pictured far right), the firm’s co-founder and managing director, told TechCrunch.\nThe firm’s first fund was $123,456,789, and the second was $191,919,191 (a palindromic number that reads the same forward and backwards). The third was $271,828,182 (which mathematicians and engineers instantly recognize as e, or Euler’s number), while the fourth fund, announced in mid-2022, continued the tradition as another palindrome at $355,111,553.\nIf you haven’t guessed it by now, the meaning of Obvious Ventures’ newest fund size is a little less about geeky math and more about the firm’s investing philosophy. Twelve years into its journey, Obvious says the figure represents a full-circle perspective on its three broad focus areas: planetary health, human health, and economic health.\n“We love the metaphor of taking a 360-degree view in each of those areas,” Joaquin said. “You have to be a student of the past to understand what’s worked and what hasn’t worked.”\nWhat’s working for the firm, according to Joaquin, is keeping its fund sizes small enough so that a single investment, if it becomes a durable public company, has the opportunity to return the entire fund. Joaquin likely placed an emphasis on durability in part because one of Obvious Ventures’ initial winners, Beyond Meat, reached a market capitalization of over $14 billion shortly after its 2019 IPO, but had fallen to below a billion by late 2022.   \nStill, Joaquin says the firm has seen meaningful cash distributions to limited partners from all of its core funds, and it boasts several companies with successful public-market exits. In 2015, Obvious Ventures invested in the satellite imagery company Planet Labs, which went public via a SPAC in 2021 and is currently valued at approximately $8.5 billion. Meanwhile, its Series A investment in Recursion Pharmaceuticals maintains a market capitalization of over $2 billion.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nObvious is also an early investor in the HR and payroll platform Gusto, which was most recently valued at more than $9 billion in the private market and is widely considered to be on an IPO trajectory.\nIn a venture capital environment where only 17% of firms successfully raise more than three funds, per research from Sapphire Partners, Obvious Ventures’ latest fundraise solidifies the firm as an established VC player.\n“We made it to fund five, which is actually a big deal in the venture landscape,” Joaquin said.\nObvious Ventures may take a playful approach to fund sizes, but its focus on investing in startups that make a positive impact on the world is serious. Joaquin pointed to several investments in each of the firm’s three pillars.\nWithin the planetary health sector, the firm invested in Zanskar, a startup using proprietary data and AI to identify and harness geothermal energy, one of the most cost-effective power sources available. Just last week, Zanskar announced a $115 million Series C. Obvious Ventures, which led the company’s previous round, is particularly excited about the investment. Joaquin noted that the geothermal power harnessed by Zanskar can help fuel energy-hungry AI data centers.\nIn its human health strategy, Obvious Ventures touted its investment in Inceptive, an AI platform for molecule development. Inceptive was founded by Jakob Uszkoreit, one of the primary authors of the seminal “Attention Is All You Need” paper, which introduced the transformer architecture, the breakthrough behind generative AI.\nIn the area of economic health, Joaquin pointed to Dexterity Robotics. The company, which was valued at $1.65 billion last year, builds humanoids to handle “dull, dirty, and dangerous” tasks currently performed by humans in warehouses and factories.\nIn addition to Joaquin, Obvious Ventures has four active investors, including co-founder Vishal Vasishth. (Ev Williams remains a co-founder and an adviser.) The firm intends to make approximately 10 investments annually, with check sizes ranging from $5 million to $12 million for seed and Series A startups.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Obvious Ventures lands fund five with a 360-degree view of planetary, human, economic health",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Obvious-Five-high-rez39.png?w=150"
      ],
      "datePublished": "2026-01-26T18:00:00.000Z",
      "dateModified": "2026-01-26T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]