[
  {
    "title": "YouTube TV is giving customers a $20 credit for Disney blackout",
    "url": "https://techcrunch.com/2025/11/09/youtube-tv-is-giving-customers-a-20-credit-for-disney-blackout/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1184040131.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T21:40:00.000Z",
    "description": "YouTube TV subscribers unhappy about going more than a week without ESPN, ABC, and other Disney networks will be getting a $20 credit that can be applied to their next billing statement.",
    "body": "\nYouTube TV subscribers unhappy about going more than a week without ESPN, ABC, and other Disney networks will be getting a $20 credit that can be applied to their next billing statement.\nVariety first reported on the credit, and a YouTube spokesperson confirmed the news to TechCrunch. The company says the credits are rolling out now, with subscribers receiving emailed instructions about how to apply it.\nDisney’s channels were pulled from the subscription TV service on October 31. YouTube says that if it reaches a deal, those channels will be restored within a matter of hours. As with similar disputes, this one appears to revolve around pricing, with YouTube criticizing Disney’s supposed price hike and Disney saying YouTube is “refusing to pay fair rates for our channels.”\nThe subscription TV service’s last dispute with Disney was in 2022, leading YouTube TV to offer customers a $15 credit after Disney programming was removed for a day.\n"
  },
  {
    "title": "Slow Ventures holds a ‘finishing school’ to help founders learn to be fancy",
    "url": "https://techcrunch.com/2025/11/09/slow-ventures-holds-a-finishing-school-to-help-founders-learn-to-be-fancy/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/wine-glass-unsplash.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T21:58:31.000Z",
    "description": "In Brief Posted: 1:58 PM PST · November 9, 2025  Image Credits:Zan Lazarevic/Unsplash (opens in a new window)  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Slow Ventures hosted a three-hour “Etiquette Finishing...",
    "body": "\nIn Brief\nPosted:\n1:58 PM PST · November 9, 2025\n\nImage Credits:Zan Lazarevic/Unsplash (opens in a new window)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSlow Ventures hosted a three-hour “Etiquette Finishing School” this week, covering topics like the perfect handshake, public speaking, and office decorum. There was even a fashion show with models showing off different looks for different occasions, and then a closing lesson about caviar and wine.\nThe San Francisco Standard reports that a few hundred founders applied for the free program, held at the Four Seasons in SF’s financial district, with 50 founders accepted. Most of the attendees were male.\nApparently the idea started as a joke, with Slow Ventures sussing out interest at Y Combinator’s Demo Day. And while YC CEO Garry Tan reportedly told founders not to attend, Tan posted on X that he has “no beef with Slow Ventures,” while writing, “You don’t need finishing school. You need to build something great, make your users happy, and have craftsmanship.”\nOne unnamed founder told The Standard that they attended to learn how to be “less feral.”\n“Tech is no longer playful and cute,” Slow Ventures general partner Sam Lessin reportedly told the audience. “It’s taking people’s jobs and changing environments. Everyone’s threatened by it, which means you need to be like, ‘I’m here and respectful,’ as opposed to ‘I’m here and intentionally disrespectful.’”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Venture\n"
  },
  {
    "title": "Apple reportedly plans ambitious satellite-powered iPhone features",
    "url": "https://techcrunch.com/2025/11/09/apple-reportedly-plans-ambitious-satellite-powered-iphone-features/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/Apple-iphone-16.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T17:42:00.000Z",
    "description": "While Apple’s iPhone already supports texting, calling emergency services, and contacting roadside assistance via satellite connectivity, the company may have many more satellite-powered features in the works.",
    "body": "\nIn Brief\nPosted:\n9:42 AM PST · November 9, 2025\n\nImage Credits:Brian Heater\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhile Apple’s iPhone already supports texting, calling emergency services, and contacting roadside assistance via satellite connectivity, the company has many more satellite-powered features in the works, according to Bloomberg’s Mark Gurman.\nIn-development features reportedly include an API allowing app makers to support satellite connections in their own apps, a version of Apple Maps that allows users to navigate without a cell or Wi-Fi connection, adding photos to messaging, and increased support for “natural usage,” allowing users to connect to a satellite even if their phone isn’t pointed directly at the sky.\nAll of these features would potentially increase the usability of iPhones when their owners are outside the range of traditional cell networks. Another potential upgrade, first reported by The Information, could improve 5G networks by allowing them to connect to satellites for increased coverage.\nThe basic features would be free, Gurman says, with customers paying carriers for more advanced support. In addition, Apple’s satellite partner Globalstar reportedly needs to improve its infrastructure to support these upgrades, which Apple is helping to finance.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Hardware\n"
  },
  {
    "title": "AI PowerPoint-killer Gamma hits $2.1B valuation, $100M ARR, founder says ",
    "url": "https://techcrunch.com/2025/11/10/ai-powerpoint-killer-gamma-hits-2-1b-valuation-100m-arr-founder-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/10/GettyImages-1569337822.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T19:28:03.000Z",
    "description": "In Brief Posted: 11:28 AM PST · November 10, 2025  Image Credits:Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Gamma, a startup that creates AI-generated presentations, websites, and social media...",
    "body": "\nIn Brief\nPosted:\n11:28 AM PST · November 10, 2025\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGamma, a startup that creates AI-generated presentations, websites, and social media posts, announced on Monday a $68 million Series B round at a $2.1 billion valuation led by Andreessen Horowitz. \nCo-founder and CEO Grant Lee posted on X that the company has profitably hit $100 million in ARR, with 70 million users. The startup hit $50 million profitably in its first two years, Lee previously posted. Gamma last raised a $12 million Series A round led by Accel in 2024. \nGamma isn’t exactly a new-to-the-scene AI startup (at least by AI standards). It was founded in late 2020, according to Lee’s LinkedIn, with its product first launching in 2022. \nIts more cautious raising trajectory (by AI standards) helped it hit a double unicorn valuation on a total fundraising of about $90 million. This was achieved with only about 50 employees, Lee said. And the round included a $20 million secondary offering that gave liquidity to early employees, the company tells TechCrunch. The latest round also included participation from Accel, Uncork Capital, and its other backers include South Park Commons, Hustle Fund and others. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n"
  },
  {
    "title": "Consolidation begins to hit the carbon credit market",
    "url": "https://techcrunch.com/2025/11/10/consolidation-begins-to-hit-the-carbon-credit-market/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/06/Big-Lonely-Doug.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T16:29:57.000Z",
    "description": "Carbon management startup Carbon Direct is buying another carbon credit startup, Pachama, the companies announced today. Pachama laid off around 20 employees this summer as voluntary carbon markets softened....",
    "body": "\nCarbon management startup Carbon Direct is buying another carbon credit startup, Pachama, the companies announced today.\nPachama laid off around 20 employees this summer as voluntary carbon markets softened. The company had attracted investments from a range of prominent names, including Amazon’s Climate Pledge, Breakthrough Energy Ventures, Lowercarbon Capital, and several celebrity angel investors, including Ellen DeGeneres, Laura Dern, and Serena Williams.\n“The current uncertain and volatile financial, economic, and geopolitical climate, added to the anti-ESG agenda in the U.S., is indeed having an effect on corporate sustainability budgets,” Diego Saez Gil, CEO of Pachama, told Trellis when the layoffs happened. “The impact is especially acute in the voluntary carbon market, which was already in a moment of correction.”\nPachama had raised $88 million, while Carbon Direct had raised $60.8 million, according to PitchBook. Terms of the deal were not disclosed.\nPachama was focused on nature-based carbon credits, which typically result when forests are either restored or preserved. Carbon Direct, on the other hand, is more of a carbon market advisory and accounting firm, helping companies track and report their carbon footprints and then vet carbon credits to offset them.\nThe carbon markets have been roiled by uncertainty in the last few years, and not all of it has been the result of political whiplash in the U.S. and elsewhere. Voluntary carbon markets have come under fire for falling short of their promises. \nFor example, a major investigation by The Guardian found that more than 90% of one verifier’s credits did not actually result in any carbon reductions. One of the biggest challenges facing nature-based carbon credits is the question of whether forests protected by the purchases were threatened with destruction in the first place.\nAnd while large companies have been dialing back their publicity around ESG measures, many are still interested in sticking to their net-zero promises. Carbon Direct customers include Microsoft, Shopify, American Express, JP Morgan, Alaska Airlines, and BlackRock.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google brings Gemini to the Google TV Streamer",
    "url": "https://techcrunch.com/2025/11/10/google-brings-gemini-to-the-google-tv-streamer/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/Google-TV-Streamer-set-up.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T19:28:57.000Z",
    "description": "Google announced on Monday that it’s starting to roll out Gemini to the Google TV Streamer, replacing Google Assistant. The tech giant says the change will enable users to use their voice more naturally to...",
    "body": "\nGoogle announced on Monday that it’s starting to roll out Gemini to the Google TV Streamer, replacing Google Assistant. The tech giant says the change will enable users to use their voice more naturally to access content and more. \nFor example, users can now ask something like, “I like dramas but my wife likes comedies. What’s a movie we can watch together?” when looking for movie recommendations. \nOr, users could quickly catch up on a show they’re returning to by asking something like, “What happened at the end of Outlander last season?” In another example, Google says users can even ask something like “What’s the new hospital drama everyone’s talking about?”\nGoogle says Gemini for TV goes beyond entertainment, as users can ask the AI assistant any other type of question as well, just like they can with Gemini on their phone.\nFor example, users could bring learning to their TV by asking Gemini to “Explain why volcanoes erupt to my third grader.” Gemini can also guide users through DIY projects or recipes with YouTube videos, Google says. \nTo access Gemini on the Google TV Streamer, you need to press your remote’s microphone button. \nGoogle says the update is rolling out “over the next few weeks” to users aged 18 and older. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe move comes as Google announced back in September that it was introducing Gemini for Google TV to select TCL devices. The company said at the time that later in the year, Gemini would be arriving on the 2025 Hisense U7, U8, and UX models, and 2025 TCL QM7K, QM8K, and X11K models. \nIn addition to the Google TV Streamer, Gemini is also available on the Walmart Onn 4K Pro streaming device.\nMonday’s announcement doesn’t come as a surprise, as the change is part of Google’s plans to replace Google Assistant with Gemini across all of its devices and platforms. Plus, the company had announced at CES in January that Gemini would be coming to Google TV this year.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Wikipedia urges AI companies to use its paid API, and stop scraping",
    "url": "https://techcrunch.com/2025/11/10/wikipedia-urges-ai-companies-to-use-its-paid-api-and-stop-scraping/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T18:30:59.000Z",
    "description": "Image Credits:Nikolas Kokovlis / NurPhoto / Getty Images\t \t \t\t\t\t\t\t10:30 AM PST · November 10, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Wikipedia on Monday laid out a simple plan to ensure its website continues to be supported in...",
    "body": "\n\t\n\t\tImage Credits:Nikolas Kokovlis / NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t10:30 AM PST · November 10, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWikipedia on Monday laid out a simple plan to ensure its website continues to be supported in the AI era, despite its declining traffic. \nIn a blog post, the Wikimedia Foundation, the organization that runs the popular online encyclopedia, called on AI developers to use its content “responsibly” by ensuring its contributions are properly attributed and that content is accessed through its paid product, the Wikimedia Enterprise platform.\nThe opt-in, paid product allows companies to use Wikipedia’s content at scale without “severely taxing Wikipedia’s servers,” the Wikimedia Foundation blog post explains. In addition, the product’s paid nature allows AI companies to support the organization’s nonprofit mission.\nWhile the post doesn’t go so far as to threaten penalties or any sort of legal action for use of its material through scraping, Wikipedia recently noted that AI bots had been scraping its website while trying to appear human. After updating its bot-detection systems, the organization found that its unusually high traffic in May and June had come from AI bots that were trying to “evade detection.” Meanwhile, it said that “human page views” had declined 8% year-over-year.\nNow Wikipedia is laying out its guidelines for AI developers and providers, saying that generative AI developers should provide attribution to give credit to the human contributors whose content it uses to create its outputs.\n“For people to trust information shared on the internet, platforms should make it clear where the information is sourced from and elevate opportunities to visit and participate in those sources,” the post reads. “With fewer visits to Wikipedia, fewer volunteers may grow and enrich the content, and fewer individual donors may support this work.”\nEarlier this year, the organization released its AI strategy for editors, which said it would use AI to help editors with workflows around tedious tasks, automating translation, and other tools that help its editors, not replace them.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Amazon Music allows users in Canada to chat and stream music with each other",
    "url": "https://techcrunch.com/2025/11/10/amazon-music-allows-users-in-canada-to-chat-and-stream-music-with-each-other/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Fan-GroupsAmazonMusic.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T15:00:00.000Z",
    "description": "Amazon Music announced on Monday the launch of “Fan Groups,” a new beta feature that lets users create and join groups based on their favorite genres and artists. The feature allows fans to chat, post, and...",
    "body": "\nAmazon Music announced on Monday the launch of “Fan Groups,” a new beta feature that lets users create and join groups based on their favorite genres and artists. The feature allows fans to chat, post, and listen to songs shared within these groups.\nThe feature is currently being tested in Canada on iOS and Android devices.\nUsers can access Fan Groups through the “Find” tab located beneath the search bar at the top of the app. From there, they can explore over 30 different groups dedicated to various musical interests, ranging from indie rock and country to Punjabi and K-pop, according to a company blog post.\nGroup members can create new posts, participate in ongoing chat threads, and share or save recommended songs. Users can also stream music without leaving the conversation or the group — they can simply tap the play button at the top to listen to all the songs added, or navigate to the separate “Music” tab next to “Posts.”\nNotably, artists can join these groups, giving them a new way to connect with fans directly. They can share exclusive content, interact more personally, and build stronger communities with their supporters.\nImage Credits:Amazon Music\nAnyone can set up a new group, and administrators can mute members and delete messages, a company spokesperson told TechCrunch. Users can report content and can block other members if needed. \nThis new feature represents Amazon’s strategy to compete with Spotify, which has been working to engage users through various social features. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSpotify introduced a messaging feature in August and also a “Jam” feature that enables users to co-create playlists with friends and listen to songs together. \nSoundCloud also offers a commenting feature and has recently updated its platform to include new social functionalities, such as playlists based on what friends are listening to and a direct messaging tool for artists. Another platform, Stationhead, allows users to listen to music together during livestreaming parties.\nFan Groups is set to roll out to customers in the U.S. and other markets beginning next year.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sapphire Sport spins out, rebrands as 359 Capital with $300M AUM",
    "url": "https://techcrunch.com/2025/11/10/sapphire-sport-spins-out-rebrands-as-359-capital-with-300m-aum/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/Tonal-2-Screen-Interaction.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T14:57:06.000Z",
    "description": "Nearly seven years after announcing its first fund, Sapphire Sport — the venture fund focused on sports, media, and entertainment — is spinning out from Sapphire Ventures. The fund will rebrand as an...",
    "body": "\nNearly seven years after announcing its first fund, Sapphire Sport — the venture fund focused on sports, media, and entertainment — is spinning out from Sapphire Ventures. The fund will rebrand as an independent venture firm, 359 Capital.\nThe firm’s new name is a tribute to the sub-four-minute mile, a feat once deemed humanly impossible but ultimately achieved through rigorous dedication and perseverance. 359 Capital co-founder and managing partner Michael Spirito said that the name reflects the firm’s core principle of helping its portfolio founders achieve the impossible.\nThe separation from Sapphire Ventures, an investment firm with about $11 billion in assets under management, was always on “the vision board,” said Spirito. “We’re all grown up and ready to leave home.”\nSapphire Sport, which is currently halfway through investing its second fund of $181 million, has always maintained a separate group of limited partners from Sapphire Ventures. Its LPs are all deeply tied to the sports industry, including major names like City Football Group, adidas, AEG, Madison Square Garden, Sinclair, and dozens of team owners.\n“When we started in 2019, the name Sapphire Sport wasn’t just alliterative and sounded cool,” Spirito said. “Sport captured the LP group.”\nSeven years later, the sports-focused LPs still leverage their relationship with the firm to gain insights into emerging tech companies across the media and sports landscape, Spirito said.\nSome of the startups 359 Capital has backed include Beehiiv, a creator-focused newsletter; an online casino, Betty Labs; a sports media platform; Overtime, an AI search engine; Perplexity, a successful AI browser; and Tonal, a home gym system.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe firm’s entire portfolio of 30 companies and all of its investment staff will move over to 359 Capital. The transitioning staff includes Spirito, co-founders of Sapphire Ventures David Hartwig and Doug Higgins, and newly promoted partner Rico Mallozzi.\nAs 359 Capital, the firm will continue to focus primarily on Series A and Series B startups, writing checks between $2 million to $10 million. The firm will continue to invest from its second fund through the first half of 2027, Spirito said.\n359 Capital will have high-profile competition in the world of sports-focused venture capital. Courtside Ventures, backed by Shaquille O’Neal and Michael Jordan, is in the process of raising a fourth fund of $100 million, according to an SEC filing.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Blue Origin scrubs second New Glenn launch, will try again November 12",
    "url": "https://techcrunch.com/2025/11/09/blue-origin-scrubs-second-new-glenn-launch-will-try-again-november-12/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/gallery_ng2-8262.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T00:17:00.000Z",
    "description": "Image Credits:Blue Origin\t \t \t\t\t\t\t\t4:17 PM PST · November 9, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Jeff Bezos’ space company Blue Origin scrubbed the second launch of its New Glenn mega-rocket planned for Sunday afternoon due...",
    "body": "\n\t\n\t\tImage Credits:Blue Origin\t\n\t\n\t\t\t\t\t\t4:17 PM PST · November 9, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nJeff Bezos’ space company Blue Origin scrubbed the second launch of its New Glenn mega-rocket planned for Sunday afternoon due to concerns with weather, a few minor problems with launchpad equipment, and at least one cruise ship that strayed too close to the flight path.\nThe company said late Sunday that it will take another go at launching New Glenn’s second mission on Wednesday, November 12. The Federal Aviation Administration (FAA) announced restrictions on space launches late last week due to the government shutdown, and Blue Origin said in a post on X Sunday that it worked with the FAA to make the second attempt happen. The launch window opens at 2:50 p.m. ET and lasts until 4:17 p.m. ET.\nThis mission is an important one for Blue Origin for a number of reasons. \nFor one, the company is still proving out the full reusability of the rocket. New Glenn successfully reached orbit during its first launch in January, but the booster exploded before it could land on a drone ship in the ocean. Blue Origin hopes to land the booster for the first time during this second flight.\nThis is also the first commercial mission for New Glenn. The rocket will carry NASA’s ESCAPADE spacecraft into space, where it will embark on a mission to Mars. New Glenn is also carrying a tech demonstrator for Viasat, which is part of another NASA project. Proving New Glenn can safely deliver payloads to space — and do it cost-effectively thanks in large part to the rocket’s reusability — is crucial if Blue Origin wants to compete against Elon Musk’s SpaceX.\nBlue Origin originally planned to attempt the second launch earlier this year, but delayed it several times. Sunday’s launch window in Cape Canaveral, Florida, initially opened at 2:45 p.m. ET, and the company had a window of roughly 90 minutes. The weather worries and the launchpad equipment issues caused that launch time to slip a few times.\nWith the clock running again just minutes before a launch attempt, a cruise ship entered the flight path, according to the broadcast. While that ship was expected to clear before the 4:15 p.m. ET close of the launch window, the weather was still a concern and caused the company to scrub the attempt.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Google Maps releases new AI tools that let you create interactive projects",
    "url": "https://techcrunch.com/2025/11/10/google-maps-releases-new-ai-tools-to-let-you-create-interactive-projects/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Builder-agent-interface.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T16:00:00.000Z",
    "description": "Google Maps is adding new AI features, including a builder agent and an MCP server — a tool that connects AI assistants to Google Maps’ technical documentation — to help developers and users create...",
    "body": "\nGoogle Maps is adding new AI features, including a builder agent and an MCP server — a tool that connects AI assistants to Google Maps’ technical documentation — to help developers and users create interactive projects using Maps data and code. The company said it is using Gemini models across the board to power these features.\nAmong these new tools, the builder agent is a tool that, just like many other coding tools, lets you describe the kind of interactive map-based prototype you want to build in text and creates one for you. For instance, you can type “create a Street View tour of a city,” “create a map visualizing real-time weather in my region,” or “list pet-friendly hotels in the city.”\nOnce the code is generated, you can export it, test the preview project using your own API keys as needed, or modify the project in Firebase Studio.\nImage Credits:Google\nThe same tool also has a styling agent that lets users create a customized map to match a particular style format or theme. This could help brands create maps with specific color coding.\nGoogle already provides map data grounding via the Gemini API. The company is now introducing a similar feature, called Grounding Lite, which allows developers to ground their own AI models using Model Context Protocol (MCP), a standard that lets AI assistants connect to external data sources.\nWith this feature, AI assistants can answer questions like, “How far is the nearest grocery store?” The company is also shipping Contextual View, a low-code Google Maps component that can provide visual understanding to users for such questions. The feature can show a list, a map view, or a 3D display as an answer.\nImage Credits:Google\nGoogle is also adding a code assistant toolkit, the MCP server, which connects with Google Maps’ documentation. Developers can use this connection to get answers about how to use the Google Maps API and data. Last month, the company launched extensions for Gemini’s command line tool to let developers access Maps data.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Google\nThe company is also trying to add more Gemini-powered features for Maps on the consumer side. Last week, it enabled users to use Gemini hands-free with Maps for navigation. For users in India, Google added incident alerts and speed limit data to the Maps app in select areas.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Venmo launches cash back rewards program for debit cards",
    "url": "https://techcrunch.com/2025/11/10/venmo-launches-cash-back-rewards-program-for-debit-cards/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-1231192043.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T15:29:36.000Z",
    "description": "Venmo on Monday introduced a new rewards program, Venmo Stash, offering cash back to customers who transact with their favorite brands on the payments app and engage with Venmo’s products. While cashback...",
    "body": "\nVenmo on Monday introduced a new rewards program, Venmo Stash, offering cash back to customers who transact with their favorite brands on the payments app and engage with Venmo’s products. \nWhile cashback rewards are a common incentive for credit cards, Venmo’s rewards — which can be up to 5% — are returned to Venmo’s Mastercard Debit Card.\nThe program is designed to incentivize continued use of Venmo’s service by bringing more funds into the ecosystem, the company explains. \nHowever, this program also represents a new way that today’s brands are attempting to reach younger users, many of whom have shown a preference for debit cards over credit cards.\nOne 2024 study cited by eMarketer indicated that only 39% of Gen Z users reported frequent credit card use, compared with 51% for older generations. Another Morning Consult survey for Cash App Afterpay from earlier this year noted that 63% of Gen Z users said they favored debit cards over other payment methods.\nAs a result, payment providers and retailers are looking to accommodate younger consumers by rolling out more debit rewards and by offering alternatives at checkout — like the use of “buy now, pay later” (BNPL) services such as Affirm, PayPal Pay Later, or Klarna.\nIn Venmo’s case, the program is designed to offer larger rewards as customers interact more with Venmo products. This keeps them invested in the Venmo ecosystem, the company believes. \nIt also competes with other cashback incentives offered by Venmo’s rivals, like Cash App’s offers, which are doled out to its own Cash App debit card customers.\nScreenshotImage Credits:Venmo\nInitially, customers earn 1% cash back for their Venmo Debit Mastercard when they spend their Venmo balance. Rewards grow to 2% when customers turn on auto reloads to keep their balance replenished automatically. And customers are able to earn 5% cash back when they receive Direct Deposits on Venmo each month. \nHowever, instead of offering a certain percentage back by spending category, like groceries, gas, or dining, Venmo’s program has customers pick from curated bundles of their favorite brands. For instance, you could pick a group of brands that includes McDonald’s, TikTok Shop, Uber, and Uber Eats, or one that offers Amazon, DoorDash, Domino’s, and Walgreens. \nThe PayPal-owned company says that next year Venmo Stash will expand to offer customers rewards when they pay with Venmo at merchants within its nationwide network.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Lenskart recovers from tepid open to close first day slightly above IPO price",
    "url": "https://techcrunch.com/2025/11/10/lenskart-recovers-from-tepid-open-to-close-first-day-slightly-above-ipo-price/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/lenskart.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T12:06:40.000Z",
    "description": "Lenskart shares recovered after a soft start to finish slightly above the offer price on Monday, following the Indian eyewear retailer’s ₹72.8 billion ($821 million) IPO that sold out within hours but stirred...",
    "body": "\nLenskart shares recovered after a soft start to finish slightly above the offer price on Monday, following the Indian eyewear retailer’s ₹72.8 billion ($821 million) IPO that sold out within hours but stirred debate over its valuation.\nThe stock opened at ₹395, below the IPO price of ₹402, and fell as much as 11% to ₹356.10 during the session before recovering to close at ₹404.55. The closing price valued Lenskart at about ₹702 billion (around $8 billion). The IPO was heavily oversubscribed with bids coming in at about 28 times the shares available, led primarily by institutional investors.\nLenskart’s pitch to investors is that its vertically integrated model — where it controls everything from manufacturing to retail stores — can outpace legacy optical chains and online rivals. But the 15-year-old company faces competition across price points from Titan Eye+ to new direct-to-consumer players, raising questions about how quickly it can scale profitably in India and overseas.\nThe company reported a profit in the fiscal year 2025 (which ended in March), with revenue rising 23% year-over-year to ₹66.53 billion (about $750 million). Net profit came in at ₹2.97 billion (around $33 million), boosted by a ₹1.67 billion (about $19 million) accounting gain (not actual cash) linked to its acquisition of Owndays. Excluding that one-time item, the company’s core profit stood at ₹1.30 billion, or roughly $15 million.\nThe company had sought a valuation of ₹700 billion — around $7.9 billion — at the top end of the IPO price range, placing it among the most richly valued of India’s new-age consumer brands, alongside firms such as Honasa and BlueStone. The valuation represents a more than 60% jump from the roughly $5 billion level at which Lenskart shares traded hands in a secondary share sale last June involving late-stage backers Fidelity and Temasek. Fidelity later marked up Lenskart’s valuation by 12% to $5.6 billion in November last year.\nThe proposed valuation implied about 230 times Lenskart’s core net profit and roughly 10 times its revenue, fueling debate among retail investors and on social media. DSP Asset Managers, which invested in the company ahead of the listing, defended the deal, despite acknowledging it was “expensive,” saying in a post responding to the criticism that the business remains “strong and scalable.”\nChief executive Peyush Bansal, who has gained wider public recognition as a judge on “Shark Tank India,” said the issue was “fairly priced,” citing feedback from institutional investors.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We didn’t build Lenskart to reach a valuation,” he said at the IPO ceremony in Mumbai. “We did it to reach people, from Delhi to the smallest towns of India.”\nLenskart plans to use the proceeds to support expansion, including opening new stores and strengthening its supply chain and retail infrastructure. The company also intends to invest in technology and marketing, and said a portion of the funds may be set aside for acquisitions and other general corporate purposes.\nExisting investors including SoftBank, Schroders Capital, Premji Invest, Kedaara Capital, and Alpha Wave Ventures sold shares in the IPO. Co-founders Peyush and Neha Bansal, Amit Chaudhary, and Sumeet Kapahi also sold a portion of their holdings.\nLenskart’s listing comes at a time when several Indian startups are moving toward public markets as late-stage venture funding tightens and domestic investor appetite increases. Fintech firms Groww and Pine Labs, edtech platform PhysicsWallah, SaaS provider Capillary Technologies, and consumer brand BoAt are among the startups preparing for their IPOs in India.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Elon Musk uses Grok to imagine the possibility of love",
    "url": "https://techcrunch.com/2025/11/09/elon-musk-uses-grok-to-imagine-the-possibility-of-love/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/elon-musk-inauguration-paintings.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T20:12:12.000Z",
    "description": "After Tesla shareholders approved a new compensation package that could be worth $1 trillion, CEO Elon Musk appears to be celebrating with a normal weekend on his social media platform X.",
    "body": "\nAfter Tesla shareholders approved a new compensation package that could be worth $1 trillion, CEO Elon Musk appears to be celebrating with a normal weekend on his social media platform X.\nIn an early Saturday morning post with the surely coincidental timestamp of 4:20 a.m. ET, Musk posted a video generated by Grok Imagine, the new photo and video tool from his company xAI. \nAs Musk described it, the video was generated by his prompt, “She smiles and says, ‘I will always love you.’” And the video does, in fact, show an animated woman on a rainy street, saying those words in an obviously synthetic voice.\n\nTwenty-four minutes later, Musk posted a Grok-generated video of the actress Sydney Sweeney saying, in a distinctly un-Sydney-Sweeney-like voice, “You are so cringe.”\nWhile it’s increasingly common to see people being weird about AI-generated women and even forming romantic relationships with chatbots, many X users pounced on the “always love you” video in particular, with one describing it as “the most divorced post of all time” and another calling it “the saddest post in the history of this website.”\nRemarkably, neither of those was the most stinging critique of Musk posted to X this weekend. Instead, the prize goes to 87-year-old, award-winning author Joyce Carol Oates.\nResponding to an impressively labyrinthine series of posts in which one user approvingly quoted Musk firing back at a Texas state senator who criticized his compensation package, Oates wrote that it’s “so curious” that Musk “never posts anything that indicates that he enjoys or is even aware of what virtually everyone appreciates,” whether that’s posting about friends, relatives, nature, pets, movies, music, or books.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“In fact he seems totally uneducated, uncultured,” she wrote. “The poorest persons on Twitter may have access to more beauty & meaning in life than the ‘most wealthy person in the world.’”\nTo which Musk simply responded, “Oates is a liar and delights in being mean. Not a good human.”\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Remote driving startup Vay could grab up to $410M from Singapore’s Grab",
    "url": "https://techcrunch.com/2025/11/10/remote-driving-startup-vay-could-grab-up-to-410m-from-singapores-grab/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/Vay_US_4.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T13:53:30.000Z",
    "description": "Autonomous vehicles are having a moment, and it’s making it a lot easier for smaller companies to raise money. Vay, a German startup offering remote-controlled rental cars, will get $60 million in cash from...",
    "body": "\nAutonomous vehicles are having a moment, and it’s making it a lot easier for smaller companies to raise money. Vay, a German startup offering remote-controlled rental cars, will get $60 million in cash from Singaporean tech heavyweight Grab, the company announced on Monday.\nThe deal, which is subject to regulatory approval and expected to close by the end of the year, may be followed by “an additional $350M as joint milestones are achieved within the first year,” Vay CEO Thomas von der Ohe wrote on LinkedIn.\nThe Berlin-based startup uses its technology and human operators to remotely drive rental cars to and from customers. Vay isn’t yet commercially deployed in real traffic in Germany, where it lacked regulatory clarity until recently, but the company is currently operational in Las Vegas, where it started in January 2024. Vay now plans to use Grab’s investments to scale and expand its operations in the U.S.\nVay will need to hit certain milestones in the U.S. to unlock additional investment from Grab, including number of U.S. cities covered, regulatory approvals obtained, and overall consumer revenue.\nThe U.S. is seeing increased competition and fast-expanding offerings of various forms of remote driving. For instance, Alphabet-owned Waymo recently announced it would deploy its robotaxi service in Detroit, Las Vegas, and San Diego. \nAlthough publicly traded on the Nasdaq, Grab does not operate in the U.S., where it will limit itself to supporting Vay’s growth. \nHowever, Vay describes driverless car rental as complementary to robotaxis. As for Grab, it sees Vay as serving “a growing segment of consumers who prefer not to be car owners,” Grab co-founder and CEO Anthony Tan said in a press release.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nVay’s customers may not be car owners, but they still need a driving license: Once the car gets delivered, the user takes over and drives it like a regular car. But unlike their own car, they don’t need to find where to park it. Vay says its service costs about half the price of ride-hailing, thanks to this hybrid approach and hardware-light system.\nAt the same time, the two companies plan to explore synergies between Vay’s and Grab’s business in Southeast Asia. Calling itself “the everyday everything app,” Grab’s ubiquitous super-app offers ​​all-in-one taxi, ride hailing, transport, express grocery shopping, and food delivery options, as well as digital payments and financial services.\nWith a growing interest in mobility, Grab recently invested in autonomous driving tech startups, including May Mobility out of the U.S. and WeRide out of China. The synergies it finds with Vay may well be on the tech side — for instance, it said that driving data collected by Vay could accelerate the training of AI models to improve autonomous driving.\nThis also aligns with Vay’s vision to become more than an electric rental car fleet. The company has already expanded into commercial and business-to-business services, and closed a partnership with self-driving truck company Kodiak Robotics. Ultimately, it aims to build a “global remote driving platform,” von der Ohe told TechCrunch earlier this year.\nAccording to Crunchbase, Vay had raised $131.8 million from backers including Kinnevik, Coatue, Eurazeo, Atomico, General Catalyst, Creandum, and the European Investment Bank. If fully unlocked, Grab’s investment would be a significant boost. But with Nvidia announcing plans to invest $500 million into British self-driving tech startup Wayve, the race is only starting.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  }
]