[
  {
    "title": "‘Breaking Bad’ creator’s new show ‘Pluribus’ was emphatically ‘made by humans,’ not AI",
    "url": "https://techcrunch.com/2025/11/08/breaking-bad-creators-new-show-pluribus-was-emphatically-made-by-humans-not-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/pluribus.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-08T19:31:07.000Z",
    "description": "In Brief Posted: 11:31 AM PST · November 8, 2025  Image Credits:Apple TV  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  If you watched all the way to the end of the new Apple TV show “Pluribus,” you may have...",
    "body": "\nIn Brief\nPosted:\n11:31 AM PST · November 8, 2025\n\nImage Credits:Apple TV\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nIf you watched all the way to the end of the new Apple TV show “Pluribus,” you may have noticed an unusual disclaimer in the credits: “This show was made by humans.”\nThat terse message —  placed right below a note that “animal wranglers were on set to ensure animal safety” — might provide a model for other filmmakers seeking to highlight that their work was made without the use of generative AI.\nAnd just in case the disclaimer wasn’t clear enough, creator Vince Gilligan (best known for “Breaking Bad”) was even more emphatic in a Variety feature about the show, declaring flatly, “I hate AI.” \nHe went on to describe the technology as “the world’s most expensive and energy-intensive plagiarism machine” and compared AI-generated content to “a cow chewing its cud — an endlessly regurgitated loop of nonsense.”\n“Thank you, Silicon Valley!” he added. “Yet again, you’ve f—ed up the world.”\n“Pluribus” is the former “X-Files” writer’s return to science fiction, and it reunites him with his “Better Call Saul” star Rhea Seehorn, who plays a romantasy author who confronts a seemingly alien threat.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Media & Entertainment\n"
  },
  {
    "title": "Is Wall Street losing faith in AI?",
    "url": "https://techcrunch.com/2025/11/08/is-wall-street-losing-faith-in-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-08T20:53:00.000Z",
    "description": "In Brief Posted: 12:53 PM PST · November 8, 2025  Image Credits:Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  A rough week for tech stocks might signal a loss of investor confidence in artificial...",
    "body": "\nIn Brief\nPosted:\n12:53 PM PST · November 8, 2025\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nA rough week for tech stocks might signal a loss of investor confidence in artificial intelligence.\nThe Wall Street Journal reports that the Nasdaq Composite Index was down 3% — making this its worst week since President Donald Trump announced his sweeping tariff plan in April.\nTech companies that have otherwise performed well this year were among those hardest hit, with Palantir’s stock price falling 11% this week, Oracle declining by 9%, and Nvidia losing 7%. These drops also come after earnings reports in which Meta and Microsoft indicated that they plan to continue spending heavily on AI (both companies were down about 4%). \n“Valuations are stretched,” Cresset Capital’s Jack Ablin told the WSJ. “Just the slightest bit of bad news gets exaggerated … and good news is just not enough to move the needle because expectations are already pretty high.”\nEconomic factors like the ongoing government shutdown, declining consumer sentiment, and widespread layoffs are also likely dragging down the stock market. But the less tech-heavy S&P 500 and Dow Jones Industrial Average didn’t do quite as badly, with declines of 1.6% and 1.2%, respectively.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Slow Ventures holds a ‘finishing school’ to help founders learn to be fancy",
    "url": "https://techcrunch.com/2025/11/09/slow-ventures-holds-a-finishing-school-to-help-founders-learn-to-be-fancy/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/wine-glass-unsplash.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T21:58:31.000Z",
    "description": "In Brief Posted: 1:58 PM PST · November 9, 2025  Image Credits:Zan Lazarevic/Unsplash (opens in a new window)  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Slow Ventures hosted a three-hour “Etiquette Finishing...",
    "body": "\nIn Brief\nPosted:\n1:58 PM PST · November 9, 2025\n\nImage Credits:Zan Lazarevic/Unsplash (opens in a new window)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nSlow Ventures hosted a three-hour “Etiquette Finishing School” this week, covering topics like the perfect handshake, public speaking, and office decorum. There was even a fashion show with models showing off different looks for different occasions, and then a closing lesson about caviar and wine.\nThe San Francisco Standard reports that a few hundred founders applied for the free program, held at the Four Seasons in SF’s financial district, with 50 founders accepted. Most of the attendees were male.\nApparently the idea started as a joke, with Slow Ventures sussing out interest at Y Combinator’s Demo Day. And while YC CEO Garry Tan reportedly told founders not to attend, Tan posted on X that he has “no beef with Slow Ventures,” while writing, “You don’t need finishing school. You need to build something great, make your users happy, and have craftsmanship.”\nOne unnamed founder told The Standard that they attended to learn how to be “less feral.”\n“Tech is no longer playful and cute,” Slow Ventures general partner Sam Lessin reportedly told the audience. “It’s taking people’s jobs and changing environments. Everyone’s threatened by it, which means you need to be like, ‘I’m here and respectful,’ as opposed to ‘I’m here and intentionally disrespectful.’”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Venture\n"
  },
  {
    "title": "YouTube TV is giving customers a $20 credit for Disney blackout",
    "url": "https://techcrunch.com/2025/11/09/youtube-tv-is-giving-customers-a-20-credit-for-disney-blackout/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1184040131.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T21:40:00.000Z",
    "description": "YouTube TV subscribers unhappy about going more than a week without ESPN, ABC, and other Disney networks will be getting a $20 credit that can be applied to their next billing statement.",
    "body": "\nYouTube TV subscribers unhappy about going more than a week without ESPN, ABC, and other Disney networks will be getting a $20 credit that can be applied to their next billing statement.\nVariety first reported on the credit, and a YouTube spokesperson confirmed the news to TechCrunch. The company says the credits are rolling out now, with subscribers receiving emailed instructions about how to apply it.\nDisney’s channels were pulled from the subscription TV service on October 31. YouTube says that if it reaches a deal, those channels will be restored within a matter of hours. As with similar disputes, this one appears to revolve around pricing, with YouTube criticizing Disney’s supposed price hike and Disney saying YouTube is “refusing to pay fair rates for our channels.”\nThe subscription TV service’s last dispute with Disney was in 2022, leading YouTube TV to offer customers a $15 credit after Disney programming was removed for a day. \n"
  },
  {
    "title": "Apple reportedly plans ambitious satellite-powered iPhone features",
    "url": "https://techcrunch.com/2025/11/09/apple-reportedly-plans-ambitious-satellite-powered-iphone-features/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/Apple-iphone-16.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T17:42:00.000Z",
    "description": "While Apple’s iPhone already supports texting, calling emergency services, and contacting roadside assistance via satellite connectivity, the company may have many more satellite-powered features in the works.",
    "body": "\nIn Brief\nPosted:\n9:42 AM PST · November 9, 2025\n\nImage Credits:Brian Heater\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhile Apple’s iPhone already supports texting, calling emergency services, and contacting roadside assistance via satellite connectivity, the company has many more satellite-powered features in the works, according to Bloomberg’s Mark Gurman.\nIn-development features reportedly include an API allowing app makers to support satellite connections in their own apps, a version of Apple Maps that allows users to navigate without a cell or WiFi connection, adding photos to messaging, and increased support for “natural usage,” allowing users to connect to a satellite even if their phone isn’t pointed directly at the sky.\nAll of these features would potentially increase the usability of iPhones when their owners are outside the range of traditional cell networks. Another potential upgrade, first reported by The Information, could improve 5G networks by allowing them to connect to satellites for increased coverage.\nThe basic features would be free, Gurman says, with customers paying carriers for more advanced support. In addition, Apple’s satellite partner Globalstar reportedly needs to improve its infrastructure to support these upgrades, which Apple is helping to finance.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Hardware\n"
  },
  {
    "title": "Kim Kardashian says ChatGPT is her ‘frenemy’",
    "url": "https://techcrunch.com/2025/11/07/kim-kardashian-says-chatgpt-is-her-frenemy/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/Kim-Kardashian-Headshot-e1664830753133.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T16:58:22.000Z",
    "description": "In Brief Posted: 8:58 AM PST · November 7, 2025  Image Credits:Spotify  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Celebrities: They’re just like us? In a Vanity Fair interview, Kim Kardashian — who has been...",
    "body": "\nIn Brief\nPosted:\n8:58 AM PST · November 7, 2025\n\nImage Credits:Spotify\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nCelebrities: They’re just like us? In a Vanity Fair interview, Kim Kardashian — who has been studying to become a lawyer — discussed her “toxic” friendship with ChatGPT, admitting that she has failed law exams after it told her false information.\n“I use [ChatGPT] for legal advice, so when I am needing to know the answer to a question, I will take a picture and snap it and put it in there,” she said. “They’re always wrong. It has made me fail tests… And then I’ll get mad and I’ll yell at it and be like, ‘You made me fail!’” \nChatGPT is prone to hallucinations, meaning that the LLM will create fake answers sometimes, rather than admit that it cannot confidently respond to a prompt. This technology isn’t necessarily programmed to know what information is “correct” or not — rather, it is trained on an unfathomably massive heap of data and prompted to predict the most likely response to an input, which may not be factually accurate. Some lawyers have been sanctioned for using ChatGPT when writing legal briefs, which becomes obvious to those reviewing the briefs, since they cite cases that don’t exist.\nKardashian said she will try to appeal to ChatGPT’s emotions after it lets her down — but this is a futile plan, since ChatGPT does not have feelings.\n“I will talk to it and say, ‘Hey, you’re going to make me fail, how does that make you feel that you need to really know these answers?’” she said. “And then it’ll say back to me, ‘This is just teaching you to trust your own instincts.’”\nBut while ChatGPT may not have feelings, that doesn’t mean that we — human beings — don’t have feelings about it. \n“I screenshot all the time and send it to my group chat, like, ‘Can you believe this b—- is talking to me like this?’”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Washington Post confirms data breach linked to Oracle hacks",
    "url": "https://techcrunch.com/2025/11/07/washington-post-confirms-data-breach-linked-to-oracle-hacks/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/washington-post-2155584034.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T19:22:35.000Z",
    "description": "The Washington Post has said that it was one of the victims of a hacking campaign tied to Oracle’s suite of corporate software apps.   Reuters first reported the news on Friday, citing a statement from the...",
    "body": "\nThe Washington Post has said that it was one of the victims of a hacking campaign tied to Oracle’s suite of corporate software apps.  \nReuters first reported the news on Friday, citing a statement from the newspaper that said it was affected “by the breach of the Oracle E-Business Suite platform.” \nA spokesperson for the Post did not immediately respond to TechCrunch’s request for comment.\nWhen reached by email, Oracle spokesperson Michael Egbert referred TechCrunch to its two advisories that it previously posted, and did not answer our questions. \nLast month, Google said that the ransomware gang Clop was targeting companies after exploiting multiple vulnerabilities in Oracle’s E-Business Suite software, which companies use for their business operations, storing their human resources files, and other sensitive data. \nThe exploits allowed the hackers to steal customer business data and employee records from more than 100 companies, per Google.\nThe hackers’ campaign began in late September when corporate executives reported receiving extortion messages sent from email addresses previously associated with the Clop gang, claiming that the hackers had stolen large amounts of sensitive internal business data and employees’ personal information from hacked Oracle systems. \nAnti-ransomware firm Halcyon told TechCrunch at the time that the hackers demanded one executive at an affected company to pay $50 million in a ransom payment. \nOn Thursday, Clop claimed on its website that it had hacked The Washington Post, claiming that the company “ignored their security,” language that the Clop gang typically uses when the victim does not pay the hackers. \nIt’s not uncommon for ransomware or extortion gangs like Clop to publicize the names and stolen files of their victims as a pressure tactic, which can suggest that the victim has not negotiated a payment with the gang, or the negotiation broke down. \nSeveral other organizations have confirmed they are affected by the Oracle E-Business hacks, including Harvard University and American Airlines subsidiary Envoy.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Congressional Budget Office confirms it was hacked",
    "url": "https://techcrunch.com/2025/11/07/congressional-budget-office-confirms-it-was-hacked/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/us-congress-at-night.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T16:36:55.000Z",
    "description": "The congressional research office confirmed a breach, but did not comment on the cause. A security researcher suggested the hack may have originated because CBO failed to patch a firewall for more than a year.",
    "body": "\nThe U.S. Congressional Budget Office has confirmed it was hacked. \nCaitlin Emma, a spokesperson for CBO, told TechCrunch on Friday that the agency is investigating the breach and “has identified the security incident, has taken immediate action to contain it, and has implemented additional monitoring and new security controls to further protect the agency’s systems going forward.” \nCBO is a nonpartisan agency that provides economic analysis and cost estimates to lawmakers during the federal budget process, including after legislative bills get approved at the committee level in the House and Senate. \nOn Thursday, The Washington Post, which first revealed the breach, reported that unspecified foreign hackers were behind the intrusion. According to the Post, CBO officials are worried that the hackers accessed internal emails and chat logs, as well as communications between lawmakers’ offices and CBO researchers. \nReuters reported that the Senate Sergeant at Arms office, the Senate’s law enforcement agency, notified congressional offices of a breach, warning them that emails between CBO and the offices could have been compromised and used to craft and send phishing attacks. \nIt’s unclear how the hackers gained access to the CBO’s network. But soon after news of the breach became public, security researcher Kevin Beaumont wrote on Bluesky that he suspected hackers may have exploited the CBO’s outdated Cisco firewall to break into the agency’s network.  \nLast month, Beaumont noted that CBO had a Cisco ASA firewall on its network that was last patched in 2024. At the time of his posting, the CBO’s firewall was allegedly vulnerable to a series of newly discovered security bugs, which were being exploited by suspected Chinese government-backed hackers.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBeaumont said the CBO’s firewall had not been patched by the time the federal government shutdown took effect on October 1. \nOn Thursday, Beaumont said that the firewall is now offline. \nThe CBO’s spokesperson declined to comment when asked about Beaumont’s findings. Spokespeople for Cisco did not immediately respond to a request for comment.  \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "GoWish’s shopping and wish list app is having its biggest year yet",
    "url": "https://techcrunch.com/2025/11/07/gowishs-shopping-and-wishlist-app-is-having-its-biggest-year-yet/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/gowish.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T20:16:32.000Z",
    "description": "Recession fears aren’t hurting the wish list and shopping app GoWish, which is seeing record numbers ahead of the 2025 holiday season. The app, which has north of 13.6 million registered users, had its best...",
    "body": "\nRecession fears aren’t hurting the wish list and shopping app GoWish, which is seeing record numbers ahead of the 2025 holiday season. The app, which has north of 13.6 million registered users, had its best day yet this week, when on Monday it hit No. 2 on the U.S. App Store.\nWhile GoWish has seen similar adoption trends in previous years, this year has proven to be a breakout success. The app doubled the number of users from last year, and it has been breaking records with hundreds of thousands of new daily users in the month of November.\nIn the U.S. alone, the app has nearly 6.2 million users, while it has around 1 million in the U.K. In its home market of Denmark, the wish list app has over 50% market penetration and over 3.5 million registered Danish users.\nThough today it operates as a tech company, GoWish has a unique origin story. \nImage Credits:GoWish\nThe app was originally launched in 2015 by the Danish-Swedish national postal service PostNord as “Ønskeskyen.” (That’s Danish for “wish cloud.”) It was just a seasonal wish list gimmick, but its founders saw the potential for it to be something more.\nIn 2020, GoWish was acquired by Danish VC Dotcom Capital, which is owned by founder Casper Ravn‑Sørensen, who is also GoWish’s chief growth officer, and his partner, CEO Mads Dahlerup. They spun it out as an independent tech company and created an international version of Ønskeskyen (the app’s name in Denmark and Norway).\n“We might be the first state-founded tech platform to go global as a privately-owned scale-up,” Ravn‑Sørensen told TechCrunch.\nImage Credits:GoWish\nConsumers can use the app to create multiple wish lists for themselves, their family, and friends, and for different occasions. Wishes — or products you can buy from online retailers — can be added directly to your list by copying and pasting a URL, searching for a product, or browsing the inspiration feeds that feature millions of products. When you’re ready to buy, you can tap a button in the app to go directly to the retailer’s website.\nThe company has around 65,000 affiliate partnerships and over 700 brand partnerships, many of which are now adding “GoWish” buttons to their own websites. This model has been successful, explained Ravn‑Sørensen, as the app saw net profits after tax of $1.7 million in its fiscal year 2024, which are being reinvested in its growth. (GoWish declined to disclose its total revenue.)\nThe company attributes its increased adoption this year to the marketing it’s been doing across Meta, TikTok, Google, and Snap. Snap even gave GoWish a shoutout on its Q4 earnings call, as it’s been one of Snap’s partner success stories.\n“We’re very good at optimising our marketing spends across digital platforms and that makes our global roll-out very effective,” Ravn‑Sørensen said. \nThe company will later augment its experience with AI, but isn’t yet sharing details about those plans.\n“We have a mission of ‘fixing gifting’,” noted Ravn‑Sørensen, adding that GoWish wants to make “users’ dreams and wishes come true while making double-gifting and returns a thing of the past.” (The app lets family and friends reserve items on users’ wish lists so users won’t receive the same gift from multiple people.)\n“Yet, on a longer trajectory, we want to become the ‘global genie’ of social shopping, that can predict future consumer trends across generations,” he said. \nThe Copenhagen-based company is currently a team of 90 and is backed by Capital D, a London-based private equity firm that bought one-third of the company in early 2025; the rest is owned by the Danish VC Dotcom Capital. \nGoWish is available on iOS and Android and offers a Chrome extension to add items to wish lists from your computer.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "OpenAI asked Trump administration to expand Chips Act tax credit to cover data centers",
    "url": "https://techcrunch.com/2025/11/08/openai-asked-trump-administration-to-expand-chips-act-tax-credit-to-cover-data-centers/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2206295463.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-08T17:30:24.000Z",
    "description": "A recent letter from OpenAI reveals more details about how the company is hoping the federal government can support the company’s ambitious plans for data center construction. The letter — from OpenAI’s chief...",
    "body": "\nA recent letter from OpenAI reveals more details about how the company is hoping the federal government can support the company’s ambitious plans for data center construction.\nThe letter — from OpenAI’s chief global affairs officer Chris Lehane and addressed to the White House’s director of science and technology policy Michael Kratsios — argued that the government should consider expanding the Advanced Manufacturing Investment Credit (AMIC) beyond semiconductor fabrication to cover electrical grid components, AI servers, and AI data centers.\nThe AMIC is a 35% tax credit that was included in the Biden administration’s Chips Act.\n“Broadening coverage of the AMIC will lower the effective cost of capital, de-risk early investment, and unlock private capital to help alleviate bottlenecks and accelerate the AI build in the US,” Lehane wrote.\nOpenAI’s letter also called for the government to accelerate the permitting and environmental review process for these projects, and to create a strategic reserve of raw materials — such as copper, alumimum, and processed rare earth minerals — needed to build AI infrastructure.\nThe company first published its letter on October 27, but it didn’t get much press attention until this week, when comments by OpenAI executives prompted broader discussion about what the company wants from the Trump administration.\nAt a Wall Street Journal event on Wednesday, CFO Sarah Friar said the government should “backstop” OpenAI’s infrastructure loans, though she later posted on LinkedIn that she misspoke:  “OpenAI is not seeking a government backstop for our infrastructure commitments. I used the word ‘backstop’ and it muddied the point.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nCEO Sam Altman also weighed in, writing that OpenAI does not “have or want government guarantees for OpenAI datacenters.”\n“We believe that governments should not pick winners or losers, and that taxpayers should not bail out companies that make bad business decisions or otherwise lose in the market,” he wrote, though he said the company had discussed loan guarantees “as part of supporting the buildout of semiconductor fabs in the US.”\nIn the same post, Altman wrote that the company expects to end 2025 “above $20 billion in annualized revenue run rate and grow to hundreds of billion by 2030,” and he said OpenAI has made $1.4 trillion in capital commitments for the next eight years.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "How one founder plans to save cities from flooding with terraforming robots",
    "url": "https://techcrunch.com/2025/11/07/one-founders-plan-to-save-his-city-san-rafael-with-terraforming-robots/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/terranova-rover.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T15:02:00.000Z",
    "description": "Parts of San Rafael, a city just north of San Francisco, are sinking about half an inch per year. That might not sound like much, but altogether, it has meant that some neighborhoods — like the Canal District...",
    "body": "\nParts of San Rafael, a city just north of San Francisco, are sinking about half an inch per year. That might not sound like much, but altogether, it has meant that some neighborhoods — like the Canal District that borders the bay — have sunk three feet, placing them at greater risk of flooding from sea-level rise.\nSan Rafael isn’t alone. Cities around the world are threatened by rising sea levels, with 300 million people at risk of routine flooding by 2050. The cost of building seawalls to hold the waters back could top $400 billion in the U.S. alone.\nA new startup is proposing an alternative: raise the city instead.\nTerranova is building robots that will inject a slurry of wood waste into the ground, slowly lifting the land to eliminate historical subsidence and, hopefully, prevent those parts of the city from flooding.\n“The canal district is really far under sea level,” Laurence Allen, co-founder and CEO of Terranova, told TechCrunch. The city has been working with flood consultants to find a solution, he said. \n“The answer, every answer every time, has been like $500 million to $900 million of seawalls, which if you’re from San Rafael, you know they’re not even close to being able to afford that. There’s about 60,000 people and a significant portion — surprisingly for a city in Marin — are living in poverty.”\nTerranova says it can protect San Rafael and other cities like it for a fraction of the cost. In San Rafael’s case, the startup has quoted $92 million to lift 240 acres four feet. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe company recently raised $7 million in a seed round led by Congruent Ventures and Outlander with participation from GoAhead Ventures, Gothams, and Ponderosa, TechCrunch has exclusively learned. The oversubscribed round values the company at $25.1 million.\nLifting land by injecting stuff underground isn’t new. Terranova’s pitch is that it has developed some novel approaches that make it cheaper.\nFirst is the material: Waste wood is inexpensive and easy to obtain. The startup mixes it with other materials that it wouldn’t disclose to turn it into a slurry. The result is pumped from a 20-foot shipping container to the second cost-saving item: a robotic injection device. The tracked robotic units autonomously rove around the work site, drilling wells through which the wood slurry is delivered to depths of around 40 to 60 feet.\nSo long as the slurry remains wet underground, the wood shouldn’t decay and the company can sell carbon credits to offset costs, Allen said.\nAll of this is managed by software that Terranova has developed. The company uses public geographic information coupled with data from cores drilled throughout the state of California, mostly taken during the construction of water wells. With that, it has created a model of the subsurface that informs injection patterns, which are determined by a genetic algorithm.\nOn the back end, city planners, contractors, and other stakeholders can use a SimCity-like tool to sculpt the virtual landscape.\nWhen plans are finalized, they guide the robotic injectors, telling them both where to inject and how much. Human operators remain on site as a safety precaution, Allen said. Once the robots are done injecting, it takes about two hours for the slurry to consolidate, he added.\nTerranova has been testing both the robots and software at a pilot site for over a year, he said.\nThough some experts have questioned whether the consolidated wood slurry will exacerbate earthquake shocks, Allen said the most frequently mentioned alternatives have risks, too. “We think it’ll help [with earthquakes] versus dikes and seawalls.”\nThe company plans to make money by splitting revenue for projects with contractors. It’s hoping the costs are low enough that the process will be attractive for a range of land-lifting projects beyond cities, including remediating wetlands that are disappearing either due to subsidence or sea-level rise.\nBut given the urgency of rising waters, cities are Terranova’s first priority. “I’m from San Rafael, born and raised,” Allen said. “I really want to save the city.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Amazon launches a low-price standalone shopping app, Amazon Bazaar, in over a dozen markets",
    "url": "https://techcrunch.com/2025/11/07/amazon-launches-a-low-price-standalone-shopping-app-amazon-bazaar-in-over-a-dozen-markets/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/amazon-bazaar-.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T15:25:41.000Z",
    "description": "On Friday, Amazon announced the debut of Amazon Bazaar, a new low-cost shopping destination for Asia, Africa, and Latin America that will be available separately from the main Amazon shopping app. On Bazaar,...",
    "body": "\nOn Friday, Amazon announced the debut of Amazon Bazaar, a new low-cost shopping destination for Asia, Africa, and Latin America that will be available separately from the main Amazon shopping app. On Bazaar, most products are available under $10, and some are as low as $2, the retailer says.\nThe product selection, available now on Android and iOS, will be available in its own app that’s available in Hong Kong, the Philippines, Taiwan, Kuwait, Qatar, Bahrain, Oman, Peru, Ecuador, Argentina, Costa Rica, the Dominican Republic, Jamaica, and Nigeria.\nAmazon says more markets will gain access to the app in the months ahead.\nThe app has significant overlap with Amazon Haul, which launched last November as a competitor to Shein and Temu. Haul operates as part of Amazon’s main website and app, and will remain available in its existing markets, including the U.S., U.K., Germany, France, Italy, Spain, Japan, and Australia.\nIn other markets, Amazon had already branded Amazon Haul as Bazaar, where it’s been available through Amazon’s main shopping app. That version also remains available in Mexico, Saudi Arabia, and the United Arab Emirates, in addition to India. (Amazon using two names for the same low-cost selection of inventory is confusing! But Amazon thinks the different names “better resonate with local language preferences and cultures.”)\nImage Credits:Amazon\nThe move to create a standalone shopping destination for its cheaper inventory signals Amazon is ramping up the competition with the low-cost Chinese shopping apps, like Temu, Shein, and TikTok (TikTok Shop), which have seen broad adoption by younger users and others without as much disposable income to spend on clothing, decor, electronics, and other household items.\nThe Bazaar app will offer these users “hundreds of thousands” of affordable products in categories like fashion, home goods, and lifestyle products, the retailer says. Product pages feature familiar Amazon features like customer reviews and star ratings. \nImage Credits:Amazon\nCustomers use their same Amazon credentials to shop and check out, where they can use Visa, Mastercard, or American Express. Orders will have to meet the local minimum purchase amount to qualify for free shipping. (This varies by market.) For smaller orders, a standard delivery fee is charged. \nShipments take around 2 weeks or less, returns are free within 15 days of receipt, and Amazon offers multilingual customer support. The app itself supports six languages: English, Spanish, French, Portuguese, German, and Traditional Chinese.\nThe app will also engage customers with interactive features like social lucky draws and promotions — things popularized by the Chinese shopping apps. New customers will also receive 50% off their first delivery as an incentive to try the app. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Elon Musk uses Grok to imagine the possibility of love",
    "url": "https://techcrunch.com/2025/11/09/elon-musk-uses-grok-to-imagine-the-possibility-of-love/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/elon-musk-inauguration-paintings.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-09T20:12:12.000Z",
    "description": "After Tesla shareholders approved a new compensation package that could be worth $1 trillion, CEO Elon Musk appears to be celebrating with a normal weekend on his social media platform X.",
    "body": "\nAfter Tesla shareholders approved a new compensation package that could be worth $1 trillion, CEO Elon Musk appears to be celebrating with a normal weekend on his social media platform X.\nIn an early Saturday morning post with the surely coincidental timestamp of 4:20am EST, Musk posted a video generated by Grok Imagine, the new photo and video tool from his company xAI. \nAs Musk described it, the video was generated by his prompt, “She smiles and says, ‘I will always love you.’” And the video does, in fact, show an animated woman on a rainy street, saying those words in an obviously synthetic voice.\n\nTwenty-four minutes later, Musk posted a Grok-generated video of the actress Sydney Sweeney saying, in a distinctly un-Sydney-Sweeney-like voice, “You are so cringe.”\nWhile it’s increasingly common to see people being weird about AI-generated women and even forming romantic relationships with chatbots, many X users pounced on the “always love you” video in particular, with one describing it as “the most divorced post of all time” and another calling it “the saddest post in the history of this website.”\nRemarkably, neither of those was the most stinging critique of Musk posted to X this weekend. Instead, the prize goes to 87-year-old, award-winning author Joyce Carol Oates.\nResponding to an impressively labyrinthine series of posts in which one user approvingly quoted Musk firing back at a Texas state senator who criticized his compensation package, Oates wrote that it’s “so curious” that Musk “never posts anything that indicates that he enjoys or is even aware of what virtually everyone appreciates,” whether that’s posting about friends, relatives, nature, pets, movies, music, or books.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“In fact he seems totally uneducated, uncultured,” she wrote. “The poorest persons on Twitter may have access to more beauty & meaning in life than the ‘most wealthy person in the world.’”\nTo which Musk simply responded, “Oates is a liar and delights in being mean. Not a good human.”\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "How startups can lure good talent fairly without big tech bank accounts ",
    "url": "https://techcrunch.com/2025/11/08/how-startups-can-lure-good-talent-fairly-without-big-tech-bank-accounts/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Comp-panel.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-08T14:00:00.000Z",
    "description": "Startups have never been able to offer the same sizable salaries as big tech companies. Now with companies like Meta and OpenAI willing to pay million-dollar salaries amid the AI race — the compensation...",
    "body": "\nStartups have never been able to offer the same sizable salaries as big tech companies. Now with companies like Meta and OpenAI willing to pay million-dollar salaries amid the AI race — the compensation divide has grown even larger.\nEarly-stage startups are not doomed though. If they develop a compensation strategy that is generous, fair, and flexible, they can offer competitive compensation packages and give themselves room to adjust their approach as they grow, according to founders and experts who were onstage at TechCrunch Disrupt 2025.\nStartups shouldn’t try to compete with big tech companies anyway, Yin Wu, the co-founder and CEO of equity management software Pulley, said on stage at TechCrunch Disrupt in October. She added that a stable tech company and a startup don’t generally attract the same potential candidates to begin with.\nStartups should instead be as charitable as they can in their compensation packages, Wu said, regardless of their inability to match a big tech company’s paycheck.\n“My pretty strong opinion when it comes to equity for a startup is that you should be more generous than what you think you should be,” Wu said. “I think it is unlikely, if the company is really successful, you’re going to look back and say, ‘man, I gave away too much equity of everyone that was at my company trying to make this company really successful.’”\nRandi Jakubowitz, the head of talent at 645 Ventures, agreed. Jakubowitz added that when a startup is looking to make a competitive offer, they should set clear goals for the person they are hiring to ensure that hire lives up to the compensation they are getting.\n“Make sure you’re holding them accountable and make sure that you understand what the implications are from a vesting cliff standpoint,” Jakubowitz said, regarding when employees gain control over their equity stakes. “That’s where, if you don’t move quickly if someone’s underperforming, that’s equity that you’ll never get back if they are fully vested. Make sure that there’s very clear accountability. “\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe panelists also stressed that companies don’t need to get their compensation and equity strategies set in stone from the start. Startups should instead ensure their approach is fair from the beginning, so even if they do want to change, they have the proper foundation to do so without setting themselves up for legal trouble or soured office politics.\nFor Wu, and her company Pulley, that meant setting standards around compensation packages. Wu said the company pays a set range for each role — regardless of where a potential employee is based — and consistently builds compensation packages with equity offerings in the 90th percentile.\n“Having this framework allowed us to be able to grow and say ‘great, as the company continues to do well, the actual number of shares you receive is going to differ because the value the companies differ, but that framework is still applied.”\nRebecca Lee Whiting, founder of Epigram Legal and fractional general counsel, added that having these standards will help companies avoid potential legal pitfalls down the line. For instance, it helps companies avoid offering unequal pay across candidates of different genders — which is something all companies should try to avoid ethically — but is also illegal in states like California, Whiting noted.\nWhiting, Wu and, Jakubowitz all agreed that as long as founders approach building their compensation packages with fair intentions, everything else can be adjusted or changed down the line.\n“I think it’s really important to think about not just that process. Think about who are the people you’re trying to hire and what is going to incentivize them to take that offer,” Whiting said. “It’s not something that you have to get right out of the gate. You will likely have to do clean up post the Series B and acknowledging that is okay. But don’t try and get it perfect out of the out of the gate when you’re hiring your first few people.”\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Rivian gives RJ Scaringe a new pay package worth up to $5B",
    "url": "https://techcrunch.com/2025/11/07/rivian-gives-rj-scaringe-a-new-pay-package-worth-up-to-5b/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/TechCrunch-Disrupt-Haje-Kamps-517.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T21:02:22.000Z",
    "description": "Rivian has given its founder and CEO RJ Scaringe a new performance-based stock award that could ultimately be worth around $5 billion if all the underlying goals are met, according to a new filing. Scaringe’s...",
    "body": "\nRivian has given its founder and CEO RJ Scaringe a new performance-based stock award that could ultimately be worth around $5 billion if all the underlying goals are met, according to a new filing.\nScaringe’s salary is also being doubled to $2 million per year, and he was given a 10% stake in Rivian’s newest spinout Mind Robotics, the filing shows. \nThe announcement comes just one day after Tesla shareholders voted to approve a compensation package for its CEO Elon Musk that could be worth $1 trillion — the largest in corporate history.\nUnlike Musk’s pay package, Scaringe’s isn’t subject to a shareholder vote. The compensation committee on Rivian’s board of directors has canceled a similar-sized performance award given to Scaringe in 2021 as part of a company-wide equity incentive plan adopted that year. The new award is being issued under the same, already-approved 2021 equity incentive plan.\nThe committee decided to cancel the 2021 performance award in part because of the “unlikeliness” that Scaringe could reach the goals required. The 2021 award consisted of 20,355,946 stock options that vested in part based on stock price increases. Six years past the grant date, if Rivian’s share price passed $110, $150, $220, and $295, Scaringe would be able to purchase the stock options in corresponding tranches for just $21.72. \nRivian’s stock shot up to around $129 following its IPO in November 2021. But it fell to around $30 over the next six months, and has spent the last few years typically trading between $10 and $20. This has made it harder for Scaringe to access even part of the 2021 award, let alone the total value of around $6 billion, according to the company. (Scaringe was awarded another 6.8 million stock options that simply vest over time in the 2021 award that were not tied to performance, and the company says those have not been canceled.)\nIn the filing, Rivian wrote that this created a “lack of incentive.” So the compensation committee decided to replace the old award with this new one.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Following a review, and input from an independent compensation consultant, the Compensation Committee cancelled our CEO’s 2021 Performance Grant and issued a new performance stock option and increased our CEO’s base salary,” Rivian said in a statement to TechCrunch. “This new award is designed to retain and incentivize RJ to execute on the Company’s critical next phase as it progresses its technology roadmap and launches R2.” \nSimilar to how Tesla pitched its new award to Musk, Rivian also said the performance grant to Scaringe is “structured in such a way that ensures the options only vest should the company deliver significant value to our shareholders.” The company pointed out that Scaringe won’t see $1 from the award before he helps add $32 billion in value to Rivian, and that shareholders will see “$153 billion of value creation” if he hits all milestones.\nThe maximum amount of shares available to Scaringe under new performance award is 36,500,000. He has 10 years to hit milestones that unlock the full amount, and if he does, he would own an additional 3% of the company. (Scaringe currently owns about 1% of Rivian, down from around 2% earlier this year after he transferred a portion of his holdings to his ex-wife as part of their divorce settlement, as TechCrunch first reported.)\nA majority of those stock options — 22 million — is tied to new stock price hurdles. Scaringe will earn 2 million shares once Rivian’s stock hits $40, and then another 2 million shares for every $10 increase up to a stock price of $140. \nThe remaining 14,500,000 stock options are locked away until Rivian reaches certain adjusted operating income and cash flow targets. Scaringe will have to pay a strike price of $15.22 per share to exercise these options — a possible total of around $555 million.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]