[
  {
    "title": "Samsung plans to bring Google Photos to its TVs in 2026",
    "url": "https://techcrunch.com/2025/12/29/samsung-plans-to-bring-google-photos-to-its-tvs-in-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Samsung-TVs-and-Displays-Samsung-TVs-Google-Photos_main1F.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T14:06:23.000Z",
    "description": "\nIn Brief\nPosted:\n6:06 AM PST · December 29, 2025\n\nImage Credits:Samsung\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFor years now, to enjoy their phot",
    "body": "\nIn Brief\nPosted:\n6:06 AM PST · December 29, 2025\n\nImage Credits:Samsung\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFor years now, to enjoy their photos or videos on the big screen, Google Photos users had to either cast their photos to their Android TVs, or sideload the app to use it. The app is now finally getting a version for Samsung TVs: The Korean tech giant on Monday said it plans to bring Google Photos to its TVs in 2026. \nThe company said the initial version of the Google Photos integration will show curated photos and videos through the Memories feature, which will be exclusive to Samsung for six months. The company said users will need to sign in to their Google accounts to have photos and videos appear on its TVs. \nSamsung also said it plans to add support for AI-powered features like Nano Banana-powered templates, image generation and editing, and the Remix feature, which lets you convert an existing photo to a different style.\n“Google Photos is a home for people’s photos and videos, helping them organize and bring their memories to life. We’re excited to bring Google Photos to Samsung TVs — helping people enjoy their favorite photos on a larger screen and reconnect with their memories in new ways,” said Shimrit Ben-Yair, vice president, Google Photos and Google One, in a statement.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Apps\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Samsung plans to bring Google Photos to its TVs in 2026",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Samsung-TVs-and-Displays-Samsung-TVs-Google-Photos_main1F.jpg?w=150"
      ],
      "datePublished": "2025-12-29T14:06:23.000Z",
      "dateModified": "2025-12-29T14:06:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police charge driver who allegedly killed a pedestrian while livestreaming on TikTok",
    "url": "https://techcrunch.com/2025/12/28/police-charge-driver-who-allegedly-killed-a-pedestrian-while-livestreaming-on-tiktok/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2084803237.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-28T21:52:52.000Z",
    "description": "\nLocal police said they have charged an Illinois driver who struck and killed a pedestrian while she was livestreaming on TikTok.\nThe New York Times r",
    "body": "\nLocal police said they have charged an Illinois driver who struck and killed a pedestrian while she was livestreaming on TikTok.\nThe New York Times reports that Tynesha McCarty-Wroten, who posts to TikTok under the name Tea Tyme, has been charged by the Zion Police Department with two felonies — reckless homicide and aggravated use of a communications device resulting in death.\nIn a video that has been reshared by other accounts on TikTok, a woman posting as Tea Tyme can reportedly be seen speaking into her phone when there’s a loud thud. An offscreen child asks, “What was that?” Then the woman replies, “I hit somebody.”\nSurveillance videos reportedly showed McCarty-Wroten’s vehicle entering the intersection while the traffic light was still red, with investigators determining that she did not seem to slow down or change course before striking Darren Lucas, who was later pronounced dead at the hospital.\nMcCarty-Wroten’s lawyer told the NYT that evidence will show that “what happened was an accident, was a negligent act, but was not an intentional or reckless act.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police charge driver who allegedly killed a pedestrian while livestreaming on TikTok",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2084803237.jpg?w=150"
      ],
      "datePublished": "2025-12-28T21:52:52.000Z",
      "dateModified": "2025-12-28T21:52:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VCs predict enterprises will spend more on AI in 2026 — through fewer vendors",
    "url": "https://techcrunch.com/2025/12/30/vcs-predict-enterprises-will-spend-more-on-ai-in-2026-through-fewer-vendors/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/08/GettyImages-1314946854.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T15:30:24.000Z",
    "description": "\nEnterprises have been piloting and testing different AI tools for the past few years to figure out what their adoption strategy will look like. Inves",
    "body": "\nEnterprises have been piloting and testing different AI tools for the past few years to figure out what their adoption strategy will look like. Investors think that period of experimentation is coming to an end.\nTechCrunch recently surveyed 24 enterprise-focused VCs and an overwhelming majority predicted enterprises will increase their budgets for AI in 2026 — but not for everything. Most investors said this budget increase will be concentrated and that many enterprises will spend more funds on fewer contracts.\nAndrew Ferguson, a vice president at Databricks Ventures, predicted 2026 will be the year that enterprises start consolidating their investments and picking winners.\n“Today, enterprises are testing multiple tools for a single-use case, and there’s an explosion of startups focused on certain buying centers like [go-to-market], where it’s extremely hard to discern differentiation even during [proof of concepts],” Ferguson said. “As enterprises see real proof points from AI, they’ll cut out some of the experimentation budget, rationalize overlapping tools and deploy that savings into the AI technologies that have delivered.”\nRob Biederman, a managing partner at Asymmetric Capital Partners, agreed. He predicts that enterprise companies will not only concentrate their individual spending, but also the broader enterprise landscape will narrow its overall AI spending to only a handful of vendors across the entire industry.\n“Budgets will increase for a narrow set of AI products that clearly deliver results and will decline sharply for everything else,” Biederman said. “We expect a bifurcation where a small number of vendors capture a disproportionate share of enterprise AI budgets while many others see revenue flatten or contract.”\nFocused investments\nScott Beechuk, a partner at Norwest Venture Partners, thinks enterprises will increase their spending on the tools that make AI safe for enterprises to use.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Enterprises now recognize that the real investment lies in the safeguards and oversight layers that make AI dependable,” Beechuk said. “As these capabilities mature and reduce risk, organizations will feel confident shifting from pilots to scaled deployments, and budgets will increase.”\nHarsha Kapre, a director at Snowflake Ventures, predicted enterprises will spend on AI in three distinct areas in 2026: strengthening data foundations, model post-training optimization, and consolidation of tools.\n“[Chief investment officers] are actively reducing [software-as-a-service] sprawl and moving toward unified, intelligent systems that lower integration costs and deliver measurable [return on investment],” Kapre said. “AI-enabled solutions are likely going to see the biggest benefit from this shift.”\nA shift away from experimentation and toward concentration will affect startups. What’s not clear, is how.\nIt’s possible that AI startups will reach the same reckoning point that SaaS startups arrived at a few years ago.\nThe companies operating hard-to-replicate products such as vertical solutions or those built on proprietary data will likely still be able to grow. Startups with products similar to those offered by large enterprise suppliers, like AWS or Salesforce, may start to see pilot projects and funding dry up.\nInvestors see this possibility too. When asked how they know that an AI startup has a moat, multiple VCs said companies with proprietary data and products that can’t easily be replicated by a tech giant or large language model company are the most defensible.\nIf investor predictions are true and enterprises do start to concentrate their AI spend next year, 2026 could be the year enterprise budgets increase but many AI startups don’t see a bigger slice of the pie.\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VCs predict enterprises will spend more on AI in 2026 — through fewer vendors",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/08/GettyImages-1314946854.jpg?w=150"
      ],
      "datePublished": "2025-12-30T15:30:24.000Z",
      "dateModified": "2025-12-30T15:30:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How to make your startup stand out in a crowded market, according to investors",
    "url": "https://techcrunch.com/2025/12/29/vcs-spill-what-they-really-want-to-hear-in-a-founder-pitch/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/54886290779_1a9efe9ba6_o.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T21:00:00.000Z",
    "description": "\nAt TechCrunch Disrupt, three investors took the stage to dissect what makes — and breaks — a pitch deck. Jyoti Bansal, a founder-turned-investor; Med",
    "body": "\nAt TechCrunch Disrupt, three investors took the stage to dissect what makes — and breaks — a pitch deck. Jyoti Bansal, a founder-turned-investor; Medha Agarwal of Defy; and Jennifer Neundorfer of January Ventures shared with the crowd their candid views on what works in a pitch deck — and what doesn’t.\nTheir biggest pet peeve? Buzzword overload.\nThe more a founder says AI in the pitch, Agarwal said, the less AI the company likely uses. “The people who are doing things that are really innovative, they’ll talk about it, and it’s built in, but it’s not the core of their pitch,” she told the audience.  \nBansal, who built and sold multiple companies before becoming an investor, distilled investor expectations into three core questions. First, he asks whether there is a large enough market to tackle. Does the founder’s idea have the potential to become a huge company? And is the problem he or she is solving actually worth solving?\nThe second thing investors want to know is why this founder is the one who should be building the company. “There has to be something unique about you,” Bansal told the crowd, adding that this included having special members on the founding team or having special skills. “Why would you win? If the problem is interesting, there will be 20 other companies trying to solve it, so why would you win and what’s your opportunity?”  \nThe third thing investors want to see, Bansal said, is some validation. “Traction with customers,” he said. “Validation could be initial customer feedback, revenue, something, but some kind of validation.”  \nThese three questions, Bansal noted, all lead to the ultimate litmus test: Could this become a billion-dollar company?\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe panel also addressed how AI startups can differentiate themselves as the space becomes saturated. Bansal emphasized the importance of domain expertise and a clear competitive strategy. Neundorfer said the companies that catch her attention are those enabling new behaviors rather than simply improving an existing process incrementally.  \nAgarwal offered more tactical advice to founders, saying they should explain how AI technology enables their product; articulate clear go-to-market strategies; and demonstrate how their business will be more efficient than incumbents. \nIt’s also very important to be honest about what competitors are out there, she added. Some of you have “lost some credibility with me because you didn’t have it on your slide,” she told the founders in the audience. \nFinally, the investors shared advice for navigating the rapidly evolving landscape. Agarwal urged founders to stay on top of industry developments. Neundorfer recommended staying connected to founder networks to share tools and insights. \nBansal’s advice was simpler: “Focus on building your product.”\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How to make your startup stand out in a crowded market, according to investors",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/54886290779_1a9efe9ba6_o.jpg?w=150"
      ],
      "datePublished": "2025-12-29T21:00:00.000Z",
      "dateModified": "2025-12-29T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta just bought Manus, an AI startup everyone has been talking about",
    "url": "https://techcrunch.com/2025/12/29/meta-just-bought-manus-an-ai-startup-everyone-has-been-talking-about/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2173579488.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T05:39:08.000Z",
    "description": "\nMark Zuckerberg has struck again.\nMeta Platforms is acquiring Manus, a Singapore-based AI startup that’s become the talk of Silicon Valley since it d",
    "body": "\nMark Zuckerberg has struck again.\nMeta Platforms is acquiring Manus, a Singapore-based AI startup that’s become the talk of Silicon Valley since it debuted last spring with a demo video that showed an AI agent doing things like screening job candidates, planning vacations, and analyzing stock portfolios. Manus claimed at the time that it outperformed OpenAI’s Deep Research.\nIn April, just weeks after launch, venture capital firm Benchmark led a $75 million funding round that assigned Manus a post-money valuation of $500 million and saw Benchmark general partner Chetan Puttagunta joining the startup’s board. Per Chinese media outlets, some other big-name backers had already invested in Manus at that point, including Tencent, ZhenFund, and HSG (formerly known as Sequoia China) via a $10 million round.\nThe company announced in mid-December that it has since signed up millions of users and is generating annual recurring revenue of more than $100 million from monthly and yearly subscribers to its membership service.\nIt was around this time that Meta started negotiating with Manus, according to the WSJ, which says the tech giant is paying $2 billion — the valuation Manus was reportedly seeking for its next funding round.\nFor Zuckerberg, who has staked Meta’s future on AI, Manus represents something new: an AI product that’s actually making money. This is especially pertinent given that investors have grown increasingly twitchy about Meta’s $60 billion infrastructure spending spree, and the broader tech industry’s debt-backed expenditures on data center construction.\nMeta says it’ll keep Manus running independently and weave the startup’s AI agents into Facebook, Instagram, and WhatsApp, where Meta’s own chatbot, Meta AI, is already available to users.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThere is one wrinkle, however: Manus’ Chinese founders founded its parent company, Butterfly Effect, in Beijing in 2022, before decamping to Singapore in the middle of this year. Whether that raises flags in Washington remains to be seen, but Senator John Cornyn has already dragged Benchmark for its investment in the company, raising concerns back in May about American capital going to a Chinese concern.\nCornyn, a Texas Republican and senior member of the Senate Intelligence Committee, has long been one of Congress’ most vocal hawks on China and technology competition, but he’s hardly alone. Being tough on China has become one of the few genuinely bipartisan issues in Congress.\nUnsurprisingly, Meta has already told Nikkei Asia that after the acquisition, Manus won’t have any ties to Chinese investors and will no longer operate in China. “There will be no continuing Chinese ownership interests in Manus AI following the transaction, and Manus AI will discontinue its services and operations in China,” a Meta spokesperson told the outlet.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta just bought Manus, an AI startup everyone has been talking about",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2173579488.jpg?w=150"
      ],
      "datePublished": "2025-12-30T05:39:08.000Z",
      "dateModified": "2025-12-30T05:39:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Almost 80 European deep tech university spinouts reached $1B valuations or $100M in revenue in 2025",
    "url": "https://techcrunch.com/2025/12/30/76-european-deep-tech-university-spinouts-reached-unicorn-or-centaur-status/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/02/GettyImages-1162745842.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T18:00:00.000Z",
    "description": "\nUniversities and research labs have long been Europe’s deep tech treasure trove. Now, academic spinouts have consolidated into a solid startup funnel",
    "body": "\nUniversities and research labs have long been Europe’s deep tech treasure trove. Now, academic spinouts have consolidated into a solid startup funnel worth $398 billion — and VC money is following.\nAccording to Dealroom’s European Spinout Report 2025, 76 of these deep tech and life sciences companies have either reached $1 billion valuations, $100 million in revenue, or both. These include unicorns like Iceye, IQM, Isar Aerospace, Synthesia, and Tekever, which are now inspiring more funds to back university spinouts.\nJust this month, two new funds emerged that will bring more funding to talent emerging out of European tech universities, while adding breadth to a pipeline currently topped by Cambridge, Oxford, and ETH Zurich.\nPSV Hafnium, out of Denmark, recently closed its inaugural fund at an oversubscribed €60 million (approximately $71 million), with a focus on Nordic deep tech. With offices in Berlin and London, but also in Aachen, U2V (University2Ventures) is targeting the same amount for its first fund, of which it recently completed the first closing.\nThese two newcomers join the growing ranks of European venture firms that have university spinouts as a core part of their investment thesis. Pioneered by the likes of Cambridge Innovation Capital and Oxford Science Enterprises, which have now fully matured, this category has also diversified. \nWhile it still mostly consists of funds backed by one or several universities and institutes, it now includes independent firms that simply see spinouts as potential fund returners — and rightly so. Oxford Ionics, acquired by U.S.-based IonQ, was one of the six spinouts out of Switzerland, the U.K., and Germany that delivered exits of more than $1 billion to their investors in 2025.\nThese exits come alongside increased amounts of funding. According to Dealroom, European university spinouts in deep tech and life sciences are on track to raise a near all-time-high $9.1 billion in 2025. This contrasts with overall VC funding in Europe, which is down nearly 50% from its 2021 peak. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLarge rounds closed in 2025 also reflect appetite for spinouts in sectors as varied as nuclear energy — Proxima Fusion — and dual-use drones — Quantum Systems, now valued above $3 billion. In many cases, these startups leverage research from specialized labs, which also explains why there is a long tail of European locations capable of producing spinouts. \nBuilding relationships with hubs outside of Oxbridge and leading countries can also be a way for newcomers to differentiate themselves and find deals. “The Nordic’s research institutions hold extraordinary, untapped potential,” PSV Hafnium’s partners stated in a press release. \nPSV Hafnium itself is a spinout from the Technical University of Denmark (DTU), but is also making early-stage investments in other Nordic countries. One of its nine checks to date went to SisuSemi, a Finnish startup leveraging a decade of research at the University of Turku to bring new surface cleaning tech to the semiconductor industry. \nIt is good news for teams like SisuSemi that there is more funding available to them. It also comes in addition to grants, commercialization support, and improved deal terms that contribute to an encouraging environment for Europe’s spinouts. However, one pain point remains: growth capital.\nAs the report’s authors note, this gap “is not a unique trend to spinouts, but something impacting the entire startup ecosystem in Europe.” Still, it is quite striking that nearly 50% of late-stage funding for European deep tech and life sciences spinouts comes from outside Europe, mainly from the U.S. \nWhile this share has decreased over the years, Europe won’t be fully reaping the benefits of its investments in talent and research unless this changes more substantially — but that’s a broader issue to be solved.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Almost 80 European deep tech university spinouts reached $1B valuations or $100M in revenue in 2025",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/02/GettyImages-1162745842.jpg?w=150"
      ],
      "datePublished": "2025-12-30T18:00:00.000Z",
      "dateModified": "2025-12-30T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The best AI-powered dictation apps of 2025",
    "url": "https://techcrunch.com/2025/12/30/the-best-ai-powered-dictation-apps-of-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1424498694.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T16:00:00.000Z",
    "description": "\nIn some ways, 2025 was when AI dictation apps really took off. Dictation apps have been around for years, but in the past they’ve proved slow and ina",
    "body": "\nIn some ways, 2025 was when AI dictation apps really took off. Dictation apps have been around for years, but in the past they’ve proved slow and inaccurate — unless you speak with particular accents and enunciate clearly. \nBut advances in large language models (LLMs) and speech-to-text models have helped improve the systems that can decipher speech better while retaining the context to format the text. And developers have built in features to automatically format text, remove filler words, and ignore fumbles to output text that would need fewer edits. \nBut with the soaring popularity of everything AI, there’s dozens of such apps on the market. So we’ve collated our pick of the best and most useful dictation apps his year.\nWispr Flow\nWispr Flow is a well-funded AI dictation app that lets you add custom words and instructions for dictation. It has native apps for macOS, Windows, and iOS, and an Android version is in the works.\nThe app lets you customize how its system transcribes your notes by letting you choose from “formal,” “casual,” and “very casual” styles for different kinds of writing, such as personal messaging, work, and email. And if you use it with vibe-coding tools like Cursor, you can turn on a feature to automatically recognize variables or tag files in the chat.\nThe app lets you note up to 2,000 words per month for free on any of the desktop versions, and 1,000 words per month on iOS. Its subscription plans offer unlimited transcription and start at $15 per month.\nImage Credits:Wispr Flow\nWillow\nWillow advertises itself as a big time-saver for those who don’t like to type. Alongside common features like automatic editing and formatting, the app has a feature that taps large language models to generate a full chunk of text from just a few dictated words.\nWillow also takes a more privacy-focused stab at AI-assisted note-taking by storing all transcripts locally on your device, and lets you opt out of model training as well. It also lets you add custom vocabulary to the app to help it adapt to your industry’s parlance, or your local dialect. \nImage Credits:Willow\nWillow lets you dictate 2,000 words per month on its desktop app for free. Individual subscription plans start at $15 per month, giving you unlimited dictation and enabling the app to remember your writing style.\nMonologue\nIf you are focused on privacy, Monologue lets you download its model so you can run it on your device for transcriptions and avoid sending data to the cloud. What’s more, the app lets you customize its tone of voice according to the apps you use it with.\nMonologue lets you jot down 1,000 words per month for free, and its subscription costs $10 per month, or $100 per year. And if you end up becoming one of the app’s top users, the company will also send you this funky Monokey to use with the app.\n\nKeyboards are so 1983.You only need one key—Monokey, the limited edition device that turns your voice into text in Monologue.We're giving away 10, along with a free annual subscription to Monologue. pic.twitter.com/nXuz1ll2LU— Monologue (@usemonologue) November 18, 2025\n\nSuperwhisper\nSuperwhisper is primarily a dictation app, but it can also transcribe from audio or video files. The app gives you the freedom to choose and download AI models, including its own models that have different speeds and accuracy, along with Nvidia’s Parakeet speech-recognition models.\nThe app also lets you write custom prompts to steer the output. You can easily see both processed and unprocessed transcripts that are integrated with the system keyboard.\n\n\n\nThe basic voice-to-text feature is free to use, and you get 15 minutes to test out Pro features such as translation and transcription. The paid tier lets you use your own AI API keys and plug in cloud and local models without any caps. \nThe monthly plan costs $8.49 per month, the annual plan costs $84.99 per month, or you can pay $249.99 for a lifetime subscription.\nVoiceTypr\nThe VoiceTypr app takes an offline-first, no-subscription approach, letting you use local models for transcription. There’s also a GitHub repository for those who want to host and run the open source version themselves. VoiceTypr supports over 99 languages and works on both Mac and Windows.\nThe app is available to try for three days for free, and after that it will allow you to buy a lifetime license. The app costs $35 for one device, $56 for two, and $98 for four devices.\nAqua\nAqua is another Y Combinator-backed voice-typing client for Windows and macOS that claims to be one of the fastest tools in the category in terms of latency.\nBesides handling grammar and punctuation, Aqua also lets you autofill text by saying phrases — you can say “my address” and have Aqua type in your address, for example. \nThe app also offers its own speech-to-text API for other apps.\n\n\n\nThe free tier gets you 1,000 words per month. The paid plans start from $8 per month (annual billing) and unlock unlimited words and 800 custom dictionary values.\nHandy\nHandy is an open source and free transcription tool that can run on Mac, Windows, and Linux. The application is pretty basic and doesn’t offer a lot of customization, but if you are trying to get started with using your voice more and don’t want to pay, it is a good option.\nThe app has a basic settings menu that lets you toggle push-to-talk, and change the hotkey to activate the transcription.\nTypeless\nTypeless is another app in this category with a high free word count. The company claims that it doesn’t retain any data or use it to train models. Typeless also suggests a better version of the sentence if you might have fumbled a line.\nThe app lets you dictate up to 4,000 words per week (roughly 16,000 words per month) on its free tier. You can pay $12 per month (billed annually) to unlock unlimited words and get access to new features. Typeless is available for Windows and macOS only.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The best AI-powered dictation apps of 2025",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1424498694.jpg?w=150"
      ],
      "datePublished": "2025-12-30T16:00:00.000Z",
      "dateModified": "2025-12-30T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The phone is dead. Long live . . . what exactly?",
    "url": "https://techcrunch.com/2025/12/30/the-phone-is-dead-long-live-what-exactly/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Sandbar_stream_ring-feat.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-31T05:37:03.000Z",
    "description": "\nTrue Ventures co-founder Jon Callaghan doesn’t think we’ll be using smartphones the way we do now in five years — and maybe not at all in 10.\nFor a v",
    "body": "\nTrue Ventures co-founder Jon Callaghan doesn’t think we’ll be using smartphones the way we do now in five years — and maybe not at all in 10.\nFor a venture capitalist whose firm has had some big winners over its two decades – from consumer brands like Fitbit, Ring, and Peloton, to enterprise software makers HashiCorp and Duo Security – that’s more than armchair theorizing; it’s a thesis on which True Ventures is actively betting.\nTrue hasn’t gotten this far by following the crowd. The Bay Area firm has largely operated under the radar despite managing roughly $6 billion across 12 core seed funds and four “select,” opportunity-style funds that it has used to pour more capital into portfolio companies that are gaining momentum. While other VCs have grown more promotional – building personal brands on social media and podcasts to attract founders and deal flow – True has gone in the opposite direction, quietly cultivating a tight network of repeat founders. The strategy seems to be working: according to Callaghan, the firm boasts 63 exits with gains and seven IPOs amid a portfolio of some 300 companies assembled over its 20-year history.\nThree of True’s four recent exits in the fourth quarter of 2025 involved repeat founders who came back to work with the firm again after previous successes, says Callaghan. Still, it’s Callaghan’s thinking about the future of human-computer interaction that really stands out in a sea of AI hype and mega-rounds.\n“We’re not going to be using iPhones in 10 years,” Callaghan says flatly. “I kind of don’t think we’ll be using them in five years – or let’s say something different that’s a little safer – we’re going to be using them in very different ways.”\nHis argument is simple: our phones are lousy at being the interface between humans and intelligence. “The way we take them out right now to send a text to confirm this or send you some message or write an email – [that’s] super inefficient, [and] not a great interface,” he explains. “[They’re] prone to error, prone to disruption [of] our normal lives.”\nSo sure is he of this that True has been spending years exploring alternative interfaces – software-based, hardware-based, everything in between. It’s the same instinct that led True to bet early on Fitbit before wearables were obvious, to invest in Peloton after hundreds of other VCs said ‘no thanks,’ and to back Ring when founder Jamie Siminoff kept running out of money and even the judges on “Shark Tank” turned him away. Each time, the bet looked questionable, says Callaghan. Each time, the bet was on a new way for humans to interact with technology that felt more natural than what came before.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe latest manifestation of this thesis is Sandbar, a hardware device that Callaghan describes as a “thought companion” — or, in more mundane terms, a voice-activated ring worn on the index finger. Its singular purpose: capturing and organizing your thoughts through voice notes. It’s not trying to be another Humane AI Pin or compete with Oura’s health tracking. “It does one thing really well,” Callaghan says. “But that one thing is a fundamental human behavioral need that is missing from technology today.”\nThe idea isn’t to passively record ambient audio but to be there when an idea strikes, serving as a kind of thought partner. It’s attached to an app, leverages AI, and, according to Callaghan, represents a very different philosophy about how we should interact with intelligence.\nWhat drew True to Sandbar founders Mina Fahmi and Kirak Hong wasn’t just the product, though. “When we met Mina, we were just absolutely aligned on vision,” Callaghan recalls. True’s team had already been thinking for years about alternative interfaces, making targeted investments around that possibility. They’d met with dozens of founders, as a result. But the approach of Fahmi and Hong – who previously worked together on neural interfaces at CTRL-Labs, a startup acquired by Meta in 2019 – stood out. “It’s about what [the ring] enables. It’s about the behavior it enables that we will very soon realize we can’t live without.”\nThere’s an echo here of Callaghan’s old line about Peloton: “It’s not about the bike.” To some, the bike – even its earliest iteration – was compelling. But Peloton was really about the behavior it enabled and the community it created; the bike was just the vessel.\nThis philosophy of betting on new behaviors — not just new gadgets — also explains how True has managed to stay disciplined about capital. Even as AI startups raise hundreds of millions at billion-dollar valuations out of the gate, True insists that it’s able to stick to what it does best, which is to write seed checks of $3 million to $6 million for 15% to 20% ownership in startups that it often gets to see first.\nCallaghan says True will raise more money to fund what’s working, but he’s not interested in raising billions of dollars. “Like, why? You don’t need that to build something amazing today.”\nThat same measured approach colors his view of the broader AI boom. While he says (when asked) that he believes OpenAI could soon be worth a trillion dollars, and while he calls this the most powerful compute wave we’ve seen, Callaghan sees warning signs in the circular financing deals backing hyperscalers and their $5 trillion in projected CapEx spending on data centers and chips. “We’re in a very capital intense part of the cycle, and that is worrisome,” he notes.\nThat said, he’s optimistic about where the real opportunities lie. Callaghan thinks the greatest value creation is ahead of us – not in the infrastructure layer but in the application layer, where new interfaces will enable entirely new behaviors.\nIt all comes back to his core investing philosophy, which sounds almost romantic — the kind of pitch-perfect VC wisdom that would ring hollow from most people: “It should be scary and lonely and you should be called crazy,” Callaghan says about early-stage investing done right. “And it should be really blurry and ambiguous, but you should be with a team that you really believe in.” Five to ten years later, he says, you’ll know if you were on to something.\nEither way, based on True’s track record of betting on hardware that many others missed – fitness trackers, connected bikes, smart doorbells, and now thought-capturing rings – it’s worth paying attention when Callaghan says the phone’s days are numbered. Being early is the whole point — and the trend lines support his thesis: the smartphone market is effectively saturated, growing at barely 2% annually, while wearables — smartwatches, rings, and voice-enabled devices — are expanding at double-digit rates. \nSomething’s shifting in how we want to interact with technology, and True is placing its bets accordingly.\nPictured above, Sandbar’s Stream ring. For much more from our conversation with Callaghan, tune in to the StrictlyVC Download podcast next week; new episodes drop every Tuesday.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The phone is dead. Long live . . . what exactly?",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Sandbar_stream_ring-feat.jpg?w=150"
      ],
      "datePublished": "2025-12-31T05:37:03.000Z",
      "dateModified": "2025-12-31T05:37:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sauron, the high-end home security startup for ‘super premium’ customers, plucks a new CEO out of Sonos",
    "url": "https://techcrunch.com/2025/12/28/from-sonos-to-sauron-new-ceo-takes-on-high-end-home-security-startup-still-in-development/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Max-Headshot.jpg?w=142",
    "tag": "Tech",
    "date": "2025-12-29T02:20:00.000Z",
    "description": "\nWhen Kevin Hartz’s security system failed to alert him as an intruder rang his doorbell and tried to enter his San Francisco home late one night, the",
    "body": "\nWhen Kevin Hartz’s security system failed to alert him as an intruder rang his doorbell and tried to enter his San Francisco home late one night, the serial entrepreneur decided existing solutions weren’t good enough. His co-founder Jack Abraham had experienced similar frustrations at his Miami Beach residence.\nIn 2024, they launched Sauron — named after the sinister, all-seeing eye from “The Lord of the Rings” — to build what they envisioned as a military-grade home security system for tech elites. The concept resonated in Bay Area circles, where crime had become a constant topic during and after the pandemic, despite San Francisco Police Department statistics showing property crime and homicide rates declining last year.\nThe startup raised $18 million from executives behind Flock Safety and Palantir; defense tech investors, including 8VC; Abraham’s startup lab Atomic; and Hartz’s investment firm A*. It came out of stealth exactly a year ago, promising to launch in the first quarter of 2025 with a system combining AI-driven intelligence, advanced sensors like LiDAR and thermal imaging, and 24/7 human monitoring by former military and law enforcement personnel.\nBut a year later, Sauron is still very much in development mode —  a reality that its new CEO, Maxime “Max” Bouvat-Merlin, acknowledged candidly in a recent interview with TechCrunch.\nAfter nearly nine years at Sonos, including a stint as chief product officer, Bouvat-Merlin took the helm of Sauron just last month. He’s spending his first days on the job finalizing fundamental questions: which sensors to use, how exactly the deterrence system will work, and when the company can realistically get products into customers’ homes.\nThe answer to that last question? Later in 2026 at the earliest — a significant delay from the original timeline.\n“We’re in the development phase,” Bouvat-Merlin said. “You’ll see a phased approach where we get our solution to market as a stepping stone. All the different components — our concierge service, our AI software running on servers, our smart cameras — are building blocks coming together in a plan we just put in place very recently.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nStill, Bouvat-Merlin sees striking parallels between Sauron and Sonos, which both target wealthy customers first, rely on word-of-mouth growth, and combine complex hardware with sophisticated software. “I had lunch with John MacFarlane, the founder of Sonos, a few weeks ago,” Bouvat-Merlin said. “All the topics he was thinking about when starting Sonos were exactly the same topics we’re discussing at Sauron.”\nBoth companies faced the same strategic questions: Start with super-premium customers or mass premium? Professional installation or DIY? Build everything in-house or partner with an ecosystem? “We might make different decisions, but the questions are very similar,” he said.\nThe security problem \nBouvat-Merlin says he was drawn to Sauron by both the mission and an opportunity to solve a real customer problem. “Securing people’s homes is important, but I also like the deterrence aspect — changing people’s minds before they make a bad decision and get into trouble,” he said.\nHis research showed that market leaders in premium home security have small market shares and negative Net Promoter Scores. “People are not happy with their solutions today,” he said. “There are so many false positives that when law enforcement is called, they don’t respond because they assume it’s a false alarm.”\nThe company is targeting customers “where safety and security is a major concern”  —  people like Hartz. The plan is to start with this premium segment, establish a reputation for supporting demanding clients, then expand to what Bouvat-Merlin calls “mass premium.”\nThe product (that’s still taking shape)\nSo what exactly is Sauron building? The answer is still evolving. The offering starts with camera pods containing multiple sensors —  “40 cameras and different types of sensors, potentially LiDAR and radar, potentially thermal,” Bouvat-Merlin said. These pods connect to servers running machine learning software for computer vision, all linked to a 24/7 concierge service staffed by former military and law enforcement personnel.\n“Those people understand patterns,” he said. “They’re good at helping us mature our machine learning solution and train our system to detect weird behaviors.”\nThe deterrence system remains somewhat vague. Options being considered include loudspeakers, flashing lights, and other methods. But Bouvat-Merlin emphasized that deterrence should begin before someone enters a property, detecting when homes are being surveilled, noticing cars circling neighborhoods multiple times, and identifying threats at each stage.\n“The more upfront we are with deterrence, the more we can convince people this is the wrong house to rob and the wrong decision to make,” he said.\nAs for the drones mentioned when Sauron first took the wraps off its plans last year, Bouvat-Merlin declined to say much. “These are roadmap conversations. I don’t want to go too deep at this point because there are so many things we could do, but we’re such a small company,” he said. He added that, bigger picture, the focus is on growing the ecosystem through partnerships rather than reinventing the wheel.\nTimeline and business model\nWith fewer than 40 employees, Sauron plans to hire just 10 to 12 more in 2026. The company will also begin working with early adopters later in 2026, with a Series A fundraise planned for mid-year.\n“Raising a Series A is not about raising because we have to — it’s because we want to,” Bouvat-Merlin said. “I want to make sure we’re showing progress and explaining how we’ll use extra funds to accelerate growth, [including to] launch our first end-to-end product, drive customer adoption, and accelerate the roadmap.”\nThe company has already attracted a significant list of prospective clients, he said, thanks to work by Sauron’s three founders, which include roboticist and engineer Vasumathi Raman. “We expect the strategy initially to be word of mouth, then grow differently over time.”\nBut Bouvat-Merlin is cautious about growth. “I want to make sure we grow sustainably and keep the experience and service premium over time,” he said. “I want to manage growing pains as much as possible while driving profitability.”\nThe surveillance state question\nFacial recognition and privacy concerns loom large for a surveillance-heavy product. Bouvat-Merlin outlined one approach: a trust-based system where homeowners grant access to specific people. “I granted you access to my house, so now you’re in the trusted group. When you come, I detect it’s you and you’re allowed in. Everyone else is an unknown person,” he said, painting a picture of a likely scenario.\nLicense plate detection is also being considered for identifying cars circling neighborhoods multiple times. “How do we assess if that’s a threat? The ex-military and ex-law enforcement team will be really good at helping mature our machine learning solution,” he said.\nEither way, Bouvat-Merlin is confident in the opportunity ahead because of Sauron’s approach. “A lot of companies started as traditional security companies and are trying to add tech,” Bouvat-Merlin said. “We’re looking at it from the opposite angle — we’re a tech startup in San Francisco bringing technology to this market.”\nSauron is also appearing on the scene as concerns rise about crime among the most wealthy. Recent high-profile incidents include a November armed robbery at the home of tech investors Lachy Groom and Joshua Buckley in San Francisco’s Mission District, where $11 million in cryptocurrency was stolen during a 90-minute ordeal involving torture and threats.\n“We see people who are wealthy attracting criminals,” Bouvat-Merlin said. “We’ve seen a lot of robberies in San Francisco and other major U.S. cities, sometimes at gunpoint. I don’t think the world is getting safer — there are probably more disparities between people at the top and bottom of the wealth spectrum. We see anxiety from prospective clients who are eager to get their homes secured.”Still, much remains uncertain about Sauron’s path. The company must finalize everything from sensor configurations to manufacturing locations. (Bouvat-Merlin mentioned potentially starting in the U.S. for proximity and control, then moving to more affordable locations as volume grows.)\nIt must also determine how to serve customers in different settings,  from estates with perimeters to dense urban residences, while maintaining premium service quality.\nFor now, Bouvat-Merlin says he’s focused on listening to his team, building credibility, and finalizing the strategy he’s putting in place. “I don’t demand that people trust me  — I want to show them why they should.”\nThe company expects to share more details about its products later next year.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sauron, the high-end home security startup for ‘super premium’ customers, plucks a new CEO out of Sonos",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Max-Headshot.jpg?w=142"
      ],
      "datePublished": "2025-12-29T02:20:00.000Z",
      "dateModified": "2025-12-29T02:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why the electrical grid needs more software",
    "url": "https://techcrunch.com/2025/12/29/why-the-electrical-grid-needs-more-software/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/Energy-sector-Getty.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T17:00:00.000Z",
    "description": "\nOne of the nicest comments people have made about the electrical grid was … nothing. The grid works best when it fades into the background. \nThat low",
    "body": "\nOne of the nicest comments people have made about the electrical grid was … nothing. The grid works best when it fades into the background. \nThat low-profile status has changed in recent years as fires in California and freezes in Texas raised awareness of the electrical grid. But it was in 2025, when the electrical grid — and concerns about demand, supply, pricing, and the strain on natural resources — moved into the spotlight. And a new batch of startups have emerged with a software-as-a-solution pitch. \nElectricity rates are up 13% in this U.S. this year driven by an AI boom that has seeped into unlikely places, including repurposing supersonic jet engines for data center duty and working on beaming solar power down from space.\nAnd that pace of growth isn’t expected to slow; the amount of electricity data centers use is projected to nearly triple in the coming decade. That forecast has fueled consumer frustration around pricing and drawn the ire of environmental groups that have called for a nationwide moratorium on new projects. Utilities, which have toiled away in the background, are now scrambling to upgrade the grid and build new power plants that can cope with the load — the fear of an AI bubble bursting always lingering in the background.\nThis confluence of demand and fear could give software startups a boost in the coming year.\nFor example, startups like Gridcare and Yottar argue that spare capacity already exists on the grid and that software can help find it.\nGridcare has gathered data on transmission and distribution lines, fiber-optic connections, extreme weather, and even community sentiment to optimize the search for new locations and convince utilities the grid can handle it. Already, the company says it has found several such sites that have been overlooked. Yottar finds places where known capacity exists and overlaps with the needs of medium-size users, helping them quickly connect amid the data center boom.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSeveral other startups are using software to stitch together massive fleets of batteries scattered across the grid. Those startups can turns these fleets into virtual power plants to deliver power to the grid when it’s needed most.\nBase Power, for example, is building one in Texas by leasing batteries to homeowners at relatively low prices. Homeowners can use the batteries for backup power in case of outages, while Base can tap into them to prevent outages by selling the aggregated capacity to the grid. Terralayr is doing something similar, though it doesn’t sell batteries itself. Instead, Terralayr uses software to bundle distributed storage assets already installed on the German grid.\nOther startups, including Texture, Uplight, and Camus, are developing software layers to integrate and coordinate distributed energy sources like wind, solar, and batteries. The hope is that by orchestrating various assets, they will idle less and contribute more to the grid.\nThere’s also some hope that software can help modernize some of the more outdated parts of the grid. \nNvidia, for example, has partnered with EPRI, a power industry R&D organization, to develop industry-specific models in the hopes they will improve efficiency and resiliency. Meanwhile, Google is working with the grid operator PJM to use AI to help sift through its backlog of connection requests from new sources of electricity.\nThese changes won’t happen overnight, but 2026 could be the year when they begin to take hold. \nUtilities tend to be slow to adopt new technologies because of concerns about reliability. But they’re also slow to invest in new infrastructure because it’s costly and long-lived. Ratepayers and regulators have been known to balk when such projects begin to affect affordability. \nSoftware, though, is cheaper, and if it can clear the reliability hurdle, the companies offering it will have a good chance of gaining traction. \nAnd that could benefit more than the startups hawking software. Ultimately, the grid is going to need some refurbishment and expansion. Given the number of planned data centers and the electrification of broad swathes of the economy, including transportation, heating, and more, we will need more power. It would be foolish to ignore the power of software in these instances. It’s cheap, flexible, and speedy to deploy. \n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why the electrical grid needs more software",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/Energy-sector-Getty.jpg?w=150"
      ],
      "datePublished": "2025-12-29T17:00:00.000Z",
      "dateModified": "2025-12-29T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Social media follower counts have never mattered less, creator economy execs say",
    "url": "https://techcrunch.com/2025/12/29/social-media-follower-counts-have-never-mattered-less-creator-economy-execs-say/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/11/GettyImages-1213710695-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T20:00:00.000Z",
    "description": "\nAs social media becomes increasingly reliant on algorithmic feeds, creators are navigating a new normal: Just because you post something doesn’t mean",
    "body": "\nAs social media becomes increasingly reliant on algorithmic feeds, creators are navigating a new normal: Just because you post something doesn’t mean your followers will see it.\n“I think that 2025 was the year where the algorithm completely took over, so followings stopped mattering entirely,” LTK CEO Amber Venz Box told TechCrunch.\nThis isn’t news to creators — Patreon CEO Jack Conte has ardently banged this drum for years — but throughout the year, the industry at large has reacted to this phenomenon in different ways, from the influencers to the streamers.\nAccording to the executives that TechCrunch spoke to about the near future of the creator economy, creators are finding new ways to harness and cultivate their relationships with their followers — some acting as a salve to AI slop, while others are flooding the zone with a new form of slop themselves.\nBox’s company, LTK, connects creators with brands through affiliate marketing, where creators earn commissions on products they recommend. The business model depends entirely on audiences retaining trust in individual creators. Given concerns about fragmentation in the creator-audience relationship, this could pose an existential threat to the company.\nBut a study commissioned from Northwestern University found that trust in creators increased 21% year-over-year, which was a pleasant surprise to Box.\n“If you asked me at the beginning of 2025, ‘Hey, is trust in creators going to go up or down?’ I would have probably said down, because people understand it’s an industry — they understand how it’s working,” she said. “But actually, AI pushed people to kind of rotate trust to real humans that they know have real life experiences.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBy that, Box means that consumers are more likely to go out of their way to see content from the creators they know and trust. According to the study, 97% of chief marketing officers intend to grow influencer marketing budgets in the new year.\nThat doesn’t mean that owning these relationships is straightforward. LTK creators, who rely on affiliate income, are betting this AI-induced skepticism will drive people toward more direct relationships through paid fan communities or less algorithmic platforms like LTK. For other kinds of creators, such as streamers, video podcasters, and short filmmakers, the strategy for owning their audience can more closely resemble growth hacking.\nTeenage clipping armies\nAs Sean Atkins, CEO of short-form video production company Dhar Mann Studios, put it, “In a world that’s driven by AI and algorithms, where people trust another human being more in this micro atomization of attention, how do you market when you sort of can’t control that?”\nAccording to Eric Wei, co-founder of Karat Financial, a financial services company for creators, creators have a new secret weapon: armies of teenagers on Discord who creators pay to make clips of their content, which those same teenagers post en masse on algorithmic platforms.\n“That’s been going on for a bit,” Wei explained. “Drake does it. A lot of the biggest creators and streamers in the world have been doing it — Kai Cenat [a top Twitch streamer] has done it — hitting millions of impressions … If it’s algorithmically determined, clipping suddenly makes sense, because it can come from any random account that just has really good clips.”\nWei thinks that clipping is going to become even more popular this year, since it’s a reaction to this fragmentation in social media relationships. Even the biggest creators are finding it hard to reach their fans directly, which is why they turn to clipping. While going viral on these algorithmic feeds is certainly easier if you have a ton of followers, you don’t need any track record on a platform for it to decide that your video should be distributed more broadly. So, if these “clippers” post a short highlight from certain creators’ streams, they can earn money based on how many views the video gets. \n“Clipping feels like an evolution of meme accounts,” Glenn Ginsburg, president of QYOU Media, which produces content for young audiences, told TechCrunch. “It’s become a race among many creators to try and take this content and push it out far and wide, almost competing to see who can get the most views on the same IP.”\nReed Duchscher — founding CEO of Night, the talent management company that represents Kai Cenat and other top creators — masterfully coaches creators through maximizing their virality. As MrBeast’s former manager, Duchscher helped cultivate the fast-paced, attention-grabbing style that transformed MrBeast from a YouTuber into an empire. He’s also behind Kai Cenat’s clipping strategy, though Duchscher isn’t quite as enthusiastic about its broader potential as Wei.\n“Clipping is important if you’re a creator, because you do need to flood the zone with content, and it’s a good way to get your face out there,” Duchscher told TechCrunch. “It’s also very hard to get to scale, because there’s only so many clippers on the internet, so to spend large media budgets … there’s just a lot of complications.”\nPerhaps clipping only works now because the technique has not yet become so prevalent that it’s seen as spam.\n“The creator wins because they get more of their content out,” Wei said. “The clippers win because now this army of teenagers are getting paid. Everybody wins, except that if you take this to its logical conclusion, we just get lots and lots of slop.”\nThe more niche, the better\nThe prevalence of slop on social media has become enough of a threat that Merriam-Webster called slop its word of the year.\n“Over 94% of people are saying that social media is no longer social, and over half of them are rotating time elsewhere into smaller niche communities that they know are real and that they can talk to and interact with,” Box said, pointing to platforms like Strava, LinkedIn, and Substack. \nAs the relationship between a creator and their audience becomes more difficult to maintain, Duchscher predicts that creators with more specific niches will succeed — he thinks that “macro creators” like MrBeast, PewDiePie, or Charli D’Amelio, who amass hundreds of millions of followers, will become even harder to emulate.\nPointing to success stories like Alix Earle or Outdoor Boys, who have millions of followers but not necessarily mass appeal, Duchscher adds, “Algorithms have gotten so good at giving us exactly the content we want. It’s much harder for a creator to break out into every niche algorithm.” \nAtkins agrees, arguing that the creator economy extends far beyond entertainment. “The creator economy generally is viewed through this lens of entertainment. I think that’s a mistake, because thinking about the creator economy is a little bit like thinking about the internet or AI — it’s going to affect everything.”\nAtkins mentions the gardening creator brand Epic Gardening as an example. What started as a YouTube channel has created a real, tangible presence in the world of gardening.\n“Epic Gardening bought the third largest seed company in the United States, so now he’s the third largest seed company [owner], as a content creator,” he said.\nThough the creator economy is in flux, it’s a resilient industry — one that’s accustomed to navigating the whims of the algorithm, persisting onward for decades, even if the uninitiated may see it as a brand-new realm.\nCreators are “literally impacting everything,” Atkins said. “I bet you there’s a creator who’s an expert at cement mixing for skyscrapers.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Social media follower counts have never mattered less, creator economy execs say",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/11/GettyImages-1213710695-1.jpg?w=150"
      ],
      "datePublished": "2025-12-29T20:00:00.000Z",
      "dateModified": "2025-12-29T20:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You’ve been targeted by government spyware. Now what?",
    "url": "https://techcrunch.com/2025/12/29/youve-been-targeted-by-government-spyware-now-what/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/eye-ball-red-curtain-spyware-e1766520101839.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T10:00:00.000Z",
    "description": "\nIt was a normal day when Jay Gibson got an unexpected notification on his iPhone. “Apple detected a targeted mercenary spyware attack against your iP",
    "body": "\nIt was a normal day when Jay Gibson got an unexpected notification on his iPhone. “Apple detected a targeted mercenary spyware attack against your iPhone,” the message read.\nIronically, Gibson used to work at companies that developed exactly the kind of spyware that could trigger such a notification. Still, he was shocked that he received a notification on his own phone. He called his father, turned off and put his phone away, and went to buy a new one.\n“I was panicking,” he told TechCrunch. “It was a mess. It was a huge mess.”  \nGibson is just one of an ever-increasing number of people who are receiving notifications from companies like Apple, Google, and WhatsApp, all of which send similar warnings about spyware attacks to their users. Tech companies are increasingly proactive in alerting their users when they become targets of government hackers, and in particular those who use spyware made by companies such as Intellexa, NSO Group, and Paragon Solutions.\nBut while Apple, Google, and WhatsApp alert, they don’t get involved in what happens next. The tech companies direct their users to people who could help, at which point the companies step away.\nThis is what happens when you receive one of these warnings. \nWarning \nYou have received a notification that you were the target of government hackers. Now what? \nFirst of all, take it seriously. These companies have reams of telemetry data about their users and what happens on both their devices and their online accounts. These tech giants have security teams that have been hunting, studying, and analyzing this type of malicious activity for years. If they think you have been targeted, they are probably right. \nIt’s important to note that in the case of Apple and WhatsApp notifications, receiving one doesn’t mean you were necessarily hacked. It’s possible that the hacking attempt failed, but they can still tell you that someone tried. \nA photo showing the text of a threat notification sent by Apple to a suspected spyware victim.Image Credits:Omar Marques / Getty Images\nIn the case of Google, it’s most likely that the company blocked the attack and is telling you so you can go into your account and make sure you have multi-factor authentication on (ideally a physical security key or passkey), and also turn on its Advanced Protection Program, which also requires a security key and adds other layers of security to your Google account. In other words, Google will tell you how to better protect yourself in the future. \nIn the Apple ecosystem, you should turn on Lockdown Mode, which switches on a series of security features that makes it more difficult for hackers to target your Apple devices. Apple has long claimed that it has never seen a successful hack against a user with Lockdown Mode enabled, but no system is perfect. \nMohammed Al-Maskati, the director of Access Now’s Digital Security Helpline, a 24/7 global team of security experts who investigate spyware cases against members of civil society, shared with TechCrunch the advice that the helpline gives people who are concerned that they may be targeted with government spyware.\nThis advice includes keeping your devices’ operating systems and apps up-to-date; switching on Apple’s Lockdown Mode and Google’s Advanced Protection for accounts and for Android devices; being careful with suspicious links and attachments; restarting your phone regularly; and paying attention to changes in how your device functions.\n\n\t\t\tContact Us\n\t\t\tHave you received a notification from Apple, Google, or WhatsApp about being targeted with spyware? Or do you have information about spyware makers? We would love to hear from you. From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, or email.\t\t\nReaching out for help\nWhat happens next depends on who you are. \nThere are open source and downloadable tools that anyone can use to detect suspected spyware attacks on their devices, which requires a little technical knowledge. You can use the Mobile Verification Toolkit, or MVT, a tool that lets you look for forensic traces of an attack on your own, perhaps as a first step before looking for assistance. \nIf you don’t want or can’t use MVT, you can go straight to someone who can help. If you are a journalist, dissident, academic, or human rights activist, there are a handful of organizations that can help. \nYou can turn to Access Now and its Digital Security Helpline. You can also contact Amnesty International, which has its own team of investigators and ample experience in these cases. Or, you can reach out to The Citizen Lab, a digital rights group at the University of Toronto, which has been investigating spyware abuses for almost 15 years. \nIf you are a journalist, Reporters Without Borders also has a digital security lab that offers to investigate suspected cases of hacking and surveillance. \nOutside of these categories of people, politicians or business executives, for example, will have to go elsewhere. \nIf you work for a large company or political party, you likely have a competent (hopefully!) security team you can go straight to. They may not have the specific knowledge to investigate in depth, but in that case they probably know who to turn to, even if Access Now, Amnesty, and Citizen Lab cannot help those outside of civil society. \nOtherwise, there aren’t many places executives or politicians you can turn to, but we have asked around and found the ones below. We can’t fully vouch for any of these organizations, nor do we endorse them directly, but based on suggestions from people we trust, it’s worth pointing them out. \nPerhaps the most well known of these private security companies is iVerify, which makes an app for Android and iOS, and gives users an option to ask for an in-depth forensic investigation. \nMatt Mitchell, a well-regarded security expert who’s been helping vulnerable populations protect themselves from surveillance, has a new startup called Safety Sync Group, which offers this kind of service. \nJessica Hyde, a forensic investigator with experience in the public and private sectors, has her own startup called Hexordia, and offers to investigate suspected hacks. \nMobile cybersecurity company Lookout, which has experience analyzing government spyware from around the world, has an online form that allows people to reach out for help to investigate cyberattacks involving malware, device compromise, and more. The company’s threat intelligence and forensics teams may then get involved.  \nThen there’s Costin Raiu, who heads TLPBLACK, a small team of security researchers who used to work at Kaspersky’s Global Research and Analysis Group, or GReAT. Raiu was the unit’s head when his team discovered sophisticated cyberattacks from elite government hacking teams from the United States, Russia, Iran, and other countries. Raiu told TechCrunch that people who suspect they’ve been hacked can email him directly.\nInvestigation\nWhat happens next depends on who you go to for help. \nGenerally speaking, the organization you reach out to may want to do an initial forensic check by looking at a diagnostic report file that you can create on your device, which you can share with the investigators remotely. At this point, this doesn’t require you to hand over your device to anyone. \nThis first step may be able to detect signs of targeting or even infection. It may also turn out nothing. In both cases, the investigators may want to dig deeper, which will require you to send in a full backup of your device, or even your actual device. At that point, the investigators will do their work, which may take time because modern government spyware attempts to hide and delete its tracks, and will tell you what happened. \nUnfortunately, modern spyware may not leave any traces. The modus operandi these days, according to Hassan Selmi, who leads the incident response team at Access Now’s Digital Security Helpline, is a “smash and grab” strategy, meaning that once spyware infects the target device, it steals as much data as it can and then tries to remove any trace and uninstall itself. This is assumed as the spyware makers trying to protect their product and hide its activity from investigators and researchers.  \nIf you are a journalist, a dissident, an academic, or a human rights activist, the groups who help you may ask if you want to publicize that you were attacked, but you’re not required to do so. They will be happy to help you without taking public credit for it. There may be good reasons to come out, though: to denounce the fact that a government targeted you, which may have the side effect of warning others like you of the dangers of spyware; or to expose a spyware company by showing that their customers are abusing their technology. \nWe hope you never get one of these notifications. But we also hope that, if you do, you find this guide useful. Stay safe out there.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You’ve been targeted by government spyware. Now what?",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/eye-ball-red-curtain-spyware-e1766520101839.jpg?w=150"
      ],
      "datePublished": "2025-12-29T10:00:00.000Z",
      "dateModified": "2025-12-29T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Plaud Note Pro is an excellent AI-powered recorder that I carry everywhere",
    "url": "https://techcrunch.com/2025/12/29/plaud-note-pro-is-an-excellent-ai-powered-recorder-that-i-carry-everywhere/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Plaud-Note-Pro.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-29T18:00:00.000Z",
    "description": "\nThere has been a flurry of AI voice recording gadgets like Omi, Bee, and Friend that want to capture your voice and let you converse with an AI chatb",
    "body": "\nThere has been a flurry of AI voice recording gadgets like Omi, Bee, and Friend that want to capture your voice and let you converse with an AI chatbot. While Bee was acquired by Amazon, and devices like the Stream ring by Sandbar and a new AI ring from former Pebble founder Eric Migicovsky are set to enter the market next year, the jury is still out on the success of wearable AI devices.\nAmid all this, Plaud is thriving by targeting professional users with a different approach: a credit card-sized recording device that slips into your wallet. The company says it has shipped more than a million units and that more than 50% of its customers have converted to pro subscriptions.\nThe company’s latest iteration, the Plaud Note Pro, launched for preorder in August, two years after the original Note, priced at $179. After using the device for over a month, it has become an essential part of my daily carry — and its ultra-thin design makes that easy.\nAt just 0.12 inches thick — about the width of three stacked credit cards — it’s the thinnest AI recording device on the market and easily fits in a wallet or attaches magnetically to the back of your phone.\nThe company provides a wallet-like pouch and a magnetic ring accessory that attaches to MagSafe-enabled phones, allowing you to mount the Note Pro on the back of your iPhone or compatible Android device. The device is also very light at 30 grams, and you won’t feel the weight if you keep the Note Pro in your wallet.\nOne of the key differences between Plaud and other AI wearables is that the Note Pro doesn’t need to be connected to your phone to record audio. The device has 64GB of onboard memory, so it can store a large volume of recordings without transferring them to your phone or uploading them to the cloud.\nPlaud Note Pro is as thick as a coaster.Image Credits:Ivan Mehta\nPlaud Note Pro has four MEMS (Micro-Electro-Mechanical Systems) microphones to pick up audio from all directions. While the company advertises that the effective audio range is 16.4 feet, I have recorded talks at conferences while sitting far from the stage and gotten satisfactory results. The device also has one voice processing unit for noise suppression, voice isolation, and echo cancellation.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe recording device has impressive battery life. I went to a conference earlier this month with a fully charged device and recorded a few interviews and talks there. After that, I used the device for some phone call recording and personal note-taking. Despite all that use, the device still had 55% charge after 15 days. The company says you can wring 30 hours of continuous recording and 60 days of standby from a single charge.\nPlaud’s new device comes with a proprietary charger with a USB-C cable on the other end. The device takes two hours to charge from 0%, and then you are set for at least a couple of weeks unless you are recording hours of content.\nImage Credits:Plaud\nOne problem with wearable AI devices is that you have to ensure, through an indicator, that the device is recording (or has stopped recording). Thankfully, Plaud Note Pro has a tiny screen that displays your recording status. You can also press a button while recording to highlight a point a speaker is making, and it will show up in the AI-powered summary prominently. The screen also shows you the remaining battery level.\nThere is intentionality behind recording with this device. You also get haptic feedback for starting and stopping the recording. The visual indication and your action of pressing the button also make it easier to signal to others in the meeting that you are recording the session.\nImage Credits:Ivan Mehta\nYou can choose to just record sessions and export them to another AI transcription service you are subscribed to. Plaud natively provides 300 minutes of free transcription every month. The company also lets you customize AI-generated notes through templates suited for different profiles and tasks. You can create your own template as well. The transcription is accurate in most instances, and now you can also access the recording, transcript, and notes through a website. The company has also addressed the problem my former colleague Brian Heater had of tapping on the word and not being played the corresponding recording.\nWhile a pendant or pin-like form factor is possibly easier to carry, the card-sized recorder offers better microphones and more versatile placement options. It’s worth buying the $179 gadget if you take a lot of in-person meetings.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Plaud Note Pro is an excellent AI-powered recorder that I carry everywhere",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Plaud-Note-Pro.jpg?w=150"
      ],
      "datePublished": "2025-12-29T18:00:00.000Z",
      "dateModified": "2025-12-29T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The top 26 consumer/edtech companies from Disrupt Startup Battlefield",
    "url": "https://techcrunch.com/2025/12/30/the-top-26-consumer-edtech-companies-from-disrupt-startup-battlefield/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Startup-stars.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T15:00:00.000Z",
    "description": "\nEvery year, TechCrunch’s Startup Battlefield pitch contest draws thousands of applicants. We whittle those applications down to the top 200 contender",
    "body": "\nEvery year, TechCrunch’s Startup Battlefield pitch contest draws thousands of applicants. We whittle those applications down to the top 200 contenders, and of them, the top 20 compete on the big stage to become the winner, taking home the Startup Battlefield Cup and a cash prize of $100,000. But the remaining 180 startups all blew us away as well in their respective categories and compete in their own pitch competition.\nHere is the full list of the consumer/edtech Startup Battlefield 200 selectees, along with a note on why they landed in the competition. \nAhoi \nWhat it does: Helps people find places that are accessible to those with limited mobility.  \nWhy it’s noteworthy: Its inclusive technology makes places more accessible to those who might otherwise struggle to find locations to service their needs.  \nAllFocal Optics Limited \nWhat it does: Uses nanophotonic technology to create lenses that enhance visual clarity.  \nWhy it’s noteworthy: The company says that it has created breakthrough technology that helps people, especially those with conditions like headaches and dizziness, to withstand prolonged extended reality experiences.  \nBillight \nWhat it does: Billight is a light-up pool table.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhy it’s noteworthy: It calls itself the first light-up pool table and gaming system.  \nCerca Dating  \nWhat it does: This Gen Z dating app is bringing back the way people used to meet — via mutual friends.  \nWhy it’s noteworthy: It’s the latest spin on a dating app during this time of romance app fatigue, trying to prove that digital love is still alive.  \nFounderWay.ai \nWhat it does: A platform that helps startups scale by providing business advice on topics like how to build a pitch deck or finding a target market.  \nWhy it’s noteworthy: The platform is using AI to offer insight into some of the most pressing questions founders always have — how to run and scale a business. It’s an easier solution than trying to source information from various places by oneself.  \nHotel Treats \nWhat it does: A platform where luxury hotels can give customers vouchers for services like spas and dining.  \nWhy it’s noteworthy: The platform lets hotels monetize day passes while also giving consumers a way to treat themselves to a singular luxury experience, without having to spend the big bucks and stay at the hotel.  \nJotto \nWhat it does: A company that creates QR codes for events and establishments so people can leave feedback and reviews.  \nWhy it’s noteworthy: It’s an interesting product that also lets people give feedback by video or voice.  \nNim \nWhat it does: A platform that lets users create AI videos.  \nWhy it’s noteworthy: It’s part of the wave of AI video companies launching, but it offers an all-in-one service, offering prompt assistance and numerous reusable clips.  \nPerfingo \nWhat it does: Perfingo is a financial planning tool. \nWhy it’s noteworthy: It hails itself as the first of its kind in its home base of Singapore.  \nPintours \nWhat it does: Pintours is a tour-booking platform.  \nWhy it’s noteworthy: It’s an AI tour guide, letting consumers guide themselves through a tour and personalize the experience to ways they see fit.  \nPrickly Pear Health \nWhat it does: Prickly Pear provides a voice AI companion for women that monitors brain health. \nWhy it’s noteworthy: This isn’t a chatbot, but an AI is trained to decipher changes in language and context that could indicate cognitive issues, especially those arising from hormonal changes that women in their 30s to 50s experience. \nrax \nWhat it does: Rax is a peer-to-peer clothing rental platform.  \nWhy it’s noteworthy: The winner of the top consumer pitch, Rax says it is one of the first to launch in Canada and just announced an expansion to the U.S.  \nRent a Cyber Friend\nWhat it does: Helps people find friends within their professions over the internet. \nWhy it’s noteworthy: Unlike a social network, this app helps people identify potential friends and includes options like video calls and chats to help friendships sprout. \nRenude \nWhat it does: Renude offers an AI-powered skin care recommendation engine for beauty brands. \nWhy it’s noteworthy: Using computer vision AI and LLMs, this e-commerce tool allows skin care brands to offer personalized product recommendations to every customer. \nSnap Discovery AG \nWhat it does: Offers a brain-computer interface intended to be used for hands-free everyday interaction. \nWhy it’s noteworthy: Snap interacts with game development platform Unity and is intended for a range of uses, from games to stress management. \nTasteit \nWhat it does: Tasteit is an app that helps people meet to dine together. \nWhy it’s noteworthy: Tasteit calls itself the anti-dating app, as its mission is to use food and dining out as a way for people to match and meet. \nTattd \nWhat it does: Tattd is an AI-powered app that helps people find and book tattoo artists. \nWhy it’s noteworthy: The startup uses generative AI to create a mock-up of a design and then matches that to a tattoo artist whose work aligns with the mock-up. \nVista InnoTech Limited \nWhat it does: Vista InnoTech has invented tech that creates better photos by eliminating the effects of accidental shaking or shaking environments. \nWhy it’s noteworthy: It has created a tech called Micro Gimbal Stabilizer, small enough to be embedded in most mobile devices, that works well even in low-light conditions. \nYoung Minds App \nWhat it does: A parental control app that watches over and prevents kids from engaging in unsafe online behavior. \nWhy it’s noteworthy: The app rewards kids’ smart online choices and offers a distraction-blocking feature for study time. \nZoraSafe \nWhat it does: ZoraSafe identifies and protects consumers against scams. \nWhy it’s noteworthy: Aimed at families and seniors, ZoraSafe scans links and messages to prevent scams, including through deepfakes and social engineering. It also offers features like AI coaching. \nEdtech \nCalificadas \nWhat it does: AI-powered training to improve an employee’s workplace communications. \nWhy it’s noteworthy: This professional development app was designed with diversity, equity, and inclusion in mind and uses AI to help people level up their word choices, message structure, and even their nonverbal language. \nCampusAI \nWhat it does: CampusAI offers a flexible platform to train people on AI. \nWhy it’s noteworthy: The platform is geared to help everyday people who want to use AI to improve their work, be it in sales, HR, legal, or other areas.   \nGeneral Neuro \nWhat it does: The NeuroLingo headset helps people learn a foreign language. \nWhy it’s noteworthy: This headset creates conditions that assist with language learning along with a synchronized app. \nReadmio \nWhat it does: A story-time app for parents and kids. \nWhy it’s noteworthy: The app follows along with the words as they are being read aloud, automatically adding sounds and music at certain text sections, making stories more interactive. \nSuper Teacher \nWhat it does: Super Teacher offers an AI-powered tutor for elementary schools. \nWhy it’s noteworthy: This AI tutor offers individualized instructions and assessments for use in classrooms, with 24/7 access for students at home. \nZEZEDU Corp. \nWhat it does: Zezedu is an AI-powered platform, developed in South Korea, that offers personalized math learning.  \nWhy it’s noteworthy: A math teaching tool for schools and academies that tracks assignments, grading, and feedback with personalized curriculum. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The top 26 consumer/edtech companies from Disrupt Startup Battlefield",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Startup-stars.jpg?w=150"
      ],
      "datePublished": "2025-12-30T15:00:00.000Z",
      "dateModified": "2025-12-30T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Here’s what you should know about the US TikTok deal",
    "url": "https://techcrunch.com/2025/12/30/heres-whats-you-should-know-about-the-us-tiktok-deal/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/03/tiktok-us-flag.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-30T14:00:00.000Z",
    "description": "\nTikTok, owned by the Chinese company ByteDance, has been at the center of controversy in the U.S. for four years now due to concerns about user data ",
    "body": "\nTikTok, owned by the Chinese company ByteDance, has been at the center of controversy in the U.S. for four years now due to concerns about user data potentially being accessed by the Chinese government.\nAs a result, U.S. users have often found themselves caught in the middle of this tension. Earlier this year, the app experienced a temporary outage in the U.S. that left millions of users in suspense before it was quickly restored. TikTok returned to the App Store and Google Play Store in February. \nA number of investors competed to purchase the app, and after Trump extended the TikTok ban deadline for the fourth time, the battle is finally over. As of last week, TikTok officially signed a deal to divest a portion of its U.S. entity to a group of American investors.\nThis comes nearly three months after President Donald Trump signed an executive order that approves the sale of TikTok’s U.S. operations to an American investor group.\nA week prior, President Trump announced that President Xi Jinping of China had given his approval of a TikTok deal, which would allow a consortium of U.S. investors to control the platform. ByteDance stated publicly that it would ensure the platform remains available to American users.\nWho owns TikTok in the U.S.?\nImage Credits:Bryce Durbin / TechCrunch\nAccording to a memo viewed by TechCrunch, the investor group consists of Oracle, private equity firm Silver Lake, and investment firm MGX. Collectively, they will hold 45% of the U.S. operation, with ByteDance keeping nearly a 20% stake. Axios first reported the news, citing sources who estimate TikTok U.S. is valued at approximately $14 billion — a figure also mentioned by Vice President JD Vance.\nIn September, a report indicated that a “framework” deal was established between the U.S. and China, with a consortium of investors — including Oracle, Silver Lake, and Andreessen Horowitz — overseeing TikTok’s U.S. operations. These investors were expected to hold an 80% stake, and the remaining shares would belong to Chinese stakeholders.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe newly formed “TikTok USDS Joint Venture LLC” will oversee the app’s operations, including data protection, algorithm security, content moderation, and software assurance.\nOracle will serve as the trusted security partner, responsible for auditing and ensuring compliance with National Security Terms, according to the memo. The company already provides cloud services for TikTok and manages user data in the U.S. Notably, Oracle previously made a bid for TikTok back in 2020.\nA White House official previously said Oracle would replicate and secure a new U.S. version of the algorithm, and the U.S.-based TikTok owners could lease the algorithm from ByteDance, which Oracle will then retrain. \nByteDance will not have access to information about TikTok’s U.S. users or any influence over the U.S. algorithm.\n​The deal is scheduled to close on January 22, 2026. \nWhat users in the U.S. should know\nReports from Bloomberg indicate that when the deal is finalized, the TikTok app will be discontinued in the U.S. and users will need to transition to a new platform. However, the specifics of this platform remain largely unclear, including its features and how it will differ from the original app. \nHow did we get here?\nImage Credits:Mandel Ngan (opens in a new window) / Getty Images\nTo fully understand this high-stakes drama, we’ll first revisit the timeline of TikTok’s tumultuous relationship with the U.S. government, which resulted in various legal battles and negotiations. \nThe drama first began in August 2020, when Trump signed an executive order to ban transactions with parent company ByteDance. \nA month later, Trump’s administration sought to force a sale of TikTok’s U.S. operations to a U.S.-based company. The leading contenders included Microsoft, Oracle, and Walmart. However, a U.S. judge temporarily blocked Trump’s executive order, allowing TikTok to continue operating while the legal battle unfolded. \nThings began to progress even more last year following the transition to the Biden administration. After the Senate passed the bill against TikTok, President Joe Biden signed it.\nIn response, TikTok sued the U.S. government, challenging the constitutionality of the ban and arguing the app and its American users were having their First Amendment rights violated. The company has consistently denied that it poses a security threat, asserting that its data stored in the U.S. complies with all local laws.\nFast-forward to today: Trump has had a change of heart since his first term and is trying to achieve a 50-50 ownership arrangement between ByteDance and a U.S. company. \nThere have been several contenders, including The People’s Bid for TikTok , a consortium organized by Project Liberty founder Frank McCourt. This group has the support of investment firm Guggenheim Securities and the law firm Kirkland & Ellis. Supporters include Reddit co-founder Alexis Ohanian, TV personality and investor Kevin O’Leary, inventor of the World Wide Web Tim Berners-Lee, and senior research scientist David Clark.\nImage Credits:Justin Sullivan / Getty Images\nAnother group, called the American Investor Consortium, is led by Employer.com founder Jesse Tinsley and includes Roblox co-founder David Baszucki, Anchorage Digital co-founder Nathan McCauley, and famous YouTuber MrBeast.\nOthers in the running included Amazon, AppLovin, Microsoft, Perplexity AI, Rumble, Walmart, Zoop, former Activision CEO Bobby Kotick, and former U.S. Treasury Secretary Steven Mnuchin.\nThe story has been updated after publication. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Here’s what you should know about the US TikTok deal",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/03/tiktok-us-flag.jpg?w=150"
      ],
      "datePublished": "2025-12-30T14:00:00.000Z",
      "dateModified": "2025-12-30T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]