[
  {
    "title": "AI PowerPoint-killer Gamma hits $2.1B valuation, $100M ARR, founder says ",
    "url": "https://techcrunch.com/2025/11/10/ai-powerpoint-killer-gamma-hits-2-1b-valuation-100m-arr-founder-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/10/GettyImages-1569337822.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T19:28:03.000Z",
    "description": "\nIn Brief\nPosted:\n11:28 AM PST · November 10, 2025\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGamma, a startup that create",
    "body": "\nIn Brief\nPosted:\n11:28 AM PST · November 10, 2025\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGamma, a startup that creates AI-generated presentations, websites, and social media posts, announced on Monday a $68 million Series B round at a $2.1 billion valuation led by Andreessen Horowitz. \nCo-founder and CEO Grant Lee posted on X that the company has profitably hit $100 million in ARR, with 70 million users. The startup hit $50 million profitably in its first two years, Lee previously posted. Gamma last raised a $12 million Series A round led by Accel in 2024. \nGamma isn’t exactly a new-to-the-scene AI startup (at least by AI standards). It was founded in late 2020, according to Lee’s LinkedIn, with its product first launching in 2022. \nIts more cautious raising trajectory (by AI standards) helped it hit a double-unicorn valuation on a total fundraising of about $90 million. This was achieved with only about 50 employees, Lee said. And the round included a $20 million secondary offering that gave liquidity to early employees, the company tells TechCrunch. The latest round also included participation from Accel and Uncork Capital, and its other backers include South Park Commons, Hustle Fund, and others. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI PowerPoint-killer Gamma hits $2.1B valuation, $100M ARR, founder says ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/10/GettyImages-1569337822.jpg?w=150"
      ],
      "datePublished": "2025-11-10T19:28:03.000Z",
      "dateModified": "2025-11-10T19:28:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Consolidation begins to hit the carbon credit market",
    "url": "https://techcrunch.com/2025/11/10/consolidation-begins-to-hit-the-carbon-credit-market/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/06/Big-Lonely-Doug.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T16:29:57.000Z",
    "description": "\nCarbon management startup Carbon Direct is buying another carbon credit startup, Pachama, the companies announced today.\nPachama laid off around 20 e",
    "body": "\nCarbon management startup Carbon Direct is buying another carbon credit startup, Pachama, the companies announced today.\nPachama laid off around 20 employees this summer as voluntary carbon markets softened. The company had attracted investments from a range of prominent names, including Amazon’s Climate Pledge, Breakthrough Energy Ventures, Lowercarbon Capital, and several celebrity angel investors, including Ellen DeGeneres, Laura Dern, and Serena Williams.\n“The current uncertain and volatile financial, economic, and geopolitical climate, added to the anti-ESG agenda in the U.S., is indeed having an effect on corporate sustainability budgets,” Diego Saez Gil, CEO of Pachama, told Trellis when the layoffs happened. “The impact is especially acute in the voluntary carbon market, which was already in a moment of correction.”\nPachama had raised $88 million, while Carbon Direct had raised $60.8 million, according to PitchBook. Terms of the deal were not disclosed.\nPachama was focused on nature-based carbon credits, which typically result when forests are either restored or preserved. Carbon Direct, on the other hand, is more of a carbon market advisory and accounting firm, helping companies track and report their carbon footprints and then vet carbon credits to offset them.\nThe carbon markets have been roiled by uncertainty in the last few years, and not all of it has been the result of political whiplash in the U.S. and elsewhere. Voluntary carbon markets have come under fire for falling short of their promises. \nFor example, a major investigation by The Guardian found that more than 90% of one verifier’s credits did not actually result in any carbon reductions. One of the biggest challenges facing nature-based carbon credits is the question of whether forests protected by the purchases were threatened with destruction in the first place.\nAnd while large companies have been dialing back their publicity around ESG measures, many are still interested in sticking to their net-zero promises. Carbon Direct customers include Microsoft, Shopify, American Express, JP Morgan, Alaska Airlines, and BlackRock.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Consolidation begins to hit the carbon credit market",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/06/Big-Lonely-Doug.jpg?w=150"
      ],
      "datePublished": "2025-11-10T16:29:57.000Z",
      "dateModified": "2025-11-10T16:29:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sapphire Sport spins out, rebrands as 359 Capital with $300M AUM",
    "url": "https://techcrunch.com/2025/11/10/sapphire-sport-spins-out-rebrands-as-359-capital-with-300m-aum/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/Tonal-2-Screen-Interaction.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T14:57:06.000Z",
    "description": "\nNearly seven years after announcing its first fund, Sapphire Sport — the venture fund focused on sports, media, and entertainment — is spinning out f",
    "body": "\nNearly seven years after announcing its first fund, Sapphire Sport — the venture fund focused on sports, media, and entertainment — is spinning out from Sapphire Ventures. The fund will rebrand as an independent venture firm, 359 Capital.\nThe firm’s new name is a tribute to the sub-four-minute mile, a feat once deemed humanly impossible but ultimately achieved through rigorous dedication and perseverance. 359 Capital co-founder and managing partner Michael Spirito said that the name reflects the firm’s core principle of helping its portfolio founders achieve the impossible.\nThe separation from Sapphire Ventures, an investment firm with about $11 billion in assets under management, was always on “the vision board,” said Spirito. “We’re all grown up and ready to leave home.”\nSapphire Sport, which is currently halfway through investing its second fund of $181 million, has always maintained a separate group of limited partners from Sapphire Ventures. Its LPs are all deeply tied to the sports industry, including major names like City Football Group, adidas, AEG, Madison Square Garden, Sinclair, and dozens of team owners.\n“When we started in 2019, the name Sapphire Sport wasn’t just alliterative and sounded cool,” Spirito said. “Sport captured the LP group.”\nSeven years later, the sports-focused LPs still leverage their relationship with the firm to gain insights into emerging tech companies across the media and sports landscape, Spirito said.\nSome of the startups 359 Capital has backed include Beehiiv, a creator-focused newsletter; an online casino, Betty Labs; a sports media platform; Overtime, an AI search engine; Perplexity, a successful AI browser; and Tonal, a home gym system.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe firm’s entire portfolio of 30 companies and all of its investment staff will move over to 359 Capital. The transitioning staff includes Spirito, co-founders of Sapphire Ventures David Hartwig and Doug Higgins, and newly promoted partner Rico Mallozzi.\nAs 359 Capital, the firm will continue to focus primarily on Series A and Series B startups, writing checks between $2 million to $10 million. The firm will continue to invest from its second fund through the first half of 2027, Spirito said.\n359 Capital will have high-profile competition in the world of sports-focused venture capital. Courtside Ventures, backed by Shaquille O’Neal and Michael Jordan, is in the process of raising a fourth fund of $100 million, according to an SEC filing.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sapphire Sport spins out, rebrands as 359 Capital with $300M AUM",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/Tonal-2-Screen-Interaction.jpeg?w=150"
      ],
      "datePublished": "2025-11-10T14:57:06.000Z",
      "dateModified": "2025-11-10T14:57:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wikipedia urges AI companies to use its paid API, and stop scraping",
    "url": "https://techcrunch.com/2025/11/10/wikipedia-urges-ai-companies-to-use-its-paid-api-and-stop-scraping/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T18:30:59.000Z",
    "description": "\n\t\n\t\tImage Credits:Nikolas Kokovlis / NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t10:30 AM PST · November 10, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWikipedia on Monday laid out a",
    "body": "\n\t\n\t\tImage Credits:Nikolas Kokovlis / NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t10:30 AM PST · November 10, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nWikipedia on Monday laid out a simple plan to ensure its website continues to be supported in the AI era, despite its declining traffic. \nIn a blog post, the Wikimedia Foundation, the organization that runs the popular online encyclopedia, called on AI developers to use its content “responsibly” by ensuring its contributions are properly attributed and that content is accessed through its paid product, the Wikimedia Enterprise platform.\nThe opt-in, paid product allows companies to use Wikipedia’s content at scale without “severely taxing Wikipedia’s servers,” the Wikimedia Foundation blog post explains. In addition, the product’s paid nature allows AI companies to support the organization’s nonprofit mission.\nWhile the post doesn’t go so far as to threaten penalties or any sort of legal action for use of its material through scraping, Wikipedia recently noted that AI bots had been scraping its website while trying to appear human. After updating its bot-detection systems, the organization found that its unusually high traffic in May and June had come from AI bots that were trying to “evade detection.” Meanwhile, it said that “human page views” had declined 8% year-over-year.\nNow Wikipedia is laying out its guidelines for AI developers and providers, saying that generative AI developers should provide attribution to give credit to the human contributors whose content it uses to create its outputs.\n“For people to trust information shared on the internet, platforms should make it clear where the information is sourced from and elevate opportunities to visit and participate in those sources,” the post reads. “With fewer visits to Wikipedia, fewer volunteers may grow and enrich the content, and fewer individual donors may support this work.”\nEarlier this year, the organization released its AI strategy for editors, which said it would use AI to help editors with workflows around tedious tasks, automating translation, and other tools that help its editors, not replace them.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wikipedia urges AI companies to use its paid API, and stop scraping",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150"
      ],
      "datePublished": "2025-11-10T18:30:59.000Z",
      "dateModified": "2025-11-10T18:30:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google brings Gemini to the Google TV Streamer",
    "url": "https://techcrunch.com/2025/11/10/google-brings-gemini-to-the-google-tv-streamer/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/Google-TV-Streamer-set-up.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T19:28:57.000Z",
    "description": "\nGoogle announced on Monday that it’s starting to roll out Gemini to the Google TV Streamer, replacing Google Assistant. The tech giant says the chang",
    "body": "\nGoogle announced on Monday that it’s starting to roll out Gemini to the Google TV Streamer, replacing Google Assistant. The tech giant says the change will enable users to use their voice more naturally to access content and more. \nFor example, users can now ask something like, “I like dramas but my wife likes comedies. What’s a movie we can watch together?” when looking for movie recommendations. \nOr, users could quickly catch up on a show they’re returning to by asking something like, “What happened at the end of Outlander last season?” In another example, Google says users can even ask something like “What’s the new hospital drama everyone’s talking about?”\nGoogle says Gemini for TV goes beyond entertainment, as users can ask the AI assistant any other type of question as well, just like they can with Gemini on their phone.\nFor example, users could bring learning to their TV by asking Gemini to “Explain why volcanoes erupt to my third grader.” Gemini can also guide users through DIY projects or recipes with YouTube videos, Google says. \nTo access Gemini on the Google TV Streamer, you need to press your remote’s microphone button. \nGoogle says the update is rolling out “over the next few weeks” to users aged 18 and older. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe move comes as Google announced back in September that it was introducing Gemini for Google TV to select TCL devices. The company said at the time that later in the year, Gemini would be arriving on the 2025 Hisense U7, U8, and UX models, and 2025 TCL QM7K, QM8K, and X11K models. \nIn addition to the Google TV Streamer, Gemini is also available on the Walmart Onn 4K Pro streaming device.\nMonday’s announcement doesn’t come as a surprise, as the change is part of Google’s plans to replace Google Assistant with Gemini across all of its devices and platforms. Plus, the company had announced at CES in January that Gemini would be coming to Google TV this year.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google brings Gemini to the Google TV Streamer",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/Google-TV-Streamer-set-up.jpg?w=150"
      ],
      "datePublished": "2025-11-10T19:28:57.000Z",
      "dateModified": "2025-11-10T19:28:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lovable says it’s nearing 8 million users as the year-old AI coding startup eyes more corporate employees",
    "url": "https://techcrunch.com/2025/11/10/lovable-says-its-nearing-8-million-users-as-the-year-old-ai-coding-startup-eyes-more-corporate-employees/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Screenshot-2025-11-10-at-11.20.57-PM.png?w=150",
    "tag": "Tech",
    "date": "2025-11-10T23:53:01.000Z",
    "description": "\nLovable, the Stockholm-based AI coding platform, is closing in on 8 million users, CEO Anton Osika told this editor during a sit-down on Monday, a ma",
    "body": "\nLovable, the Stockholm-based AI coding platform, is closing in on 8 million users, CEO Anton Osika told this editor during a sit-down on Monday, a major jump from the 2.3 million active users number the company shared in July. Osika said the company — which was founded almost exactly one year ago — is also seeing “100,000 new products built on Lovable every single day.”\nThe metrics suggest rapid growth of the startup, which has raised $228 million in total funding to date, including a $200 million round this summer that valued the company at $1.8 billion. Rumors have swirled in recent weeks — potentially sparked by its own investors — that new backers want to invest at a $5 billion valuation, though Osika said the company isn’t capital constrained and declined to discuss fundraising plans.\nSpeaking to me onstage at the Web Summit event in Lisbon, Osika notably didn’t share another number: Lovable’s current annual recurring revenue. The company, which uses a mix of free and paid tiers, hit $100 million in ARR this June, a milestone it trumpeted publicly. But questions have emerged since about whether the vibe coding boom is sustainable.\nResearch from Barclays this summer, along with Google Trends data, showed that traffic to some of the buzziest services, including Lovable and Vercel’s v0, had declined after peaking earlier this year. (Traffic to Lovable was down 40% as of September, according to the Barclays analysts.) “This waning traffic begs the question on whether app/site vibecoding has peaked out already or has just had a bit of a lull before interest ramps up,” they reportedly wrote in a note to investors.\nStill, Osika insisted retention remains strong, citing more than 100% net dollar retention — meaning users spend more over time. He also said the company has “just passed” the 100-employee mark and is now importing leadership talent from San Francisco to bolster its Stockholm headquarters.\nLovable emerged from GPT Engineer, an open source tool Osika built that went viral among developers. But he says he quickly realized the bigger opportunity lay with the 99% of people who don’t know how to code. “I woke up a few days after building GPT Engineer and I realized, look, we’re going to reimagine how you build software,” Osika said. “I biked to my co-founder’s place, and I said, I have this great idea. I woke him up.”\nThe platform has attracted an eclectic user base. More than half of Fortune 500 companies are using Lovable to “supercharge creativity,” according to Osika. At the same time, he said, an 11-year-old in Lisbon built a Facebook clone for his school, while a Swedish duo is making $700,000 annually from a startup they launched seven months ago on the platform. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“What I hear from people trying Lovable is, ‘It just works,’” Osika said, crediting what he described as Swedish design sensibility.\nSecurity remains a thornier issue for the vibe coding sector. When I raised a recent incident in which an app built with vibe coding tools leaked 72,000 images into the wild, including GPS data and user IDs, Osika acknowledged the problem. \n“The part of the engineering organization where we’re moving the quickest on hiring is security engineers,” he said, adding that his goal is to make building with Lovable “more secure than building with just human-written code.” In fact, he said, before users can deploy, Lovable now runs multiple security checks, though the platform still requires users building sensitive applications — banking apps, for instance — to hire security experts, just as they would with traditional development.\nOsika was similarly matter-of-fact when I asked about competition from OpenAI and Anthropic, the AI giants whose models power Lovable but that have also released their own coding agents. He sees the market as big enough for multiple winners. “If we can unlock more human creativity and human agency  . . . and just driving the change so that anyone can create if they have good ideas, [and] build businesses on top of that, that should be celebrated, regardless of whoever does that.”\nIt’s a decidedly collegial stance in an industry not known for it. (Even Osika has engaged in some light social media sparring with Amjad Masad of competitor Replit.) But he said his focus right now is on building “the most intuitive experience for humans” rather than obsessing over rivals.\nOsika described Lovable’s mission as building “the last piece of software” — a platform where everything a product organization needs, from understanding users to deploying mission-critical features, can be done through a simple interface. \n“Demo, don’t memo,” a popular phrase among product leaders, captures how companies now use Lovable, he said. Employees can now quickly prototype ideas rather than writing long presentations, then test them with early users before committing resources.\nFor all the hypergrowth and investor attention, Osika — dressed simply in a beige T-shirt and matching button-down, floppy hair framing his face — appeared very much at ease. The 30-something former particle physicist, who was the first employee at Sauna Labs before founding Lovable, has gone from open source developer to venture-backed founder to must-have conference guest in rapid succession. Yet he seemed more interested in discussing European work culture than dwelling on his company’s trajectory or the attention suddenly being showered on him.\n“What I care about is that everyone who’s at the company, they’re mission driven, they really care about what they’re doing and how we as a team succeed,” he said, pushing back against Silicon Valley’s intensifying hustle culture. “The best people in my team today, most of them, they have kids, and they really, really care about what we’re doing. They’re not working 12 hours, six days a week.”\nThough he added: “Although it’s a startup, so they’re probably working more than most jobs.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lovable says it’s nearing 8 million users as the year-old AI coding startup eyes more corporate employees",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Screenshot-2025-11-10-at-11.20.57-PM.png?w=150"
      ],
      "datePublished": "2025-11-10T23:53:01.000Z",
      "dateModified": "2025-11-10T23:53:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google Maps releases new AI tools that let you create interactive projects",
    "url": "https://techcrunch.com/2025/11/10/google-maps-releases-new-ai-tools-to-let-you-create-interactive-projects/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Builder-agent-interface.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T16:00:00.000Z",
    "description": "\nGoogle Maps is adding new AI features, including a builder agent and an MCP server — a tool that connects AI assistants to Google Maps’ technical doc",
    "body": "\nGoogle Maps is adding new AI features, including a builder agent and an MCP server — a tool that connects AI assistants to Google Maps’ technical documentation — to help developers and users create interactive projects using Maps data and code. The company said it is using Gemini models across the board to power these features.\nAmong these new tools, the builder agent is a tool that, just like many other coding tools, lets you describe the kind of interactive map-based prototype you want to build in text and creates one for you. For instance, you can type “create a Street View tour of a city,” “create a map visualizing real-time weather in my region,” or “list pet-friendly hotels in the city.”\nOnce the code is generated, you can export it, test the preview project using your own API keys as needed, or modify the project in Firebase Studio.\nImage Credits:Google\nThe same tool also has a styling agent that lets users create a customized map to match a particular style format or theme. This could help brands create maps with specific color coding.\nGoogle already provides map data grounding via the Gemini API. The company is now introducing a similar feature, called Grounding Lite, which allows developers to ground their own AI models using Model Context Protocol (MCP), a standard that lets AI assistants connect to external data sources.\nWith this feature, AI assistants can answer questions like, “How far is the nearest grocery store?” The company is also shipping Contextual View, a low-code Google Maps component that can provide visual understanding to users for such questions. The feature can show a list, a map view, or a 3D display as an answer.\nImage Credits:Google\nGoogle is also adding a code assistant toolkit, the MCP server, which connects with Google Maps’ documentation. Developers can use this connection to get answers about how to use the Google Maps API and data. Last month, the company launched extensions for Gemini’s command line tool to let developers access Maps data.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Google\nThe company is also trying to add more Gemini-powered features for Maps on the consumer side. Last week, it enabled users to use Gemini hands-free with Maps for navigation. For users in India, Google added incident alerts and speed limit data to the Maps app in select areas.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google Maps releases new AI tools that let you create interactive projects",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Builder-agent-interface.jpeg?w=150"
      ],
      "datePublished": "2025-11-10T16:00:00.000Z",
      "dateModified": "2025-11-10T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon Music allows users in Canada to chat and stream music with each other",
    "url": "https://techcrunch.com/2025/11/10/amazon-music-allows-users-in-canada-to-chat-and-stream-music-with-each-other/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Fan-GroupsAmazonMusic.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T15:00:00.000Z",
    "description": "\nAmazon Music announced on Monday the launch of “Fan Groups,” a new beta feature that lets users create and join groups based on their favorite genres",
    "body": "\nAmazon Music announced on Monday the launch of “Fan Groups,” a new beta feature that lets users create and join groups based on their favorite genres and artists. The feature allows fans to chat, post, and listen to songs shared within these groups.\nThe feature is currently being tested in Canada on iOS and Android devices.\nUsers can access Fan Groups through the “Find” tab located beneath the search bar at the top of the app. From there, they can explore over 30 different groups dedicated to various musical interests, ranging from indie rock and country to Punjabi and K-pop, according to a company blog post.\nGroup members can create new posts, participate in ongoing chat threads, and share or save recommended songs. Users can also stream music without leaving the conversation or the group — they can simply tap the play button at the top to listen to all the songs added, or navigate to the separate “Music” tab next to “Posts.”\nNotably, artists can join these groups, giving them a new way to connect with fans directly. They can share exclusive content, interact more personally, and build stronger communities with their supporters.\nImage Credits:Amazon Music\nAnyone can set up a new group, and administrators can mute members and delete messages, a company spokesperson told TechCrunch. Users can report content and can block other members if needed. \nThis new feature represents Amazon’s strategy to compete with Spotify, which has been working to engage users through various social features. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSpotify introduced a messaging feature in August and also a “Jam” feature that enables users to co-create playlists with friends and listen to songs together. \nSoundCloud also offers a commenting feature and has recently updated its platform to include new social functionalities, such as playlists based on what friends are listening to and a direct messaging tool for artists. Another platform, Stationhead, allows users to listen to music together during livestreaming parties.\nFan Groups is set to roll out to customers in the U.S. and other markets beginning next year.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon Music allows users in Canada to chat and stream music with each other",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Fan-GroupsAmazonMusic.jpg?w=150"
      ],
      "datePublished": "2025-11-10T15:00:00.000Z",
      "dateModified": "2025-11-10T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venmo launches cash back rewards program for debit cards",
    "url": "https://techcrunch.com/2025/11/10/venmo-launches-cash-back-rewards-program-for-debit-cards/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-1231192043.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T15:29:36.000Z",
    "description": "\nVenmo on Monday introduced a new rewards program, Venmo Stash, offering cash back to customers who transact with their favorite brands on the payment",
    "body": "\nVenmo on Monday introduced a new rewards program, Venmo Stash, offering cash back to customers who transact with their favorite brands on the payments app and engage with Venmo’s products. \nWhile cashback rewards are a common incentive for credit cards, Venmo’s rewards — which can be up to 5% — are returned to Venmo’s Mastercard Debit Card.\nThe program is designed to incentivize continued use of Venmo’s service by bringing more funds into the ecosystem, the company explains. \nHowever, this program also represents a new way that today’s brands are attempting to reach younger users, many of whom have shown a preference for debit cards over credit cards.\nOne 2024 study cited by eMarketer indicated that only 39% of Gen Z users reported frequent credit card use, compared with 51% for older generations. Another Morning Consult survey for Cash App Afterpay from earlier this year noted that 63% of Gen Z users said they favored debit cards over other payment methods.\nAs a result, payment providers and retailers are looking to accommodate younger consumers by rolling out more debit rewards and by offering alternatives at checkout — like the use of “buy now, pay later” (BNPL) services such as Affirm, PayPal Pay Later, or Klarna.\nIn Venmo’s case, the program is designed to offer larger rewards as customers interact more with Venmo products. This keeps them invested in the Venmo ecosystem, the company believes. \nIt also competes with other cashback incentives offered by Venmo’s rivals, like Cash App’s offers, which are doled out to its own Cash App debit card customers.\nScreenshotImage Credits:Venmo\nInitially, customers earn 1% cash back for their Venmo Debit Mastercard when they spend their Venmo balance. Rewards grow to 2% when customers turn on auto reloads to keep their balance replenished automatically. And customers are able to earn 5% cash back when they receive Direct Deposits on Venmo each month. \nHowever, instead of offering a certain percentage back by spending category, like groceries, gas, or dining, Venmo’s program has customers pick from curated bundles of their favorite brands. For instance, you could pick a group of brands that includes McDonald’s, TikTok Shop, Uber, and Uber Eats, or one that offers Amazon, DoorDash, Domino’s, and Walgreens. \nThe PayPal-owned company says that next year Venmo Stash will expand to offer customers rewards when they pay with Venmo at merchants within its nationwide network.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venmo launches cash back rewards program for debit cards",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-1231192043.jpg?w=150"
      ],
      "datePublished": "2025-11-10T15:29:36.000Z",
      "dateModified": "2025-11-10T15:29:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scribe hits $1.3B valuation as it moves to show where AI will actually pay off",
    "url": "https://techcrunch.com/2025/11/10/scribe-hits-1-3b-valuation-as-it-moves-to-show-where-ai-will-actually-pay-off/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/scribe-founders.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T13:00:00.000Z",
    "description": "\nAfter helping thousands of enterprises document how work actually happens, Scribe has raised $75 million at a $1.3 billion post-money valuation to ro",
    "body": "\nAfter helping thousands of enterprises document how work actually happens, Scribe has raised $75 million at a $1.3 billion post-money valuation to roll out Scribe Optimize, a platform that maps workflows across the enterprise to reveal where automation and AI will actually yield returns — instead of becoming another sunk cost.\nThe all-equity Series C round was led by StepStone, with participation from existing investors Amplify Partners, Redpoint Ventures, Tiger Global, Morado Ventures, and New York Life Ventures. The new funding comes over a year after Scribe raised its $25 million Series B, capital the five-year-old startup has largely not needed to draw down, co-founder and CEO Jennifer Smith (pictured above, left) said in an exclusive interview. With this round, Scribe plans to accelerate the rollout of Scribe Optimize and related products, as enterprises struggle to determine where AI and automation will have the greatest impact.\nMany companies are racing to adopt AI, but Smith told TechCrunch that most still cannot answer a fundamental question: What should we automate first? Enterprises often try to find the answer through interviews, workshops, or by bringing in consultants, she said, approaches that take months and still miss much of what people actually do on a day-to-day basis.\n“Without really knowing how work is done, it is really hard to know where to improve it, where to automate it, where agents can help,” she said. “Scribe Optimize is all about answering that question. Very simply, it mines across workflows for what people are doing when they’re at work, and then it abstracts those up into being able to show you in a single pane of glass, here are the actual workflows that are being done. Here’s how often, how long it takes, etc.”\nFounded in 2019 by Smith and CTO Aaron Podolny (pictured above, right), Scribe started before the GenAI boom, and its current flagship product, Scribe Capture, helps automatically document how work is done. When someone completes a process or workflow, Capture generates a step-by-step guide using its browser extension and desktop app, along with text and screenshots. Those guides can be shared with colleagues or embedded in internal tools to reduce repeated questions, minimize errors, and expedite onboarding.\nCustomers using Scribe Capture report saving 35 to 42 hours per person per month and making new hires 40% faster, the startup said.\nThe market of process documentation includes players including Tango, Iorad, UserGuiding, and Spekit. Nonetheless, Smith told TechCrunch that Scribe competes against the status quo of people manually recording workflows.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“People are still using stopwatches to sit behind somebody and understand what this process is,” she said. “Even now, when it comes to deploying AI agents, the irony is that the process of deploying agents is incredibly manual.”\nTo date, Scribe has documented more than 10 million workflows across 40,000 software applications. The startup said that it has more than 5 million users and is used by teams inside 94% of Fortune 500 companies. Further, 78,000 organizations are its paid customers. It counts teams at New York Life, T-Mobile, LinkedIn, HubSpot, and Northern Trust among its users.\n“Users come to Scribe not because their boss tells them to, but because they want to,” Smith told TechCrunch. “It starts with the end user, and then goes up to their team lead, department lead, and then some kind of central function who are all interested in it for the question of, how do we scale, what we know, how to do, and how do we get better?”\nThe San Francisco-based startup sees the U.K., Canada, Australia, and Europe among its biggest markets after the U.S.\nScribe said it has more than doubled its revenue over the past year, though it did not disclose figures, and also said its valuation has increased fivefold since its last round. The startup currently has a headcount of 120 employees, and it plans to double that number in the next 12 months, Smith said.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scribe hits $1.3B valuation as it moves to show where AI will actually pay off",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/scribe-founders.jpg?w=150"
      ],
      "datePublished": "2025-11-10T13:00:00.000Z",
      "dateModified": "2025-11-10T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The circular money problem at the heart of AI’s biggest deals",
    "url": "https://techcrunch.com/video/the-circular-money-problem-at-the-heart-of-ais-biggest-deals/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2197181602.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T23:32:36.000Z",
    "description": "\n\t\t\n\nLoading the player…\n\nSoftBank and OpenAI announced a new 50-50 joint venture this week to sell enterprise AI tools in Japan under the brand “Crys",
    "body": "\n\t\t\n\nLoading the player…\n\nSoftBank and OpenAI announced a new 50-50 joint venture this week to sell enterprise AI tools in Japan under the brand “Crystal Intelligence.” On paper, it’s a straightforward international expansion deal. But SoftBank’s role as a major investor in OpenAI is raising questions about whether AI’s biggest deals are creating real economic value or just moving money in circles. \nOn TechCrunch’s Equity podcast, Kirsten Korosec, Anthony Ha, and AI editor Russell Brandom break down why this deal has people skeptical, and what it signals about the sustainability of AI’s current investment model, and more.\nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.\n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The circular money problem at the heart of AI’s biggest deals",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2197181602.jpg?w=150"
      ],
      "datePublished": "2025-11-10T23:32:36.000Z",
      "dateModified": "2025-11-10T23:32:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A better way of thinking about the AI bubble ",
    "url": "https://techcrunch.com/2025/11/10/a-better-way-of-thinking-about-the-ai-bubble/",
    "image": "https://techcrunch.com/wp-content/uploads/2015/05/bubbles.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T21:16:41.000Z",
    "description": "\nPeople often think about tech bubbles in apocalyptic terms, but it doesn’t have to be as serious as all that. In economic terms, a bubble is a bet th",
    "body": "\nPeople often think about tech bubbles in apocalyptic terms, but it doesn’t have to be as serious as all that. In economic terms, a bubble is a bet that turned out to be too big, leaving you with more supply than demand.  \nThe upshot: It’s not all or nothing, and even good bets can turn sour if you aren’t careful about how you make them. \nWhat makes the question of the AI bubble so tricky to answer is mismatched timelines between the breakneck pace of AI software development and the slow crawl of constructing and powering a data center. \nBecause these data centers take years to build, a lot will inevitably change between now and when they come online. The supply chain that powers AI services is so complex and fluid that it’s hard to have any clarity on how much supply we’ll need a few years from now. It isn’t simply a matter of how much people will be using AI in 2028, but how they’ll be using it, and whether we’ll have any breakthroughs in energy, semiconductor design, or power transmission in the meantime. \nWhen a bet is this big, there are lots of ways it can go wrong — and AI bets are getting very big indeed.  \nLast week, Reuters reported that an Oracle-linked data center campus in New Mexico has drawn as much as $18 billion in credit from a consortium of 20 banks. Oracle has already contracted $300 billion in cloud services to OpenAI, and the companies have joined with SoftBank to build $500 billion in total AI infrastructure as part of the “Stargate” project. Meta, not to be outdone, has pledged to spend $600 billion on infrastructure over the next three years. We’ve been tracking all the major commitments here — and the sheer volume has made it hard to keep up. \nAt the same time, there is real uncertainty about how fast demand for AI services will grow.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nA McKinsey survey released last week looked at how top firms are employing AI tools. The results were mixed. Almost all the businesses contacted are using AI in some way, yet few are using it on any real scale. AI has allowed companies to cost-cut in specific use cases, but it’s not making a dent on the overall business. In short, most companies are still in “wait and see” mode. If you’re counting on those companies to buy space in your data center, you may be waiting a long time. \nBut even if AI demand is endless, these projects could run into more straightforward infrastructure problems. Last week, Satya Nadella surprised podcast listeners by saying he was more concerned with running out of data center space than running out of chips. (As he put it, “It’s not a supply issue of chips; it’s the fact that I don’t have warm shells to plug into.”) At the same time, whole data centers are sitting idle because they can’t handle the power demands of the latest generation of chips.  \nWhile Nvidia and OpenAI have been moving forward as fast as they possibly can, the electrical grid and built environment are still moving at the same pace they always have. That leaves lots of opportunity for expensive bottlenecks, even if everything else goes right. \nWe get deeper into the idea in this week’s Equity podcast, which you can listen to below. \n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A better way of thinking about the AI bubble ",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2015/05/bubbles.jpg?w=150"
      ],
      "datePublished": "2025-11-10T21:16:41.000Z",
      "dateModified": "2025-11-10T21:16:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kaltura acquires eSelf, founded by creator of Snap’s AI, in $27M deal",
    "url": "https://techcrunch.com/2025/11/10/kaltura-acquires-eself-founded-by-creator-of-snaps-ai-in-27m-deal/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Kaltura-EX-Avatar-Town-Hall-Assistant.png?w=150",
    "tag": "Tech",
    "date": "2025-11-10T21:05:00.000Z",
    "description": "\nKaltura, a New York-headquartered AI video platform company, is acquiring eSelf.ai, an Israel-based startup behind conversational avatars — AI-genera",
    "body": "\nKaltura, a New York-headquartered AI video platform company, is acquiring eSelf.ai, an Israel-based startup behind conversational avatars — AI-generated digital humans that can talk with users — for about $27 million. Kaltura announced today that it has signed a definitive agreement to acquire eSelf, a platform supporting more than 30 languages and featuring a user-friendly studio for creating, customizing, and deploying photorealistic digital avatars.\nCo-founded in 2023 by CEO Alan Bekker, who previously sold his first startup, Voca, to Snap in 2020 — and CTO Eylon Shoshan, eSelf brings deep technical expertise in speech-to-video generation, low-latency speech recognition, and screen understanding, which allows avatars to see and respond to what’s on a user’s screen. The eSelf co-founders will join Kaltura to oversee the integration of eSelf’s technology into the company, with all current eSelf employees coming on board as well.\nThe two-year-old startup has a small but strong team of around 15 AI experts, Ron Yekutiel, co-founder and CEO of Kaltura, told TechCrunch. He noted that Bekker’s former company specialized in natural language processing, which helps computers understand human speech, and computer vision, saying it was a “very leading company in the area of conversational speech bots. And so he’s an expert [in this field], and that’s what we bought,” Yekutiel said.\nKaltura offers a suite of cloud-based software solutions designed for advanced video applications, including a corporate video portal akin to a private YouTube, tools for webinars and virtual events, and integrations that embed video learning into university learning management systems, or platforms that organize online coursework.\nThe Nasdaq-listed company also delivers virtual classroom products and end-to-end TV streaming solutions. Kaltura’s video platform serves over 800 enterprise customers, helping them engage users across sales, marketing, customer care, education, and entertainment. Its clients include tech giants like Amazon, Oracle, Salesforce, SAP, Adobe, and IBM, as well as leading banks, insurance companies, consulting firms, pharmaceutical companies, and universities in the U.S.\nKaltura plans to integrate eSelf.ai’s virtual agent technology across its video offerings; the integration aims to enable agents that can listen, speak, and interpret user screens in real time.\n“This acquisition was so strategic. We were actively evaluating multiple companies to find the right fit. We determined that they [eSelf] were best-in-class for real-time, synchronous conversation — not just video-on-demand lip-syncing — and that they had an impressive speech-to-text and text-to-speech technology stack,” Yekutiel said in an interview with TechCrunch. “Beyond the technology, there was also a strong cultural and geographic alignment, which was critical for us.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhy a video company is betting on conversational avatars\nFor the past two decades, businesses have mostly used video for streaming, uploading, and managing content. But that’s changing fast. Thanks to AI, videos can now be generated instantly — hyper-personalized and contextual — giving every viewer their own custom experience, tailored exactly to what they need in that moment, Yekutiel explained.\n“We started with video, then moved to personalized video, and now, with eSelf’s technology, we’re adding human-like capabilities — faces, eyes, mouths, ears — to make our AI agents conversational and expressive,” Yekutiel said.\nKaltura is evolving from a video platform into a video-based customer and employee experience provider, where video serves as the interface. Unlike most avatar companies that offer only a “face,” it delivers the full workflow — avatar, intelligence, and enterprise-connected knowledge. The focus isn’t just streaming video; it’s driving measurable business results and ROI, the CEO added.\nThe company plans to launch standalone, embeddable agents for uses including sales, marketing, customer support, and training. Target sectors include education, media and telecom, e-commerce, financial services, healthcare, and pharmaceuticals.\nAsked about media reports saying Kaltura was exploring a sale or merger at a $400 million to $500 million valuation, Yekutiel told TechCrunch that Kaltura has explored opportunities with a range of companies, including potential “acquisitions, mergers with similarly sized firms, and connections with some larger players.” But it never got close to a transaction like the ones being reported, he said. He also pointed to Kaltura’s recent acquisitions, including its fourth company, as evidence of the company’s continued commitment to its current strategy.\nThis marks Kaltura’s fourth acquisition to date. The company acquired cloud TV solution Tvinci in 2014, followed by Rapt Media in 2018, and video conferencing platform Newrow in 2020. eSelf’s most recent funding round was its $4.5 million announced in December 2024. \nKaltura, which went public in 2021, reports around $180 million in revenue, is profitable on an adjusted EBITDA and cash flow basis, and has about 600 employees.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kaltura acquires eSelf, founded by creator of Snap’s AI, in $27M deal",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/Kaltura-EX-Avatar-Town-Hall-Assistant.png?w=150"
      ],
      "datePublished": "2025-11-10T21:05:00.000Z",
      "dateModified": "2025-11-10T21:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Knicks player Miles McBride launches a location-sharing friendship app to rival Snap Map",
    "url": "https://techcrunch.com/2025/11/10/knicks-player-miles-mcbride-launches-a-location-sharing-friendship-app-to-rival-snap-map/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/McBrideEinhorn.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T15:06:46.000Z",
    "description": "\nFive years ago, when Miles “Deuce” McBride moved to New York as a 20-year-old rookie playing for the Knicks, he found the transition to a big city ov",
    "body": "\nFive years ago, when Miles “Deuce” McBride moved to New York as a 20-year-old rookie playing for the Knicks, he found the transition to a big city overwhelming and struggled to find the right crowd.\n“When I got up here, everybody on my team was married with kids or just kind of loners,” he told TechCrunch, reflecting on his initial feelings of loneliness being the youngest player on the team. “I wish there was a way to meet people organically who have the same interests. I feel like with social media, everybody is so superficial.”\nRecognizing a common pain point for many in their twenties, McBride teamed up with veteran startup founder Joe Einhorn to create Mmotion, an app that combines elements of location tracking with social discovery features to help people find new friends based on shared interests while also recommending nearby bars, restaurants, and other social hotspots. \nImage Credits:Mmotion (Image has been modified)\nNow available in beta for users in NYC, the app diverges from traditional friendship platforms like Bumble BFF, instead competing more directly with apps like Snap Map and Find My. Instagram also recently entered the space with a new Map feature. (Mmotion’s beta will be limited to 1,000 members.)\nMmotion leverages geofencing and state tracking to follow users’ movements, highlighting people with similar interests in the vicinity. It also keeps track of where users go to recommend similar, worthwhile locations to explore. Plus, users get a private log of all their location history, acting like a personal timeline so they can easily look back on all the spots they’ve explored.\nTo access Mmotion, users must apply for a membership. Once accepted, they can enter their interests, join “Circles” or groups they’re interested in (such as those focused on hiking, attending basketball games, or visiting art galleries), and send friend requests to others nearby. The app also offers private messaging between users. \nImage Credits:Mmotion\nTo prioritize user safety, the app features encrypted location data that is only accessible to the user unless they choose to share it. Users are incognito by default, which Mmotion refers to as “Vault Mode,” and can be switched at any time. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAdditionally, if users prefer that only certain individuals on the app know their location, Mmotion offers a feature called “Personas.” This feature allows users to create up to three separate groups, enabling them to share more private locations like their home address with a select group of people while maintaining a more public persona.\n“So Miles might have [his “Deuce” Persona], which is something where it’s a bit more curated, because he’s a public figure. So it’s for all the Knicks fans to see Miles go to places he’s okay with mainstream people knowing. And then he might have a [Persona], for when he goes to a different city, and he wants to be really low-key,” Einhorn explained.\nStandard safety and moderation tools like blocking and reporting are also implemented. \nImage Credits:Mmotion\nThe app will operate on a monthly subscription model for users. While the exact pricing details weren’t disclosed, Einhorn hinted that it will be affordable, stating, “It’s not going to be more than a cup of coffee per month. It’s not going to be anything crazy.” \nPremium options offering additional features may also be available. For example, the basic tier only lets users join five Circles per city at a time.\nAnother aspect of the app is its offering for local businesses. By featuring restaurants, bars, coffee shops, fitness studios, and more on the map, Mmotion aims to promote small businesses while also providing them with insights into their customer base. The app aggregates data from various sources, including Google, OpenStreetMap, and Apple Maps.\nMmotion’s long-term vision is to encourage businesses to sign up for a subscription service that provides access to anonymized analytics. This service would help businesses effectively target the right customers.\nIn addition to subscription fees, the app will generate revenue through ads. \nThe launch marks McBride’s first time as a startup founder, positioning him alongside other athletes who have transitioned to entrepreneurship. Einhorn, meanwhile, is known as the founder and CEO of Fancy, a social e-commerce platform that competed with Pinterest. He also launched a luxury goods startup last year called Long Story Short.\nMmotion plans for a wider launch in the near future when there’s enough feedback from testers. It’s currently available to download on iOS and Android devices.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Knicks player Miles McBride launches a location-sharing friendship app to rival Snap Map",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/McBrideEinhorn.jpg?w=150"
      ],
      "datePublished": "2025-11-10T15:06:46.000Z",
      "dateModified": "2025-11-10T15:06:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Remote driving startup Vay could grab up to $410M from Singapore’s Grab",
    "url": "https://techcrunch.com/2025/11/10/remote-driving-startup-vay-could-grab-up-to-410m-from-singapores-grab/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/Vay_US_4.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-10T13:53:30.000Z",
    "description": "\nAutonomous vehicles are having a moment, and it’s making it a lot easier for smaller companies to raise money. Vay, a German startup offering remote-",
    "body": "\nAutonomous vehicles are having a moment, and it’s making it a lot easier for smaller companies to raise money. Vay, a German startup offering remote-controlled rental cars, will get $60 million in cash from Singaporean tech heavyweight Grab, the company announced on Monday.\nThe deal, which is subject to regulatory approval and expected to close by the end of the year, may be followed by “an additional $350M as joint milestones are achieved within the first year,” Vay CEO Thomas von der Ohe wrote on LinkedIn.\nThe Berlin-based startup uses its technology and human operators to remotely drive rental cars to and from customers. Vay isn’t yet commercially deployed in real traffic in Germany, where it lacked regulatory clarity until recently, but the company is currently operational in Las Vegas, where it started in January 2024. Vay now plans to use Grab’s investments to scale and expand its operations in the U.S.\nVay will need to hit certain milestones in the U.S. to unlock additional investment from Grab, including number of U.S. cities covered, regulatory approvals obtained, and overall consumer revenue.\nThe U.S. is seeing increased competition and fast-expanding offerings of various forms of remote driving. For instance, Alphabet-owned Waymo recently announced it would deploy its robotaxi service in Detroit, Las Vegas, and San Diego. \nAlthough publicly traded on the Nasdaq, Grab does not operate in the U.S., where it will limit itself to supporting Vay’s growth. \nHowever, Vay describes driverless car rental as complementary to robotaxis. As for Grab, it sees Vay as serving “a growing segment of consumers who prefer not to be car owners,” Grab co-founder and CEO Anthony Tan said in a press release.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nVay’s customers may not be car owners, but they still need a driving license: Once the car gets delivered, the user takes over and drives it like a regular car. But unlike their own car, they don’t need to find where to park it. Vay says its service costs about half the price of ride-hailing, thanks to this hybrid approach and hardware-light system.\nAt the same time, the two companies plan to explore synergies between Vay’s and Grab’s business in Southeast Asia. Calling itself “the everyday everything app,” Grab’s ubiquitous super-app offers ​​all-in-one taxi, ride hailing, transport, express grocery shopping, and food delivery options, as well as digital payments and financial services.\nWith a growing interest in mobility, Grab recently invested in autonomous driving tech startups, including May Mobility out of the U.S. and WeRide out of China. The synergies it finds with Vay may well be on the tech side — for instance, it said that driving data collected by Vay could accelerate the training of AI models to improve autonomous driving.\nThis also aligns with Vay’s vision to become more than an electric rental car fleet. The company has already expanded into commercial and business-to-business services, and closed a partnership with self-driving truck company Kodiak Robotics. Ultimately, it aims to build a “global remote driving platform,” von der Ohe told TechCrunch earlier this year.\nAccording to Crunchbase, Vay had raised $131.8 million from backers including Kinnevik, Coatue, Eurazeo, Atomico, General Catalyst, Creandum, and the European Investment Bank. If fully unlocked, Grab’s investment would be a significant boost. But with Nvidia announcing plans to invest $500 million into British self-driving tech startup Wayve, the race is only starting.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Remote driving startup Vay could grab up to $410M from Singapore’s Grab",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/09/Vay_US_4.jpg?w=150"
      ],
      "datePublished": "2025-11-10T13:53:30.000Z",
      "dateModified": "2025-11-10T13:53:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]