[
  {
    "title": "Roblox CEO interview gets heated over child safety",
    "url": "https://techcrunch.com/2025/11/23/roblox-ceo-interview-gets-heated-over-child-safety/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1167248846.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-23T21:58:04.000Z",
    "description": "The interview began with Baszucki describing the feature, which will require all users to submit a face scan if they want to access Roblox’s messaging features. But by the time he was asked about a report claiming the company had prioritized growth over safety, Baszucki seemed to tire of the topic.",
    "body": "\nIn Brief\nPosted:\n1:58 PM PST · November 23, 2025\n\nImage Credits:Ian Tuttle/Getty Images for Roblox\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRoblox CEO Dave Baszucki joined The New York Times’ Hard Fork podcast to discuss the gaming platform’s new age-verification feature — but he seemed to get frustrated at the number of questions focused on child safety.\nThe interview began with Baszucki describing the feature, which will require all users to submit a face scan if they want to access Roblox’s messaging features. But by the time he was asked about a report claiming the company had prioritized growth over safety, Baszucki seemed to tire of the topic, responding, “Fun. Let’s keep going down this.”\nAnd when co-host Kevin Roose agreed that one of the best ways for Roblox to improve child safety is to improve its AI models, Baszucki insisted, “Good, so you’re aligning with what we did. High-five.”\n“And I want to highlight, I came here because I love your podcast and came to talk about everything,” he added. “So if our PR people said, ‘Let’s talk about age-gating for an hour,’ I’m up for it, but I love your pod. I thought I came here to talk about everything.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\nLatest in Social\n"
  },
  {
    "title": "Tesla FSD software may not be approved by EU regulator after all",
    "url": "https://techcrunch.com/2025/11/24/tesla-fsd-software-may-not-be-approved-by-eu-regulator-after-all/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/11/tesla-fsd.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T21:10:37.000Z",
    "description": "In Brief Posted: 1:10 PM PST · November 24, 2025  Image Credits:Tesla  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Tesla may have celebrated a regulatory win in Europe a bit too soon. Tesla claimed in a...",
    "body": "\nIn Brief\nPosted:\n1:10 PM PST · November 24, 2025\n\nImage Credits:Tesla\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTesla may have celebrated a regulatory win in Europe a bit too soon. \nTesla claimed in a weekend social media post that Dutch regulator RDW was set to approve the use of its driver assistance system, known as Full Self-Driving, or FSD, in February 2026. The organization handles the licensing and registration of vehicles in the Netherlands and is seen as a critical step for Tesla to get approval for — and eventually roll out — FSD to consumers across Europe.\n“RDW has committed to granting Netherlands National approval in February 2026. Please contact them via link below to express your excitement & thank them for making this happen as soon as possible,” Tesla wrote in the post.\nIt seems RDW isn’t quite in line with Tesla. The Dutch regulator clarified in a statement on their website that Tesla plans to demonstrate FSD Supervised in February. Bloomberg was first to report on RDW’s statement.\n“RDW and Tesla know what efforts need to be made to make a decision on this in February. Whether the schedule will be met remains to be seen in the coming period. For the RDW, (traffic) safety is paramount,” the statement reads.\nTesla vehicles come standard with a driver assistance system called Autopilot. For an additional $8,000 fee, owners can upgrade to FSD Supervised, which provides additional automated driving features, including steering and lane changes on highways and surface streets. FSD is not self-driving and requires the driver to remain engaged with their hands on the wheel at all times.\nFSD is available in Australia, Canada, China, Mexico, New Zealand, Puerto Rico, and the United States.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\nLatest in Transportation\n"
  },
  {
    "title": "Malaysia may ban users under 16 from social media starting next year",
    "url": "https://techcrunch.com/2025/11/24/malaysia-may-ban-users-under-16-from-social-media-starting-next-year/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/02/malaysia.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:03:32.000Z",
    "description": "In Brief Posted: 6:03 AM PST · November 24, 2025  Image Credits:Senyeorita Osman/EyeEm / Getty Images (Image has been modified)  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  As Australia’s ban on social media...",
    "body": "\nIn Brief\nPosted:\n6:03 AM PST · November 24, 2025\n\nImage Credits:Senyeorita Osman/EyeEm / Getty Images (Image has been modified)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAs Australia’s ban on social media use for users under 16 looms, it appears Malaysia now plans to implement a similar system starting next year.\nThe country’s communications minister, Fahmi Fadzil, reportedly said the administration is considering systems for implementing age restrictions on social media platforms, barring users under 16 years old from platforms like Facebook, Instagram, and X, Reuters reported.\n“We hope by next year that social media platforms will comply with the government’s decision to bar those under the age of 16 from opening user accounts,” the report quoted Fadzil as saying.\nMalaysia would join a growing list of countries that are implementing age restrictions or verification measures to protect children from the risks associated with social media usage. Australia has already passed a law that will come into force on December 10, mandating social media sites to deactivate accounts belonging to users under 16.\nFrance, Denmark, Italy, and Norway are working on similar age-restriction measures for social media platforms, and in the U.S., 24 states have so far enacted age-verification laws. Utah became the first U.S. state to require app stores to verify users’ ages and obtain parental consent for minors downloading apps.\nThe U.K.’s Online Safety Act also came into effect in July, mandating social media and other online platforms to block children’s access to harmful content or face huge fines. The U.K. requires strong age checks for high-risk content, like self-harm and eating-disorder content, to protect users under 18.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n"
  },
  {
    "title": "OpenAI learned the hard way that Cameo trademarked the word ‘cameo’",
    "url": "https://techcrunch.com/2025/11/24/openai-learned-the-hard-way-that-cameo-trademarked-the-word-cameo/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/sora-app-GettyImages2238161095.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T22:27:10.000Z",
    "description": "In Brief Posted: 2:27 PM PST · November 24, 2025  Image Credits:Samuel Boivin/NurPhoto (opens in a new window) / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  OpenAI’s social app Sora launched with...",
    "body": "\nIn Brief\nPosted:\n2:27 PM PST · November 24, 2025\n\nImage Credits:Samuel Boivin/NurPhoto (opens in a new window) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOpenAI’s social app Sora launched with a controversial feature called Cameo, allowing users to deepfake themselves or others (with permission). The feature had a tenuous rollout — Martin Luther King Jr.’s estate had to get involved, to give you an idea of what went on — but now it faces a new challenge. \nApparently, Cameo — the app where you buy custom video messages from celebrities — can claim the trademark of the word “cameo.”\nU.S. District Judge Eumi K. Lee imposed a temporary restraining order that blocks OpenAI from using the word “cameo,” as well as any similar-sounding words or phrases, on Sora.\nThe temporary restraining order issued on November 21, 2025 is set to expire on December 22, 2025, at 5:00 p.m. A hearing on the matter is scheduled for December 19, 2025, at 11:00 a.m.\nAs of Monday afternoon, the Sora app still uses the “cameo” language, however. \n “We are gratified by the court’s decision, which recognizes the need to protect consumers from the confusion that OpenAI has created by using the Cameo trademark,” Cameo CEO Steven Galanis said in a statement. “While the court’s order is temporary, we hope that OpenAI will agree to stop using our mark permanently to avoid any further harm to the public or Cameo.”\nOpenAI disagrees with the assertion that the company can claim exclusive ownership over the word “cameo,” the company told CNBC.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Pocket Casts now lets you create a playlist of your favorite podcast episodes ",
    "url": "https://techcrunch.com/2025/11/24/pocket-casts-now-lets-you-create-a-playlist-of-your-favorite-podcast-episodes/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Pocket-Casts-app.png?w=150",
    "tag": "Tech",
    "date": "2025-11-24T16:51:13.000Z",
    "description": "Image Credits:Pocket Casts\t \t \t\t\t\t\t\t8:51 AM PST · November 24, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Pocket Casts, the podcast app owned by Tumblr’s parent company Automattic, launched a new feature that lets you create...",
    "body": "\n\t\n\t\tImage Credits:Pocket Casts\t\n\t\n\t\t\t\t\t\t8:51 AM PST · November 24, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nPocket Casts, the podcast app owned by Tumblr’s parent company Automattic, launched a new feature that lets you create podcast playlists, allowing you to organize your favorite episodes in just the order you like. You can either create a playlist manually, or Pocket Casts can automatically create one for you. \nPlaylists are designed to better personalize the listening experience for users as Pocket Casts seeks to grow its paid user base and compete with larger platforms. Currently, it has 60,000 subscribers, while Spotify has 281 million.\nThe new feature makes it easy to curate collections based on specific topics and themes, or could be used to listen to your favorite podcast guest featured across different shows. It’s also helpful for preparing a list of episodes to enjoy while on a long flight or during your daily commute. \nImage Credits:Pocket Casts\nTo get started creating a manual playlist, navigate to the Playlists tab on the main screen and select the “+” icon on a mobile device or “New playlist” on the web version. From there, you can browse through your favorite podcasts and handpick the episodes that you want to include in your personalized playlist.\nFor those who prefer a more automated approach, Pocket Casts offers Smart Playlists. By selecting the “Smart rules” button, you can create custom rules that automatically gather episodes based on specific criteria. \nFor example, if you only want to listen to shorter episodes, you can set a rule to only include shows under 25 minutes, or filter by unplayed or downloaded content. This feature is especially useful if you have a busy schedule and want to make the most of your free time.\nCurrently, the Playlist feature is available on the web version and desktop apps, with a rollout for Android users already underway. The feature is arriving on iOS devices soon. \nThe update follows Pocket Casts’ decision to make its web player free for users, further positioning itself as a strong competitor in the podcasting space against major platforms that keep their content behind paywalls.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Revolut hits $75B valuation in new capital raise",
    "url": "https://techcrunch.com/2025/11/24/revolut-hits-75b-valuation-in-new-capital-raise/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/revolut.png?w=150",
    "tag": "Tech",
    "date": "2025-11-24T13:31:31.000Z",
    "description": "The deal was led by Coatue, Greenoaks, Dragoneer, and Fidelity. Investors including Nvidia's NVentures, Andreessen Horowitz, Franklin Templeton, and other backers advised by T. Rowe Price Associates also participated.",
    "body": "\nRevolut has raised new funding in a share sale that values it at $75 billion, positioning the British neobank as one of Europe’s most valuable private tech companies.\nThe company said on Monday the deal was led by Coatue, Greenoaks, Dragoneer, and Fidelity. Investors including Nvidia’s NVentures, Andreessen Horowitz, Franklin Templeton, and other backers advised by T. Rowe Price Associates also participated.\nRevolut did not mention how much it raised in the share sale, but it did say it allowed employees to cash out in the deal. As of August 2025, the company had a post-money valuation of $48 billion, and has raised a total of $2.89 billion in venture capital, according to PitchBook.\nFounded in 2015, Revolut offers a range of services spanning multi-currency accounts, payment and transfer services, crypto products, insurance, and more. The new funding comes as the neobank has been pouring truckloads of cash into expanding its operations internationally.\nBesides the U.K., where the company is awaiting a final nod to operate as a full-fledged bank, Revolut has a banking license in the European Union, and it operates in Australia, Japan, New Zealand, Singapore, Brazil, and the U.S. It launched operations in India in October, is about to start operating in Colombia in 2026, and has received a banking license in Mexico. \nIt also has plans to launch in Argentina, wants to enter Africa (first with South Africa), and has an in-principal payments license in the UAE.\nThe company’s been doing well financially, too: In 2024, its revenue rose 72% to $4 billion, and it claims it reached $1 billion in annualized revenue this year. Per its last annual report, Revolut reported net profit of $1 billion (£790 million) in 2024. The company also launched a crypto exchange, Revolut X, part of its Wealth division, which saw revenue rise 298% to $647 million in 2024 from just $158 million in 2023.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe company has grand ambitions, aiming to reach 100 million customers by mid-2027, and enter over 30 new markets by 2030.\n“This milestone reflects the remarkable progress we have made in the last twelve months towards our vision of building the first truly global bank, serving 100 million customers across 100 countries,” Nik Storonsky, CEO and co-founder of Revolut, said in a statement.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Altman describes OpenAI’s forthcoming AI device as more peaceful and calm than the iPhone",
    "url": "https://techcrunch.com/2025/11/24/altman-describes-openais-forthcoming-ai-device-as-more-peaceful-and-calm-than-the-iphone/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/portrait.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T22:59:46.000Z",
    "description": "“When people see it, they say, ‘that’s it?… It’s so simple.’” That’s how OpenAI CEO Sam Altman describes how he thinks people will respond to seeing the company’s forthcoming AI hardware device for the first...",
    "body": "\n“When people see it, they say, ‘that’s it?… It’s so simple.’”\nThat’s how OpenAI CEO Sam Altman describes how he thinks people will respond to seeing the company’s forthcoming AI hardware device for the first time. \nThe device is the result of the collaboration between OpenAI and Apple’s former chief designer Jony Ive. Not much is known yet about the product except that it’s rumored to be “screenless” and pocket-sized.\nEarlier this year, OpenAI acquired Ive’s design startup, io, to bring AI to the masses through some sort of tech gadgetry. This weekend, Altman and Ive talked more about their vision for their AI device in an interview led by Laurene Powell Jobs at Emerson Collective’s 9th annual Demo Day in San Francisco.\nAlthough OpenAI isn’t sharing specifics about the device, which is now a prototype, Ive and Altman were keen to describe the product in terms of its “vibe.”\nMost notably, Altman compared the device to the iPhone, dubbing the Apple smartphone the “crowning achievement of consumer products” thus far. He said he could define his life as those times before the iPhone and after. \nHowever, Altman complained that modern technologies are filled with distractions. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“When I use current devices or most applications, I feel like I am walking through Times Square in New York and constantly just dealing with all the little indignities along the way — flashing lights in my face…people bumping into me, like noise is going off, and it’s an unsettling thing,” he said. The bright, flashing notifications and the dopamine-chasing social apps are where today’s devices are going wrong, Altman believes.  \n“I don’t think it’s making any of our lives peaceful and calm and just letting us focus on our stuff,” he said.\nThe vibe of the AI device, meanwhile, would be more like “sitting in the most beautiful cabin by a lake and in the mountains and sort of just enjoying the peace and calm,” Altman noted. \nThe device he described should be able to filter things out for the user, as the user would trust the AI to do things for them over long periods of time. It should also be contextually aware of when it’s the best time to present information to the user and ask for input. \n“You trust it over time, and it does have just this incredible contextual awareness of your whole life,” Altman added. \nIve confirmed at the event that the device should be available in under two years. \n“I love solutions that teeter on appearing almost naive in their simplicity,” Ive told Powell Jobs in the interview. “And I also love incredibly intelligent, sophisticated products that you want to touch, and you feel no intimidation, and you want to use almost carelessly — that you use them almost without thought — that they’re just tools,” he said. \n\n\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "US banks scramble to assess data theft after hackers breach financial tech firm",
    "url": "https://techcrunch.com/2025/11/24/us-banks-scramble-to-assess-data-theft-after-hackers-breach-financial-tech-firm/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-172674485.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:18:55.000Z",
    "description": "Several U.S. banking giants and mortgage lenders are reportedly scrambling to assess how much of their customers’ data was stolen during a cyberattack on a New York financial technology company earlier this...",
    "body": "\nSeveral U.S. banking giants and mortgage lenders are reportedly scrambling to assess how much of their customers’ data was stolen during a cyberattack on a New York financial technology company earlier this month.\nSitusAMC, which provides technology for over a thousand commercial and real estate financiers, confirmed in a statement over the weekend that it had identified a data breach on November 12.\nThe company said that unspecified hackers had stolen corporate data associated with its banking customers’ relationship with SitusAMC, as well as “accounting records and legal agreements” during the cyberattack. \nThe statement added that the scope and nature of the cyberattack “remains under investigation.” SitusAMC said that the incident is “now contained,” and that its systems are operational. The company said that no encrypting malware was used, suggesting that the hackers were focused on exfiltrating data from the company’s systems rather than causing destruction.\nAccording to Bloomberg and CNN, citing sources, SitusAMC sent data breach notifications to several financial giants, including JPMorgan Chase, Citigroup, and Morgan Stanley. SitusAMC also counts pension funds and state governments as customers, according to its website.\nIt’s unclear how much data was taken, or how many U.S. banking consumers may be affected by the breach. Companies like SitusAMC may not be widely known outside of the financial world, but provide the mechanisms and technologies for its banking and real estate customers to comply with state and federal rules and regulations. In its role as a middleman for financial clients, the company handles vast amounts of non-public banking information on behalf of its customers. \nAccording to SitusAMC’s website, the company processes billions of documents related to loans annually. \nWhen reached by TechCrunch, Citi spokesperson Patricia Tuma declined to comment on the breach. Tuma would not say if the bank has received any communications from the hackers, such as a demand for money.\nRepresentatives for JPMorgan Chase, and Morgan Stanley did not immediately respond to a request for comment Monday. SitusAMC chief executive Michael Franco also did not respond to our email when contacted for comment Monday.\nA spokesperson for the FBI told TechCrunch that the bureau is aware of the breach.\n“While we are working closely with affected organizations and our partners to understand the extent of potential impact, we have identified no operational impact to banking services,” said FBI director Kash Patel in a statement shared with TechCrunch. “We remain committed to identifying those responsible and safeguarding the security of our critical infrastructure.”\nDo you know more about the SitusAMC data breach? Do you work at a bank or financial institution affected by the breach? We would love to hear from you. To securely contact this reporter, you can reach out using Signal via the username: zackwhittaker.1337\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Anthropic releases Opus 4.5 with new Chrome and Excel integrations",
    "url": "https://techcrunch.com/2025/11/24/anthropic-releases-opus-4-5-with-new-chrome-and-excel-integrations/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Claude-Opus-4.5-illustration.png?w=150",
    "tag": "Tech",
    "date": "2025-11-24T19:08:48.000Z",
    "description": "On Monday, Anthropic announced Opus 4.5, the latest version of its flagship model. It’s the last of Anthropic’s 4.5 series of models to be released, following the launch of Sonnet 4.5 in September and Haiku...",
    "body": "\nOn Monday, Anthropic announced Opus 4.5, the latest version of its flagship model. It’s the last of Anthropic’s 4.5 series of models to be released, following the launch of Sonnet 4.5 in September and Haiku 4.5 in October.\nAs expected, the new version of Opus has state-of-the-art performance on a range of benchmarks, including coding benchmarks (SWE-Bench and Terminal-bench), tool use (tau2-bench and MCP Atlas), and general problem solving (ARC-AGI 2, GPQA Diamond). \nNotably, Opus 4.5 is the first model to score over 80% on SWE-Bench verified, a respected coding benchmark.\nAnthropic also emphasized Opus’ computer use and spreadsheet capabilities, and launched a number of parallel products to showcase how the model holds up in those settings. Together with Opus 4.5, Anthropic will make its Claude for Chrome and Claude for Excel products — previously in pilot — more broadly available. The Chrome extension will be available to all Max users, while the Excel-focused model will be available to Max, Team, and Enterprise users.\nOpus 4.5 also comes with memory improvements for long-context operations, which required significant changes in how the model manages its memory. \n“There are improvements we made on general long context quality in training with Opus 4.5, but context windows are not going to be sufficient by themselves,” Dianne Na Penn, Anthropic’s head of product management for research, told TechCrunch. “Knowing the right details to remember is really important in complement to just having a longer context window.”\nThose changes also enabled a long-requested “endless chat” feature for paid Claude users, which will allow chats to proceed without interruption when the model hits its context window. Instead, the model will compress its context memory without alerting the user.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMany of the upgrades are made with an eye toward agentic use cases, particularly scenarios in which Opus acts as a lead agent commanding a group of Haiku-powered sub-agents. Managing those tasks requires a strong command of working memory, which is where the memory improvements described by Penn really show their worth.\n“This is where fundamentals like memory become really important,” Penn says, “because Claude needs to be able to explore code bases and large documents, and also know when to backtrack and recheck something.”\nOpus 4.5 will face stiff competition from other recently released frontier models, most notably OpenAI’s GPT 5.1 (released on November 12) and Google’s Gemini 3 (released November 18).\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "AWS is spending $50B to build AI infrastructure for the US government",
    "url": "https://techcrunch.com/2025/11/24/aws-is-spending-50b-build-ai-infrastructure-for-the-us-government/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/IMG_4752.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T19:10:41.000Z",
    "description": "Image Credits:Ron Miller/TechCrunch\t \t \t\t\t\t\t\t11:10 AM PST · November 24, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Amazon Web Services is making a sizable new investment in infrastructure designed to boost AI capabilities for...",
    "body": "\n\t\n\t\tImage Credits:Ron Miller/TechCrunch\t\n\t\n\t\t\t\t\t\t11:10 AM PST · November 24, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nAmazon Web Services is making a sizable new investment in infrastructure designed to boost AI capabilities for U.S. government organizations.\nAWS announced Monday it is investing $50 billion to build AI “high-performance computing infrastructure” purposefully built for the U.S. government. The buildout is meant to expand federal government agencies’ access to AWS AI services.\nThe project will add 1.3 gigawatts of compute and will expand government access to AWS products, including Amazon SageMaker AI, model customization, Amazon Bedrock, model deployment, and Anthropic’s Claude chatbot, among others, according to the company.\nAWS expects to break ground on these data center projects in 2026.\n“Our investment in purpose-built government AI and cloud infrastructure will fundamentally transform how federal agencies leverage supercomputing,” AWS CEO Matt Garman said in the company’s press release. “We’re giving agencies expanded access to advanced AI capabilities that will enable them to accelerate critical missions from cybersecurity to drug discovery. This investment removes the technology barriers that have held government back and further positions America to lead in the AI era.”\nAWS is no stranger to working with the U.S. government.\nThe entity began building cloud infrastructure for the U.S. government back in 2011. Three years later it launched AWS Top Secret-East, the first air-gapped commercial cloud to work with classified workloads. AWS introduced AWS Secret Region in 2017, which has accredited access to all levels of security classification.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTech giants have increasingly pitched their AI services to the U.S. government over the past year.\nOpenAI launched a version of ChatGPT designed exclusively for federal U.S. government agencies in January. OpenAI announced a deal in August that gave government agencies access to the enterprise tier of ChatGPT for just $1 a year.\nThat same month, Anthropic announced it was also giving the U.S. government access to the enterprise tiers of its Claude chatbot for $1. Google announced “Google for Government” for even less, charging 47 cents for the first year, shortly after.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Rad Power Bikes’ batteries receive major fire risk warning",
    "url": "https://techcrunch.com/2025/11/24/rad-power-bikes-batteries-receive-major-fire-risk-warning/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/12/rqad-power-bikes-trike-and-van.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T21:28:27.000Z",
    "description": "The batteries that power Rad Power Bikes’ e-bikes “pose a risk of serious injury and death” and owners should stop using them, according to the U.S. Consumer Product Safety Commission (CPSC). The warning,...",
    "body": "\nThe batteries that power Rad Power Bikes’ e-bikes “pose a risk of serious injury and death” and owners should stop using them, according to the U.S. Consumer Product Safety Commission (CPSC).\nThe warning, issued Monday by the CSPC, is due to a risk that the batteries can ignite or explode. The CPSC has linked the batteries to 31 reports of fire so far. Twelve of those incidents resulted in property damage, and some of them even occurred when the batteries were not charging, according to the commission.\n“The hazardous batteries can unexpectedly ignite and explode, posing a fire hazard to consumers, especially when the battery or the harness has been exposed to water and debris,” the CPSC writes. \nThe battery fires and the CPSC warning are coming at a particularly bad time for Rad Power, which told employees earlier this month the company will shut down for good in January if it cannot find new funding.\nThe CPSC said Monday that Rad Power “refused to agree to an acceptable recall,” and claims the company said it is “unable to offer replacement batteries or refunds to all consumers” due to its financial situation. \nRad Power told TechCrunch it “firmly stands behind our batteries and our reputation as leaders in the ebike industry, and strongly disagrees with the CPSC’s characterization of certain Rad batteries as defective or unsafe.” \nThe company said it “offered multiple good-faith solutions to address the agency’s concerns,” including upgrading customers to its latest batteries, which are not subject to the official warning. “CPSC rejected this opportunity. The significant cost of the all-or-nothing demand would force Rad to shut its doors immediately, leaving no way to support our riders or our employees.” (The Verge first reported Rad Power’s disagreement with the CPSC.)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nRad Power claimed its batteries comply with “the highest industry standards” and said the “incident rate associated with the batteries in the CPSC’s notice is a fraction of one percent.” \n“While that number is low, we know even one incident is one too many, and we are heartbroken by any report involving our products,” the company told TechCrunch in an email. \nOwners can find out if they have batteries covered by the warning on the CPSC warning page. The commission is telling customers not to throw the lithium-ion batteries away, nor take them to traditional recyclers. Instead, they should take the batteries to “municipal household hazardous waste (HHW) collection center[s].”\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Momentic raises $15M to automate software testing",
    "url": "https://techcrunch.com/2025/11/24/momentic-raises-15m-to-automate-software-testing/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/20251119-DSC07129.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T14:00:27.000Z",
    "description": "AI testing startup Momentic has raised $15 million in a Series A round led by Standard Capital, with participation from Dropbox Ventures. Existing investors at Y Combinator, FCVC, Transpose Platform and Karman Ventures also participated.",
    "body": "\nProduct demos get all the attention, but software development more often involves things like debugging, quality assurance, and testing. It’s the dull but critical work that keeps software running the way it should, and as developers look to automate more of their workloads, it’s increasingly being done by AI.\nOn Monday, the AI testing startup Momentic said it had raised $15 million in a Series A round led by Standard Capital, with participation from Dropbox Ventures. Existing investors at Y Combinator, FCVC, Transpose Platform, and Karman Ventures also participated in the round. The new funding builds on a $3.7 million seed round, which the company announced in March.\nMomentic makes tools for software testing and verification, a niche currently occupied by open source frameworks like Playwright and Selenium. Those tools offer complex, fine-grained controls, but Momentic is counting on AI to make the process simple and effective.\n“We help our customers make sure their product works,” co-founder Wei-Wei Wu said. “They can describe their critical user flows in plain English and our AI will automate it.”\nWu and his co-founder Jeff An both have backgrounds in developer tooling at companies like Qualtrics and WeWork. (Wu is particularly proud of his contributions to the open source Node.js.)\nThe biggest constant for all those companies, as Wu saw it, was the problem of verifying code. “Testing has been the biggest pain point for every team I’ve ever worked with,” Wu told TechCrunch.\nMomentic’s AI-driven approach has already won over a number of clients. The company currently boasts 2,600 users across its customer base, which includes companies like Notion, Xero, Bilt, Webflow, and Retool. Wu was coy about revenue and profitability figures, but says the product has shown enough growth to convince investors.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nNotably, automating tests makes them much easier to perform at scale, and has the potential to drive up the total volume to levels that would previously have been impossible. Wu estimates that, in the last month, the company automated more than 200 million test steps.\nThe company’s biggest competitor may be the foundation models themselves. Both OpenAI and Anthropic offer tutorials on agentic testing, building on their models’ growing computer use capabilities. As those models grow more sophisticated, the opportunity for enterprise SaaS companies like Momentic could narrow.\nFor now, Wu is focused on fleshing out his product with the new funding. The company launched support for mobile environments in August, and is hoping to build more sophisticated test-case management once it has a few more engineers on board. \nAs Wu sees it, the rise of automated coding will produce a lot of new apps — and a lot more demand for products like his. “All of these apps need testing,” he said. “They care about quality, and we’re going to provide it for them.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google teams up with Accel to hunt for India’s next AI breakouts",
    "url": "https://techcrunch.com/2025/11/24/google-teams-up-with-accel-to-hunt-for-indias-next-ai-breakouts/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/google-india.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-25T00:30:00.000Z",
    "description": "Google has partnered with Accel to find and fund India’s earliest-stage AI startups in a first-of-its-kind collaboration for the Google AI Futures Fund, launched earlier this year. On Tuesday, Accel and...",
    "body": "\nGoogle has partnered with Accel to find and fund India’s earliest-stage AI startups in a first-of-its-kind collaboration for the Google AI Futures Fund, launched earlier this year. \nOn Tuesday, Accel and Google announced a partnership to jointly invest up to $2 million in each startup through Accel’s Atoms program, with both firms contributing up to $1 million. The 2026 cohort will focus on founders in India and the Indian diaspora building AI products from day one.\n“The thought process is building AI products for billions of Indians, as well as supporting AI products built in India for global markets,” Prayank Swaroop, a partner at Accel, told TechCrunch.\nIndia is an appealing market with the world’s second-largest internet and smartphone base after China and its deep engineering talent. Still, it’s also country that lacks frontier model development and hasn’t produced many companies pushing the technical frontier of AI, where development remains concentrated in the U.S. and China. \nActivity is starting to shift, however, as major firms including OpenAI and Anthropic have recently announced offices in the country, and global investors step up early-stage commitments. The bet is that a large, mobile-first population, expanding cloud infrastructure, and relatively low software costs could turn India into a meaningful AI market —if the ecosystem can translate talent and demand into original research and products.\nSwaroop said investments will be geared toward just about any area: creativity, entertainment, coding, and work. “The future of work here is more encompassing, which is essentially SaaS, and all other applications,” he told TechCrunch. “It could even be foundational models.”\nSwaroop said the firms will also try to identify areas where large language models are likely to advance over the next 12–24 months and look for Indian startups building in those directions.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAlongside capital, founders will receive up to $350,000 in compute credits across Google Cloud, Gemini, and DeepMind, as well as early access to Gemini and DeepMind models, APIs, and experimental features. The program will include support from Google Labs and DeepMind research teams, co-development opportunities, monthly mentorship with Accel partners and Google technical leads, and immersion sessions in London and the Bay Area, including Google I/O. Founders will also get marketing support through Accel and Google’s global channels, as well as access to the Atoms founder network and Google’s AI builder ecosystem, the companies said.\n“India has an incredible history of innovation, and we firmly believe that its founders are going to be playing a leading role in the next generation of AI-led global technology,” Jonathan Silber, co-founder and director of the Google AI Futures Fund, told TechCrunch. “This is the Futures Fund’s first such collaboration anywhere in the world, and we chose India for a reason. Google has been a committed partner in the country’s journey to digital transformation, with multibillion-dollar investments over the years.”\nThe partnership follows Google’s recent $15 billion plan to build a 1-gigawatt data center and AI hub in India. The company also announced a $10 billion digitization fund in 2020, which has backed firms including Bharti Airtel, Reliance Jio, and Walmart-owned Flipkart. Last month, Google partnered with Reliance to offer millions of Jio users free access to AI Pro.\nGoogle launched the AI Futures Fund in May as a dedicated vehicle to invest in and collaborate with AI startups globally. It has backed companies including Replit and Harvey, and has also invested directly in Indian startups such as Toonsutra and STAN.\nSilber told TechCrunch that Google would appear on the cap tables of startups funded through the partnership and would be “a material presence,” but declined to share how its equity stakes would compare with Accel’s.\n“This is our attempt to work with the market leader in the space who knows the country incredibly well, that can get us talking to earlier stage founders at an early informative stage, that can move the needle,” Silber said.\nWhile using Google products is, perhaps, a given for applicants to this program, both Silber and Swaroop told TechCrunch there would be no requirements for startups to exclusively use Gemini or any other Google product. \n“Sometimes, Google’s technology is the best. Other times, you’ll see Anthropic or OpenAI. So, we’re not putting firm requirements that say you can only use Google’s models,” said Silber. “What we’re hoping to do, though, is find a couple of different unique integrations that we can do with these companies that leverage Google AI technology.”\nLaunched in 2021, Accel’s pre-seed and seed platform, Atoms, has backed more than 40 companies that have collectively raised over $300 million in follow-on funding. The firm expanded the program this year to include Indian-origin founders based overseas.\nThe latest collaboration comes days after Accel’s partnership with Prosus to co-invest in Atoms X, backing early-stage Indian founders building large-scale solutions with the potential to serve the masses in the country.\nSilber told TechCrunch that Google is not structuring the partnership as a pathway to future acquisitions, or even future cloud customers.\n“We’re not a sales team, so we’re not specifically looking to sign up new cloud customers. That’s not our goal,” he said. “In terms of KPIs, our objective is simply to see the next wave of innovation in the AI space coming out of India.”\n"
  },
  {
    "title": "Facebook takes on Reddit with launch of nicknames for Facebook Groups",
    "url": "https://techcrunch.com/2025/11/24/facebook-takes-on-reddit-with-launch-of-nicknames-for-facebook-groups/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1201955892.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T15:46:16.000Z",
    "description": "Facebook Groups are getting more Reddit-like with newly added support for nicknames. The feature, which allows users to post under a custom username instead of their real name, provides an alternative to...",
    "body": "\nFacebook Groups are getting more Reddit-like with newly added support for nicknames. The feature, which allows users to post under a custom username instead of their real name, provides an alternative to posting anonymously. With anonymous posting, users can share without the post being connected to their Facebook profile and real-life identity, but this approach also doesn’t allow other group members to get to know them or their personality, or to follow their updates over time.\nImage Credits:Facebook\nMeta says that nicknames will allow people to participate in groups more personally while maintaining privacy, particularly in groups where users want privacy but still want to build a recognizable presence. It also could make Facebook Groups function more like other internet forums and message boards — like Reddit or Discord, for instance — where people post under usernames. This marks a deviation from Facebook’s long-standing “real name” policy, which has insisted that people show up on the platform with the name they use in everyday life.\nThat policy worked when Facebook was largely a social network built on top of real-world relationships with family and friends, but the addition of Facebook Groups expanded users’ circles of interactions to include online strangers, which necessitated more privacy protections.\nImage Credits:Facebook\nAfter users in a group set their nickname, they can then post, comment, and react under that nickname within groups that support the feature. This allows users to hide their main profile and profile photo from other members but not from group admins, moderators, or Facebook’s own systems.\nHowever, others in the group will be able to view a user’s complete post history under their nickname in that group, as well as the comments and reactions made in the group over the last seven days.\nFacebook will suggest nicknames to users, but users can change this nickname to one of their choosing. The name has to comply with Facebook’s Community Standards and can’t already be used by another group member. The company will also suggest a profile picture for the nickname, though users can pick their own from those available, along with selecting a colored background.\nImage Credits:Facebook\nTo access the feature, users will find the option next to “Post anonymously” when creating a post and then choose the option to customize a nickname. The option to use the nickname can be turned off at any time, allowing users to post under their real name again.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhile users can change their nickname, they can only do so once every two days. Additionally, changing a nickname doesn’t allow users to distance themselves from past posts and comments. Instead, when changed, their new nickname will be applied to their past posts, comments, and reactions, though this may take time to appear across devices and groups. If users have different nicknames in different groups, the name change will only impact the posts, comments, and reactions in the group tied to that specific nickname.\nImage Credits:Facebook\nThe company says users with nicknames can’t use some features like Live Video, content sharing, or private messaging. Users can block others by nickname, as well.\nThe feature is available globally but requires group admin approval to enable in each group.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "X-energy rides nuclear wave, raises $700M Series D",
    "url": "https://techcrunch.com/2025/11/24/x-energy-rides-nuclear-wave-raises-700m-series-d/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-124923144.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-24T18:55:53.000Z",
    "description": "Nuclear startup X-energy raised $700 million in a Series D round, the company told TechCrunch. The new fundraise comes less than a year after it expanded its Series C from $500 million to $700 million,...",
    "body": "\nNuclear startup X-energy raised $700 million in a Series D round, the company told TechCrunch.\nThe new fundraise comes less than a year after it expanded its Series C from $500 million to $700 million, bringing the total raised in the last year or so to $1.4 billion, a sizable amount even in the heady world of nuclear power startups. X-energy has raised $1.8 billion, to date.\nX-energy said the new infusion will help build the supply chain for its small modular reactors (SMR). So far, the startup says it has orders for 144 SMRs capable of generating 11 gigawatts of electricity. Customers include Amazon, Dow, and British energy company Centrica.\nThe new round was led by Jane Street, which joined as an investor in the expanded Series C. Other investors participating include Ares Management funds, ARK Invest, Corner Capital, Emerson Collective, Galvanize, Hood River Capital Management, NGP, Point72, Reaves Asset Management, Segra Capital Management, and XTX Ventures.\nX-energy is developing high-temperature, gas-cooled reactors, a type more recently used in Japan and China. Each of its Xe-100 reactors can generate 80 megawatts of electricity, and they are fueled by billiard ball-sized, carbon-coated pebbles containing uranium particles. Inside the reactor, helium gas flows over the pebbles, collecting heat, which is transferred to a steam turbine to generate electricity.\nLike other nuclear startups, X-energy has ridden a wave of interest from tech companies and data center developers.\nAmazon’s Climate Pledge Fund led the first installment of the startup’s Series C. The tech company also announced last year it would buy more than 600 megawatts of nuclear capacity in the Pacific Northwest and Virginia, with the reactors coming online in the early 2030s. Altogether, Amazon’s deal with X-energy could see as much as 5 gigawatts deployed by 2039.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nX-energy is in a race with several other SMR startups to resuscitate the nuclear industry in the United States. While many of the designs appear promising, only a handful SMR power plants have been built to date, none of which are in the United States.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  }
]