[
  {
    "title": "AI journalism startup Symbolic.ai signs deal with Rupert Murdoch’s News Corp",
    "url": "https://techcrunch.com/2026/01/15/ai-journalism-startup-symbolic-ai-signs-deal-with-rupert-murdochs-news-corp/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/01/rupert-murdoch-news-corp.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-16T00:49:54.000Z",
    "description": "In Brief Posted: 4:49 PM PST · January 15, 2026  Image Credits:Drew Angerer/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Newsrooms have been experimenting with AI for several years now...",
    "body": "\nIn Brief\nPosted:\n4:49 PM PST · January 15, 2026\n\nImage Credits:Drew Angerer/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nNewsrooms have been experimenting with AI for several years now but, for the most part, those efforts have been just that: experiments. A relatively unknown startup, Symbolic.ai, wants to change that, and it just signed a major deal with News Corp, the media conglomerate owned by Rupert Murdoch.\nNews Corp, the major assets of which include MarketWatch, the New York Post, and The Wall Street Journal, is set to begin using Symbolic’s AI platform with its financial news hub Dow Jones Newswires.\nSymbolic.ai, which was founded by former eBay CEO Devin Wenig and Ars Technica co-founder Jon Stokes, says its AI platform can “assist in the production of quality journalism and content” and that its tool has even led to “productivity gains of as much as 90% for complex research tasks.” The platform is designed to make editorial workflows more efficient, providing improvements in areas like newsletter creation, audio transcription, fact-checking, “headline optimization,” SEO advice, and others.   \nIn general, News Corp has shown a willingness to integrate AI into its media operations. In 2024, the company signed a multi-year partnership with OpenAI, wherein it would license its material to the AI company. Last November, the media conglomerate signaled that it was considering branching out, and licensing its material to other AI companies.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\n\nLatest in AI\n\n"
  },
  {
    "title": "The AI lab revolving door spins ever faster",
    "url": "https://techcrunch.com/2026/01/15/the-ai-lab-revolving-door-spins-ever-faster/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2214107176.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T22:04:02.000Z",
    "description": "AI labs just can't get their employees to stay put. Yesterday’s big AI news was the abrupt and seemingly acrimonious departure of three top executives at Mira Murati’s Thinking Machines lab.",
    "body": "\nIn Brief\nPosted:\n2:04 PM PST · January 15, 2026\n\nImage Credits:Alex Wong / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAI labs just can’t get their employees to stay put.\nYesterday’s big AI news was the abrupt and seemingly acrimonious departure of three top executives at Mira Murati’s Thinking Machines Lab. All three were quickly snapped up by OpenAI, and now it seems they won’t be the last to leave. Alex Heath is reporting that two more employees are expected to leave for OpenAI in the next few weeks.\nMeanwhile, Anthropic continues to pull alignment researchers away from OpenAI. The Verge is reporting that one of OpenAI’s senior safety research leads, Andrea Vallone, has left the company for Anthropic. Vallone specializes in how AI models respond to mental health issues — which is a particularly sensitive issue for OpenAI after its recent sycophancy problems. As The Verge notes, Vallone will be working under alignment researcher Jan Leike, who left OpenAI in 2024 over concerns the company wasn’t taking safety seriously enough.\nIf that wasn’t enough, OpenAI finished things off with one last major poach. Max Stoiber, formerly the director of engineering at Shopify, will be joining the company to work on OpenAI’s long-rumored operating system, in what he describes as a “small high-agency team.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n"
  },
  {
    "title": "Silicon Valley’s messiest breakup is definitely headed to court",
    "url": "https://techcrunch.com/2026/01/15/silicon-valleys-messiest-breakout-is-definitely-headed-to-court/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/02/GettyImages-1126475976.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-16T06:45:15.000Z",
    "description": "In Brief Posted: 10:45 PM PST · January 15, 2026  Image Credits:photopsist / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  OpenAI and Microsoft tried to dodge a courtroom showdown with Elon Musk,...",
    "body": "\nIn Brief\nPosted:\n10:45 PM PST · January 15, 2026\n\nImage Credits:photopsist / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOpenAI and Microsoft tried to dodge a courtroom showdown with Elon Musk, but a federal judge wasn’t having it, as reported earlier by Bloomberg. On Thursday she rejected their dismissal requests and set the case for a jury trial in late April, meaning they’ll officially duke it out in an Oakland courtroom, with Microsoft also dragged into the legal battle.\nThe backstory reads like a tech soap opera. Musk and Sam Altman co-founded OpenAI with others in 2015 as a nonprofit with lofty charitable goals. But those fuzzy feelings didn’t last — Musk left and in 2023 started his own AI company, xAI, and now claims his former partners betrayed their mission by taking billions from Microsoft and restructuring as a for-profit.\nThe relationships have seemingly curdled across the board. OpenAI and Microsoft remain business partners but increasingly compete head-to-head in AI. Meanwhile, Musk and Altman have gone from collaborators to arch enemies, with OpenAI dismissing Musk’s lawsuit as “baseless” and “harassment” and an attempt to slow it down.\nThe judge found enough evidence to let a jury decide whether OpenAI broke its nonprofit commitments. A jury will also now decide whether Microsoft knowingly helped OpenAI break its promises, though the judge dismissed Musk’s claim that Microsoft unjustly enriched itself at his expense.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n"
  },
  {
    "title": "Taiwan to invest $250B in US semiconductor manufacturing",
    "url": "https://techcrunch.com/2026/01/15/taiwan-to-invest-250b-in-us-semiconductor-manufacturing/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/08/taiwan-flag.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T20:52:44.000Z",
    "description": "In Brief Posted: 12:52 PM PST · January 15, 2026  Image Credits:Getty Images (Image has been modified)  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  The Trump administration signed a notable multibillion-dollar...",
    "body": "\nIn Brief\nPosted:\n12:52 PM PST · January 15, 2026\n\nImage Credits:Getty Images (Image has been modified)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe Trump administration signed a notable multibillion-dollar trade deal with Taiwan that’s designed to help the United States boost domestic semiconductor manufacturing.\nUnder the deal announced by the U.S. Department of Commerce on Thursday, Taiwanese semiconductor and tech companies have agreed to make direct investments of $250 billion into the U.S. semiconductor industry. These investments will span across semiconductors, energy, and AI “production and innovation,” according to a press release. Taiwan currently produces more than half of the world’s semiconductors.\nTaiwan will also supply an additional $250 billion in credit guarantees for additional investments from these semiconductors and tech enterprises, according to the commerce department. The time period of these investments is unclear.\nIn return, the U.S. will invest in Taiwan’s semiconductor, defense, AI, telecommunications, and biotech industries. The press release did not specify a dollar amount tied to the U.S.’s side of the deal.\nThe news comes the day after the Trump administration published a proclamation that reiterated the country’s goal to bring more semiconductor manufacturing back to the United States and acknowledged the process would take time, as only 10% of semiconductors are produced stateside.\n“This dependence on foreign supply chains is a significant economic and national security risk,” the proclamation stated. “Given the foundational role that semiconductors play in the modern economy and national defense, a disruption of import-reliant supply chains could strain the United States’ industrial and military capabilities.”\nThe proclamation, which announced 25% of tariffs on some advanced AI chips, also stated that once trade talks with other countries — like this deal with Taiwan — are complete, there would be additional semiconductor tariffs.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\n\nLatest in AI\n\n"
  },
  {
    "title": "Wikimedia Foundation announces new AI partnerships with Amazon, Meta, Microsoft, Perplexity, and others",
    "url": "https://techcrunch.com/2026/01/15/wikimedia-foundation-announces-new-ai-partnerships-with-amazon-meta-microsoft-perplexity-and-others/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/10/GettyImages-528784450.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T15:19:05.000Z",
    "description": "As part of its 25th birthday celebration, the Wikimedia Foundation announced a series of new partnerships with AI tech companies that are now customers of its commercial product, Wikimedia Enterprise....",
    "body": "\nAs part of its 25th birthday celebration, the Wikimedia Foundation announced a series of new partnerships with AI tech companies that are now customers of its commercial product, Wikimedia Enterprise. Developed by the foundation, Wikimedia Enterprise allows large-scale reuse and distribution of Wikipedia content, as well as content from other Wikimedia projects.\nIn addition to the previously announced partnership with Google in 2022, the organization shared publicly for the first time that it has formed other partnerships with Amazon, Meta, Microsoft, Mistral AI, and Perplexity over the past year. Other partnerships, like Ecosia, Pleias, and ProRata, have been mentioned before but are also included in this announcement, along with Nomic and Reef Media.\nThese deals give Wikipedia another way to sustain itself in an age where much of its content is being picked up and reused by AI models and other technology products and services to provide quick, factual answers to consumers’ queries. As an enterprise product, Wikimedia Enterprise isn’t just about getting tech companies to pay for their use; it also provides them access to Wikimedia projects at a volume and speed designed to meet their data needs. \nThe foundation also noted in a blog post that Wikipedia today is among the top 10 most-visited websites globally, where audiences view more than 65 million articles in over 300 languages, nearly 15 billion times per month.\n“Wikipedia shows that knowledge is human, and knowledge needs humans. Especially now, in the age of AI, we need the human-powered knowledge of Wikipedia more than ever,” noted Wikimedia Foundation’s CPO/CTO, Selena Deckelmann, in a statement. “With continued help from readers, volunteer editors, donors, partners, and fans across the globe, Wikipedia will remain the crucial hub for human-powered knowledge and collaboration online for the next 25 years and beyond.” \nIn addition to the tech deals announcement, the foundation launched a birthday campaign, which includes a new video docuseries offering a behind-the-scenes look at Wikipedia volunteers around the world. It also launched a “25 Years of Wikipedia” time capsule to explore the site’s past, present, and future, with some narration provided by founder Jimmy Wales. The organization will celebrate a livestreamed birthday event as well, on January 15, at 4:00 p.m. UTC, with guests, games, and entertainment. The event can be found on Wikipedia’s YouTube, TikTok, and Instagram channels.\nThe organization’s birthday announcements additionally highlighted other recent advances, like upgrades to its tech infrastructure, its own approach to AI, new experiments like games and short-form video, and more.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "AI video startup, Higgsfield, founded by ex-Snap exec, lands $1.3B valuation",
    "url": "https://techcrunch.com/2026/01/15/ai-video-startup-higgsfield-founded-by-ex-snap-exec-lands-1-3b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Higgsfield-AI-generated-image-of-woman-with-lightening-eyes.png?w=150",
    "tag": "Tech",
    "date": "2026-01-15T19:28:45.000Z",
    "description": "Through an extension to its previous $50 million Series A round that closed in September, AI video generation startup Higgsfield has sold another $80 million worth of stock, bringing its total Series A to...",
    "body": "\nThrough an extension to its previous $50 million Series A round that closed in September, AI video generation startup Higgsfield has sold another $80 million worth of stock, bringing its total Series A to $130 million. The company says it has now hit a $1.3 billion valuation.\nHiggsfield offers a tool that allows consumers, creators, and social media teams to create and edit AI-generated videos. The company was founded by Alex Mashrabov, former head of Generative AI at Snap, who landed at the company after it bought his previous startup, AI Factory, in 2020 for $166 million. Mashrabov was a co-founder of AI Factory.\nFive months after Higgsfield launched its tool, it touted 11 million users and said it was a platform of choice for content creators. Nine months in, it has now reached over 15 million users and is on a $200 million annual revenue run rate, with that figure doubling from a $100 million trajectory in about two months, it says.\nThe startup believes this puts it in rarified growth terrain, outpacing companies like Lovable, Cursor, OpenAI, Slack, and Zoom, according to its press release.\nTo position itself less as an AI slop maker and more as a business tool, Higgsfield now emphasizes that the product is primarily used by professional social media marketers, “a major sign that the platform adoption has evolved beyond casual content creation.”\nOf course, it’s still an AI slop engine as well. Last month, Higgsfield was used to create a video called “Island Holiday” that depicted people mentioned in the Epstein files alongside fictional characters on “vacation” on Epstein’s island. (Because of its offensive nature, we’re not going to link to the viral X post.)\nOn the other hand, its users also share plenty of projects centered on fashion and Hollywood-esque story telling, as well.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nInvestors in the Series A extension include Accel, AI Capital Partners, Menlo Ventures, and GFT Ventures.\n"
  },
  {
    "title": "Spotify raises its subscription prices in the US again",
    "url": "https://techcrunch.com/2026/01/15/spotify-raises-its-subscription-prices-in-the-u-s-again/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/blog-header.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T14:32:12.000Z",
    "description": "Image Credits:Spotify\t \t \t\t\t\t\t\t6:32 AM PST · January 15, 2026\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Spotify raised prices for its subscription plan in the U.S. for the third time in three years, as it hiked the monthly plan from...",
    "body": "\n\t\n\t\tImage Credits:Spotify\t\n\t\n\t\t\t\t\t\t6:32 AM PST · January 15, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSpotify raised prices for its subscription plan in the U.S. for the third time in three years, as it hiked the monthly plan from $11.99 per month to $12.99 per month.\nThe company sent an email to its paid users notifying them of the new price, which is applicable from the next monthly billing cycle.\nImage Credits:Spotify\n“Occasional updates to pricing across our markets reflect the value that Spotify delivers, enabling us to continue offering the best possible experience and benefit artists,” the company said in a blog post.\nIn November 2025, the Financial Times reported that the audio platform is set to raise prices in the U.S in the first quarter of 2026. According to the report, analysts from JPMorgan predicted that this hike could increase Spotify’s revenue by $500 million.\nThe company has made similar hikes in markets like the U.K. and Switzerland last year.\nSpotify first hiked prices in the U.S. in 2023, going from $9.99 per month to $10.99 per month. In June 2024, it made another bump of $1 per month in the individual subscription plan.\nThe company has more than 281 million paid users all over the globe, and 25% of them are from North America, according to its Q3 2025 results.\nBesides the U.S., Spotify is raising prices in Estonia and Latvia.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Mira Murati’s startup, Thinking Machines Lab, is losing two of its co-founders to OpenAI",
    "url": "https://techcrunch.com/2026/01/14/mira-muratis-startup-thinking-machines-lab-is-losing-two-of-its-co-founders-to-openai/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/11/GettyImages-1258711804.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T02:16:37.000Z",
    "description": "Former OpenAI exec Mira Murati’s startup, Thinking Machines Lab, is saying goodbye to two of its co-founders, both of whom are headed back to OpenAI. Another former OpenAI staffer who went to work for...",
    "body": "\nFormer OpenAI exec Mira Murati’s startup, Thinking Machines Lab, is saying goodbye to two of its co-founders, both of whom are headed back to OpenAI. Another former OpenAI staffer who went to work for Murati’s startup is also headed back to the company.\nOn social media on Wednesday, Murati announced the departure of Barret Zoph, the company’s co-founder and CTO. “We have parted ways with Barret Zoph,” Murati said in a post on X. “Soumith Chintala will be the new CTO of Thinking Machines. He is a brilliant and seasoned leader who has made important contributions to the AI field for over a decade, and he’s been a major contributor to our team. We could not be more excited to have him take on this new responsibility.”\nMurati’s announcement made no mention of other departures.\nJust 58 minutes after Murati’s announcement of Zoph’s departure, Fidji Simo, OpenAI’s CEO of applications, announced that Zoph would be headed back to OpenAI. “Excited to welcome Barret Zoph, Luke Metz, and Sam Schoenholz back to OpenAI! This has been in the works for several weeks, and we’re thrilled to have them join the team,” Simo wrote on X.\nMetz is another co-founder of Thinking Machines and previously worked for OpenAI for a number of years on the company’s technical staff. So did Schoenholz, whose LinkedIn profile still lists him as working for Thinking Machines.\nZoph previously worked for OpenAI as VP of research, and before that, worked for six years at Google as a research scientist. Murati, who served as the CTO of OpenAI until September 2024, left the company and co-founded Thinking Machines with Zoph and Metz. The startup, where Murati serves as CEO, has amassed significant financial support since then, closing a $2 billion seed round last July, with participation from Andreessen Horowitz, which led the round, as well as Accel, Nvidia, AMD, and Jane Street, among others. The round valued the company at $12 billion.\nTechCrunch has reached out to both Thinking Machines and OpenAI for comment. Wired reports that the split between Zoph and Thinking Labs wasn’t amicable. Certainly, it’s telling that Murati didn’t write more in her public messaging about his departure from the company.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhile talent moves between AI giants are common in Silicon Valley, the departure of co-founders from a startup less than a year after its founding is particularly notable. The loss of two co-founders simultaneously — especially when one served as CTO — could be perceived as a particularly meaningful setback for Thinking Machines, which had assembled a high-profile team of former OpenAI, Meta, and Mistral AI researchers.\nThe company has also lost other key personnel, including co-founder Andrew Tulloch, who left to join Meta in October. OpenAI itself has seen numerous co-founders depart to launch or join competing ventures, including John Schulman, who left for Anthropic in August 2024 before joining Thinking Machines as chief scientist at its launch in February of last year.\n\n\n\t\n\t\tLucas is a senior writer at TechCrunch, where he covers artificial intelligence, consumer tech, and startups. He previously covered AI and cybersecurity at Gizmodo. \nYou can contact Lucas by emailing lucas.ropek@techcrunch.com.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "After Italy, WhatsApp excludes Brazil from rival chatbot ban",
    "url": "https://techcrunch.com/2026/01/15/after-italy-whatsapp-excludes-brazil-from-rival-chatbot-ban/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/07/Green-white-apple-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T12:23:07.000Z",
    "description": "WhatsApp is allowing AI providers to continue offering their chatbots to users in Brazil, days after the country's competition agency ordered the company to suspend its new policy that bars third-party, general-purpose chatbots from the app.",
    "body": "\n\t\t\t\t\t\t4:23 AM PST · January 15, 2026\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\nWhatsApp is allowing AI providers to continue offering their chatbots to users with Brazilian phone numbers, days after the country’s competition regulator ordered Meta to suspend its new policy that bars third-party, general-purpose chatbots from being offered on the app via its business API.\nUnder the new policy, the company is providing a 90-day grace period starting January 15 to developers and AI providers, mandating them to cease responding to user queries on the chat app and notify users that their chatbots won’t work on WhatsApp.\nNow Meta told developers that they don’t have to notify users with Brazilian phone numbers (with code +55) of any changes or cease offering their services, per a notice to AI providers seen by TechCrunch.\n“The requirement to cease responding to user queries and implement pre-approved auto-reply language (mentioned below) before January 15, 2026, no longer applies when messaging people with a Brazil country code (+55),” the notice reads.\nWhatsApp did not immediately respond to a query seeking to confirm the decision.\nThe policy, which goes into effect from today, impacts general-purpose chatbots like ChatGPT and Grok on the platform. Notably, the policy does not stop businesses from providing customer service via bots within WhatsApp to their customers.\nIn its notice, Brazil’s competition agency said it would investigate if Meta’s terms are exclusionary to competitors and unduly favor Meta AI, the company’s chatbot that’s offered on WhatsApp.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMeta has previously provided a similar exemption to users in Italy after the country’s competition agency took issue with the policy in December. Separately, the EU has also opened an antitrust investigation into the new rules.\nThe company has consistently maintained that AI chatbots are straining its systems that were designed for different uses of its business API. Meta has even said in the past that people who want to use different chatbots can do so outside WhatsApp.\n“These claims are fundamentally flawed,” a WhatsApp spokesperson said in response to CADE’s probe on Tuesday. “The emergence of AI chatbots on our Business API put a strain on our systems that they were not designed to support. This logic assumes WhatsApp is somehow a de facto app store. The route to market for AI companies is the app stores themselves, their websites and industry partnerships; not the WhatsApp Business Platform.” \n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Anthropic taps former Microsoft India MD to lead Bengaluru expansion",
    "url": "https://techcrunch.com/2026/01/15/anthropic-taps-former-microsoft-india-md-to-lead-bengaluru-expansion/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/anthropic-image-jagmeet-singh-techcrunch.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-16T07:28:25.000Z",
    "description": "Anthropic has appointed Irina Ghose, a former Microsoft India managing director, to lead its India business as the U.S. AI startup prepares to open an office in Bengaluru. The move underscores how India is...",
    "body": "\nAnthropic has appointed Irina Ghose, a former Microsoft India managing director, to lead its India business as the U.S. AI startup prepares to open an office in Bengaluru. The move underscores how India is becoming a key battleground for AI companies looking to expand beyond the U.S. for major growth markets.\nGhose brings deep big-tech operating experience to the role. She spent 24 years at Microsoft before stepping down in December 2025. Her appointment gives Anthropic a seasoned executive with local enterprise and government relationships as it gears up to establish an on-the-ground presence in one of the world’s fastest-growing AI markets.\nIndia has become one of Anthropic’s most strategically important markets, with the country already ranking as the second-largest user base for Claude and usage heavily skewing toward technical and work-related tasks, including software development. Arch-rival OpenAI is also sharpening its focus on the market with plans to open an office in New Delhi — a sign India is fast becoming one of the most contested arenas in the global race to commercialize generative AI.\nWhile India offers enormous scale — with more than a billion internet subscribers and over 700 million smartphone users — converting that reach into meaningful revenue has proven difficult, pushing AI companies to experiment with aggressive pricing and promotions. OpenAI last year introduced ChatGPT Go, its under-$5 plan aimed at attracting Indian users, and later made it available free for a year in the country.\nSimilar dynamics are playing out for Anthropic: its Claude app recorded a 48% increase from the previous year in downloads in India in September, reaching about 767,000 installs, while consumer spending surged 572% to $195,000 for the month, per Appfigures — still modest compared with the U.S., where September spending hit $2.5 million.\nAnthropic has been stepping up its engagement in India at the highest levels. Chief executive Dario Amodei visited in October and met corporate executives and lawmakers, including Prime Minister Narendra Modi, to discuss the company’s expansion plans and growing adoption of its tools. Anthropic had also explored a potential partnership with billionaire Mukesh Ambani’s Reliance Industries to broaden access to Claude, as TechCrunch reported previously. Reliance, however, ultimately struck a deal with Google to offer its Gemini AI Pro plan free to Jio subscribers. That move came as rival Bharti Airtel partnered with Perplexity to bundle access to its premium subscription, underscoring how India’s telecom giants have become critical distribution gatekeepers in the race to scale consumer AI services.\nIn a LinkedIn post announcing the move, Ghose said she would focus on working with Indian enterprises, developers and startups adopting Claude for “mission-critical” use cases, pointing to growing demand for what she described as “high-trust, enterprise-grade AI.” She added that AI tailored to local languages could be a “force multiplier” across sectors including education and healthcare — signaling Anthropic’s intent to deepen adoption beyond early tech users into larger institutions and the public sector.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe push by Anthropic, OpenAI, and Perplexity comes as India’s homegrown GenAI ecosystem remains relatively early-stage. While the country has a deep pool of software talent and a fast-growing base of AI users, it has produced few startups building large foundation models, with investors instead largely backing application-layer companies rather than committing the scale of capital typically required to train frontier systems.\nThe appointment also comes ahead of India’s AI Impact Summit 2026 in February, where the Indian government is expected to bring together AI startups, global CEOs, and industry experts to discuss the next phase of AI deployment in the country. The summit is part of New Delhi’s broader effort to signal support for domestic AI development and position India as a serious player in the global AI landscape, as competition intensifies across major markets.\nAnthropic is also building out its India team, with job listings for roles including startup and enterprise account executives as well as a partner sales manager, signaling a push to deepen its go-to-market efforts and tap Indian businesses and startups as customers as it expands its presence in the country.\nFor Anthropic, the hire adds senior local leadership as it looks to turn India’s surging usage into a durable business, navigating a market where distribution partnerships, pricing pressure, and enterprise adoption will shape which AI players emerge as long-term winners.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The US imposes 25% tariff on Nvidia’s H200 AI chips headed to China",
    "url": "https://techcrunch.com/2026/01/15/the-us-imposes-25-tariff-on-nvidias-h200-ai-chips-headed-to-china/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T16:56:20.000Z",
    "description": "After months of rumors that the Trump administration was going to impose tariffs on semiconductors, a tariff has been announced for some chips. The tariff only applies to certain semiconductors, including the...",
    "body": "\nAfter months of rumors that the Trump administration was going to impose tariffs on semiconductors, a tariff has been announced for some chips. The tariff only applies to certain semiconductors, including the Nvidia H200 advanced AI chips set to ship to China.\nPresident Donald Trump signed a proclamation on Wednesday that entailed a 25% tariff on advanced AI semiconductors that have been produced outside the U.S. and then pass through the U.S. before being exported to customers in other countries.\nThis news formalizes a key component of the U.S. Department of Commerce’s decision to give Nvidia the green light to start shipping its H200 advanced AI chips to vetted customers in China in December. It also includes chips from other companies, including the AMD MI325X.\nIn spite of the tariffs, Nvidia publicly cheered the move, which allows it to sell the chip to approved customers.\n“We applaud President Trump’s decision to allow America’s chip industry to compete to support high-paying jobs and manufacturing in America. Offering H200 to approved commercial customers, vetted by the Department of Commerce, strikes a thoughtful balance that is great for America,” an Nvidia spokesperson emailed TechCrunch.\nThere is demand for these H200 semiconductors. Nvidia was reportedly considering ramping up production on these chips due to a rush of early orders from Chinese companies.\nDemand is just one factor, though. The other is how the Chinese government decides to regulate these imports.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nChina finds itself in a similar, yet different situation to the U.S. when it comes to chip production and the global AI race. China wants to boost its domestic semiconductor industry, but the country also doesn’t want to fall behind while it waits for its domestic tech to catch up to international rivals.\nThe Chinese central government is working to draft rules and guidelines of how many semiconductors Chinese companies can purchase from overseas, according to reporting from Nikkei Asia. This would allow for some purchasing of Nvidia’s chips and would be a reversal from the country’s current adversity toward the chip imports.\nWednesday’s executive order does not apply to chips that are imported into the U.S. and then used in the country for research, defense, or commercial purposes.\n“The United States currently fully manufactures only approximately 10% of the chips it requires, making it heavily reliant on foreign supply chains. This dependence on foreign supply chains is a significant economic and national security risk,” the proclamation stated. \n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Iran’s internet shutdown is now one of its longest ever, as protests continue",
    "url": "https://techcrunch.com/2026/01/15/irans-internet-shutdown-is-now-one-of-its-longest-ever-as-protests-continue/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/iran-protests-2.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T18:47:52.000Z",
    "description": "As of Thursday, 92 million Iranians have been completely blocked from accessing the internet for more than a week, in what is now one of the longest nationwide internet shutdowns ever, according to...",
    "body": "\nAs of Thursday, 92 million Iranians have been completely blocked from accessing the internet for more than a week, in what is now one of the longest nationwide internet shutdowns ever, according to experts.\nLast Thursday, Iran’s leadership blocked internet and phone access across the whole country in response to massive anti-government protests, which began at the end of last year and have prompted a brutal and deadly crackdown from authorities. \nAs of this writing, Iranians have not been able to access the internet for more than 170 hours. The previous longest shutdowns in the country lasted around 163 hours in 2019, and 160 hours in 2025, according to Isik Mater, the director of research at NetBlocks, a web monitoring company that tracks internet disruptions. \nMater said that the current shutdown in Iran is the third longest on record, after the internet shutdown in Sudan in mid-2021 that lasted around 35 days, followed by the outage in Mauritania in July 2024, which lasted 22 days. \n“Iran’s shutdowns remain among the most comprehensive and tightly enforced nationwide blackouts we’ve observed, particularly in terms of population affected,” Mater told TechCrunch. \nThe exact ranking depends on how each organization measures a shutdown. \nZach Rosson, a researcher who studies internet disruptions at the digital rights nonprofit Access Now, told TechCrunch that according to its data, the ongoing shutdown in Iran is on a path to crack the top 10 longest shutdowns in history. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIran’s government has a long track record of shutting down access to the internet at times of protest and civil unrest, often making it more difficult to monitor the protests from outside of the country. \nA U.S.-based human rights group estimates that there have been more than 600 protests in cities across Iran, and according to one estimate, the Iranian government’s violent crackdown has led to the deaths of at least 2,000 people.\nThe shutdown in Iran on January 8 was sudden, cutting government institutions like the foreign ministry from the internet. Since then, some government departments, and some parts of the economy, such as bank transfers and payment processors at gas stations, had their access restored, as The Financial Times reported this week.\nAccording to The Guardian, a relatively small but unknown number of Iranians have been using Starlink terminals smuggled into the country to connect to the internet. In 2022, the Biden administration carved an exemption to the U.S. government’s sanctions against Iran to “increase support for internet freedom,” and allow U.S. tech companies to provide connectivity to Iranians for free, paving the way for Starlink to operate in Iran. \nAuthorities have since cracked down on Starlink users by making it illegal to own a Starlink terminal, jamming entire neighborhoods, and confiscating the devices.\nThis week, President Donald Trump threatened military intervention if Iranian forces continue to use violence, all the while reducing personnel at a military base in neighboring Qatar, amid concerns of a possible retaliatory strike. The U.S. military also reportedly redirected a naval strike group from the South China Sea to the Middle East. \nOn Wednesday, however, Trump said he had information that “the killing has stopped and the executions won’t take place,” but conceded that, “who knows?”\nMeanwhile, the United Kingdom shuttered its embassy in Iran’s capital Tehran and evacuated its staff. Iran temporarily closed off its airspace on Wednesday.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Parloa triples its valuation in 8 months to $3B with $350M raise",
    "url": "https://techcrunch.com/2026/01/15/parloa-triples-its-valuation-in-8-months-to-3b-with-350m-raise/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/2024-MAIN-Parloa-founders-Stefan-Ostwald-Malte-Kosub_1_crop-e1713945437512.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T14:24:46.000Z",
    "description": "Berlin-based Parloa has raised $350 million in Series D funding from existing investors, valuing the six-year-old customer service AI startup at $3 billion. The round comes just eight months after the company...",
    "body": "\nBerlin-based Parloa has raised $350 million in Series D funding from existing investors, valuing the six-year-old customer service AI startup at $3 billion. The round comes just eight months after the company raised $120 million at a $1 billion valuation.\nThe new round was led by General Catalyst, with participation from returning backers, including EQT Ventures, Altimeter Capital, Durable Capital, and Mosaic Ventures.\nParloa is one of many startups developing AI agents that promise to automate the kind of customer service work previously handled by human representatives and help desk staff.\nThe company’s competitors include Sierra, co-founded by OpenAI chairman Bret Taylor, which raised $350 million at a $10 billion valuation in September; and Decagon, reportedly in talks to raise capital at a valuation of upward of $4 billion. Other companies working to replace human agents with AI include older players Intercom and Kore.ai, as well as the U.K.-based PolyAI, which raised an $86 million round at a $750 million valuation last month.\nMalte Kosub, Parloa’s co-founder and CEO, doesn’t seem fazed by the competition, largely because he doesn’t believe this is a “winner-take-all” category. “In the end, it is one of the biggest opportunities that has ever existed in software,” he told TechCrunch.  \nIndeed, Parloa and its rivals are vying to automate a significant portion of the global customer support workforce, which Gartner estimates at 17 million contact center agents worldwide.\nBut it’s not just the size of the market that gives Kosub confidence about Parloa’s ability to win. He pointed to the startup’s massive fundraise as a sign that it could be among the top leaders in the space. “There are a lot of companies out there, but you need to look at the scale and the amount of funding they got,” he said. “The number of competitors is decreasing significantly.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLast month, Parloa said that it was generating annual recurring revenue of more than $50 million, but that’s not meaningfully ahead of Poly AI, which expected to end 2025 with ARR of $40 million, or Decagon, which is reportedly making “significantly more” than $30 million in ARR. Still, Kosub seems convinced that being so well capitalized will help his startup get ahead.\nParloa’s AI agents are already answering calls for large enterprise customers, which include Allianz, Booking.com, HealthEquity, SAP, Sedgwick, and Swiss Life, but the CEO says the goal is to do more than just build software that “picks up the phone.”\nThe company will invest a significant portion of its new capital into building a “multi-model, contextual experience” that will allow personalized AI agents to recognize a customer’s identity and specific needs, whether they reach out via an app, a website, or a phone call.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Indian SpaceX rival EtherealX hits 5x valuation as it readies engine tests",
    "url": "https://techcrunch.com/2026/01/15/etherealx-jumps-5-5x-in-valuation-on-spacex-style-reuse-bet-from-india/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/etherealx-reusable-rocket.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T12:00:00.000Z",
    "description": "Ethereal Exploration Guild, an Indian space tech better known as EtherealX, has climbed 5.5x in valuation to $80.5 million after its latest funding round. The startup is developing a launch vehicle designed...",
    "body": "\nEthereal Exploration Guild, an Indian space tech better known as EtherealX, has climbed 5.5x in valuation to $80.5 million after its latest funding round. The startup is developing a launch vehicle designed to be fully reusable and is readying engine hot-fire tests ahead of its first technology demonstration flight, planned for 2027.\nThe Bengaluru-based company confirms that it closed an oversubscribed $20.5 million Series A round led by TDK Ventures and BIG Capital, as TechCrunch reported earlier. Accel, Prosus, YourNest, BlueHill, Campus Fund, and Riceberg Ventures also participated, EtherealX said. The raise follows a $5 million seed round in August 2024 that valued the startup at $14.6 million.\nAs India pushes to mature its space ecosystem beyond small launchers and component contracts — targeting growth in its space economy to $45 billion from $8 billion over the next decade — EtherealX is among the  startups drawing attention.\nSatellite operators worldwide are looking for more launch capacity and scheduling flexibility in a market where SpaceX’s Falcon 9 has set the benchmark for pricing and cadence. EtherealX is aiming for that space with its fully reusable vehicle designed to return both the booster and upper stage. That’s an approach that, if proven, could cut per-launch costs and increase flight frequency without relying on a native constellation to keep rockets fully booked.\nEtherealX is developing two engines in-house: the 80-kilonewton “Pegasus” upper-stage engine and the 1.2-meganewton “Stallion” booster engine, with hot-fire tests targeted for June–July. Thrust, measured in kilonewtons and meganewtons, indicates how much lifting force an engine can generate.\nThe startup is targeting a November–December 2027 launch window for a technology demonstration vehicle, ahead of commercial missions expected to begin toward the end of 2028, co-founder and CEO Manu J. Nair said in an interview.\nRocket engineers also track specific impulse, a widely used proxy for fuel efficiency, which — along with thrust — helps determine how much payload a vehicle can carry for a given amount of propellant.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe Pegasus engine produces 323 seconds of vacuum-specific impulse and uses what the startup describes as a proprietary “full-flow segregated cooling cycle.” The engine integrates an in-house additively manufactured turbopump. Furthermore, the Stallion booster engine uses a gas-generator cycle and delivers 306 seconds of sea-level specific impulse.\nEtherealX’s additively manufactured turbopump assembly designed for the upper-stage engine.Image Credits:EtherealX\nNair told TechCrunch that EtherealX plans to cluster multiple engines per stage for its main medium-lift vehicle, called Razor Crest Mk-1, with nine Stallion engines on the booster and 15 Pegasus engines on the upper stage.\nFor comparison, SpaceX’s Falcon 9 primarily reuses its first-stage booster while expending the upper stage. EtherealX is targeting deeper reusability by designing its vehicle to return both the booster and the upper stage.\nEtherealX’s vehicle aims to carry up to 24.8 tons in an expendable configuration, 22.8 tons partially reusable, and about 8 tons when fully reusable. The startup is targeting pricing of $350 to $2,000 per kilogram over time, Nair said, depending on configuration and cadence.\nTo support development, EtherealX operates a rocket engine test site in the southern Indian state of Tamil Nadu, known as Base 001, which Nair said is focused on upper-stage engine qualification. The startup has also secured a 150-acre manufacturing and testing campus in Andhra Pradesh’s proposed space city that it expects to become operational from mid-2026 for integrated engine and stage testing.\nEtherealX has signed launch memoranda of understanding totaling around $130 million with customers, including Japan’s Space BD and Taiwan’s space agency, TASA, Nair said, as it seeks early commercial demand ahead of its first demonstration flight.\nThe latest funding will be used to complete flight qualification of the Stallion booster engine and to run clustered-firing tests of the Pegasus upper-stage engines, Nair said. To support that ramp-up, the startup currently employs 67 people and expects to grow to about 90 over the next two months as it increases manufacturing capacity and moves to a higher testing cadence ahead of its first demonstration flight.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The FTC’s data-sharing order against GM is finally settled",
    "url": "https://techcrunch.com/2026/01/14/the-ftcs-data-sharing-order-against-gm-is-finally-settled/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/gm-onstari.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-15T00:27:54.000Z",
    "description": "The Federal Trade Commission said Wednesday it has finalized an order that bans General Motors and its OnStar telematics service from sharing certain consumer data with consumer reporting agencies. The...",
    "body": "\nThe Federal Trade Commission said Wednesday it has finalized an order that bans General Motors and its OnStar telematics service from sharing certain consumer data with consumer reporting agencies. The finalized order, which comes a year after the agency reached a proposed settlement with GM, also requires the automaker to be more transparent with its consumers and obtain their explicit consent on certain data collection.\nThe finalized order comes nearly two years after a New York Times report showed how GM and OnStar collected, used, and sold drivers’ precise geolocation data and driving behavior to third parties, including data brokers LexisNexis and Verisk. The data was collected through GM’s Smart Driver program, a free feature contained within its connected car apps that tracked and rated driving behaviors and seatbelt use. Data brokers sold this information to insurance providers, which could affect customers’ rates, the NYT reported at the time.\nGM discontinued the Smart Driver program in April 2024 across all of its brands, citing customer feedback. GM said at the time it unenrolled all customers and ended its third-party telematics relationships with LexisNexis and Verisk.\nThe FTC alleged that GM and OnStar used a misleading enrollment process to get consumers to sign up for its OnStar connected vehicle service and OnStar Smart Driver feature. The FTC also alleged the automaker failed to clearly disclose that the data would be collected and sold to third parties.\nUnder the order finalized Wednesday, GM is also required to obtain explicit consent from consumers prior to collecting, using, or sharing connected vehicle data. This process occurs at the dealership when a consumer buys a car from a GM brand. At that point, the OnStar system is linked to that particular vehicle VIN number and the new owner is asked whether they agree or not with data collection, according to GM.\nThere are some exceptions to the data collection ban, however. GM is allowed to share location data with emergency first responders and for internal research, the FTC said. GM confirmed this, noting it collects data for internal research and development and sometimes shares de-identified, or anonymized data (not associated with specific drivers or vehicles) with select partners to enhance city infrastructure and improve road safety. For instance, data has been shared with the University of Michigan, which used it for urban planning. \nGM must also establish a way for all U.S. consumers to request a copy of their data and seek its deletion and give them the ability to disable the collection of precise geolocation data from their vehicles. GM says it has already complied with these mandates.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nGM says it began overhauling its policies and programs on data collection and privacy in 2024. For instance, the automaker said it has consolidated many of its U.S. privacy statements into a single, simpler statement and expanded its privacy program that allows customers to access and delete their personal information.\n“The Federal Trade Commission has formally approved the agreement reached last year with General Motors to address concerns,” an emailed statement from GM reads. “As vehicle connectivity becomes increasingly integral to the driving experience, GM remains committed to protecting customer privacy, maintaining trust, and ensuring customers have a clear understanding of our practices.” \nCorrection: The previous article incorrectly stated GM would be required to obtain their explicit consent on any data collection. The requirement is for certain data. \n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]