[
  {
    "title": "Amazon appoints longtime AWS exec Peter DeSantis to lead new AI org",
    "url": "https://techcrunch.com/2025/12/17/amazon-appoints-longtime-aws-exec-peter-desantis-to-lead-new-ai-org/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/amazon-data-center.png?w=150",
    "tag": "Tech",
    "date": "2025-12-17T18:06:29.000Z",
    "description": "In Brief Posted: 10:06 AM PST · December 17, 2025  Image Credits:Amazon  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Amazon CEO Andy Jassy announced in a message to staff on Wednesday that longtime AWS...",
    "body": "\nIn Brief\nPosted:\n10:06 AM PST · December 17, 2025\n\nImage Credits:Amazon\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAmazon CEO Andy Jassy announced in a message to staff on Wednesday that longtime AWS executive Peter DeSantis will lead a new AI-focused organization within the company.\nThis organization will be responsible for Amazon’s AI models like Nova, as well as silicon development and quantum computing, which help make AI tools faster and more efficient.\nDeSantis has spent 27 years at Amazon, including eight years as an SVP for AWS, the cloud provider that powers about one-third of the internet. At AWS’s recent re:Invent event, Amazon hammered home its commitment to AI for enterprise use, so it makes sense that the company is spinning out a new team from AWS leadership.\n“With our Nova 2 models just launched at re:Invent, our custom silicon growing rapidly, and the advantages of optimizing across models, chips, and cloud software and infrastructure, we wanted to free Peter up to focus his energy, invention cycles, and leadership on these new areas,” Jassy wrote.\nAmazon’s increasing emphasis on AI comes at a time when the company is eager to strengthen its foothold in the AI race, perhaps more through investments than its own innovations. Last month, AWS announced a $50 billion investment in the U.S. government’s AI infrastructure. Amazon is also reportedly in talks to invest $10 billion in OpenAI, and has already invested $8 billion in OpenAI rival Anthropic.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Jared Isaacman confirmed as next head of NASA",
    "url": "https://techcrunch.com/2025/12/17/jared-isaacman-confirmed-as-next-head-of-nasa/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/02/Jared_Isaacman_at_SpaceX_2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T21:52:17.000Z",
    "description": "In Brief Posted: 1:52 PM PST · December 17, 2025  Image Credits:SpaceX  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Billionaire entrepreneur Jared Isaacman has been confirmed by the U.S. Senate as the next...",
    "body": "\nIn Brief\nPosted:\n1:52 PM PST · December 17, 2025\n\nImage Credits:SpaceX\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nBillionaire entrepreneur Jared Isaacman has been confirmed by the U.S. Senate as the next administrator of NASA. The private astronaut and founder of the Shift4 payments processing platform will now be in charge of an agency that faces great uncertainty under President Trump.\nIsaacman’s confirmation comes a little over a year after Trump nominated him. It was a volatile year for Isaacman, though, as Trump pulled his nomination in June after becoming concerned about the billionaire’s “prior associations.” (Isaacman had previously donated to Democrats, something Trump was reportedly aware of when he first nominated the entrepreneur.)\nThat led to months of sniping between Trump’s camp and people more closely aligned with Isaacman, like SpaceX CEO Elon Musk, who publicly attacked the credibility of acting NASA administrator Sean Duffy. Trump ultimately flipped in November and re-nominated Isaacman. \nThe billionaire will now oversee a trimmed-down space agency that Trump has tasked with returning to the moon. SpaceX has a contract to land astronauts on the lunar surface, though Duffy had threatened to revoke that contract, and encouraged Jeff Bezos’ rival company Blue Origin to try to beat Musk’s effort.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Space\n"
  },
  {
    "title": "Warner Bros. Discovery rejects Paramount’s hostile bid, calls offer ‘illusory’",
    "url": "https://techcrunch.com/2025/12/17/warner-bros-discovery-rejects-paramounts-hostile-bid-calls-offer-illusory/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/warner-bros.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T15:30:22.000Z",
    "description": "In Brief Posted: 7:30 AM PST · December 17, 2025  Image Credits:Victor J. Blue/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Warner Bros. Discovery’s (WBD) board of directors has...",
    "body": "\nIn Brief\nPosted:\n7:30 AM PST · December 17, 2025\n\nImage Credits:Victor J. Blue/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWarner Bros. Discovery’s (WBD) board of directors has rejected the $108 billion hostile takeover bid from David Ellison’s Paramount Skydance, calling the offer “illusory,” and saying that Paramount had misled shareholders about its financing.\nSaying it wants to honor its initial agreement to sell to Netflix, WBD’s board wrote in a letter to shareholders that Paramount “has consistently misled WBD shareholders that its proposed transaction has a ‘full backstop’ from the Ellison family.” \n“It does not, and never has,” the letter reads.\nWBD’s board said Paramount’s tender offer remains “inferior to the Netflix merger” and noted that Netflix’s $27.75-per-share offer for Warner Bros’ Hollywood studios and streaming business “is a binding agreement with enforceable commitments, with no need for any equity financing and robust debt commitments.”\nNetflix welcomed the move. “The Warner Bros. Discovery board reinforced that Netflix’s merger agreement is superior and that our acquisition is in the best interests of stockholders,” said Netflix co-CEO Ted Sarandos in a statement.\nParamount and Ellison’s backers, including his father, tech billionaire Larry Ellison, will review WBD’s rejection and determine whether to raise their offer, Variety reports.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Media & Entertainment\n"
  },
  {
    "title": "Amazon reportedly in talks to invest $10B in OpenAI as circular deals stay popular",
    "url": "https://techcrunch.com/2025/12/17/amazon-reportedly-in-talks-to-invest-10b-in-openai-as-circular-deals-stay-popular/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2214107176.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T12:03:36.000Z",
    "description": "In Brief Posted: 4:03 AM PST · December 17, 2025  Image Credits:Alex Wong / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Amazon is in early discussions to invest as much as $10 billion in OpenAI in...",
    "body": "\nIn Brief\nPosted:\n4:03 AM PST · December 17, 2025\n\nImage Credits:Alex Wong / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAmazon is in early discussions to invest as much as $10 billion in OpenAI in a deal that would see the AI lab using the e-commerce giant’s AI chips, CNBC reported. \nIf it materializes, the deal would value OpenAI at more than $500 billion, Bloomberg reported, citing an anonymous source. The Information was first to report on the story.\nAmazon has been looking to diversify its bets in the AI race, which has so far seen it partner up with and invest $8 billion in Anthropic, a rival to OpenAI. The e-commerce giant earlier this month also unveiled the latest iteration in its Trainium series of chips, and outlined the development of the next installment of those chips, complementing its cloud computing offerings via Amazon Web Services.\nNews of the deal comes a couple months after OpenAI completed its transition to a for-profit model, which gives it more freedom to strike deals with investors other than Microsoft, one of the company’s earliest backers with a stake of 27%.\nAmazon investing in OpenAI would mark the latest in a series of circular deals in the AI space — major hardware manufacturers and cloud providers strike deals with young AI companies to use their products, while the upstarts commit to using their data centers and chips for training their AI models. \nThis past March, OpenAI invested $350 million of equity into CoreWeave, which used the funds to buy chips from its backer Nvidia. Those same chips provide compute to OpenAI, which increases CoreWeave’s revenue and in the end makes OpenAI’s stake more valuable. Then in October, OpenAI signed a deal to pick up a 10% stake in AMD and committed to using the chipmaker’s AI GPUs, and also signed a chip usage agreement with Broadcom that month. And in November, the ChatGPT maker signed a $38 billion cloud computing deal with Amazon.\nOpenAI and Amazon did not immediately respond to requests for comment.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Google’s vibe-coding tool Opal comes to Gemini",
    "url": "https://techcrunch.com/2025/12/17/googles-vibe-coding-tool-opal-comes-to-gemini/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/Google-Opal.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T15:16:42.000Z",
    "description": "Google’s vibe-coding tool, Opal, is making its way to Gemini. The company on Wednesday said it is integrating the tool, which lets you build AI-powered mini apps, inside the Gemini web app, allowing users to...",
    "body": "\nGoogle’s vibe-coding tool, Opal, is making its way to Gemini. The company on Wednesday said it is integrating the tool, which lets you build AI-powered mini apps, inside the Gemini web app, allowing users to create their own custom apps, which Google calls Gems.\nIntroduced in 2024, Gems are customized versions of Gemini designed for specific tasks or scenarios. For instance, some of Google’s pre-made Gems include a learning coach, a brainstorming assistant, a career guide, a coding partner, and an editor.\nOpal, meanwhile, focuses on helping users create mini-apps or mix existing apps. To use the feature, users describe in natural language the app they want to make, and the tool will use the different Gemini models to create it.\nNow, Opal is directly available from Gemini on the web, where it’s found in the Gems manager. The tool has a visual editor that lays out the steps required to create an application. From the editor, users can rearrange steps and link them together, without writing code.\nGoogle notes that the visual editor also includes a new view in Gemini that will take the user’s written prompts and turn them into a list of steps. This makes it even easier to build apps and see how they work.\nFor more advanced customization options, users can move from Gemini to the Advanced Editor at opal.google.com. The mini apps can be reused after they’re created.\nKnown as “vibe-coding,” using AI to program and make apps has skyrocketed in popularity over the past couple of years. The market now has apps from startups like Lovable and Cursor, as well as offerings from AI providers like Anthropic and OpenAI. There are also tools focused more directly on consumers, like those from AI-powered app-building startup Wabi.\nGemini’s web app is available at gemini.google.com.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Adobe hit with proposed class-action, accused of misusing authors’ work in AI training",
    "url": "https://techcrunch.com/2025/12/17/adobe-hit-with-proposed-class-action-accused-of-misusing-authors-work-in-ai-training/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/GettyImages-2162453288.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-18T00:44:55.000Z",
    "description": "Like pretty much every other tech company in existence, Adobe has leaned heavily into AI over the past several years. The software firm has launched a number of different AI services since 2023, including...",
    "body": "\nLike pretty much every other tech company in existence, Adobe has leaned heavily into AI over the past several years. The software firm has launched a number of different AI services since 2023, including Firefly—its AI-powered media-generation suite. Now, however, the company’s full-throated embrace of the technology may have led to trouble, as a new lawsuit claims it used pirated books to train one of its AI models.\nA proposed class-action lawsuit filed on behalf of Elizabeth Lyon, an author from Oregon, claims that Adobe used pirated versions of numerous books—including her own—to train the company’s SlimLM program.\nAdobe describes SlimLM as a small language model series that can be “optimized for document assistance tasks on mobile devices.” It states that SlimLM was pre-trained on SlimPajama-627B, a “deduplicated, multi-corpora, open-source dataset” released by Cerebras in June of 2023. Lyon, who has written a number of guidebooks for non-fiction writing, says that some of her works were included in a pretraining dataset that Adobe had used.\nLyon’s lawsuit, which was originally reported on by Reuters, says that her writing was included in a processed subset of a manipulated dataset that was the basis of Adobe’s program: “The SlimPajama dataset was created by copying and manipulating the RedPajama dataset (including copying Books3),” the lawsuit says. “Thus, because it is a derivative copy of the RedPajama dataset, SlimPajama contains the Books3 dataset, including the copyrighted works of Plaintiff and the Class members.”\n“Books3″—a huge collection of 191,000 books that have been used to train genAI systems—has been an ongoing source of legal trouble for the tech community. RedPajama has also been cited in a number of litigation cases. In September, a lawsuit against Apple claimed the company had used copyrighted material to train its Apple Intelligence model. The litigation mentioned the dataset and accused the tech company of copying protected works “without consent and without credit or compensation.” In October, a similar lawsuit against Salesforce also claimed the company had used RedPajama for training purposes. \nUnfortunately for the tech industry, such lawsuits have, by now, become somewhat commonplace. AI algorithms are trained on massive datasets and, in some cases, those datasets have allegedly including pirated materials. In September, Anthropic agreed to pay $1.5 billion to a number of authors who had sued it and accused it of using pirated versions of their work to train its chatbot, Claude. The case was considered a potential turning point in the ongoing legal battles over copyrighted material in AI training data, of which there are many.\n\n\n\t\n\t\tLucas is a senior writer at TechCrunch, where he covers artificial intelligence, consumer tech, and startups. He previously covered AI and cybersecurity at Gizmodo. \nYou can contact Lucas by emailing lucas.ropek@techcrunch.com.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Cisco says Chinese hackers are exploiting its customers with a new zero-day",
    "url": "https://techcrunch.com/2025/12/17/cisco-says-chinese-hackers-are-exploiting-its-customers-with-a-new-zero-day/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/05/GettyImages-1238829383-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T18:58:30.000Z",
    "description": "On Wednesday, Cisco announced hackers are exploiting a critical vulnerability in some of its most popular products that allows the full takeover of affected devices. Worse, there are no patches available at...",
    "body": "\nOn Wednesday, Cisco announced hackers are exploiting a critical vulnerability in some of its most popular products that allows the full takeover of affected devices. Worse, there are no patches available at this time.\nIn a security advisory, Cisco said it discovered a hacking campaign on December 10 targeting Cisco AsyncOS software, and in particular the physical and virtual appliances Cisco Secure Email Gateway, Cisco Secure Email, and Web Manager. The advisory said affected devices have a feature called “Spam Quarantine” enabled and are reachable from the internet. \nCisco noted that this feature is not enabled by default and does not need to be exposed to the internet, which may be good news. Michael Taggart, a senior cybersecurity researcher at UCLA Health Sciences, told TechCrunch that “the requirement of an internet-facing management interface and certain features being enabled will limit the attack surface for this vulnerability.”\nHowever, Kevin Beaumont, a security researcher who tracks hacking campaigns, told TechCrunch that this appears to be a particularly problematic hacking campaign since a lot of big organizations use the affected products, there are no patches available, and it’s unclear how long the hackers had backdoors in the affected systems. \nAt this point Cisco is not saying how many customers are affected.\nWhen reached by TechCrunch, Cisco spokesperson Meredith Corley did not answer a series of questions, and instead said that the company “is actively investigating the issue and developing a permanent remediation.”\n\n\t\t\tContact Us\n\t\t\tDo you have more information about this hacking campaign? Such as what companies were targeted? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, or email.\t\t\nThe solution Cisco is suggesting to customers right now is essentially to wipe and rebuild the affected products’ software, as there is no patch available. \n“​​In case of confirmed compromise, rebuilding the appliances is, currently, the only viable option to eradicate the threat actors persistence mechanism from the appliance,” the company wrote. \nThe hackers behind the campaign are linked to China and other known Chinese government hacking groups, according to Cisco Talos, the company’s threat intelligence research team, which published a blog post about the hacking campaign. \nThe researchers wrote that the hackers are taking advantage of the vulnerability, which at this point is a zero-day, to install persistent backdoors, and that the campaign has been ongoing “since at least late November 2025.”\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "YouTube to pull music data from Billboard’s charts because it doesn’t like its ranking formula",
    "url": "https://techcrunch.com/2025/12/17/youtube-to-pull-music-data-from-billboards-charts-because-it-doesnt-like-its-ranking-formula/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449078-e1610399732853.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T20:57:51.000Z",
    "description": "YouTube is pulling its data from Billboard for use in the publisher’s industry-leading U.S. music charts. The decision is in response to a recent change Billboard made to its ranking formula, which continues...",
    "body": "\nYouTube is pulling its data from Billboard for use in the publisher’s industry-leading U.S. music charts. The decision is in response to a recent change Billboard made to its ranking formula, which continues to add more weight to paid, on-demand streaming compared with ad-supported, free streaming.\nBillboard justified its decision to adjust its age-old formula by saying that the change will “better reflect an increase in streaming revenue and changing consumer behaviors.”\nIn other words, streaming now matters more than buying albums or songs, so it wants its charts to reflect that.\nHowever, YouTube doesn’t like the new formula because it doesn’t want there to be much — if any — differentiation between free and paid streams, especially if the changes are meant to reflect how consumers today are enjoying music. \n“Billboard uses an outdated formula that weights subscription-supported streams higher than ad-supported. This doesn’t reflect how fans engage with music today and ignores the massive engagement from fans who don’t have a subscription,” a YouTube blog post published on Wednesday explains. “Streaming is the primary way people experience music, making up 84% of U.S. recorded music revenue.”\n“We’re simply asking that every stream is counted fairly and equally, whether it is subscription-based or ad-supported—because every fan matters and every play should count,” the post notes.\nThe ranking changes will be reflected starting with the charts published on January 17, which will include data from January 2-8, 2026. This will impact the Billboard 200 lists and genre-based album charts. In addition, the ratio between paid/subscription and ad-supported on-demand streaming tiers will be adjusted to 2.5:1 for the Billboard Hot 100, Billboard said.\nTo protest the new formula, YouTube said it will no longer provide data to Billboard after January 16, 2026.\nHere’s what that change means in practice: Under the revised calculation, Billboard said it will take 33.3% fewer ad-supported on-demand streams of songs from an album, and 20% fewer paid/subscription on-demand streams of songs from an album, to equal an album unit. In short, it will take fewer streams than before for an album to climb the charts. This is a win for streaming in general but not necessarily for YouTube.\nHere’s why. At present, the formula Billboard uses defines an album unit (the standard measurement for chart rankings) as one album sale. It counts 10 individual songs from an album as one album consumption unit, as well.\nOn the streaming side, it currently says an album unit equals 3,750 ad-supported streams — like YouTube’s  — or 1,250 paid/subscription official audio and video streams.\nAfter the changes, those figures will be adjusted, so it will take 2,500 ad-supported streams or 1,000 paid/subscription streams to count as one album unit. This means paid streams count 2.5x as much as ad-supported streams. While that’s less of a gap than the current 3:1 ratio, it’s still not what YouTube would prefer seeing here. The company is essentially doing what companies do in failed negotiations like this: it’s taking its ball and going home.\nOf course, by not cooperating with Billboard, YouTube’s music data won’t be considered in chart rankings, which could lead labels and artists to deprioritize publishing their music on YouTube. That’s not a good long-term strategy for YouTube as an important player in the streaming music era. That’s why this move should be viewed as the negotiation tactic it is.\n“We are committed to achieving equitable representation across the charts and hopefully can work with Billboard to return to theirs,” YouTube’s announcement concludes. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Facebook is testing a link-posting limit for professional accounts and pages",
    "url": "https://techcrunch.com/2025/12/17/facebook-is-testing-a-link-posting-limit-for-professional-accounts-and-pages/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T18:15:58.000Z",
    "description": "In a new experiment, Meta is limiting the number of links users can post on Facebook, unless they have a paid Meta Verified subscription. Over the last week, several users have spotted Meta’s test, which...",
    "body": "\nIn a new experiment, Meta is limiting the number of links users can post on Facebook, unless they have a paid Meta Verified subscription.\nOver the last week, several users have spotted Meta’s test, which impacts link posting. Social media strategist Matt Navarra noted that users part of the test can only post two links unless they pay for a Meta Verified subscription, which starts from $14.99 per month.\nAccording to the screenshot posted by Navarra, users can still post affiliate links, comments, and links to Meta platform posts, including Facebook, Instagram, and WhatsApp.\nThe company confirmed the test to TechCrunch and said it impacts those people using professional mode and Facebook Pages. Professional mode lets you convert your personal profile into a creator profile while making your content eligible for discovery by a wider audience.\n“This is a limited test to understand whether the ability to publish an increased volume of posts with links adds additional value for Meta Verified subscribers,” a Meta spokesperson told TechCrunch. \nThis would directly impact creators and brands posting links from their blogs or other platforms to reach a wider audience.\nThe company said it is trying to learn how it can add more value to Meta Verified subscribers, and this test is one such experiment to enhance that paid plan. The company added that, at the moment, publishers are not included in this test. It also said that users can still post links in comments, and they are not impacted by the limit.\nIn its transparency report for Q3, Meta said that more than 98% views on the feed in the U.S. come from the posts that don’t have any links. It is not clear if this signal pushed the company to experiment with limits on link sharing, however. The company said that the majority of the 1.9% of views of posts with links came from a page they followed. Linked posts shared by friends and groups were minimal.\nImage Credits:Meta\nThe same report noted that YouTube and TikTok, along with GoFundMe, were the top domains amid the links posted. With the new link posting limit test, creators and brands would be forced to post content from other Meta platforms if they reached their limit, or stop posting altogether if they didn’t want to pay for a subscription. \nAs AI has taken over the internet, there is an ever-raging debate about the link-based web. AI summary and search have impacted the publishing industry negatively. In the past few years, social networks like X have toyed with demoting linked posts to encourage users to post content on the platforms natively.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Coursera and Udemy enter a merger agreement valued at around $2.5B",
    "url": "https://techcrunch.com/2025/12/17/coursera-and-udemy-enter-a-merger-agreement-valued-at-around-2-5b/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Coursera_office_3.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T15:58:22.000Z",
    "description": "​Coursera and Udemy announced on Wednesday a landmark merger agreement valued at approximately $2.5 billion, bringing together two of the biggest names in online learning. Coursera will acquire Udemy in an...",
    "body": "\n​Coursera and Udemy announced on Wednesday a landmark merger agreement valued at approximately $2.5 billion, bringing together two of the biggest names in online learning.\nCoursera will acquire Udemy in an all-stock transaction, marking a pivotal moment in online education. The companies said the merger will be finalized in the second half of next year, pending regulatory review and shareholder approval.\n​This agreement comes at a challenging time for both Udemy and Coursera, as each faces market headwinds. Despite both companies posting revenue growth in the third quarter of 2025, their share prices declined, underscoring investors’ lack of confidence in the platforms. \nAs a combined company, Udemy and Coursera aimed to reassure shareholders, suggesting that the combined strengths of both platforms could deliver both immediate returns as well as long-term growth potential.\n“Through this combination with Coursera, we will create meaningful benefits for our learners, enterprise customers, and instructors, while delivering significant value to our shareholders, who will participate in the substantial upside potential of the combined company,” Udemy CEO Hugo Sarrazin said in a statement.\n​Additionally, as the online learning market continues to expand — particularly with the adoption of AI — Sarrazin said the merger will accelerate plans to introduce AI-powered products.\n​Coursera recently announced an integration with OpenAI’s ChatGPT app ecosystem and a content partnership with Anthropic. Wednesday’s announcement also comes just two days after Udemy rolled out its new “AI-powered microlearning experience,” which aims to give students shorter, personalized lessons that fit their busy schedules.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n​The companies also believe the merger will better position them to address how AI is transforming the workplace, as AI literacy becomes a requirement for many employees. Job postings requiring AI skills have surged in the past few years, and according to one survey, one in three hiring managers wouldn’t consider candidates without them.\n“We’re at a pivotal moment in which AI is rapidly redefining the skills required for every job across every industry. Organizations and individuals around the world need a platform that is as agile as the new and emerging skills learners must master,” added Coursera CEO Greg Hart.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Rad Power Bikes files for bankruptcy and is looking to sell the business",
    "url": "https://techcrunch.com/2025/12/17/rad-power-bikes-files-for-bankruptcy-and-is-looking-to-sell-the-business/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/11/IMG_4026.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T17:28:50.000Z",
    "description": "Electric bike company Rad Power Bikes filed for Chapter 11 bankruptcy protection on Monday, weeks after it warned employees that it could shut down without new funding. The company will continue to operate...",
    "body": "\nElectric bike company Rad Power Bikes filed for Chapter 11 bankruptcy protection on Monday, weeks after it warned employees that it could shut down without new funding.\nThe company will continue to operate while the bankruptcy case proceeds, and it’s looking to sell the business within 45-60 days, a spokesperson told TechCrunch.\n“This step allows us to keep operating in the ordinary course of business while we pursue the best possible outcome for the people who rely on Rad every day,” they said in a statement. “Our goal is to keep the company intact and preserve the relationships we have built with riders, vendors, suppliers, and partners.”\nRad Power is the latest in a series of e-bike companies from around the world to go through bankruptcy after pandemic-era excitement for the category wore off. Some of those companies have re-emerged, though, with VanMoof and Cake finding new owners during their respective court-led restructuring processes.\nRad itself had told employees in November that there had been a “very promising” option to keep the company afloat that was “likely to close,” but the deal fell apart. The company has not shared more details about that potential deal. \nWeeks later, the Consumer Product Safety Commission (CPSC) issued a warning that older Rad Power batteries posed “a risk of serious injury and death” after receiving 31 reports of fires. Rad Power said it “strongly disagrees” with the CPSC’s characterizations.\nRad’s tough November came at the end of a fairly tumultuous few years for the company. It has gone through multiple rounds of layoffs and swapped CEOs earlier this year, bringing in an executive with decades of experience turning around underperforming companies. That new CEO, Kathi Lentzsch, said Rad was shifting away from the direct-to-consumer model that had helped fuel its rise and toward a retail-focused approach.\n“This shift creates new opportunities to reach more riders, strengthen customer relationships, and evolve the brand in meaningful ways,” she said in a statement at the time. “[I]t’s an incredible time to come on board.” \nThe company said it entered the bankruptcy process with $32 million in assets and $73 million in liabilities. More than $8 million of its debt was owed to the U.S. Customs and Border Protection agency for unpaid tariffs. (The company has listed this claim as “disputed” in the bankruptcy paperwork.)\nIt’s not clear how much that contributed to Rad’s slide into bankruptcy. But it wouldn’t be the first time that Donald Trump’s tariffs helped push a micromobility company over the edge. During his first term, Trump’s tariffs on Chinese imports helped take the remaining wind out of electric skateboard company Boosted’s sails. Boosted went under shortly after.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "YouTube will stream the Oscars — exclusively — beginning in 2029",
    "url": "https://techcrunch.com/2025/12/17/youtube-will-stream-the-oscars-exclusively-beginning-in-2029/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/06/GettyImages-1149449084.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T19:42:35.000Z",
    "description": "YouTube has won exclusive rights to stream the Oscars starting in 2029, the Academy of Motion Picture Arts and Sciences announced on Wednesday. The Google-owned platform outbid other contenders, including the...",
    "body": "\nYouTube has won exclusive rights to stream the Oscars starting in 2029, the Academy of Motion Picture Arts and Sciences announced on Wednesday. The Google-owned platform outbid other contenders, including the Oscars’ longtime home ABC, ending the network’s streak of hosting the awards show since 1961 (with the exception of a brief period in the early 1970s).\nYouTube’s first show will be the 101st Oscars in 2029, and its deal will run through 2033. ABC will continue to broadcast the ceremony until 2028.\nThe financial terms of the deal were not disclosed. \nThe news, which marks a landmark shift for one of television’s marquee events, highlights YouTube’s growing dominance in the television space and a major shift as streaming takes on more live events. The ceremony will be available live and for free to more than 2 billion viewers globally on YouTube, as well as to YouTube TV subscribers in the United States. The move comes as Oscar ratings have steadily fallen from a peak of 55 million viewers in 1998 to closer to 20 million in recent years, prompting the Academy to explore new ways to reach audiences.\n“We are thrilled to enter into a multifaceted global partnership with YouTube to be the future home of the Oscars and our year-round Academy programming,” said Academy CEO Bill Kramer and Academy President Lynette Howell Taylor in a joint statement. “The Academy is an international organization, and this partnership will allow us to expand access to the work of the Academy to the largest worldwide audience possible — which will be beneficial for our Academy members and the film community.”\nAs part of the deal, YouTube will not only broadcast the ceremony, but also red carpet coverage, behind-the-scenes content, the Oscar nominations announcement, Academy member and filmmaker interviews, Governors Ball access, film education programs, podcasts, and more. \n“The Oscars are one of our essential cultural institutions, honoring excellence in storytelling and artistry,” YouTube CEO Neal Mohan said in a statement. “Partnering with the Academy to bring this celebration of art and entertainment to viewers all over the world will inspire a new generation of creativity and film lovers while staying true to the Oscars’ storied legacy.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAlthough this isn’t the first time a streamer has acquired the rights to an awards show — Netflix has secured rights to the SAG Awards — it’s the first time one of the big four awards shows (Emmys, Grammys, Oscars, and Tonys) will leave broadcast TV entirely in favor of streaming.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Meta is pausing its dream of sharing Quest’s Horizon OS with third-party headset makers",
    "url": "https://techcrunch.com/2025/12/17/meta-is-pausing-its-dream-of-sharing-quests-horizon-os-with-third-party-headset-makers/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2173579037-e1731325835302.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T19:32:52.000Z",
    "description": "Image Credits:David Paul Morris/Bloomberg / Getty Images\t \t \t\t\t\t\t\t11:32 AM PST · December 17, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Meta says that it has paused its program to share Meta Horizon OS, the mixed reality...",
    "body": "\n\t\n\t\tImage Credits:David Paul Morris/Bloomberg / Getty Images\t\n\t\n\t\t\t\t\t\t11:32 AM PST · December 17, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta says that it has paused its program to share Meta Horizon OS, the mixed reality operating system that powers its Quest headsets, with third-party device makers. The program was part of the company’s metaverse push — the idea behind the program was to create a “new generation of hardware” that would give VR users their pick of devices when it came to engaging with Meta’s digital worlds.\n“We have paused the program to focus on building the world-class first-party hardware and software needed to advance the VR market,” a Meta spokesperson told TechCrunch. “We’re committed to this for the long term and will revisit opportunities for third-party device partnerships as the category evolves.”\nThe news was originally reported by Road to VR.\nLast April, the tech giant announced that it would be opening up Meta Horizon OS to third-party headset makers. At the time, the company said that Asus, Microsoft’s Xbox, and Lenovo, were all working on creating new hardware that would run the company’s software. “As we’ve seen with the PC and smartphone industries, consumers are best served by a broad hardware ecosystem producing both general-purpose computing devices and more specialized products, all running on a common platform,” the company said at the time.\nBetween the announcement of the partner program and now, there haven’t been a whole lot of updates about it. In September, at the company’s Connect event, a Meta spokesperson said that Meta was still working with its business partners to push Horizon OS into more devices. \nHorizon OS was designed to deliver “mixed reality experiences,” and to communicate “social presence” through technologies like hand, body, eye, and face tracking. It launched in the days when Mark Zuckerberg still maintained that the metaverse was the “future” of his company. \nUnfortunately for Horizon and the coders who work on it, Meta and its top executive have seemed less and less interested in the metaverse in recent times, as AI becomes a larger focus for the company. Earlier this month, Bloomberg reported that the metaverse group within Reality Labs, Meta’s unit focused on VR and AR hardware, was facing potential budgetary cuts as high as 30%. The company subsequently confirmed that it was planning on “shifting some of our investment from Metaverse toward AI glasses and wearables given the momentum there.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tLucas is a senior writer at TechCrunch, where he covers artificial intelligence, consumer tech, and startups. He previously covered AI and cybersecurity at Gizmodo. \nYou can contact Lucas by emailing lucas.ropek@techcrunch.com.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Radiant Nuclear raises $300M for its semi-sized 1 MW reactor",
    "url": "https://techcrunch.com/2025/12/17/radiant-nuclear-raises-300m-for-its-semi-sized-1-mw-reactor/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/DIU-Rendering.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T16:07:49.000Z",
    "description": "Another day, another nine-figure round for a nuclear startup. Radiant Nuclear said today that it has raised more than $300 million, just one day after Last Energy said it had raised $100 million. Three weeks...",
    "body": "\nAnother day, another nine-figure round for a nuclear startup.\nRadiant Nuclear said today that it has raised more than $300 million, just one day after Last Energy said it had raised $100 million. Three weeks ago, X-energy raised $700 million, and in August, Aalo Atomics raised $100 million. Heck, Radiant itself raised $165 million just six months ago.\nGiven the string of investments, it seems reasonable to ask whether the nuclear world is in a bubble. Investment in the technology has tracked closely with the data center boom. AI requires tremendous amounts of electricity, and tech companies and data center developers have been rushing to secure supplies from sources ranging from nuclear fission to supersonic jet engines.\nAs long as tech companies’ power demands continue to grow, interest in nuclear is likely to remain strong. But there might be a winnowing of the field in the next year or two if startups don’t deliver on their promises, many of which revolve around starting their first reactor next year.\nSome startups might be able to buy some time after that. First-of-a-kind reactors can be built by hand, but many nuclear startups are predicated on the idea that mass manufacturing will make fission cost-competitive. They might succeed at reaching criticality but stumble when they try to replicate their designs.\nNone of this is to say that Radiant will fall into that category; it may very well succeed. Rather, the company just happens to be the latest in a long list of nuclear startups that have announced eye-popping fundraises in the last few months. Anytime a market gets that frothy, the B-word is bound to pop up.\nThe new round was led by Draper Associates and Boost VC with participation from Ark Venture Fund, Chevron Technology Ventures, Friends & Family Capital, Founders Fund, and others. It values Radiant at more than $1.8 billion. Previous investors include Andreessen Horowitz, DCVC, Giant Ventures, and Union Square Ventures.\nRadiant is developing a microreactor capable of generating 1 megawatt of electricity that can be delivered via semi. It will be cooled by helium and will have enough TRISO fuel — carbon and ceramic-coated beads of graphite and uranium that are designed to be more resistant to meltdowns — to last five years between refueling. \nThe startup is aiming to replace diesel generators at commercial and military sites. Customers will be able to buy the units outright or subscribe to a power-purchase agreement. When the reactor’s 20-year lifetime is up, the company will haul it away.\nLike many nuclear startups, Radiant is targeting data centers as some of its first customers. The company signed a deal with data center developer Equinix in August to supply 20 of its reactors.\nFirst, Radiant is building a demonstration reactor at the Idaho National Lab, which it hopes to begin testing in the summer of 2026. Many nuclear startups are on a similar timeline, one set by the Trump administration’s goal of three reactors achieving criticality — the moment when a nuclear reaction is self-sustaining — by July 4, 2026. \nRadiant is one of 11 companies selected for that program, which doesn’t provide government grants or loans but instead speeds approval timelines.\nCorrection 1:20 pm ET: Radiant’s reactor will be refueled once every five years, not months as previously stated.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google launches Gemini 3 Flash, makes it the default model in the Gemini app",
    "url": "https://techcrunch.com/2025/12/17/google-launches-gemini-3-flash-makes-it-the-default-model-in-the-gemini-app/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/gemini-3_flash_model_blog_header_dark_bleed_2096x1182.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-17T16:00:00.000Z",
    "description": "Google today released its fast and cheap Gemini 3 Flash model, based on the Gemini 3 released last month, looking to steal OpenAI’s thunder. The company is also making this the default model in the Gemini app...",
    "body": "\nGoogle today released its fast and cheap Gemini 3 Flash model, based on the Gemini 3 released last month, looking to steal OpenAI’s thunder. The company is also making this the default model in the Gemini app and AI mode in search.\nThe new Flash model arrives six months after Google announced the Gemini 2.5 Flash model, offering significant improvements. On the benchmark, the Gemini 3 Flash model outperforms its predecessor by a significant margin and matches the performance of other frontier models, like Gemini 3 Pro and GPT 5.2, in some measures.\nFor instance, it scored 33.7% without tool use on Humanity’s Last Exam benchmark, which is designed to test expertise across different domains. In comparison, Gemini 3 Pro scored 37.5%, Gemini 2.5 Flash scored 11%, and the newly released GPT-5.2 scored 34.5%.\nOn the multimodality and reasoning benchmark MMMU-Pro, the new model outscored all competitors with an 81.2% score. \nConsumer rollout\nGoogle is making Gemini 3 Flash the default model in the Gemini app globally, replacing Gemini 2.5 Flash. Users can still choose the Pro model from the model picker for math and coding questions.\nThe company says the new model is good at identifying multimodal content and giving you an answer based on that. For instance, you can upload your pickleball short video and ask for tips; you can try drawing a sketch and have the model guess what you are drawing; or you can upload an audio recording to get analysis or generate a quiz.\nThe company also said the model better understands the intent of users’ queries and can generate more visual answers with elements like images and tables.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nYou can also use the new model to create app prototypes in the Gemini app using prompts.\nThe Gemini 3 Pro is now available to everyone in the U.S. for search and more people in the U.S. can access the Nano Banana Pro image model in search, as well.\nEnterprise and developer availability\nGoogle noted that companies like JetBrains, Figma, Cursor, Harvey, and Latitude are already using the Gemini 3 Flash model, which is available through Vertex AI and Gemini Enterprise.\nFor developers, the company is making the model available in a preview model through the API and in Antigravity, Google’s new coding tool released last month. \nThe company said the Gemini 3 Pro scores 78% on the SWE-bench verified coding benchmark, only outperformed by GPT-5.2. It added that the model is ideal for video analysis, data extraction, and visual Q&A, and because of its speed, it is suited for quick and repeatable workflows.\nImage Credits:Google\nModel pricing is $0.50 per 1 million input tokens and $3.00 per 1 million output tokens. This is slightly more expensive than $0.30 per 1 million input tokens and $2.50 per 1 million output tokens of Gemini Flash 2.5. But Google claims that the new model outperforms the Gemini 2.5 Pro model while being three times faster. And, for thinking tasks, it uses 30% fewer tokens on average than 2.5 Pro. That means overall, you might save on the number of tokens for certain tasks.\nImage Credits:Google\n“We really position flash as more of your workhorse model. So if you look at, for example, even the input and output prices at the top of this table, Flash is just a much cheaper offering from an input and output price perspective. And so it actually allows for, for many companies, bulk tasks,” Tulsee Doshi, senior director & head of Product for Gemini Models, told TechCrunch in a briefing\nSince it released Gemini 3, Google has processed over 1 trillion tokens per day on its API, amid its fierce release and performance war with OpenAI.\nEarlier this month, Sam Altman reportedly sent an internal “Code Red” memo to the OpenAI team after ChatGPT’s traffic dipped as Google’s market share in consumers rose. Post that, OpenAI has released GPT-5.2 and a new image generation model. OpenAI also boasted about its growing enterprise use and said the ChatGPT messages volume has grown 8x since November 2024.\nWhile Google didn’t directly address the competition with OpenAI, it said that the release of new models is challenging all companies to be active.\n“Just about what’s happening across the industry is like all of these models are continuing to be awesome, challenge each other, push the frontier. And I think what’s also awesome is as companies are releasing these models,” Doshi said.\n“We’re also introducing new benchmarks and new ways of evaluating these models. And so that’s also encouraging us.”\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]