[
  {
    "title": "Baby delivered in Waymo continues proud tradition of not making it to the hospital",
    "url": "https://techcrunch.com/2025/12/10/baby-delivered-in-waymo-continues-proud-tradition-of-not-making-it-to-the-hospital/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/waymo-nyc.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T04:46:56.000Z",
    "description": "\nIn Brief\nPosted:\n8:46 PM PST · December 10, 2025\n\nImage Credits:Waymo\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nA pregnant woman in San Francisco ga",
    "body": "\nIn Brief\nPosted:\n8:46 PM PST · December 10, 2025\n\nImage Credits:Waymo\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nA pregnant woman in San Francisco gave birth inside a Waymo robotaxi Monday night en route to UCSF Medical Center, marking the latest milestone in the driverless car saga that no one saw coming — except everyone with more than six months of experience behind the wheel of a ride-share vehicle. \nAccording to The SF Standard, Waymo’s remote team detected “unusual activity” and called 911, though the vehicle beat emergency services to the hospital.\nSome traditions, it seems, are immune to disruption. For decades, expectant mothers have been racing against biology in the back seats of taxis and Ubers from London to Los Angeles. There was the mother in India who named her son Uber after giving birth to him en route to the hospital (the driver reportedly helped in the delivery). There was also the California couple in 2017 who welcomed their baby in an Uber during Shabbat.”Everyone is telling us to name the baby Uber,” the father joked, before adding, “But we can’t do that.” (Ah, though, they could have!)\nThe stories go on and on. Now, Silicon Valley has automated the experience, at least partially.\nThe vehicle in San Francisco was promptly removed for cleaning. Further, this wasn’t Waymo’s first birth — the company told the Standard that a Phoenix baby got there first. “While this is a very rare occurrence,” a Waymo spokesperson deadpanned, “some of our newest riders just can’t wait to experience their first Waymo ride.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baby delivered in Waymo continues proud tradition of not making it to the hospital",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/waymo-nyc.jpg?w=150"
      ],
      "datePublished": "2025-12-11T04:46:56.000Z",
      "dateModified": "2025-12-11T04:46:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia is reportedly testing tracking software as chip-smuggling rumors swirl",
    "url": "https://techcrunch.com/2025/12/10/nvidia-is-reportedly-testing-tracking-software-as-chip-smuggling-rumors-swirl/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-10T22:06:47.000Z",
    "description": "\nIn Brief\nPosted:\n2:06 PM PST · December 10, 2025\n\nImage Credits:Li Hongbo/VCG / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nNvidia is all",
    "body": "\nIn Brief\nPosted:\n2:06 PM PST · December 10, 2025\n\nImage Credits:Li Hongbo/VCG / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nNvidia is allegedly testing software that can track the location of its AI chips as reports of its chips being smuggled into China are on the rise.\nNvidia has built location verification technology that would allow it to track which country a chip is located in, Reuters originally reported, citing anonymous sources. This software tracks computing performance but the delay in communication between servers also offers a sense of a chip’s location.\nThis software will be optional for customers to use and will be made available for Blackwell chips first, Reuters said.\nMultiple reports have surfaced in the last few days that allege China’s DeepSeek AI models have been trained on smuggled Nvidia Blackwell chips. Nvidia responded to these reports by saying it hasn’t seen evidence of this type of smuggling.\n“We haven’t seen any substantiation or received tips of ‘phantom data centers’ constructed to deceive us and our OEM partners, then deconstructed, smuggled, and reconstructed somewhere else. While such smuggling seems far-fetched, we pursue any tip we receive,” an Nvidia spokesperson told TechCrunch.\nThis news comes just days after Nvidia got the green light from the U.S. government to start selling its H200 AI chips to approved customers in China on Monday. That announcement pertains only to older H200 chips and not the company’s Blackwell chips.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia is reportedly testing tracking software as chip-smuggling rumors swirl",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2216028442.jpg?w=150"
      ],
      "datePublished": "2025-12-10T22:06:47.000Z",
      "dateModified": "2025-12-10T22:06:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "You can now share live video with emergency services on Android",
    "url": "https://techcrunch.com/2025/12/10/you-can-now-share-live-video-with-emergency-services-on-android/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/google-android-live-video.webp?w=150",
    "tag": "Tech",
    "date": "2025-12-10T21:38:33.000Z",
    "description": "\nIn Brief\nPosted:\n1:38 PM PST · December 10, 2025\n\nImage Credits:Google\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoogle launched Android Emergency L",
    "body": "\nIn Brief\nPosted:\n1:38 PM PST · December 10, 2025\n\nImage Credits:Google\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoogle launched Android Emergency Live Video on Wednesday, which allows people to stream video when contacting emergency responders. This feature could help give first responders extra context in circumstances like car accidents, fires, or medical crises.\nThere’s no setup required to use this feature. Instead, during an emergency call or text, a dispatcher can send a request to your device. Then you can opt into sharing your camera’s live video, which is encrypted and can be stopped at your discretion.\n“With a single tap, you can start securely streaming from your camera, allowing responders to quickly assess the situation and get you the right help in the moment,” Google wrote in a blog post. “This real-time view can also help them guide you through life-saving steps, like CPR, until help arrives.”\nGoogle and Apple each offer a suite of safety features on their devices, like emergency SOS, crash detection, fall detection, and satellite location services.\nAndroid Emergency Live Video will be supported on Android phones running Android 8 or later. So far, the feature will roll out in the U.S. and certain regions of Germany and Mexico.\nImage Credits:Google\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Hardware\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "You can now share live video with emergency services on Android",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/google-android-live-video.webp?w=150"
      ],
      "datePublished": "2025-12-10T21:38:33.000Z",
      "dateModified": "2025-12-10T21:38:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CEO of South Korean retail giant Coupang resigns after massive data breach",
    "url": "https://techcrunch.com/2025/12/10/ceo-of-south-korean-retail-giant-coupang-resigns-after-massive-data-breach/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/coupang-large-rainbow-2250196254.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-10T21:06:55.000Z",
    "description": "\nIn Brief\nPosted:\n1:06 PM PST · December 10, 2025\n\nImage Credits:Jung Yeon-je / AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nPark Dae",
    "body": "\nIn Brief\nPosted:\n1:06 PM PST · December 10, 2025\n\nImage Credits:Jung Yeon-je / AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nPark Dae-jun has resigned as chief executive of South Korean retail giant Coupang after a data breach exposed the personal information of more than half of the country’s population.\nIn a statement, Park apologized for the breach, citing a “deep sense of responsibility for the outbreak and the subsequent recovery process.”\nCoupang has replaced Park with Harold Rogers, the top lawyer at Coupang’s U.S.-based parent company, according to a machine translation of the company statement.\nThe retail giant, often compared to Amazon for its dominance in South Korean e-commerce and logistics, last month revealed details of a data breach affecting close to 34 million people. The breach allegedly began in June but wasn’t noticed until November, when Coupang initially said over 4,500 customers had their data stolen. The company later revised that figure dramatically upward.\nThe Coupang hack is the latest in a string of security incidents affecting corporate giants and the central government across the country this year, including a data center fire that led to a massive, irretrievable loss of South Korean government data.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CEO of South Korean retail giant Coupang resigns after massive data breach",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/coupang-large-rainbow-2250196254.jpg?w=150"
      ],
      "datePublished": "2025-12-10T21:06:55.000Z",
      "dateModified": "2025-12-10T21:06:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford and SK On are ending their U.S. battery joint venture",
    "url": "https://techcrunch.com/2025/12/11/ford-and-sk-on-are-ending-their-u-s-battery-joint-venture/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/BlueOvalSK-Battery-Park_celebration_01.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T16:11:07.000Z",
    "description": "\nIn Brief\nPosted:\n8:11 AM PST · December 11, 2025\n\nImage Credits:Ford\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFour years ago, Ford and South Korean",
    "body": "\nIn Brief\nPosted:\n8:11 AM PST · December 11, 2025\n\nImage Credits:Ford\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFour years ago, Ford and South Korean battery maker SK On struck a deal to form a joint venture and spend $11.4 billion to build factories in Tennessee and Kentucky that would produce batteries for the next generation of electric F-Series trucks.\nThe factories live on; the joint venture will not. \nSK On, a subsidiary of SK Innovation, said Thursday it reached an agreement with Ford to end the joint venture. The two companies will divide the assets: Ford will take ownership and operation of the twin battery plants in Kentucky, while SK On will operate the factory at the massive BlueOval SK campus in Tennessee.\nSK On said it will maintain a strategic partnership with Ford centered on the Tennessee plant, according to Bloomberg.\nWhen reached for comment, a Ford spokesperson told TechCrunch the company was aware of SK’s disclosure and had nothing further to share at this time.\nThe joint venture was created when the industry was investing billions of dollars to ramp up electric vehicle production. While EV sales have risen over the past several years, demand has not kept up with the industry’s lofty projections. The end of the federal EV tax credit has also dampened the pace of sales.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford and SK On are ending their U.S. battery joint venture",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/BlueOvalSK-Battery-Park_celebration_01.jpg?w=150"
      ],
      "datePublished": "2025-12-11T16:11:07.000Z",
      "dateModified": "2025-12-11T16:11:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TIME names ‘Architects of AI’ its Person of the Year",
    "url": "https://techcrunch.com/2025/12/11/time-names-architects-of-ai-its-person-of-the-year/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/TIME-person-of-the-year.png?w=150",
    "tag": "Tech",
    "date": "2025-12-11T14:38:06.000Z",
    "description": "\nIn Brief\nPosted:\n6:38 AM PST · December 11, 2025\n\nImage Credits:TIME Magazine\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nEach December, TIME Magazine",
    "body": "\nIn Brief\nPosted:\n6:38 AM PST · December 11, 2025\n\nImage Credits:TIME Magazine\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nEach December, TIME Magazine names a person of the year — someone who has most influenced the news and world, for good or ill. Last year, TIME chose President Donald Trump for the second time. The year before that, it was Taylor Swift, who many claimed saved the economy from a recession with her Eras Tour. In 1938, the magazine chose Adolf Hitler. \nThis year, TIME has chosen to bestow its award on not just one person, but a group of people: the so-called “Architects of AI,” comprising the CEOs shaping the global AI race from the U.S. With AI on everyone’s minds, embodying hope for a small minority and economic anxiety for a majority, per recent Edelman data, this  tracks.\n“For decades, humankind steeled itself for the rise of thinking machines,” the article reads. “Leaders striving to develop the technology, including Sam Altman and Elon Musk, warned that the pursuit of its powers could create unforeseen catastrophe […] This year, the debate about how to wield AI responsibly gave way to a sprint to deploy it as fast as possible.”\nBased on one of TIME’s two cover photos, some of those people appear to be Nvidia’s Jensen Huang, Tesla’s Elon Musk, OpenAI’s Sam Altman, Meta’s Mark Zuckerberg, AMD’s Lisa Su, Anthropic’s Dario Amodei, Google DeepMind’s Demis Hassabis, and World Labs’s Fei-Fei Li — all individuals who raced “both beside and against each other.” \nTIME writes that these individuals, through their multi-billion-dollar bets on “one of the biggest physical infrastructure projects of all time,” have reshaped government policy, turned up the heat on geopolitical competition, and pushed AI adoption forward. \n\n“This is the story of how AI changed our world in 2025, in new and exciting and sometimes frightening ways. It is the story of how Huang and other tech titans grabbed the wheel of history, developing technology and making decisions that are reshaping the information landscape, the climate, and our livelihoods… AI emerged as arguably the most consequential tool in great-power competition since the advent of nuclear weapons.”\n\nTIME only announced the news on Thursday morning, but images of the cover photo were leaked on prediction market Polymarket on Wednesday evening.\n\n\n\n\tTopics\n\t\n\t\tAI, AI, dario amodei, Demis Hassabis, Elon Musk, Fei-Fei Li, Jensen Huang, Lisa Su, Mark Zuckerberg, person of the year, sam altman, time\t\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TIME names ‘Architects of AI’ its Person of the Year",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/TIME-person-of-the-year.png?w=150"
      ],
      "datePublished": "2025-12-11T14:38:06.000Z",
      "dateModified": "2025-12-11T14:38:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "On Me raises $6M to shake up the gift card industry",
    "url": "https://techcrunch.com/2025/12/11/on-me-raises-6m-to-shake-up-the-gift-card-industry/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/OnMe-team.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T15:08:21.000Z",
    "description": "\nOn Me, a digital gift card startup founded by former Google employees, is aiming to redefine the gift card industry with its mobile-first gifting pla",
    "body": "\nOn Me, a digital gift card startup founded by former Google employees, is aiming to redefine the gift card industry with its mobile-first gifting platform that lets users purchase digital gift cards categorized by interests rather than being restricted to specific retailers.\nThe company on Thursday said it had raised $6 million in a seed funding round, which it will use to expand its gift categories to include things like horseback riding lessons, wine tastings, and theme park trips.\nImage Credits:On Me\nOn Me touts its flexibility. So if you have a friend who is passionate about tennis, you can send them a digital card that lets them shop for outfits and gear from popular brands like Wilson, On, Prince, and more. \nThe platform offers gift cards across 72 categories that range from running and reading to camping, gardening, gaming and concerts.\nYou can also attach video messages, photos and GIFs to gift cards, which is a nice touch as it lets you add a layer of personalization. You can use On Me via its website as well as iOS and Android apps.\nImage Credits:On Me\nThe startup’s CEO and co-founder Darragh Meaney pointed out the environmental issues with the traditional gift card industry, which rely heavily on plastic. \nThe International Card Manufacturers Association (ICMA) reports that approximately 30 billion plastic cards are manufactured globally each year, and that over 70% of gift cards are discarded within six months, resulting in an estimated 53 million tons of plastic waste.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“It is an environmentally wasteful practice that feels totally disconnected from how we live today,” Meaney said.\nOn Me’s digital cards also integrate with Apple Pay and Google Wallet.\nImage Credits:On Me\nWith the global gift card market projected to reach $2.3 trillion by 2030, On Me believes it is well-positioned for growth. Since its launch, the company says it has facilitated over $2.5 million in gifts for more than 26,000 users, and has grown 50% every month. \nThe seed round was led by NFX, with participation from Lerer Hippeau and Focal. \nThe funding comes a year after the company launched its platform and raised $1.7 million in a pre-seed round. \n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "On Me raises $6M to shake up the gift card industry",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/OnMe-team.jpg?w=150"
      ],
      "datePublished": "2025-12-11T15:08:21.000Z",
      "dateModified": "2025-12-11T15:08:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Opera wants you to pay $20 a month to use its AI-powered browser Neon",
    "url": "https://techcrunch.com/2025/12/11/opera-wants-you-to-pay-20-a-month-to-use-its-ai-powered-browser-neon/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Agent-Selector.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T13:00:00.000Z",
    "description": "\nFollowing a couple of months’ testing, Norway-based browser company Opera has finally made its AI-powered browser, Neon, available to the public — th",
    "body": "\nFollowing a couple of months’ testing, Norway-based browser company Opera has finally made its AI-powered browser, Neon, available to the public — though you’ll have to shell out $19.90 per month to use it.\nOpera first unveiled Neon earlier this year in May and launched it in early access to select users in October. \nSimilar to other AI-first browsers like Perplexity’s Comet, OpenAI’s Atlas, and The Browser Company’s Dia, Neon bakes in an AI chatbot into its interface, letting you ask it answers about pages, use it to create mini apps and videos, and get it to do tasks for you. The browser uses your browsing history as context, so you can do things like ask it to fetch details from a YouTube video you watched last week or the post that you read yesterday.\nYou can also build “Cards” for repeatable tasks using prompts, and the browser offers a deep research agent that can get you detailed information about any topic. The browser also has a new tab organizational feature called Tasks, which are contained workspaces of AI chats and tabs. This feature is more like Tab Groups combined with Arc Browser’s Spaces feature, which has its own context for AI.\n\n\n\nIn addition to the AI features, the subscription gives users access to top models like Gemini 3 Pro, GPT-5.1, Veo 3.1, and Nano Banana Pro. Subscribers will also get access to Opera’s Discord community and direct access to its developers.\n“Opera Neon is a product for people who like to be the first to the newest AI tech. It’s a rapidly evolving project with significant updates released every week. We’ve been shaping it with our Founders community for a while and are now excited to share the early access to it with a larger audience,” Krystian Kolondra, EVP of browsers at Opera, said in a statement.\nImage Credits: Opera\nThe company noted that its other products, like Opera One, Opera GX, and Opera Air, also have free AI features, like a chat-based assistant.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMeanwhile, browser incumbents are taking a slower approach to adding AI features to their products. Earlier this week, Google detailed the security work it is doing to protect users against different attack surfaces that agentic features are prone to, and Brave said on Wednesday it is previewing its agentic features in a nightly build, and provides an isolated browsing profile for using AI features so users can keep their regular, non-AI usage separate.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Opera wants you to pay $20 a month to use its AI-powered browser Neon",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Agent-Selector.jpeg?w=150"
      ],
      "datePublished": "2025-12-11T13:00:00.000Z",
      "dateModified": "2025-12-11T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Overview Energy wants to beam energy from space to existing solar farms",
    "url": "https://techcrunch.com/2025/12/10/overview-energy-wants-to-beam-energy-from-space-to-existing-solar-farms/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-175175784.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-10T19:42:41.000Z",
    "description": "\nOverview Energy emerged from stealth today with a plan to use the world’s solar panels as nighttime collectors of power beamed down from space.\nThe s",
    "body": "\nOverview Energy emerged from stealth today with a plan to use the world’s solar panels as nighttime collectors of power beamed down from space.\nThe startup plans to use large solar arrays in geosynchronous orbit — about 22,000 miles above Earth where satellites match the planet’s rotation — to harvest sunlight. It will then use infrared lasers to transmit that power to utility-scale solar farms on Earth, allowing them to send power to the grid nearly round the clock. \nOverview has raised $20 million to date, and part of that money has gone toward an airborne demonstration of its power-beaming technology. A light aircraft transmitted power using a laser to a ground receiver over a distance of 5 kilometers (3 miles).\nInvestors include the Aurelia Institute, Earthrise Ventures, Engine Ventures, EQT Foundation, Lowercarbon Capital, and Prime Movers Lab.\nAs space launch costs have declined over the past decade or so, space-based power has gone from pure science fiction to something closer to reality. \nThere are still several hurdles to overcome: For one, it’s still significantly cheaper to deploy solar panels here on Earth than to send them into space. And the ability to send power wirelessly from orbit down to our planet’s surface is still in its infancy.\nOther companies are attempting the same feat. Aetherflux is also pursuing a laser-based approach. Others like Emrod and Orbital Composites/Virtus Solis are developing microwave-based power transmission, which sends energy wirelessly using a different portion of the electromagnetic spectrum than Aetherflux and Overview. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMicrowaves are less sensitive to clouds and humidity than infrared lasers, which can’t transmit in cloudy weather since the suspended water droplets would absorb much of the energy. But because microwave-based systems can’t reuse existing solar farms, they would have to build their own ground stations. \nTo keep costs down, those ground receivers would probably be smaller, so the energy beams would have to be tighter and more powerful. Companies are developing ways to swiftly interrupt the beam to prevent collateral damage to birds and aircraft, but it’s still a concern.\nOverview’s reuse of solar farms would mitigate some of those concerns, though it would still have to convince the public that energy beams from space are safe and won’t stray off target. (Remember SimCity 2000?) The company will also have to ensure its laser system is very efficient; otherwise the benefit of collecting sunlight in space will evaporate as the energy is converted to infrared light and back again.\nThe startup says that in 2028 it intends to launch a satellite into low Earth orbit — far below the 36,000 kilometers (22,000 miles) at which it ultimately intends to operate. If all goes as planned, it’ll start sending megawatts’ worth of power from geosynchronous orbit in 2030.\nIf it sounds audacious, it is. Overview isn’t just confronting some promising but potentially unforgiving physics problems but will also be battling grid-scale batteries, which are getting cheaper every year, and potentially nuclear fusion. But enough people believe it will happen that specialty suppliers have started popping up. A sci-fi future, indeed.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Overview Energy wants to beam energy from space to existing solar farms",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-175175784.jpeg?w=150"
      ],
      "datePublished": "2025-12-10T19:42:41.000Z",
      "dateModified": "2025-12-10T19:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Runware raises $50M Series A to help make image, video generation easier for developers",
    "url": "https://techcrunch.com/2025/12/11/runware-raises-50m-series-a-from-dawn-capital-comcast-ventures-to-become-the-api-for-all-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Runware-co-founders-Flaviu-Radulescu-l-and-Ioana-Hreninciuc-.png?w=150",
    "tag": "Tech",
    "date": "2025-12-11T11:00:00.000Z",
    "description": "\nFlaviu Radulescu started Runware in 2023 when he was testing a text-to-image company and realized that, though genAI tech was powerful, it was slow i",
    "body": "\nFlaviu Radulescu started Runware in 2023 when he was testing a text-to-image company and realized that, though genAI tech was powerful, it was slow in generating images. So Radulescu teamed up with Ioana Hreninciuc and launched Runware as a dev tool platform that specializes in generating images, videos, and audio in real time.\nThe company has seen much growth since it first launched. It has powered more than 10 billion creations for more than 200,000 developers, the company told TechCrunch.\nThe product lets developers integrate Runware’s API into their apps and then generate media assets through one interface, so they don’t have to set up any new infrastructure or maintain separate integrations. It has a custom AI inference infrastructure for open-source models, and provides day-zero access (meaning as soon as a model is released, it can run on Runware) and competitive pricing, Hreninciuc, who focuses on operations and GTM, told TechCrunch.\nOn Thursday, the company announced a $50 million Series A in a round led by Dawn Capital. Dawn Capital Partner Shamillah Bankiya is joining the board. Others in the round include Comcast Ventures, Speedinvest, Insight Partners and a16z Speedrun. Runware has raised $66 million in funding to date.\nHreninciuc said the company remains competitive through its pricing, which is “more-cost effective,” in addition to having a fully unified API. She said the company does this with its Sonic Inference Engine, which runs on custom AI hardware. It also partners with third-party AI cloud providers so that it can reroute workloads automatically in case more memory is needed.\n“On the software side, we heavily optimize model loading and offloading, which lets us support over 400,000 models and make any of them available for inference in real time,” she continued.\nStartups that focus on dev tools for image and video have been a particularly hot market for VC interest lately. Fal.ai, for instance, just raised $140 million at a $4.5 billion valuation, its second giant raise in a matter of months. Fal.ai focuses on the breadth of model offerings versus customizing for speed. So, Hreninciuc considers her competitors to be Fal.ai and Replicate, a startup that runs open-source models in apps with just a few lines of code.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThese companies, as Radulescu previously told TechCrunch, sell based on GPU compute time. Runware instead leans toward the model of Stable Diffusion and Flux, offering a more cost-per-image generated so that people can pay for what they need rather than buying a block of compute time.  \nHreninciuc said the fresh capital will be used to keep expanding the company’s infrastructure and it hopes to use its Sonic Inference Engine to power over 2 million models. The big goal is to be the API for all AI — so that any generative AI model can and does run on the platform.\n“We’re also expanding rapidly into new modalities,” she said, adding that the company is going to expand the current team of around 25 to help make that happen.\nOverall, Hreninciuc hopes Runware continues to “make it possible for applications to scale to millions of users while actually keeping their margins,” she said, adding that it helps make the market more affordable. That “benefits everyone,” she continued. “From the app builders to the end users, and puts powerful AI into more people’s hands globally.”\nThis piece was updated to correct the spelling of Radulescu‘s name and to update what the competitors are, and who else participated in the round. \n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Runware raises $50M Series A to help make image, video generation easier for developers",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Runware-co-founders-Flaviu-Radulescu-l-and-Ioana-Hreninciuc-.png?w=150"
      ],
      "datePublished": "2025-12-11T11:00:00.000Z",
      "dateModified": "2025-12-11T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Interest in Spoor’s bird monitoring AI software is soaring",
    "url": "https://techcrunch.com/2025/12/11/interest-in-spoors-bird-monitoring-ai-software-is-soaring/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Spoor-founders.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T13:00:00.000Z",
    "description": "\nSpoor launched in 2021 with the goal of using computer vision to help reduce the impact of wind turbines on local bird populations. Now, the startup ",
    "body": "\nSpoor launched in 2021 with the goal of using computer vision to help reduce the impact of wind turbines on local bird populations. Now, the startup has proven its technology works and is seeing demand from wind farms and beyond.\nOslo, Norway-based Spoor has built software that uses computer vision to track and identify bird populations and migration patterns. The software can detect birds within a 2.5-kilometer radius (about 1.5 miles) and can work with any off-the-shelf high-resolution camera.\nWind farm operators can use this information to better plan where wind farms should be located and to help them better navigate migration patterns. For example, a wind farm could slow down its turbines, or even stop them entirely, during heavy periods of local migration.\nAsk Helseth (pictured above left), the co-founder and CEO of Spoor, told TechCrunch last year that he got interested in this space after learning that wind farms lacked effective tracking methods, despite many countries having strict rules around where wind farms can be built and how they can operate due to local bird populations.\n“The expectations from the regulators are growing but the industry doesn’t have a great tool,” Helseth said at the time. “A lot of people [go out] in the field with binoculars and trained dogs to find out how many birds are colliding with the turbines.”\nHelseth told TechCrunch last week that since then, the company has proven the need for this technology and worked to make it better.\nCourtesy: Spoor\nAt the time of its seed raise in 2024, Spoor was able to track birds in a 1-kilometer range, which has since doubled. As the company has collected more data to feed into its AI model, it has been able to improve its bird identification accuracy to about 96%.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Identifying the species of the bird for some of the clients, you add another layer,” Helseth said. “Is it a bird or not a bird? We have an in-house ornithologist to help train the model to train the new types of birds or a new type of species. Having deployment in other countries [means] having rare species in the database.”\nSpoor now works across three continents and with more than 20 of the world’s largest energy companies. It has also started to see interest from other industries such as airports and aquaculture farms. Spoor has a partnership with Rio Tinto, a London-based mining giant, to track bats.\nThe company has also received interest in using its tech to track other objects of similar size — but Helseth said they aren’t thinking of pivoting into those areas quite yet.\n“Drones are of course a plastic bird in our mind,” Helseth joked. “They move in a different way and have a different shape and size. Currently we are discarding that data but we are getting interest in it.”\nSpoor recently raised an €8 million ($9.3 million) Series A round led by SET Ventures with participation from Ørstead Ventures and Superorganism in addition to strategic investors.\nHelseth predicts that interest in this type of technology will only grow as regulators continue to crack down on wind farms. For example, French regulators shut down a wind farm in April due to its impact on the local bird population and imposed hundreds of millions of fines.\n“Our mission is to enable industry and nature to coexist,” Helseth said. “We have started on that journey, but we are still a small startup with a lot to prove. In the coming years, we want to really cement our position in the wind industry and become a global leader to tackle these challenges. At the same time, we want to build some proof points that this technology has value beyond that main category.”\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Interest in Spoor’s bird monitoring AI software is soaring",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Spoor-founders.jpg?w=150"
      ],
      "datePublished": "2025-12-11T13:00:00.000Z",
      "dateModified": "2025-12-11T13:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Security flaws in Freedom Chat app exposed users’ phone numbers and PINs",
    "url": "https://techcrunch.com/2025/12/11/security-flaws-in-freedom-chat-app-exposed-users-phone-numbers-and-pins/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-913017298.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T13:35:08.000Z",
    "description": "\nMessaging app Freedom Chat has fixed a pair of security flaws: one that allowed a security researcher to guess registered users’ phone numbers, and a",
    "body": "\nMessaging app Freedom Chat has fixed a pair of security flaws: one that allowed a security researcher to guess registered users’ phone numbers, and another that exposed user-set PINs to others on the app.\nFreedom Chat, released in June, bills itself as a secure messaging app, and claims on its website that users’ phone numbers stay private.\nBut security researcher Eric Daigle told TechCrunch that users’ phone numbers and PIN codes, used for locking the app, could be easily obtained by exploiting vulnerabilities.\nDaigle found the vulnerabilities last week and shared their details with TechCrunch, as Freedom Chat does not provide a public way to report security flaws, like a vulnerability disclosure program. TechCrunch then alerted Freedom Chat founder Tanner Haas to the security flaws by email.\nHaas confirmed to TechCrunch that the app has now reset user PINs and released a new version. Haas added that the company is removing instances where users’ phone numbers were occasionally visible, and has notched up rate-limiting on its servers to prevent mass-guess attempts.\nDaigle, who published his findings in a blog post, told TechCrunch it was possible to enumerate the phone numbers of close to 2,000 users who had signed up to use Freedom Chat since it launched. Daigle said Freedom Chat’s servers allowed anyone to flood it with millions of phone number guesses to determine if a user’s phone number was stored on the servers.\nPer Daigle, this technique is identical to one described by the University of Vienna in research last month, where academics scraped data on some 3.5 billion user accounts who signed up to WhatsApp by matching billions of phone numbers against WhatsApp’s servers.\nDaigle also found Freedom Chat was leaking users’ PIN codes. Using an open-source network traffic inspection tool to analyze the data going in and out of the app, Daigle saw that the app would respond with the PIN codes of every other user in the same public channel — even if the PINs weren’t visible to users within the app itself.\nAccording to Daigle, anyone who was in the default Freedom Chat channel, which users are automatically subscribed to when they first sign up, had their PIN broadcast to everyone else in the channel. Daigle told TechCrunch that knowledge of a person’s PIN could allow someone to open the app from a user’s stolen device.\nIn an app store update published Sunday, Freedom Chat noted: “A critical reset: A recent backend update inadvertently exposed user PINs in a system response. No messages were ever at risk, and because Freedom Chat does not support linked devices, your conversations were never accessible; however, we’ve reset all user PINs to ensure your account stays secure. Your privacy remains our top priority.”\nFreedom Chat is Haas’ second messaging app, after Converso, which was delisted from app stores following the disclosure of security flaws that exposed users’ private messages and content.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Security flaws in Freedom Chat app exposed users’ phone numbers and PINs",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-913017298.jpg?w=150"
      ],
      "datePublished": "2025-12-11T13:35:08.000Z",
      "dateModified": "2025-12-11T13:35:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disney signs deal with OpenAI to allow Sora to generate AI videos featuring its characters",
    "url": "https://techcrunch.com/2025/12/11/disney-signs-deal-with-openai-to-allow-sora-to-generate-ai-videos-featuring-its-characters/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/GettyImages-1387623215.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T15:21:05.000Z",
    "description": "\nThe Walt Disney Company announced on Thursday that it has signed a three-year partnership with OpenAI that will bring its iconic characters to the co",
    "body": "\nThe Walt Disney Company announced on Thursday that it has signed a three-year partnership with OpenAI that will bring its iconic characters to the company’s Sora AI video generator. Disney is also making a $1 billion equity investment in OpenAI.\nLaunched in September, Sora allows users to create short videos using simple prompts. With this new agreement, users will be able to draw on more than 200 animated, masked, and creature characters from Disney, Marvel, Pixar, and Star Wars, including costumes, props, vehicles, and more.\nThese characters include iconic faces like Mickey Mouse, Ariel, Belle, Cinderella, Baymax, and Simba, as well as characters from Encanto, Frozen, Inside Out, Moana, Monsters, Inc., Toy Story, Up, and Zootopia. Users will also be able to draw on animated or illustrated versions of Marvel and Lucasfilm characters like Black Panther, Captain America, Deadpool, Groot, Iron Man, Darth Vader, Han Solo, Stormtroopers, and more.\nUsers will also be able to draw on these characters while using ChatGPT Images, the feature in ChatGPT that allows users to create visuals using text prompts. \nThe agreement does not include any talent likenesses or voices, Disney says. \n“The rapid advancement of artificial intelligence marks an important moment for our industry, and through this collaboration with OpenAI we will thoughtfully and responsibly extend the reach of our storytelling through generative AI, while respecting and protecting creators and their works,” said Disney CEO Bob Iger in a statement.\nDisney says that alongside the agreement, it will “become a major customer of OpenAI,” as it will use its APIs to build new products, tools, and experiences, including for Disney+.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Disney is the global gold standard for storytelling, and we’re excited to partner to allow Sora and ChatGPT Images to expand the way people create and experience great content,” said Sam Altman, co-founder and CEO of OpenAI, in a statement. “This agreement shows how AI companies and creative leaders can work together responsibly to promote innovation that benefits society, respect the importance of creativity, and help works reach vast new audiences.”\nIt’s worth noting that Disney has sued the generative AI platform Midjourney for ignoring requests to stop violating its intellectual property rights. Disney also sent a cease-and-desist letter to Character.AI, urging the chatbot company to remove Disney characters from among the millions of AI companions on its platform.\nDisney’s agreement with OpenAI indicates the company isn’t fully closing the door on AI platforms.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disney signs deal with OpenAI to allow Sora to generate AI videos featuring its characters",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/GettyImages-1387623215.jpg?w=150"
      ],
      "datePublished": "2025-12-11T15:21:05.000Z",
      "dateModified": "2025-12-11T15:21:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google’s answer to the AI arms race — promote the guy behind its data center tech",
    "url": "https://techcrunch.com/2025/12/10/googles-answer-to-the-ai-arms-race-promote-the-guy-behind-its-data-center-tech/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Screenshot-2025-12-10-at-4.33.43-PM.png?w=150",
    "tag": "Tech",
    "date": "2025-12-11T01:10:04.000Z",
    "description": "\nGoogle just made a major move in the AI infrastructure arms race, elevating Amin Vahdat to chief technologist for AI infrastructure, a newly created ",
    "body": "\nGoogle just made a major move in the AI infrastructure arms race, elevating Amin Vahdat to chief technologist for AI infrastructure, a newly created position reporting directly to CEO Sundar Pichai, according to a memo first reported by Semafor and later confirmed by TechCrunch. It’s a signal of just how critical this work has become as Google pours up to $93 billion into capital expenditures by the end of 2025 — a number that parent company Alphabet expects will be a whole lot bigger next year.\nVahdat isn’t new to the game. The computer scientist, who holds a PhD from UC Berkeley and started as a research intern at Xerox PARC back in the early ’90s, has been quietly building Google’s AI backbone for the past 15 years. Before joining Google in 2010 as an engineering fellow and VP, he was an associate professor at Duke University and later a professor and SAIC Chair at UC San Diego. His academic credentials are formidable — with what appears to be around 395 published papers — and his research has always focused on making computers work more efficiently at massive scale.\nVahdat already maintains a high profile with Google. Just eight months ago, at Google Cloud Next, he took the stage to unveil the company’s seventh-generation TPU, called Ironwood, in his role as VP and GM of ML, Systems, and Cloud AI. The specs he rattled off at the event were staggering, too: over 9,000 chips per pod delivering 42.5 exaflops of compute — more than 24 times the power of the world’s No. 1 supercomputer at the time, he said. “Demand for AI compute has increased by a factor of 100 million in just eight years,” he told the audience.\nBehind the scenes, as noted by Semafor, Vahdat has been orchestrating the unglamorous and essential work that keeps Google competitive, including those custom TPU chips for AI training and inference that give Google an edge over rivals like OpenAI, as well as the Jupiter network, the super-fast internal network that allows all its servers to talk to each other and move massive amounts of data around. (In a blog post late last year, Vahdat said that Jupiter now scales to 13 petabits per second, explaining that’s enough bandwidth to theoretically support a video call for all 8 billion people on Earth simultaneously.) \nVahdat has also been deeply involved in the ongoing development of the Borg software system, Google’s cluster management system that acts as the brain coordinating all the work happening across its data centers. And he has said he oversaw the development of Axion, Google’s first custom Arm-based general-purpose CPUs designed for data centers, which the company unveiled last year and continues to build.\nIn short, Vahdat is central to Google’s AI story.\nIndeed, in a market where top AI talent commands astronomical compensation and constant recruitment, Google’s decision to elevate Vahdat to the C-suite may also be about retention. When you’ve spent 15 years building someone into a linchpin of your AI strategy, you make sure they stay.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google’s answer to the AI arms race — promote the guy behind its data center tech",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Screenshot-2025-12-10-at-4.33.43-PM.png?w=150"
      ],
      "datePublished": "2025-12-11T01:10:04.000Z",
      "dateModified": "2025-12-11T01:10:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Port raises $100M at $800M valuation to take on Spotify’s Backstage",
    "url": "https://techcrunch.com/2025/12/11/port-raises-100m-at-800m-valuation-to-take-on-spotifys-backstage/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Port-founders-e1764962616421.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-11T11:00:00.000Z",
    "description": "\nSpotify may be synonymous with music streaming, but it’s also got a wildly popular developer-tool side-hustle called “Backstage.”  \nBackstage is an o",
    "body": "\nSpotify may be synonymous with music streaming, but it’s also got a wildly popular developer-tool side-hustle called “Backstage.”  \nBackstage is an open source project that helps companies build their own internal developer portals: a catalog of their developer tools along with quick visualizations of the work the tools have done, and other metrics. But like many open-source projects, Backstage is a build-it-yourself option.  \nIsraeli startup Port has been gaining big-name customers like GitHub, British Telecom and LG with a proprietary Backstage competitor: a dev tool portal that’s also now been geared to manage AI agents.  \nOn Thursday, Port, founded in 2022, said it raised a fresh $100 million Series C round led by General Atlantic, with participation from Accel, Bessemer Venture Partners and Team8. The round values Port at $800 million and brings its total funding to date to $158 million. This Series C follows the company’s $35 million Series B led by Accel and Bessemer, announced in May. \nOf all the industries that LLM-based tech has infiltrated, coding is where it has the deepest roots. So, not surprisingly, developers are also on the cutting edge of building and adopting agents that can automate entire repeated processes — work far beyond asking AI to write some code. \nBut the problem here, according to Port co-founder and CEO Zohar Einy, it’s the wild west right now for such devtool agents at companies: finding them, sharing them, ensuring their work follows company standards and so on.\nDevelopers “want to take AI beyond just coding. They want it to resolve incidents, resolve security issues. They want it to take care of the release management,” Einy told TechCrunch. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBut if agents are connected to all kinds of different tools and data sources, if the data is scattered among them, if they have no way to collaborate, and have no corporate standards and guardrails, “it creates chaos,” his product pitch goes. \nPort therefore offers more than just a catalog of dev and agent tools (although it does offer that). It supplies a layer of orchestration with features that measure agent performance and add a human-in-the-loop, as desired, to approval processes.  \nA feature called “context lake” defines the data sources, context memory, and guardrails for agents. “It’s where you manage what agents ‘need to know’ to do their job safely and correctly,” Einy explained. \nIn addition to using Port to catalog agents devs have already created using other tools, they can use Port to create new agents. Plus, Port also offers a few of its own ready-made agents, which can do things like resolving helpdesk tickets and dealing with provisioning. \nEiny describes his product as handling the other 90% of what software programmers do that isn’t writing code. “It gives the engineers a user interface to control the agent, to iterate with the agent, to approve what it does that is not coding, that is all the 90%.” \nWith its giant new war chest of cash, big name customers and tier-one VCs, Port looks like an agentic management startup to watch. But to say it faces competition is an understatement.\nThe entire category of agentic management and orchestration is flooded with hopefuls, from big tech companies to startups, and they’re all coming at the various new problems in the space from different angles. A few of these include LangChain, UiPath, Cortex and more. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Port raises $100M at $800M valuation to take on Spotify’s Backstage",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/12/Port-founders-e1764962616421.jpg?w=150"
      ],
      "datePublished": "2025-12-11T11:00:00.000Z",
      "dateModified": "2025-12-11T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]