[
  {
    "title": "Kim Kardashian says ChatGPT is her ‘frenemy’",
    "url": "https://techcrunch.com/2025/11/07/kim-kardashian-says-chatgpt-is-her-frenemy/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/Kim-Kardashian-Headshot-e1664830753133.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T16:58:22.000Z",
    "description": "In Brief Posted: 8:58 AM PST · November 7, 2025  Image Credits:Spotify  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Celebrities: They’re just like us? In a Vanity Fair interview, Kim Kardashian — who has been...",
    "body": "\nIn Brief\nPosted:\n8:58 AM PST · November 7, 2025\n\nImage Credits:Spotify\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nCelebrities: They’re just like us? In a Vanity Fair interview, Kim Kardashian — who has been studying to become a lawyer — discussed her “toxic” friendship with ChatGPT, admitting that she has failed law exams after it told her false information.\n“I use [ChatGPT] for legal advice, so when I am needing to know the answer to a question, I will take a picture and snap it and put it in there,” she said. “They’re always wrong. It has made me fail tests… And then I’ll get mad and I’ll yell at it and be like, ‘You made me fail!’” \nChatGPT is prone to hallucinations, meaning that the LLM will create fake answers sometimes, rather than admit that it cannot confidently respond to a prompt. This technology isn’t necessarily programmed to know what information is “correct” or not — rather, it is trained on an unfathomably massive heap of data and prompted to predict the most likely response to an input, which may not be factually accurate. Some lawyers have been sanctioned for using ChatGPT when writing legal briefs, which becomes obvious to those reviewing the briefs, since they cite cases that don’t exist.\nKardashian said she will try to appeal to ChatGPT’s emotions after it lets her down — but this is a futile plan, since ChatGPT does not have feelings.\n“I will talk to it and say, ‘Hey, you’re going to make me fail, how does that make you feel that you need to really know these answers?’” she said. “And then it’ll say back to me, ‘This is just teaching you to trust your own instincts.’”\nBut while ChatGPT may not have feelings, that doesn’t mean that we — human beings — don’t have feelings about it. \n“I screenshot all the time and send it to my group chat, like, ‘Can you believe this b—- is talking to me like this?’”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Chris Sacca’s VC firm is raising a second nuclear fusion fund ",
    "url": "https://techcrunch.com/2025/11/06/chris-saccas-vc-firm-is-raising-a-second-nuclear-fusion-fund/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/08/chris-sacca.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T23:33:05.000Z",
    "description": "Chris Sacca’s venture firm Lowercarbon Capital is raising a second fund to back nuclear fusion energy hopefuls, the VC said at the SOSV Climate Tech Summit on Thursday, as reported by Bloomberg.   The firm...",
    "body": "\nChris Sacca’s venture firm Lowercarbon Capital is raising a second fund to back nuclear fusion energy hopefuls, the VC said at the SOSV Climate Tech Summit on Thursday, as reported by Bloomberg.  \nThe firm has backed leading fusion startup Commonwealth Fusion Systems, as well as others like Pacific Fusion. It raised a $250 million, fusion-geared fund in 2022. Fusion believers, who include a number of well-known climate VCs beyond Sacca (like Vinod Khosla), still hold faith that a breakthrough needed to make it commercially viable is just around the corner. And several advances are showing promise of delivering one.\nIn the meantime, building fusion reactors is expensive. Commonwealth raised $863 million earlier this year, after raising a $1.8 billion Series B four years ago. TechCrunch has documented a dozen fusion startups that have raised over $100 million. \nSacca didn’t say how big this second fund will be, but a source told Bloomberg that it’s intended to be bigger than the first. \n"
  },
  {
    "title": "Grand Theft Auto VI is delayed — again",
    "url": "https://techcrunch.com/2025/11/06/grand-theft-auto-vi-is-delayed-again/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/12/grand-theft-auto-youtube-record.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T22:02:24.000Z",
    "description": "Grand Theft Auto VI, one of the most anticipated video games of all time, has been delayed, again — this time until November 19, 2026. The game was initially slated for a fall 2025 release but was pushed back...",
    "body": "\nGrand Theft Auto VI, one of the most anticipated video games of all time, has been delayed, again — this time until November 19, 2026.\nThe game was initially slated for a fall 2025 release but was pushed back to May 2026. On Thursday, Rockstar Games announced that the development team needs another six months.\n“We are sorry for adding additional time to what we realize has been a long wait, but these extra months will allow us to finish the game with the level of polish you have come to expect and deserve,” Rockstar Games wrote in their statement.\nGrand Theft Auto VI is the sequel to Grand Theft Auto V, which was released in 2013. According to Guinness World Records, that game became the fastest entertainment property to reach $1 billion in sales, hitting the milestone after just three days on the market. Fans are so eager for the next installment in the franchise that when Rockstar Games released the trailer for the game in December 2023, it broke the record for the most YouTube views in 24 hours (excluding music videos).\nRockstar Games did not provide additional details about the delay. Last week, the company fired between 30 and 40 employees for allegedly sharing confidential information in a Discord server.\n"
  },
  {
    "title": "Laude Institute announces first batch of ‘Slingshots’ AI grants",
    "url": "https://techcrunch.com/2025/11/06/laude-institute-announces-first-batch-of-slingshots-ai-grants/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Laude-Slingshots-One.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:55:05.000Z",
    "description": "In Brief Posted: 1:55 PM PST · November 6, 2025  Image Credits:Laude Institute  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  On Thursday, the Laude Institute announced its first batch of Slingshots grants, aimed...",
    "body": "\nIn Brief\nPosted:\n1:55 PM PST · November 6, 2025\n\nImage Credits:Laude Institute\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOn Thursday, the Laude Institute announced its first batch of Slingshots grants, aimed at “advancing the science and practice of artificial intelligence.”\nDesigned as an accelerator for researchers, the Slingshots program is meant to provide resources that would be unavailable in most academic settings, whether it’s funding, compute power, or product and engineering support. In exchange, the recipients pledge to produce some final work product, whether it’s a startup, an open-source codebase, or another type of artifact.\nThe initial cohort is fifteen projects, with a particular focus on the difficult problem of AI evaluation. Some of those projects will be familiar to TechCrunch readers, including the command-line coding benchmark Terminal Bench and the latest version of the long-running ARC-AGI project.\nOthers take a fresh approach to a long-established evaluation problem. Formula Code, built by researchers at CalTech and UT Austin, aims to produce an evaluation of AI agents’ ability to optimize existing code, while the Columbia-based BizBench proposes a comprehensive benchmark for “white-collar AI agents.” Other grants explore new structures for reinforcement learning or model compression.\nSWE-Bench co-founder John Boda Yang is also part of the cohort, as leader of the new CodeClash project. Inspired by the success of SWE-Bench, CodeClash will assess code through a dynamic competition-based framework, which Yang hopes will make the results more comprehensive.\n“I do think people continuing to evaluate on core third-party benchmarks drives progress,” Yang told TechCrunch. “I’m a little bit worried about a future where benchmarks just become specific to companies.” \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "GoWish’s shopping and wish list app is having its biggest year yet",
    "url": "https://techcrunch.com/2025/11/07/gowishs-shopping-and-wishlist-app-is-having-its-biggest-year-yet/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/gowish.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T20:16:32.000Z",
    "description": "Recession fears aren’t hurting the wish list and shopping app GoWish, which is seeing record numbers ahead of the 2025 holiday season. The app, which has north of 13.6 million registered users, had its best...",
    "body": "\nRecession fears aren’t hurting the wish list and shopping app GoWish, which is seeing record numbers ahead of the 2025 holiday season. The app, which has north of 13.6 million registered users, had its best day yet this week, when on Monday it hit No. 2 on the U.S. App Store.\nWhile GoWish has seen similar adoption trends in previous years, this year has proven to be a breakout success. The app doubled the number of users from last year, and it has been breaking records with hundreds of thousands of new daily users in the month of November.\nIn the U.S. alone, the app has nearly 6.2 million users, while it has around 1 million in the U.K. In its home market of Denmark, the wish list app has over 50% market penetration and over 3.5 million registered Danish users.\nThough today it operates as a tech company, GoWish has a unique origin story. \nImage Credits:GoWish\nThe app was originally launched in 2015 by the Danish-Swedish national postal service PostNord as “Ønskeskyen.” (That’s Danish for “wish cloud.”) It was just a seasonal wish list gimmick, but its founders saw the potential for it to be something more.\nIn 2020, GoWish was acquired by Danish VC Dotcom Capital, which is owned by founder Casper Ravn‑Sørensen, who is also GoWish’s chief growth officer, and his partner, CEO Mads Dahlerup. They spun it out as an independent tech company and created an international version of Ønskeskyen (the app’s name in Denmark and Norway).\n“We might be the first state-founded tech platform to go global as a privately-owned scale-up,” Ravn‑Sørensen told TechCrunch.\nImage Credits:GoWish\nConsumers can use the app to create multiple wish lists for themselves, their family, and friends, and for different occasions. Wishes — or products you can buy from online retailers — can be added directly to your list by copying and pasting a URL, searching for a product, or browsing the inspiration feeds that feature millions of products. When you’re ready to buy, you can tap a button in the app to go directly to the retailer’s website.\nThe company has around 65,000 affiliate partnerships and over 700 brand partnerships, many of which are now adding “GoWish” buttons to their own websites. This model has been successful, explained Ravn‑Sørensen, as the app saw net profits after tax of $1.7 million in its fiscal year 2024, which are being reinvested in its growth. (GoWish declined to disclose its total revenue.)\nThe company attributes its increased adoption this year to the marketing it’s been doing across Meta, TikTok, Google, and Snap. Snap even gave GoWish a shoutout on its Q4 earnings call, as it’s been one of Snap’s partner success stories.\n“We’re very good at optimising our marketing spends across digital platforms and that makes our global roll-out very effective,” Ravn‑Sørensen said. \nThe company will later augment its experience with AI, but isn’t yet sharing details about those plans.\n“We have a mission of ‘fixing gifting’,” noted Ravn‑Sørensen, adding that GoWish wants to make “users’ dreams and wishes come true while making double-gifting and returns a thing of the past.” (The app lets family and friends reserve items on users’ wish lists so users won’t receive the same gift from multiple people.)\n“Yet, on a longer trajectory, we want to become the ‘global genie’ of social shopping, that can predict future consumer trends across generations,” he said. \nThe Copenhagen-based company is currently a team of 90 and is backed by Capital D, a London-based private equity firm that bought one-third of the company in early 2025; the rest is owned by the Danish VC Dotcom Capital. \nGoWish is available on iOS and Android and offers a Chrome extension to add items to wish lists from your computer.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Congressional Budget Office confirms it was hacked",
    "url": "https://techcrunch.com/2025/11/07/congressional-budget-office-confirms-it-was-hacked/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/us-congress-at-night.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T16:36:55.000Z",
    "description": "The congressional research office confirmed a breach, but did not comment on the cause. A security researcher suggested the hack may have originated because CBO failed to patch a firewall for more than a year.",
    "body": "\nThe U.S. Congressional Budget Office has confirmed it was hacked. \nCaitlin Emma, a spokesperson for CBO, told TechCrunch on Friday that the agency is investigating the breach and “has identified the security incident, has taken immediate action to contain it, and has implemented additional monitoring and new security controls to further protect the agency’s systems going forward.” \nCBO is a nonpartisan agency that provides economic analysis and cost estimates to lawmakers during the federal budget process, including after legislative bills get approved at the committee level in the House and Senate. \nOn Thursday, The Washington Post, which first revealed the breach, reported that unspecified foreign hackers were behind the intrusion. According to the Post, CBO officials are worried that the hackers accessed internal emails and chat logs, as well as communications between lawmakers’ offices and CBO researchers. \nReuters reported that the Senate Sergeant at Arms office, the Senate’s law enforcement agency, notified congressional offices of a breach, warning them that emails between CBO and the offices could have been compromised and used to craft and send phishing attacks. \nIt’s unclear how the hackers gained access to the CBO’s network. But soon after news of the breach became public, security researcher Kevin Beaumont wrote on Bluesky that he suspected hackers may have exploited the CBO’s outdated Cisco firewall to break into the agency’s network.  \nLast month, Beaumont noted that CBO had a Cisco ASA firewall on its network that was last patched in 2024. At the time of his posting, the CBO’s firewall was allegedly vulnerable to a series of newly discovered security bugs, which were being exploited by suspected Chinese government-backed hackers.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBeaumont said the CBO’s firewall had not been patched by the time the federal government shutdown took effect on October 1. \nOn Thursday, Beaumont said that the firewall is now offline. \nThe CBO’s spokesperson declined to comment when asked about Beaumont’s findings. Spokespeople for Cisco did not immediately respond to a request for comment.  \n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Accel backs Uber rival Rapido as Prosus boosts stake",
    "url": "https://techcrunch.com/2025/11/06/accel-backs-uber-rival-rapido-as-prosus-boosts-stake/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/rapido.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T22:12:18.000Z",
    "description": "TVS Motor booked a 152% return as it sold its Rapido stake to Accel and Prosus. Founded in 2015, Rapido has grown into a major player in India's ride-hailing market, competing with Uber, Ola, and inDrive.",
    "body": "\nAccel has invested in Rapido, the ride-hailing platform competing with Uber in India, while Prosus has increased its stake, after Indian two-wheeler giant TVS Motor sold its entire holding.\nOn Thursday, TVS Motor said in a stock exchange filing (PDF) that it has sold its entire stake in Rapido for ₹2.88 billion (about $32 million) to Accel and Prosus’ investment unit, MIH Investments, securing a return of more than 152% over the past three years.\nFounded in 2015, Rapido has grown into a major player in India’s ride-hailing market, competing with Uber, Ola, and inDrive. The company began with bike taxis before expanding into auto-rickshaw bookings and car services and has added courier services to its platform. It has more recently been piloting a food-delivery service in select cities, entering a segment dominated by Swiggy and Zomato.\nTVS Motor first invested in Rapido in April 2022 as part of the company’s $180 million Series D round, joining existing backers such as WestBridge Capital, Shell Ventures, and Nexus Venture Partners. The automaker bought its stake at that time for ₹1.14 billion, according to its earlier investor disclosures (PDF).\nAs part of the latest transaction, Accel purchased 11,997 preference shares in Rapido, while Prosus acquired 11,988 preference shares and 10 equity shares. Both investors paid about ₹1.44 billion (roughly $16 million) each.\nAccel’s backing of Rapido marks a return to India’s ride-hailing sector for the firm, which was an early investor in Ola. The move comes as Rapido is in talks with Accel and Prosus for a new primary funding round that could close next year, according to two people familiar with the matter who spoke to TechCrunch. The exact funding size has yet to be determined.\nProsus is already an investor in Rapido and expanded its stake through another secondary share sale in September, when Swiggy sold its entire holding. That transaction doubled Rapido’s valuation to $2.3 billion, TechCrunch reported.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAccel and Prosus are also early backers of Swiggy, which exited Rapido after citing a potential conflict of interest, as the ride-hailing startup prepared to expand into the food-delivery market.\nAccel and Prosus did not respond to requests for comment. Rapido could not be reached for comment.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Amazon launches a low-price standalone shopping app, Amazon Bazaar, in over a dozen markets",
    "url": "https://techcrunch.com/2025/11/07/amazon-launches-a-low-price-standalone-shopping-app-amazon-bazaar-in-over-a-dozen-markets/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/amazon-bazaar-.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T15:25:41.000Z",
    "description": "On Friday, Amazon announced the debut of Amazon Bazaar, a new low-cost shopping destination for Asia, Africa, and Latin America that will be available separately from the main Amazon shopping app. On Bazaar,...",
    "body": "\nOn Friday, Amazon announced the debut of Amazon Bazaar, a new low-cost shopping destination for Asia, Africa, and Latin America that will be available separately from the main Amazon shopping app. On Bazaar, most products are available under $10, and some are as low as $2, the retailer says.\nThe product selection, available now on Android and iOS, will be available in its own app that’s available in Hong Kong, the Philippines, Taiwan, Kuwait, Qatar, Bahrain, Oman, Peru, Ecuador, Argentina, Costa Rica, the Dominican Republic, Jamaica, and Nigeria.\nAmazon says more markets will gain access to the app in the months ahead.\nThe app has significant overlap with Amazon Haul, which launched last November as a competitor to Shein and Temu. Haul operates as part of Amazon’s main website and app, and will remain available in its existing markets, including the U.S., U.K., Germany, France, Italy, Spain, Japan, and Australia.\nIn other markets, Amazon had already branded Amazon Haul as Bazaar, where it’s been available through Amazon’s main shopping app. That version also remains available in Mexico, Saudi Arabia, and the United Arab Emirates, in addition to India. (Amazon using two names for the same low-cost selection of inventory is confusing! But Amazon thinks the different names “better resonate with local language preferences and cultures.”)\nImage Credits:Amazon\nThe move to create a standalone shopping destination for its cheaper inventory signals Amazon is ramping up the competition with the low-cost Chinese shopping apps, like Temu, Shein, and TikTok (TikTok Shop), which have seen broad adoption by younger users and others without as much disposable income to spend on clothing, decor, electronics, and other household items.\nThe Bazaar app will offer these users “hundreds of thousands” of affordable products in categories like fashion, home goods, and lifestyle products, the retailer says. Product pages feature familiar Amazon features like customer reviews and star ratings. \nImage Credits:Amazon\nCustomers use their same Amazon credentials to shop and check out, where they can use Visa, Mastercard, or American Express. Orders will have to meet the local minimum purchase amount to qualify for free shipping. (This varies by market.) For smaller orders, a standard delivery fee is charged. \nShipments take around 2 weeks or less, returns are free within 15 days of receipt, and Amazon offers multilingual customer support. The app itself supports six languages: English, Spanish, French, Portuguese, German, and Traditional Chinese.\nThe app will also engage customers with interactive features like social lucky draws and promotions — things popularized by the Chinese shopping apps. New customers will also receive 50% off their first delivery as an incentive to try the app. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Texas AG sues Roblox, accusing it of prioritizing ‘pixel pedophiles’ over child safety",
    "url": "https://techcrunch.com/2025/11/07/texas-ag-sues-roblox-accusing-it-of-prioritizing-pixel-pedophiles-over-child-safety/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/09/Roblox_Library.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T14:24:27.000Z",
    "description": "In a statement, Paxton alleged that Roblox chooses to prioritize \"pixel pedophiles\" and profit over the safety of children, and said the platform has become a \"breeding ground for predators.\"",
    "body": "\nTexas Attorney General Ken Paxton late on Thursday said he is suing online gaming platform Roblox over child safety concerns, accusing the company of “deceiving parents about the dangers of its platform.”\nIn a statement, Paxton alleged that Roblox chooses to prioritize “pixel pedophiles” and profit over the safety of children, and said the platform has become a “breeding ground for predators.”\n“We cannot allow platforms like Roblox to continue operating as digital playgrounds for predators,” Paxton said. “Roblox must do more to protect kids from sick and twisted freaks hiding behind a screen. Any corporation that enables child abuse will face the full and unrelenting force of the law.”\nPaxton’s lawsuit follows similar cases by the attorneys general of Louisiana and Kentucky, as well as multiple cases in California, Texas, and Pennsylvania against Roblox. The company has come under fire repeatedly for not implementing adequate child safety measures and exposing minors to dangers like grooming, explicit content, and violent or abusive material.\nIn light of such cases and investigations, governments around the world have been rolling out increasingly strict laws and regulations that require social platforms to verify users’ ages, like the U.K.’s Online Safety Act and Mississippi’s age-assurance law. Other states, including Arizona, Wyoming, South Dakota, and Virginia, are also considering similar laws.\nThe company has so far responded by adding a slew of safety features, including an age-estimation system that scans users’ selfies and analyzes facial features to estimate age, standardized content and maturity labels, an AI system to detect early signals of child endangerment, safeguards for teenagers, content controls, and more. The company also offers parental controls, tools to restrict communications, and technology that detects when a large number of users are breaking its rules.\nRoblox had 151.5 million daily active users as of September 30, 2025.\nRoblox said it has implemented “industry-leading protocols” to protect users and address malicious activity, and noted that it is “disappointed” by the lawsuit. “We are disappointed that, rather than working collaboratively with Roblox on this industry-wide challenge and seeking real solutions, the AG has chosen to file a lawsuit based on misrepresentations and sensationalized claims,” a company spokesperson said in an emailed statement.\n“Roblox is deeply committed to child safety. Our policies are purposefully stricter than those found on many other platforms. We prohibit the sharing of images and videos in chat, use filters designed to block the exchange of personal information and our trained teams and automated tools continuously monitor communications to detect and remove harmful content,” the spokesperson said.\nNote: This story was updated to add Roblox’s comments.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "‘Landfall’ spyware abused zero-day to hack Samsung Galaxy phones",
    "url": "https://techcrunch.com/2025/11/07/landfall-spyware-abused-zero-day-to-hack-samsung-galaxy-phones/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/02/CMC_60351.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T11:03:00.000Z",
    "description": "Security researchers have discovered an Android spyware that targeted Samsung Galaxy phones during a nearly year-long hacking campaign. Researchers at Palo Alto Networks’ Unit 42 said the spyware, which they...",
    "body": "\nSecurity researchers have discovered an Android spyware that targeted Samsung Galaxy phones during a nearly year-long hacking campaign.\nResearchers at Palo Alto Networks’ Unit 42 said the spyware, which they call “Landfall,” was first detected in July 2024 and relied on exploiting a security flaw in the Galaxy phone software that was unknown to Samsung at the time, a type of vulnerability known as a zero-day. \nUnit 42 said the flaw could be abused by sending a maliciously crafted image to a victim’s phone, likely delivered through a messaging app, and that the attacks may not have required any interaction from the victim. \nSamsung patched the security flaw — tracked as CVE-2025-21042 — in April 2025, but details of the spyware campaign abusing the flaw have not been previously reported.\nThe researchers said in a blog post that it’s not known which surveillance vendor developed the Landfall spyware, nor is it known how many individuals were targeted as part of the campaign. But the researchers said that the attacks likely targeted individuals in the Middle East.\nItay Cohen, a senior principal researcher at Unit 42, told TechCrunch that the hacking campaign consisted of a “precision attack” on specific individuals and not a mass-distributed malware, which indicates that the attacks were likely driven by espionage.\nUnit 42 found that the Landfall spyware shares overlapping digital infrastructure used by a known surveillance vendor dubbed Stealth Falcon, which has been previously seen in spyware attacks against Emirati journalists, activists, and dissidents as far back as 2012. But the researchers said that the links with Stealth Falcon, while intriguing, were not enough to clearly attribute the attacks to a particular government customer.\nUnit 42 said that the Landfall spyware samples that they discovered had been uploaded to VirusTotal, a malware scanning service, from individuals in Morocco, Iran, Iraq, and Turkey throughout 2024 and early 2025.\nTurkey’s national cyber readiness team, known as USOM, flagged one of the IP addresses that the Landfall spyware connected to as malicious, which Unit 42 said supports the theory that individuals in Turkey may have been targeted.\nMuch like other government spyware, Landfall is capable of broad device surveillance, such as accessing the victim’s data, including photos, messages, contacts, and call logs, as well as the tapping of the device’s microphone and tracking their precise location.\nUnit 42 found that the spyware’s source code referenced five specific Galaxy phones, including the Galaxy S22, S23, S24, and some Z models, as targets. Cohen said that the vulnerability may have also been present on other Galaxy devices, and affected Android versions 13 through 15. \nSamsung did not respond to a request for comment.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Washington Post confirms data breach linked to Oracle hacks",
    "url": "https://techcrunch.com/2025/11/07/washington-post-confirms-data-breach-linked-to-oracle-hacks/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/washington-post-2155584034.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T19:22:35.000Z",
    "description": "Image Credits:Andrew Harnik / Getty Images\t \t \t\t\t\t\t\t11:22 AM PST · November 7, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t The Washington Post has said that it was one of the victims of a hacking campaign tied to Oracle’s suite of...",
    "body": "\n\t\n\t\tImage Credits:Andrew Harnik / Getty Images\t\n\t\n\t\t\t\t\t\t11:22 AM PST · November 7, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe Washington Post has said that it was one of the victims of a hacking campaign tied to Oracle’s suite of corporate software apps.  \nReuters first reported the news on Friday, citing a statement from the newspaper that said it was affected “by the breach of the Oracle E-Business Suite platform.” \nA spokesperson for the Post did not immediately respond to TechCrunch’s request for comment.\nWhen reached by email, Oracle spokesperson Michael Egbert referred TechCrunch to its two advisories that it previously posted, and did not answer our questions. \nLast month, Google said that the ransomware gang Clop was targeting companies after exploiting multiple vulnerabilities in Oracle’s E-Business Suite software, which companies use for their business operations, storing their human resources files, and other sensitive data. \nThe exploits allowed the hackers to steal customer business data and employee records from more than 100 companies, per Google.\nThe hackers’ campaign began in late September when corporate executives reported receiving extortion messages sent from email addresses previously associated with the Clop gang, claiming that the hackers had stolen large amounts of sensitive internal business data and employees’ personal information from hacked Oracle systems. \nAnti-ransomware firm Halcyon told TechCrunch at the time that the hackers demanded one executive at an affected company to pay $50 million in a ransom payment. \nOn Thursday, Clop claimed on its website that it had hacked The Washington Post, claiming that the company “ignored their security,” language that the Clop gang typically uses when the victim does not pay the hackers. \nIt’s not uncommon for ransomware or extortion gangs like Clop to publicize the names and stolen files of their victims as a pressure tactic, which can suggest that the victim has not negotiated a payment with the gang, or the negotiation broke down. \nSeveral other organizations have confirmed they are affected by the Oracle E-Business hacks, including Harvard University and American Airlines subsidiary Envoy.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Rivian gives RJ Scaringe a new pay package worth up to $5B",
    "url": "https://techcrunch.com/2025/11/07/rivian-gives-rj-scaringe-a-new-pay-package-worth-up-to-5b/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/10/TechCrunch-Disrupt-Haje-Kamps-517.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T21:02:22.000Z",
    "description": "Rivian has given its founder and CEO RJ Scaringe a new performance-based stock award that could ultimately be worth around $5 billion if all the underlying goals are met, according to a new filing. Scaringe’s...",
    "body": "\nRivian has given its founder and CEO RJ Scaringe a new performance-based stock award that could ultimately be worth around $5 billion if all the underlying goals are met, according to a new filing.\nScaringe’s salary is also being doubled to $2 million per year, and he was given a 10% stake in Rivian’s newest spinout Mind Robotics, the filing shows. \nThe announcement comes just one day after Tesla shareholders voted to approve a compensation package for its CEO Elon Musk that could be worth $1 trillion — the largest in corporate history.\nUnlike Musk’s pay package, Scaringe’s isn’t subject to a shareholder vote. The compensation committee on Rivian’s board of directors has canceled a similar-sized performance award given to Scaringe in 2021 as part of a company-wide equity incentive plan adopted that year. The new award is being issued under the same, already-approved 2021 equity incentive plan.\nThe committee decided to cancel the 2021 performance award in part because of the “unlikeliness” that Scaringe could reach the goals required. The 2021 award consisted of 20,355,946 stock options that vested in part based on stock price increases. Six years past the grant date, if Rivian’s share price passed $110, $150, $220, and $295, Scaringe would be able to purchase the stock options in corresponding tranches for just $21.72. \nRivian’s stock shot up to around $129 following its IPO in November 2021. But it fell to around $30 over the next six months, and has spent the last few years typically trading between $10 and $20. This has made it harder for Scaringe to access even part of the 2021 award, let alone the total value of around $6 billion, according to the company. (Scaringe was awarded another 6.8 million stock options that simply vest over time in the 2021 award that were not tied to performance, and the company says those have not been canceled.)\nIn the filing, Rivian wrote that this created a “lack of incentive.” So the compensation committee decided to replace the old award with this new one.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Following a review, and input from an independent compensation consultant, the Compensation Committee cancelled our CEO’s 2021 Performance Grant and issued a new performance stock option and increased our CEO’s base salary,” Rivian said in a statement to TechCrunch. “This new award is designed to retain and incentivize RJ to execute on the Company’s critical next phase as it progresses its technology roadmap and launches R2.” \nSimilar to how Tesla pitched its new award to Musk, Rivian also said the performance grant to Scaringe is “structured in such a way that ensures the options only vest should the company deliver significant value to our shareholders.” The company pointed out that Scaringe won’t see $1 from the award before he helps add $32 billion in value to Rivian, and that shareholders will see “$153 billion of value creation” if he hits all milestones.\nThe maximum amount of shares available to Scaringe under new performance award is 36,500,000. He has 10 years to hit milestones that unlock the full amount, and if he does, he would own an additional 3% of the company. (Scaringe currently owns about 1% of Rivian, down from around 2% earlier this year after he transferred a portion of his holdings to his ex-wife as part of their divorce settlement, as TechCrunch first reported.)\nA majority of those stock options — 22 million — is tied to new stock price hurdles. Scaringe will earn 2 million shares once Rivian’s stock hits $40, and then another 2 million shares for every $10 increase up to a stock price of $140. \nThe remaining 14,500,000 stock options are locked away until Rivian reaches certain adjusted operating income and cash flow targets. Scaringe will have to pay a strike price of $15.22 per share to exercise these options — a possible total of around $555 million.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "How startups can lure good talent fairly without big tech bank accounts ",
    "url": "https://techcrunch.com/2025/11/08/how-startups-can-lure-good-talent-fairly-without-big-tech-bank-accounts/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Comp-panel.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-08T14:00:00.000Z",
    "description": "Startups have never been able to offer the same sizable salaries as big tech companies. Now with companies like Meta and OpenAI willing to pay million-dollar salaries amid the AI race — the compensation...",
    "body": "\nStartups have never been able to offer the same sizable salaries as big tech companies. Now with companies like Meta and OpenAI willing to pay million-dollar salaries amid the AI race — the compensation divide has grown even larger.\nEarly-stage startups are not doomed though. If they develop a compensation strategy that is generous, fair, and flexible, they can offer competitive compensation packages and give themselves room to adjust their approach as they grow, according to founders and experts who were onstage at TechCrunch Disrupt 2025.\nStartups shouldn’t try to compete with big tech companies anyway, Yin Wu, the co-founder and CEO of equity management software Pulley, said on stage at TechCrunch Disrupt in October. She added that a stable tech company and a startup don’t generally attract the same potential candidates to begin with.\nStartups should instead be as charitable as they can in their compensation packages, Wu said, regardless of their inability to match a big tech company’s paycheck.\n“My pretty strong opinion when it comes to equity for a startup is that you should be more generous than what you think you should be,” Wu said. “I think it is unlikely, if the company is really successful, you’re going to look back and say, ‘man, I gave away too much equity of everyone that was at my company trying to make this company really successful.’”\nRandi Jakubowitz, the head of talent at 645 Ventures, agreed. Jakubowitz added that when a startup is looking to make a competitive offer, they should set clear goals for the person they are hiring to ensure that hire lives up to the compensation they are getting.\n“Make sure you’re holding them accountable and make sure that you understand what the implications are from a vesting cliff standpoint,” Jakubowitz said, regarding when employees gain control over their equity stakes. “That’s where, if you don’t move quickly if someone’s underperforming, that’s equity that you’ll never get back if they are fully vested. Make sure that there’s very clear accountability. “\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe panelists also stressed that companies don’t need to get their compensation and equity strategies set in stone from the start. Startups should instead ensure their approach is fair from the beginning, so even if they do want to change, they have the proper foundation to do so without setting themselves up for legal trouble or soured office politics.\nFor Wu, and her company Pulley, that meant setting standards around compensation packages. Wu said the company pays a set range for each role — regardless of where a potential employee is based — and consistently builds compensation packages with equity offerings in the 90th percentile.\n“Having this framework allowed us to be able to grow and say ‘great, as the company continues to do well, the actual number of shares you receive is going to differ because the value the companies differ, but that framework is still applied.”\nRebecca Lee Whiting, founder of Epigram Legal and fractional general counsel, added that having these standards will help companies avoid potential legal pitfalls down the line. For instance, it helps companies avoid offering unequal pay across candidates of different genders — which is something all companies should try to avoid ethically — but is also illegal in states like California, Whiting noted.\nWhiting, Wu and, Jakubowitz all agreed that as long as founders approach building their compensation packages with fair intentions, everything else can be adjusted or changed down the line.\n“I think it’s really important to think about not just that process. Think about who are the people you’re trying to hire and what is going to incentivize them to take that offer,” Whiting said. “It’s not something that you have to get right out of the gate. You will likely have to do clean up post the Series B and acknowledging that is okay. But don’t try and get it perfect out of the out of the gate when you’re hiring your first few people.”\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Tesla shareholders approve Elon Musk’s $1T pay package",
    "url": "https://techcrunch.com/2025/11/06/tesla-shareholders-approve-elon-musks-1t-pay-package/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2148555320.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:58:15.000Z",
    "description": "Tesla shareholders have overwhelmingly approved a compensation package for CEO Elon Musk that could be worth as much as $1 trillion in company shares. More than 75% of shareholders who participated voted to...",
    "body": "\nTesla shareholders have overwhelmingly approved a compensation package for CEO Elon Musk that could be worth as much as $1 trillion in company shares.\nMore than 75% of shareholders who participated voted to approve the plan, in line with the amount of support Musk has received for past pay packages. As the result was announced, shareholders in the room at Tesla’s Austin, Texas, factory began chanting: “Elon! Elon!”\nFlanked by dancing Optimus robots, Musk said Thursday that “what we’re about to embark upon is not merely a new chapter of the future of Tesla, but a whole new book.” \nUnder the deal, Musk will not be awarded $1 trillion right away. Nor will he receive a salary. But he stands to make hundreds of billions of dollars and gain more control of Tesla if he helps the company achieve a number of milestones and boost its profits along the way. Some of those hurdles will be difficult to clear. Many, though, are simply watered down versions of promises Musk has made for years.\nThe pay package is broken into 12 tranches — covering operational, adjusted profit, and market capitalization goals — each one giving more shares to Musk if those goals are reached. For instance, Tesla, which today has a market capitalization of about $1.5 trillion, will need to steadily increase that valuation and hit $8.5 trillion in a decade.\nThe vote followed two months of aggressive campaigning by Tesla, its board of directors, and many of its executives. The company repeatedly fired off public appeals for shareholders to approve the package. Chairwoman Robyn Denholm, who is typically media-shy, did multiple interviews with major news outlets and had lost some of her voice before addressing investors at Thursday’s meeting. Tesla even ran television advertisements about the vote — something it doesn’t even do for its cars.\n“Tesla is at an inflection point — I think I’ve said that 3,000 times over the last few weeks — and this last year has been a critical one in our history,” Denholm said Thursday. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMusk encouraged shareholders to approve the package because, he claimed, it was the easiest way to hand him more voting control over the company. He currently owns around 15%, but he’s threatened (multiple times) to leave Tesla if he doesn’t wind up with around 25% control. That amount would insulate him from being pushed out and losing control of the “robot army” Tesla is building, Musk has said.\nTesla stumped for the package in part by holding up the company’s “Master Plan 4” as a visionary statement for where Musk can lead things. That document, released in September, was gauzy and unspecific — a criticism Musk even agreed with. He claimed Tesla would add more specifics to the “Plan” just a few days after it was released, but nothing has changed in the intervening months.\nTesla’s board of directors put this pay package forward in large part because the previous plan from 2018 (worth around $56 billion) was struck down by Delaware’s Chancery Court last year, after a judge ruled the company was not transparent about the negotiation process. Tesla has appealed the decision.\nEarlier this year, Tesla handed Musk $29 billion in shares to make up for the loss of the 2018 package, but said it would essentially void that amount should Tesla win on appeal.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Tesla delays reveal of production Roadster 2 to April Fools’ Day",
    "url": "https://techcrunch.com/2025/11/06/tesla-delays-reveal-of-production-roadster-2-to-april-fools-day/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/09/Roadster_Hero.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T23:57:12.000Z",
    "description": "Tesla CEO Elon Musk said Thursday the company will reveal the production version of its second-generation Roadster supercar on April 1, 2026 — nearly nine years after he first revealed the project. Musk, who...",
    "body": "\nTesla CEO Elon Musk said Thursday the company will reveal the production version of its second-generation Roadster supercar on April 1, 2026 — nearly nine years after he first revealed the project.\nMusk, who is famous for missing deadlines, said during Tesla’s annual shareholder meeting that he chose April Fools’ Day in part because it affords “some deniability.” \n“Like, I could say I was just kidding” if it happens to be later, he said. \nRevealing the production version of the new Roadster next year is in itself a delay. Just one week ago he appeared on Joe Rogan’s podcast and repeated his claim that he wanted to show off the car by year’s end. \nMusk stressed Thursday the car “will be very different from what was shown previously,” and again teased that the demo will be the “most exciting, whether it works or not, demo ever of any product” — a not-so-sly nod to the fact that he’s spent years trying to make the new Roadster fly in some fashion, possibly with SpaceX-built thrusters.\nMusk went on to say that he believes the second-generation Roadster won’t go into production until 12 to 18 months after the April reveal. \nDuring the Q&A portion of the meeting, one shareholder asked Musk if customers who preordered the “Founders Series” version of the new Roadsters could be invited to the reveal event. Those were the customers who plopped down $250,000 to secure special versions of the car in 2017.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Sure, absolutely,” Musk answered. “It’s the least we can do for our long-suffering Roadster reservation holders.”\nOpenAI CEO Sam Altman was one of those long-time sufferers who recently attempted to cancel the reservation — and initially failed to get a refund — for the long-promised EV.\nEarlier this month, Altman posted on X a “tale in three acts,” which was comprised of several screenshots showing his initial reservation, a request for a refund of the $50,000 reservation fee, and his email bouncing back.\n“I really was excited for the car!” Altman wrote. “And I understand delays. But 7.5 years has felt like a long time to wait.”\nMusk, who has openly sparred with Altman for years, went on the attack. “And you forgot to mention act 4, where this issue was fixed and you received a refund within 24 hours,” Musk wrote. “But that is in your nature.”\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]