[
  {
    "title": "With upcoming ban, Meta begins to notify Australian teens that their accounts will be shut down",
    "url": "https://techcrunch.com/2025/11/19/with-upcoming-ban-meta-begins-to-notify-australian-teens-that-their-accounts-will-be-shut-down/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2194278734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T15:29:38.000Z",
    "description": "In Brief Posted: 7:29 AM PST · November 19, 2025  Image Credits:Hollie Adams/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  As Australia’s social media ban for teens under the age of 16...",
    "body": "\nIn Brief\nPosted:\n7:29 AM PST · November 19, 2025\n\nImage Credits:Hollie Adams/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAs Australia’s social media ban for teens under the age of 16 looms, Meta has started notifying teenage Facebook and Instagram users about the fate of their accounts. \nWhen the ban goes into effect on December 10, Meta will revoke teens’ access to their existing accounts, and as of December 4, will prevent users under 16 from starting new accounts. Once they turn 16, they will be able to access their old account as they left it.\nIt will be a challenge, however, for Meta to determine which users are under the age of 16, since people aren’t always truthful about their age when signing up for social media services. But digital age checks are notoriously difficult to execute in a manner that’s safe and effective. Identity verification services are high-profile targets for hacks, and the implications of even a minor security vulnerability are severe, since personal information and government documents can be exposed.\nIdentity verification platforms have already proven problematic for users’ security. Last year, 404 Media found that AU10TIX, a company that verifies the identity of users on TikTok, Uber, and X, had left administrative credentials exposed online for over a year, which allowed users’ sensitive information to be exposed.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n"
  },
  {
    "title": "Target joins OpenAI’s growing list of retail apps",
    "url": "https://techcrunch.com/2025/11/19/target-joins-openais-growing-list-of-retail-apps/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/2025_TargetxOpenAi_ChatGPT_PR-Image_Hero.png?w=150",
    "tag": "Tech",
    "date": "2025-11-19T14:36:12.000Z",
    "description": "In Brief Posted: 6:36 AM PST · November 19, 2025  Image Credits:OpenAI  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  OpenAI is pushing deeper into retail, with Target set to debut a new ChatGPT-powered app for...",
    "body": "\nIn Brief\nPosted:\n6:36 AM PST · November 19, 2025\n\nImage Credits:OpenAI\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOpenAI is pushing deeper into retail, with Target set to debut a new ChatGPT-powered app for shoppers in coming weeks.\nThe news follows OpenAI’s move last month to start adding dedicated retail apps to ChatGPT, including Canva, Coursera, Figma, Expedia, Spotify, and Zillow. It also comes as OpenAI races to rake in AI-driven commerce via new products like “Instant Checkout” that let users make purchases within conversations with retailers like Etsy and Shopify. \nThe Target app in ChatGPT will launch in beta next week, and it will let shoppers ask for ideas, browse and build multi-item baskets, shop for food, and check out, according to OpenAI.\nThe deal deepens OpenAI’s existing enterprise partnership with Target. Target will now roll out ChatGPT Enterprise across its 18,000 employees at its headquarters to be used for things like better supply chain forecasting and streamlining store processes. Target will also further integrate OpenAI’s models into digital tools that power everything from employee support and customer service to AI-driven shopping assistants and personalized gift finders.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nRelated\n\n\n\t\t\t\n\t\t\t\t\t\n\t\t\n\n\nLatest in AI\n"
  },
  {
    "title": "Adobe to buy Semrush for $1.9 billion",
    "url": "https://techcrunch.com/2025/11/19/adobe-to-buy-semrush-for-1-9-billion/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/GettyImages-2162453288.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T15:42:15.000Z",
    "description": "In Brief Posted: 7:42 AM PST · November 19, 2025  Image Credits:Jaque Silva/SOPA Images/LightRocket / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Adobe said on Wednesday that it has agreed to...",
    "body": "\nIn Brief\nPosted:\n7:42 AM PST · November 19, 2025\n\nImage Credits:Jaque Silva/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAdobe said on Wednesday that it has agreed to acquire search engine optimization company Semrush for about $1.9 billion in cash, as the Photoshop maker seeks to augment its suite of marketing offerings.\nIn a statement, Adobe said it would offer $12 per share for Semrush, almost double the latter’s closing price of $6.89 on Tuesday, before news of the deal. Semrush had a market capitalization of about $1 billion as of Tuesday’s close.\nBy acquiring Semrush, Adobe is betting that companies will choose to invest in optimizing their content and webpages to be more visible to AI tools, as people increasingly use AI chatbots, agents, and AI browsers to do everything from getting the news and finding recipes to shopping and booking their travel. This is a fresh, big market for existing search engine optimization players like Semrush, particularly as this change in consumer behavior drives increasing traffic to websites from generative AI tools.\nIndeed, as of October, traffic to retail websites from generative AI chatbots increased 1,200% compared to a year earlier, per Adobe Analytics data.\nSemrush has been investing in what it calls “generative engine optimization,” and recently launched a tool for tracking and improving website performance using both traditional SEO techniques and optimization for AI engines, like ChatGPT, Claude, Copilot, Grok, and Perplexity.\n“Brand visibility is being reshaped by generative AI, and brands that don’t embrace this new opportunity risk losing relevance and revenue,” said Anil Chakravarthy, president of Adobe’s Digital Experience Business. “With Semrush, we’re unlocking GEO for marketers as a new growth channel alongside their SEO, driving more visibility, customer engagement and conversions across the ecosystem.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Commerce\n"
  },
  {
    "title": "AI data center provider Lambda raises whopping $1.5B after multibillion-dollar Microsoft deal ",
    "url": "https://techcrunch.com/2025/11/18/ai-data-center-provider-lambda-raises-whopping-1-5b-after-multibillion-dollar-microsoft-deal/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-2159544073.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-18T19:37:25.000Z",
    "description": "In Brief Posted: 11:37 AM PST · November 18, 2025  Image Credits:Comezora / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  AI data center provider Lambda announced Tuesday it raised $1.5 billion in a...",
    "body": "\nIn Brief\nPosted:\n11:37 AM PST · November 18, 2025\n\nImage Credits:Comezora / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAI data center provider Lambda announced Tuesday it raised $1.5 billion in a round led by TWG Global, a relatively new $40 billion investment firm formed by billionaires Thomas Tull, the former owner of Legendary Entertainment, and Guggenheim Partners founder and CEO Mark Walter.\nTWG holds a variety of the billionaires’ assets, including Walter’s stakes in the Los Angeles Lakers and the new Cadillac F1 racing team. The firm also has a $15 billion fund to invest in AI anchored by Abu Dhabi’s Mubadala Capital. TWG previously invested in a partnership with Elon Musk’s xAI and Palantir to sell AI agents to enterprises.  \nNow it’s backing Lambda, which operates a number of U.S. AI data centers. Lambda is a CoreWeave competitor, although it also sells its “AI factories” to hyperscaler clouds. Earlier this month, Lambda announced a multibillion-dollar deal to supply Microsoft with AI infrastructure using tens of thousands of Nvidia GPUs. (Nvidia is an investor in Lambda as well.) \nRemember that Microsoft had a similar deal with CoreWeave and had bought about $1 billion worth of services from the company in 2024, its largest customer last year by a mile. Then OpenAI swooped in and signed a $12 billion deal with CoreWeave in March. \nMeanwhile, deal watchers have been talking for months about Lambda looking to raise hundreds of millions of dollars at a valuation north of $4 billion. There was also talk of an IPO. Prior to this, Lambda raised a $480 million Series D in February, with an estimated valuation of $2.5 billion, according to PitchBook.  \nLambda’s $1.5 billion raise far outstrips those earlier whispers of what it was seeking. Whether its valuation also soared, we can’t confirm and Lambda declined to comment on that.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Venture\n"
  },
  {
    "title": "Meta wins antitrust trial as judge denies that it’s a monopoly",
    "url": "https://techcrunch.com/2025/11/18/meta-wins-antitrust-trial-as-judge-denies-that-its-a-monopoly/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2233066222.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-18T19:01:45.000Z",
    "description": "In Brief Posted: 11:01 AM PST · November 18, 2025  Image Credits:Will Oliver/EPA/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  After five years, Meta has emerged victorious from a U.S....",
    "body": "\nIn Brief\nPosted:\n11:01 AM PST · November 18, 2025\n\nImage Credits:Will Oliver/EPA/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAfter five years, Meta has emerged victorious from a U.S. Federal Trade Commission (FTC) lawsuit over its acquisitions of Instagram and WhatsApp.\nIn an opinion released Tuesday, U.S. District Court Judge James Boasberg wrote that the FTC did not prove that Meta was violating antitrust law when it bought Instagram for $1 billion in 2012, and WhatsApp for $19 billion in 2014.\nThe FTC did manage to surface evidence showing that Meta — then called Facebook — was concerned about Instagram’s fast growth and the competition it could pose.\n“One way of looking at this is that what we’re really buying is time,” Mark Zuckerberg wrote in February 2012, per internal Facebook emails that surfaced during the trial. “Even if some new competitors springs [sic] up, buying Instagram, Path, Foursquare, etc. now will give us a year or more to integrate their dynamics before anyone can get close to their scale again.”\nBut Judge Boasberg was not ruling on whether Meta had acted as a monopoly back then, but rather, if it is currently a monopoly. Boasberg pointed to apps like TikTok as evidence that Meta has competition.\n“The landscape that existed only five years ago when the Federal Trade Commission brought this antitrust suit has changed markedly,” Boasberg wrote in his memorandum opinion. “While it once might have made sense to partition apps into separate markets of social networking and social media, that wall has since broken down.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Government & Policy\n"
  },
  {
    "title": "Security startup Guardio nabs $80M from ION Crossover Partners",
    "url": "https://techcrunch.com/2025/11/19/security-startup-guardio-nabs-80m-from-ion-crossover-partners/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Guardio.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T14:00:00.000Z",
    "description": "Guardio is leveraging its experience building browser extensions and apps that scan for malicious and phishing sites to build a tool that looks for artifacts in code and websites made with vibe coding tools.",
    "body": "\nThe Internet today has a new worry. Alongside vibe coding tools, and the codebases, sites and apps built with them, security issues and blind spots have proliferated, too.\nCybersecurity company Guardio is taking aim at a fresh market born amid this flux: finding malicious code written using AI tools. The company says it has found that with AI tools, malicious actors now find it easier than ever to build scam and phishing sites as well as the infrastructure needed to run them. \nNow, Guardio is leveraging its experience building browser extensions and apps that scan for malicious and phishing sites to build a tool that looks for artifacts in code and websites made with vibe coding tools.\nIt’s already found a buyer. Earlier this month, Lovable announced a partnership with Guardio to scan all websites made on its platform and weed out the ones that may pose threats to users. The deal came after a report highlighted that several sites built on Lovable had gaping security holes.\n“Everyone is racing for innovation and market capture. But security is kind of an afterthought. And not many AI tools are partnering with any cybersecurity company to make sure that content generated on their platform is secured and used for good,” Michael Vainshtein, the startup’s CTO, told TechCrunch.\nTo fund its expansion, the company has raised $80 million in a new institutional funding round led by ION Crossover Partners. Existing backers Union Tech Ventures, Vintage Investment Partners, and Emerge also invested.\nImage Credits: Guardio\nGuardio, founded in 2018 by Vainshtein, CEO Amos Peled, and chief architect Daniel Sirota, did not disclose its exact valuation, but it did say that it has tripled its valuation since its previous fundraise: a $47 million round led by Tiger Global in 2021. The company, however, said it doesn’t consider itself a unicorn yet.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nGuardio started out as a browser extension that would monitor malicious sites and alert users about data leaks. Since then, it has added phishing protection, and built mobile apps that offer identity management, spam filtering, and scam protection. The company says today it has 500,000 paying users, and claims it reached $100 million in annual recurring revenue this year. \nGuardio is also launching new visibility features to tell users more about what documents they have shared publicly, and if they have any sensitive information, along with notifying you of accounts that don’t have multi-factor authentication. The startup said these features are based on enterprise Data Loss Prevention and SaaS Security Posture Management products.\n“We use so many services, and our data is so fragmented with so many security settings to deal with. We feel every consumer is an enterprise in itself,” Vainshtein said. “While we don’t want them to become security officers of their accounts, we want to offer capabilities of visibility into their accounts that enterprises have.”\nThe startup said it is working to let users plug its tool into Outlook and Facebook to surface more details on the security risks users might face in relation to these accounts.\nPeled noted that next year, the startup plans to bring some of the new visibility features to its free subscription plan.\nGilad Shany, founder and partner at ION Crossover, said that the investment firm had been monitoring the company for years, and even though Guardio was not actively fundraising, ION started a conversation with the company last year.\n“We have been investors in both the cyber and consumer markets, and have had multiple successful IPOs and exits. Guardio is the first company we invest in at the intersection of these two markets – having a team that can lead best-in-class cyber product innovation, while having intimate knowledge about how to scale a direct-to-consumer business,” Shany said.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Onepot AI raises $13M to help make chemical drug creation easier",
    "url": "https://techcrunch.com/2025/11/19/onepot-ai-raises-13m-to-help-make-chemical-drug-creation-easier/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Daniil-Boiko-and-Andrei-Tyrin.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T15:00:00.000Z",
    "description": "For Daniil Boiko and Andrei Tyrin, the idea for Onepot AI came from the same frustration.   “The best ideas in drug discovery were often blocked not by biology, but by synthesis,” Boiko told...",
    "body": "\nFor Daniil Boiko and Andrei Tyrin, the idea for Onepot AI came from the same frustration.  \n“The best ideas in drug discovery were often blocked not by biology, but by synthesis,” Boiko told TechCrunch. Synthesis is the creation of new molecules by using chemical reactions. It’s like a recipe or Lego pieces, where small pieces, ingredients, molecules, come together to form a wider puzzle picture, a food dish, a larger molecule.  \nAs one might expect, it’s quite hard to create those small molecules that go on to build bigger ones.  \nFor Boiko, a Ph.D. candidate studying machine learning in chemistry at Carnegie Mellon (he received his bachelor’s and master’s in organic chemistry from a university in Russia), that meant realizing that drug hunters — the scientists who oversee drug discovery and development — were skipping promising ideas just because the chemical molecules to create the drugs seemed too hard to make.  \n“The compounds never even got a chance to be tested,” Boiko told TechCrunch.  \nFor Tyrin (who received his bachelor’s in computer science at MIT), his time working on drug discovery computational pipelines made him realize how behind the world of drug discovery was. “The models could generate ideas in hours, but it could take months for the lab to catch up,” he told TechCrunch.  \n“We both saw that the world was throwing money into molecular design and almost ignoring the harder problem of actually making the molecules,” Boiko said. But there was a geopolitical angle too, he continued, global supply chains are becoming vulnerable, and the U.S. is entering a trade war and innovative competition, once again, with China.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“It was clear,” Boiko said. “Small molecule synthesis needed to be rebuilt from the ground up in the United States.” \nBoiko and Tyrin came together to create Onepot, a company that is home to the small-molecule synthesis lab POT-1. They also built Phil, an AI organic chemist, to help run experimental analysis to increase the process of compound synthesis for their early commercial partners. Those partners are biotech and pharma companies that are currently trying out their technology.  \nOn Wednesday, the company came out of stealth with $13 million of funding, including pre-seed money, and a seed round led by Fifty Years.  \n“Currently, pharma and biotech companies either build entire teams of chemists in-house or work with contract research organizations overseas,” Tryin said of the process for molecular synthesis. Human chemists can spend months of research to create even a single compound, at a cost of thousands of dollars.  \nIt involves a lot of trial and error — studying various compounds, collecting data on biological activity, how the drug moves through the body, toxicology reports, and coming up with what to experiment with next. “The main limiting factor here is not testing these compounds, but making them in the first place,” Tyrin continued. “We aim to compress this down to days.”  \nTyrin said the product is pretty straightforward. Onepot has a catalogue of molecules it can make. Clients choose which compounds it want and then Onepot’s technology will synthesize the molecules and then ship them to the customer so the customer can use them in their own experiments. (They ship physical products either as dry compounds of solutions in plates or vials).  \nThe backend of the product is where Boiko and Tyrin have fun, dissecting the problems of chemical synthesis to find out which combinations of molecules work together. They built a lab where they are letting LLM agents access these so-called molecule recipes for training so the agents can also find out what works and doesn’t in compound building.  \n“When executing experiments in the lab, we capture every single detail that goes into the process,” Tyrin said — that means tracing temperature and, essentially, the ingredients that were added to a mixture to create compounds. “No information is lost, which makes experiences reproducible even if someone decides to run them in ten years from now.”  \nThis also means their agents generate hypotheses from real-world experiments rather than literature data, often mined from the internet.  \nBoiko called the fundraising process “hectic,” and said they met their lead investor through an intro. “What was supposed to be a short meeting turned into a multi-hour whiteboard session about industrializing synthesis,” Boiko said. Others in the round include Khosla Ventures, Speedinvest, OpenAI co-founder Wojciech Zaremba and Google’s Chief Scientist Jeff Dean.  \nThe fresh capital will be used to build a second lab in San Francisco so the team can take on more customers. It will also expand the team and its compound discovery engine. On the service side, Boiko and Tyrin look at WuXi AppTec and Enamine as competitors.  \nOverall, Boiko and Tyrin hope to make drug discovery at least two times faster and hopefully change the perception of what is possible after one taps into the “weird” chemistry that scientists once thought was off limits.  \n“You’re not just speeding up drug discovery, you’re expanding the design space for what drugs and materials can be,” Boiko said. “That drug that we haven’t discovered yet, might be out there, waiting for us to find it.”  \n"
  },
  {
    "title": "OpenAI board member Larry Summers steps down amid Epstein file revelations",
    "url": "https://techcrunch.com/2025/11/19/openai-board-member-larry-summers-steps-down-amid-epstein-file-revelations/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2170386424.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T14:33:54.000Z",
    "description": "Former Treasury Secretary Larry Summers has resigned from OpenAI’s board days after Congress released documents showing he was close friends with convicted sex offender Jeffrey Epstein.",
    "body": "\n\t\n\t\tImage Credits:Jakub Porzycki/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t6:33 AM PST · November 19, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nFormer Treasury Secretary Larry Summers has resigned from OpenAI’s board days after Congress released an extensive cache of emails with convicted sex offender Jeffrey Epstein, which included details of intimate affairs.\nSummers is also a former president of Harvard University and a current professor. The university will open its own probe into Summers’s connections with Epstein, reports the student newspaper, The Harvard Crimson. The university newspaper also reported that Summers will step back from public commitments. \nHis departure comes a day after both the House and the Senate voted to release the Epstein files. Over the past few days, a House panel released years of email exchanges between Epstein and Summers, including one in which Summers asked for advice about pursuing a relationship with a woman he described as a mentee. \nIn the exchanges, which took place between November 2018 and July 2019, Summers – who was married at the time – seemed to acknowledge his position of power over the woman he was mentoring. \n“She must be very confused or maybe wants to cut me off but wants professional connection a lot and so holds to it,” Summers wrote in a March 2019 email to Epstein. Epstein, who referred to himself early on in the exchanges as Summers’s “wing man,” told him in a June 2019 text: “She is doomed to be with you.”\nLater in the messages, Summers wrote that his “best shot” at getting his mentee to ostensibly sleep with him was that the woman found him “invaluable and interesting” and that “she can’t have it without romance/sex.” Throughout June, Epstein urged him to play the “long game” and keep the woman in a “forced holding pattern.” \nEpstein was arrested in July 2019 for sex trafficking of minors and conspiracy to commit sex trafficking of minors.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Credit risk automation platform Kaaj raises $3.8M seed from Kindred Ventures",
    "url": "https://techcrunch.com/2025/11/19/credit-risk-automation-platform-kaaj-raises-3-8m-seed-from-kindred-ventures/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Kaaj.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T13:00:00.000Z",
    "description": "Shivi Sharma spent a decade working in credit risk at places like American Express and Varo Bank.   At some point, she realized teams were spending equal amounts of time analyzing all types of loans —...",
    "body": "\nShivi Sharma spent a decade working in credit risk at places like American Express and Varo Bank.  \nAt some point, she realized teams were spending equal amounts of time analyzing all types of loans — regardless of whether it was worth $100,000 or $5 million — meaning assessing smaller loans was ultimately an unprofitable and time-consuming process for lenders.  \nShe and her husband, Utsav Shah, realized there was an opportunity here.  \n“She watched as the vast majority of small business owners couldn’t access the capital they needed to grow, simply because the economics didn’t work for banks,” Shah told TechCrunch.  \n“Between our skills in building AI-powered decision-making systems at scale and our expertise in credit risk and fraud risk assessments in banking in financial services, we realized we could apply next-gen AI agent workflows to solve this decades-old problem,” he continued. \nThe married couple decided to launch Kaaj in 2024, a company that helps automate credit risk analysis so that underwriting no longer takes days, but minutes. Kaaj said it’s processed more than $5 billion worth of loan applications, with clients including Amur Equipment Finance and Fundr. The company announced on Wednesday a $3.8 million seed round from Kindred Ventures and Better Tomorrow Ventures.  \nThe product works like this: A small business applies for a loan, submitting all the needed documents (like financial statements, bank statements, and tax returns) — typically, when this happens, underwriters spend days manually verifying all this information and logging it into their Loan Origination System (LOS).  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nKaaj uses AI to identify, classify, verify, and organize information into LOS. It also runs assessments to check for document tampering for the underwriter fraud team. It integrates into existing Customer Relationship Management (CRM) systems like Salesforce, HubSpot, or Microsoft and even shows a lender if a business is meeting the criteria of a lender’s policy.  \n“This allows a team processing 500 applications monthly to handle 20,000 applications with the same staff, making smaller loans economically viable,” Shah, the company’s CEO, said.  \nThe hope is that more small businesses will be able to access loans from banks because it becomes more cost-efficient for a bank to investigate them.  \nOthers in the market include Middesk, Ocrolus, and MoneyThumb. Sharma hopes that Kaaj will stand out from the competition by automating the entire credit analysis process rather than parts of it.  \n“We do this by deploying agentic AI workflows that mimic their teams, to help lenders analyze end-to-end loan packages,” she said.  \nThe fresh capital will be used to help accelerate product development and expand across independent and small business lenders. “We’re focused on enhancing our AI agent capabilities, expanding our module offerings, and scaling our customer base of lenders and brokers beyond our current footprint.”  \nOverall, Shah and Sharma hope Kaaj can in some ways “revolutionize” small business lending, bringing automation to what is still a very paper-heavy process.  \n“By automating the science of credit analysis, we free up human underwriters to focus on the art of deal-making and subjective assessment, which is their true competitive advantage,” he said.\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google Maps adds Gemini-powered tips section, EV charger availability predictions, and more",
    "url": "https://techcrunch.com/2025/11/19/google-maps-adds-gemini-powered-tips-section-ev-charger-availability-predictions-and-more/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/06/google-maps-ios-icon.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T16:14:34.000Z",
    "description": "Now, when users search for places in Map like restaurants, hotels, or concert venues, they'll see a new \"know before you go\" tips section that will surface important information about the place.",
    "body": "\nGoogle Maps is rolling out new features designed to help users save time and feel more prepared, including a Gemini-powered “know before you go” tool. The navigation app is also launching an improved Explore tab and a new EV charger availability prediction feature.\nNow, when users search for places in Maps like restaurants, hotels, or concert venues, they’ll see a new “know before you go” tips section that will surface important information about the place. For instance, it might tell users the best way to book a reservation, what secret menu items are, what the best place to park is, and more. Users can click on each tip to get more information.\nThis “know before you go” tips section is rolling out now in the U.S. on Android and iOS.\nImage Credits:Google\nAs for the updated Explore tab, Google has made it easier and faster to find trending spots near you. Users can now swipe up to see trending and popular restaurants, activities, and sights nearby, such as a new cafe that just opened up or a quirky art gallery around the corner.\nThe tech giant says it’s now also easier to find curated lists from sources like Viator, Lonely Planet, and OpenTable, in addition to local influencers.\nThe updated Explore tab starts rolling out this month globally on Android and iOS.\nImage Credits:Google\nAdditionally, the company announced that EV drivers can now see how many chargers will likely be available once they arrive at their destination by searching for “EV chargers” in Maps. Google is using AI to analyze historical and real-time charger availability to predict how many chargers are likely to be free upon arrival. \nEV charger availability predictions start rolling out next week on Android Auto and cars with Google built-in.\nGoogle is also making it possible for users to leave reviews under a nickname, such as “Eager Elf” or “Julia Loves Sweets.” Reviews are still associated with a Google Account behind the scenes, so users can only leave one review per business. This prevents them from swapping out nicknames to leave the business a series of bad reviews — a practice known as review bombing.  \nWednesday’s announcement follows Google Maps’ recent integration of Gemini, which lets users ask about points of interest along their route, get answers on topics like sports or news, and perform tasks such as adding events to their calendar. \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Spotify’s new features let listeners explore the people and stories behind their favorite music",
    "url": "https://techcrunch.com/2025/11/19/spotifys-new-features-let-listeners-explore-the-people-and-stories-behind-their-favorite-music/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/HeroAsset_Blog.webp?w=150",
    "tag": "Tech",
    "date": "2025-11-19T15:24:19.000Z",
    "description": "On Wednesday, Spotify announced new features designed to showcase the people behind users’ favorite music, including producers, engineers, songwriters, background vocalists, and more. The company will also...",
    "body": "\nOn Wednesday, Spotify announced new features designed to showcase the people behind users’ favorite music, including producers, engineers, songwriters, background vocalists, and more. The company will also release tools that show how songs are connected and what inspired them.\nThe second set of tools is showcased in a new, interactive feature called SongDNA, which shows which songs are being sampled in a given track, who has covered the tune, and what other projects the song’s collaborators may have been involved in.\n\nTechCrunch reported in October that Spotify was developing the SongDNA feature as a way to help users discover music through a song’s credits, after references to the feature were spotted in the app’s code by reverse engineer Jane Manchun Wong. With SongDNA, Spotify users could explore the other projects that the artists, musicians, and others who worked on a track are involved with. \nPreviously, the Song Credits feature had only featured the topline performance, songwriting, and production credits.\nReferences to the sampled music, meanwhile, come from the online community-built database WhoSampled, which Spotify has acquired. Notably, the streaming service TIDAL also offers interactive credits that let users explore music through the contributors behind the songs.\n\nSpotify has also planned a feature called “About the song,” which will allow listeners to explore swipeable cards in the “Now Playing” view. Those cards will offer details like what inspired the song, the stories behind the music, the cultural impact, and more. These stories are sourced from third-party resources, which will be linked in the cards.\nThis type of background information about music is something Spotify has offered in previous years, when it partnered with lyrics site Genius on a feature that offered details on certain tracks’ backstories. However, that feature was limited to those stories Genius had in its database. The upcoming feature will link out to various places on the web, screenshots show, including informational sites like Wikipedia, as well as news sites.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\nSpotify says the expanded Song Credits will roll out starting Wednesday on mobile devices and will come to desktop in the months ahead.\nSongDNA and About the Song will only be available to Premium subscribers. However, these features won’t launch until early next year, initially as Spotify for Artists Preview. This will allow those involved with the music to have a chance to preview the features first and ensure the credits are accurate before they’re made available to the wider public. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "TikTok will now give you badges for limiting your doomscrolling",
    "url": "https://techcrunch.com/2025/11/18/tiktok-will-now-give-you-badges-for-limiting-your-doomscrolling/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-2198288850.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T05:45:12.000Z",
    "description": "Image Credits:Artur Widak/NurPhoto / Getty Images\t \t \t\t\t\t\t\t9:45 PM PST · November 18, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t TikTok is rolling out new digital well-being features like an affirmation journal and a background...",
    "body": "\n\t\n\t\tImage Credits:Artur Widak/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t9:45 PM PST · November 18, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nTikTok is rolling out new digital well-being features like an affirmation journal and a background sound generator aimed at improving the mental health of its users. The social network said it will also give users badges for controlling their TikTok usage.\nThe company is redesigning its screen time management page and adding new features to it. These include an affirmation journal with more than 120 positive prompts that let users set your intent for the day, a sound generator that can play calming sounds like rain or ocean waves, and a breathing exercise module. The company said that the page will also feature content from creators who talk about limiting screen time, using parental tools, and customizing their feeds.\nTikTok is also debuting new badges to reward people who use the platform within limits, especially teens. The company said it reviewed academic literature on digital well-being and found that overly restrictive tools can have a negative effect on teens.\nImage Credits: TikTok\nTo earn these badges, users need to complete different missions. Users can complete the sleep hours mission by avoiding using the platform at night. They can also use the new meditation tools to get a badge. TikTok is also rewarding people who set a daily screen time limit and use the app within those bounds with a badge. There are other badges for viewing the weekly screen time report and inviting others to complete these missions.\nThe company said that during its early testing, it observed that more people visited the new well-being screen compared to the previous version of the screen time menu, with the affirmation journal being the most popular tool.\nTikTok said it will display a link to these tools when someone is using the app at night or when they hit their daily screen time limit.\nThe company launched new parental control tools in July, giving guardians the ability to block certain accounts and get notifications when teens upload a public video or a story. In the past month, tech companies including Meta, YouTube, OpenAI, and Discord, have added new safety tools with an aim to increase teen safety.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "As Lovable hits $200M ARR, its CEO credits staying in Europe for its success",
    "url": "https://techcrunch.com/2025/11/19/as-lovable-hits-200m-arr-its-ceo-credits-staying-in-europe-for-its-success/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/picnew-copy.png?w=150",
    "tag": "Tech",
    "date": "2025-11-19T12:09:50.000Z",
    "description": "Swedish vibe coding unicorn Lovable has doubled its annual recurring revenue (ARR) to $200 million in just four months, co-founder and CEO Anton Osika said on stage at the 2025 Slush technology conference in...",
    "body": "\nSwedish vibe coding unicorn Lovable has doubled its annual recurring revenue (ARR) to $200 million in just four months, co-founder and CEO Anton Osika said on stage at the 2025 Slush technology conference in Helsinki, Finland.\nThe milestone comes just four months after the year-old company surpassed $100 million in ARR in July.\nOsika credited the AI-assisted coding software maker’s decision not to move to Silicon Valley as the main reason for its success thus far. Osika said Lovable decided to stay in Europe despite getting a lot of early advice that the company would only be successful if it left the region and relocated to the U.S.\n“It was tempting, but I really resisted that,” Osika said. “I [can] sit here now and say, ‘look, guys, you can build a global AI company from this country’. There is more available talent if you have a strong mission, and you have a lot of urgency coming together as a group and working.”\nHe added that the fact that the AI market in Europe is not as high-paced as the market in Silicon Valley has worked to his company’s benefit.\nThe company “flipped the script” by bringing strong talent from Silicon Valley companies like Notion and Gusto to work in-person in Stockholm, investor Zhenya Loginov, a partner at Accel, said. \nOsika also credited the company’s open-source community for continuing to improve its technology.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We just see all of these people in the community driving forward,” Osika said. “They’ve been active voices on Discord for, I think, the last 1,000 hours, debating some kind of WordPress operation. That was powering what we’re doing.”\nLovable’s milestone comes as vibe coding continues to gobble up venture capital and see soaring traction among users. Last week AI-coding assistant Cursor announced it raised $2.3 billion in a new funding round that valued the company at $29.3 billion in a round Accel also helped lead.\nLovable has raised more than $225 million in venture funding since it was founded a year ago. The startup most recently raised a $200 million Series A round in July led by Accel in addition to more than 20 other investors. That round valued the company at $1.8 billion.\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Trump DOE gives Microsoft partner $1B loan to restart Three Mile Island reactor",
    "url": "https://techcrunch.com/2025/11/18/trump-doe-gives-microsoft-partner-1b-loan-to-restart-three-mile-island-reactor/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/GettyImages-496672575.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T00:03:02.000Z",
    "description": "The Trump administration announced Tuesday it would provide Constellation Energy with a $1 billion loan to restart a nuclear reactor at Three Mile Island. The energy company said last year it would reopen the...",
    "body": "\nThe Trump administration announced Tuesday it would provide Constellation Energy with a $1 billion loan to restart a nuclear reactor at Three Mile Island.\nThe energy company said last year it would reopen the reactor, which had been shuttered since 2019, after Microsoft committed to purchasing all the electricity from the 835 megawatt power plant for two decades. Constellation estimated the project would cost $1.6 billion, and it expects to complete the refurbishment in 2028. \nTerms of Microsoft’s deal with Constellation weren’t disclosed. Analysts at Jefferies have estimated the tech company might be paying about $110 to $115 per megawatt-hour over 20 years of the deal. \nThat’s cheaper than a brand-new nuclear power plant would cost, but it’s a hefty premium over wind, solar, and geothermal, according to a comparison of energy costs from Lazard. Even wind and solar projects outfitted with utility-scale batteries to enable 24/7 power are cheaper.\nNonetheless, tech companies have recently fallen in love with nuclear as power demands for their data centers and AI efforts have skyrocketed. This summer, Microsoft competitor Meta signed its own deal with Constellation, buying the “clean energy attributes” of a 1.1 gigawatt nuclear power plant in Illinois.\nThe reactor at Three Mile Island that’s being restarted isn’t the infamous Unit 2, which melted down in 1979. Rather, it’s Unit 1, which was commissioned in 1974 and taken offline in 2019 as cheap natural gas eroded its profitability.\nThe debt facility is being made through the Department of Energy’s Loan Programs Office (LPO), which was formed under the Energy Policy Act of 2005 to foster the growth of clean energy technologies.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe LPO is most famous for its loan to Solyndra, a U.S. solar startup that went belly-up during the Great Recession. Overall, though, experts consider the LPO a success, with a default rate of 3.3% after recoveries. Tesla, for instance, received a $465 million loan under the program in 2010 and paid it back by 2013.\nLast month, the LPO finalized a $1.6 billion loan to American Electric Power, using federal dollars to support the upgrade of around 5,000 miles of transmission lines.\nThe Inflation Reduction Act, which passed during the Biden administration, created another pot of money under the LPO known as the Energy Infrastructure Reinvestment program.  That program was created to restore existing power plants to operation provided they avoid or reduce pollutants or greenhouse gas emissions. The Trump administration kept it largely in tact, rebranding it the Energy Dominance Financing Program.\nIn its press release, the Department of Energy, perhaps erroneously, says the the EDF Program was created under the Working Families Tax Cut Act. It was instead authorized under the One Big Beautiful Bill Act. \n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The all-electric Jeep Recon is finally here",
    "url": "https://techcrunch.com/2025/11/18/the-all-electric-jeep-recon-is-finally-here/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/jeep-recon-doors.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-19T02:22:10.000Z",
    "description": "The Jeep Recon, an all-electric SUV with an estimated 250 miles of range, is here, and I couldn’t be more surprised. Here’s why. Three years ago, Jeep unveiled how it was reshaping its portfolio with the...",
    "body": "\nThe Jeep Recon, an all-electric SUV with an estimated 250 miles of range, is here, and I couldn’t be more surprised. Here’s why.\nThree years ago, Jeep unveiled how it was reshaping its portfolio with the launch of three EVs — two of which were bound for the North American market by 2024. The all-electric Jeep Recon and Wagoneer S models were part of the brand’s plan to dominate to the electrified SUV market. At the time, parent company Stellantis was aiming for EVs to make up half of Jeep’s sales in North America — and all of its sales in Europe — by 2030.\nThe Wagoneer S eventually came to market in early 2025, while the Jeep Recon remained in limbo. \nMeanwhile, most automakers, including Stellantis, which also owns Chrysler and Ram, began to backpedal on ambitious EV plans as demand failed to meet lofty forecasts. In September, Ram canceled plans to produce a battery-electric full-size pickup, opting to focus on bringing an extended-range Ram 1500 REV to market. A month later, Stellantis announced it would invest $13 billion to beef up its U.S. manufacturing over the next four years as part of a broader revival plan directed by its new CEO. But this time, the electrification was not the centerpiece of the multi-billion-dollar commitment.\nAnd yet, the Jeep Recon — with its Wrangler vibes — has survived. \nThe Trail Rated 2026 Jeep Recon. Image Credits: Stellantis/Jeep\nThe company revealed that the 2026 Jeep Recon, with a starting price of $65,000 (not including the $1,995 destination fee), will go into production next year at the Toluca Assembly Plant in Mexico. It will initially launch in the U.S. and Canada, followed by a global expansion.\nThe Recon is a four-wheel-drive EV that carries the “Trail Rated” badge, an off-roading term that carries some weight among enthusiasts.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAs a result, the EV comes standard with the brand’s Selec-Terrain traction management system, underbody protection, tow hooks, off-road tires, and e-locker axle technology that allows drivers to flip a switch and electronically lock the differential to ensure torque goes to both rear wheels — another handy off-road feature.\n“With the Jeep Recon, we’re proving that electrification isn’t just compatible with off-road excellence, it can elevate it, delivering instant torque, precision control and a quieter, more connected driving experience that’s uniquely Jeep,” brand CEO Bob Broderdorf said in a statement.\nThe company also announced Tuesday it is adopting the North American Charging System for select EVs, including the Jeep Recon. The NACS system will not be integrated into the Jeep Recon, however. Owners will need a NACS adapter to access thousands of Tesla supercharging stations.\nThe 2026 Jeep Recon interior. Image credits: Stellantis/Jeep\nThe powertrain, which includes a 100-kilowatt-hour battery pack, delivers 650 horsepower and 620 pound-feet of torque — a powerful combination for off-roading. It also accelerates from zero to 60 miles per hour acceleration in 3.6 seconds. Why one would want that in a Jeep is one of my lingering questions.\nBut the larger question — and one that won’t be answered until the vehicle comes to market — is whether SUV-loving Americans buy it, especially when the base version of its iconic 2026 Wrangler starts at about $49,895.\nPerhaps that notable torque and power, slick interior that includes a 14.5-inch horizontal touchscreen (the largest ever for a Jeep), coupled with classic features, including the Wrangler-inspired LED taillamps, a swing gate, and removable doors will do the trick.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]