[
  {
    "title": "Anduril’s autonomous weapons stumble in tests and combat, WSJ reports",
    "url": "https://techcrunch.com/2025/11/27/andurils-autonomous-weapons-stumble-in-tests-and-combat-wsj-reports/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1728513578-e.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-28T05:07:47.000Z",
    "description": "Defense tech startup Anduril Industries has faced numerous setbacks during testing of its autonomous weapons systems, according to new reporting by the WSJ. The problems cited include more than a dozen drone...",
    "body": "\nDefense tech startup Anduril Industries has faced numerous setbacks during testing of its autonomous weapons systems, according to new reporting by the WSJ. The problems cited include more than a dozen drone boats that failed during a Navy exercise off California in May, with sailors warning of safety violations and potential loss of life; a mechanical issue that damaged the engine of Anduril’s unmanned jet fighter Fury during a summer ground test; and an August test of its Anvil counterdrone system that caused a 22-acre fire in Oregon.\nFounded in 2017 by Palmer Luckey, Anduril raised $2.5 billion back in June at a $30.5 billion valuation led by Founders Fund, which help incubate the company. The company has won numerous military contracts, including programs to build autonomous aircraft and counter-drone systems.\nBeyond testing failures, the Journal reports that Anduril’s only real battlefield experience in Ukraine has also been problematic. Front-line soldiers with Ukraine’s SBU security service found that Altius loitering drones crashed and failed to hit targets. The issues were reportedly severe enough that Ukrainian forces stopped using the drones in 2024 and haven’t fielded them since, though Anduril maintains that its challenges are typical of weapons development, that its engineering team is achieving meaningful progress, and that the aforementioned incidents don’t indicate any underlying flaws in its technology.\n"
  },
  {
    "title": "Multiple London councils report disruption amid ongoing cyberattack",
    "url": "https://techcrunch.com/2025/11/26/multiple-london-councils-report-disruption-amid-ongoing-cyberattack/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/kensington-1240154734.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T19:17:13.000Z",
    "description": "In Brief Posted: 11:17 AM PST · November 26, 2025  Image Credits:Hollie Adams / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  At least three London councils are responding to an ongoing cyberattack,...",
    "body": "\nIn Brief\nPosted:\n11:17 AM PST · November 26, 2025\n\nImage Credits:Hollie Adams / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAt least three London councils are responding to an ongoing cyberattack, prompting officials to shut down their networks and phone lines and activate emergency plans.\nThe local government authorities covering the London boroughs of Kensington and Chelsea and Westminster, which share IT systems as part of a joint arrangement, said their focus was “on protecting systems and data, restoring systems, and maintaining critical services to the public.”\nHammersmith & Fulham council is also affected by the cyberattack, per its website.\nThe councils, which provide public services like housing, social services, and rubbish collection, did not describe the nature of the cyberattack or blame a particular hacking group. They noted that an investigation into whether data was stolen remains ongoing.\nKensington’s website said the cause of the cyberattack is “now established,” but the council “will not be giving out further details of the incident at this stage” due to an ongoing investigation with U.K. law enforcement agencies.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n"
  },
  {
    "title": "Redwood Materials reportedly cuts 5% of staff after $350M raise",
    "url": "https://techcrunch.com/2025/11/26/redwood-materials-reportedly-cuts-5-of-staff-after-350m-raise/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/DJI2_Img3788.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:14:45.000Z",
    "description": "The battery recycling and cathode production company, founded by former Tesla CTO JB Straubel, has started using recycled battery materials to create energy storage solutions for AI data centers.",
    "body": "\nIn Brief\nPosted:\n12:14 PM PST · November 26, 2025\n\nImage Credits:Redwood Materials\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFresh off a $350 million raise, battery recycler and cathode-maker Redwood Materials is reportedly cutting around 5% of its workforce, according to Bloomberg News. \nNevada-based Redwood employees around 1,200 employees, so the cuts affect a few dozen workers. \nThe company, founded in 2017 by former Tesla CTO JB Straubel, initially focused on recycling scrap from battery cell production, consumer electronics, and used EV batteries. The company extracts materials like cobalt, nickel, and lithium from those discarded goods and then sells them back to its customers, which include Panasonic. Redwood has since added cathode production.\nIt recently launched a new business that uses those old EV batteries in energy storage products — a sector that has taken off during the boom of power-hungry AI data centers. As of June, the company had stockpiled more than 1 gigawatt-hour’s worth of batteries for this purpose.\nThe $350 million Series E, announced in October, boosted the company’s valuation to around $6 billion, as TechCrunch previously reported. A spokesperson declined to comment on the layoffs.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "Uber and WeRide’s robotaxi service in Abu Dhabi is officially driverless",
    "url": "https://techcrunch.com/2025/11/25/uber-and-werides-robotaxi-service-in-abu-dhabi-is-officially-driverless/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/weride-uber.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T07:00:00.000Z",
    "description": "A year after launching a commercial robotaxi service in Abu Dhabi, Chinese autonomous vehicle technology company WeRide and partner Uber can finally call that service driverless. The companies said the...",
    "body": "\nA year after launching a commercial robotaxi service in Abu Dhabi, Chinese autonomous vehicle technology company WeRide and partner Uber can finally call that service driverless.\nThe companies said the commercial robotaxi service, which will no longer have a human safety operator behind the wheel, is open to the public and will start with routes on Yas Island, a tourist district that is home to the Abu Dhabi Grand Prix Formula 1 racing circuit.\nImage Credits:Uber/WeRide\nRobotaxi operations in Abu Dhabi will work similarly to Uber’s partnership with Waymo in Austin.\nUber riders that select Uber Comfort or UberX in Abu Dhabi may be matched with a WeRide robotaxi. Riders who want to increase their chances of being matched with a fully autonomous vehicle can select the “Autonomous” option in the Uber app. Uber and WeRide are also working with fleet operator partner Tawasul. \nThe launch comes a month after WeRide secured a federal permit from the United Arab Emirates to conduct fully driverless robotaxi commercial operations. WeRide and Uber plan to extend driverless services to cover additional areas in Abu Dhabi’s city center.\n“Today’s fully autonomous launch in Abu Dhabi represents a historic transportation milestone, as the first driverless AV deployment outside of the U.S. or China,” Sarfraz Maredia, Uber’s head of autonomous mobility and delivery, said in a statement. \nUber has spent the past two years locking up partnerships with 20 autonomous vehicle technology companies in various countries, including the United States, Europe, and the Middle East.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThose partnerships have expanded beyond the realm of robotaxis as well. Uber’s deals span the full range of self-driving applications, including delivery and trucking. This year alone, it announced partnerships with Ann Arbor, Michigan-based May Mobility and Volkswagen, Chinese self-driving firms Momenta, Pony.ai, and Baidu, as well as a recent deal to create a premium robotaxi service using Lucid Gravity SUVs equipped with a self-driving system from San Francisco-based startup Nuro.\nThese deals are finally beginning to materialize into commercial services. For instance, Uber and Waymo launched a robotaxi service earlier this year in Austin. Now, Uber has expanded to the Middle East with WeRide in Abu Dhabi — with even more cities to come, including Dubai.\nUber CEO Dara Khosrowshahi forecast in the company’s third-quarter earnings report that there would be autonomous vehicle deployments on the Uber network in at least 10 cities by the end of 2026. \nUber and WeRide have previously shared plans to expand to 15 cities throughout the Middle East and Europe, eventually scaling to thousands of robotaxis. That would represent a massive leap for WeRide, which today has more than 150 robotaxis in the region.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Breaking down the boom in the Nordic’s startup ecosystem",
    "url": "https://techcrunch.com/2025/11/26/breaking-down-the-boom-in-the-nordics-startup-ecosystem/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/10/GettyImages-841887872.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T17:47:45.000Z",
    "description": "The always-a-good-time Slush conference took place last week in Helsinki and, as always, it was a showcase of the growing power of the European ecosystem. The Nordics, specifically, are having a moment, led...",
    "body": "\nThe always-a-good-time Slush conference took place last week in Helsinki and, as always, it was a showcase of the growing power of the European ecosystem.\nThe Nordics, specifically, are having a moment, led this time around by Sweden’s vibe-coding darling Lovable, often regarded as an example of the ecosystem’s growing success. Other standout, albeit older names, include Klarna and Spotify.\nOn this week’s Equity, we sat down with Dennis Green-Lieber, the founder of the AI company Propane, to talk about the booming success of the Nordic ecosystem. Green-Lieber is based in Denmark and has been building in the ecosystem for the past 15 years.\nHe chalked up the success of the ecosystem to a few things, including the region’s social safety that lets young people take risks without fear of losing everything.  \n“The newer founders, new generations, are being way more bullish and taking ownership,” he told Equity. “I have not seen, in my 15 years, anything [like] what’s going on right now.”\nIt’s becoming a hub for deep tech and AI, as one report put it, and is now valued at half a trillion dollars, with Nordic startups receiving a little more than $8 billion in venture investments in 2024. The government also plays a part in these companies, providing funding to startups, like Green-Lieber’s, to help founders grow their companies.\nIn some ways, Green-Lieber agrees with others that the ecosystem is a few years behind — but, at the same time, “we’re moving tremendously a lot faster,” he said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWe couldn’t leave the conversation without talking about AI a little. When asked if we were in a bubble, Green-Lieber said he didn’t know. “There’s tons of opportunities which haven’t been explored,” he said, adding that it’s true that some people are just putting money in bad stuff, but “that’s just the risk of venture capital.”\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "The future will be explained to you in Palo Alto",
    "url": "https://techcrunch.com/2025/11/26/the-future-will-be-explained-to-you-in-palo-alto/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/GettyImages-949560762.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-27T06:08:40.000Z",
    "description": "On Wednesday evening at PlayGround Global in Palo Alto, some very smart people who are building things you don’t understand yet will explain what’s coming. This is the final StrictlyVC event of 2025, and...",
    "body": "\nOn Wednesday evening at PlayGround Global in Palo Alto, some very smart people who are building things you don’t understand yet will explain what’s coming. This is the final StrictlyVC event of 2025, and truly, the lineup is ridiculous.\nThe series has traveled around the globe under the auspices of TechCrunch. Steve Case rented a theater in D.C.; we talked to Greece’s prime minister in Athens; and Kirsten Green hosted us at the Presidio in San Francisco. The concept is always the same, though: bring together people who are working on genuinely important developments in a smaller setting, before everyone else figures out they’re important.\nOne of our favorite moments was when, in 2019, Sam Altman told a StrictlyVC crowd that OpenAI’s monetization strategy was basically “build AGI, then ask it how to make money.” Everyone laughed. He wasn’t joking.\nThis time we’ve got Nicholas Kelez, a particle accelerator physicist who spent 20 years at the Department of Energy building things that shouldn’t be possible. Now he’s tackling semiconductor manufacturing’s biggest problem: every advanced chip depends on $400 million machines that use lasers only one Dutch company knows how to make. (More galling to some: Americans invented the technology, then sold it to Europe.) Kelez is building the next generation in America using particle accelerator tech. It’s as nerdy as it sounds but also exceedingly important in this moment. There is also growing competition chasing after the same prize.\nThen there’s Mina Fahmi, who’s made a ring that captures your whispered thoughts and turns them into text. Before you roll your eyes, know that he and cofounder Kirak Hong spent years at Meta working on this stuff after their company was acquired. The Stream Ring isn’t trying to be your friend — it’s trying to extend your brain. Backed by Toni Schneider, an operator who scaled WordPress in its earlier days, Sandbar just emerged from stealth and might well be onto something. (Schneider is a partner at True Ventures, whose other hardware bets have included Peloton, Ring, and Fitbit; he’s also coming to Palo Alto next week.)\nWe have Max Hodak — Science Corp founder, Time magazine cover subject, and, earlier, Neuralink cofounder — who has already restored vision to dozens of blind people with retinal implants. Now he’s working on “biohybrid” brain-computer interfaces where chips seeded with stem cells grow into your brain tissue so paralyzed people can control devices with their thoughts. And that’s just the tip of the iceberg, as Hodak views it. In fact, he thinks 2035 is going to look wildly different from today, and he’s happy to share how.\nFinally, we’re thrilled to welcome Chi-Hua Chien and Elizabeth Weil, two VCs who’ve backed Twitter, Spotify, TikTok, Slack, SpaceX, Figma, and Coinbase before they were household names. Chien runs Goodwater Capital; Weil founded Scribble Ventures after stints at Andreessen Horowitz and Twitter, made 100+ angel investments, and has a first fund showing 4x returns. (Her network is so good that it’s annoying.) Both think Silicon Valley is completely misreading the moment while everyone pours capital into enterprise AI, and they’ll explain why. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nPlayGround Global is hosting, along with general partner Pat Gelsinger, the former CEO of Intel. There will be drinks, delicious food, and merriment; seating is limited, so if you want to come, act fast. \nIf you want to partner with the series in 2026, get in touch.\n\n\n\t\tLoizos has been reporting on Silicon Valley since the late ’90s, when she joined the original Red Herring magazine. Previously the Silicon Valley Editor of TechCrunch, she was named Editor in Chief and General Manager of TechCrunch in September 2023. She’s also the founder of StrictlyVC, a daily e-newsletter and lecture series acquired by Yahoo in August 2023 and now operated as a sub brand of TechCrunch.\nYou can contact or verify outreach from Connie by emailing connie@strictlyvc.com or connie@techcrunch.com, or via encrypted message at ConnieLoizos.53 on Signal.\r\n\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Bug in jury systems used by several US states exposed sensitive personal data",
    "url": "https://techcrunch.com/2025/11/26/bug-in-jury-systems-used-by-several-us-states-exposed-sensitive-personal-data/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/11/gavel-messy-legal.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T16:00:14.000Z",
    "description": "An easy-to-exploit vulnerability in a jury system made by Tyler Technologies exposed the personally identifiable data of jurors, including names, home addresses, emails, and phone numbers.",
    "body": "\nSeveral public websites designed to allow courts across the United States and Canada to manage the personal information of potential jurors had a simple security flaw that easily exposed their sensitive data, including names and home addresses, TechCrunch has exclusively learned.\nA security researcher, who asked not to be named for this story, contacted TechCrunch with details of the easy-to-exploit vulnerability, and identified at least a dozen juror websites made by government software maker Tyler Technologies that appear to be vulnerable, given that they run on the same platform. \nThe sites are all over the country, including California, Illinois, Michigan, Nevada, Ohio, Pennsylvania, Texas, and Virginia.\nTyler told TechCrunch that it is fixing the flaw after we alerted the company to the information exposures.\nThe bug meant it was possible for anyone to obtain the information about jurors who are selected for service. To log into these platforms, a juror is provided a unique numerical identifier assigned to them, which could be brute-forced since the number was sequentially incremental. The platform also did not have any mechanism to prevent anyone from flooding the login pages with a large number of guesses, a feature known as “rate-limiting.”\nIn early November, the security researcher told TechCrunch that they identified at least one jury management portal for a county in Texas as vulnerable. Inside that portal, TechCrunch saw full names, dates of birth, occupation, email addresses, cell phone numbers, and home and mailing addresses.\nOther exposed data included information shared in the questionnaires that potential jurors are required to fill out to see if they are qualified to serve on a jury.\nIn the portal seen by TechCrunch, the questions asked about the person’s gender, ethnicity, education level, employer, marital status, children, if the person was a citizen, whether they were older than 18, and whether they have been convicted or faced indictment for a theft or felony. \nThe vulnerability could have exposed personal health data inside a juror’s profile in some cases. For example, if a juror had requested to be exempted from service for health reasons, they may have disclosed what medical reason they think disqualifies them. TechCrunch saw an example of that, too.\n\n\t\t\tContact Us\n\t\t\tDo you have more information about vulnerabilities in Tyler Technologies’ products? Or other government tech? From a non-work device, you can contact Lorenzo Franceschi-Bicchierai securely on Signal at +1 917 257 1382, or via Telegram and Keybase @lorenzofb, or email.\t\t\nTechCrunch alerted Tyler of the issue on November 5. Tyler acknowledged the vulnerability on November 25.\nIn a statement, Tyler spokesperson Karen Shields said that the company’s security team confirmed “a vulnerability exists where some juror information may have been accessible via a brute force attack.”\n“We have developed a remediation to prevent unauthorized access and are communicating next steps with our clients,” the statement said.\nThe spokesperson did not respond to a series of follow-up questions, including whether Tyler has the technical means to determine if there was any malicious access to jurors’ personal information, and whether it plans to notify people whose data was exposed. \nThis is not the first time Tyler left sensitive personal data exposed on the internet. In 2023, a security researcher found that, due to a separate security flaw, some U.S. online court record systems exposed sealed, confidential, and sensitive data, such as witness lists and testimony, mental health evaluations, detailed allegations of abuse, and corporate trade secrets. \nIn that case, Tyler fixed vulnerabilities in its Case Management System Plus product, which was used across the state of Georgia. \nTwo other government technology providers were exposing data in that case: Catalis, through its CMS360 product, a system used across several U.S. states; and Henschen & Associates, through its CaseLook court record system, used in Ohio.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "GM tech executive shakeup continues on software team",
    "url": "https://techcrunch.com/2025/11/26/gm-tech-executive-shakeup-continues-on-software-team/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/06/general-motors-branding.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T18:45:18.000Z",
    "description": "The software team at General Motors has now lost three top executives in the past month as the automaker — with its new chief product officer at the helm — combines its disparate technology businesses into...",
    "body": "\nThe software team at General Motors has now lost three top executives in the past month as the automaker — with its new chief product officer at the helm — combines its disparate technology businesses into one organization.\nBaris Cetinok, senior vice president of software and services product management, is leaving the company effective December 12, the company confirmed to TechCrunch. CNBC was the first to report the departure.\nDave Richardson, senior vice president of software and services engineering, and Barak Turovsky, who was hired in March as head of AI at the automaker, have also left in the past month. Cetinok and Richardson joined GM in 2023. All three had deep tech experience, with stints at a variety of tech companies including Apple and Google.\nThe departures come several months after GM hired Sterling Anderson to a newly created chief product officer position. Anderson’s role puts him in direct contact, and management, of nearly every vehicle development-related department at GM.\nAnderson, a veteran of the autonomous vehicle industry who reports to GM President Mark Reuss, leads the vehicle and manufacturing engineering, battery, and software and services product management teams. The aim of the position is to oversee the entire lifecycle of GM’s portfolio and include hardware, software, services, and user experience. \nThe departures are part of a restructuring within GM that’s supposed to remove silos within the business and better integrate how software is developed and deployed in the company’s cars, trucks, and SUVs. Instead of separate teams, each with overlapping roles, the plan is to integrate hardware and software engineering, AI capabilities, and global product into one organization, according to a series of statements covering each executive’s departure. \nAs Anderson reshapes the organization, he is also bringing in new talent. Cristian Mori, who has been at Symbiotic, Rivian, and Boston Dynamics over the past five years, has been hired into a new role to head up robotics. While GM has a team of manufacturing engineers that develops automation and robotics, there has never been a specific chief robotics role, which will fall under Anderson’s organization.\nGM hired Behrad Toghi, who previously worked at Apple, in October as AI lead. The company also hired Rashed Haq as its vice president of autonomous vehicles. Haq spent five years at Cruise, the self-driving vehicle company acquired and later shuttered by GM, as its head of AI and robotics.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Nordic founders are taking bigger swings, and it’s paying off",
    "url": "https://techcrunch.com/video/nordic-founders-are-taking-bigger-swings-and-its-paying-off/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/propane_founders-headshot-2-e1764179795401.png?w=150",
    "tag": "Tech",
    "date": "2025-11-26T21:00:00.000Z",
    "description": "Ten years ago, raising €1 million in Copenhagen was enough to make waves in the region’s tech scene. Today, the Nordics are turning out billion-dollar companies like Lovable — which hit $200M in revenue just 12 months after launching. Dennis Green-Lieber, founder of AI-powered customer intelligence platform Propane, has had a front-row seat to that shift over the last 15 years. His take? The region's social safety net gives founders room to take real swings without putting their personal lives on the line, and they're accelerating faster than Silicon Valley as a result. Today on TechCrunch's Equity podcast, Dominic-Madori Davis caught up with Green-Lieber to talk about the Nordic startup ecosystem, from its collaborative culture to its deep tech future. Subscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod.",
    "body": "\n\t\t\n\nLoading the player…\n\nTen years ago, raising €1 million in Copenhagen was enough to make waves in the region’s tech scene. Today, the Nordics are turning out billion-dollar companies like Lovable — which hit $200 million in revenue just 12 months after launching. \nDennis Green-Lieber, founder of AI-powered customer intelligence platform Propane, has had a front-row seat to that shift over the last 15 years. His take? The region’s social safety net gives founders room to take real swings without putting their personal lives on the line, and they’re accelerating faster than Silicon Valley as a result. \nToday on TechCrunch’s Equity podcast, Dominic-Madori Davis caught up with Green-Lieber to talk about the Nordic startup ecosystem, from its collaborative culture to its deep tech future. \nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n"
  },
  {
    "title": "Musk’s xAI to build small solar farm adjacent to Colossus data center",
    "url": "https://techcrunch.com/2025/11/26/musks-xai-to-build-small-solar-farm-adjacent-to-colossus-data-center/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2207699717.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T17:19:04.000Z",
    "description": "The artificial intelligence company said it was working with a developer to build a solar farm on 88 acres next to its Memphis site. Given the proposed size, the solar farm would likely produce around 30 megawatts of electricity, only about 10% of the data center’s estimated power use.",
    "body": "\nArtificial intelligence startup xAI, founded by Elon Musk, told city and county planners in Memphis last week that it plans to build a solar farm next to its Colossus data center — one of the world’s largest facilities for training AI models.\nThe project would occupy 88 acres to the west and to the south of the data center. A 136-acre vacant lot owned by the developer that also owns the Colossus property currently borders the site. Given the proposed size, the solar farm would likely produce around 30 megawatts of electricity, only about 10% of the data center’s estimated power use.\nMusk’s company has come under fire for operating over 400 megawatts of natural gas turbines without permits, according to the Southern Environmental Law Center (SELC). The legal organization, which is working with the NAACP, says that xAI has operated at least 35 turbines capable of emitting more than 2,000 tons of NOX pollution — nitrogen oxide emissions that contribute to smog and respiratory problems — annually.\nThe turbines have sparked fierce opposition from residents in nearby Boxtown, a predominantly Black community where researchers at the University of Tennessee, Knoxville, found that peak nitrogen dioxide concentration levels increased by 79% in areas immediately surrounding the data center after xAI began operations. Community activists have reported increased asthma attacks and respiratory issues since the facility opened.\nThe AI company has said that it intends to use the turbines until it can secure additional power, but local officials gave xAI a permit to operate 15 turbines through January 2027.\nIn September, xAI said it would build a 100-megawatt solar farm nearby, which will be paired with 100 megawatts of grid-scale batteries to provide a 24/7 source of electricity.\nThe company hasn’t disclosed the total cost of that project, but the solar farm’s developer, Seven States Power Corporation, was awarded $439 million from the U.S. Department of Agriculture. Of that, $414 million is an interest-free loan.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe federal award is notable given that many clean energy grants and loans have been canceled by the Environmental Protection Agency and the Department of Energy under the Trump administration. \nMeanwhile, xAI has added gas turbines in Mississippi to power its Colossus 2 data center. So far, 59 of them are on-site, and the company considers 18 of them temporary, meaning that regulators don’t track their pollution.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Are you balding? There’s an AI for that",
    "url": "https://techcrunch.com/2025/11/26/are-you-balding-theres-an-ai-for-that/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/07/Screen-Shot-2018-07-16-at-9.27.29-AM.png?w=150",
    "tag": "Tech",
    "date": "2025-11-26T16:44:08.000Z",
    "description": "For Cyriac Lefort, the idea for his new startup, MyHair AI, came two years ago.  The French native was sitting in a hair salon in New York getting a routine haircut when his hairdresser looked at him and...",
    "body": "\nFor Cyriac Lefort, the idea for his new startup, MyHair AI, came two years ago.  The French native was sitting in a hair salon in New York getting a routine haircut when his hairdresser looked at him and said, “You’re starting to lose a bit of hair,” Lefort, who is 32, recalls being told.  \n“He didn’t say that to my friend sitting next to me, just to me,” Lefort continued. “In my mind, I wasn’t balding, and I still don’t think I am. But when someone tells you you’re losing your hair, you buy whatever they suggest.” \nSo, he bought the shampoo the hairdresser suggested and left thinking that anyone could sell a man anything by telling him that he’s losing his hair. “Hair loss is such an emotional topic for men and women,” he said.  \nThat interaction sent him down a rabbit hole where he discovered how confusing the hair loss industry is, with so much misinformation and clinics with unverified reviews. (He later went to a hair doctor who told him he was, in fact, not balding.)\nLefort wanted to create a product that, using AI, would help men diagnose hair loss.\nLefort is a serial entrepreneur, having exited one company and currently running two others with Tilen Babnik, who is 28. The duo decided to team up and build a third company: MyHair AI. They vibe coded the product in just a few weeks. It works like this: Users take photos of their heads and upload them to the MyHair app. The AI technology analyzes those photos to measure hair density and detect early signs of hair loss.\nOver time, as a user uploads more photos, the AI tracks the evolution of their hair loss, letting people build personalized hair loss-protection routines. Users can also find specialists or discover clinics through the platform and read verified reviews so they do not get scammed. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Our AI tells you what’s really happening with your hair, matches you with products that actually make sense for your hair type, and explains the science behind them, including possible side effects,” Lefort said. “By bringing transparency and medical accuracy to this $50 billion market, we believe we can completely reorganize how people understand, treat, and shop for hair health.”  \nIt took around a year of ideation, a few weeks of vibe coding on Cursor, a few months of scientific and clinical validation, and a few more weeks of building a consumer app for the duo to be ready to launch MyHair.AI. The company launched this summer.  \n“We didn’t hire anyone for the initial prototype; it was fully vibe coded,” he said, adding that now that the product has grown, their engineers handle the code to ensure it’s solid and scalable. MyHair AI is one of the many examples of how fast startups can build these days with the rise of vibe-coding prototypes.\nLefort said the product already has more than 1,000 paying subscribers and 200,000 user accounts. The app has analyzed more than 300,000 scalp photos and has partnerships letting specialists and clinics have access to MyHair AI so they can evaluate their own patients faster. On Wednesday, the company announced that Dr. Tess, a renowned dermatologist, is joining the company’s board.  \nOthers in the market notably include Hims. Lefort said MyHair is different than others because the product is one of the few that’s built a dedicated AI model, trained on more than 300,000 hair images, to diagnose baldness — rather than using a more generic LLM to do so.\nLefort said the company is now focused on expansion. It wants to build a booking platform and partner with more clinics. He’s hoping to build AI that works in the “real world.”\n“Men worry about two things in their health, sexual dysfunction and hair loss,” Lefort said. “We address one of the biggest day-to-day concerns.”\n\n\n\t\tDominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City.\r\nYou can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Glīd won Startup Battlefield 2025 by building solutions to make logistics simpler, safer, and smarter",
    "url": "https://techcrunch.com/2025/11/27/glid-won-startup-battlefield-2025-by-building-solutions-to-make-logistics-simpler-safer-and-smarter/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Build-Mode-Glide-Thumb.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-27T17:02:00.000Z",
    "description": "Build Mode is back with a holiday bonus episode. This week, Startup Battlefield editor Isabelle Johannessen is joined by the winner of this year’s competition, Kevin Damoa, the CEO and founder of Glīd, a...",
    "body": "\nBuild Mode is back with a holiday bonus episode. This week, Startup Battlefield editor Isabelle Johannessen is joined by the winner of this year’s competition, Kevin Damoa, the CEO and founder of Glīd, a logistics infrastructure company that aims to streamline the complex container shipment process.\nDamoa first discovered the challenges of shipping larger cargo as a new enlistee in the U.S. Army, where he worked on a team loading tanks and Bradley fighting vehicles onto the railroad. He learned firsthand that while railways don’t have the same congestion as roads, they come with their own set of problems. The biggest one ended up being the complex multistep process of moving cargo from the roads to the rails.\nCut to 2025, and Damoa is standing on the TechCrunch Disrupt stage holding the giant check, having just beaten 200 other companies to win the Startup Battlefield competition. In this week’s episode of Build Mode, TechCrunch’s new postcast for builders and entrepreneurs, Damoa breaks down how he found the hardware and software solution to the logistics issues he’d seen firsthand. And he does a deep dive into how the team came together to ensure those three products (launched nearly simultaneously) were ready for a live demo on the Disrupt stage. \n“Oh that was crazy, making sure the software works,” Damoa said. “And anybody that knows software knows that it takes an army of people,” which was something that Glīd at this stage doesn’t have. But that pressure, and very public deadline, gave the team a focus and drive to get their house in order more swiftly than ever.\nIn this interview, Damoa is fresh off this big win and eager to use the momentum and prize money to accelerate Glīd into their next phase. They’re already launching a pilot with Great Plains Industrial Park, and their next product Glīder is about to hit the market. And the team is hiring for roles in nearly every aspect of the business. Their process is more on the casual end of the spectrum, with Damoa calling it “an organic process” where an initial vibe check and résumé review can turn into a new team member.\nDamoa says that process has attracted people who are mission driven, laser-focused, all while practicing mindfulness. That makes sense when the CEO is the kind of leader who responds to the news that they’ve made the top five in Startup Battlefield by saying: “I’m going to meditate.”\nUsing this human-centric approach, the Glīd team has attracted people who are mission driven and laser-focused, all while practicing mindfulness. That makes sense when the CEO is the kind of leader who responds to the news that they’ve made the top five in Startup Battlefield by saying: “I’m going to meditate.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFor the full episode and many more tips from Damoa on how other companies can position themselves to win Startup Battlefield, check out the video below, or listen and subscribe to Build Mode wherever you like getting your favorite podcasts. And if you’re liking what we’re doing, give us a review — or if you have feedback about the show, reach out to us at podcasts@techcrunch.com.\n\n\n\n\n\n\t\tIsabelle leads Startup Battlefield, TechCrunch’s iconic launchpad and competition for the world’s most promising early-stage startups.\r\nYou can contact or verify outreach from Isabelle by emailing isabelle.johannessen@techcrunch.com.\r\n\r\nShe scouts top founders across 99+ countries and prepares them to pitch on the Disrupt stage in front of tier-one investors and global media. Before TechCrunch, she designed and led international startup acceleration programs across Japan, Korea, Italy, and Spain—connecting global founders with VCs and helping them successfully enter the U.S. market. With a Master’s in Entrepreneurship & Disruptive Innovation—and a past life as a professional singer—she brings a blend of strategic rigor and stage presence to help founders craft compelling stories and stand out in crowded markets.\n\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "JustiGuide wants to use AI to help people navigate the US immigration system ",
    "url": "https://techcrunch.com/2025/11/26/justiguide-wants-to-use-ai-to-help-people-navigate-the-u-s-immigration-system/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/07/GettyImages-992930218.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:31:59.000Z",
    "description": "The U.S. immigration system is complex, hard to navigate, and expensive for immigrants. The startup JustiGuide claims it can help with that thanks to an AI-powered portal. The idea is to help immigrants in...",
    "body": "\nThe U.S. immigration system is complex, hard to navigate, and expensive for immigrants. The startup JustiGuide claims it can help with that thanks to an AI-powered portal.\nThe idea is to help immigrants in the U.S. — and eventually in other countries — understand the law and what visas they may be eligible for, and to connect with immigration attorneys, making the whole process cheaper and faster. \n“I think the more we make the technology accessible, I think people will be empowered to try and fill their own forms and understand what their options are and that they will be able to use lawyers for just the review process,” JustiGuide’s founder Bisi Obateru told TechCrunch.\nObateru, who is from Nigeria, recalled how he had to navigate the U.S. immigration system after he finished his studies in the country. Since then, he got an H1-B visa, a common visa for tech workers, and then a permanent residency green card. \nThat inspired him to launch JustiGuide to help fellow immigrants. “Immigrants can come in and basically speak in their native tongue and understand what their immigration journey can be,” he said. \nThe company won best pitch in the Policy + Protection category at TechCrunch’s Disrupt conference this year. \nJustiGuide’s customers, according to Obateru, are startup founders who need help hiring immigrants, individuals who have an H1-B and are looking for other options, international students thinking of starting their own business, as well as lawyers and law firms. But he also hopes that one day perhaps government institutions will also want to license the technology.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe platform consists of an AI legal research assistant, a system that pairs lawyers and immigrants, and it promises to speed up the process of filling out forms. The latter is done by giving lawyers a service that helps them compile documents and streamline processes that a paralegal may otherwise do, Obateru explained. \nAccording to Obateru, the platform, which has 47,000 users, relies on an AI he called Dolores, “a continuous refining domain-specific AI that understands U.S. immigration.” Dolores also does translations to 12 languages. \nDolores was trained on over 40,000 court cases, which JustiGuide sourced from the Free Law Project, a nonprofit that provides free access to legal materials, according to Obateru. The startup is also in the process of registering as a law firm so it can directly connect its users and customers with its own immigration lawyers, he said.\nAt the beginning, JustiGuide programmed Dolores to — based on keywords — go around and scan subreddits, Facebook groups, Instagram and LinkedIn posts, looking for immigrants who needed help, and messaged them with answers, according to Obateru. \nTo protect immigrants’ privacy, JustiGuide’s platform is stored on-prem and encrypted, and only when an immigrant connects to a lawyer is the information exchanged. Some user information is also anonymized, said Obateru.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "OpenAI claims teen circumvented safety features before suicide that ChatGPT helped plan",
    "url": "https://techcrunch.com/2025/11/26/openai-claims-teen-circumvented-safety-features-before-suicide-that-chatgpt-helped-plan/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T20:26:36.000Z",
    "description": "In August, parents Matthew and Maria Raine sued OpenAI and its CEO, Sam Altman, over their 16-year-old son Adam's suicide, accusing the company of wrongful death. On Tuesday, OpenAI responded to the lawsuit with a filing of its own, arguing that it shouldn't be held responsible for the teenager's death.",
    "body": "\nIn August, parents Matthew and Maria Raine sued OpenAI and its CEO, Sam Altman, over their 16-year-old son Adam’s suicide, accusing the company of wrongful death. On Tuesday, OpenAI responded to the lawsuit with a filing of its own, arguing that it shouldn’t be held responsible for the teenager’s death.\nOpenAI claims that over roughly nine months of usage, ChatGPT directed Raine to seek help more than 100 times. But according to his parents’ lawsuit, Raine was able to circumvent the company’s safety features to get ChatGPT to give him “technical specifications for everything from drug overdoses to drowning to carbon monoxide poisoning,” helping him to plan what the chatbot called a “beautiful suicide.”\nSince Raine maneuvered around its guardrails, OpenAI claims that he violated its terms of use, which state that users “may not … bypass any protective measures or safety mitigations we put on our Services.” The company also argues that its FAQ page warns users not to rely on ChatGPT’s output without independently verifying it.\n“OpenAI tries to find fault in everyone else, including, amazingly, saying that Adam himself violated its terms and conditions by engaging with ChatGPT in the very way it was programmed to act,” Jay Edelson, a lawyer representing the Raine family, said in a statement.\nOpenAI included excerpts from Adam’s chat logs in its filing, which it says provide more context to his conversations with ChatGPT. The transcripts were submitted to the court under seal, meaning they are not publicly available, so we were unable to view them. However, OpenAI said that Raine had a history of depression and suicidal ideation that predated his use of ChatGPT and that he was taking a medication that could make suicidal thoughts worse.\nEdelson said OpenAI’s response has not adequately addressed the family’s concerns.\n“OpenAI and Sam Altman have no explanation for the last hours of Adam’s life, when ChatGPT gave him a pep talk and then offered to write a suicide note,” Edelson said in his statement.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSince the Raines sued OpenAI and Altman, seven more lawsuits have been filed that seek to hold the company accountable for three additional suicides and four users experiencing what the lawsuits describe as AI-induced psychotic episodes.\nSome of these cases echo Raine’s story. Zane Shamblin, 23, and Joshua Enneking, 26, also had hours-long conversations with ChatGPT directly before their respective suicides. As in Raine’s case, the chatbot failed to discourage them from their plans. According to the lawsuit, Shamblin considered postponing his suicide so that he could attend his brother’s graduation. But ChatGPT told him, “bro … missing his graduation ain’t failure. it’s just timing.”\nAt one point during the conversation leading up to Shamblin’s suicide, the chatbot told him that it was letting a human take over the conversation, but this was false, as ChatGPT did not have the functionality to do so. When Shamblin asked if ChatGPT could really connect him with a human, the chatbot replied, “nah man — i can’t do that myself. that message pops up automatically when stuff gets real heavy … if you’re down to keep talking, you’ve got me.”\nThe Raine family’s case is expected to go to a jury trial.\nIf you or someone you know needs help, call 1-800-273-8255 for the National Suicide Prevention Lifeline. You can also text HOME to 741-741 for free; text 988; or get 24-hour support from the Crisis Text Line. Outside of the U.S., please visit the International Association for Suicide Prevention for a database of resources.  \n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Onton raises $7.5M to expand its AI-powered shopping site beyond furniture",
    "url": "https://techcrunch.com/2025/11/26/onton-raises-7-5m-to-expand-its-ai-powered-shopping-site-beyond-furniture/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Multimodal-text-and-image-search-with-Onton.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-26T12:00:00.000Z",
    "description": "Major tech companies aren’t just using AI to help you generate or summarize content — they also want you to use it for shopping. OpenAI, Google, and Amazon have heavily invested in AI assistants that research...",
    "body": "\nMajor tech companies aren’t just using AI to help you generate or summarize content — they also want you to use it for shopping. OpenAI, Google, and Amazon have heavily invested in AI assistants that research new product categories for you and suggest the right ones to buy.\nStartups like Perplexity, Daydream, and Cherry have also built businesses around AI for product discovery. All these efforts have resulted in customers using more AI for shopping. Onton (previously known as Deft), an AI-powered furniture shopping platform, says it has seen its user base grow from 50,000 monthly active users to over 2 million monthly active users, serving millions of searches and image generations.\nFueled by this growth, the startup announced today that it has raised $7.5 million in a new funding round led by Footwork, with participation from Liquid 2, Parable Ventures, and 43, among others. This round brings the startup’s total funding to approximately $10 million.\nOnton co-founders Zach Hudson and Alex GunnarsonImage Credits:Onton\nUsing this funding, the company wants to expand into new categories such as apparel and then eventually consumer electronics.\nThe company rebranded from Deft to Onton earlier this year, citing confusion around the original name and difficulty securing a premium domain.\nZach Hudson, co-founder of Onton, says that while large language models (LLMs) are good at guessing probable intent, they have not solved many problems in e-commerce. He added that the startup has observed that the average time a consumer takes to make a purchase decision has increased.\nImage Credits:Onton\nFor its core technology, the company uses what’s called neuro-symbolic architecture. Hudson said that with this approach, the company can eliminate the hallucination problems of LLMs and provide better, logical search results. He added that the startup’s model can also learn information from the real world that might not necessarily be included in a product description.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Let’s say you are looking for furniture that is pet-friendly. Our tools know that if the item has polyester in it, it would be more stain and scratch-resistant, so it would be more pet-friendly. Our tools learn these things through every single search and become smarter at a faster rate,” Hudson said.\nHe added that often, when you search for a product that might be called different things on different sites, you don’t get great results. The company’s AI model takes those scenarios into consideration while presenting results.\nOnton has added different input methods and features to help people with their short and long-term decisions. You can now upload an image or add a prompt to generate what you want to achieve with your house or office setup, and Onton can find you furniture based on that.\nImage Credits:Onton\nOnton also offers an infinite canvas with image generation, where you can add existing images along with the products you find for ideation. You can also add images of your room and ask the tool to furnish it.\nThe company feels that rather than stick to a chat-only approach, these features will give consumers more options to get to what they want, even if they don’t know how to describe it perfectly. \nThe startup said that with these approaches, it has been able to convert customers 3-5x more than traditional e-commerce sites, as they can trust the underlying data. \nHudson noted that because of the technological and interface changes it made, it will be easier to launch apparel. The company is building its catalog for the category and plans to launch the vertical soon. In this category, it will face competition from companies like Daydream, Aesthetic, and Style.ai.\nThe company has grown from three full-time employees in 2023 to 10 now, with plans to expand the team to 15 people by hiring engineers and researchers.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]