[
  {
    "title": "Lucid Motors slashes 12% of its workforce as it seeks profitability",
    "url": "https://techcrunch.com/2026/02/20/lucid-motors-slashes-12-of-its-workforce-as-it-seeks-profitability/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/LM250408_GPD-2.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T15:51:18.000Z",
    "description": "\nLucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path ",
    "body": "\nLucid Motors is laying off 12% of its workforce in a bid to “improve operational effectiveness and optimize our resources as we continue on our path toward profitability,” according to an internal memo that was obtained by TechCrunch. \nHourly workers on the manufacturing, logistics, and quality teams are not affected by the cuts, according to the memo, which was sent to employees being spared by the layoffs. It’s unclear exactly how many workers are being laid off, but it is likely in the hundreds. Lucid Motors reported having 6,800 full-time employees globally at the end of 2024.\n“Saying goodbye to colleagues is never easy,” interim CEO Marc Winterhoff wrote in the memo. “We are grateful for the contributions of those impacted by today’s actions, and we are providing severance, bonus, continued health benefits, and transition support to help them through this period.” The company did not immediately respond to a request for comment.\nThe cuts come as the company is in the middle of ramping up production and deliveries of its Gravity SUV. While Lucid Motors struggled with Gravity production and quality issues during the first few months, the company has been able to pick up the pace, and ultimately doubled its 2024 output last year.\nThe company is also preparing to launch a more affordable mid-size EV later this year that is expected to cost around $50,000. It’s collaborating with Uber and autonomous vehicle company Nuro on launching a robotaxi service in the San Francisco area this year, too. The company is scheduled to release its financial results for 2025 next week.\n“Importantly, today’s actions do not affect our strategy,” Winterhoff wrote in the memo. “Our core priorities remain unchanged, and we continue to focus on the start of production of our Midsize platform. With disciplined execution, we are also focused on further expansion into the robotaxi market, continued ADAS and software development, and growth in sales of Lucid Gravity and Air across existing and new geographies.”\nLucid Motors has now gone almost a full year without a permanent CEO. Peter Rawlinson, who was the company’s chief executive and chief technical officer, abruptly resigned on February 25, 2025. Since then, Lucid Motors has seen a significant amount of turnover in its executive ranks, including the loss of its chief engineer, who sued the company in December for wrongful termination and discrimination. (Lucid Motors has called his legal claims “absurd.”)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lucid Motors slashes 12% of its workforce as it seeks profitability",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/04/LM250408_GPD-2.jpg?w=150"
      ],
      "datePublished": "2026-02-20T15:51:18.000Z",
      "dateModified": "2026-02-20T15:51:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
    "url": "https://techcrunch.com/2026/02/21/microsofts-new-gaming-ceo-vows-not-to-flood-the-ecosystem-with-endless-ai-slop/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-2174641784.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T17:41:27.000Z",
    "description": "\nIn Brief\nPosted:\n9:41 AM PST · February 21, 2026\n\nImage Credits:Tomohiro Ohsumi / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMicrosoft a",
    "body": "\nIn Brief\nPosted:\n9:41 AM PST · February 21, 2026\n\nImage Credits:Tomohiro Ohsumi / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMicrosoft announced a major gaming shakeup on Friday, with Microsoft Gaming CEO Phil Spencer departing the company, along with Xbox President Sarah Bond.\nSpencer will be replaced by former Instacart and Meta executive Asha Sharma. With Sharma’s most recent role as the president of Microsoft’s CoreAI product, these moves suggest that Microsoft might be doubling down on bringing AI into video games.\nThe company had already been experimenting with ways to combine AI and gaming, for example developing an AI gaming companion and releasing a buggy, AI-generated level from “Quake II.” \nIndeed, in an internal memo published by The Verge, Sharma wrote that Microsoft “will invent new business models and new ways to play” and said that “monetization and AI” will both “evolve and influence this future.” At the same time, she said that the company “will not chase short-term efficiency or flood our ecosystem with soulless AI slop.”\n“Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us,” Sharma added.\nThat’s just one of three “commitments” Sharma made in her memo. The others involve building “great games beloved by players” and prioritizing Xbox.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Media & Entertainment\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft’s new gaming CEO vows not to flood the ecosystem with ‘endless AI slop’",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-2174641784.jpg?w=150"
      ],
      "datePublished": "2026-02-21T17:41:27.000Z",
      "dateModified": "2026-02-21T17:41:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla loses bid to overturn $243M Autopilot verdict",
    "url": "https://techcrunch.com/2026/02/20/tesla-loses-bid-to-overturn-243m-autopilot-verdict/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-2.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T17:37:24.000Z",
    "description": "\nA judge has denied Tesla’s request to overturn a $243 million jury verdict that held the automaker partially responsible for a fatal crash involving ",
    "body": "\nA judge has denied Tesla’s request to overturn a $243 million jury verdict that held the automaker partially responsible for a fatal crash involving its Autopilot driver assistance system.\n“The grounds for relief that Tesla relies upon are virtually the same as those Tesla put forth previously during the course of trial and in their briefings on summary judgment — arguments that were already considered and rejected,” Hon. Judge Beth Bloom’s decision reads. “Furthermore, Tesla does not present additional arguments or controlling law that persuades this Court to alter its earlier decisions or the jury verdict.”\nLast August, a jury awarded a $243 million verdict against Tesla over its culpability in a 2019 fatal crash in Florida that killed Naibel Benavides and critically injured Dillon Angulo. The jury assigned the driver two-thirds of the blame, and attributed one-third to Tesla. Notably, the jury assessed punitive damages only against Tesla.\nTesla’s lawyers argued, in its request to reverse the ruling, that the blame rested on the driver, who helped cause the crash. \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla loses bid to overturn $243M Autopilot verdict",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-2.jpg?w=150"
      ],
      "datePublished": "2026-02-20T17:37:24.000Z",
      "dateModified": "2026-02-20T17:37:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI debated calling police about suspected Canadian shooter’s chats",
    "url": "https://techcrunch.com/2026/02/21/openai-debated-calling-police-about-suspected-canadian-shooters-chats/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T15:25:44.000Z",
    "description": "\nIn Brief\nPosted:\n7:25 AM PST · February 21, 2026\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t",
    "body": "\nIn Brief\nPosted:\n7:25 AM PST · February 21, 2026\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAn 18-year-old who allegedly killed eight people in a mass shooting in Tumbler Ridge, Canada, reportedly used OpenAI’s ChatGPT in ways that alarmed the company’s staff.\nJesse Van Rootselaar’s chats describing gun violence were flagged by tools that monitor the company’s LLM for misuse and banned in June 2025. \nStaff at the company debated whether or not to reach out to Canadian law enforcement over the behavior but ultimately did not, according to the Wall Street Journal. An OpenAI spokesperson said Van Rootselaar’s activity did not meet the criteria for reporting to law enforcement; the company reached out to Canadian authorities after the incident.\n“Our thoughts are with everyone affected by the Tumbler Ridge tragedy,” an OpenAI spokesperson said in a statement. “We proactively reached out to the Royal Canadian Mounted Police with information on the individual and their use of ChatGPT, and we’ll continue to support their investigation.”\nChatGPT transcripts weren’t the only concerning part of Van Rootselaar’s digital footprint. She apparently created a game on Roblox, the world simulation platform frequented by children, which simulated a mass shooting at a mall. She also posted about guns on Reddit. \nVan Rootselaar’s instability was also known to local police, who had been called to her family’s home after she started a fire while under the influence of unspecified drugs.\nLLM chatbots built by OpenAI and its competitors have been accused of triggering mental breakdowns in users who lose grip on reality while conversing with digital models. Multiple lawsuits have been filed that cite chat transcripts that encourage people to commit suicide or offer assistance in doing so.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nIf you are in a crisis or having thoughts of suicide, call or text 988 to reach the 988 Suicide and Crisis Lifeline.\nThis post has been updated with comment from OpenAI.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI debated calling police about suspected Canadian shooter’s chats",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150"
      ],
      "datePublished": "2026-02-21T15:25:44.000Z",
      "dateModified": "2026-02-21T15:25:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic-funded group backs candidate attacked by rival AI super PAC",
    "url": "https://techcrunch.com/2026/02/20/anthropic-funded-group-backs-candidate-attacked-by-rival-ai-super-pac/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259873774.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T20:52:48.000Z",
    "description": "\nIn Brief\nPosted:\n12:52 PM PST · February 20, 2026\n\nImage Credits:John Nacion/Variety / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLate l",
    "body": "\nIn Brief\nPosted:\n12:52 PM PST · February 20, 2026\n\nImage Credits:John Nacion/Variety / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLate last year, New York Assembly member Alex Bores became the target of a campaign by a pro-AI super PAC to thwart his congressional bid. The group, Leading the Future, is armed with more than $100 million from backers including Andreessen Horowitz, OpenAI President Greg Brockman, AI search startup Perplexity, and Palantir co-founder Joe Lonsdale. \nBores’ response was simple: bring it on. Now, he’s got the muscle to back that challenge up.\nPublic First Action, a PAC backed by a $20 million donation from Anthropic, is spending $450,000 to boost Bores in the race for New York’s 12th congressional district, reports Bloomberg. Like its rival, the committee is pro-AI, but it’s pitching a different vision, one centered on transparency, safety standards, and public oversight.\nMeanwhile, the industry-backed PAC, Leading the Future, has already poured $1.1 million into ads attacking Bores, largely because he sponsored New York’s RAISE Act, which requires major AI developers to disclose safety protocols and report serious misuse of their systems.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Government & Policy\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic-funded group backs candidate attacked by rival AI super PAC",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2259873774.jpg?w=150"
      ],
      "datePublished": "2026-02-20T20:52:48.000Z",
      "dateModified": "2026-02-20T20:52:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "‘Toy Story 5’ takes aim at creepy AI toys: ‘I’m always listening’",
    "url": "https://techcrunch.com/2026/02/20/toy-story-5-takes-aim-at-creepy-ai-toys-im-always-listening/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-10.56.47-AM.png?w=150",
    "tag": "Tech",
    "date": "2026-02-20T16:25:54.000Z",
    "description": "\nIn Brief\nPosted:\n8:25 AM PST · February 20, 2026\n\nImage Credits:Pixar (opens in a new window)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhen the fir",
    "body": "\nIn Brief\nPosted:\n8:25 AM PST · February 20, 2026\n\nImage Credits:Pixar (opens in a new window)\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhen the first Toy Story movie came out in 1995, Google didn’t exist yet and Apple was on the verge of bankruptcy. No one could have predicted that over 30 years later, Pixar would still be making Toy Story movies, nor could anyone have known that the latest installation in the franchise would pit Buzz Lightyear and a balding Woody against an evil AI tablet called Lilypad.\nBut sure enough, “Toy Story 5” confronts old-school toys like Mrs. Potato Head, Rex, and Slinky Dog against the sinister threat of technology.\nThe trailer shows Bonnie, the young girl who inherited Andy’s toys when he left for college in “Toy Story 2,” playing outside with her toys when a surprise package with the Lilypad tablet arrives for her. She becomes completely enraptured by the tablet, not even looking up from the screen when her parents tell her that screen time is over.\nThe “Toy Story 5” trailer makes the Lilypad — or, Lily — out to be a sinister villain. When Jessie confronts the tablet about Bonnie’s well-being, Lily seems not to be paying attention, so the cowgirl demands that the tablet listen to her.\n\n\n\n“I’m always listening,” Lily says ominously, regurgitating Jessie’s impassioned speech in a computerized tone… and then translates it into Spanish.\n“Tech’s invaded our house,” Jessie tells Woody. “I’m losing Bonnie to this device.”\nWoody replies, “Toys are for play, but tech is for everything.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nCould “Toy Story 5” pull at the heartstrings of young children and get them to think twice about the consequences of excessive screen time? That may be a stretch. But at least it gives them something to watch that’s not as mind numbing as Cocomelon.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Media & Entertainment\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "‘Toy Story 5’ takes aim at creepy AI toys: ‘I’m always listening’",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-10.56.47-AM.png?w=150"
      ],
      "datePublished": "2026-02-20T16:25:54.000Z",
      "dateModified": "2026-02-20T16:25:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Altman would like remind you that humans use a lot of energy, too",
    "url": "https://techcrunch.com/2026/02/21/sam-altman-would-like-remind-you-that-humans-use-a-lot-of-energy-too/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198353376.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T21:38:01.000Z",
    "description": "\nOpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week while speaking at an event hosted by The Indian Express.\nFor one t",
    "body": "\nOpenAI CEO Sam Altman addressed concerns about AI’s environmental impact this week while speaking at an event hosted by The Indian Express.\nFor one thing, Altman — who was in India for a major AI summit — said concerns about AI’s water usage are “totally fake,” though he acknowledged it was a real issue when “we used to do evaporative cooling in data centers.”\n“Now that we don’t do that, you see these things on the internet where, ‘Don’t use ChatGPT, it’s 17 gallons of water for each query’ or whatever,” Altman said. “This is completely untrue, totally insane, no connection to reality.”\nHe added that it’s “fair” to be concerned about “the energy consumption — not per query, but in total, because the world is now using so much AI.” In his view, this means the world needs to “move towards nuclear or wind and solar very quickly.”\nThere’s no legal requirement for tech companies to disclose how much energy and water they use, so scientists have been trying to study it independently. Data centers have also been connected to rising electricity prices.\nCiting a previous conversation with Bill Gates, the interviewer asked whether it’s accurate to say a single ChatGPT query currently uses the equivalent of 1.5 iPhone battery charges, to which Altman replied, “There’s no way it’s anything close to that much.”\nAltman also complained that many discussions about ChatGPT’s energy usage are “unfair,” especially when they focus on “how much energy it takes to train an AI model, relative to how much it costs a human to do one inference query.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“But it also takes a lot of energy to train a human,” Altman said. “It takes like 20 years of life and all of the food you eat during that time before you get smart. And not only that, it took the very widespread evolution of the 100 billion people that have ever lived and learned not to get eaten by predators and learned how to figure out science and whatever, to produce you.”\nSo in his view, the fair comparison is, “If you ask ChatGPT a question, how much energy does it take once its model is trained to answer that question versus a human? And probably, AI has already caught up on an energy efficiency basis, measured that way.”\nYou can watch the full interview below. The conversation about water and energy usage begins at around 26:35.\n\n\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Altman would like remind you that humans use a lot of energy, too",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198353376.jpg?w=150"
      ],
      "datePublished": "2026-02-21T21:38:01.000Z",
      "dateModified": "2026-02-21T21:38:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The creator economy’s ad revenue problem and India’s AI ambitions",
    "url": "https://techcrunch.com/video/the-creator-economys-ad-revenue-problem-and-indias-ai-ambitions/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/modi-openai-anthropic-2261854815.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T23:00:00.000Z",
    "description": "\n\t\t\n\nLoading the player…\n\nThe creator economy is evolving fast, and ad revenue alone isn’t cutting it anymore. YouTubers are launching product lines, ",
    "body": "\n\t\t\n\nLoading the player…\n\nThe creator economy is evolving fast, and ad revenue alone isn’t cutting it anymore. YouTubers are launching product lines, acquiring startups, and building actual business empires. In fact, MrBeast’s company bought fintech startup Step, and his chocolate business is outearning his media arm. This isn’t just one creator’s strategy. For many, it’s the new playbook. \nOn this episode of TechCrunch’s Equity podcast, hosts Kirsten Korosec, Anthony Ha, and Rebecca Bellan unpack how creators are diversifying beyond ads, whether their model can scale beyond the top 1%, everything happing at India’s AI Impact Summit, and more of the week’s headlines.\n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The creator economy’s ad revenue problem and India’s AI ambitions",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/modi-openai-anthropic-2261854815.jpg?w=150"
      ],
      "datePublished": "2026-02-20T23:00:00.000Z",
      "dateModified": "2026-02-20T23:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainian man jailed for identity theft that helped North Koreans get jobs at US companies",
    "url": "https://techcrunch.com/2026/02/20/ukrainian-man-jailed-for-identity-theft-that-helped-north-koreans-get-jobs-at-us-companies/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T17:38:59.000Z",
    "description": "\nA U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overse",
    "body": "\nA U.S. federal court has sentenced a Ukrainian man to five years in prison for his part in a long-running identity theft operation that helped overseas North Korean workers gain fraudulent employment at dozens of U.S. companies.\nU.S. prosecutors brought charges in 2024 against Oleksandr Didenko, 29, a resident of Kyiv, for setting up North Koreans with stolen identities of U.S. citizens to get hired and earn a wage. Under this scheme, the workers’ earnings were funneled back to Pyongyang, which the regime used to fund its internationally sanctioned nuclear weapons program.\nThis is the latest in a string of recent convictions of individuals involved in facilitating ongoing North Korean so-called “IT worker” schemes. Security researchers have described North Korean workers as a “triple threat” to U.S. and Western businesses, as they violate U.S. sanctions, all the while enabling North Koreans to steal sensitive company data, and then later extort those victim companies into not publicly releasing corporate secrets.\nProsecutors said Didenko ran a website called Upworksell, which allowed people working overseas, including North Koreans, to buy or rent stolen identities for gaining employment with U.S. firms. Didenko handled more than 870 stolen identities, per the Justice Department.\nThe FBI seized Upworksell in 2024 and diverted its traffic to its own servers. Polish authorities arrested Didenko, who was then extradited to the U.S. and later pleaded guilty.\nA screenshot showing Upworksell’s website at the time it was seized by the FBI (ImagE: TechCrunch/screenshot)\nIn a statement this week, the U.S. Department of Justice said Didenko also paid people to receive and host computers at their homes in California, Tennessee, and Virginia. These “laptop farms” are rooms containing racks of open laptops, allowing North Koreans to remotely perform their work as if they were physically in the United States.\nSecurity giant CrowdStrike said last year that it has seen a sharp rise in the number of North Korean workers infiltrating companies, often as remote developers or other technical software engineering jobs. The scheme is among many that the North Korean regime uses to enrich itself, while unable to use the global financial system, thanks to international sanctions.\nNorth Koreans are also known to impersonate recruiters and VCs in efforts to trick unsuspecting high-profile and high-net-worth victims into granting access to their computers, including crypto.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainian man jailed for identity theft that helped North Koreans get jobs at US companies",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/laptop-farm-upscale.jpeg?w=150"
      ],
      "datePublished": "2026-02-20T17:38:59.000Z",
      "dateModified": "2026-02-20T17:38:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta’s metaverse leaves virtual reality",
    "url": "https://techcrunch.com/2026/02/20/meta-metaverse-leaves-vr-horizon-worlds-mobile/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/12/horizonworlds-copy.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T16:00:53.000Z",
    "description": "\nMeta announced a major update for its immersive virtual world, Horizon Worlds, on Thursday that will see it leave the metaverse behind. The tech gian",
    "body": "\nMeta announced a major update for its immersive virtual world, Horizon Worlds, on Thursday that will see it leave the metaverse behind. The tech giant said it’s shifting focus for Horizon Worlds to be “almost exclusively mobile” and that it’s “explicitly separating” its Quest VR platform from the virtual world.\nMeta’s Reality Labs division for VR and smart glasses development has lost nearly $80 billion since 2020. The update to Horizon Worlds, and other recent moves, signals that Meta is significantly rethinking its VR ambitions.\nLast month, the company reportedly laid off roughly 1,500 employees from its Reality Labs division — about 10% of the unit’s staff — and shut down several VR game studios. Additionally, it was reported that the VR fitness app Supernatural, which Meta acquired in 2023, will no longer produce new content and will move into “maintenance mode.” \nHorizon Worlds originally launched in 2021 as a VR platform and later rolled out to the web and mobile. Meta said Thursday that to “truly change the game and tap into a much larger market, we’re going all-in on mobile.”\nBy going mobile-first, Horizon Worlds is positioning itself to compete with popular platforms like Roblox and Fortnite.\n“We’re in a strong position to deliver synchronous social games at scale, thanks to our unique ability to connect those games with billions of people on the world’s biggest social networks,” Samantha Ryan, Reality Labs’ VP of content, said in the blog post. “You saw this strategy start to unfold in 2025, and now, it’s our main focus.”\nRyan went on to note that Meta is still focused on VR hardware. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“We have a robust roadmap of future VR headsets that will be tailored to different audience segments as the market grows and matures,” Ryan wrote. \nMeta’s metaverse ambitions have effectively been abandoned in favor of AI. After shifting its Reality Labs investments away from the metaverse, Meta is now focused on developing AI wearables and advancing its own AI models. \nDuring Meta’s latest earnings call last month, Meta CEO Mark Zuckerberg said, “It’s hard to imagine a world in several years where most glasses that people wear aren’t AI glasses.”\nThe exec also stated that sales of Meta’s glasses tripled within the last year, calling them “some of the fastest-growing consumer electronics in history.”\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta’s metaverse leaves virtual reality",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/12/horizonworlds-copy.jpg?w=150"
      ],
      "datePublished": "2026-02-20T16:00:53.000Z",
      "dateModified": "2026-02-20T16:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Threads posts can now be shared directly to your Instagram Story without leaving the app",
    "url": "https://techcrunch.com/2026/02/20/threads-posts-can-now-be-shared-directly-to-your-instagram-story-without-leaving-the-app/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/instagram-threads-GettyImages-2159215889.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T16:55:12.000Z",
    "description": "\n\t\t\t\t\t\t8:55 AM PST · February 20, 2026\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\nThreads already has over 400 million monthly users, but Meta wants to push that number even high",
    "body": "\n\t\t\t\t\t\t8:55 AM PST · February 20, 2026\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\nThreads already has over 400 million monthly users, but Meta wants to push that number even higher. With the launch of a new Threads feature this week, the company is making it easier for Threads users to share posts on the app to their Instagram Stories — a move that could capitalize on Instagram’s larger user base to bring more people to Meta’s X competitor.\nThe company announced on Thursday a new feature that lets you share a Threads post to your Instagram Story without having to leave the Threads app, instead previewing how the post would look on your Story directly within the Threads app.\nThe app previously allowed you to share anyone’s Threads post to your Instagram Story similar to how you would reshare someone’s Instagram post to your Story. It also already offered tools for sharing posts to your Instagram Feed or DMs.\nImage Credits:Meta\nMeta’s text-first, Twitter-like app Threads first launched in July 2023 and benefited from its ties with Instagram to rapidly grow its initial user base. To sign up, users had to authenticate with their Instagram credentials, which allowed Threads to populate with account details, like username, bio, and photo, as well as verification status and followers.\nWith one tap, users could immediately follow the accounts they already followed on Instagram — and those not on Threads would get a notification that someone had added them.\nIn the months and years following its launch, Meta has heavily leaned on its other, bigger social platforms to continue to grow Threads, including by displaying popular Threads posts on Facebook and adding a similar carousel of Threads posts to Instagram users. The company also made it easy for users to cross-post from Instagram and Facebook to Threads, which also helped boost adoption. \nThese moves have paid off. Data from market intelligence provider Similarweb last month indicated that Threads is now seeing more daily usage than Elon Musk’s X on mobile devices. (X still dominates on the web, however.) Threads’ numbers overall have been steadily growing as well, doubling usage from 200 million monthly active users in August 2024 to 400 million monthly users as of August 2025. The company announced in October that Threads reached 150 million daily active users, as well. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Threads posts can now be shared directly to your Instagram Story without leaving the app",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/instagram-threads-GettyImages-2159215889.jpg?w=150"
      ],
      "datePublished": "2026-02-20T16:55:12.000Z",
      "dateModified": "2026-02-20T16:55:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "InScope nabs $14.5M to solve the pain of financial reporting",
    "url": "https://techcrunch.com/2026/02/20/inscope-nabs-14-5m-to-solve-the-pain-of-financial-reporting/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/In-scope.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-20T19:24:57.000Z",
    "description": "\nEven without a background in accounting, anyone who has ever glanced at a 10-K or 10-Q can tell that preparing financial statements is a complex, ted",
    "body": "\nEven without a background in accounting, anyone who has ever glanced at a 10-K or 10-Q can tell that preparing financial statements is a complex, tedious process.\nWhile legacy platforms like Workiva and Donnelley Financial Solutions aim to streamline financial reporting, longtime accountants Mary Antony (pictured right) and Kelsey Gootnick (pictured center) found themselves exhausted by various manual hurdles within these tools (co-founder and CTO Jared Tibshraeny is pictured left).\nThe duo met seven years ago at Flexport, where Gootnick served as the company’s controller and Antony served as assistant controller. They stayed in touch even after Antony moved to Miro and Gootnick to Hopin and later Thrive Global.\nNo matter where they worked, Antony and Gootnick kept running into the same manual challenges.\n“The way financial statements come together, it’s just patched together in a lot of spreadsheets, moved into a bunch of Word documents, emailed back and forth between people,” Antony told TechCrunch.  \nSo, in 2023, the pair decided to launch InScope, an AI-powered financial reporting platform that helps companies and accounting firms automate many aspects of the financial statement preparation process. The startup just raised $14.5 million in Series A funding led by Norwest, with participation from Storm Ventures and existing backers Better Tomorrow Ventures and Lightspeed Venture Partners.\nWhile InScope isn’t fully automating the generation of income statements and balance sheets yet, it automates a vast amount of the manual busy work, from verifying math to formatting. Simply ensuring that dollar signs and commas are uniform and correctly placed can save accountants up to 20% of their time, according to Antony, InScope’s CEO.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nOver the last 12 months, InScope has grown its customer base by 5x, attracting significant accounting firms such as CohnReznick, currently ranked in the top 15 nationally.\nOf course, it may be a while before accountants — a profession Antony describes as risk-averse — feel comfortable letting AI fully automate financial statement preparation. Nonetheless, that remains InScope’s ultimate goal.\nNorwest partner Sean Jacobsohn told TechCrunch that he invested in InScope after he heard from multiple clients that the startup’s product saves them a lot of time.\nJacobsohn is convinced that InScope stands out because few founders possess the specific expertise required to reinvent financial reporting technology.\n“It’s a very complex space, and you need to be able to have been in the shoes of the buyer before,” he said.\nAntony agrees that accountants are not typically the type to launch startups. Fortunately, she and Gootnick developed their entrepreneurial instincts through years of operating within the fast-paced cultures of other high-growth startups.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "InScope nabs $14.5M to solve the pain of financial reporting",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/In-scope.jpg?w=150"
      ],
      "datePublished": "2026-02-20T19:24:57.000Z",
      "dateModified": "2026-02-20T19:24:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wikipedia blacklists Archive.today after alleged DDoS attack",
    "url": "https://techcrunch.com/2026/02/21/wikipedia-blacklists-archive-today-after-alleged-ddos-attack/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T20:20:15.000Z",
    "description": "\nWikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 time",
    "body": "\nWikipedia editors have decided to remove all links to Archive.today, a web archiving service that they said has been linked to more than 695,000 times across the online encyclopedia.\nArchive.today — which also operates under several other domain names, including archive.is and archive.ph — is perhaps most widely used to access content that’s otherwise inaccessible behind paywalls. That also makes it useful as a source for Wikipedia citations.\nHowever, according to the Wikipedia discussion page about this topic, “There is consensus to immediately deprecate archive.today, and, as soon as practicable, add it to the spam blacklist […] and to forthwith remove all links to it.” (Ars Technica first reported on the decision.)\nThe discussion page says that Archive.today was previously blacklisted in 2013, only to be removed from the blacklist in 2016.\nWhy reverse course again? Because, the discussion page says, “Wikipedia should not direct its readers towards a website that hijacks users’ computers to run a DDoS attack.” Plus, “evidence has been presented that archive.today’s operators have altered the content of archived pages, rendering it unreliable.”\nThe distributed denial of service (DDoS) attack in question was allegedly directed at blogger Jani Patokallio. Patokallio wrote that beginning on January 11, users who loaded the archive’s CAPTCHA page have been unknowingly loading and executing JavaScript that sends a search request to his Gyrovague blog, in an apparent attempt to get Patokallio’s attention and increase his hosting bill.\nBack in 2023, Patokallio published a blog post examining Archive.today, whose ownership he described as “an opaque mystery.” And while he wasn’t able to track down a specific owner, he concluded the site was likely “a one-person labor of love, operated by a Russian of considerable talent and access to Europe.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMore recently, Patokallio said the webmaster at Archive.today asked him to take the post down for two or three months.\n“I do not mind the post, but the issue is: journos from mainstream media (Heise, Verge, etc) cherry-pick just a couple of words from your blog, and then construct very different narratives having your post the only citable source; then they cite each other and produce a shitty result to present for a wide audience,” the webmaster said, according to emails shared by Patokallio.\nPatokallio said that after he declined to take the post down, the webmaster responded with “an increasingly unhinged series of threats.”\nWikipedia editors also pointed to webpage snapshots in Archive.today that appeared to have been altered to insert Patokallio’s name — hence the concern that it’s become “unreliable” as an archive.\nWikipedia’s guidance now calls for editors to remove links to Archive.today and related sites, replacing them with links to the original source or to other archives like the Wayback Machine.\nOn a blog linked from the Archive.today website, the site’s apparent owner wrote that Archive.today’s value to Wikipedia was “not about paywalls” but rather “the ability to offload copyright issues.” They later wrote that things had turned out “pretty well” and said they would “scale down the ‘DDoS’.”\n“Why didn’t you write about such events earlier, folks of the tabloids?” they said. “I don’t expect you to write anything good, because then who would read you, but there was plenty of dramas, wasn’t there? Because there was no Jani to nudge you?”\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wikipedia blacklists Archive.today after alleged DDoS attack",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1873370000.jpg?w=150"
      ],
      "datePublished": "2026-02-21T20:20:15.000Z",
      "dateModified": "2026-02-21T20:20:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "7 days until ticket prices rise for TechCrunch Disrupt 2026",
    "url": "https://techcrunch.com/2026/02/21/7-days-until-ticket-prices-rise-for-techcrunch-disrupt-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/Networking_disrupt.png?w=150",
    "tag": "Tech",
    "date": "2026-02-21T15:00:00.000Z",
    "description": "\n\t\n\t\tImage Credits:TechCrunch\t\n\t\n\t\t\t\t\t\t7:00 AM PST · February 21, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSuper Early Bird pricing for TechCrunch Disrupt 2026 ends Febru",
    "body": "\n\t\n\t\tImage Credits:TechCrunch\t\n\t\n\t\t\t\t\t\t7:00 AM PST · February 21, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSuper Early Bird pricing for TechCrunch Disrupt 2026 ends February 27 at 11:59 p.m. PT. That gives you one week to secure the biggest savings of the year — up to $680 off individual passes and up to 30% off community passes. Register now to lock in at the lowest rate.\nFrom October 13-15 at Moscone West in San Francisco, Disrupt will bring together 10,000 founders, investors, and operators for three days engineered for results.\n\nWhat you gain at Disrupt\n\nAccess to active investors and high-growth founders\n\n\nHigh-impact networking built to drive deals\n\n\nTactical insights you can implement immediately\n\n\nVisibility into emerging trends before they scale\n\nExplore 300+ exhibiting startups. Experience Startup Battlefield 200, where one standout company wins a $100,000 equity-free prize. Meet the leaders who can change your company’s trajectory.\nImage Credits:Kimberly White/Getty Images for TechCrunch / Getty Images\nDisrupt has a long track record of bringing together the most influential voices in tech. Previous speakers have included WordPress co-founder Matt Mullenweg, Phia co-founders Phoebe Gates and Sophia Kianni, and renowned investor Elad Gil, alongside leaders from Google Cloud, Netflix, Waymo, and more — all sharing actionable insights for building and scaling what’s next. Stay tuned to the event site to see when the 2026 agenda drops.\nLock in your lowest rate now\nSeven days remain to secure the lowest rate of the year. Whether you’re scaling a company or sourcing your next investment, there’s a pass built for you. Lock in your savings before February 27 at 11:59 p.m. PT.\nImage Credits:Eric Slomonson, The Photo Group\n\n\t\t\t\n\tTopics\n\t\n\t\tAI, Apps, Biotech & Health, Climate, Fintech, Fundraising, Hardware, Media & Entertainment, Robotics, Security, Space, Startups, TC, TechCrunch Disrupt 2026, Transportation, Venture\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "7 days until ticket prices rise for TechCrunch Disrupt 2026",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/10/Networking_disrupt.png?w=150"
      ],
      "datePublished": "2026-02-21T15:00:00.000Z",
      "dateModified": "2026-02-21T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India’s Sarvam launches Indus AI chat app as competition heats up",
    "url": "https://techcrunch.com/2026/02/20/indias-sarvam-launches-indus-ai-chat-app-as-competition-heats-up/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/sarvam-indus-chat-app-jagmeet-singh-techcrunch.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-21T01:00:00.000Z",
    "description": "\nSarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users",
    "body": "\nSarvam, an Indian AI startup focused on building models for local languages and users, on Friday launched its Indus chat app for web and mobile users, entering a fast-growing market dominated by global players including OpenAI, Anthropic, and Google.\nThe launch comes as India has become a key battleground for generative AI adoption. Recently, OpenAI CEO Sam Altman said ChatGPT has more than 100 million weekly active users in India, while Anthropic said India accounts for 5.8% of total Claude usage, second only to the U.S.\nIndus serves as a chat interface for its newly announced Sarvam 105B model, the company’s 105-billion-parameter large language model. The app’s launch comes two days after Bengaluru-based Sarvam unveiled its 105B and 30B models at the India AI Impact Summit in New Delhi earlier this week. At the summit, the startup also outlined enterprise initiatives and hardware plans and announced partnerships with companies including HMD to bring AI to Nokia feature phones and Bosch for AI-enabled automotive applications.\nCurrently available in beta on iOS, Android, and the web, the Indus app allows users to type or speak queries and receive responses in text and audio. Users can sign in using their phone number, Google or Microsoft account, or Apple ID, though the service appears to be limited to India for now.\nImage Credits:Jagmeet Singh / TechCrunch\nThe app currently comes with some limitations. Users cannot delete their chat history without deleting their account, and there is no option to turn off the app’s reasoning feature, which can sometimes slow response times. Sarvam has also warned that access may be restricted as it gradually expands its compute capacity.\n“We’re gradually rolling out Indus on a limited compute capacity, so you may hit a waitlist at first. We will expand access over time,” Sarvam co-founder Pratyush Kumar wrote on X, adding that the company is seeking feedback from users.\nFounded in 2023, Sarvam has raised $41 million to date from investors, including Lightspeed Venture Partners, Peak XV Partners, and Khosla Ventures as it builds large language models tailored for India.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 9, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSarvam is one of a small but growing group of Indian startups attempting to build domestic alternatives to global artificial intelligence platforms as India seeks greater control over its AI infrastructure.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India’s Sarvam launches Indus AI chat app as competition heats up",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/sarvam-indus-chat-app-jagmeet-singh-techcrunch.jpg?w=150"
      ],
      "datePublished": "2026-02-21T01:00:00.000Z",
      "dateModified": "2026-02-21T01:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]