[
  {
    "title": "Meta plans to add facial recognition to its smart glasses, report claims",
    "url": "https://techcrunch.com/2026/02/13/meta-plans-to-add-facial-recognition-to-its-smart-glasses-report-claims/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/meta-smart-glasses.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T14:58:39.000Z",
    "description": "\nIn Brief\nPosted:\n6:58 AM PST · February 13, 2026\n\nImage Credits:Meta\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta plans to add facial recognition ",
    "body": "\nIn Brief\nPosted:\n6:58 AM PST · February 13, 2026\n\nImage Credits:Meta\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta plans to add facial recognition to its smart glasses as soon as this year, according to a new report from The New York Times. The feature, internally known as “Name Tag,” would allow smart glasses wearers to identify people and get information about them through Meta’s AI assistant.\nMeta’s plans could change, the report notes. The tech giant has been deliberating since early last year on how to release a feature that carries “safety and privacy risks.”\nAccording to an internal memo, the company had originally planned to release Name Tag to attendees of a conference for the visually impaired before releasing it to the public, but didn’t end up doing that. \nMeta reportedly saw the political tumult in the United States as a good time to release the feature. \n“We will launch during a dynamic political environment where many civil society groups that we would expect to attack us would have their resources focused on other concerns,” the document reads.\nMeta considered adding facial recognition technology to the first version of its Ray-Ban smart glasses back in 2021, but dropped the plans over technical challenges and ethical concerns. The NYT reports that the company has revived its plans as the Trump administration has grown closer to big tech, and following the unexpected success of its smart glasses.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Hardware\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta plans to add facial recognition to its smart glasses, report claims",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/meta-smart-glasses.jpg?w=150"
      ],
      "datePublished": "2026-02-13T14:58:39.000Z",
      "dateModified": "2026-02-13T14:58:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cohere’s $240M year sets stage for IPO",
    "url": "https://techcrunch.com/2026/02/13/coheres-240m-year-sets-stage-for-ipo/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-1251294520.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T15:03:10.000Z",
    "description": "\nIn Brief\nPosted:\n7:03 AM PST · February 13, 2026\n\nImage Credits:Pavlo Gonchar/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n7:03 AM PST · February 13, 2026\n\nImage Credits:Pavlo Gonchar/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAs the top AI labs like Google, Anthropic, and OpenAI chase enterprise adoption, Canadian AI startup Cohere has been quietly cleaning up.\nThe startup told investors in a memo that it surpassed its $200 million annual recurring revenue target in 2025, hitting $240 million with quarter-over-quarter growth of more than 50% throughout the year, per CNBC.\nCohere was founded in 2019 and has the backing of enterprise tech investors like Nvidia, AMD, and Salesforce. The startup’s core tech is its Command family of generative AI models, which Cohere says are efficient enough to be deployed on limited GPUs — an attractive promise for enterprises looking to get a handle on cost and resource management. \nLast summer, Cohere launched North, a higher-level enterprise platform and AI workspace for secure, custom AI agents and workflows built on Cohere’s models. \nCohere’s CEO Aidan Gomez said last October that the startup may IPO “soon.” If “soon” means in 2026, Cohere may be contending against OpenAI, Anthropic, and SpaceX/xAI, which are all reportedly weighing their own public debuts.\nTechCrunch has reached out to Cohere for comment. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cohere’s $240M year sets stage for IPO",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-1251294520.jpg?w=150"
      ],
      "datePublished": "2026-02-13T15:03:10.000Z",
      "dateModified": "2026-02-13T15:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IBM will hire your entry-level talent in the age of AI",
    "url": "https://techcrunch.com/2026/02/12/ibm-will-hire-your-entry-level-talent-in-the-age-of-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/04/GettyImages-1254279163.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T23:23:17.000Z",
    "description": "\nIn Brief\nPosted:\n3:23 PM PST · February 12, 2026\n\nImage Credits:Jeremy Moeller / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhile the ar",
    "body": "\nIn Brief\nPosted:\n3:23 PM PST · February 12, 2026\n\nImage Credits:Jeremy Moeller / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nWhile the artificial intelligence industry touts that AI will replace entry-level jobs, not every company is scaling back hiring these positions. In IBM’s case, it’s going all in.\nHardware giant IBM plans to triple entry-level hiring in the U.S. in 2026, according to reporting from Bloomberg. Nickle LaMoreaux, IBM’s chief human resource officer, announced the initiative at Charter’s Leading with AI Summit on Tuesday.\n“And yes, it’s for all these jobs that we’re being told AI can do,” LaMoreaux said.\nThese jobs will look different than the entry-level jobs IBM used to offer, she explained. According to LaMoreaux, she went through and changed the descriptions for these entry-level jobs so they were less focused on areas AI can actually automate — like coding — and more focused on people-forward areas like engaging with customers.\nThis strategy makes sense. Even if an enterprise like IBM doesn’t necessarily need the same amount of entry-level talent that it did before, fostering less experienced workers helps ensure these employees have the skills needed for the higher-level roles down the road.\nIBM didn’t specify how many people they would be hiring in this initiative. TechCrunch reached out to IBM for more information on the hiring plans.\nThis year could be a pivotal one regarding what the impact of AI on the hiring market will look like. An MIT study in 2025 estimated that 11.7% of jobs could likely already be automated by AI. A TechCrunch survey found that multiple investors think 2026 will start to show AI’s potential impact on the labor market — despite not being asked about labor specifically.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IBM will hire your entry-level talent in the age of AI",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2022/04/GettyImages-1254279163.jpg?w=150"
      ],
      "datePublished": "2026-02-12T23:23:17.000Z",
      "dateModified": "2026-02-12T23:23:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic raises another $30B in Series G, with a new value of $380B",
    "url": "https://techcrunch.com/2026/02/12/anthropic-raises-another-30-billion-in-series-g-with-a-new-value-of-380-billion/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256664479.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T20:18:37.000Z",
    "description": "\nIn Brief\nPosted:\n12:18 PM PST · February 12, 2026\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAnthropic has just concluded a $30 billion Series G fu",
    "body": "\nIn Brief\nPosted:\n12:18 PM PST · February 12, 2026\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAnthropic has just concluded a $30 billion Series G fundraising round, the company announced on Thursday. The company’s new value is $380 billion — a huge jump from its previous Series F valuation of $183 billion.\nSome details of the round were reported earlier this week by Bloomberg.\nThe new round was led by Singaporean wealth fund GIC and investment management firm Coatue, with a number of other prominent firms — including D. E. Shaw Ventures, Peter Thiel’s Founders Fund, and Abu Dhabi’s MGX — co-leading the round. Other significant investors listed include Accel, General Catalyst, Jane Street, and the Qatar Investment Authority, among many others.\nThe infusion of funding for the AI startup takes place as it is vying for customers and cultural attention with its competitor, OpenAI. OpenAI also recently made it known that it is seeking to clinch an additional $100 billion in funding, which, were it to secure the funds, would balloon the company’s valuation to some $830 billion.\n“Whether it is entrepreneurs, startups, or the world’s largest enterprises, the message from our customers is the same: Claude is increasingly becoming more critical to how businesses work,” said Krishna Rao, Anthropic’s chief financial officer, in a press release. “This fundraising reflects the incredible demand we are seeing from these customers, and we will use this investment to continue building the enterprise-grade products and models they have come to depend on.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic raises another $30B in Series G, with a new value of $380B",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2256664479.jpg?w=150"
      ],
      "datePublished": "2026-02-12T20:18:37.000Z",
      "dateModified": "2026-02-12T20:18:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump administration undermines EPA enforcement of Clean Air Act",
    "url": "https://techcrunch.com/2026/02/12/trump-administration-undermines-epa-enforcement-of-clean-air-act/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/07/GettyImages-921944624.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T19:13:31.000Z",
    "description": "\nIn Brief\nPosted:\n11:13 AM PST · February 12, 2026\n\nImage Credits:mheim3011/iStock / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAfter mon",
    "body": "\nIn Brief\nPosted:\n11:13 AM PST · February 12, 2026\n\nImage Credits:mheim3011/iStock / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAfter months of telegraphing the move, the Trump administration today officially repealed the EPA’s 2009 “endangerment finding,” which found that greenhouse gases such as carbon dioxide and methane were a threat to human health and welfare.\nThe finding had so far supported the agency’s regulation of greenhouse gases under the Clean Air Act. Currently, the new rule only applies to car and truck tailpipe emissions, but it’s expected to be the first of several similar changes to federal air pollution regulations.\nBefore the endangerment finding can be fully repealed, though, the EPA must go through a lengthy process. The original finding took two years to put in place.\nThe move by Lee Zeldin, the EPA administrator, will slow the decline in emissions by about 10%, according to Axios. That’s a significant amount, but not enough to reverse the trend, partly because cheap renewables have dominated new electricity-generation capacity in recent years.\n“This action will only lead to more pollution, and that will lead to higher costs and real harms for American families,” Fred Krupp, president of the Environmental Defense Fund, told TechCrunch in a statement.\nUnabated climate change is expected to raise mortality rates by around 2% in the U.S., and it could reduce global GDP by 17% by 2050, or about $38 trillion.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Climate\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump administration undermines EPA enforcement of Clean Air Act",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2018/07/GettyImages-921944624.jpg?w=150"
      ],
      "datePublished": "2026-02-12T19:13:31.000Z",
      "dateModified": "2026-02-12T19:13:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dutch phone giant Odido says millions of customers affected by data breach",
    "url": "https://techcrunch.com/2026/02/13/dutch-phone-giant-odido-says-millions-of-customers-affected-by-data-breach/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T15:54:13.000Z",
    "description": "\nDutch phone company Odido has confirmed a data breach affected millions of its customers.\nThe company said in a statement Thursday that unidentified ",
    "body": "\nDutch phone company Odido has confirmed a data breach affected millions of its customers.\nThe company said in a statement Thursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido told local Dutch media that the breach affects more than 6.2 million customers, or about a third of the country’s population.\nThe stolen data includes customer names, phone numbers, postal and email addresses, dates of birth, bank account numbers (IBAN), and details of customers’ government-issued IDs, such as passport or driver’s license numbers and dates of validity.\nThe company said former customers who had service within the past two years may also be affected.\nOdido said the data did not include customer call records, location data, billing information, or image scans of government IDs. The data does not affect business customers, the company said.\nThe breach affects customers of both Odido and its subsidiary Ben NL. Both companies said that their phone, internet, and television operations were unaffected by the breach.\nThis is the latest in a series of data thefts targeting phone and telecommunication giants in recent years, as governments and financially motivated hackers continue to seek highly confidential information that telcos have on their customers.\nEarlier this week, the Singaporean government confirmed that a China-related hacking group had previously broken into four of the country’s top phone giants as part of a surveillance operation, but did not access customers’ personal information.\nAll the while, hackers associated with the China-backed threat group known as Salt Typhoon have hacked hundreds of phone companies around the world, including in Canada, Norway, the United Kingdom, and the United States, as part of an ongoing espionage campaign aimed at spying on senior government officials and diplomats.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dutch phone giant Odido says millions of customers affected by data breach",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?w=150"
      ],
      "datePublished": "2026-02-13T15:54:13.000Z",
      "dateModified": "2026-02-13T15:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Didero lands $30M to put manufacturing procurement on ‘agentic’ autopilot",
    "url": "https://techcrunch.com/2026/02/12/didero-lands-30m-to-put-manufacturing-procurement-on-agentic-autopilot/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Founders_Exterior_Mid-3.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T20:31:47.000Z",
    "description": "\nTim Spencer realized just how complicated manufacturing procurement can be while running Markai, an e-commerce startup in Asia, during the pandemic.\n",
    "body": "\nTim Spencer realized just how complicated manufacturing procurement can be while running Markai, an e-commerce startup in Asia, during the pandemic.\n“We had thousands of suppliers, and we were distributing products into dozens of countries around the world,” Spencer (pictured left) told TechCrunch. His staff was overwhelmed by the manual complexity of sourcing suppliers, negotiating pricing, tracking orders, and managing payments.\n“I found myself running this big team that was not really set up for success,” he said. He sold Markai in 2023, just as it was becoming clear that generative AI could streamline the most time-consuming procurement hurdles for manufacturers and distributors.\nLater that year, Spencer launched Didero with Lorenz Pallhuber (pictured center), a veteran of McKinsey’s procurement practice, and Tom Petit, the former technical co-founder of Landis.\nDidero, whose mission is to automate many of the complexities of global procurement, just raised a $30 million Series A co-led by Chemistry and Headline, with participation from Microsoft’s venture fund M12.\n“Global trade runs on natural language communication,” Spencer said. “It’s emails, WeChat, phone calls, purchase orders, and packing lists.”\nUntil the advent of generative AI, these fragmented pieces had to be tracked by humans who spent their days chasing suppliers and manually updating systems of record. Didero claims its platform can ingest that communication, putting a significant portion of the procurement workflow on autopilot.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nDidero functions as an agentic AI layer that sits on top of a company’s existing ERP, acting as a coordinator that reads incoming communications and automatically executes the necessary updates and tasks.\n“The goal is to go from ‘I need a good’ to payment without having to lift a finger,” Spencer said.\nUnlike Levelpath, Zip, or Oro Labs, which use AI to streamline corporate purchasing, Didero focuses on the supply chain. Its platform is designed for manufacturers and distributors who need to source raw materials and inputs required to build or sell their products.\nDidero has a few smaller competitors that can handle some of the tasks that the company does. For instance, Cavela and Pietra help brands source and negotiate pricing with manufacturers, but according to Spencer, these companies serve small and medium-sized companies and don’t handle the full procurement process, from the first quote to the final payment.\nDidero has dozens of customers but named only one, Footprint, a provider of sustainable, plant-based packaging.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Didero lands $30M to put manufacturing procurement on ‘agentic’ autopilot",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/Founders_Exterior_Mid-3.jpg?w=150"
      ],
      "datePublished": "2026-02-12T20:31:47.000Z",
      "dateModified": "2026-02-12T20:31:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT",
    "url": "https://techcrunch.com/2026/02/12/amid-disappointing-earnings-pinterest-claims-it-sees-more-searches-than-chatgpt/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/pinterest-header.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T23:26:56.000Z",
    "description": "\nAfter a particularly poor performance on its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding",
    "body": "\nAfter a particularly poor performance on its fourth-quarter earnings, Pinterest CEO Bill Ready attempted to favorably compare the digital pinboarding site to the popular AI chatbot ChatGPT.\nTrying to highlight its potential as a unique search destination, Ready asserted that the site sees larger search volume than ChatGPT. According to third-party data, ChatGPT sees 75 billion searches per month, while Pinterest sees 80 billion searches and generates 1.7 billion monthly clicks, he said.\n“That makes us one of the largest search destinations in the world. And importantly, more than half of those searches are commercial in nature, compared to, I think . . . approximately 2% [of ChatGPT searches],” Ready added.\nPinterest in the fourth quarter missed expectations on both revenue and earnings per share, reporting $1.32 billion in revenue versus $1.33 billion expected, and earnings per share of 67 cents, compared to the 69 cents projected. It also forecast that first-quarter 2026 sales will come in between $951 million to $971 million, below the $980 million expected.\nThe company blamed its shortfall on larger advertisers pulling back on spend, particularly in Europe, and a new furniture tariff implemented in October that caused issues within the home category. It said those trends could worsen in the first quarter.\nSurprisingly, Pinterest missed on earnings despite a user base that’s growing faster than expected. The company reported monthly active users were up 12% year-over-year to 619 million, when Wall Street had forecast 613 million users.\nShares dropped 20% in after-hours trading.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nPinterest has long struggled to translate the high usage of its platform into ad dollars, as its users often go to Pinterest to plan and dream, not shop and buy. That challenge could become even more acute in the AI era, especially if advertisers shift their dollars to platforms where intent to buy is clearer — such as chatbot requests that ask for product recommendations.\nWhen asked about how Pinterest will navigate the shift toward AI-powered shopping, Ready pointed to the company’s visual search, discovery, and personalization features, which he said would point users to relevant products when they open the app.\n“We’re helping them complete those commercial journeys without having to type in a single prompt,” he said, also noting that Pinterest had benefited from an easier checkout flow that came from its partnership with Amazon. He said customers didn’t yet seem ready to allow an AI to make a purchase on their behalf, but said Pinterest would be ready if that time came.\n“That’ll actually be one of the easiest parts of the commercial journey to solve,” he claimed. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amid disappointing earnings, Pinterest claims it sees more searches than ChatGPT",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/pinterest-header.jpg?w=150"
      ],
      "datePublished": "2026-02-12T23:26:56.000Z",
      "dateModified": "2026-02-12T23:26:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTube finally launches a dedicated app for Apple Vision Pro",
    "url": "https://techcrunch.com/2026/02/12/youtube-finally-launches-a-dedicated-app-for-apple-vision-pro/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/06/wwdc-2023-vision-pro-eyesight.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T20:14:15.000Z",
    "description": "\nAfter two years of initial hesitation, YouTube has finally unveiled its dedicated app for the Apple Vision Pro.\nWhen Apple’s headset first launched, ",
    "body": "\nAfter two years of initial hesitation, YouTube has finally unveiled its dedicated app for the Apple Vision Pro.\nWhen Apple’s headset first launched, YouTube opted for a web-based approach instead of developing a dedicated app, directing viewers to use Safari to access content. Until now, anyone wanting to watch YouTube on the headset has missed out on helpful features like offline downloads — making it much less useful for travel or offline viewing. \nTo fill the gap, third-party options, such as Juno, briefly appeared on visionOS before being removed for violating YouTube’s Terms of Service.\nToday’s announcement changes the game, allowing users to enjoy their favorite content — including all standard videos and YouTube Shorts —on a theater-sized virtual screen in a fully immersive environment. \nStandout features include a Spatial tab that lets users discover spatial videos, including 3D, VR180, and 360-degree formats. For consumers with the latest Apple Vision Pro models powered by the M5 chip, the app supports 8K playback, a notable upgrade.\nAdditionally, users can interact with the new visionOS app using gesture controls, such as resizing windows or scrubbing through videos.\nThe timing of this app’s release is interesting, as YouTube initially hesitated to invest in a dedicated visionOS experience, possibly waiting to gauge the headset’s traction. Most major streaming services have offered native experiences on the platform since launch, including Disney+, Amazon Prime Video, Paramount, and Peacock, among others. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAnother reason why YouTube’s decision to launch the app now is interesting is that the initial hype surrounding the headset appears to have diminished. \nDespite the Apple Vision Pro introducing Apple Intelligence-powered features almost a year ago, user engagement with the headset has reportedly been lukewarm. Recent estimates indicate that sales have significantly declined, with only about 45,000 new units shipped during the fourth quarter of 2025. The Financial Times reported that production was halted due to weak demand, resulting in a sharp reduction in marketing efforts across key markets.\nThe app is now available in the visionOS App Store and is compatible with both the M2 and M5 chip models.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTube finally launches a dedicated app for Apple Vision Pro",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/06/wwdc-2023-vision-pro-eyesight.jpg?w=150"
      ],
      "datePublished": "2026-02-12T20:14:15.000Z",
      "dateModified": "2026-02-12T20:14:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Score, the dating app for people with good credit, is back",
    "url": "https://techcrunch.com/2026/02/13/score-the-dating-app-for-good-to-excellent-credit-returns-for-everyone-to-use/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Score-Images-2026.001-e1770927052925.png?w=150",
    "tag": "Tech",
    "date": "2026-02-13T14:00:00.000Z",
    "description": "\nTwo years ago, Luke Bailey had what became a controversial app idea — a dating app called Score for people with good to excellent credit. \nLaunched j",
    "body": "\nTwo years ago, Luke Bailey had what became a controversial app idea — a dating app called Score for people with good to excellent credit. \nLaunched just days before Valentine’s Day, the app required users to have a credit score of at least 675 to register. At the time, Bailey said he created the app to encourage partners to talk more about personal finance since doing so is often uncomfortable for many people. \n“Fifty-four percent of people say a partner’s debt is a reason to consider divorce,” Bailey told TechCrunch. “Financial compatibility is quietly one of the most important relationship factors, yet no dating platform addresses it directly.” \nThe app had its fair share of critics, and many people indeed called it classist because of its focus on those who handle money well. Still, the app, which was supposed to be available for 90 days, became so popular that Bailey kept it around for six months. It amassed 50,000 users and made headlines worldwide for its premise. \nThen, it went away, and all went back to normal in the world of dating. Until Friday. \nBailey told TechCrunch that he’s decided to officially bring Score back — for good, this time. \n“We originally released Score to integrate financial responsibility into something people deeply value — love,” Bailey said. “When we shut it down, we assumed the conversation would continue without us. It didn’t.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\nInstead, he said people kept asking him why he shut it down. “Academics have even reached out wanting to study behavior impact,” he continued. “It became clear this wasn’t just a viral moment. It tapped into something unresolved in relationship culture.” \nThis time around, Score will be available on the iOS App Store (last time it was just a mobile app, he said, because he and his team built it so quickly). Bailey also said this version of the app will be more inclusive, having taken into account the feedback that it was too exclusive. “So now, everyone can join.”\nThere will be two tiers: the basic tier, where no ID or credit verification is required, and anyone can browse and connect. And then the verified tier, where members must verify their ID and credit score to unlock premium features. The app uses Equifax to verify both identity and credit scores, with users giving consent for the app to do so. It does only what Bailey described as a soft pull, so there is no impact to credit.\n“We don’t store full credit reports or sensitive personal and financial data. We simply receive confirmation that someone meets the Verified criteria,” he said. \nThe verified plan includes features that let people see other members nearby, see who has saved their profile, send video intros to potential matches, and send messages to users before they’ve swiped back. \nHe’s still bullish on using credit scores, saying that it’s not a measure of wealth but rather one of consistency. “Banks look for the same thing in customers that we look for in relationships — consistency and reliability,” he said. “Dating apps measure attrition. We measure attrition plus accountability.” \nBailey said the app doesn’t store any sensitive data, doesn’t sell personal data, and secures everything using an encrypted infrastructure. \nThe last iteration of Score amassed a lot of data on its users, helping show how each generation has been affected by socioeconomic factors. For example, it found that millennial men had credit scores about 11% higher than those of women. But for Gen Zers, that gap was much smaller, with men having a credit score only 3% higher. \n“We’ll be watching how that data [has] evolved,” he said. \nThe original Score was a U.S.-only experiment, he said, but this time, the company plans a global expansion, starting with Canada. Keep an eye out for some partnerships, too, he said. \n“Financial behavior is one of the strongest predictors of life stability,” Bailey said. “We believe compatibility algorithms should reflect that.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Score, the dating app for people with good credit, is back",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/Score-Images-2026.001-e1770927052925.png?w=150"
      ],
      "datePublished": "2026-02-13T14:00:00.000Z",
      "dateModified": "2026-02-13T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
    "url": "https://techcrunch.com/2026/02/12/waymo-is-asking-doordash-drivers-to-shut-the-doors-of-its-self-driving-cars/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T04:41:41.000Z",
    "description": "\nIt still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future c",
    "body": "\nIt still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\nAccording to a Reddit post, one DoorDash driver discovered this issue when an odd request appeared in their queue. Instead of making a delivery, the driver was offered $6.25 to drive less than one mile to a Waymo vehicle and close its door. After “verified completion,” they would get an extra $5.\n“You actually ‘door’ dashed,” one commenter noted.\nImage Credits:Reddit (opens in a new window)\nIt seems too ironic to be real. Waymo vehicles represent technological breakthroughs that once seemed unfathomable. The Alphabet-owned company just raised $16 billion to take its driverless cars international!\nBut Waymo and DoorDash confirmed to TechCrunch that this Reddit post is legitimate. This is, in fact, a real problem.\n“Waymo is currently running a pilot program in Atlanta to enhance its AV fleet efficiency. In the rare event a vehicle door is left ajar, preventing the car from departing, nearby Dashers are notified, allowing Waymo to get its vehicles back on the road quickly,” Waymo and DoorDash said in a joint response. (The door-closing partnership, which began earlier this year, is just one facet of Waymo and DoorDash’s broader relationship. In October, the companies launched an autonomous delivery service in Phoenix, where Waymo vehicles deliver food and groceries to DoorDash customers.)\nIf a Waymo door is left open, it’s worth it to the company to pay someone to close it — the car cannot complete any more rides if it’s left immobile. Not to mention, an unmoving car could block the flow of traffic. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis isn’t the first time Waymo has enlisted help with its door troubles. In Los Angeles, Waymo works with Honk, an app that’s like Uber for towing services. According to reports, Honk users in L.A. have been offered up to $24 to close a Waymo door — more than double what Atlanta DoorDash drivers receive.\nThe company noted that Waymo’s future vehicles will have automated door closures. But for now, gig workers are Waymo’s best bet.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?w=150"
      ],
      "datePublished": "2026-02-13T04:41:41.000Z",
      "dateModified": "2026-02-13T04:41:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fusion startup Helion hits blistering temps as it races toward 2028 deadline",
    "url": "https://techcrunch.com/2026/02/13/fusion-startup-helion-hits-blistering-temps-as-it-races-toward-2028-deadline/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Helion-Polaris-D-T.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T10:00:00.000Z",
    "description": "\nThe Everett, Washington-based fusion energy startup Helion announced Friday that it has hit a key milestone in its quest for fusion power. Plasmas in",
    "body": "\nThe Everett, Washington-based fusion energy startup Helion announced Friday that it has hit a key milestone in its quest for fusion power. Plasmas inside the company’s Polaris prototype reactor have reached 150 million degrees Celsius, three-quarters of the way toward what the company thinks it will need to operate a commercial fusion power plant.\n“We’re obviously really excited to be able to get to this place,” David Kirtley, Helion’s co-founder and CEO, told TechCrunch.\nPolaris is also operating using deuterium-tritium fuel — a mixture of two hydrogen isotopes — which Kirtley said makes Helion the first fusion company to do so. “We were able to see the fusion power output increase dramatically as expected in the form of heat,” he said.\nThe startup is locked in a race with several other companies that are seeking to commercialize fusion power, a potentially unlimited source of clean energy.\nThat potential has investors rushing to bet on the technology. This week, Inertia Enterprises announced a $450 million Series A round that included Bessemer and GV. In January, Type One Energy told TechCrunch it was in the midst of raising $250 million, while last summer Commonwealth Fusion Systems raised $863 million from investors including Google and Nvidia. Helion itself raised $425 million last year from a group that included Sam Altman, Mithril, Lightspeed, and SoftBank.\nWhile most other fusion startups are targeting the early 2030s to put electricity on the grid, Helion has a contract with Microsoft to sell it electricity starting in 2028, though that power would come from a larger commercial reactor called Orion that the company is currently building, not Polaris.\nEvery fusion startup has its own milestones based on the design of its reactor. Commonwealth Fusion Systems, for example, needs to heat its plasmas to more than 100 million degrees C inside of its tokamak, a doughnut-shaped device that uses powerful magnets to contain the plasma.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nHelion’s reactor is different, needing plasmas that are about twice as hot to function as intended. \nThe company’s reactor design is what’s called a field-reversed configuration. The inside chamber looks like an hourglass, and at the wide ends, fuel gets injected and turned into plasmas. Magnets then accelerate the plasmas toward each other. When they first merge, they’re around 10 million to 20 million degrees C. Powerful magnets then compress the merged ball further, raising the temperature to 150 million degrees C. It all happens in less than a millisecond.\nInstead of extracting energy from the fusion reactions in the form of heat, Helion uses the fusion reaction’s own magnetic field to generate electricity. Each pulse will push back against the reactor’s own magnets, inducing electrical current that can be harvested. By harvesting electricity directly from the fusion reactions, the company hopes to be more efficient than its competitors.\nOver the last year, Kirtley said that Helion had refined some of the circuits in the reactor to boost how much electricity they recover.\nWhile the company uses deuterium-tritium fuel today, down the road it plans to use deuterium-helium-3. Most fusion companies plan to use deuterium-tritium and extract energy as heat. Helion’s fuel choice, deuterium-helium-3, produces more charged particles, which push forcefully against the magnetic fields that confine the plasma, making it better suited for Helion’s approach of generating electricity directly.\nHelion’s ultimate goal is to produce plasmas that hit 200 million degrees C, far higher than other companies’ targets, a function of its reactor design and fuel choice. “We believe that at 200 million degrees, that’s where you get into that optimal sweet spot of where you want to operate a power plant,” Kirtley said.\nWhen asked whether Helion had reached scientific breakeven — the point where a fusion reaction generates more energy than it requires to start it — Kirtley demurred. “We focus on the electricity piece, making electricity, rather than the pure scientific milestones.”\nHelium-3 is common on the Moon, but not here on Earth, so Helion must make its own fuel. To start, it’ll fuse deuterium nuclei to produce the first batches. In regular operation, while the main source of power will be deuterium-helium-3 fusion, some of the reactions will still be deuterium-on-deuterium, which will produce helium-3 that the company will purify and reuse.\nWork is already underway to refine the fuel cycle. “It’s been a pleasant surprise in that a lot of that technology has been easier to do than maybe we expected,” Kirtley said. Helion has been able to produce helium-3 “at very high efficiencies in terms of both throughput and purity,” he added.\nWhile Helion is currently the only fusion startup using helium-3 in its fuel, Kirtley said he thinks other companies will in the future, hinting that he’d be open to selling it to them. “Other folks — as they come along and recognize that they want to do this approach of direct electricity recovery and see the efficiency gains from it — will want to be using helium-3 fuel as well,” he said.\nAlongside its experiments with Polaris, Helion is also building Orion, a 50-megawatt fusion reactor it needs to fulfill its Microsoft contract “Our ultimate goal is not to build and deliver Polaris,” Kirtley said. “That’s a step along the way towards scaled power plants.”\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fusion startup Helion hits blistering temps as it races toward 2028 deadline",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/Helion-Polaris-D-T.jpeg?w=150"
      ],
      "datePublished": "2026-02-13T10:00:00.000Z",
      "dateModified": "2026-02-13T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "For $1M, you can pay Bryan Johnson (or BryanAI?) to teach you how to live longer",
    "url": "https://techcrunch.com/2026/02/12/for-1-million-you-can-pay-bryan-johnson-or-bryanai-to-teach-you-how-to-live-longer/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/Screenshot-2025-03-13-at-6.23.04PM.png?w=150",
    "tag": "Tech",
    "date": "2026-02-12T23:43:47.000Z",
    "description": "\nIt’s the middle of February, and the air is dry. There are fine lines emerging on my forehead, maybe because I don’t moisturize enough, but maybe as ",
    "body": "\nIt’s the middle of February, and the air is dry. There are fine lines emerging on my forehead, maybe because I don’t moisturize enough, but maybe as a harbinger of something greater: Each day I grow closer to my own death. Soon, I will be 30. I will never be younger than I am right now.\nFintech-founder-turned-longevity-guru Bryan Johnson has an offer that has caught my attention. For the low, low price of $1 million per year, I can pay him to show me the ropes of the “exact protocol” he’s followed for the last five years. He calls the program “Immortals.”\nYes, a guy who has received botox injections in his genitals will teach me how to supposedly reverse the process of aging. Why shouldn’t I believe that Bryan Johnson has uncovered the secrets to living longer than any other human? No, he has not yet proven his capacity to outlive all other humans. He was born in 1977, a year in which many current humans were born.\nBut why would I doubt the judgment of a guy who fortified his constitution with blood from his teenage son? When have the tech elite ever misled us? Should I also question when Elon Musk says that saving for retirement is irrelevant because AGI will create an economic abundance so great that no one will ever know poverty again?\n\nToday, we are launching Immortals.    + $1,000,000 per year    + Three spots availableImmortals is the world’s best health program. It is the exact protocol I have followed for the last 5 years. It is your Autonomous Health.Includes a dedicated concierge team, BryanAI… pic.twitter.com/o2DGRtn7IH— Bryan Johnson (@bryan_johnson) February 12, 2026\n\nAccording to Johnson’s post on X, this exclusive service — only three spots are available! — will include “a dedicated concierge team, BryanAI 24/7, extensive testing, millions of biological data points, continuous tracking, best skin and hair protocols, and access to the best therapies on market.”\nI can talk to the AI version of a guy who livestreams himself doing shrooms for “science”? Sign me up!\nExcept I can’t. Because I do not have $1 million. Those like me will have to settle for buying Johnson’s overpriced olive oil in our pursuit of immortality (it’s peppery and smooth!).\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMy emergent forehead wrinkle intensifies with the knowledge that Johnson will likely have an easy time filling up those three $1 million spots. Among the ultrawealthy, longevity has become an increasingly hot pursuit.\nJohn Hering, who has given Musk billions of dollars in backing, co-founded Biograph, which describes itself as a preventative health and diagnostics clinic. Its most premium membership costs $15,000 a year (next to Johnson’s offering, it almost seems like a good deal … almost). A similar startup, Fountain Life, has raised $108 million to fund its “ultimate longevity program,” which charges a $21,500 annual fee. Sure, Johnson’s program is a lot more expensive, but remember, there’s only three spots! And if you’re still not ready to shell out seven figures, well, you can access a vague “supported tier” for $60,000.\nThere’s nothing wrong with wanting to live a longer, healthier life, but longevity influencers like Johnson take this to an extreme that’s unattainable and (common sense would say) totally unnecessary for the average person.\nIn his defense, Johnson isn’t trying to proselytize us all into taking 100 pills a day and subsisting largely on boiled vegetables. But he’s also not depriving us of the chance to make him richer in exchange for his “secrets.”\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "For $1M, you can pay Bryan Johnson (or BryanAI?) to teach you how to live longer",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/03/Screenshot-2025-03-13-at-6.23.04PM.png?w=150"
      ],
      "datePublished": "2026-02-12T23:43:47.000Z",
      "dateModified": "2026-02-12T23:43:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Automattic planned to target 10 competitors with royalty fees, WP Engine claims in new filing",
    "url": "https://techcrunch.com/2026/02/12/automattic-planned-to-target-10-competitors-with-royalty-fees-wp-engine-claims-in-new-filing/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v1.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T19:02:07.000Z",
    "description": "\nWeb hosting company WP Engine has filed an amended complaint with brow-raising new allegations in its ongoing legal battle with WordPress co-founder ",
    "body": "\nWeb hosting company WP Engine has filed an amended complaint with brow-raising new allegations in its ongoing legal battle with WordPress co-founder Matt Mullenweg and his company Automattic (WordPress.com’s parent company). The company now claims that Mullenweg intended to target 10 different hosting companies with royalty payments for their use of the WordPress trademark and tried to get payment processor Stripe to cancel its contract with WP Engine.\nAt the heart of the dispute, Mullenweg believes WP Engine is profiting from the open source WordPress project without contributing back to the community, and demanded the hosting company pay 8% of its monthly gross revenues as a royalty fee for using the WordPress brand.\nThe suit, originally filed by WP Engine in October 2024, accused Automattic and Mullenweg of defamation and abuse of power. Automattic filed its counterclaims last year, alleging that the hosting company has been abusing the WordPress trademark and engaging in deceptive marketing practices.\nIn this latest filing, WP Engine has amended its complaint for the third time after gaining access to information that was uncovered during the discovery process. The information, now unredacted, had been previously sealed at Automattic’s request.\nNotably, one of the new claims accuses Automattic of allegedly planning to target 10 other competitors with royalty claims similar to those aimed at WP Engine.\nThe complaint also states that Newfold, a company whose portfolio includes hosting providers like Bluehost and HostGator, among others, is already paying Automattic for use of its trademarks and that Automattic is in conversations with others. (Names of the other hosts were redacted in the complaint, which referenced email conversations between those companies and Mullenweg.)\nWP Engine is also alleging that Mullenweg reached out to a Stripe executive via email to pressure the company to cancel WP Engine’s contract. This occurred after WP Engine had filed its lawsuit against Automattic, the complaint states.\nThe filing also challenges the 8% rate for the royalty payments as being somewhat arbitrary. Referencing Mullenweg’s comments at TechCrunch Disrupt 2024, WP Engine claims that the Automattic founder essentially came up with the rate because it was what he thought WP Engine “could afford to pay.”\n\n\n\nAt Disrupt, Mullenweg had responded to a question about how he settled on the 8% fee by saying it was based on a “business analysis.”\n“If you estimate that would be about $32 million — they still would have been free cash-flow positive, and based on our estimates, and the negotiations over the past 18 months, we felt like that was a fair amount,” he said at the event.\nOther new claims in the filing point to aggressive language Mullenweg allegedly used against WP Engine, like threats that if the web hosting provider didn’t comply, he would start stealing its customers. “If they don’t take the carrot, we’ll give them the stick,” was one of the quotes cited from internal correspondence at Automattic, for instance.\nThe complaint also includes allegations that Mullenweg used the term “nuclear war” to describe his approach to WP Engine’s defiance.\nAsked about the new filing, Automattic shared the following statement with TechCrunch: “There is nothing new here. This is the same narrative WP Engine has been pushing for over a year, and the Court has already dismissed many of its central claims. The lawsuit is going nowhere. This latest filing simply repackages the same tired allegations in an effort to keep the story alive. WP Engine is trying to recast robust competition as something nefarious. We are confident the courts will continue to reject that theory.”\n\nUpdated after publication with Automattic’s statement. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Automattic planned to target 10 competitors with royalty fees, WP Engine claims in new filing",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/wordpress-automattic-v1.jpg?w=150"
      ],
      "datePublished": "2026-02-12T19:02:07.000Z",
      "dateModified": "2026-02-12T19:02:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rivian was saved by software in 2025",
    "url": "https://techcrunch.com/2026/02/12/rivian-was-saved-by-software-in-2025/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/250522-ANASTASIA-BENSON-GOOGLE-MAPS-AEB08056-FINAL.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-12T23:17:32.000Z",
    "description": "\nRivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow b",
    "body": "\nRivian is, by every measure, a maker and seller of EVs. But in 2025, it was the company’s software and services that helped its annual revenue grow by 8%. \nRivian reported Thursday $5.38 billion in total revenue in 2025, up from $4.97 billion from the prior year. That rosy picture dulls a bit when looking just at its automotive revenue, which fell 15% to $3.8 billion in 2025. The fall was fueled by a $134 million drop in regulatory credit sales and lower vehicle deliveries, which were partially offset by higher average selling prices, according to Rivian. \nMeanwhile, software and services revenue grew more than threefold to $1.55 billion for the year. And the joint venture with Volkswagen Group was behind most of that growth, according to Rivian. The “services” component of this line item, which Rivian doesn’t break out, includes a variety of items, including vehicle repair, vehicle trade-ins, and maintenance services. The remainder, and the bulk of the revenue, is from software, and specifically due to the joint venture with VW Group. \nVW and Rivian formed a technology joint venture in 2024 that is worth up to $5.8 billion. The joint venture is milestone-based and in 2025 Rivian hit the mark, which meant a $1 billion payout in the form of a share sale. Under the terms of the JV, Rivian will supply VW Group with its existing electrical architecture and software technology stack. \nRivian received an initial $1 billion convertible note in 2024 and another $1 billion payment in July 2025. \nRivian is expected to continue to receive payments from VW Group through 2027. Rivian is expected to receive an additional $2 billion of capital as part of the joint venture in 2026, CFO Claire McDonough said Thursday on the company earnings call. About $1 billion of that is subject to the successful completion of winter testing, which is underway. The remaining $1 billion is nonrecourse debt, which is expected to be received in October.\nAnd while the funds provide a hefty stopgap, Rivian’s financial success in 2026 will hinge largely on the rollout of its next EV, the R2. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nRivian confirmed in its earnings report Thursday that the R2 SUV, which is designed to be cheaper to build and less expensive for customers, will come to market by June 2026. That “cheaper to build” line item is particularly crucial for Rivian, which has historically lost money on every vehicle it makes. \nRivian has spent years trying to push the cost of goods sold figure down. And it has made progress with the rollout of its second-generation flagship R1T truck and R1S SUV. For instance, McDonough said “in the fourth quarter it was able to deliver $92,000 of cogs per unit and that was about a $4,000 per unit improvement relative to the third quarter.” Rivian’s cogs per unit was $99,000 in the fourth quarter of 2024.\nThe company saw its total automotive cost of revenue decrease year-over-year from $1.4 billion in the fourth quarter of 2024 to $898 million in the same quarter in 2025. Notably, the company’s cost of revenue for software steadily inched up throughout 2025.\nThe R2 SUV, which will initially launch as a dual motor all-wheel-drive model, is an opportunity to further reduce costs. The company is expected to release more information about the R2, including final specs, on March 12. \nRivian’s guidance for 2026 suggests that it is banking on demand for R2 and its ability to ramp up production. The company said Thursday it expects to deliver between 62,000 and 67,000 vehicles in 2026 — which could provide up to a 59% bump from last year. Rivian delivered 42,247 vehicles in 2025, which includes its two R1 consumer vehicles and the electric delivery van (EDV). \nRivian CEO RJ Scaringe noted that the company expects some growth in EDV sales in 2026. Rivian plans to produce an all-wheel-drive version and a larger battery pack variant of the EDV, for which Amazon is its primary customer.\n“Both of those are to help unlock specific use cases within the Amazon network,” Scaringe said. “We’re working really closely with Amazon in defining the requirements of those and excited to get those launched.”\nThe company isn’t signaling profitability — on an adjusted basis — just yet. But it is offering up considerable improvement on that front. Rivian reported a $3.6 billion net loss in 2025; it expects an adjusted net loss of between $1.8 billion and $2.1 billion for 2026. Rivian also projects capital expenditures will be between $1.95 billion and $2.05 billion this year.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rivian was saved by software in 2025",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/250522-ANASTASIA-BENSON-GOOGLE-MAPS-AEB08056-FINAL.jpg?w=150"
      ],
      "datePublished": "2026-02-12T23:17:32.000Z",
      "dateModified": "2026-02-12T23:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]