[
  {
    "title": "OpenAI says it’s fixed ChatGPT’s em dash problem",
    "url": "https://techcrunch.com/2025/11/14/openai-says-its-fixed-chatgpts-em-dash-problem/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T17:59:45.000Z",
    "description": "\nIn Brief\nPosted:\n9:59 AM PST · November 14, 2025\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t",
    "body": "\nIn Brief\nPosted:\n9:59 AM PST · November 14, 2025\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOpenAI says ChatGPT will now ditch the em dashes if you tell it to. The telltale sign that supposedly signals text written by AI has popped up everywhere in recent months, including in school papers, emails, comments, customer service chats, LinkedIn posts, online forums, ad copy, and more. The inclusion of the em dash has led people to criticize those writers for being lazy and turning to an AI chatbot to do their work.\nOf course, many have also argued for the em dash, saying it’s been a part of their writing well before LLMs adopted the punctuation. However, the fact that chatbots couldn’t seem to avoid its use made the so-called “ChatGPT hyphen” a newly objectionable addition to any text, even if they weren’t a reliable signal of content created by generative AI.\nThe problem had stumped OpenAI for some time, as ChatGPT users were unable to get the chatbot to stop using the symbol, even when they specifically asked it not to.\nNow, OpenAI CEO Sam Altman says the company has fixed the problem. In a post on X, Altman writes, “If you tell ChatGPT not to use em-dashes in your custom instructions, it finally does what it’s supposed to do,” calling the update a “small-but-happy win.”\n\nSmall-but-happy win:If you tell ChatGPT not to use em-dashes in your custom instructions, it finally does what it's supposed to do!— Sam Altman (@sama) November 14, 2025\n\nThe company explains in a post on Threads (where it forced ChatGPT to apologize for “ruining the em dash”) that ChatGPT will be better at not using the em dash if you instruct it not to via the custom instructions in your personalization settings. That means it won’t necessarily eliminate the em dash from its output by default, but you will at least have more control over the frequency of its appearance.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI says it’s fixed ChatGPT’s em dash problem",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150"
      ],
      "datePublished": "2025-11-14T17:59:45.000Z",
      "dateModified": "2025-11-14T17:59:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boeing has a carbon emissions problem. Startup Charm Industrial is cleaning up.",
    "url": "https://techcrunch.com/2025/11/14/boeing-has-a-carbon-emissions-problem-startup-charm-industrial-is-cleaning-up/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-1129910221.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T17:04:10.000Z",
    "description": "\nIn Brief\nPosted:\n9:04 AM PST · November 14, 2025\n\nImage Credits:Stephen Brashear / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nBoeing has",
    "body": "\nIn Brief\nPosted:\n9:04 AM PST · November 14, 2025\n\nImage Credits:Stephen Brashear / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nBoeing has signed a deal with startup Charm Industrial to remove 100,000 metric tons of carbon from the atmosphere.\nCharm collects agricultural and forestry waste and uses heat to turn it into a product it calls “bio-oil,” a messy jumble of hydrocarbons that it injects underground, including into former oil wells. Once sequestered, Charm can sell carbon removal credits to companies. Axios first reported on the startup’s deal with Boeing.\nAviation has made little progress on cutting its carbon emissions. That has left companies in the sector searching for alternatives. Carbon removal has emerged as a contender given that it has the potential to cost less than transitioning to sustainable aviation fuels.\nBy 2050, one study found that the aviation industry will need to spend at least $60 billion on carbon offsets to reach net zero emissions.\nCharm can also produce biochar, a substance that when applied to farm fields can help boost soil productivity, though those efforts are still in their infancy, according to data from carbon removal registry Isometric.\nFinancial terms of the deal were not disclosed. Two years ago, Charm sold 112,000 carbon removal credits to Frontier, the advanced market commitment, for $53 million, or about $470 per metric ton. Charm has said it wants to bring the cost down to about $50 per metric ton.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Climate\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boeing has a carbon emissions problem. Startup Charm Industrial is cleaning up.",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2019/03/GettyImages-1129910221.jpg?w=150"
      ],
      "datePublished": "2025-11-14T17:04:10.000Z",
      "dateModified": "2025-11-14T17:04:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok users can now share tracks and more from Amazon Music",
    "url": "https://techcrunch.com/2025/11/14/tiktok-users-can-now-share-tracks-and-more-from-amazon-music/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/thumbnail_LE-SSERAFIM_Share-to-TikTok_Insights.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T14:00:00.000Z",
    "description": "\nIn Brief\nPosted:\n6:00 AM PST · November 14, 2025\n\nImage Credits:TikTok\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTikTok is rolling out a new feature",
    "body": "\nIn Brief\nPosted:\n6:00 AM PST · November 14, 2025\n\nImage Credits:TikTok\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTikTok is rolling out a new feature that will allow users to share content from Amazon Music to the social network, the company told TechCrunch exclusively. \nWith a new “Share to TikTok” button, Amazon Music users can share songs, albums, playlists, and personal listening highlights from their Insights on Amazon Music directly to TikTok. \nFor context, Amazon Music Insights is a new personalized feature that gives listeners a detailed look at their music habits and stats. It includes “Monthly Recaps” that spotlight your top artists, songs, podcasts, and total listening time. Amazon Music users can now share these stats directly to TikTok. \nTikTok already supports “Share to TikTok” features for both Spotify and Apple Music. \nTikTok says the update builds on its current partnership with Amazon Music through its “Add to Music App” feature that allows users to save the songs they discover on TikTok directly to Amazon Music and other leading streaming services. \nThursday’s announcement makes sense for TikTok, an app known for influencing which songs top the charts. By adding Amazon Music to its “Share to TikTok” options, TikTok gains an increased ability to connect users with their favorite songs and artists.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Social\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok users can now share tracks and more from Amazon Music",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/thumbnail_LE-SSERAFIM_Share-to-TikTok_Insights.jpg?w=150"
      ],
      "datePublished": "2025-11-14T14:00:00.000Z",
      "dateModified": "2025-11-14T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Databricks co-founder argues US must go open source to beat China in AI",
    "url": "https://techcrunch.com/2025/11/14/databricks-co-founder-argues-us-must-go-open-source-to-beat-china-in-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-1091738564.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T22:52:18.000Z",
    "description": "\nAndy Konwinski is concerned that the U.S. is losing its dominance in AI research to China, calling the shift an “existential” threat to democracy. Ko",
    "body": "\nAndy Konwinski is concerned that the U.S. is losing its dominance in AI research to China, calling the shift an “existential” threat to democracy. Konwinski is a Databricks co-founder and the co-founder of the AI research and venture capital firm Laude.\n“If you talk to PhD students at Berkeley and Stanford in AI right now, they’ll tell you that they’ve read twice as many interesting AI ideas in the last year that were from Chinese companies than American companies,” Konwinski said onstage at the Cerebral Valley AI Summit this week.  \nIn addition to investing through Laude, the venture fund he launched last year with NEA veteran Pete Sonsini and Antimatter CEO Andrew Krioukov, Konwinski also runs the Laude Institute, an accelerator that offers grants to researchers.\nMajor AI labs, including OpenAI, Meta, and Anthropic, continue to innovate significantly, yet their innovations remain largely proprietary rather than open source. Moreover, these companies are sucking up top academic talent by offering multimillion-dollar salaries that dwarf what these experts can earn in universities.\nKonwinski argued that for ideas to truly flourish, they need to be freely exchanged and discussed with the larger academic community. He pointed out that generative AI emerged as a direct result of the Transformer architecture, a pivotal training technique introduced in a freely available research paper.\n“The first nation that makes the next ‘Transformer architectural level’ breakthrough will have the advantage,” Konwinski said.\nKonwinski argues that in China, the government supports and encourages AI innovation, whether from labs like DeepSeek or Alibaba’s Qwen, to be open sourced, which allows others to build upon them and which, he contends, will inevitably lead to more breakthroughs.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nHe believes this stands in stark contrast to the U.S., where, as he puts it, “the diffusion of scientists talking to scientists that we always have had in the United States, it’s dried up.”\nKonwinski argues that this trend poses not only a risk to democracy but also a business threat to major U.S. AI labs. “We’re eating our corn seeds; the fountain is drying up. Fast-forward five years, the big labs are gonna lose too,” he said. “We need to make sure the United States stays number one and open.” \n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Databricks co-founder argues US must go open source to beat China in AI",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-1091738564.jpg?w=150"
      ],
      "datePublished": "2025-11-14T22:52:18.000Z",
      "dateModified": "2025-11-14T22:52:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla releases detailed safety report after Waymo co-CEO called for more data",
    "url": "https://techcrunch.com/2025/11/14/tesla-releases-detailed-safety-report-after-waymo-co-ceo-called-for-more-data/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-3.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T21:57:21.000Z",
    "description": "\nTesla has published the most detailed look at the performance and relative safety of its advanced driver-assistance software, just a few weeks after ",
    "body": "\nTesla has published the most detailed look at the performance and relative safety of its advanced driver-assistance software, just a few weeks after Waymo’s co-CEO Tekedra Mawakana at TechCrunch Disrupt called on companies to release more data.\nOn a new section of its website, Tesla claims that in North America, owners using the company’s Full Self-Driving (Supervised) software are driving around 5 million miles before a major collision and around 1.5 million miles before a minor collision.\nThat’s a far lower rate than the national average based on statistics provided by the National Highway Traffic Safety Administration (NHTSA). That data shows people get in a major collision every 699,000 miles, and a minor one every 229,000, at least according to Tesla’s interpretation.\nTesla has been releasing “vehicle safety reports” on a quarter-by-quarter basis for a while. But those reports have been repeatedly panned for being insufficient. And Tesla has released almost no information about the safety performance of the Robotaxi trial it’s been running in Austin, Texas, this year, which still has employees in the driver’s seat monitoring for safety reasons.\nWaymo, the leading robotaxi company in the U.S. at the moment based on cars deployed and customers served, has published detailed data showing its vehicles are around 5x safer than human drivers, and 12x safer with respect to pedestrians. At last month’s Disrupt conference, Mawakana was asked to name other companies she felt were making roads safer.\n“I don’t know who’s on that list, because they’re not telling us what’s happening with their fleets,” said Mawakana, without naming Tesla.\n“I think there is a responsibility, if you’re going to put vehicles on the road, and you’re going to remove the driver from behind the wheel, and you’re going to have someone in some other room observing the fleet who can take over their vehicles, it is incumbent upon you to be transparent about what’s happening,” she added. “And if you are not being transparent, then it is my view that you are not doing what is necessary in order to actually earn the right to make the road safer.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nWaymo didn’t immediately respond to a request for comment Friday about whether Mawakana believes Tesla’s new data is sufficient.\nOne of the repeated criticisms of Tesla’s quarterly safety reports is that it focused on Autopilot, a far less advanced driver-assistance system than the Full Self Driving (Supervised) software, or FSD — which, despite its name, does not make a car fully autonomous. Autopilot was designed to be used on highways, which typically see a lower rate of crashes (when including minor collisions).\nTesla has finally broken out all this data. The new section of Tesla’s website claims that drivers using FSD travel about 2.9 million miles between major collisions, while NHTSA data shows all drivers travel about 505,000 miles per major collision. Tesla claims FSD users drive about 986,000 miles between minor collisions, while NHTSA data shows all drivers travel around 178,000 miles per minor collision.\nTesla is also finally showing how it defines these terms for the first time. \nThe carmaker is using the Federal Motor Vehicle Safety Standards, specifically 49 C.F.R. § 563.5. Tesla defines “major collisions” as crashes with higher-severity impacts where a vehicle’s airbags “or other non-reversible pyrotechnic restraints” are deployed. The company also says that if FSD was active “at any point within five seconds leading up to a collision event,” then it includes that crash in this dataset.\n“This calculation ensures that our reported collision rates for FSD (Supervised) capture not only collisions that occur while the system is actively controlling the vehicle, but also scenarios where a driver may disengage the system or where the system aborts on its own shortly before impact,” Tesla says.\nIn its FAQ section, Tesla states that it will update the data every quarter and that it will “reflect a rolling twelve-month aggregation of miles and collisions in an effort to remain relevant to recent trends and progress.” The company says it won’t release other information, like injury rates, because it is collecting this data automatically from the vehicles.\n“Instead, Tesla focuses on objective and programmatic metrics such as collision frequency and airbag deployment rates. Airbag deployments serve as a reliable proxy for collision severity,” the company writes.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla releases detailed safety report after Waymo co-CEO called for more data",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/12/tesla-autopilot-3.jpg?w=150"
      ],
      "datePublished": "2025-11-14T21:57:21.000Z",
      "dateModified": "2025-11-14T21:57:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leaked documents shed light into how much OpenAI pays Microsoft",
    "url": "https://techcrunch.com/2025/11/14/leaked-documents-shed-light-into-how-much-openai-pays-microsoft/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2214107176.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-15T00:47:41.000Z",
    "description": "\nAfter a year of frenzied dealmaking and rumors of an upcoming IPO, the financial scrutiny into OpenAI is intensifying. Leaked documents obtained by t",
    "body": "\nAfter a year of frenzied dealmaking and rumors of an upcoming IPO, the financial scrutiny into OpenAI is intensifying. Leaked documents obtained by tech blogger Ed Zitron provide more of a glimpse into OpenAI’s financials – specifically its revenue and compute costs over the past couple of years.  \nZitron reported this week that in 2024, Microsoft received $493.8 million in revenue share payments from OpenAI. In the first three quarters of 2025, that number jumped to $865.8 million, according to documents he viewed.\nOpenAI reportedly shares 20% of its revenue with Microsoft as part of a previous deal where the software giant invested over $13 billion in the powerful AI startup. (Neither the startup nor the people in Redmond have publicly confirmed this percentage.)\nHowever, this is where things get a little sticky because Microsoft also shares revenue with OpenAI, kicking back about 20% of the revenues from Bing and Azure OpenAI Service, a source familiar with the matter told TechCrunch. Bing is powered by OpenAI, and the OpenAI Service sells cloud access to OpenAI’s models to developers and businesses.  \nThe source also told TechCrunch that the leaked payments refer to Microsoft’s net revenue share, not the gross revenue share. In other words, they don’t include whatever Microsoft paid to OpenAI from Bing and Azure OpenAI royalties. Microsoft deducts those figures from its internally reported revenue share numbers, according to this person.\nMicrosoft doesn’t break out how much it makes from Bing and Azure OpenAI in its financial statements, so it’s difficult to estimate how much the tech giant is kicking back.\nNevertheless, the leaked documents provide a window into the hottest company on the private markets today – and not just how much it makes in revenue, but also how much it’s spending in comparison to that revenue.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSo, based on that widely reported 20% revenue-share statistic, we can infer that OpenAI’s revenue was at least $2.5 billion in 2024 and $4.33 billion in the first three quarters of 2025 – but very likely to be more. Previous reports from The Information put OpenAI’s 2024 revenue at around $4 billion, and its revenue from the first half of 2025 at $4.3 billion.  \nAltman also recently said OpenAI’s revenue is “well more” than reports of $13 billion a year, will end the year above $20 billion in annualized revenue run rate (which is a projection, not guidance on actual revenue) and that the company could even hit $100 billion by 2027. \nPer Zitron’s analysis, OpenAI may have spent roughly $3.8 billion on inference in 2024. That spend increased to roughly $8.65 billion in the first nine months of 2025. Inference is the compute used to run a trained AI model to generate responses.  \nOpenAI has historically almost exclusively relied on Microsoft Azure to provide compute access, though it has also struck deals with CoreWeave and Oracle, and more recently with AWS and Google Cloud. \nPrevious reports put OpenAI’s entire compute spend at roughly $5.6 billion for 2024 and its “cost of revenue” at $2.5 billion for the first half of 2025.  \nA source familiar with the matter told TechCrunch that while OpenAI’s training spend is mostly non-cash – meaning, paid by credits Microsoft awarded OpenAI as part of its investment – the firm’s inference spend is largely cash. (Training refers to the compute resources needed to initially train a model.)\nWhile not a complete picture, these numbers imply that OpenAI could be spending more on inference costs than it is earning in revenue. \nAnd those implications promise to add to the incessant AI bubble chatter that has seeped into every conversation from New York City to Silicon Valley. If model giant OpenAI really still is in the red running its models, what might this mean for the massive investments at jaw-dropping valuations for the rest of the AI world?\nOpenAI declined to comment. Microsoft did not respond to TechCrunch’s request for comment.\nGot a sensitive tip or confidential documents? We’re reporting on the inner workings of the AI industry — from the companies shaping its future to the people impacted by their decisions. Reach out to Rebecca Bellan at rebecca.bellan@techcrunch.com or Russell Brandom at russell.brandom@techcrunch.com. For secure communication, you can contact them via Signal at @rebeccabellan.491 and russellbrandom.49.\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leaked documents shed light into how much OpenAI pays Microsoft",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2214107176.jpg?w=150"
      ],
      "datePublished": "2025-11-15T00:47:41.000Z",
      "dateModified": "2025-11-15T00:47:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Apple’s new App Review Guidelines clamp down on apps sharing personal data with ‘third-party AI’",
    "url": "https://techcrunch.com/2025/11/13/apples-new-app-review-guidelines-clamp-down-on-apps-sharing-personal-data-with-third-party-ai/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/01/app-store-2024-v1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T21:14:35.000Z",
    "description": "\nApple on Thursday introduced a new set of App Review Guidelines for developers, which now specifically state that apps must disclose and obtain users",
    "body": "\nApple on Thursday introduced a new set of App Review Guidelines for developers, which now specifically state that apps must disclose and obtain users’ permission before sharing personal data with third-party AI.\nThe change comes ahead of the iPhone maker’s plan to introduce its own AI-upgraded version of Siri in 2026.\nThat update will see Apple’s digital assistant offer users the ability to take actions across apps using Siri commands, and will be powered, in part, by Google’s Gemini technology, according to a recent Bloomberg report.\nAt the same time, Apple is ensuring other apps aren’t leaking personal data to AI providers or other AI businesses. \nWhat’s interesting about this particular update is not the requirements being described but that Apple has specifically called out AI companies as needing to come into compliance. \nBefore the revised language, the guideline known as rule 5.1.2(i) included language around disclosure and obtaining user consent for data sharing, noting that apps could not “use, transmit or share” someone’s personal data without their permission. This rule served as part of Apple’s compliance with data privacy regulations like the EU’s GDPR (General Data Protection Regulation), California’s Consumer Privacy Act, and others, which ensure that users have more control over how their data is collected and shared. Apps that don’t follow the policy can be removed from the App Store.\nThe newly revised guideline adds the following sentence (emphasis ours): \n\nYou must clearly disclose where personal data will be shared with third parties, including with third-party AI, and obtain explicit permission before doing so.\n\nThis change could impact apps that intend to use AI systems to collect or process information about their users, perhaps to personalize their apps or provide certain functionality. It’s unclear how stringently Apple will enforce the rule, given that the term “AI” could include a variety of technologies — not just LLMs, but also things like machine learning.\nThe updated rule is one of several revisions to the App Review Guidelines out on Thursday. Other changes are focused on supporting Apple’s new Mini Apps Program, also announced today, as well as tweaks to rules involving creator apps, loan apps, and more.\nOne addition also added crypto exchanges to the list of apps that provide services in highly regulated fields.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Apple’s new App Review Guidelines clamp down on apps sharing personal data with ‘third-party AI’",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/01/app-store-2024-v1.jpg?w=150"
      ],
      "datePublished": "2025-11-13T21:14:35.000Z",
      "dateModified": "2025-11-13T21:14:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five people plead guilty to helping North Koreans infiltrate US companies as ‘remote IT workers’",
    "url": "https://techcrunch.com/2025/11/14/five-people-plead-guilty-to-helping-north-koreans-infiltrate-us-companies-as-remote-it-workers/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/kim-jong-un-north-korea.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T17:15:09.000Z",
    "description": "\nFive people have pleaded guilty to helping North Koreans defraud U.S. companies by posing as remote IT workers, the U.S. Department of Justice (DOJ) ",
    "body": "\nFive people have pleaded guilty to helping North Koreans defraud U.S. companies by posing as remote IT workers, the U.S. Department of Justice (DOJ) announced on Friday.\nThe five people are accused of working as “facilitators” who helped North Koreans get jobs by providing their own real identities, or false and stolen identities of more than a dozen U.S. nationals. The facilitators also hosted company-provided laptops in their homes across the U.S. to make it look like the North Korean workers lived locally, according to the DOJ press release.\nThese actions affected 136 U.S. companies and netted Kim Jong Un’s regime $2.2 million in revenue, said the DOJ.\nThe latest round of guilty pleas is part of a years-long effort by American authorities to disrupt North Korea’s ability to make money from cybercrime. For years, North Korea has successfully infiltrated hundreds of Western companies posing as remote IT workers — as well as investors and recruiters — as part of a scheme to fund its internationally sanctioned nuclear weapons program. In recent years, the U.S. government has fought back, indicting people involved in the scheme, and imposing sanctions on international fraud networks. \n“These prosecutions make one point clear: the United States will not permit [North Korea] to bankroll its weapons programs by preying on American companies and workers,” U.S. Attorney Jason A. Reding Quiñones said in a press release. “We will keep working with our partners across the Justice Department to uncover these schemes, recover stolen funds, and pursue every individual who enables North Korea’s operations.”\nThree of the people — U.S. nationals Audricus Phagnasay, Jason Salazar, and Alexander Paul Travis — each pleaded guilty to one count of wire fraud conspiracy. \nProsecutors accused the three of helping North Koreans posing as legitimate IT workers, whom they knew worked outside of the United States, to use their own identities to obtain employment, helped them remotely access their company-issued laptops set up in their homes, and also helped the North Koreans pass vetting procedures, such as drug tests. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTravis, who prosecutors said was an active servicemember of the U.S. Army at the time of the scheme, earned more than $50,000 for these actions, while Phagnasay and Salazar were paid at least $3,500 and $4,500, respectively. The scheme saw U.S. companies pay around $1.28 million in salaries, most of which was sent to the North Korean IT workers overseas, per the DOJ.\nThe fourth U.S. national who pleaded guilty is Erick Ntekereze Prince, who ran a company called Taggcar, which supplied to U.S. companies allegedly “certified” IT workers but whom he knew worked outside of the country and were using stolen or fake identities. Prince also hosted laptops with remote access software at several residences in Florida, and earned more than $89,000 for his work, the DOJ said. \nAnother participant in the scheme who pleaded guilty to one count of wire fraud conspiracy and another count of aggravated identity theft is Ukrainian national Oleksandr Didenko, who prosecutors accuse of stealing U.S. citizens’ identities and selling them to North Koreans so they could get jobs at more than 40 U.S. companies. \nAccording to the press release, Didenko earned hundreds of thousands of dollars for this service. Didenko agreed to forfeit $1.4 million as part of his guilty plea.\nThe DOJ also announced that it had frozen and seized more than $15 million in cryptocurrency stolen in 2023 by North Korean hackers from several crypto platforms. \nCrypto companies, exchanges, and blockchain projects, have become one of the favorite targets for North Korean hackers, who stole more than $650 million in crypto in 2024, and more than $2 billion so far this year.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five people plead guilty to helping North Koreans infiltrate US companies as ‘remote IT workers’",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/kim-jong-un-north-korea.jpg?w=150"
      ],
      "datePublished": "2025-11-14T17:15:09.000Z",
      "dateModified": "2025-11-14T17:15:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "WhatsApp to launch third-party chat integration in Europe soon",
    "url": "https://techcrunch.com/2025/11/14/whatsapp-to-launch-third-party-chat-integration-in-europe-soon/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T15:32:50.000Z",
    "description": "\n\t\n\t\tImage Credits:Jakub Porzycki/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t7:32 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta is getting ready to launch thi",
    "body": "\n\t\n\t\tImage Credits:Jakub Porzycki/NurPhoto / Getty Images\t\n\t\n\t\t\t\t\t\t7:32 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nMeta is getting ready to launch third-party chat integration on WhatsApp in Europe, the company announced on Friday. The tech giant notes that the EU’s Digital Markets Act (DMA) requires it to give users in Europe the option to chat with people using third-party messaging services that have chosen to make their apps interoperable.\n“Following successful small-scale tests over the past months, the option for WhatsApp users to chat with users of messaging apps BirdyChat and Haiket directly via third-party chats will soon be rolling out across Europe,” Meta wrote in a blog post. “This marks a significant milestone in Meta’s compliance with the EU’s Digital Markets Act (DMA) interoperability requirements.”\nUsers in Europe who have opted in to the third-party integration will be able to share messages, images, voice messages, videos, and files. The option to create groups with third-party users will launch once Meta’s partners are ready to support it, the company says.\nOver the coming months, users in the European Region will begin seeing a notification in the “Settings” tab that will explain the process of opting in to connect with people on third-party apps. Third-party integrations will only work on Android and iOS, not on desktops, web, or tablets.\nImage Credits:Meta\nOf course, connecting with people on other messaging apps is optional, and users can turn third-party chats on or off at any time.\nMeta says its partnerships with BirdyChat and Haiket are the result of a three-year collaboration with the European messaging services and the European Commission to develop a third-party chat solution that complies with DMA requirements. \nAdditionally, the company notes that third-party messaging must use the same level of end-to-end encryption as WhatsApp. Meta also says it has ensured that users will understand the differences between chats on WhatsApp and third-party chats.\nBack in September 2024, Meta shared what third-party chats on WhatsApp will look like, noting that users will be able to set up a designated folder for third-party messages or opt for a combined inbox. The company also said at the time that it would notify users each time a new third-party messaging app became available. \n\n\t\t\t\n\tTopics\n\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "WhatsApp to launch third-party chat integration in Europe soon",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/whatsapp-logo.jpg?w=150"
      ],
      "datePublished": "2025-11-14T15:32:50.000Z",
      "dateModified": "2025-11-14T15:32:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pine Labs gets warm market welcome on $440M India IPO despite a valuation trim",
    "url": "https://techcrunch.com/2025/11/14/pine-labs-gets-warm-market-welcome-on-440m-india-ipo-despite-a-valuation-trim/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/pine-labs-pos.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T15:17:27.000Z",
    "description": "\nPayment technology company Pine Labs, backed by PayPal and Mastercard, won over public investors on Friday, finishing its first day of trading 14% hi",
    "body": "\nPayment technology company Pine Labs, backed by PayPal and Mastercard, won over public investors on Friday, finishing its first day of trading 14% higher even after lowering its valuation for its $440 million IPO. This makes it the second-largest Indian fintech listing this year after online brokerage Groww’s nearly $750 million debut earlier this week.\nThe stock opened at ₹242 and rose as high as ₹284 before settling at ₹252, up from the issue price of ₹221, resulting in a market capitalization of ₹289 billion (approximately $3.3 billion) for the Gurugram-based company. \nIt’s a step down from Pine Labs’ 2022 private valuation of over $5 billion, but still a clear signal that investors are backing India’s growing push to take its fintech model global.\nFounded in 1998, Pine Labs has been steadily expanding beyond India and now operates in 20 markets, including Malaysia, Singapore, Australia, the UAE, the U.S., and some parts of Africa. What started as a point-of-sale terminal provider has since evolved into a broader payments platform that supports bill payments, account-aggregator transactions, and a range of merchant and acquiring services.\nIn India, Pine Labs competes with the likes of Razorpay, Paytm, and Walmart-owned PhonePe. The company became profitable in the June quarter, posting a net profit of ₹47.86 million (about $540,000), compared with a loss of ₹278.89 million a year earlier. Revenue from operations rose 17.9% year-over-year to ₹6.16 billion (around $69 million), while its overseas business contributed roughly 15% of total revenue, rising to ₹943.25 million (about $11 million) from ₹795.97 million a year earlier.\n“We will never stop being a startup,” said Amrish Rau, CEO of Pine Labs, during its public listing ceremony. “Now that we are a listed company, [that word] will not be heard in our halls.”\nExisting investors, including Peak XV Partners, Temasek Holdings, PayPal, and Mastercard, were among those who sold part of their holdings in the public listing.\n“Pine Labs never wanted to compete on price,” said Shailendra Singh, managing director at Peak XV Partners. “It always wanted to compete on a superior proposition. And we know this company would keep compounding because there were such strong moats in the business, and it shaped our worldview of how to think about companies and be patient and let ecosystems mature.”\nPeak XV Partners, which split from Sequoia Capital in 2023, first invested in Pine Labs in 2009 amid the global financial crisis. The VC firm is also seeing back-to-back partial public exits this week, as Pine Labs is its second portfolio company to list after Groww, which debuted on Indian exchanges with a 12% pop and closed its first trading day 29% above its issue price of ₹100.\nPine Labs’ market debut is part of a broader wave, as the public-listing engine in India is revving up. From tech and fintech to e-commerce and manufacturing, more startups are choosing to go public — fueled by strong domestic investor appetite, eased interest-rate conditions, and regulatory nudges to boost listings. Globally, finance has been the top IPO sector this year, with IPOs worth $34.34 billion so far in 2025, more than doubling the $14.05 billion raised over the same period in 2024, according to Dealogic.\nWith its public debut, Pine Labs plans to keep widening its geographic footprint while deepening its presence in India with new products and services aimed at the country’s rapidly expanding, internet-driven consumer base.\n“Our core business will keep expanding. Our moats will be strengthened, and margins will grow,” Rau said.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pine Labs gets warm market welcome on $440M India IPO despite a valuation trim",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/pine-labs-pos.jpg?w=150"
      ],
      "datePublished": "2025-11-14T15:17:27.000Z",
      "dateModified": "2025-11-14T15:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ChatGPT launches pilot group chats across Japan, New Zealand, South Korea, and Taiwan",
    "url": "https://techcrunch.com/2025/11/14/chatgpt-launches-pilot-group-chats-across-japan-new-zealand-south-korea-and-taiwan/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/ChatGPT-Groupchat-pilot-launch.png?w=150",
    "tag": "Tech",
    "date": "2025-11-14T10:58:08.000Z",
    "description": "\nOpenAI on Thursday introduced a group chat feature for ChatGPT. The feature, currently being tested in select regions, including Japan, New Zealand, ",
    "body": "\nOpenAI on Thursday introduced a group chat feature for ChatGPT. The feature, currently being tested in select regions, including Japan, New Zealand, South Korea, and Taiwan, lets users collaborate directly within the app.\nThe group chat is available to Free, Plus, and Team users on both mobile and web platforms. OpenAI says the pilot is designed to explore how people use group conversations in ChatGPT.\nThe announcement comes after earlier reports that OpenAI had been testing a direct-message-style tool. \nThe ChatGPT maker describes this pilot as just a “small first step” toward creating a more “shared experience” in the app. Early users will be invited to provide feedback, which the company says will help shape how the feature eventually expands to more regions and offerings.\nAccording to OpenAI, private chats and personal ChatGPT memory stay completely private. Group chats are invitation-only, and members can leave at any time. Most participants can remove others, though the group’s creator can only leave voluntarily. For users under 18, content is filtered, with extra safeguards and parental controls in place.\nStarting a group chat is easy. Just tap the people icon and add participants, either directly or by sharing a link. Groups can include one to 20 people. If you add someone to an existing chat, a new group is created, leaving the original conversation unchanged. Each group has a short profile, and all chats are organized in a labeled sidebar for easy access.\nGroup chats work just like regular ChatGPT conversations but with multiple people joining in. GPT‑5.1 Auto handles responses and comes loaded with features such as search, image generation, file uploads, and dictation. In group chats, ChatGPT’s usage limits — which restrict how many AI responses users can receive per hour — only count when ChatGPT responds. Messages between human participants don’t count toward these limits.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nChatGPT has learned new social skills for group chats, knowing when to jump in and when to stay quiet. You can tag “ChatGPT” to get it to respond. It can also react with emojis and use profile photos to create personalized images for the conversation.\nThe group chat feature represents the latest step in OpenAI’s gradual transformation from a simple AI assistant into something resembling a social platform. In late September, the company launched Sora 2, a stand-alone social media app with a TikTok-style feed for sharing AI-generated videos, complete with algorithmic recommendations based on user activity and location, parental controls, and direct messaging capabilities.\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ChatGPT launches pilot group chats across Japan, New Zealand, South Korea, and Taiwan",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/ChatGPT-Groupchat-pilot-launch.png?w=150"
      ],
      "datePublished": "2025-11-14T10:58:08.000Z",
      "dateModified": "2025-11-14T10:58:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "German court rules Google must pay €572M for violating antitrust rules in price comparison sector",
    "url": "https://techcrunch.com/2025/11/14/german-court-rules-google-must-pay-e572m-for-violating-antitrust-rules-in-price-comparison-sector/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-14T15:40:13.000Z",
    "description": "\n\t\n\t\tImage Credits:Matthias Balk/picture alliance / Getty Images\t\n\t\n\t\t\t\t\t\t7:40 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nA German court has found tha",
    "body": "\n\t\n\t\tImage Credits:Matthias Balk/picture alliance / Getty Images\t\n\t\n\t\t\t\t\t\t7:40 AM PST · November 14, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nA German court has found that Google has abused its dominant market position in the price comparison sector and ruled that the company must pay a total of €572 million ($665.6 million) in damages to two German price comparison companies, according to a report by Reuters.\nGoogle must pay the price comparison platform Idealo about €465 million (about $540 million) in damages, and €107 million (about $124 million) to Producto, another price comparison tool, the report said.\nIdealo had claimed damages of €3.3 billion from Google, arguing that its lawsuit was a direct response to the European Court of Justice’s ruling in 2024 that found the search giant was self-preferencing its own shopping comparison service, breaking competition rules, and fined it about $2.7 billion. \nIdealo said on Friday that it intends to continue its case against Google and seek the full damages it had sued for.\n“We welcome the court holding Google accountable. But the consequences of self-favoring go far beyond the amount awarded. We will continue to fight – because market abuse must have consequences and must not become a lucrative business model that is worthwhile despite fines and compensation payments,” Idealo’s co-founder and CEO Albrecht von Sonntag said in a statement.\nGoogle said it intends to appeal both rulings. “The changes we made in 2017 are working well, with no intervention from the European Commission. The number of price comparison sites in Europe using the remedy Shopping Unit has multiplied from seven then to 1,550 today,” a Google spokesperson said in an emailed statement.\nThe company added that it offers rival comparison shopping services the same opportunity as Google Shopping to display ads, and said Google Shopping operates as if it were a separate business, participating in auctions the same as everyone else.\nThe ruling follows close on the heels of an EU investigation into how Google’s spam policy affects publishers’ search rankings. The company was recently fined €2.95 billion (just under $3.5 billion) by the EU for allegedly breaching EU antitrust rules by favoring its own advertising services. \nNote: This story was updated to add a comment from Google.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German court rules Google must pay €572M for violating antitrust rules in price comparison sector",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196352264.jpg?w=150"
      ],
      "datePublished": "2025-11-14T15:40:13.000Z",
      "dateModified": "2025-11-14T15:40:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "VCs abandon old rules for a ‘funky time’ of investing in AI startups",
    "url": "https://techcrunch.com/2025/11/13/vcs-abandon-old-rules-for-a-funky-time-of-investing-in-ai-startups/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/54888675035_dae88c3d06_c.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T23:18:49.000Z",
    "description": "\nIf there’s one thing that VCs agree on when backing AI startups, it’s that AI requires a different investment approach than prior technological shift",
    "body": "\nIf there’s one thing that VCs agree on when backing AI startups, it’s that AI requires a different investment approach than prior technological shifts.\n“It’s a funky time,” said Aileen Lee, founder and managing partner of Cowboy Ventures, onstage at TechCrunch Disrupt 2025. The longtime VC noted that the rules of investing have significantly shifted now that some AI companies are leaping from “zero to $100 million in revenue in a single year.”\nHowever, Lee also noted that, based on her firm’s research, Series A investors aren’t just seeking rapid revenue growth. “It’s an algorithm with different variables and different coefficients.”\nSome of the factors investors now measure, according to Lee, include whether the startup is generating data, the strength of its competitive moat, the founders’ past accomplishments, and the technical depth of the product. “Depending on what your company is, the output of the algorithmic formula is going to be different,” she said.\nJon McNeill, co-founder and CEO of startup creation firm DVx Ventures, stated that even startups that grow rapidly from inception to $5 million in revenue often struggle to secure follow-on funding. “I think this game has changed, and it is changing dynamically,” he said.\nMcNeill noted that Series A investors are now applying the same rigorous standards to seed-stage startups that they previously reserved for more mature companies.\n“I think a lot of investors have figured out that the breakout companies, in most cases, don’t have the best tech,” McNeill said about why Series A VCs are looking so closely at startups’ ability to attract and retain customers. “They have the best go-to market.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSteve Jang, founder and managing partner of Kindred Ventures, disagreed that a strong go-to-market (GTM), an industry term for sales and marketing, holds greater weight for investors. “I don’t think it’s 100% true to say mediocre technology, great GTM wins and raises money and gets customers. I think that it’s a necessary requirement to have both.”\nWhile McNeill later clarified that having a solid product is important, he indicated that his initial comment was related to the founders’ need to develop an exceptionally strong sales and marketing strategy right out of the gate. “Investors are getting much more sophisticated on the go-to market than they have in the past,” he said.\n(The debate over marketing versus tech was brought to the forefront later during the conference when Roy Lee, founder of the viral startup Cluely, said onstage that launching a product that barely worked, even with massive social media fame, may not always be the best idea.)\nAileen Lee added that AI startups are now under pressure to deliver product updates and new features at an unprecedented pace, preempting existing companies that might try to introduce similar products.  “If you look at how much OpenAI and Anthropic are shipping, you’re going to have to figure out how to match how much you ship, how quickly and the quality of it,” she said.\nDespite the expectations for breakneck growth and fast product development, panelists agreed that the AI industry is still in its very early stages. As Jang put it, “There are no clear, outright winners, even in LLMs. There are competitors nipping at their heels.”\nThis means startups still have a path to unseating perceived leaders, whether they are decades-old companies or fast-moving newcomers.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "VCs abandon old rules for a ‘funky time’ of investing in AI startups",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/54888675035_dae88c3d06_c.jpg?w=150"
      ],
      "datePublished": "2025-11-13T23:18:49.000Z",
      "dateModified": "2025-11-13T23:18:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Origin sticks first New Glenn rocket landing and launches NASA spacecraft",
    "url": "https://techcrunch.com/2025/11/13/blue-origin-sticks-first-new-glenn-rocket-landing-and-launches-nasa-spacecraft/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/new-glenn-booster.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T21:51:00.000Z",
    "description": "\nJeff Bezos’ Blue Origin has landed the booster of its New Glenn mega-rocket on a drone ship in the Atlantic Ocean on just its second attempt — making",
    "body": "\nJeff Bezos’ Blue Origin has landed the booster of its New Glenn mega-rocket on a drone ship in the Atlantic Ocean on just its second attempt — making it the second company to perform such a feat, following Elon Musk’s SpaceX.\nIt’s an accomplishment that will help the new rocket system become an option to send larger payloads to space, the moon, and beyond.\nThursday’s launch wasn’t just about the landing attempt, though. Roughly 34 minutes after takeoff, the upper stage of New Glenn successfully deployed the rocket’s first commercial payload: twin spacecraft for NASA that will travel to Mars to study the red planet’s atmosphere.\nThe pair of achievements are remarkable for the second-ever launch of such a massive rocket system. And it could put Blue Origin in position to compete with SpaceX, which dominates the world’s launch market with its Falcon 9, Falcon Heavy, and Starship rockets. \nThe accomplishment is noteworthy for the broader space industry, and one that SpaceX CEO Gwynne Shotwell acknowledged via a post on social media site X with a simple “Magnificent!” Musk even offered his own congratulations shortly after. \n\nNew Glenn’s first launch was in January, and Blue Origin experienced a number of delays in getting the second rocket to launch. The company had hoped to make a second attempt as early as the spring, but pushed it back multiple times. New Glenn finally made it to the launch pad on Sunday, but weather and solar storms delayed it further.\nThe rocket finally took off from Launch Complex 36 in Cape Canaveral, Florida on Thursday at around 3:55 p.m. ET. At about four minutes into the flight, the second stage separated and headed further into space, while the New Glenn booster began its journey back toward Earth. Roughly 10 minutes into the flight, the 189-foot-tall booster touched down on the platform.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBlue Origin had attempted to bring the New Glenn booster back on the rocket’s first flight in January. But the booster exploded before it had a chance to land on the drone ship. Blue Origin worked with the Federal Aviation Administration to identify and make a number of fixes to the rocket, and the company was confident it could stick the landing on attempt number two.\nThe ability to land a booster like this is an important step in making the rocket system reusable, which lowers the cost for customers — a capability that SpaceX has mastered. Blue Origin will now have to demonstrate the ability to refurbish the rocket booster and launch it again.\nThese are crucial capabilities for commercial customers and government missions. Blue Origin has had its eyes on the moon for years, and is currently developing a lunar lander. So is SpaceX, with Starship. But the government has asked them to speed up these programs, and acting NASA administrator Sean Duffy recently criticized SpaceX for moving too slowly.\nBlue Origin CEO Dave Limp recently said in response his company “will move heaven and Earth” to help NASA get back to the moon faster. But it can’t do that without successfully proving out all of New Glenn’s capabilities.\nThursday’s launch went a long way toward accomplishing that overarching goal.  \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Origin sticks first New Glenn rocket landing and launches NASA spacecraft",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/new-glenn-booster.jpg?w=150"
      ],
      "datePublished": "2025-11-13T21:51:00.000Z",
      "dateModified": "2025-11-13T21:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Build Mode starts at the beginning: How Forethought AI found product-market fit",
    "url": "https://techcrunch.com/2025/11/13/build-mode-starts-at-the-beginning-how-forethought-ai-found-product-market-fit/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/maxresdefault-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-13T21:47:30.000Z",
    "description": "\nIn the debut episode of the Build Mode podcast, host Isabelle Johannessen sits down with Deon Nicholas, co-founder of Forethought AI, to unpack what ",
    "body": "\nIn the debut episode of the Build Mode podcast, host Isabelle Johannessen sits down with Deon Nicholas, co-founder of Forethought AI, to unpack what it really takes to build a lasting company with and for your customers from day one.\nBuild Mode is TechCrunch’s new podcast that pulls back the curtain on how startups actually get built — the messy, tactical, real-talk version. Season 1: Product, Meet Market, goes beyond product-market fit to explore every aspect of getting your product into customers’ hands, from finding the right audience and earning their trust to turning early traction into lasting momentum.\n\n\n\nFrom the start, Nicholas and his team focused on solving real problems rather than chasing hype or inflated valuations. He is a firm believer that conviction should come from customers, not VCs, and that once Forethought delivered tangible value to real users, the hype and valuations naturally followed.\nHis “7-Failure Rule” urges founders to embrace iteration over perfection and to expect a few misses before finding what truly clicks. \nThe Forethought team stayed lean, obsessed over its ideal customer profile, and focused relentlessly on real pain points instead of shiny features. Nicholas notes that early users aren’t always direct about what isn’t working, so founders have to learn to look between the lines.\nThat mindset powered Forethought’s breakout moment at TechCrunch Disrupt 2018, where the company went on to win Startup Battlefield. Leading up to the competition, Nicholas described the process as a “friendly pressure cooker,” sprinting to secure as many paying customer logos as possible before hitting the stage. The focus paid off, fueling investor FOMO and a $9 million Series A and helping to define the early wave of the AI boom. \nWhile investor momentum built quickly, Nicholas maintains the company’s longevity stemmed from focus, not frenzy. To him, startup success isn’t about hype or rock-star energy — it’s about building something customers love enough to stick around for.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFor founders, the takeaway is simple: Build from day one with your customers, validate every step with feedback, and don’t get distracted by valuations or buzz. Product-market fit isn’t about perfection; it’s about proving consistent value to the people who matter most.\nEpisodes of Build Mode drop every Thursday. Subscribe now on Apple Podcasts, Spotify, or wherever you get your podcasts. And be sure to check out the video version on TechCrunch’s YouTube.\n\n\n\t\tIsabelle leads Startup Battlefield, TechCrunch’s iconic launchpad and competition for the world’s most promising early-stage startups.\r\nYou can contact or verify outreach from Isabelle by emailing isabelle.johannessen@techcrunch.com.\r\n\r\nShe scouts top founders across 99+ countries and prepares them to pitch on the Disrupt stage in front of tier-one investors and global media. Before TechCrunch, she designed and led international startup acceleration programs across Japan, Korea, Italy, and Spain—connecting global founders with VCs and helping them successfully enter the U.S. market. With a Master’s in Entrepreneurship & Disruptive Innovation—and a past life as a professional singer—she brings a blend of strategic rigor and stage presence to help founders craft compelling stories and stand out in crowded markets.\n\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Build Mode starts at the beginning: How Forethought AI found product-market fit",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/maxresdefault-1.jpg?w=150"
      ],
      "datePublished": "2025-11-13T21:47:30.000Z",
      "dateModified": "2025-11-13T21:47:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]