[
  {
    "title": "Are we nearing the end of Apple’s Tim Cook era?",
    "url": "https://techcrunch.com/2025/11/16/are-we-nearing-the-end-of-apples-tim-cook-era/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2198049873.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-16T19:35:55.000Z",
    "description": "Apple is getting serious about succession planning, according to a new report in The Financial Times. The company’s board and senior executives are reportedly preparing for the possibility that Tim Cook could...",
    "body": "\nApple is getting serious about succession planning, according to a new report in The Financial Times.\nThe company’s board and senior executives are reportedly preparing for the possibility that Tim Cook could step down as CEO as soon as early next year. This would come after Apple’s earnings report in late January, giving the new leadership team time to settle into their roles before Apple’s big events like the Worldwide Developers Conference in June.\nThe 65-year-old Cook has been Apple’s chief executive since Steve Jobs resigned in 2011; he’s now served as CEO for longer than Jobs. Under his leadership, Apple has grown from a market capitalization of $350 billion to $4 trillion, although the company has apparently struggled to find the right direction with AI.\nNo final decisions have been made about Cook’s successor or the timing of his departure, the FT says. However, Apple’s senior vice president of hardware engineering John Ternus is reportedly seen as the most likely candidate for the company’s next CEO.\n"
  },
  {
    "title": "Jeff Bezos reportedly returns to the trenches as co-CEO of new AI startup, Project Prometheus",
    "url": "https://techcrunch.com/2025/11/17/jeff-bezos-reportedly-returns-to-the-trenches-as-co-ceo-of-new-ai-startup-project-prometheus/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2208733347.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T14:33:30.000Z",
    "description": "Amazon's founder Jeff Bezos seems to be getting his hands dirty once again: the billionaire is partly backing a new AI startup called Project Prometheus that has raised $6.2 billion in funding, and will take on duties as co-chief executive.",
    "body": "\nIn Brief\nPosted:\n6:33 AM PST · November 17, 2025\n\nImage Credits:Emma McIntyre/WireImage\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAmazon’s founder Jeff Bezos seems to be getting his hands dirty once again: the billionaire is partly backing a new AI startup called Project Prometheus that has raised $6.2 billion in funding, and will take on duties as co-chief executive of the new venture, the New York Times reported, citing several sources familiar with the project.\nBezos will share the position with Vik Bajaj, who previously led and co-founded Google’s life sciences division. Bajaj also co-founded Verily, a biotech startup owned by Alphabet, and is the co-founder of Foresite Labs, an AI-focused affiliate of investment firm Foresite Capital, though the report notes he recently left the firm to start Prometheus, the report said.\nBezos would be returning to operations for the first time since he stepped away from Amazon in 2021.\nAccording to the NYT, the startup is going to build AI products for engineering and manufacturing in various fields like computers, aerospace and automobiles. Project Prometheus is focused on “AI for the physical economy”, per its LinkedIn page, and the report noted that its work will resemble that of Periodic Labs, which is building technology to speed up scientific research by simulating the physical world to train AI models. \nThe company already has almost 100 staff, including researchers from AI firms like Meta, OpenAI and Google DeepMind, the report said.\nAmazon and Bajaj did not immediately respond to a request for comment. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "DoorDash confirms data breach impacting users’ phone numbers and physical addresses",
    "url": "https://techcrunch.com/2025/11/17/doordash-confirms-data-breach-impacting-users-phone-numbers-and-physical-addresses/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-1147932669.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T15:27:38.000Z",
    "description": "In Brief Posted: 7:27 AM PST · November 17, 2025  Image Credits:Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  DoorDash disclosed a data breach that exposed the personal information of an unspecified...",
    "body": "\nIn Brief\nPosted:\n7:27 AM PST · November 17, 2025\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nDoorDash disclosed a data breach that exposed the personal information of an unspecified number of users, which included names, email addresses, phone numbers, and physical addresses.\nDespite the fact that hackers stole phone numbers and physical addresses, DoorDash said that “no sensitive information was accessed by the unauthorized third party and we have no indication the data has been misused for fraud or identity theft at this time.”\nDoorDash said in the post that the breach impacted a mix of customers, delivery workers, and merchants. The company did not respond to a request for comment, which included a question on exactly how many users were victims of the breach. \nThe breach originated from an employee falling for a social engineering attack. When the company identified the breach, it shut down the hackers’ access to its systems, started an investigation, and reported the incident to law enforcement, according to a post published last week by the company.\nDoorDash said no “Social Security numbers, other government-issued identification numbers, driver’s license information, or bank or payment card information” were stolen as part of the breach. \nThe company said it has notified impacted users.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Security\n"
  },
  {
    "title": "Beloved SF cat’s death fuels Waymo criticism",
    "url": "https://techcrunch.com/2025/11/16/beloved-sf-cats-death-fuels-waymo-criticism/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/waymo-nyc.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-16T22:09:22.000Z",
    "description": "In Brief Posted: 2:09 PM PST · November 16, 2025  Image Credits:Waymo  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  The death of a neighborhood bodega cat named Kit Kat has shaken San Francisco’s Mission...",
    "body": "\nIn Brief\nPosted:\n2:09 PM PST · November 16, 2025\n\nImage Credits:Waymo\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe death of a neighborhood bodega cat named Kit Kat has shaken San Francisco’s Mission District, according to The New York Times.\nAfter Kit Kat was run over by a Waymo robotaxi on the evening of October 27, locals created a shrine to memorialize him. The area has also been decorated with competing signs, some criticizing Waymo, others noting the many deaths caused by human drivers.\nJackie Fielder, who represents the Mission District on SF’s Board of Supervisors, brought up Kit Kat while making the case for a proposed city resolution that calls on the state to allow local voters to decide whether driverless cars can operate in their neighborhoods.\n“A human driver can be held accountable, can hop out, say sorry, can be tracked down by police if it’s a hit-and-run,” Fielder told the Times. “Here, there is no one to hold accountable.”\nWaymo, whose co-CEO recently spoke at Disrupt about the importance of safety, described the incident as one where a cat “darted under our vehicle as it was pulling away.” The company said it sends “our deepest sympathies to the cat’s owner and the community who knew and loved him.”\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "JPMorgan doesn’t want to pay Frank founder Charlie Javice’s legal bills",
    "url": "https://techcrunch.com/2025/11/15/jpmorgan-doesnt-want-to-pay-frank-founder-charlie-javices-legal-bills/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-1529787597.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-15T22:01:49.000Z",
    "description": "In Brief Posted: 2:01 PM PST · November 15, 2025  Image Credits:Yuki Iwamura/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  JPMorgan Chase says it’s been billed a total of $142 million in...",
    "body": "\nIn Brief\nPosted:\n2:01 PM PST · November 15, 2025\n\nImage Credits:Yuki Iwamura/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nJPMorgan Chase says it’s been billed a total of $142 million in legal fees for the defense of Charlie Javice and Olivier Amar, respectively the founder and chief marketing officer at financial aid startup Frank.\nJPMorgan acquired Frank for $175 million in 2021, but earlier this year, Javice and Amar were found guilty of defrauding the bank by inflating Frank’s customer count, with Javice sentenced to seven years in prison. JPMorgan is now seeking to overturn a judge’s order requiring the bank to pay the pair’s legal fees, as reported in The Wall Street Journal.\nMichael Pittinger, a lawyer representing JPMorgan, said that Javice’s legal team billed for expenses including luxury hotel upgrades, 24 hours of work in a single day, and cellulite butter (a moisturizer).\n“There’s never been a case, to my knowledge, with such extreme abuses,” Pittinger said.\nA spokesman for Javice told the WSJ that she abided by JPMorgan policies and “didn’t charge or see any expenses.”\n“As an employee, she did purchase ice cream and other items in accordance with JPMorgan’s code of conduct, and she never sought reimbursement for anything that wasn’t expressly permitted under the guidelines she was given,” Javice’s spokesman said.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Startups\n"
  },
  {
    "title": "Sakana AI raises $135M Series B at a $2.65B valuation to continue building AI models for Japan",
    "url": "https://techcrunch.com/2025/11/17/sakana-ai-raises-135m-series-b-at-a-2-65b-valuation-to-continue-building-ai-models-for-japan/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Sakana-AI-.png?w=150",
    "tag": "Tech",
    "date": "2025-11-17T11:52:07.000Z",
    "description": "As U.S. giants like Google, OpenAI and Anthropic race to develop the large language models that underpin their AI products, startups such as Sakana AI, Mistral AI, DeepSeek and AI21 Labs are carving out their...",
    "body": "\nAs U.S. giants like Google, OpenAI and Anthropic race to develop the large language models that underpin their AI products, startups such as Sakana AI, Mistral AI, DeepSeek and AI21 Labs are carving out their own niche with specialized models designed for specific regions, industries, or unique features.\nIn pursuit of that goal, Tokyo-based Sakana AI has closed a ¥20 billion (approximately $135 million) Series B funding round, which values the company at $2.65 billion post-money, up from a pre-money valuation of $2.5 billion, CEO David Ha told TechCrunch.\nFounded in 2023 by former Google researchers Llion Jones, Ren Ito and Ha, Sakana AI makes affordable generative AI models that work well with small datasets and are optimized for the Japanese language and culture.\nThe Series B round drew a mix of new and returning investors, combining Japan’s financial heavyweights like Mitsubishi UFJ Financial Group (MUFG) with global venture players such as Khosla Ventures, Macquarie Capital, NEA, Lux Capital and In-Q-Tel (IQT).\n“We plan to deploy the new capital for not only R&D, including [AI] model development, but also to expand our workforce for engineering, sales, and distribution teams in Japan,” Ha said. This year, Sakana has expanded its presence in Japan, teaming up with leading local enterprises, including Daiwa and MUFG, and developing AI solutions.\nHa, who previously led research at Stability AI and worked at Google and Goldman Sachs, also said Sakana plans to expand its enterprise business beyond finance into the industrial, manufacturing, and government sectors in 2026.\nLooking ahead, the company is eyeing the defense, intelligence and manufacturing sectors. The two-year-old startup also said it will be “actively pursuing strategic investment, partnerships and M&A for long-term global growth.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSakana says it sees strong global demand for sovereign AI solutions that reflect “national cultures and values.” The Japanese startup added that focusing its R&D efforts on AI products after LLMs are trained helps it efficiently build advanced models tailored to Japan, taking a path distinct from the large-scale AI model race.\nThis funding round comes roughly a year after the company’s Series A round, in which it raised about ¥30 billion ($214 million) at a $1.5 billion valuation. Sakana had raised roughly $244 million in total as of March 2025, according to PitchBook, so this round would take that total to about $379 million.\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Luminal raises $5.3 million to build a better GPU code framework",
    "url": "https://techcrunch.com/2025/11/17/luminal-raises-5-3-million-to-build-a-better-gpu-code-framework/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Studio-Session-71723.jpeg?w=100",
    "tag": "Tech",
    "date": "2025-11-17T14:03:33.000Z",
    "description": "Inference optimization startup Luminal has announced $5.3 million in a seed funding round led by Felicis Ventures, with angel investment from Paul Graham, Guillermo Rauch and Ben Porterfield. ",
    "body": "\nThree years ago, Luminal co-founder Joe Fioti was working on chip design at Intel when he came to a realization. While he was working on making the best chips he could, the more important bottleneck was in software.\n“You can make the best hardware on earth, but if it’s hard for developers to use, they’re just not going to use it,” he told me.\nNow, he’s started a company that focuses entirely on that problem. On Monday, Luminal announced $5.3 million in seed funding, in a round led by Felicis Ventures with angel investment from Paul Graham, Guillermo Rauch, and Ben Porterfield. \nFioti’s co-founders, Jake Stevens and Matthew Gunton, come from Apple and Amazon, respectively, and the company was part of Y Combinator’s Summer 2025 batch.\nLuminal’s core business is simple: the company sells compute, just like neo-cloud companies like Coreweave or Lambda Labs. But where those companies focus on GPUs, Luminal has focused on optimization techniques that let the company squeeze more compute out of the infrastructure it has. In particular, the company focuses on optimizing the compiler that sits between written code and the GPU hardware — the same developer systems that caused Fioti so many headaches in his previous job.\nAt the moment, the industry’s leading compiler is Nvidia’s CUDA system — an underrated element in the company’s runaway success. But many elements of CUDA are open-source, and Luminal is betting that, with many in the industry still scrambling for GPUs, there will be a lot of value to be gained in building out the rest of the stack.\nIt’s part of a growing cohort of inference-optimization startups, which have grown more valuable as companies look for faster and cheaper ways to run their models. Inference providers like Baseten and Together AI have long specialized in optimization, and smaller companies like Tensormesh and Clarifai are now popping up to focus on more specific technical tricks.\nLuminal and other members of the cohort will face stiff competition from optimization teams at major labs, which have the benefit of optimizing for a single family of models. Working for clients, Luminal has to adapt to whatever model comes their way. But even with the risk of being out-gunned by the hyperscalers, Fioti says the market is growing fast enough that he’s not worried.\n“It is always going to be possible to spend six months hand tuning a model architecture on a given hardware, and you’re probably going to beat any sorts of, any sort of compiler performance,” Fioti says. “But our big bet is that anything short of that, the all-purpose use case is still very economically valuable.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.com or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Surveillance tech provider Protei was hacked, its data stolen and its website defaced",
    "url": "https://techcrunch.com/2025/11/17/surveillance-tech-provider-protei-was-hacked-its-data-stolen-and-its-website-defaced/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/flashing-router-datacenter-wiretap.gif?w=150",
    "tag": "Tech",
    "date": "2025-11-17T13:09:47.000Z",
    "description": "The defacement of Protei's website said \"another DPI/SORM provider bites the dust,\" apparently referring to the company selling its web intercept and surveillance products to phone and internet providers.",
    "body": "\nA Russian telecom company that develops technology to allow phone and internet companies to conduct web surveillance and censorship was hacked, had its website defaced, and had data stolen from its servers, TechCrunch has learned.\nFounded in Russia, Protei makes telecommunications systems for phone and internet providers across dozens of countries, including Bahrain, Italy, Kazakhstan, Mexico, Pakistan and much of central Africa. The company, now headquartered in Jordan, sells video conferencing technology and internet connectivity solutions, as well as surveillance equipment and web-filtering products, such as deep packet inspection systems.\nIt’s not clear exactly when or how Protei was hacked, but a copy of the company’s website saved on the Internet Archive’s Wayback Machine shows it was defaced on November 8. The website was restored soon after.\nDuring the breach, the hacker obtained the contents of Protei’s web server — around 182 gigabytes of files — including emails dating back years.\nA copy of Protei’s data was provided to DDoSecrets, a non-profit transparency collective that indexes leaked datasets in the public interest, including data from law enforcement, government agencies, and companies involved in the surveillance industry.\nImage Credits:TechCrunch (screenshot)\nMohammad Jalal, the managing director of Protei’s branch in Jordan, did not respond to a request for comment about the breach. \nThe identity of the hacker is not known, nor their motivations, but the defaced website read: “another DPI/SORM provider bites the dust.” The message likely references the company’s sales of deep packet inspection systems and other internet filtering technology for the Russian-developed lawful intercept system known as SORM.\nSORM is the main lawful intercept system used across Russia as well as several other countries which use Russian technology. Phone and internet providers install SORM equipment on their networks, which allows their country’s governments to obtain the contents of calls, text messages and web browsing data of the networks’ customers. \nDeep-packet inspection devices allow telecom companies to identify and filter web traffic depending on its source, such as a social media website or a specific messaging app, and selectively block access. These systems are used for surveillance and censorship in regions where freedom of speech and expression are limited.\nCitizen Lab reported in 2023 that Iranian telecoms giant Ariantel had consulted with Protei about technology for logging internet traffic and blocking access to certain websites. Documents seen and published by Citizen Lab show that Protei touted its technology’s ability to restrict or block access to websites for specific people or entire swathes of the population.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "PowerLattice attracts investment from ex-Intel CEO Pat Gelsinger for its power saving chiplet",
    "url": "https://techcrunch.com/2025/11/17/powerlattice-attracts-investment-from-ex-intel-ceo-pat-gelsinger-for-its-power-saving-chiplet/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Chiplet-on-finger-for-scale.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T15:08:23.000Z",
    "description": "PowerLattice, a startup founded by veteran electrical engineers from Qualcomm, NUVIA, and Intel in 2023, claims to have developed a groundbreaking approach that reduces the power needs of computer chips by more than 50%.",
    "body": "\nIf you pay attention to what the biggest tech companies are saying about AI demand, you’ll notice a common thread: they’re running short of compute capacity. That means the large language models underpinning AI products today need even more data centers to be trained and for inferencing, and therefore, they need more power. Against that backdrop, energy efficiency has suddenly become a critical priority for semiconductor manufacturers. \nPowerLattice, a startup founded by veteran electrical engineers from Qualcomm, NUVIA, and Intel in 2023, claims to have developed a groundbreaking approach that reduces the power needs of computer chips by more than 50%. On Monday, the startup emerged from stealth with a $25 million Series A funding round led by Playground Global and Celesta Capital, bringing its total funding to $31 million.\n“This is the hard stuff: How do you get power into the device? There are very few teams and people that can do it,” said Pat Gelsinger, general partner at Playground Global. “We have assembled what I’d argue is the dream team of power delivery.”\nAs the former CEO of Intel, Gelsinger carries significant authority in the semiconductor world, which makes his participation a powerful stamp of approval for PowerLattice.\nIn fact, when the startup’s CEO Dr. Peng Zou and its founding team pitched their idea at Playground’s offices in March, they were so star-struck by Gelsinger’s fame that they asked him for a selfie, Gelsinger told TechCrunch. The admiration proved mutual, as Gelsinger came away genuinely impressed with PowerLattice’s technology.\nThe startup’s tech sounds simple in concept: a tiny power delivery chiplet that’s designed to bring power closer to the processor, significantly minimizing energy loss.\nTwo years in, PowerLattice has already achieved its first key milestone: its first batch of chiplets is being produced by TSMC, in partnership with an unnamed manufacturer that is testing the startup’s functionality,  Gelsinger said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBeyond its initial customer, the startup plans to make its product available for testing by other customers in the first half of 2026. The trials should prove instructive, given that PowerLattice’s potential customer set includes major chip manufacturers Nvidia, Broadcom and AMD, as well as specialized AI chip developers, such as Cerberus, Grok, and Playground-backed startups d-Matrix and NextSilicon.\nAlthough every chip company has internal teams working on improving energy efficiency, Gelsinger hopes that PowerLattice’s innovative approach will pique their interest.\n“They may say, ‘I’m going to take some volume to this approach, some volume to my more traditional approach’,” he said. “But we think our ability to capture meaningful share will quickly emerge.”\nPowerLattice is not the only startup attempting to help chip manufacturers address the energy problem. The company would compete most closely with Empower Semiconductor, a startup that raised a $140 million Series D, led by Fidelity Management & Research Company, in September.\nHowever, Gelsinger is certain that PowerLattice’s 50% energy efficiency gain is an “extraordinary” result, and he expects the company to soon raise a much larger funding round to fund production.\n“The idea is bold, the benefits are large, and I expect others will be saying, ‘That’s a great idea. Let me try as well,’” Gelsinger said.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Amazon satellite network gets a rebrand — and drops its affordability pitch",
    "url": "https://techcrunch.com/2025/11/16/amazon-satellite-network-gets-a-rebrand-and-drops-its-affordability-pitch/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/amazon-leo.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-16T18:46:03.000Z",
    "description": "Amazon’s budding satellite internet program is no longer called Project Kuiper. It is now known simply as “Leo.” The name change comes as the company appears to be shifting its focus from “unserved or...",
    "body": "\nAmazon’s budding satellite internet program is no longer called Project Kuiper. It is now known simply as “Leo.” The name change comes as the company appears to be shifting its focus from “unserved or underserved” communities to securing larger commercial contracts.\nThe satellite network has been in the works since 2019 and, as Amazon tells it, the name Project Kuiper was only ever supposed to be temporary. Leo is a nod to the network’s location in what’s known as low-Earth orbit, commonly referred to in the space industry as “LEO.”\nAs Amazon worked toward launching the first Kuiper satellites earlier this year, the company boasted that the project was an “initiative to increase global broadband access” with a noble-sounding “mission to bring fast, affordable broadband” to communities that aren’t well-served by traditional internet providers.\nBut, as TechCrunch previously noted, the company has changed the language it uses to describe the service in recent months as it inked deals with Airbus and JetBlue, putting the network more squarely in competition with SpaceX’s Starlink service.\nAmazon didn’t respond to requests for comment.\nAn archived version of the main FAQ page for Kuiper — published in late 2024 — puts the aforementioned “mission” to serve those communities right at the top of the post. Affordability is mentioned three times throughout, with Amazon calling it a “key principle of Project Kuiper.” \n“Amazon has a longstanding commitment to low prices, and lots of experience building popular, low-cost devices like Echo Dot and Fire TV Stick,” reads the answer to a question on the archived post about how much Kuiper service will cost. “We’re applying a similar approach with Project Kuiper.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThat question-and-answer about cost is now gone from the Leo FAQ, and there is no mention of “affordability” anywhere on the page.\nThe language at the top of the new FAQ is also different. It states that Leo is “Amazon’s low Earth orbit satellite network, designed to provide fast, reliable internet to customers and communities beyond the reach of existing networks.” \nWhile the Leo FAQ mentions that poor connectivity can “create an economic disadvantage for people, businesses, and other organizations operating in unserved and underserved parts of the world,” the company is less specific than it used to be about putting those communities front and center in the customer pipeline.\nAmazon Leo’s new website is even more blatant about how it is prioritizing home and commercial internet service. It promotes the ability to make “seamless video calls, stream 4K videos,” and “handle your whole family’s internet needs,” as well as the fact that Leo is “[f]lexible, scalable, enterprise-ready.”\nThe idea of using Leo “even in rural and remote locations” is brought up as almost an afterthought on the main website, and there is no mention of cost or affordability.\nDespite all this, on Thursday, Amazon posted a flashy video about the name change on X. Among other things, it shows a kid using her computer to do homework, professional drift racing, ambulance workers on a remote road, a farmer using a tablet, and a couple dancing in a laundromat. Along with the video, it wrote: “New name, same mission.” \n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Leaked documents shed light into how much OpenAI pays Microsoft",
    "url": "https://techcrunch.com/2025/11/14/leaked-documents-shed-light-into-how-much-openai-pays-microsoft/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2214107176.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-15T00:47:41.000Z",
    "description": "After a year of frenzied dealmaking and rumors of an upcoming IPO, the financial scrutiny into OpenAI is intensifying. Leaked documents obtained by tech blogger Ed Zitron provide more of a glimpse into...",
    "body": "\nAfter a year of frenzied dealmaking and rumors of an upcoming IPO, the financial scrutiny into OpenAI is intensifying. Leaked documents obtained by tech blogger Ed Zitron provide more of a glimpse into OpenAI’s financials — specifically its revenue and compute costs over the past couple of years.  \nZitron reported this week that in 2024, Microsoft received $493.8 million in revenue share payments from OpenAI. In the first three quarters of 2025, that number jumped to $865.8 million, according to documents he viewed.\nOpenAI reportedly shares 20% of its revenue with Microsoft as part of a previous deal where the software giant invested over $13 billion in the powerful AI startup. (Neither the startup nor the people in Redmond have publicly confirmed this percentage.)\nHowever, this is where things get a little sticky, because Microsoft also shares revenue with OpenAI, kicking back about 20% of the revenues from Bing and Azure OpenAI Service, a source familiar with the matter told TechCrunch. Bing is powered by OpenAI, and the OpenAI Service sells cloud access to OpenAI’s models to developers and businesses.  \nThe source also told TechCrunch that the leaked payments refer to Microsoft’s net revenue share, not the gross revenue share. In other words, they don’t include whatever Microsoft paid to OpenAI from Bing and Azure OpenAI royalties. Microsoft deducts those figures from its internally reported revenue share numbers, according to this person.\nMicrosoft doesn’t break out how much it makes from Bing and Azure OpenAI in its financial statements, so it’s difficult to estimate how much the tech giant is kicking back.\nNevertheless, the leaked documents provide a window into the hottest company on the private markets today — and not just how much it makes in revenue, but also how much it’s spending in comparison to that revenue.  \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nSo, based on that widely reported 20% revenue-share statistic, we can infer that OpenAI’s revenue was at least $2.5 billion in 2024 and $4.33 billion in the first three quarters of 2025 — but very likely to be more. Previous reports from The Information put OpenAI’s 2024 revenue at around $4 billion, and its revenue from the first half of 2025 at $4.3 billion.  \nAltman also recently said OpenAI’s revenue is “well more” than reports of $13 billion a year, will end the year above $20 billion in annualized revenue run rate (which is a projection, not guidance on actual revenue), and that the company could even hit $100 billion by 2027. \nPer Zitron’s analysis, OpenAI may have spent roughly $3.8 billion on inference in 2024. That spend increased to roughly $8.65 billion in the first nine months of 2025. Inference is the compute used to run a trained AI model to generate responses.  \nOpenAI has historically almost exclusively relied on Microsoft Azure to provide compute access, though it has also struck deals with CoreWeave and Oracle, and more recently with AWS and Google Cloud. \nPrevious reports put OpenAI’s entire compute spend at roughly $5.6 billion for 2024 and its “cost of revenue” at $2.5 billion for the first half of 2025.  \nA source familiar with the matter told TechCrunch that while OpenAI’s training spend is mostly non-cash — meaning, paid by credits Microsoft awarded OpenAI as part of its investment — the firm’s inference spend is largely cash. (Training refers to the compute resources needed to initially train a model.)\nWhile not a complete picture, these numbers imply that OpenAI could be spending more on inference costs than it is earning in revenue. \nAnd those implications promise to add to the incessant AI bubble chatter that has seeped into every conversation from New York City to Silicon Valley. If model giant OpenAI really still is in the red running its models, what might this mean for the massive investments at jaw-dropping valuations for the rest of the AI world?\nOpenAI declined to comment. Microsoft did not respond to TechCrunch’s request for comment.\nGot a sensitive tip or confidential documents? We’re reporting on the inner workings of the AI industry — from the companies shaping its future to the people impacted by their decisions. Reach out to Rebecca Bellan at rebecca.bellan@techcrunch.com or Russell Brandom at russell.brandom@techcrunch.com. For secure communication, you can contact them via Signal at @rebeccabellan.491 and russellbrandom.49.\n\n\n\t\tRebecca Bellan is a senior reporter at TechCrunch where she covers the business, policy, and emerging trends shaping artificial intelligence. Her work has also appeared in Forbes, Bloomberg, The Atlantic, The Daily Beast, and other publications. \r\nYou can contact or verify outreach from Rebecca by emailing rebecca.bellan@techcrunch.com or via encrypted message at rebeccabellan.491 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Disney and YouTube TV reach deal to end blackout",
    "url": "https://techcrunch.com/2025/11/15/disney-and-youtube-tv-reach-deal-to-end-blackout/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-1184040131.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-15T17:38:28.000Z",
    "description": "After a two-week blackout, YouTube TV and Disney announced Friday that they have reached a deal. In addition to bringing Disney networks like ABC, ESPN, and FX back to YouTube’s streaming TV service, the deal...",
    "body": "\nAfter a two-week blackout, YouTube TV and Disney announced Friday that they have reached a deal.\nIn addition to bringing Disney networks like ABC, ESPN, and FX back to YouTube’s streaming TV service, the deal will also see ESPN make its new direct-to-consumer service available on YouTube TV at no additional cost. YouTube will also be able to sell select Disney networks and the Disney+/Hulu bundle as part of different packages.\nIn a statement, Disney Entertainment Co-Chairmen Alan Bergman and Dana Walden, along with ESPN Chairman Jimmy Pitaro, described the deal as one that “recognizes the tremendous value of Disney’s programming and provides YouTube TV subscribers with more flexibility and choice.”\n“We are pleased that our networks have been restored in time for fans to enjoy the many great programming options this weekend, including college football,” the Disney executives added.\nYouTube also released a statement Friday saying that subscribers would see the affected channels restored “throughout the course of the day.” The company said, “We apologize for the disruption and appreciate our subscribers’ patience as we negotiated on their behalf.”\nYouTube TV is meant to be a cable TV alternative for cord cutters, but like most cable TV providers, the service has had its share of disputes with major content providers — usually over how much money to pay them and how much flexibility it has to offer their content in different bundles.\nThe last time YouTube and Disney renegotiated in 2022, there was a similar (if significantly briefer) blackout. This time around, YouTube offered customers a $20 credit that they can apply to their next bill.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nOne survey even suggested that due to the Disney blackout, 24% of the service’s more than 10 million subscribers said they had already canceled their subscription or planned to do so soon. (A YouTube spokesperson said actual churn was “manageable and does not align with the findings of this survey.”)\nIndeed, TechCrunch’s Amanda Silberling said the blackout was ruining her life because she couldn’t watch “Jeopardy!” Thankfully, her two-week nightmare is over.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "MCP AI agent security startup Runlayer launches with 8 unicorns, $11M from Khosla’s Keith Rabois and Felicis",
    "url": "https://techcrunch.com/2025/11/17/mcp-ai-agent-security-startup-runlayer-launches-with-8-unicorns-11m-from-khoslas-keith-rabois-and-felicis/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Runlayer-Team.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T14:00:00.000Z",
    "description": "On Monday, a new Model Context Protocol security startup called Runlayer launched out of stealth with $11 million in seed funding from Khosla Ventures’ Keith Rabois and Felicis.  It was created by third-time...",
    "body": "\nOn Monday, a new Model Context Protocol security startup called Runlayer launched out of stealth with $11 million in seed funding from Khosla Ventures’ Keith Rabois and Felicis. \nIt was created by third-time founder Andrew Berman (previous companies: baby-monitor maker Nanit and an AI video conferencing tool, Vowel, that sold to Zapier in 2024).\nIn the four months since Runlayer launched its product in stealth, it has signed dozens of customers, including eight unicorns or public companies like Gusto, dbt Labs, Instacart, and Opendoor, it says. It also nabbed David Soria Parra, the lead creator of MCP, as an angel and advisor, Berman tells TechCrunch. (Parra did not respond to our request for comment.) \nParra’s team at Anthropic launched the protocol in November 2024 as an open source project. MCP has since become the de facto standard for allowing AI agents to connect with the data and systems they need to work independently. It allows agents to access data, move it, alter it, and execute business processes without human oversight. \nThe protocol is now supported by every major model maker including OpenAI, Microsoft, AWS, Google as well as thousands of tech and enterprise companies; just to name a few: Atlassian, Asana, Stripe, Block, others ranging from banks to consumer goods manufacturers. \n“Everyone talks about AI,” Berman, Runlayer’s CEO, told TechCrunch. “but AI is really only as useful as the tools and the resources it has access to.”\nThe problem is, the MCP protocol itself doesn’t include much security out of the box, so many MCP implementations have already been found to be vulnerable in a variety of ways.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe poster children are probably GitHub and Asana. In May, researchers at Invariant Labs discovered a prompt injection vulnerability in MCP servers that allowed them to grab data from private GitHub repositories (ones that shouldn’t have been accessible to the public). Asana discovered and fixed a vulnerability in its MCP server in June that could have exposed customer data. There’ have since been many more types of attacks found to work on common MCP server setups.  \nAs you might expect, such security issues have given rise to numerous MCP security products, including products from big-name companies like CloudFlare, Docker and Wiz — as well as a host of startups tackling more specific products. \nThe most common type of MCP security product these days is a gateway, essentially a security layer for identifying the agents and controlling their access to apps. \nRunlayer plans to stand out in this crowded market by being an all-in-one security tool that combines a gateway with features like threat detection that analyzes every MCP request; observability that watched all agentic activity across all MCP servers that IT has permitted; enterprise development where IT can build custom AI automations for enterprise users; and detailed permissions that work with existing identify providers like Okta and Entra. \nLike other competitors, such as open source Obot, Runlayer business users are presented with an Okta-like catalog of the pre-vetted MCP servers that their IT will allow agents to access. Runlayer matches the agents’ app permissions to the human users’ permissions. For instance, some people might have read-only access to financial systems, some write access (the ability to change the data). Others have no access at all.  \nBerman believes Runlayer stands out from the crowd, not just with the breadth of the product, but because of the team’s experience. He founded the startup because, after selling Vowel to Zapier, he became the director of Zapier’s AI, and built one of the first MCP servers, working closely at the time with OpenAI and Anthropic, he said.  \n“What are the problems that we saw with the protocol? One, it was the security risk because it was adopted so quickly,” he said. There were “blind spots” in areas like observability and audits, that make it risky for enterprises to roll out to users.\nSo in August, “we left our jobs. We signed up David Soria Parra, the creator of the spec, and in four months, we’ve signed up eight unicorns,” he said of himself and his co-founders from Zapier Tal Peretz and Vitor Balocco.\nOther advisors and investors in the company, Berman says, include head of security at Cursor Travis McPeak, and founder of Neon Nikita Shamgunov. \n"
  },
  {
    "title": "Danish startup FlatPay joins the club of European fintech unicorns to track",
    "url": "https://techcrunch.com/2025/11/16/fast-growing-danish-startup-flatpay-joins-the-club-of-european-fintech-unicorns-to-track/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Sander-Janca-Jensen-CEO-co-Founder-of-Flatpay.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-17T07:45:12.000Z",
    "description": "Flatpay, which facilitates card payments for SMBs, has joined the ranks of European fintech unicorns — or startups valued at more than $1 billion — a milestone that has driven some of the region’s biggest...",
    "body": "\nFlatpay, which facilitates card payments for SMBs, has joined the ranks of European fintech unicorns — or startups valued at more than $1 billion — a milestone that has driven some of the region’s biggest exits. These include competitors like Adyen, a Dutch payment processing giant that remains far ahead in scale. However, Flatpay’s fresh funding could help it narrow the gap.\nFlatpay’s bet is that it can challenge larger players by charging small merchants a flat transaction rate to use its card terminals and point-of-sales systems. This focus on a segment that accounts for 99% of European businesses has driven rapid traction: the startup now claims around 60,000 customers, up from 7,000 in April 2024.\nFlatpay’s own valuation has grown at a similarly fast pace. Now valued at €1.5 billion ($1.75 billion), the Danish startup reached unicorn status in only three years. But while CEO and co-founder Sander Janca-Jensen is proud of this accomplishment, he has his eyes on another metric: annual recurring revenue (ARR).\n“We crossed €100 million of ARR in October,” Janca-Jensen told TechCrunch. He added that this amount (approximately $116 million) is increasing by nearly €1 million a day ($1.16 million). “The plan for 2026 is to grow another 300%, so hopefully leave the year with between €400 and €500 million of ARR.” \nTo fund this ambitious growth — since the startup is still unprofitable — Flatpay raised €145 million in its latest round (approximately $169 million). The round was backed by AVP and Smash Capital, as well as Dawn Capital, which had led the startup’s €$47 million Series B. German soccer player Mario Götze also participated in that previous round.\nThe newly raised capital will support continued growth in Flatpay’s current markets — Denmark, Finland, France, Germany, Italy, and the U.K. — as well as further expansion into one or two new markets next year. Janca-Jensen declined to reveal which ones, but job postings suggest that the Netherlands may be next.\nFlatpay currently has 1,500 staffers — or “flatpayers” — and plans to double by the end of next year. Increasing headcount is a goal the company puts on the same level as revenue, stating in a press release that it aims to grow both by 10x by 2029. This may seem unusual, but they go hand-in-hand for the company, which onboards its customers in person.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis stems from its hypothesis that SMB owners actively look for new solutions, even if their current systems are overpriced or insufficient. “That’s where we come in the door,” Janca-Jensen said. He means this literally — Flatpay shows up with pen and paper to explain its pricing, and with card terminals for instant demos. “Every sales person has that suitcase.”\nFlatpay’s demo kit.Image Credits:Flatpay\nThis hands-on approach is what might help Flatpay increase its share of a market that is also coveted by legacy providers, large fintech players like PayPal, Stripe and SumUp, as well as new entrants focusing on specific sectors, such as hospitality. But the real differentiator might be the insight behind it: SMBs want simplicity, and Flatpay leaves them “ready to go.”\nWhile this makes for higher customer acquisition costs than average, especially when combined with 24/7 customer support, Janca-Jensen said that creating demand allows the startup to grow much faster than it would otherwise. In turn, this triple-digit growth makes Flatpay’s emphasis on human interaction much more palatable to investors, even during today’s AI-obsessed investing cycle.\nThe company isn’t ignoring AI entirely — it uses the technology for real-time features and is experimenting with voice AI agents. Flatpay is also planning to expand further into fintech with a banking suite that would include cards and accounts. For Janca-Jensen, the key is gradual adoption — so that instead of getting overwhelmed, SMB owners can “eat the elephant one bite at a time.”\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Bone AI raises $12M to challenge Asia’s defense giants with AI-powered robotics",
    "url": "https://techcrunch.com/2025/11/17/bone-ai-raises-funding-to-challenge-asias-defense-giants-with-next-gen-ai-powered-robotics/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/DK_InLex-5.png?w=150",
    "tag": "Tech",
    "date": "2025-11-17T13:00:00.000Z",
    "description": "South Korea’s major defense giants have amassed roughly $69 billion in order backlogs as of late 2024, according to media reports. Seoul is also accelerating investment in advanced weapons systems and...",
    "body": "\nSouth Korea’s major defense giants have amassed roughly $69 billion in order backlogs as of late 2024, according to media reports. Seoul is also accelerating investment in advanced weapons systems and expanding its defense ties, particularly with Europe. With the new EU–South Korea Security and Defence Partnership in 2024 and growing exports of vehicles and artillery, the country has become the second-largest arms supplier to European NATO members.\nYet despite that enormous industrial footprint, remarkably few startups have emerged to match or challenge the incumbents. The country’s defense-tech startup scene is still nascent, exposing a wide gap between Korea’s manufacturing strength and its early-stage innovation.\nBone AI, a new startup based in Seoul and Palo Alto, California, launched earlier this year with an ambitious plan to build a fully unified AI platform that ties together software, hardware, and manufacturing. \nThe company develops next-generation autonomous air (UAVs), ground (UGVs) and marine (USVs) vehicles for defense and government clients, focusing largely on B2G contracts. While it ultimately aims to operate all three types of systems, Bone is starting with its defense-focused aerial drones, which are designed to streamline missions such as logistics support, wildfire detection and anti-drone defense.\nThe company, founded by DK Lee (who also co-founded MarqVision), has raised a $12 seed round led by Third Prime with participation from Kolon Group, a South Korean strategic investor that has expertise in developing advanced materials and manufacturing. Kolon is an ideal strategic partner for Bone, which operates across AI, robotics and next-generation manufacturing, Lee said in an exclusive interview with TechCrunch.\nThe startup is already generating revenue, landing a seven-figure B2G contract and pulling in $3 million in its first year of operation, Lee noted. In addition, Bone has been selected as a winner in a South Korean government-backed end-to-end logistics program that will deploy UAVs and UGVs powered by its autonomy stack.\nWhen asked how a company less than a year old is already securing contracts and generating revenue, Lee told TechCrunch that Bone acquired a South Korean drone company called D-Makers, and its intellectual property (IP) just six months after launch. Originally focused on AI models for robotics, Bone is now integrating its existing AI division with the newly acquired company, and more acquisitions are on the horizon, he added.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nLee personally committed more than 10% of the round, approximately $1.5 million, he told TechCrunch. “That was important to me because I wanted to show both investors and my team that I’m fully invested, financially and emotionally, in this mission,” he said.\nBone is Lee’s second venture. His experience co-founding MarqVision gave him firsthand insight into building and scaling AI products worldwide, but it also convinced him that the next frontier of AI isn’t just digital; it’s physical.\n“After leaving MarqVision, I basically started from zero – going to robotics conferences like IEEE ICRA, cold-emailing the engineers behind Google RT-1/RT-2, and even walking up to Jim Keller, CEO of tenstorrent, at a cafe just to introduce myself and grab a coffee later,” Lee said.\nBone AI shouldn’t be pigeonholed as just a defense tech company, the founder continued. With broader ambitions, Lee frames it as a “physical AI” firm, bringing together advanced AI simulation, autonomy algorithms, embedded engineering, hardware design and large-scale manufacturing under one roof.\nWhile preparing his second company, Lee observed that AI and hardware were advancing in silos.\n“No one was building the connective tissue, the industrial backbone that allows intelligent machines to exist at scale. Even Nvidia, the most valuable AI company today, relies on a vast ecosystem of fabrication and manufacturing partners across Asia and Europe,” he told TechCrunch.\nLee points to South Korea’s track record of building global hardware manufacturing powerhouses like Hyundai, Samsung and LG. “This is why we should see more drone and small-robotics companies emerging here, and why Korea is fully capable of supporting them,” the CEO said. “Our mission at Bone is to build the supply chain for Physical AI within South Korea, and then expand that capability to the U.S., Europe, and other allied countries.”\nAnduril has become a household name in the U.S., boasting a valuation north of $30 billion, while in Europe, Helsing last raised funding at around $13 billion. Even in smaller markets like Israel, companies such as Kela Technologies have achieved similar recognition.\nAsia has yet to see the same level of adoption, Michael Kim, general partner at Third Prime, told TechCrunch. “As economies around the world focus on reindustrialization, not just the U.S., Bone sits at the intersection of sovereign AI, multipolarity, and reindustrialization,” he said, highlighting both the company’s mission and the problem it aims to solve.\nSouth Korea has high-quality, cost-competitive hardware manufacturing across multiple sectors such as heavy industry, shipbuilding, cars and semiconductors.\n“Many niche hardware players exist but haven’t received Bay Area VC funding; Bone has a strong ‘buy versus build strategy’ to acquire and integrate these assets, accelerating product maturity and commercial traction,” Kim said.\n"
  }
]