[
  {
    "title": "Self-driving car companies Pony.ai and WeRide get the OK for Hong Kong listing",
    "url": "https://techcrunch.com/2025/10/15/self-driving-car-companies-pony-ai-and-weride-get-the-ok-for-hong-kong-listing/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/pony.ai-in-traffic.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T16:21:47.000Z",
    "description": "In Brief Posted: 9:21 AM PDT · October 15, 2025  Image Credits:Pony.ai  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Pony.ai and WeRide have received a key approval from Chinese securities regulators that clears...",
    "body": "\nIn Brief\nPosted:\n9:21 AM PDT · October 15, 2025\n\nImage Credits:Pony.ai\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nPony.ai and WeRide have received a key approval from Chinese securities regulators that clears the way for the autonomous vehicle technology companies to pursue secondary listings on the Stock Exchange of Hong Kong.\nThe Chinese companies, both of which are based in Guangzhou, are already publicly traded in the U.S. on the Nasdaq Exchange. WeRide made its public debut in October 2024, and Pony.ai followed a month later.\nNow, Pony.ai and WeRide are each aiming to sell shares on the Hong Kong Exchange, following a trend of Chinese companies that have pursued a secondary listing.\nPony.ai and WeRide said the China Securities Regulatory Commission (CSRC) had issued a notice approving their proposed listing, according to regulatory filings reported to the U.S. Securities and Exchange Commission. The CSRC has the final authority to determine whether a company can go public overseas.\nBoth companies appear ready to proceed with their respective proposed global offering and listing. Reuters reported WeRide has hired Morgan Stanley and China International Capital Corp. to work on a dual primary listing in Hong Kong, citing anonymous sources. WeRide plans to complete the listing in December.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "Google releases Veo 3.1, adds it to Flow video editor",
    "url": "https://techcrunch.com/2025/10/15/google-releases-veo-3-1-adds-it-to-flow-video-editor/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screenshot-2025-10-15-at-8.03.20PM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T16:00:00.000Z",
    "description": "Veo 3 already has edit features such as adding reference images to drive a character, providing the first and last frame to generate a clip using AI, and the ability to extend an existing video based on the last few frames. With Veo 3.1, Google is adding audio to all these features to make the clips more lively.",
    "body": "\nIn Brief\nPosted:\n9:00 AM PDT · October 15, 2025\n\nImage Credits:Google\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoogle launched its new video model Veo 3.1 with improved audio output, granular editing controls, and better output for image to video. It said that Veo 3.1 builds on May’s Veo 3 release and generates more realistic clips and adheres to prompts better.\nThe model allows users to add an object to the video and have it blend into the clip’s style, Google said. Soon, users will be able to remove an existing object from the video in Flow, too.\nVeo 3 already has edit features such as adding reference images to drive a character, providing the first and last frame to generate a clip using AI, and the ability to extend an existing video based on the last few frames. With Veo 3.1, Google is adding audio to all these features to make the clips more lively. \nThe company is rolling out the model to its video editor Flow, the  Gemini App, along with Vertex and Gemini APIs. It said that since Flow’s launch in May, users have created more than 275 million videos on the app. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Electric aircraft startup Beta Technologies seeks to raise $825M in IPO",
    "url": "https://techcrunch.com/2025/10/15/electric-aircraft-startup-beta-technologies-seeks-to-raise-825m-in-ipo/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/beta-factory.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T23:54:19.000Z",
    "description": "In Brief Posted: 4:54 PM PDT · October 15, 2025  Image Credits:Beta Technologies  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Electric aviation startup Beta Technologies has priced shares for its initial public...",
    "body": "\nIn Brief\nPosted:\n4:54 PM PDT · October 15, 2025\n\nImage Credits:Beta Technologies\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nElectric aviation startup Beta Technologies has priced shares for its initial public offering between $27 and $33, in hopes of raising as much as $825 million, according to a regulatory document filed with the U.S. Securities and Exchange Commission. If the company attracts investors at the top of that range it will debut with a valuation of about $7.2 billion.\nThe Vermont-based company, which was founded in 2017 by its enigmatic CEO Kyle Clark, filed the paperwork Wednesday despite the government shutdown. The SEC issued guidance earlier this month that allows companies in IPO limbo to allow their statements on certain areas, including share price, to become automatically effective after 20 days, even without SEC staff review. Several other companies, including Navan, have pressed ahead with IPO plans under this rule.\nClark, a Harvard-educated former professional hockey player and pilot instructor, has not followed the typical path of a startup founder. He eschewed Silicon Valley for his Vermont hometown and took a different path to raising funds to develop and build electric aircraft. Beta has never taken venture capital, instead raising $1.15 billion in funds from institutional investors like Fidelity and Qatar Investment Authority.\nLast month, Beta Technologies announced a strategic deal with GE Aerospace to build a hybrid-electric turbogenerator for next-gen aircraft. GE Aerospace agreed to take a stake in the company and invest $300 million as part of the deal.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Transportation\n"
  },
  {
    "title": "This Thiel-backed venture allows doping in its own sports",
    "url": "https://techcrunch.com/video/this-thiel-backed-venture-allows-doping-in-its-own-sports/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/aron-dsouza-headshot.webp?w=150",
    "tag": "Tech",
    "date": "2025-10-15T22:00:00.000Z",
    "description": "Backed by Peter Thiel and Donald Trump Jr.’s 1789 Capital, the Enhanced Games aims to disrupt the Olympics with a competition that allows athletes to dope. Launching in Las Vegas in May 2026, the games...",
    "body": "\n\t\t\n\n\n\nBacked by Peter Thiel and Donald Trump Jr.’s 1789 Capital, the Enhanced Games aims to disrupt the Olympics with a competition that allows athletes to dope. Launching in Las Vegas in May 2026, the games promise $1 million bounties for breaking world records and lean on a business model reminiscent of Red Bull’s, using the spectacle as marketing for future enhancement products. \nToday on TechCrunch’s Equity podcast, Rebecca Bellan spoke with Aron D’Souza, co-founder and president of the Enhanced Games, about the business of enhancement, what it means to build in the longevity space, and who gets to do it. \nSubscribe to Equity on Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n"
  },
  {
    "title": "Jack & Jill raises $20 million to bring conversational AI to job-hunting",
    "url": "https://techcrunch.com/2025/10/16/jack-jill-raises-20-million-to-bring-conversational-ai-to-job-hunting/",
    "image": "https://techcrunch.com/wp-content/uploads/2018/02/tc-backlight-e1689786273147.png?w=1200",
    "tag": "Tech",
    "date": "2025-10-16T11:50:04.000Z",
    "description": "Between infinitely scrolling job boards and the puzzling rise of fake applicants using AI to apply en masse, job-searching has quickly become one of the most bewildering experiences the internet has to offer....",
    "body": "\nBetween infinitely scrolling job boards and the puzzling rise of fake applicants using AI to apply en masse, job-searching has quickly become one of the most bewildering experiences the internet has to offer. Listings are posted and re-posted across different platforms as applications go unanswered, creating a spam-like flood of activity on both sides.\n“If you put a job on LinkedIn, you might get 1,000 people applying for that job within the first six hours,” says Matt Wilson, a London-based serial entrepreneur. “Some companies don’t even review the applicants that apply for those jobs, because the signal to noise ratio is very, very low.”\nWilson’s new solution is Jack & Jill, a new platform that uses conversational AI to reinvent the recruitment process from the ground up. The company announced $20 million in seed funding today, led by EU investor Creandum, but it’s hardly been in stealth. Service is already live in London, where the outfit has garnered nearly 50,000 users — and Wilson wants to use the influx of cash to fuel a US expansion and take Jack & Jill to a new level.\n“There hasn’t been a major change in how people find jobs since LinkedIn and Indeed came on the scene 20 years ago,” says Wilson. His bet is that, with AI chatbots changing workplaces across the world, now might be the time to shake things up.\nAs you might guess from the name, Jack & Jill is a two-part platform. The “Jack” side of the platform handles the applicant side, giving users a 20-minute, AI-powered profile interview before providing them with a select list of roles pulled from online databases. From there, Jack can be used for mock interviews or more involved professional coaching. “Jill” works with employers, building a profile of a particular role and elevating candidates that match its requirements. Like LinkedIn, part of the goal is for both workers and hiring managers to keep an active presence on their respective apps, letting the app pull players off the sidelines as needed. The service takes a standard commission from any successful hire, and as the scope of the platform grows, Wilson hopes to make Jack & Jill indispensable for both sides.\nThat might sound like a standard recruiting system with a little AI sprinkled on top, but Wilson thinks conversational chatbots are more important than a simple matching algorithm. By building the process around chatbot interviews, he believes he’s found a scalable alternative to the endless shuffle of listings and resumes, potentially reinventing the basic elements of the contemporary hiring process.\nUsing AI systems to conduct first-round interviews is increasingly common in many parts of the world — particularly in China, where many multinational corporations have used the practice for hiring local roles. But while a surprise interview with an AI hiring manager might seem alienating, Wilson hopes that Jack & Jill’s approach will result in more intelligence applied to job placement overall.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“I think the way that we are mapped to the companies we work for, and vice versa, is just extremely inefficient,” Wilson says. “There are billions of people out there that could be in better jobs for them. And that’s a mission worth working on.”\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.co or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "X plans to show more information about user profiles to help improve trust",
    "url": "https://techcrunch.com/2025/10/15/x-plans-to-show-more-information-about-user-profiles-to-help-improve-trust/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/08/twitter-x-logo-musk-1.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T15:35:30.000Z",
    "description": "X is working on new transparency features to help users identify who they’re interacting with, such as account creation date, location, username change history, and how each account uses the service.",
    "body": "\nAs AI makes it easier to create bots that act ever more human-like, Elon Musk’s X is developing a new feature that would expose more information about the users behind an X profile in an effort to help people better understand who they’re talking to on the platform.\nAccording to a new post by X’s head of product Nikita Bier, the social network will begin experimenting with displaying more information on user profiles, including details such as the date the account was created, its location, the number of username changes it has undergone, and how it’s utilizing X’s service.\n\nWhen you read content on X, you should be able to verify its authenticity. This is critical to getting a pulse on important issues happening in the world.As part of that, we're experimenting with displaying new information on profiles, including which country an account is… pic.twitter.com/OYgT1OiJdA— Nikita Bier (@nikitabier) October 14, 2025\n\nThe idea is that by exposing some of these details, users will be able to make a more informed decision about whether someone is operating an authentic account or if they’re possibly a bot or bad actor attempting to sow misinformation. \nFor instance, if an account’s bio claims they’re based in a U.S. state, but their account information shows it’s based overseas, you may suspect the account has another agenda.\nSimilarly, if it shows they’ve downloaded the X app in an international app store, but pretend they’re from the U.S., you may also question their legitimacy. (That’s not to say that someone couldn’t have started an account elsewhere and then relocated to the U.S., but it’s a signal that could be combined with others — like multiple username changes, perhaps — that could raise red flags.) \nBier said that X will begin testing the feature first on some X employee profiles next week to get feedback before rolling it out more broadly. He also noted in a response to a question about user privacy that people would be able to opt out of having this information displayed. However, he pointed out, “if a user configures [the privacy toggles], that will likely be highlighted on their profile.” \nHe also addressed concerns over exposing people’s location, given that there are some areas where speech could have penalties, saying that X may substitute region for country in those cases. \nThe idea of displaying more information about a social media account to help users understand who they may be engaged with on social media is not new. In a recent interview at Bloomberg’s Screentime conference, for instance, Instagram head Adam Mosseri said that users on the photo- and video-sharing app today could visit someone’s profile and see a similar set of information.\n“Today, if you go to my profile, you can go to ‘About this profile,’ and you can see how long I’ve had this profile, what country I’m based in, how many times I’ve changed my username — a series of signals that you can use to decide how much you want to trust or not trust,” he said, noting that Instagram may “do more” to provide additional context in the future. \nThe changes on X, if they roll out publicly, could help address issues around trust to some extent, though scammers and spammers often have effective ways of working around attempts at exposure.\nThe news follows a recent bot purge on X, where the company removed 1.7 million bots engaging in reply spam.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Nscale inks massive AI infrastructure deal with Microsoft",
    "url": "https://techcrunch.com/2025/10/15/nscale-inks-massive-ai-infrastructure-deal-with-microsoft/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2201260651.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T16:01:11.000Z",
    "description": "AI hyperscaler startup Nscale has signed a sizable deal with Microsoft to bring Nvidia AI hardware to multiple data centers. The AI cloud provider announced on Wednesday that it signed a deal with Microsoft...",
    "body": "\nAI hyperscaler startup Nscale has signed a sizable deal with Microsoft to bring Nvidia AI hardware to multiple data centers.\nThe AI cloud provider announced on Wednesday that it signed a deal with Microsoft to bring approximately 200,000 Nvidia GB300 GPUs to three data centers in Europe and one in the U.S.\nThese GPUs will be delivered through Nscale-owned operations and through a joint venture with investment company Aker, one of Nscale’s investors.\nAbout half of these GPUs, 104,000, will head to a data center in Texas leased by Ionic Digital, over the next 12 to 18 months. Nscale plans to increase its footprint at this location to 1.2 gigawatts, the company stated.\nNscale will also deploy 12,600 GPUs to the Start Campus data center in Sines, Portugal, starting in the first quarter of 2026.\nThe deal builds on previous plans with both Microsoft and Aker regarding data centers in Norway and the United Kingdom. Nscale will send 23,000 GPUS to its Loughton, England campus starting in 2027, and send the remaining 52,000 GPUs to Microsoft’s AI campus in Narvik, Norway.\n“This agreement confirms Nscale’s place as a partner of choice for the world’s most important technology leaders,” Josh Payne, founder and CEO of Nscale, said in a company press release. “Few companies are equipped to deliver GPU deployments at this scale, but we have the experience and have built the global pipeline to do so.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nIt’s a bold claim by Payne, considering that Nscale was founded in 2024. Since its launch, the company has raised more than $1.7 billion from strategic partners including Aker, Nokia and Nvidia. Nscale has also raised from investors like Sandton Capital Partners, G Squared and Point72, among others. Payne told the Financial Times that the company is looking at an IPO as early as the end of next year.\n“The pace with which we have expanded our capacity demonstrates both our readiness and our commitment to efficiency, sustainability and providing our customers with the most advanced technology available. It’s a clear signal that Nscale is setting a new standard for how the next wave of AI infrastructure will be delivered,” Payne said in the release.\nGPU deals have picked up in recent weeks. OpenAI announced it was purchasing six gigawatts’ worth of chips from AMD last week. OpenAI also recently inked a deal with Nvidia in which Nvidia will invest up to $100 billion in the company in exchange for 10 gigawatts’ worth of chips in September.\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "How emerging Mubadala-backed AAF is winning VC deals in some of the hottest startups",
    "url": "https://techcrunch.com/2025/10/16/how-tiny-mubadala-backed-aaf-is-winning-vc-deals-in-some-of-the-hottest-startups/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/IMG_2336.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T11:04:18.000Z",
    "description": "It’s been almost a decade since Omar Darwazah and Kyle Hendrick launched AAF Management and its first fund of $25 million in 2017.  Rather than racing to dramatically increase their assets under management...",
    "body": "\nIt’s been almost a decade since Omar Darwazah and Kyle Hendrick launched AAF Management and its first fund of $25 million in 2017. \nRather than racing to dramatically increase their assets under management like many funds have in recent years, the partners have intentionally kept their fund sizes small, even as their reputation and returns have grown. \nTheir latest vehicle — a $55 million early-stage hybrid fund, dubbed the Axis Fund, that recently closed — brings the Washington-based venture firm’s total assets to roughly $250 million across four funds. The firm raised a $39 million Fund II in 2021 and a $32 million fund-of-funds investment vehicle in 2017 for a select group of its limited partners.\n“Running a $50 million fund is very different from running a $500 million fund,” general partner Darwazah said in an interview with TechCrunch. “We’ve seen that naturally large fund sizes can disrupt GP-LP alignment as it becomes a function of management-fee generation versus carried-interest generation, and that’s not a game we want to play.”\nUnlike typical VC firms that invest directly into startups, AAF is adopting elements of a fund-of-funds model where it invests part of its capital into a portfolio of emerging funds in addition to backing startups. \nWith this fourth fund, AAF plans to invest in emerging managers’ first or second funds (typically under $50 million) and their most promising portfolio companies from pre-seed to pre-IPO, the partners said.\nThe firm is allocating about 80% of its capital to startups and 20% to emerging funds, blending the two into what it calls a “one-stop capital-formation partner” for founders and fund managers alike.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nSo far, the Axis Fund has backed 25 pre-seed and seed-stage venture funds, along with five direct bets on early-stage and growth startups.\n“We’ve found that the richest dataset of private-market companies at the earliest stages of their formation over the past decade is accessed only through LP checks in emerging managers,” said Hendrick, the firm’s other general partner.\nThis dual fund type strategy has granted AAF access to many promising startups. The firm is an early investor in Current, Drata, Flutterwave, Jasper, and Hello Heart.\nSimilarly, through the funds where it’s an LP, AAF holds indirect exposure to other unicorns, including Mercury, Deel, Retool, and more recently AI firms such as Motion, Decagon and Eleven Labs through its network of seed-fund LP positions in firms like Leonis Capital, Wayfinder Ventures, and Quiet Capital (the firm founded by Lee Linden, who is exploring a similar two-pronged strategy with former Founders Fund GP Brian Singerman for a new fund).\nThe eight-year-old venture firm claims to have exposure to roughly 800 venture-backed companies launched between 2021 and 2025 through these underlying managers. \nL-R: Kyle Hendrick and Omar Darwazah [general partners and managing directors]Image Credits:AAF Management\nWith this approach, AAF also focuses less on hands-on help with hiring or product for portfolio companies and more on connecting founders with later-stage capital from its network of limited partners. That’s a service that becomes especially helpful once a startup begins raising growth rounds.\n“I’d say where we typically add the most value to a founder’s journey, especially in the early phase, is through our venture network,” said Hendrick. “That means we can inject you directly into 45 active venture funds where we’re LPs. It’s instant distribution into their ecosystems.”\nAt the same time, AAF serves as a conduit between institutional investors — especially in the Gulf — who often prefer diversified venture exposure without managing dozens of direct relationships.\nAbu Dhabi’s Mubadala, several U.S., European, and MENA family offices, GPs from leading U.S. asset managers, a multi-billion-dollar U.S. venture firm, and a publicly traded company are backing this fourth fund, the firm said.\nDarwazah and Hendrick came to venture from different backgrounds. Darwazah, who previously worked in corporate finance and private equity in the Middle East, has spent years bridging Gulf capital with U.S. startups. Hendrick, a former entrepreneur who also worked at the UAE Embassy in the U.S. and at a family office in Abu Dhabi, brings an operator’s lens to AAF’s earliest deals.\nAcross its four funds, AAF has made 138 direct investments and backed 39 unique emerging managers, with 20 portfolio exits totaling nearly $2 billion in aggregate value. \nThose exits include TruOptik, MoneyLion, Even Financial, Portfolium, Prodigy, BetterView, Lightyear, Trim, HeyDoctor, and Medumo. At least six publicly traded companies have acquired its portfolio companies including TransUnion, Giant Digital, GoodRx, and Affirm.\nThe firm says this all adds up to some of its previous fund vintages ranking in the top decile in terms of net TVPI for their respective vintages, according to Cambridge Associates and Carta data.\n“Our strategy allows us to identify signal from noise and increase our probability of backing outliers — fund returners, 10x cash-on-cash companies, and seed-to-unicorn investments,” said Darwazah.\n"
  },
  {
    "title": "Co-founder of Indian social network Koo releases a new photo sharing app",
    "url": "https://techcrunch.com/2025/10/15/co-founder-of-indian-social-network-koo-releases-a-new-photo-sharing-app/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Picsee-feat.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T03:30:00.000Z",
    "description": "In the last few years, photo-sharing apps have capitalized on the idea that Instagram has become too curated, creating spaces for users to share unfiltered photos from their camera rolls. Locket tapped into...",
    "body": "\nIn the last few years, photo-sharing apps have capitalized on the idea that Instagram has become too curated, creating spaces for users to share unfiltered photos from their camera rolls. Locket tapped into lockscreen-based sharing, Retro took a photo journaling route, and Yope is building Instagram for private groups.\nNow, Mayank Bidawatka, co-founder of Indian social network Koo, which was shut down last year after collapsed buyout talks, is releasing a new photo-sharing app called PicSee. The app, released Thursday, both on iOS and Android, aims to automatically detect and share photos of friends that are in your camera roll without you having to use any messaging system like WhatsApp or Instagram.\nImage Credits: PicSee\nBidawatka said that your friends probably have hundreds of photos of you that you don’t have. Either they forgot to send you those photos, or they themselves have forgotten about those photos. PicSee scan faces in your camera gallery and picks out photos of your friends.\n“I’ve been thinking about the problem of personal photo sharing for years now,” Bidawatka told TechCrunch over a call. “Last year, after we announced shutdown of Koo, I had time to rethink this problem and work on it again.” \nIf your friends are on PicSee, you can send them a sharing request. Once they accept, they’ll receive your first batch of photos of them. After that, the app will detect new photos of them in your camera roll and prompt you to send those, too.\nIf you don’t send them instantly, the app will automatically send those photos to them after 24 hours. Before that, you can review the photos that you are sending and choose not to send some. The photos are stored locally on your device in PicSee’s storage. You can choose to download them to your device storage. Users can also recall photos after they have sent them, which removes the images from PicSee on the receiver’s end.\nImage Credits: Picsee\nThe company says it has implemented a bunch of privacy controls. The app does all the processing of identifying faces on the device. The company said that while sending photos, it establishes an encrypted connection. The photos are stored on your device, and the company doesn’t store anything in the cloud. Bidawatka said the app also has a filter on NSFW pictures and blocks screenshots.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nPicSee’s biggest challenge may be its selectivity. While it makes sense to have an always-on photo connection with close friends, family, or partners, most people wouldn’t want that level of automatic sharing with everyone they know. That creates a hurdle. Users already send photos to these close contacts through WhatsApp, iMessage, Instagram, and Snapchat, so PicSee will need to convince them to change their default behavior for a relatively small circle of relationships.\nImage Credits: PicSee\nFurther, while the app detects photos of your friends on your phone, it doesn’t solve the problem of when someone asks you for a photo you took at an event you went to together, such as a concert, a wedding, or a party. \nThe company said it wants to address these social engagement features. The app already has a chat feature, which allows people who are in a picture to leave comments under it.\nThe company said it is also working on allowing users to create and manage albums, suggest albums, remove duplicates, and integrate with Google Photos/iCloud. The company also wants to use its face detection tech for videos on your camera roll.\nBillion Hearts, the company behind the PicSee app, raised $4 million in funding last year, led by Blume Ventures with participation from General Catalyst and Athera Ventures.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Zepto raises $450 million at $7 billion valuation as Indian quick commerce market heats up",
    "url": "https://techcrunch.com/2025/10/16/zepto-raises-450-million-at-7-billion-valuation-as-indian-quick-commerce-market-heats-up/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/06/zepto.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-16T10:12:11.000Z",
    "description": "Indian quick commerce startup Zepto said it has raised $400 million in a funding round led by a new investor, California Public Employees’ Retirement System (CalPERS), a U.S.-based pension fund. The round,...",
    "body": "\nIndian quick commerce startup Zepto said it has raised $400 million in a funding round led by a new investor, California Public Employees’ Retirement System (CalPERS), a U.S.-based pension fund. The round, which is a mix of primary and secondary investment, also has participation from existing investors, including Avenir, Avra, Lightspeed, Glade Brook, The Stepstone Group, and Nexus Venture Partners. After this funding, the company plans to go public next year.\nZepto competes with other quick commerce players such as Eternal’s (formerly Zomato) BlinkIt, Swiggy Instamart, and Tata-owned BigBasket — all part of publicly listed companies. The startup has been on a funding spree as it picked up $1.3 billion in a span of several months last year. Since Zepto’s last funding round in November 2024, Swiggy made its public debut on India’s stock exchange, and Blinkit surpassed Zomato in gross order value (the total value of customer orders) for Q1 2025.\nThe company also faces competition from legacy ecommerce players such as Flipkart and Amazon, which have started their own quick commerce delivery services. \nStartups are also looking at verticalized e-commerce offerings. Accel-backed Swish and Zing are operating in the food delivery space; publicly listed Nykaa, Flipkart-owned Myntra, Silkk, and Blip want to deliver apparel to customers in an hour; Lightspeed-backed Snabbit is allowing users to book home services like cleaning within 10 minutes; and startups like FirstClub are taking a curation approach to grocery delivery. \nZepto and CEO Aadit Palicha are confident about the startup’s growth. Palicha said that the company has scaled from 500,000 daily orders five quarters ago to 1.7 million daily orders and predicted that the growth will continue.\n“The key metric for this round of funding was our ability to turn dark stores profitable while acquiring over 10 million new monthly transcating users. We obviously invested incrementally in customer acquisition and store launches. But even as you were doing that, we were able to keep turning stores profitable,” Palicha told TechCrunch.\nBlinkIt, Instamart, and Zepto operate in many of these spaces, with food delivery being the most notable one. However, Zepto had to pause its Zepto Cafe offering in 44 cities due to staff challenges. While the company didn’t specify how many cities it has resumed operations in but it said Zepto Cafe is a business of over $110 million in run rate and growing rapidly.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nSigns for the quick commerce market are encouraging in India. Morgan Stanley predicts the quick commerce market could reach $42 billion by 2030. Bernstein said in a note in March that it could reach $100 billion in a decade. The analyst firm also noted that in target markets, quick commerce is the primary way people are buying groceries now.\nZepto has largely concentrated on major cities in India in terms of expanding services. J.P. Morgan noted earlier this month that BlinkIt has its dark store network of warehouses to fulfill online orders in more than 204 cities, compared to Swiggy Instamart in over 104, and Zepto in over 80 cities in India. Zepto has over 1,000 stores in these cities and plans to add hundreds of stores over the next 12 months.\nThe startup noted that while the majority of its business comes from metro cities, it is now receiving close to 20% of total order volume from smaller cities.\nOn its app, Zepto has focused on showing off its offerings like Super Saver, which gives users additional discounts on groceries for large orders, and highlighting categories like electronics, fashion, and decor. But this has made the app cluttered. Palicha acknowledeged that and said that the company will make changes to interface to simplify the app in coming months.\nThe investment is a notable one for CalPERS. The pension fund typically invests in venture capital through intermediary funds rather than leading direct investments in startups. CalPERS has been aggressively expanding its venture exposure since 2022 after what officials called a “lost decade” of underperformance, scaling its venture allocation from around $800 million to a targeted $5 billion. The fund’s decision to lead a round in an Indian quick-commerce startup seemingly signals strong institutional confidence in India’s rapid delivery sector and perhaps CalPERS’ growing appetite for direct venture investments in emerging markets, too. Notably, CalPERS is also an investor in funds of Zepto’s existing backers, like Lightspeed and General Catalyst.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Google now lets you add friends as contacts for account recovery",
    "url": "https://techcrunch.com/2025/10/15/google-now-lets-you-add-friends-as-contacts-for-account-recovery/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Google-Blog_Oct15_Account-Recovery.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T16:00:00.000Z",
    "description": "Image Credits:Google\t \t \t\t\t\t\t\t9:00 AM PDT · October 15, 2025\t\t\t\t\t\t\t\t\t\t\t  \t\t\t Google is announcing new privacy and recovery tools to combat spam across multiple products related to Android, including...",
    "body": "\n\t\n\t\tImage Credits:Google\t\n\t\n\t\t\t\t\t\t9:00 AM PDT · October 15, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nGoogle is announcing new privacy and recovery tools to combat spam across multiple products related to Android, including suspicious link detection in messages, sign-in with phone number, and recovery contacts.\nGoogle is adding new ways to recover Google accounts without losing any information in case you lose your device or if your account is compromised through a hack.\nThe company is adding a new feature called Recovery Contacts, which lets you add your trusted friends or family members as contacts to initiate your recovery and verify your identity. When you are locked out of your account because you lost your device or forgot your password. This setting is under the security tab on your Google Accounts page.\nImage Credits:Google\nWhen you are locked out, you can select a recovery contact as the backup method, and they will get a number, which will be valid for 15 minutes, that you will have to verify to log in to your account again. You can add 10 recovery contacts to your account, and they will have to approve your request to be added as one. Once you add a recovery contact, you can’t use them again for seven days.\nThe company is also adding sign-in with mobile number as a recovery method, which is particularly helpful when you lose a device. The tool automatically identifies all accounts linked with a particular phone number. You can use your lock-screen passcode or pattern from the previous device to verify yourself. This feature is gradually rolling out worldwide.\nImage Credits:Google\nThe company launched on-device protection for messages for Pixel devices to detect scam and spam messages. Google is now baking in spam link detection in Google Messages for all users. When you click on a suspicious message, the app will warn you and stop you from visiting that page.\nImage Credits:Google\nFor more technically inclined people, the company is adding a key verifier in Google Messages. This helps identify the other person and ensures that your messages are end-to-end encrypted and private. Users with Android 10 and later can scan a QR code for your contact for verification.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nImage Credits:Google\nGoogle is also introducing a new game called Be Scam Ready to educate users about different fraud and scam use cases.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t"
  },
  {
    "title": "Apple adds 650 megawatts of renewables in Europe with more coming in China",
    "url": "https://techcrunch.com/2025/10/15/apple-adds-650-megawatts-of-renewables-in-europe-with-more-coming-in-china/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-831764682.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T19:19:23.000Z",
    "description": "Apple announced Tuesday that it had signed contracts for 650 megawatts of renewable power in Europe. This includes wind and solar projects that are either operational or will be soon. A large chunk of the...",
    "body": "\nApple announced Tuesday that it had signed contracts for 650 megawatts of renewable power in Europe.\nThis includes wind and solar projects that are either operational or will be soon. A large chunk of the power they’ll produce will go toward offsetting the energy used by Apple customers. Use of everything from Mac Pros to Apple Watches accounts for nearly one-third of the company’s carbon footprint.\nEven though Europe isn’t usually considered a sunny continent, Apple is buying energy from several solar farms, including 110 megawatts each in Greece and Latvia, 131 megawatts in Spain, and 40 megawatts in Poland. Wind farms will contribute 99 megawatts in Romania and a portion of the 129 megawatt solar-wind portfolio in Italy.\nSeparately, Apple also said it would invest $150 million in China to help its suppliers switch to renewable energy. Already, renewable sources power more than 90% of the company’s manufacturing and production in the country.\nPerhaps most notable about these announcements is that they appear in the newsrooms of Apple’s regional websites, but not in the feed of its U.S. press site. Previously, the company’s press releases on regional renewable power purchases have appeared in that feed, perhaps out of a desire to not draw the ire of the Trump administration, which has been antagonistic to renewables.\nStill, solar and wind — and increasingly grid-scale batteries — have been the go-to source of energy for tech companies looking to power their operations.\nMicrosoft and Meta have also been consistent buyers of solar in particular. This year alone, Meta has added over 2 gigawatts of solar capacity, and Microsoft has signed deals that raise its total by 1.5 gigawatts.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nWhile most big tech firms have pledged to move to renewable power, more practical considerations help drive such deals. Solar and wind are among the cheapest forms of new generating capacity, undercutting coal and natural gas. When paired with batteries, which continue to drop in cost, they can provide firm, 24/7 power.\nThe other reason is speed: Solar farms can be built quickly, with a typical project requiring just 18 months to complete. What’s more, they can be completed in phases, allowing part of the project to come online early. For tech companies, which are in a race to secure power for their data centers and AI operations, that speed can make a significant difference. \n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Eightfold co-founders raise $35M for Viven, an AI digital twin startup for querying unavailable co-workers",
    "url": "https://techcrunch.com/2025/10/15/eightfold-co-founders-raise-35m-for-viven-an-ai-digital-twin-startup-for-querying-unavailable-coworkers/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Viven.jpg.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T17:15:00.000Z",
    "description": "While employees spend much of their day communicating and coordinating amongst themselves on projects, this effort is often undermined by the availability of specific individuals. When a colleague with vital...",
    "body": "\nWhile employees spend much of their day communicating and coordinating amongst themselves on projects, this effort is often undermined by the availability of specific individuals. When a colleague with vital information is away — whether on vacation or in a different time zone — the rest of the team must delay progress until that person responds.\nAshutosh Garg and Varun Kacholia, the co-founders of Eightfold — an AI recruiting startup last valued at $2.1 billion — believe that advances in LLMs and data privacy technologies can help solve some aspects of this costly problem. Earlier this year, they launched Viven, a digital twin startup with a mission to grant employees access to crucial information from teammates even when those colleagues are unavailable.\nOn Wednesday, Viven emerged out of stealth mode with $35 million in seed funding from Khosla Ventures, Foundation Capital, FPV Ventures, and others.\nViven develops a specialized LLM for each employee, effectively creating a digital twin by accessing their internal electronic documents such as email, Slack, and Google Docs. Other employees in the organization can then query that person’s digital twin to get immediate answers related to common projects and shared knowledge.\n“When each and every person has a digital twin, you can just talk to their twin as if you’re talking to that person and get the response,” Ashutosh Garg told TechCrunch.\nOne major hurdle is that people just can’t share everything with anyone who asks. Employees often handle sensitive  information or have personal files they want to keep private from the rest of the team.\nAccording to Ashutosh Garg, Viven’s technology solves that complex problem through a concept known as pairwise context and privacy. This enables the startup’s LLMs to precisely determine what information can be shared and with whom across the organization.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nViven’s LLMs are smart enough to recognize personal context and know what information needs to stay private — like questions related to an employee’s personal life. But perhaps the most important safeguard is that everyone can see the query history of their digital twin, which acts as a deterrent against people asking inappropriate questions.\n“It’s a very hard problem to solve, and until recently, it was unsolvable,” Ashu Garg, a general partner at Foundation Capital told TechCrunch.\nViven is already in use by several enterprise clients, including Genpact and Eightfold. (Co-founders Ashutosh Garg and Varun Kacholia continue to lead Eightfold, splitting their time between that company and running Viven.)\nAs for competition, Ashutosh Garg claims that no other company is tackling digital twins for the enterprise yet.\nHe wasn’t sure that there were no competitors when he first started thinking about the idea. So he called Vinod Khosla to ask about it. The legendary investor assured Ashutosh Garg that nobody is doing this and agreed to invest.\nAshu Garg of Foundation Capital was equally excited about Viven.\n“When Ashutosh came to me and described the product, the big aha for me was: there’s this horizontal problem across all jobs of coordination and communication, which no one is automating,” Ashu Garg told TechCrunch.\nBut just because there are no direct competitors now doesn’t mean that other companies won’t build digital twins for companies in the future. Ashu Garg said that Anthropic, Google’s Gemini, Microsoft Copilot, and OpenAI’s enterprise search products have a personalization component. But, if they do enter this market, Viven hopes its “pairwise” context technology will be its moat.\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Spotify spotted working on a ‘SongDNA’ feature that showcases the people behind your favorite music",
    "url": "https://techcrunch.com/2025/10/15/spotify-spotted-working-on-a-songdna-feature-that-showcases-the-people-behind-your-favorite-music/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1783835425-crop-e1717409949317.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T20:33:48.000Z",
    "description": "Spotify has been spotted developing a “SongDNA” feature that would allow users to discover music through the credits — the writers, collaborators, vocalists, engineers, lyricists, producers, composers, and...",
    "body": "\nSpotify has been spotted developing a “SongDNA” feature that would allow users to discover music through the credits — the writers, collaborators, vocalists, engineers, lyricists, producers, composers, and others who worked on a given track or album.\nThe feature was discovered in the app’s code by reverse engineer Jane Manchun Wong, who was able to generate screenshots of how SongDNA would appear in the app. Based on her findings, SongDNA would introduce a visual experience where you could essentially navigate through the credits, see how people were connected to each other, and explore their various works.\n\nFor instance, Wong showed how one artist, Rei Ami from the “KPop Demon Hunters” cast, had lent her voice to other tracks beyond those from the movie.\nIf Spotify releases the feature to the public, it could challenge the streaming service TIDAL’s interactive credits, which also lets you explore music through the contributors behind the songs you love. The addition could be useful for music industry pros looking for collaborators, as well as anyone wanting to learn more about the people who work behind the scenes in music creation.\nShortly after posting screenshots to social media, Wong said Spotify’s app was updated to remove references to the SongDNA feature. Reached for comment, Spotify declined to share further details but did not issue a denial.\nFollowing Wong’s post, another reverse engineer and technologist, Chris Messina, was able to confirm SongDNA’s existence by finding references to the feature within the app’s code. According to Messina, the lines of code suggest the feature could be used to reveal the network of contributors behind songs, allowing users to explore more of their work, he said.\nImage Credits:Chris Messina via Threads (opens in a new window)\nWhile some wondered if SongDNA would be Spotify’s answer to Pandora’s Music Genome Project, it appears that’s not quite the case. The Genome Project uses hundreds of different details, or “traits,” corresponding to a particular characteristic of the music to classify tracks and determine how they’re related.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nSongDNA, for now at least, appears to be more focused on just the people behind the music, not the music itself. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Anthropic launches new version of scaled-down ‘Haiku’ model",
    "url": "https://techcrunch.com/2025/10/15/anthropic-launches-new-version-of-scaled-down-haiku-model/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Screen-Shot-2025-10-15-at-10.38.58-AM.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-15T17:00:00.000Z",
    "description": "Anthropic has released Claude Haiku 4.5, the newest version of its smallest model, billed as offering similar performance to Sonnet 4 \"at one-third the cost and more than twice the speed.\"",
    "body": "\n\t\n\t\tImage Credits:Anthropic\t\n\t\n\t\t\t\t\t\t10:00 AM PDT · October 15, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nOn Wednesday, Anthropic released Claude Haiku 4.5, the newest version of its smallest model, billed as offering similar performance to Sonnet 4 “at one-third the cost and more than twice the speed,” per a company blog post. \nAnthropic cites a range of new benchmark results to back up those performance claims. In the company’s testing, Haiku scored 73% on SWE-Bench verified and 41% on the command-line-focused Terminal-Bench — below Sonnet 4.5, but on par with Sonnet 4, GPT-5, and Gemini 2.5 in each case. Tests show similar results on benchmarks for tool use, computer use, and visual reasoning.\nThe new version of Haiku will be immediately available under all free Anthropic plans and the company believes it will be particularly appealing for free versions of AI products, where it can provide significant capabilities while minimizing server loads. The lightweight nature of the model also means it’s easier to deploy multiple Haiku agents in parallel or in combination with a more sophisticated model.\nIn a statement to press, Anthropic CPO Mike Krieger said the Haiku would make new styles of deployment possible in production for the first time. “It’s opening up entirely new categories of what’s possible with AI in production environments – with Sonnet handling complex planning while Haiku-powered sub-agents execute at speed,” Krieger said. “We’re giving people a complete agent toolbox where each model has the right combination of intelligence, speed, and cost for different parts of the job.” \nThe most immediate applications are likely to come in software development tools, where Claude Code is already commonly used and latency is often a critical factor. In statements provided by Anthropic, Zencoder CEO Andrew Filev described the new version of Haiku as “unlocking an entirely new set of use cases.” \nHaiku 4.5 comes after a string of high-profile launches for Anthropic: just two weeks after the launch of Sonnet 4.5 and two months after the launch of Opus 4.1, both of which were hailed as state-of-the-art on release. The previous version of Haiku was released in October 2024.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\n\t\tRussell Brandom has been covering the tech industry since 2012, with a focus on platform policy and emerging technologies. He previously worked at The Verge and Rest of World, and has written for Wired, The Awl and MIT’s Technology Review.\r\n He can be reached at russell.brandom@techcrunch.co or on Signal at 412-401-5489.\t\n\n\t\n\t\tView Bio \n\t\n\n\t\t"
  }
]