[
  {
    "title": "Construction workers are cashing in on the AI boom",
    "url": "https://techcrunch.com/2025/12/01/construction-workers-are-cashing-in-on-the-ai-boom/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2152222109.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T19:13:50.000Z",
    "description": "In Brief Posted: 11:13 AM PST · December 1, 2025  Image Credits:MONEY SHARMA / AFP / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  The AI boom is proving to be a windfall for construction workers...",
    "body": "\nIn Brief\nPosted:\n11:13 AM PST · December 1, 2025\n\nImage Credits:MONEY SHARMA / AFP / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe AI boom is proving to be a windfall for construction workers building the massive data centers that power it all. According to The WSJ, workers moving into data-center construction are seeing pay jumps of 25% to 30% compared to their previous jobs — and in some cases, much more.\nAmong them is DeMond Chambliss, who traded his small drywall business in Columbus, Ohio, for a supervisor role overseeing 200 workers at a data center site. He now makes over $100,000 annually. “I pinch myself going to work every day,” the 51-year-old tells the Journal. In Oregon, electrical safety specialist Marc Benner pulls in $225,000 a year, while electrician Andrew Mason makes over $200,000 managing workers at six Northern Virginia data centers.\nThe Journal reports this isn’t just about higher base pay. Companies are sweetening the pot with perks like heated break tents, free lunches, daily incentive bonuses, and even remote project management positions. One construction site offers workers $100 in daily incentive pay, which can add up.\nThe surge comes as tech giants like Amazon, Google, and Microsoft race to build hundreds of new data centers, colliding with an industry-wide shortage of roughly 439,000 skilled workers, according to the Associated Builders and Contractors trade group. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "‘Avatar’ director James Cameron says generative AI is ‘horrifying’",
    "url": "https://techcrunch.com/2025/11/30/avatar-director-james-cameron-says-generative-ai-is-horrifying/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/avatar.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-30T22:53:15.000Z",
    "description": "In Brief Posted: 2:53 PM PST · November 30, 2025  Image Credits:Disney  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  James Cameron’s movies are often at the cutting edge of visual effects technology — especially...",
    "body": "\nIn Brief\nPosted:\n2:53 PM PST · November 30, 2025\n\nImage Credits:Disney\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nJames Cameron’s movies are often at the cutting edge of visual effects technology — especially the “Avatar” films, with their heroic blue Na’vi characters brought to life through performance capture.\nBut that doesn’t make Cameron a fan of generative AI.\nIn a CBS Sunday Morning interview tied to the upcoming release of “Avatar: Fire and Ash,” the director acknowledged that performance capture (where an actor’s performance is recorded as a template for digital artists) can sound similar to GenAI. But in reality, he said it’s “the opposite.”\n“For years, there was this sense that, ‘Oh they’re doing something strange with computers, and they’re replacing actors,’” Cameron said. “When in fact, once you really drill down and you see what we’re doing, it’s a celebration of the actor-director moment.”\nIndeed, the CBS segment shows members of the “Avatar” cast performing their underwater scenes in a 250,000-gallon water tank.\n“Go to the other end of the spectrum and you’ve got generative AI, where they can make up a character, they can make up an actor, they can make up a performance from scratch with a text prompt,” Cameron added. “No, that’s horrifying … That’s exactly what we’re not doing.”\n\n\n\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Media & Entertainment\n"
  },
  {
    "title": "OpenAI’s investment into Thrive Holdings is its latest circular deal",
    "url": "https://techcrunch.com/2025/12/01/openais-investment-into-thrive-holdings-is-its-latest-circular-deal/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2197181602.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T16:58:17.000Z",
    "description": "Analysts will be watching to see if Thrive-owned firms actually succeed in building long-term profitable businesses using OpenAI’s tech, or if the result is really just pumped up valuations based on speculative market potential. ",
    "body": "\nIn Brief\nPosted:\n8:58 AM PST · December 1, 2025\n\nImage Credits:Kim Jae-Hwan/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOpenAI is taking an ownership stake in Thrive Holdings, whose parent company is one of the AI giant’s major investors, Thrive Capital. \nThrive Holdings operates like a private equity firm for AI, rolling up companies that it believes could benefit from the tech in sectors like accounting and IT services. \nNeither company disclosed the terms of the deal, but it will involve OpenAI embedding engineering, research, and product teams within Thrive’s companies to accelerate AI adoption and boost efficiency, the company says. If those companies succeed, OpenAI’s stake will grow, and it will get compensated for its services, according to reporting from CNBC.  \nThe partnership follows a pattern of circular dealmaking for the $500 billion AI giant, which also recently took stakes in infrastructure partners like Advanced Micro Devices and CoreWeave. Analysts will be watching to see if Thrive-owned firms actually succeed in building long-term profitable businesses using OpenAI’s tech, or if the result is really just pumped-up valuations based on speculative market potential. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Nvidia’s $2B Synopsys bet tightens its grip on the chip-design stack",
    "url": "https://techcrunch.com/2025/12/01/nvidias-2b-synopsys-bet-tightens-its-grip-on-the-chip-design-stack/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2192215566.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T16:32:50.000Z",
    "description": "The $2 billion investment in Synopsys, which makes software and components for designing semiconductor chips, deepens their existing partnership at a time when analysts scrutinize circular AI-industry deals and warn of a potential bubble.",
    "body": "\nNvidia is investing $2 billion into Synopsys, which makes software and components for designing semiconductor chips. The deal deepens their existing partnership at a time when analysts have started to scrutinize increasingly common circular AI-industry deals and warn of a potential bubble.\nNvidia said it bought Synopsys shares at $414.79 each as part of a multi-year partnership to integrate Nvidia’s AI hardware and computing capabilities into Synopsys’ electronic design automation (EDA) and simulation software. The deal will help Synopsys transition its platform from CPU-based computing to GPUs, a shift it hopes will speed up chip-design workflows, per a release.\nThe deal gave Synopsys’ stock a lift by signaling long-term growth — a boon after the company recently reported weakness in its IP segment due to U.S. export restrictions and issues at a major customer.\nFor Nvidia, the investment strengthens its influence over Synopsys’ widely used EDA tools at a time when chip-design competition is starting to heat up. It also comes after major investors such as SoftBank and Peter Thiel have sold off their Nvidia positions.\n"
  },
  {
    "title": "Black Forest Labs raises $300M at $3.25B valuation",
    "url": "https://techcrunch.com/2025/12/01/black-forest-labs-raises-300m-at-3-25b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/6844c7ed531e3aa09958eea8a9deae8bdabd0b54-3721x2798-1.png?w=150",
    "tag": "Tech",
    "date": "2025-12-01T14:08:13.000Z",
    "description": "The round was co-led by Salesforce Ventures and Anjney Midha (AMP), and saw participation from a16z, NVIDIA, Northzone, Creandum, Earlybird VC, BroadLight Capital, General Catalyst, Temasek, Bain Capital Ventures, Air Street Capital, Visionaries Club, Canva and Figma Ventures.",
    "body": "\nIn Brief\nPosted:\n6:08 AM PST · December 1, 2025\n\nImage Credits:Black Forest Labs\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGerman AI lab Black Forest Labs said on Monday that it has raised $300 million in a Series B funding round that values the company at $3.25 billion.\nThe round was co-led by Salesforce Ventures and Anjney Midha (AMP), and saw participation from a16z, NVIDIA, Northzone, Creandum, Earlybird VC, BroadLight Capital, General Catalyst, Temasek, Bain Capital Ventures, Air Street Capital, Visionaries Club, Canva, and Figma Ventures.\nThe startup said it would use the funds for research and development.\nBlack Forest Labs, which makes foundation AI models for generating and editing images, has risen to fame quickly since its launch in August 2024. The company was in the news last year after it was revealed that Elon Musk’s Grok chatbot was using the German company’s models to generate images, and its models are being used by a slew of companies, like Adobe, fal.ai, Picsart, ElevenLabs, VSCO, and Vercel.\nThe startup recently revealed the latest version of its image-generation model, Flux 2, which it says features better text and image rendering, and uses up to 10 images as a reference to maintain the style and tone while generating images. The model can generate images at resolutions up to 4K pixels.\nBlack Forest Labs’ co-founders, Robin Rombach, Patrick Esser, and Andreas Blattmann, were formerly researchers who helped create Stability AI’s Stable Diffusion models.\n\n\n\tTopics\n\t\n\t\ta16z, AI, AI image generation, bain ventures, black forest labs, Creandum, Fundraising, General Catalyst, Germany, In Brief, temasek\t\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Airbus orders software fix to thousands of planes due to solar radiation risk",
    "url": "https://techcrunch.com/2025/11/29/airbus-orders-software-fix-to-thousands-of-planes-due-to-solar-radiation-risk/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/03/GettyImages-1177988041.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-29T22:03:18.000Z",
    "description": "The company said it’s taking action because “analysis of a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls.”",
    "body": "\nFlights were delayed and cancelled globally after Airbus ordered fixes to 6,000 of its A320 series planes, according to The Guardian.\nThe company said it’s taking action because “analysis of a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls.”\nCiting industry sources, Reuters reports that the event in question was an October 30 JetBlue flight from Cancun, Mexico to Newark, New Jersey, in which the plane suddenly lost altitude and had to make an emergency landing in Tampa.\nThe Federal Aviation Administration has reportedly issued an emergency airworthiness directive calling for the affected planes to revert to earlier software before they can fly again. A smaller subset will need to have their hardware changed, Airbus said.\n\n\tTopics\n"
  },
  {
    "title": "Deezer rolls out ‘My Deezer Year 2025,’ its Spotify Wrapped clone",
    "url": "https://techcrunch.com/2025/12/01/deezer-rolls-out-my-deezer-year-2025-its-spotify-wrapped-clone/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/DeezerMyYear25.png?w=150",
    "tag": "Tech",
    "date": "2025-12-01T16:35:26.000Z",
    "description": "Deezer launched “My Deezer Year 2025” on Monday, its annual recap similar to Spotify Wrapped. By releasing early, Deezer beats other streaming music platforms like Spotify, Apple Music, and Amazon Music, in...",
    "body": "\nDeezer launched “My Deezer Year 2025” on Monday, its annual recap similar to Spotify Wrapped. By releasing early, Deezer beats other streaming music platforms like Spotify, Apple Music, and Amazon Music, in providing an annual summary of listeners’ favorite songs, artists, albums, and genres for 2025.\nThe feature, called “My Deezer Year,” offers users a detailed overview of their top tracks, top artists, favorite albums, and the amount of time spent listening to their most-played artist and their best track. \nThis year’s edition introduces a new “romantic comedy” theme for the recap’s visual presentation. According to Deezer, as users explore their listening habits, they’ll feel as if they’re starring in a romantic comedy, complete with scenes like a “meet cute.” Deezer narrates the story as users navigate through it, teasing plot twists along the way.\nImage Credits:Deezer\nThe experience is divided into three episodes. The first episode, titled “Meet Cute,” highlights the new artists users discovered throughout the year. The second episode, “Love Triangle,” features users’ top three artists, while the final episode, “Happily Ever After,” showcases their favorite tracks, along with a personalized playlist for continued listening. \nThis year’s experience differs last year’s “My Deezer Year 2024,” which offered a different interactive approach, inviting users to choose between being “roasted” or “hyped up” based on their music preferences.\nSimilar to previous years, this year’s recap also includes a personalized quiz where users can answer compatibility questions based on their musical tastes and share results with friends to find their musical matches. \nImage Credits:Deezer\nAdditionally, users can create their own quizzes to share with others by entering their favorite genre, three songs, and a top artist, then see which friends match their preferences. Notably, this is the first year non-Deezer users can create their own quizzes, a move likely intended to encourage more people to download the app and share their experiences on social media.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“My Deezer Year 2025” is now available in the app on iOS and Android devices. \nDeezer also released some interesting statistics, highlighting that on average, Deezer users listened to 122.8 hours of music globally over the past year, streaming over 691 songs from 402 artists, and discovering 357 new tracks.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "MKBHD’s wallpaper app Panels is shutting down",
    "url": "https://techcrunch.com/2025/12/01/mkbhds-wallpaper-app-panels-is-shutting-down/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/mkbhd-panels.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T20:13:15.000Z",
    "description": "Tech YouTuber Marques Brownlee, or MKBHD, announced on Monday that his phone wallpaper app Panels is shutting down. Fans had high hopes for Brownlee’s foray into app development, given his reputation as an...",
    "body": "\nTech YouTuber Marques Brownlee, or MKBHD, announced on Monday that his phone wallpaper app Panels is shutting down. \nFans had high hopes for Brownlee’s foray into app development, given his reputation as an eagle-eyed tech reviewer who has amassed more than 20 million followers on YouTube. He’s so influential that some blamed his commentary on Humane AI and Fisker for those companies’ eventual failures (we think the real issue is that you shouldn’t raise $230 million if you have no product). Yet from the time Brownlee launched Panels in September 2024, the app struggled to find an audience of its own.\n“We knew it was niche, but we made mistakes in making our first app, and ultimately, we weren’t able to turn it into the vision I had,” Brownlee said in an unlisted YouTube video. In a blog post, he added that “the makeup of the development team changed,” and he was unable to find the right collaborators to grow the app. \nBrownlee was inspired to create Panels because when he posts video reviews of phones, tablets, and computers, fans always point out how stunning his wallpapers and lock screens are. When he first announced the app, he pointed out that if you type “where does mkbhd…” into Google, one of the first suggestions is “… get his wallpapers.”\nPanels partnered with artists to sell distinct, high-resolution wallpapers, which users could access at a cost of $50 per year, or $12 per month (the artists got a cut of those payments). But Brownlee couldn’t overcome the challenge of trying to create a paying market for something that consumers are not accustomed to paying for — it’s easier to just pull an image from the internet, or take a cute photo of your dog.\nThanks to Brownlee’s stature, Panels ranked #1 on the iOS and Google Play charts for photos apps during its launch month. The app couldn’t sustain that momentum.\nAccording to the app intelligence firm Appfigures, Panels reached about 900,000 lifetime downloads and $95,000 in consumer spending across iOS and Android. Last month, the app only received 3,000 downloads and $500 in consumer spending, dipping too low to rank on U.S. app stores.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nPer Panels’ own disclosure, users downloaded more than 2 million wallpapers from the app.\nPanels will begin to refund users with active annual subscriptions when the app officially shuts down on December 31, 2025. However, Panels’ blog post outlines ways for customers to get their money back quicker. After the app shutdown, Panels says all user data will be deleted, and the app code will be open sourced so other developers can build on it, if they so desire.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Festivitas lets you decorate your Apple devices with holiday lights and snow",
    "url": "https://techcrunch.com/2025/12/01/festivitas-lets-you-decorate-your-apple-devices-with-holiday-lights-and-snow/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/Menu-Bar-Item.png?w=150",
    "tag": "Tech",
    "date": "2025-12-01T18:34:32.000Z",
    "description": "If you want to bring a bit of holiday cheer to the screen you use the most, you’ll get a kick out of the newly updated Festivitas app for Apple devices. Originally designed to add holiday lights to your Mac’s...",
    "body": "\nIf you want to bring a bit of holiday cheer to the screen you use the most, you’ll get a kick out of the newly updated Festivitas app for Apple devices. Originally designed to add holiday lights to your Mac’s desktop, this popular indie app has been updated this year with several new features, most notably a version of the app that brings its sparkling, colorful lights to iOS devices for the first time.\nWith the new Festivitas app for iPhone and iPad, you can add and customize a string of holiday lights on your device’s Home Screen using iOS widgets. The lights can frame your favorite personal photo (or perhaps a holiday image you dig up on Pinterest), and you can opt to make the widget transparent so it blends in with your background.\n\nWhile seasonal apps can sometimes be low-quality cash grabs, developer Simon Støvring puts genuine effort and thoughtfulness into Festivitas’ design — and doesn’t charge an arm and a leg, either. Instead, the app is available for free to consumers, with premium features that can be unlocked for a fair price of between $3.99 and $9.99. (You get to choose the price that works best for you.)\nOn both macOS and iOS, you can customize the holiday lights in multiple ways, beyond picking their colors and flashing pattern. You can adjust the cable’s thickness, its drop width and height, and choose from pre-made color palettes like Candy Cane, Winter Snow, Elf, and others, or you can design your own.\nYou can also make finer adjustments to things like the colors’ hue or temperature, the speed of the flashes, and the spacing between the lights.\n\nAnother perk is that you’ll be able to use the lights again outside of the winter holidays, as you can now change the bulb shape to designs like a bat, clover, Easter egg, heart, ghost, star, “2026,” and more throughout the year. This lets you continue to enjoy the app for other holidays and special events — there’s even a “WWDC” bulb for celebrating Apple’s Worldwide Developer Conference in June.   \nAnother new feature this year is a snow effect for the Mac app, which adds floating snowflakes to your desktop. You can customize this experience, making the flakes gently drift down toward your dock, or increase the snow amount, fall speed, flake size, and wind, transforming it into what looks like a blizzard. You can also choose to have the snow fall on top of everything on the screen, or just on your desktop itself.\n\nBoth the snow and lights can react to your mouse as you move it across the screen, either repelling the snow or lifting and dropping the lights, for a bit of interactive fun. Plus, moving the lights up makes it easier to see your browser tabs when you need to click them, though you can turn this feature off if you prefer.\nIf you’re more technically inclined, you’ll appreciate the app’s Shortcuts integration that lets you automate when your lights and snow turn on. This lets you do things like trigger the snow based on the day’s forecast, or have the lights appear alongside your music, and more.\n\nThere are plenty of other apps that offer holiday themes, widgets, and icons for your iPhone, but there’s a whimsy to Festivitas that makes it worth the download for anyone who’s into Home Screen or desktop personalization. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "European cops shut down crypto mixing website that helped launder 1.3 billion euros",
    "url": "https://techcrunch.com/2025/12/01/european-cops-shut-down-crypto-mixing-website-that-helped-launder-1-3-billion-euros/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/12/cryptomixer-seizure-notice-europol.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T18:40:41.000Z",
    "description": "A coalition of law enforcement agencies coordinated by Europol announced Monday the shuttering of cryptocurrency laundering service Cryptomixer. Europol confirmed the seizure in a press release, where it...",
    "body": "\nA coalition of law enforcement agencies coordinated by Europol announced Monday the shuttering of cryptocurrency laundering service Cryptomixer.\nEuropol confirmed the seizure in a press release, where it called Cryptomixer “the platform of choice for cybercriminals seeking to launder illegal proceeds from a variety of criminal activities, such as drug trafficking, weapons trafficking, ransomware attacks, and payment card fraud.”\nSince 2016, Europol said, Cryptomixer facilitated the laundering of 1.3 billion euros ($1.5 billion) in bitcoin. \nHackers and other criminals use laundering services such as Cryptomixer to obfuscate and hide the provenance of their cryptocurrency. By design, cryptocurrencies such as Bitcoin and Ethereum are built on public blockchains that allow law enforcement, as well as blockchain intelligence firms such as Chainalysis and Elliptic, to follow the money over time.\nAuthorities said they seized $25 million euros ($29 million) in bitcoin, along with three servers, 12 terabytes of data, and the official domain cryptomixer.io, which now displays the customary law enforcement seizure splash page. \nAccording to Europol, the site “facilitated the obfuscation of criminal funds for ransomware groups, underground economy forums and dark web markets,” and claimed its software “blocked the traceability of funds on the blockchain.”\n“Deposited funds from various users were pooled for a long and randomised period before being redistributed to destination addresses, again at random times. As many digital currencies provide a public ledger of all transactions, mixing services make it difficult to trace specific coins, thus concealing the origin of cryptocurrency,” Europol said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nCryptomixer offered customers anonymity, such as providing cover for cybercriminals who wanted to launder their crypto before taking the funds to legitimate cryptocurrency exchanges. Europol said the “cleaned” cryptocurrency could be swapped for other cryptocurrencies or fiat cash.\nOver the years, authorities have shut down or sanctioned several similar services, such as Tornado Cash, Chipmixer, and others.\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Korea’s Coupang says data breach exposed nearly 34M customers’ personal information",
    "url": "https://techcrunch.com/2025/12/01/koreas-coupang-says-data-breach-exposed-nearly-34m-customers-personal-information/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1246852423.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T12:26:15.000Z",
    "description": "South Korean e-commerce platform Coupang over the weekend said nearly 34 million Korean customers’ personal information had been leaked in a data breach that had been ongoing for more than five months. The...",
    "body": "\nSouth Korean e-commerce platform Coupang over the weekend said nearly 34 million Korean customers’ personal information had been leaked in a data breach that had been ongoing for more than five months.\nThe company said it first detected the unauthorized exposure of 4,500 user accounts on November 18, but a subsequent investigation revealed that the breach had actually compromised about 33.7 million customer accounts in South Korea. \nThe breach affected customers’ names, email addresses, phone numbers, shipping addresses, and certain order histories, per Coupang. More sensitive data like payment information, credit card numbers, and login credentials was not compromised and remains secure, the company said.\nCoupang said it has reported the incident to the Korea Internet & Security Agency (KISA), the Personal Information Protection Commission (PIPC), and the National Police Agency.\nOne of South Korea’s biggest e-commerce platforms, Coupang also offers a quick-commerce service called “Rocket Delivery” in the country, and also operates its marketplace in Japan and Taiwan. A Coupang spokesperson told TechCrunch that the investigation has found no evidence that consumer data from Coupang Taiwan or Rocket Now was affected in the data breach.\n“According to the investigation so far, it is believed that unauthorized access to personal information began on June 24, 2025, via overseas servers,” the company said. “Coupang blocked the unauthorized access route, strengthened internal monitoring, and retained experts from a leading independent security firm.”\nPolice have reportedly identified at least one suspect, a former Chinese Coupang employee now abroad, after launching an investigation following a November 18 complaint.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis is the latest in a string of cybersecurity incidents in South Korea this year. Coupang itself has suffered several data breaches that have exposed customer and delivery drivers’ information in previous years. Past incidents included leaks between 2020 and 2021, and most recently in December 2023, when its seller management system compromised the personal information of more than 22,000 customers.\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\tKate Park is a reporter at TechCrunch, with a focus on technology, startups and venture capital in Asia. She previously was a financial journalist at Mergermarket covering M&A, private equity and venture capital.\n\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Black Friday sets online spending record of $11.8B, Adobe says",
    "url": "https://techcrunch.com/2025/11/29/black-friday-sets-online-spending-record-of-11-8b-adobe-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/11/gg19-black-friday-text.png?w=150",
    "tag": "Tech",
    "date": "2025-11-29T21:39:44.000Z",
    "description": "American consumers spent $11.8 billion online on Black Friday, according to data from Adobe Analytics, which says it tracks more than 1 trillion visits to U.S. retail websites. That’s a new record, and up...",
    "body": "\nAmerican consumers spent $11.8 billion online on Black Friday, according to data from Adobe Analytics, which says it tracks more than 1 trillion visits to U.S. retail websites.\nThat’s a new record, and up from $10.8 billion spent on Black Friday last year, Adobe says. Between 10 a.m. and 2 p.m., online shoppers were supposedly spending $12.5 million every minute. Forbes reports that Adobe said in a statement that the numbers show Black Friday has become “a major e-commerce moment, as more shoppers opt to stay home and take advantage of deals.” \nThe company projects that Cyber Monday (coming in two days, on December 1) will be even bigger, with $14.2 billion spent online, according to Reuters.\nBlack Friday data from companies like Adobe and Salesforce can provide an early indicator of broader holiday shopping trends. Adobe is projecting a total of $253.4 billion in holiday spending this year, compared to $241.1 billion in 2024.\nSalesforce said it tracked $79 billion in global spending on Black Friday, with $18 billion of that in the United States, year-over-year increases of 6% and 3%, respectively. But this growth may have less to do with increased consumer demand and instead is reflecting higher prices — Salesforce data also shows that prices were up an average of 7%, while order volumes were down 1%.\nAnd both Adobe and Salesforce claim to see a growing influence of AI on holiday shopping. For example, Salesforce said that between Thanksgiving and Black Friday, AI and AI agents influenced $22 billion in global sales, though it’s not clear how broadly that’s defined.\nThe data is less clear about how online trends compare to in-person shopping at brick-and-mortar stores, with RetailNext telling Forbes that in-store traffic appears to be down 3.4% nationwide, while Pass_by said foot traffic is up 1.17% overall, and up an even more impressive 7.9% in department stores.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Data center energy demand forecasted to soar nearly 300% through 2035",
    "url": "https://techcrunch.com/2025/12/01/data-center-energy-demand-forecasted-to-soar-nearly-300-through-2035/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-1453486183.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T19:08:42.000Z",
    "description": "Planned data center construction shows no signs of fading, with new additions to require 2.7x — nearly triple — the sector’s current demand for electricity over the next decade, according to a new report from...",
    "body": "\nPlanned data center construction shows no signs of fading, with new additions to require 2.7x — nearly triple — the sector’s current demand for electricity over the next decade, according to a new report from BloombergNEF.\nBy 2035, data centers will draw 106 gigawatts, up sharply from the 40 gigawatts they use today. Much of that growth will occur in more rural areas as facilities grow in size and as sites near urban areas become scarce, BloombergNEF said.\nDriving part of the growth is the sheer scale of planned data centers. Today, only 10% of data centers draw more than 50 megawatts of electricity, but over the next decade, the average new facility will draw well over 100 megawatts. The biggest sites help skew the data: Nearly a quarter will be larger than 500 megawatts, and a few will exceed 1 gigawatts. \nPlanned data centers are significantly larger than those currently in operation.Image Credits:BloombergNEF\nAt the same time, the utilization rate for all data centers is expected to grow from 59% to 69% as AI training and inference grows to nearly 40% of total data center compute.\nIn some ways, the findings in the new report aren’t surprising. AI companies have been racing to build more powerful data centers, helping to drive global investment in the facilities up to $580 billion this year. That’s more than the world spends finding new supplies of oil.\nStill, the new report shows just how quickly the landscape is changing. It is a sharp revision upwards from a document the group published in April. The upswing was driven by a surge in new projects that have been announced since then. “With an average seven-year timeline for projects to come online, developments in earlier stages affect the tail end of our forecast the most,” the new report said.\nEarly stage projects have more than doubled between early 2024 and early 2025, though those are distinct from projects that have been committed or are currently under construction. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMuch of that new capacity is being planned for Virginia, Pennsylvania, Ohio, Illinois, and New Jersey. They lie within a region known to industry experts at the PJM Interconnection, a regional transmission organization that’s tasked with operating the electrical grid in those states and others, including Delaware, West Virginia, and parts of Kentucky and North Carolina. Texas’s Ercot grid will see a large number of additions, too.\nThe report arrives as the PJM Interconnection is under scrutiny from its independent monitor, Monitoring Analytics. The group filed a complaint with the Federal Energy Regulatory Commission (FERC) saying that PJM has the authority to authorize new data center connections only when its grid has adequate capacity.\n“As part of its obligation to maintain reliability, PJM has the authority to require large new data center loads to wait to be added to the system until the loads can be served reliably,” Monitoring Analytics wrote. “PJM has the authority to create a load queue.”\nWhat’s more, data centers are responsible for today’s high electricity prices within the region, the organization said. \n“PJM’s failure to clarify and enforce its existing rules and to protect reliable and affordable service in PJM is unjust and unreasonable,” it said. \nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "ChatGPT launched three years ago today",
    "url": "https://techcrunch.com/2025/11/30/chatgpt-launched-three-years-ago-today/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-30T20:14:09.000Z",
    "description": "On November 30, 2022, OpenAI introduced a new product to the world, innocuously describing it as “a model called ChatGPT which interacts in a conversational way.” It’s no hyperbole to suggest that ChatGPT...",
    "body": "\nOn November 30, 2022, OpenAI introduced a new product to the world, innocuously describing it as “a model called ChatGPT which interacts in a conversational way.”\nIt’s no hyperbole to suggest that ChatGPT subsequently transformed the worlds of business and tech, becoming enormously popular — it’s still in the No. 1 spot on Apple’s free app rankings today — while also serving as the catalyst for a flood of generative AI products.\nIt’s even made people suspicious of the em dash, which no chatbot will ever take from me.\nIn fact, “Empire of AI” author Karen Hao argued in a recent interview with TechCrunch that OpenAI has “already grown more powerful than pretty much any nation-state in the world,” and is now “rewiring our geopolitics, all of our lives.”\nThere may be even more dramatic changes to come. Charlie Warzel wrote in The Atlantic that we are now living in “the world ChatGPT built,” which is “defined by a particular type of precarity” and is “perpetually waiting for a shoe to drop.”\n“Young generations feel this instability acutely as they prepare to graduate into a workforce about which they are cautioned that there may be no predictable path to a career,” Warzel said. “Older generations, too, are told that the future might be unrecognizable, that the marketable skills they’ve honed may not be relevant.”\nOf course, others feel more optimistic about an AI-centric future, and indeed are positioned to profit from it handsomely. But in Warzel’s telling, the AI boosters and investors are waiting along with everyone else — waiting to see if their bets pay off, but also waiting “because a defining feature of generative AI, according to its true believers, is that it is never in its final form.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMeanwhile, Bloomberg took a more focused look at how ChatGPT has transformed the stock market. The most obvious winner so far has been Nvidia, with its stock up 979% since the chatbot launched. But AI fever has also buoyed other Big Tech companies, with the seven most valuable companies on the S&P 500 — Nvidia, Microsoft, Apple, Alphabet, Amazon, Meta, and Broadcom — all tied to tech, and with their collective growth accounting for nearly half of the benchmark’s 64% increase since ChatGPT was launched.\nThis has made for a more top-heavy market. The S&P 500 is weighted based on market capitalization, and those same seven companies now account for 35% of the weighting, compared to around 20% three years ago.\nHow long will this growth last? With the notable exception of Nvidia CEO Jensen Huang, it’s become increasingly common for AI executives to acknowledge that we might be in a bubble (or if you prefer, a “mania”).\n“Someone is going to lose a phenomenal amount of money in AI,” OpenAI CEO Sam Altman said in August, at a dinner with journalists.\nSimilarly, Sierra CEO and OpenAI board chair Bret Taylor agreed we are “in a bubble” that he compared to the dot-com boom of the late ‘90s. While individual companies might fail, he predicted, “AI will transform the economy, and I think it will, like the internet, create huge amounts of economic value in the future.”\nIn another three years — or less — we might know whether that optimism was warranted.\nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Amazon’s AI chatbot Rufus drove sales on Black Friday",
    "url": "https://techcrunch.com/2025/12/01/amazons-ai-chatbot-rufus-drove-sales-on-black-friday/",
    "image": "https://techcrunch.com/wp-content/uploads/2015/07/shutterstock_197269526.jpg?w=150",
    "tag": "Tech",
    "date": "2025-12-01T16:25:24.000Z",
    "description": "Amazon’s AI chatbot, Rufus, saw a surge of adoption on Black Friday, according to new data published over the weekend by market intelligence firm Sensor Tower. In the U.S., Amazon sessions that resulted in a...",
    "body": "\nAmazon’s AI chatbot, Rufus, saw a surge of adoption on Black Friday, according to new data published over the weekend by market intelligence firm Sensor Tower. In the U.S., Amazon sessions that resulted in a purchase surged 100% on Black Friday compared with the trailing 30 days, while sessions that resulted in a purchase and didn’t include Rufus increased by only 20%.\nIn addition, Amazon saw a 75% day-over-day increase for sessions that included Rufus and resulted in a purchase, compared with just a 35% day-over-day increase for sessions without Rufus that had resulted in a purchase. \nThe firm also noted that Amazon sessions that involved the AI chatbot outpaced total website sessions. \nOn Black Friday, Amazon’s total website sessions increased by 20% day over day, while those that involved Rufus were up by 35%.\nAmazon’s AI chat was first launched into beta in early 2024 before rolling out to all U.S. customers later that year. Today, Rufus helps Amazon shoppers find products, get recommendations, and perform product comparisons. \nRufus’ adoption to drive Black Friday sales is part of a broader surge in consumers turning to AI to help them with holiday shopping, data shows.\nImage Credits:Amazon\nAccording to e-commerce data from Adobe Analytics, which tracks more than 1 trillion visits to U.S. retail websites, AI traffic to U.S. retail sites increased by 805% year-over-year on Black Friday. This indicates that consumers more heavily embraced generative AI chatbots to find deals and research products this year. The AI tools were mostly used for popular Black Friday deal categories like electronics, video games, appliances, toys, personal care items, and baby and toddler products. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAdobe Analytics also noted that the use of AI increased conversions. It found U.S. shoppers who came to a retail site from an AI service were 38% more likely to buy, compared with non-AI traffic sources.\nWhether AI directly contributed to the record Black Friday spending of $11.8 billion is less clear. Instead, the sizable figure this year could be due to higher prices, not an increase in online shopping. As TechCrunch reported on Saturday, Salesforce data showed prices were up by an average of 7%, while order volumes were down by 1%.\nSensor Tower’s data similarly suggests that consumers were perhaps being more conservative in their spending this year, likely due to economic strains. Even though mobile app and website adoption spiked on Black Friday compared to the previous 30 days, gains in total visits and downloads decelerated from 2024, its data indicated. \nFor instance, Amazon and Walmart’s mobile app downloads grew by 24% and 20%, respectively on Black Friday, compared with the previous 30 days. But that growth paled when compared with 2024, when Amazon downloads surged by 50% and Walmart’s were up 75% during the same period, the firm pointed out. \nAmazon and Walmart’s website visits on Black Friday were up by 90% and 100% this year, respectively, compared with the prior 30 days. However, those same numbers in 2024 were 95% and 130%, also respectively.\nIn a related Adobe survey, 48% of respondents said they have used or plan to use AI specifically for holiday shopping. \nCheck out the latest reveals on everything from agentic AI and cloud infrastructure to security and much more from the flagship Amazon Web Services event in Las Vegas. This stream is brought to you in partnership with AWS.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  }
]