[
  {
    "title": "Chris Sacca’s VC firm is raising a second nuclear fusion fund ",
    "url": "https://techcrunch.com/2025/11/06/chris-saccas-vc-firm-is-raising-a-second-nuclear-fusion-fund/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/08/chris-sacca.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T23:33:05.000Z",
    "description": "Chris Sacca’s venture firm Lowercarbon Capital is raising a second fund to back nuclear fusion energy hopefuls, the VC said at the SOSV Climate Tech Summit on Thursday, as reported by Bloomberg.   The firm...",
    "body": "\nChris Sacca’s venture firm Lowercarbon Capital is raising a second fund to back nuclear fusion energy hopefuls, the VC said at the SOSV Climate Tech Summit on Thursday, as reported by Bloomberg.  \nThe firm has backed leading fusion startup Commonwealth Fusion Systems, as well as others like Pacific Fusion. It raised a $250 million, fusion-geared fund in 2022. Fusion believers, who include a number of well-known climate VCs beyond Sacca (like Vinod Khosla), still hold faith that a breakthrough needed to make it commercially viable is just around the corner. And several advances are showing promise of delivering one.\nIn the meantime, building fusion reactors is expensive. Commonwealth raised $863 million earlier this year, after raising a $1.8 billion Series B four years ago. TechCrunch has documented a dozen fusion startups that have raised over $100 million. \nSacca didn’t say how big this second fund will be, but a source told Bloomberg that it’s intended to be bigger than the first. \n"
  },
  {
    "title": "Grand Theft Auto VI is delayed — again",
    "url": "https://techcrunch.com/2025/11/06/grand-theft-auto-vi-is-delayed-again/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/12/grand-theft-auto-youtube-record.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T22:02:24.000Z",
    "description": "Grand Theft Auto VI, one of the most anticipated video games of all time, has been delayed, again — this time until November 19, 2026. The game was initially slated for a fall 2025 release but was pushed back...",
    "body": "\nGrand Theft Auto VI, one of the most anticipated video games of all time, has been delayed, again — this time until November 19, 2026.\nThe game was initially slated for a fall 2025 release but was pushed back to May 2026. On Thursday, Rockstar Games announced that the development team needs another six months.\n“We are sorry for adding additional time to what we realize has been a long wait, but these extra months will allow us to finish the game with the level of polish you have come to expect and deserve,” Rockstar Games wrote in their statement.\nGrand Theft Auto VI is the sequel to Grand Theft Auto V, which was released in 2013. According to Guinness World Records, that game became the fastest entertainment property to reach $1 billion in sales, hitting the milestone after just three days on the market. Fans are so eager for the next installment in the franchise that when Rockstar Games released the trailer for the game in December 2023, it broke the record for the most YouTube views in 24 hours (excluding music videos).\nRockstar Games did not provide additional details about the delay. Last week, the company fired between 30 and 40 employees for allegedly sharing confidential information in a Discord server.\n"
  },
  {
    "title": "Google to buy carbon credits from massive Amazonian reforestation project",
    "url": "https://techcrunch.com/2025/11/06/google-to-buy-carbon-credits-from-massive-amazonian-reforestation-project/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/crystal-mirallegro-C6GmjaUWmBU-unsplash.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T20:28:50.000Z",
    "description": "In Brief Posted: 12:28 PM PST · November 6, 2025  Image Credits:CRYSTAL MIRALLEGRO/Unsplash  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Google announced Thursday it is buying 200,000 metric tons of carbon...",
    "body": "\nIn Brief\nPosted:\n12:28 PM PST · November 6, 2025\n\nImage Credits:CRYSTAL MIRALLEGRO/Unsplash\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nGoogle announced Thursday it is buying 200,000 metric tons of carbon removal from Mombak, a forest restoration company based in Brazil. The project will buy farmland in the Amazon and reforest it.\nThe deal was made through the Symbiosis Coalition, an advance market commitment intended to develop a market for nature-based carbon removal schemes that is backed by Google, McKinsey, Meta, Microsoft, and Salesforce. Symbiosis Coalition is similar to Frontier, an advance market commitment also backed by Google and others that supports direct air capture projects.\nNature-based carbon removal shows great promise in drawing down CO2 levels in the atmosphere, but projects have been challenging to develop and sell for a variety of reasons. Nature-based projects risk falling short of their goals if they’re damaged by wildfires or other disasters, and it can be challenging to guarantee their long-term viability.\nStill, they come with many upsides: Forests can replenish aquifers and support biodiversity, neither of which direct air capture can do. Google said it will use its DeepMind Perch AI to help quantify biodiversity benefits of the project.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Climate\n"
  },
  {
    "title": "Laude Institute announces first batch of ‘Slingshots’ AI grants",
    "url": "https://techcrunch.com/2025/11/06/laude-institute-announces-first-batch-of-slingshots-ai-grants/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Laude-Slingshots-One.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:55:05.000Z",
    "description": "In Brief Posted: 1:55 PM PST · November 6, 2025  Image Credits:Laude Institute  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  On Thursday, the Laude Institute announced its first batch of Slingshots grants, aimed...",
    "body": "\nIn Brief\nPosted:\n1:55 PM PST · November 6, 2025\n\nImage Credits:Laude Institute\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nOn Thursday, the Laude Institute announced its first batch of Slingshots grants, aimed at “advancing the science and practice of artificial intelligence.”\nDesigned as an accelerator for researchers, the Slingshots program is meant to provide resources that would be unavailable in most academic settings, whether it’s funding, compute power, or product and engineering support. In exchange, the recipients pledge to produce some final work product, whether it’s a startup, an open source codebase, or another type of artifact.\nThe initial cohort is 15 projects, with a particular focus on the difficult problem of AI evaluation. Some of those projects will be familiar to TechCrunch readers, including the command-line coding benchmark Terminal Bench and the latest version of the long-running ARC-AGI project.\nOthers take a fresh approach to a long-established evaluation problem. Formula Code, built by researchers at Caltech and UT Austin, aims to produce an evaluation of AI agents’ ability to optimize existing code, while the Columbia-based BizBench proposes a comprehensive benchmark for “white-collar AI agents.” Other grants explore new structures for reinforcement learning or model compression.\nSWE-Bench co-founder John Boda Yang is also part of the cohort, as leader of the new CodeClash project. Inspired by the success of SWE-Bench, CodeClash will assess code through a dynamic competition-based framework, which Yang hopes will\n“I do think people continuing to evaluate on core third-party benchmarks drives progress,” Yang told TechCrunch. “I’m a little bit worried about a future where benchmarks just become specific to companies.” \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Ford execs reportedly discuss ending the F-150 Lightning",
    "url": "https://techcrunch.com/2025/11/06/ford-execs-reportedly-discuss-ending-the-f-150-lightning/",
    "image": "https://techcrunch.com/wp-content/uploads/2022/04/ford-f1-50-lightning-rar.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T20:02:08.000Z",
    "description": "Executives at Ford are considering killing its flagship electric pickup truck, the F-150 Lightning, according to The Wall Street Journal. The discussions are happening in the wake of Ford’s late October...",
    "body": "\nExecutives at Ford are considering killing its flagship electric pickup truck, the F-150 Lightning, according to The Wall Street Journal.\nThe discussions are happening in the wake of Ford’s late October decision to idle F-150 Lightning production while it prioritizes hybrid and gas-engine versions of the popular pickup. The company’s been dealing with production troubles after a fire broke out at aluminum supplier Novelis’ factory in Oswego, New York, earlier this year.\nFord introduced the F-150 Lightning in 2021 with a promised base price of $40,000. It started building and selling the truck in 2022 — although the truck wound up costing most customers a lot more. \nBut while it’s been one of the top-selling electric trucks in the United States since then, Ford has struggled to sell more than a few thousand of them per quarter. The market for electric trucks was tough even before Republicans in Congress ended the federal EV tax credit and the Trump administration took an axe to emissions regulations that encouraged the adoption of electric vehicles.\n"
  },
  {
    "title": "Meta estimates that it earns 10% of its revenue from scams, report says",
    "url": "https://techcrunch.com/2025/11/06/meta-estimates-that-it-earns-10-of-its-revenue-from-scams-report-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/GettyImages-2233066222.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:20:51.000Z",
    "description": "In Brief Posted: 1:20 PM PST · November 6, 2025  Image Credits:Will Oliver/EPA/Bloomberg / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Last year, Meta projected that 10% of its overall annual...",
    "body": "\nIn Brief\nPosted:\n1:20 PM PST · November 6, 2025\n\nImage Credits:Will Oliver/EPA/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLast year, Meta projected that 10% of its overall annual revenue — $16 billion — would come from fraudulent advertisements on its apps, according to a report from Reuters.\nThe documents accessed by Reuters also show that for three years, Meta failed to protect its users from ads promoting illegal gambling, investment schemes, and banned medical products. These fraudulent ads purport to offer a product or service that isn’t real and may be intended to solicit payments from less savvy users.\nImage Credits:Facebook (Screenshot by Reuters)\nMeta has a system for detecting the likelihood that an advertising campaign is a scam, but the company only deactivates an advertiser’s account if it is 95% sure that the advertiser is committing fraud. Otherwise, Meta will charge more money from advertisers that it suspects may be doing fraud as a way to discourage them from buying more advertising — but when those advertisers follow through anyway, it pads Meta’s bottom line.\nTechCrunch contacted Meta for comment but did not hear back before publication. Per Reuters’ report, Meta spokesperson Andy Stone claimed that the documents Reuters used “present a selective view that distorts Meta’s approach to fraud and scams.”\nStone added that over the last 18 months, Meta has reduced user reports of scam ads by 58%, and the company has removed over 134 million scam ads from its platforms.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in Apps\n"
  },
  {
    "title": "Sam Altman says OpenAI has $20B ARR and about $1.4 trillion in data center commitments",
    "url": "https://techcrunch.com/2025/11/06/sam-altman-says-openai-has-20b-arr-and-about-1-4-trillion-in-data-center-commitments/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2197366846.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:18:06.000Z",
    "description": "In Brief Posted: 1:18 PM PST · November 6, 2025  Image Credits:Tomohiro Ohsumi / Getty Images  \t\t \t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t\t\t \t\t\t\t\t\t\t\t\t \t\t\t\t\t \t  Rarely has a month gone by in 2025 without OpenAI signing another...",
    "body": "\nIn Brief\nPosted:\n1:18 PM PST · November 6, 2025\n\nImage Credits:Tomohiro Ohsumi / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nRarely has a month gone by in 2025 without OpenAI signing another multibillion-dollar data center deal. In a lengthy post on X on Thursday, OpenAI CEO Sam Altman publicly clarified the totals.\n“We expect to end this year above $20 billion in annualized revenue run rate and grow to hundreds of billion by 2030. We are looking at commitments of about $1.4 trillion over the next 8 years,” he wrote.\nWhile the post was largely a response to a brouhaha over comments his CFO made, and quickly walked back, concerning government-backstopped loans, Altman also listed a number of future business plans he believes will generate significant revenue.\nHe said OpenAI has an upcoming enterprise offering. Earlier this week, OpenAI said it already had a million business customers.\nHe named consumer devices and robotics. In May, OpenAI acquired Jony Ive’s io, and they are reportedly working on a palm-sized AI device.\nAltman mentioned scientific discovery as an upcoming business. Not much is known about it yet, except that OpenAI VP Kevin Weil mentioned a newly launched OpenAI for Science some months ago.\nAltman also said OpenAI could become a cloud computing provider: “We are also looking at ways to more directly sell compute capacity to other companies (and people); we are pretty sure the world is going to need a lot of ‘AI cloud’, and we are excited to offer this.” \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThat’s a bold idea for a company that doesn’t yet have its own network of data centers.\nBeyond revenue, Altman noted that the company may also pay for its needs the old-fashioned way: selling more equity or taking on more loans.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\nLatest in AI\n"
  },
  {
    "title": "Accel backs Uber rival Rapido as Prosus boosts stake",
    "url": "https://techcrunch.com/2025/11/06/accel-backs-uber-rival-rapido-as-prosus-boosts-stake/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/rapido.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T22:12:18.000Z",
    "description": "TVS Motor booked a 152% return as it sold its Rapido stake to Accel and Prosus. Founded in 2015, Rapido has grown into a major player in India's ride-hailing market, competing with Uber, Ola, and inDrive.",
    "body": "\nAccel has invested in Rapido, the ride-hailing platform competing with Uber in India, while Prosus has increased its stake, after Indian two-wheeler giant TVS Motor sold its entire holding.\nOn Thursday, TVS Motor said in a stock exchange filing (PDF) that it has sold its entire stake in Rapido for ₹2.88 billion (about $32 million) to Accel and Prosus’ investment unit, MIH Investments, securing a return of more than 152% over the past three years.\nFounded in 2015, Rapido has grown into a major player in India’s ride-hailing market, competing with Uber, Ola, and inDrive. The company began with bike taxis before expanding into auto-rickshaw bookings and car services and has added courier services to its platform. It has more recently been piloting a food-delivery service in select cities, entering a segment dominated by Swiggy and Zomato.\nTVS Motor first invested in Rapido in April 2022 as part of the company’s $180 million Series D round, joining existing backers such as WestBridge Capital, Shell Ventures, and Nexus Venture Partners. The automaker bought its stake at that time for ₹1.14 billion, according to its earlier investor disclosures (PDF).\nAs part of the latest transaction, Accel purchased 11,997 preference shares in Rapido, while Prosus acquired 11,988 preference shares and 10 equity shares. Both investors paid about ₹1.44 billion (roughly $16 million) each.\nAccel’s backing of Rapido marks a return to India’s ride-hailing sector for the firm, which was an early investor in Ola. The move comes as Rapido is in talks with Accel and Prosus for a new primary funding round that could close next year, according to two people familiar with the matter who spoke to TechCrunch. The exact funding size has yet to be determined.\nProsus is already an investor in Rapido and expanded its stake through another secondary share sale in September, when Swiggy sold its entire holding. That transaction doubled Rapido’s valuation to $2.3 billion, TechCrunch reported.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAccel and Prosus are also early backers of Swiggy, which exited Rapido after citing a potential conflict of interest, as the ride-hailing startup prepared to expand into the food-delivery market.\nAccel and Prosus did not respond to requests for comment. Rapido could not be reached for comment.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Tesla delays reveal of production Roadster 2 to April Fools’ Day",
    "url": "https://techcrunch.com/2025/11/06/tesla-delays-reveal-of-production-roadster-2-to-april-fools-day/",
    "image": "https://techcrunch.com/wp-content/uploads/2019/09/Roadster_Hero.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T23:57:12.000Z",
    "description": "Tesla CEO Elon Musk said Thursday the company will reveal the production version of its second-generation Roadster supercar on April 1, 2026 — nearly nine years after he first revealed the project. Musk, who...",
    "body": "\nTesla CEO Elon Musk said Thursday the company will reveal the production version of its second-generation Roadster supercar on April 1, 2026 — nearly nine years after he first revealed the project.\nMusk, who is famous for missing deadlines, said during Tesla’s annual shareholder meeting that he chose April Fools’ Day in part because it affords “some deniability.” \n“Like, I could say I was just kidding” if it happens to be later, he said. \nRevealing the production version of the new Roadster next year is in itself a delay. Just one week ago he appeared on Joe Rogan’s podcast and repeated his claim that he wanted to show off the car by year’s end. \nMusk stressed Thursday the car “will be very different from what was shown previously,” and again teased that the demo will be the “most exciting, whether it works or not, demo ever of any product” — a not-so-sly nod to the fact that he’s spent years trying to make the new Roadster fly in some fashion, possibly with SpaceX-built thrusters.\nMusk went on to say that he believes the second-generation Roadster won’t go into production until 12 to 18 months after the April reveal. \nDuring the Q&A portion of the meeting, one shareholder asked Musk if customers who preordered the “Founders Series” version of the new Roadsters could be invited to the reveal event. Those were the customers who plopped down $250,000 to secure special versions of the car in 2017.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Sure, absolutely,” Musk answered. “It’s the least we can do for our long-suffering Roadster reservation holders.”\nOpenAI CEO Sam Altman was one of those long-time sufferers who recently attempted to cancel the reservation — and initially failed to get a refund — for the long-promised EV.\nEarlier this month, Altman posted on X a “tale in three acts,” which was comprised of several screenshots showing his initial reservation, a request for a refund of the $50,000 reservation fee, and his email bouncing back.\n“I really was excited for the car!” Altman wrote. “And I understand delays. But 7.5 years has felt like a long time to wait.”\nMusk, who has openly sparred with Altman for years, went on the attack. “And you forgot to mention act 4, where this issue was fixed and you received a refund within 24 hours,” Musk wrote. “But that is in your nature.”\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Sora for Android saw nearly half a million installs on its first day",
    "url": "https://techcrunch.com/2025/11/06/sora-for-android-saw-nearly-half-a-million-installs-on-its-first-day/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/sora-app-GettyImages-2240278671.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T19:48:39.000Z",
    "description": "Sora’s Android launch is off to an auspicious start. On its first day on the Google Play Store, the AI video app from ChatGPT maker OpenAI saw an estimated 470,000 downloads across the markets where it was...",
    "body": "\nSora’s Android launch is off to an auspicious start. On its first day on the Google Play Store, the AI video app from ChatGPT maker OpenAI saw an estimated 470,000 downloads across the markets where it was available, according to new estimates from app intelligence provider Appfigures.\nThat makes the Android launch more than 4x the size of the iOS launch, with 327% more installs (360,000) — but the firm notes that’s not an apples-to-apples comparison.\nOn iOS, Sora was only available in the U.S. and Canada, and it was invite-only. \nSora on Android, however, is available in the U.S., Canada, Japan, South Korea, Taiwan, Thailand, and Vietnam, and OpenAI dropped the invite requirement in late October for its top markets.\n\nYou can now get into the Sora app without an invite code in the US, Canada, Japan, and Korea.Limited time only.— OpenAI (@OpenAI) October 29, 2025\n\nThe app was a breakout hit following its debut, despite its earlier exclusive status. The iOS app hit over a million installs within its first week and quickly jumped to the top of the App Store. Today, it’s still ranking as the No. 4 app on the U.S. App Store’s iPhone Top Free Charts.\nWith Sora, users leverage AI to make videos using prompts. These videos can also include the users and their friends animated by AI, via a feature known as Cameos. Videos are scrollable in a TikTok-like vertical feed, so you can see what other people are making with the technology.\nAppfigures has also revised its earlier estimates for first-day iOS downloads of the Sora app. Originally, its models said the app saw around 56,000 day-one downloads. Now that more time has passed, the model can more accurately predict that the figure was closer to 110,000, with about 69,300 of those being U.S. installs.\nBy comparison, the Sora Android app saw approximately 296,000 U.S.-based installs, out of the 470,000 total, indicating there’s still interest in the AI video maker, even after the initial iOS launch buzz wore off.\nSora also competes with Meta AI, which released its mobile app to European users today, following its earlier U.S. debut.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Amazon launches an AI-powered Kindle Translate service for e-book authors",
    "url": "https://techcrunch.com/2025/11/06/amazon-launches-an-ai-powered-kindle-translate-service-for-ebook-authors/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/amazon-kindle-stock-image-GettyImages-1202535978.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T20:22:48.000Z",
    "description": "Amazon announced on Thursday the launch of Kindle Translate, an AI-powered translation service designed for authors using Kindle Direct Publishing to broaden their reach. The service initially translates text...",
    "body": "\nAmazon announced on Thursday the launch of Kindle Translate, an AI-powered translation service designed for authors using Kindle Direct Publishing to broaden their reach. The service initially translates text between English and Spanish and from German to English, as it’s still operating in beta. More languages will be supported over time.\nThe retail giant noted less than 5% of titles on Amazon are available in more than one language, suggesting there’s a big opportunity for AI translations.\nOf course, AI isn’t perfect, which means it could introduce errors into the text. To address this, Amazon allows authors to preview their translations before publishing if desired. If the author is not using the service to simply speed up translating their work into another language they speak, this ability to check the AI’s work won’t do them much good; they’d still need a human translator to review the AI output if they wanted to ensure the best accuracy.\n(Amazon claims its AI translations are “automatically evaluated for accuracy” before publication, but it doesn’t detail what steps are involved with this part of the process.)\nThe company says authors can manage and access their translations from the Kindle Direct Publishing portal, where they can choose the languages, set prices, and publish their translated work.\nReaders, meanwhile, will see AI-translated works clearly labeled as “Kindle Translate” titles and will be able to preview samples of the translation. \nKindle Translate competes with many other AI-powered translation services and tools on the market, whose pricing can vary and which offer broader support for more languages. There are also open source tools. Some people in the industry criticize the use of AI in this way, saying that human translators are better at capturing nuance — particularly in fiction and other literary works. But AI is improving on this front and will likely continue to get better over time.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nAt present, Kindle’s translation service is being offered for free, according to Amazon’s announcement, which quotes an early tester who praised this aspect of the service, saying that indie authors have struggled to find a “cost-effective and trustworthy solution.”\nAmazon says translations are eligible to be enrolled in other programs, like KDP Select, and are included in its Kindle Unlimited subscription service. \n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Mastodon’s latest software update brings quote posts to all server operators",
    "url": "https://techcrunch.com/2025/11/06/mastodons-latest-software-update-brings-quote-posts-to-all-server-operators/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/mastodon-quote-posts-hero.png?w=150",
    "tag": "Tech",
    "date": "2025-11-06T15:43:52.000Z",
    "description": "Decentralized open source social network Mastodon is rolling out its latest release, version 4.5, which brings support for Quote Posts to all server operators, along with other features for admins,...",
    "body": "\nDecentralized open source social network Mastodon is rolling out its latest release, version 4.5, which brings support for Quote Posts to all server operators, along with other features for admins, conversation improvements, and more.\nThe addition of quote posts is one of the bigger changes to how Mastodon’s social network operates, as the social network attempts to compete against larger rivals, like X and Threads. Quoting can be a conversation driver and is considered a baseline feature for text-first social networks. But Mastodon wanted to ensure the feature launched with more user protections so as not to change the culture of its network.\nOn X, quote posts (formerly known as retweets when X was Twitter) contributed to a culture of “dunking,” where users would often deride others by responding to their post with cruel jokes or insults. That remains a concern today among other new competitors, like Threads and Bluesky.\nTo address this problem, Mastodon’s version of quote posts comes with added safety controls.\nImage Credits:Mastodon\nThe feature was also initially rolled out to the larger Mastodon servers at mastodon.online and mastodon.social in September, ahead of the 4.5 software update, giving users time to adjust the format.\nMastodon gives users several ways to control how their posts can be quoted. For instance, users decide who can quote them through the feature’s settings. Here, you can choose between options like “Anyone,” “Followers only,” or “Just me.” Additionally, users can control the visibility of quote posts by setting them to be visible to the public, to followers only, or a setting called “quiet public,” which makes the quotes public but removes them from Mastodon’s search, trends, and public timeline.\nIn addition, users can override their default settings on a post-by-post basis, if need be, which could be useful at those times when you want to quote someone without attracting unwanted attention. \nMastodon will also alert the user being quoted in the app, so they can remove their original post from the other person’s quote post, if they feel the need to. Plus, users can opt to block others to prevent them from seeing and quoting their posts in the future.\nWhile the broader rollout of quote posts is the major addition in the 4.5 software release, the update also fixes issues where users on older servers running 4.4 and earlier versions would sometimes miss seeing replies.\nImage Credits:Mastodon\nServer operators are also gaining new tools to optionally disable content feeds, set a local feed as their homepage, block specific users, and more. The moderation interface has been updated to display needed context, like link previews and quote posts in messages, to aid in decision-making. \nImage Credits:Mastodon\nMeanwhile, the 4.5 release also brings native emoji support to Mastodon’s web interface. \nMastodon continues to be one of the larger networks on the fediverse, the name for the open social web powered by the ActivityPub social networking protocol. Overall, the fediverse has nearly 12 million users, according to growth tracker FediDB, with Mastodon accounting for north of 8 million of that figure. However, its monthly active user number is only ~670,000.\nThreads, which integrates with ActivityPub, isn’t counted in these figures because it’s not a full integration. Threads has more than 400 million monthly users and 150 million daily active users.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "‘Landfall’ spyware abused zero-day to hack Samsung Galaxy phones",
    "url": "https://techcrunch.com/2025/11/07/landfall-spyware-abused-zero-day-to-hack-samsung-galaxy-phones/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/02/CMC_60351.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-07T11:03:00.000Z",
    "description": "Security researchers have discovered an Android spyware that targeted Samsung Galaxy phones during a nearly year-long hacking campaign. Researchers at Palo Alto Networks’ Unit 42 said the spyware, which they...",
    "body": "\nSecurity researchers have discovered an Android spyware that targeted Samsung Galaxy phones during a nearly year-long hacking campaign.\nResearchers at Palo Alto Networks’ Unit 42 said the spyware, which they call “Landfall,” was first detected in July 2024 and relied on exploiting a security flaw in the Galaxy phone software that was unknown to Samsung at the time, a type of vulnerability known as a zero-day. \nUnit 42 said the flaw could be abused by sending a maliciously crafted image to a victim’s phone, likely delivered through a messaging app, and that the attacks may not have required any interaction from the victim. \nSamsung patched the security flaw — tracked as CVE-2025-21042 — in April 2025, but details of the spyware campaign abusing the flaw have not been previously reported.\nThe researchers said in a blog post that it’s not known which surveillance vendor developed the Landfall spyware, nor is it known how many individuals were targeted as part of the campaign. But the researchers said that the attacks likely targeted individuals in the Middle East.\nItay Cohen, a senior principal researcher at Unit 42, told TechCrunch that the hacking campaign consisted of a “precision attack” on specific individuals and not a mass-distributed malware, which indicates that the attacks were likely driven by espionage.\nUnit 42 found that the Landfall spyware shares overlapping digital infrastructure used by a known surveillance vendor dubbed Stealth Falcon, which has been previously seen in spyware attacks against Emirati journalists, activists, and dissidents as far back as 2012. But the researchers said that the links with Stealth Falcon, while intriguing, were not enough to clearly attribute the attacks to a particular government customer.\nUnit 42 said that the Landfall spyware samples that they discovered had been uploaded to VirusTotal, a malware scanning service, from individuals in Morocco, Iran, Iraq, and Turkey throughout 2024 and early 2025.\nTurkey’s national cyber readiness team, known as USOM, flagged one of the IP addresses that the Landfall spyware connected to as malicious, which Unit 42 said supports the theory that individuals in Turkey may have been targeted.\nMuch like other government spyware, Landfall is capable of broad device surveillance, such as accessing the victim’s data, including photos, messages, contacts and call logs, as well as the tapping of the device’s microphone and tracking their precise location.\nUnit 42 found that the spyware’s source code referenced five specific Galaxy phones, including the Galaxy S22, S23, S24, and some Z models, as targets. Cohen said that the vulnerability may have also been present on other Galaxy devices, and affected Android versions 13 through 15. \nSamsung did not respond to a request for comment.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Tesla to begin Cybercab production in April, Musk claims",
    "url": "https://techcrunch.com/2025/11/06/tesla-to-begin-cybercab-production-in-april-musk-claims/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/Cybercab_80.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T23:11:12.000Z",
    "description": "Tesla will begin producing the Cybercab, an autonomous electric vehicle with no pedals or steering wheel, this April at its factory in Austin, Texas, CEO Elon Musk said during the company’s shareholder...",
    "body": "\nTesla will begin producing the Cybercab, an autonomous electric vehicle with no pedals or steering wheel, this April at its factory in Austin, Texas, CEO Elon Musk said during the company’s shareholder meeting Thursday.\nHis comments on Cybercab came just moments after shareholders overwhelmingly approved a compensation package for Musk that could be worth as much as $1 trillion in company shares — the largest in corporate history.\n“We’ve got the first car that is specifically built for unsupervised, full self-driving to be a robotaxi called a Cybercab — it doesn’t even have pedals or steering wheel,” Musk said, adding there will be no side mirrors either. “It’s very much optimized for the lowest cost-per-mile in an autonomous mode and production is happening right here in this factory, and we’ll be starting production in April next year.”\nTesla has yet to demonstrate that its cars are capable of driving themselves at scale without a safety monitor, despite years of promises.\nMusk’s comments seem to conflict with Tesla chairwoman Robyn Denholm, who recently told Bloomberg the Cybercab would include a steering wheel and pedals as a backup plan. Tesla once planned to make a version of the Cybercab with a wheel and pedals, but Musk killed the idea and opted instead to make very stripped-down versions of its cheapest cars.\nMusk went on to tout how the Cybercab would be produced, claiming the manufacturing line would have a 10-second cycle time — a massive acceleration from the one-minute cycle time to assemble a Model Y. Musk said this could mean producing 2 million to 3 million Cybercabs in a year.\n“So these will be everywhere in the future,” he said. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTesla first revealed the Cybercab in October 2024 during its splashy “We, Robot” event at Warner Bros. Discovery studio in California with a promise to eventually sell the vehicles for personal use.\nSince then, Tesla has launched a very bare-bones robotaxi service, but not with the proposed Cybercab. The service, which launched in June in certain parts of Austin, uses Model Y SUVs equipped with what Musk has described as a new, “unsupervised” version of Tesla’s Full Self-Driving software. A Tesla employee sits in the passenger seat on these driverless rides.\nPutting a Cybercab — or any vehicle — on the road without standard equipment like a steering wheel will require approval from federal regulators. Earlier this year, Amazon-backed Zoox managed to get an exemption and even then it has been only to demonstrate its custom-built robotaxis on public roads. Zoox is still seeking an exemption that would allow it to operate a commercial robotaxi service.\nThe regulatory process for those exemptions is a long and sticky one. General Motors tried and failed to get approval for its custom-built Cruise Origin vehicle, for example. Waymo, the dominant robotaxi service provider in the U.S., has stuck to its modified Jaguar I-Pace vehicles that still have traditional controls. Waymo is also developing a vehicle with Zeekr.\nMusk didn’t seem fazed by the potential for regulators to thwart his plans and thanked Waymo for “paving the path.”\n“I think we’ll be able to deploy all the Cybercabs that we produce,” he said in response to a shareholder question at the annual meeting. “Once it becomes like, extremely normal in cities, it’s just going to become like … the regulators will have just fewer and fewer reasons to say no.”\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  },
  {
    "title": "Tesla shareholders approve Elon Musk’s $1T pay package",
    "url": "https://techcrunch.com/2025/11/06/tesla-shareholders-approve-elon-musks-1t-pay-package/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2148555320.jpg?w=150",
    "tag": "Tech",
    "date": "2025-11-06T21:58:15.000Z",
    "description": "Tesla shareholders have overwhelmingly approved a compensation package for CEO Elon Musk that could be worth as much as $1 trillion in company shares. More than 75% of shareholders who participated voted to...",
    "body": "\nTesla shareholders have overwhelmingly approved a compensation package for CEO Elon Musk that could be worth as much as $1 trillion in company shares.\nMore than 75% of shareholders who participated voted to approve the plan, in line with the amount of support Musk has received for past pay packages. As the result was announced, shareholders in the room at Tesla’s Austin, Texas, factory began chanting: “Elon! Elon!”\nFlanked by dancing Optimus robots, Musk said Thursday that “what we’re about to embark upon is not merely a new chapter of the future of Tesla, but a whole new book.” \nUnder the deal, Musk will not be awarded $1 trillion right away. Nor will he receive a salary. But he stands to make hundreds of billions of dollars and gain more control of Tesla if he helps the company achieve a number of milestones and boost its profits along the way. Some of those hurdles will be difficult to clear. Many, though, are simply watered down versions of promises Musk has made for years.\nThe pay package is broken into 12 tranches — covering operational, adjusted profit, and market capitalization goals — each one giving more shares to Musk if those goals are reached. For instance, Tesla, which today has a market capitalization of about $1.5 trillion, will need to steadily increase that valuation and hit $8.5 trillion in a decade.\nThe vote followed two months of aggressive campaigning by Tesla, its board of directors, and many of its executives. The company repeatedly fired off public appeals for shareholders to approve the package. Chairwoman Robyn Denholm, who is typically media-shy, did multiple interviews with major news outlets and had lost some of her voice before addressing investors at Thursday’s meeting. Tesla even ran television advertisements about the vote — something it doesn’t even do for its cars.\n“Tesla is at an inflection point — I think I’ve said that 3,000 times over the last few weeks — and this last year has been a critical one in our history,” Denholm said Thursday. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nMusk encouraged shareholders to approve the package because, he claimed, it was the easiest way to hand him more voting control over the company. He currently owns around 15%, but he’s threatened (multiple times) to leave Tesla if he doesn’t wind up with around 25% control. That amount would insulate him from being pushed out and losing control of the “robot army” Tesla is building, Musk has said.\nTesla stumped for the package in part by holding up the company’s “Master Plan 4” as a visionary statement for where Musk can lead things. That document, released in September, was gauzy and unspecific — a criticism Musk even agreed with. He claimed Tesla would add more specifics to the “Plan” just a few days after it was released, but nothing has changed in the intervening months.\nTesla’s board of directors put this pay package forward in large part because the previous plan from 2018 (worth around $56 billion) was struck down by Delaware’s Chancery Court last year, after a judge ruled the company was not transparent about the negotiation process. Tesla has appealed the decision.\nEarlier this year, Tesla handed Musk $29 billion in shares to make up for the loss of the 2018 package, but said it would essentially void that amount should Tesla win on appeal.\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n"
  }
]