[
  {
    "title": "Inference startup Inferact lands $150M to commercialize vLLM",
    "url": "https://techcrunch.com/2026/01/22/inference-startup-inferact-lands-150m-to-commercialize-vllm/",
    "image": "https://techcrunch.com/wp-content/uploads/2016/10/ai-tool.png?w=150",
    "tag": "Tech",
    "date": "2026-01-22T22:42:00.000Z",
    "description": "\nIn Brief\nPosted:\n2:42 PM PST · January 22, 2026\n\nImage Credits:Askold Romanov/iStock\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe creators of the o",
    "body": "\nIn Brief\nPosted:\n2:42 PM PST · January 22, 2026\n\nImage Credits:Askold Romanov/iStock\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nThe creators of the open source project vLLM have announced that they transitioned the popular tool into a VC-backed startup, Inferact, raising $150 million in seed funding at an $800 million valuation.\nThe round was co-led by Andreessen Horowitz and Lightspeed Venture Partners, confirming TechCrunch’s earlier reporting that vLLM has raised capital from a16z.\nInferact’s debut mirrors the recent commercialization of the SGLang project as RadixArk, which sources told us secured capital at a $400 million valuation led by Accel, as we reported on Wednesday.\nAs the focus in AI shifts from training models to deploying them in applications, a process known as inference, technologies like vLLM and SGLang that make these AI tools run faster and more affordably are attracting investor attention.\nBoth vLLM and SGLang were incubated in 2023 at the UC Berkeley lab of Databricks co-founder Ion Stoica.\nInferact CEO Simon Mo, one of the project’s original creators, told Bloomberg that existing users of vLLM include Amazon’s cloud service and the shopping app.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inference startup Inferact lands $150M to commercialize vLLM",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2016/10/ai-tool.png?w=150"
      ],
      "datePublished": "2026-01-22T22:42:00.000Z",
      "dateModified": "2026-01-22T22:42:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Voice AI engine and OpenAI partner LiveKit hits $1B valuation",
    "url": "https://techcrunch.com/2026/01/22/voice-ai-engine-and-openai-partner-livekit-hits-1b-valuation/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1424498694.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T22:44:29.000Z",
    "description": "\nIn Brief\nPosted:\n2:44 PM PST · January 22, 2026\n\nImage Credits:Carol Yepes / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLiveKit, a devel",
    "body": "\nIn Brief\nPosted:\n2:44 PM PST · January 22, 2026\n\nImage Credits:Carol Yepes / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nLiveKit, a developer of infrastructure software for real-time AI voice and video applications, has announced the raise of $100 million in funding at a $1 billion valuation.\nThe round, which comes 10 months after LiveKit’s previous fundraise, was led by Index Ventures with participation from existing investors, including Altimeter Capital Management, Hanabi Capital, and Redpoint Ventures.\nLiveKit powers OpenAI’s ChatGPT voice mode. The startup’s other customers include xAI, Salesforce, Tesla, as well as 911 emergency service operators and mental health providers.\nThe company was founded in 2021 by Russ d’Sa and David Zhao as an open source software project for building apps that can transmit real-time audio and video without interruptions, in an era when the whole world was meeting on Zoom during the pandemic.\nAlthough LiveKit began as a free developer tool, the business took off after the founders realized big companies wanted a managed cloud version and began providing those services to enterprises amid the voice AI boom.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Enterprise\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Voice AI engine and OpenAI partner LiveKit hits $1B valuation",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1424498694.jpg?w=150"
      ],
      "datePublished": "2026-01-22T22:44:29.000Z",
      "dateModified": "2026-01-22T22:44:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vimeo starts layoffs after acquisition by Bending Spoons",
    "url": "https://techcrunch.com/2026/01/22/vimeo-starts-layoffs-after-acquisition-by-bending-spoons/",
    "image": "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1162218344.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T00:27:28.000Z",
    "description": "\nIn Brief\nPosted:\n4:27 PM PST · January 22, 2026\n\nImage Credits:Avishek Das/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t",
    "body": "\nIn Brief\nPosted:\n4:27 PM PST · January 22, 2026\n\nImage Credits:Avishek Das/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nVimeo, the video-hosting platform, is laying off some of its global staff, according to a report from Business Insider. The move comes shortly after the company’s acquisition by the Italian tech conglomerate Bending Spoons, which purchased it in an all-cash deal last year for $1.38 billion.\nBending Spoons confirmed the layoffs to BI but wouldn’t share how many people would lose their jobs. The Verge reports that the cutbacks will impact a “large portion” of the company’s total workforce, citing a LinkedIn post from Vimeo’s former VP of Global Brand and Creative, who stated that he, “along with a large portion of the company,” had been “impacted by layoffs.”\nTechCrunch reached out to Vimeo and Bending Spoons for more information.\nVimeo, which was founded in 2004, has struggled to find its footing in a field dominated by YouTube. In recent years, the company has leaned heavily into AI. In 2023, it announced plans to launch AI-powered script-writing and video-editing tools. This past October, the company added a suite of additional AI-powered creator tools designed to connect filmmakers’ “content directly to AI workflows.”\nIn recent years, Bending Spoons has acquired a number of other well-known tech platforms, including Meetup, Evernote, and WeTransfer.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Media & Entertainment\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vimeo starts layoffs after acquisition by Bending Spoons",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2020/11/GettyImages-1162218344.jpg?w=150"
      ],
      "datePublished": "2026-01-23T00:27:28.000Z",
      "dateModified": "2026-01-23T00:27:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft 365 hit by outage, preventing access to emails and files",
    "url": "https://techcrunch.com/2026/01/22/microsoft-365-hit-by-outage-preventing-access-to-emails-and-files/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/photo-mosh-getty-windows-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T21:31:10.000Z",
    "description": "\nIn Brief\nPosted:\n1:31 PM PST · January 22, 2026\n\nImage Credits:David Ryder / Bloomberg (PhotoMosh/modified) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t",
    "body": "\nIn Brief\nPosted:\n1:31 PM PST · January 22, 2026\n\nImage Credits:David Ryder / Bloomberg (PhotoMosh/modified) / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAn ongoing Microsoft outage is preventing enterprise customers from accessing email inboxes, files, meetings, and other Microsoft cloud services.\nThe technology giant said in a post on X around 2:30 p.m. ET that the outage was caused by a “portion of service infrastructure in North America that is not processing traffic as expected.” Microsoft didn’t provide specific details of the cause of the outage, but said it was “working to restore the infrastructure to a healthy state to achieve recovery.”\nMicrosoft said on its status page that the outage affects its Exchange Online email service, searching files within SharePoint Online or OneDrive, and creating chats, meetings, or adding members in its video meeting platform, Teams.\nThe outage also prevents admins from accessing their Microsoft Purview and Defender XDR security dashboards and their admin centers.\nWe’ll reach out to Microsoft for comment — as soon as our email, which is hosted by Microsoft, returns to normal. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Security\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft 365 hit by outage, preventing access to emails and files",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/photo-mosh-getty-windows-logo.jpg?w=150"
      ],
      "datePublished": "2026-01-22T21:31:10.000Z",
      "dateModified": "2026-01-22T21:31:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tesla launches robotaxi rides in Austin with no human safety driver",
    "url": "https://techcrunch.com/2026/01/22/tesla-launches-robotaxi-rides-in-austin-with-no-human-safety-driver/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2220716767.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T18:51:43.000Z",
    "description": "\nIn Brief\nPosted:\n10:51 AM PST · January 22, 2026\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTesla is offering passengers ",
    "body": "\nIn Brief\nPosted:\n10:51 AM PST · January 22, 2026\n\nImage Credits:Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nTesla is offering passengers robotaxi rides in Austin without a human safety driver in the front seat.\nCEO Elon Musk on Thursday posted on X, his social media platform: “Just started Tesla Robotaxi drives in Austin with no safety monitor in the car. Congrats to the Tesla AI team!” \nHe then made a recruitment pitch for engineers interested in “solving real-world AI,” which he says will “likely lead to AGI” to join the Tesla AI team. \nThe automaker launched its robotaxis in the Texas city last June in a limited deployment with a safety operator in the front passenger seat. Tesla initially offered those first rides to influencers and handpicked customers. In December, Tesla began testing its robotaxis in Austin without a safety driver in the front seat — a precaution in case the vehicle needs a human to take over.\nNot all of Tesla’s fleet in Austin will be fully driverless. Per Tesla’s AI lead Ashok Elluswamy, the company will be “starting with a few unsupervised vehicles mixed in with the broader robotaxi fleet with safety monitors, and the ratio will increase over time.”\nTesla is charging for the rides, according to one rider who posted on X. There also appears to be a chase car following the driverless vehicles. \nSome of Tesla’s rivals, like Zoox and Waymo, did not immediately charge for driverless rides upon initial deployment.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTechCrunch has attempted to reach out to Tesla for clarification. \nThe article has been updated to reflect new information, including that Tesla is charging for the rides. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Transportation\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tesla launches robotaxi rides in Austin with no human safety driver",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/GettyImages-2220716767.jpg?w=150"
      ],
      "datePublished": "2026-01-22T18:51:43.000Z",
      "dateModified": "2026-01-22T18:51:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta seeks to limit evidence in child safety case",
    "url": "https://techcrunch.com/2026/01/22/meta-seeks-to-limit-evidence-in-child-safety-case/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/Meta-Connect-2024-09-25-at-1.57.52PM.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T18:40:01.000Z",
    "description": "\nIn Brief\nPosted:\n10:40 AM PST · January 22, 2026\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta is about to go on trial in New Mexico, accused of ",
    "body": "\nIn Brief\nPosted:\n10:40 AM PST · January 22, 2026\n\n\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta is about to go on trial in New Mexico, accused of not doing enough to protect kids from sexual exploitation on its platforms. As the court date gets closer, Meta’s lawyers are working hard to limit what can be used against the company in court. \nAccording to public records reviewed by Wired, the company wants to block research about social media’s impact on youth mental health, stories about teen suicides linked to social media, any mention of Meta’s finances, the company’s past privacy violations, and even things about CEO Mark Zuckerberg’s college years.\nThese efforts are part of a lawsuit filed by New Mexico attorney general Raúl Torrez in late 2023. The state accuses Meta of failing to protect minors from online predators, trafficking, and sexual abuse on its platforms. The case claims Meta allegedly allowed explicit material to reach minors and didn’t put adequate child safety measures in place. \nNotably, this lawsuit is considered the first trial of its kind at the state level, scheduled to begin on February 2.\nIt’s fairly standard that Meta would try to keep the case as narrow as possible. However, two legal experts who talked to Wired believe the company’s attempt to keep out so much information is unusually broad, including its requests not to mention its AI chatbots.\nAdditionally, Meta requested that the court block any mention of a public health warning issued by former U.S. surgeon general Vivek Murthy regarding social media’s effect on youth mental health. The company also doesn’t want surveys (including its own) about the amount of inappropriate content on its platforms. It argues that all this information is irrelevant or could unfairly sway the jury.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Government & Policy\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta seeks to limit evidence in child safety case",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/09/Meta-Connect-2024-09-25-at-1.57.52PM.jpg?w=150"
      ],
      "datePublished": "2026-01-22T18:40:01.000Z",
      "dateModified": "2026-01-22T18:40:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ring is adding a new content verification feature to videos",
    "url": "https://techcrunch.com/2026/01/22/ring-is-adding-a-new-content-verification-feature-to-videos/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/01/AP_19198645983580.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T19:50:47.000Z",
    "description": "\nIt’s going to be more difficult to fake or manipulate Ring camera video footage going forward. On Thursday, the Amazon-owned device maker introduced ",
    "body": "\nIt’s going to be more difficult to fake or manipulate Ring camera video footage going forward. On Thursday, the Amazon-owned device maker introduced Ring Verify, a new video authenticity feature that will allow anyone to determine whether a video has been altered in any way.\nThe company says this could be useful when you come across shared videos, like those sent to you by a neighbor or those purporting to show some sort of incident.\nWhile you may not be able to instantly identify whether some TikTok video was AI-generated — like bunnies jumping on a trampoline, for instance — you will be alerted to any changes to a Ring video that someone has shared with you directly.\nImage Credits:Ring\n“Think of it like the tamper-evident seal on a medicine bottle — if anyone changes the video in any way, even something small like trimming a few seconds or adjusting the brightness, the seal breaks,” Ring explained in its announcement.\nThe verification feature will be automatically enabled on every video recorded with a Ring device from December 2025 onward, the company notes. Any changes or edits, including cropping and filters, will break that verification seal. Ring says this includes videos uploaded to sharing sites that compress footage.\nFailing verification doesn’t necessarily mean the video is fake. It’s just a signal that it has been altered. Maybe someone boosted the brightness for visibility, or it could mean the video was recorded before December 2025.\nImage Credits:Ring\nIn the case of a failed verification, recipients can request a copy of the unedited video. Ring suggests this could be useful for purposes like insurance claims.\nThe verification feature, which is built on C2PA (Coalition for Content Provenance and Authenticity) industry standards, will be present on all videos downloaded or shared from Ring’s cloud, regardless of the specific device that captured the footage. But the company notes that content verification will not be compatible with videos recorded using end-to-end encryption — those will always show as “not verified,” it said. \nTo verify footage, Ring will be able to visit the website Ring.com/verify and submit their video link and get instant results.\nAt the time of publication, TechCrunch noticed the verification website was not yet up and running. The coma y says the correct URL is http://www.ring.com/pages/verify and its blog had it listed incorrectly. \nThe company’s announcement was also delayed due to the outage with Microsoft 365 today, a rep for Ring said.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ring is adding a new content verification feature to videos",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/01/AP_19198645983580.jpg?w=150"
      ],
      "datePublished": "2026-01-22T19:50:47.000Z",
      "dateModified": "2026-01-22T19:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GM to end Chevy Bolt EV production next year, move China-made Buick to US factory",
    "url": "https://techcrunch.com/2026/01/22/gm-to-end-chevy-bolt-ev-production-next-year-move-china-made-buick-to-u-s-factory/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Chevrolet-Bolt-2027-DriverFront.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T23:55:44.000Z",
    "description": "\n\t\n\t\tImage Credits:GM\t\n\t\n\t\t\t\t\t\t3:55 PM PST · January 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nGeneral Motors is shuffling where its vehicles are made in a move that w",
    "body": "\n\t\n\t\tImage Credits:GM\t\n\t\n\t\t\t\t\t\t3:55 PM PST · January 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nGeneral Motors is shuffling where its vehicles are made in a move that will shift production away from China and Mexico and to a U.S. factory in Kansas. That change will also mean the end of its rebooted Chevrolet Bolt EV, the only vehicle currently built at the Fairfax Assembly Plant in Kansas.\nThe factory musical chairs reflect an economic and political environment, shaped by the Trump administration’s tariff policy and its decision to end the federal EV tax credit, which provided up to $7,500 off qualifying electric vehicles. These changes have made it more expensive to build vehicles in China and Mexico that are then sold in the United States.\nProduction of the 2027 Chevy Bolt EV, which landed in dealerships this month, is expected to end in about a year and a half. The new Chevy Bolt EV, which is priced at $29,990 including the destination fee, is one of the most affordable new EVs available to U.S. consumers.\nGM confirmed to TechCrunch that the next-generation Buick Envision, currently built in China, will move to the Fairfax Assembly Plant in Kansas, beginning in 2028. The gas-powered Chevrolet Equinox, which is made in the San Luis Potosí plant in Mexico, will move to the Kansas factory in mid-2027.\nThe Bolt, meanwhile, will have a short life if GM follows through with its previously announced plans.\n“When we revealed Bolt in October, we said and it was widely reported that it’d be a limited run model,” a GM spokesperson said in a statement sent to TechCrunch. “We had also previously announced the gas-powered Equinox would be coming to Fairfax in mid 2027 after Bolt production ramps down. Today we’re announcing the next-generation Buick compact SUV will come to Fairfax beginning in 2028.”\nThe company still sells other EVs, including an electric Chevy Equinox and Chevy Blazer. The question is whether GM will change course and save the Bolt if sales are better than expected. We do know that GM has promised to make new future investments in Fairfax Assembly for its next generation of affordable EVs. We just don’t know when. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GM to end Chevy Bolt EV production next year, move China-made Buick to US factory",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Chevrolet-Bolt-2027-DriverFront.jpg?w=150"
      ],
      "datePublished": "2026-01-22T23:55:44.000Z",
      "dateModified": "2026-01-22T23:55:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI is coming for those sweet enterprise dollars in 2026",
    "url": "https://techcrunch.com/2026/01/22/openai-is-coming-for-those-sweet-enterprise-dollars-in-2026/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2213399157.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-23T00:52:33.000Z",
    "description": "\nOpenAI has reorganized some of its leadership and picked a familiar face to lead its push into selling AI to business customers as the company looks ",
    "body": "\nOpenAI has reorganized some of its leadership and picked a familiar face to lead its push into selling AI to business customers as the company looks to catch up to its rivals in 2026.\nThe company appointed Barret Zoph to lead its efforts to sell its AI to enterprises, according to reporting from The Information, citing an internal OpenAI memo.\nTechCrunch reached out to OpenAI for confirmation and more information.\nZoph returned to OpenAI last week after leaving Thinking Machine Labs, former OpenAI co-founder Mira Murati’s AI startup where Zoph had served as a co-founder and chief technology officer since October 2024.\nThe exact circumstances of his departure aren’t clear, with rumors swirling about whether Zoph and a few other former OpenAI employees were fired or left on their own accord, possibly with plans to return to OpenAI all along.\nZoph was previously the vice president of post-training inference at OpenAI from September 2022 to October 2024. He’s stepping into a very different position and will likely play an important role at the company as it looks to grow its enterprise business — an area where it is losing ground to competitors.\nOpenAI launched its enterprise-focused ChatGPT Enterprise product in 2023 more than a year before Anthropic, and multiple years before Google, launched their enterprise offerings. The company claims the product has more than 5 million business users and counts companies including SoftBank, Target and Loewe’s as customers.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nBut its market share is falling while its rivals are climbing.\nAnthropic holds a dominant lead over its AI rivals when it comes to enterprise large language model usage. The AI research lab holds a 40% market share, according to a December report from VC firm Menlo Ventures (which, it should be noted, has invested aggressively in Anthropic). In July, the startup’s market share was estimated to be 32%.\nGoogle’s Gemini adoption has been steadier, says Menlo Ventures. The company released its enterprise product last fall and has seen its enterprise LLM usage market share largely stay the same, grow from 20% in July to 21% at the end of the year.\nOpenAI on the other hand has seen its usage market share drop from 50% in 2023 to 27% at the end of 2025 — a trend that appears to concern the company. OpenAI CEO Sam Altman expressed concern that Google Gemini’s growth was starting to encroach on OpenAI in an internal memo a few months ago.\nEnterprise growth is an area of focus for the company in 2026, OpenAI’s CFO Sarah Friar wrote in a blog post on Sunday.\nThe company has since announced an expanded multi-year partnership with ServiceNow that will give ServiceNow customers access to OpenAI models.\n\n\n\t\tBecca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal.\r\nYou can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI is coming for those sweet enterprise dollars in 2026",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-2213399157.jpg?w=150"
      ],
      "datePublished": "2026-01-23T00:52:33.000Z",
      "dateModified": "2026-01-23T00:52:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google DeepMind CEO is ‘surprised’ OpenAI is rushing forward with ads in ChatGPT",
    "url": "https://techcrunch.com/2026/01/22/google-deepmind-ceo-is-surprised-openai-is-rushing-forward-with-ads-in-chatgpt/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/videoframe_271754.png?w=150",
    "tag": "Tech",
    "date": "2026-01-22T19:41:01.000Z",
    "description": "\nGoogle DeepMind CEO Demis Hassabis said he’s “surprised” that OpenAI has already moved to introduce ads within its AI chatbot. In an interview with A",
    "body": "\nGoogle DeepMind CEO Demis Hassabis said he’s “surprised” that OpenAI has already moved to introduce ads within its AI chatbot. In an interview with Axios at Davos, the AI leader was responding to a question about using ads to monetize AI services, saying the idea is something that the team at Google was thinking through “very carefully.”\nHassabis also said that his team wasn’t feeling pressure from the tech giant to make “a knee-jerk” decision around advertising, despite how key ads are to Google’s core business.\nThe DeepMind co-founder’s remarks followed Friday’s news that OpenAI will begin testing ads as a way to generate additional revenue from the portion of the AI chatbot’s 800 million weekly active users who don’t have a paid subscription. \nWhile OpenAI may have been forced to consider ads, considering its growing infrastructure and energy costs, its decision could change how users view the service.\n“I’m a little bit surprised they’ve moved so early into that,” Hassabis said, referring to OpenAI’s adoption of ads. “I mean, look, ads, there’s nothing wrong with ads…they funded much of the consumer internet. And if done well, they can be useful,” he clarified.\n“But in the realm of assistants, and if you think of the chatbot as an assistant that’s meant to be helpful — and ideally, in my mind, as they become more powerful, the kind of technology that works for you as the individual…there is a question about how ads fit into that model?… You want to have trust in your assistant, so how does that work?” he questioned.\nReiterating some early comments from another Davos interview, Hassabis also said that Google didn’t have “any current plans” to do ads in its AI chatbot. Instead, the company would monitor the situation to see how users respond.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nOf course, we’ve already seen consumer backlash to the idea of ads infiltrating people’s conversations with AI assistants. When OpenAI last month began exploring a feature that suggested apps to try during users’ chats, for instance, people reacted negatively, saying these suggestions felt like intrusive ads. Shortly after, OpenAI turned off the app suggestions, which it claimed were not actually ads as they had “no financial component.”\nBut whether or not money had exchanged hands was not what made users angry. Rather, it was how the app suggestions degraded the quality of the experience.\nThat’s something that also concerns Hassabis, his remarks suggested. \nHe explained that using a chatbot is a much different experience than using Google Search. With Search, Google already understands a user’s intent, so it can show potentially useful ads. Chatbots, on the other hand, are meant to become helpful digital assistants that know about you and can help you with many aspects of your life, he said. \n“I think that’s very different from the search use case. So I think there, that has to be thought through very carefully,” he added. \nMaking Gemini more useful to each user is also the focus of newly launched personalization features announced today for Google’s AI Mode. Now, users can opt into having Gemini’s AI tap into their Gmail and Photos for tailored responses in Search’s AI Mode, similar to how Gemini’s app just added a Personal Intelligence feature that can reference users’ Gmail, Photos, Search, and YouTube history.\nWhile personalized ad targeting is a business that sustains the free web, pushing an ad on the user while they’re in a conversation with an AI assistant can feel off-putting. It’s why customers rejected Amazon’s earlier attempts to infuse ads into its Alexa experience — they wanted an assistant, not a personal shopper hawking things for them to buy. \nHassabis said he wasn’t feeling top-down pressure to force ads into the AI product, either, though he admitted there may be a way to do them right later on. \n“We don’t feel any immediate pressure to make knee-jerk decisions like that — I think that’s been the history of what we’ve done at DeepMind — is be very scientific, and rigorous, and thoughtful about each step that we take — be that the technology itself or the product,” he noted.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google DeepMind CEO is ‘surprised’ OpenAI is rushing forward with ads in ChatGPT",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/videoframe_271754.png?w=150"
      ],
      "datePublished": "2026-01-22T19:41:01.000Z",
      "dateModified": "2026-01-22T19:41:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Substack launches a TV app",
    "url": "https://techcrunch.com/2026/01/22/substack-launches-a-tv-app/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/substack-on-a-phone.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T18:58:50.000Z",
    "description": "\nSubstack, a platform known primarily for newsletters, is launching a TV app for Apple TV and Google TV. The company announced on Thursday that the be",
    "body": "\nSubstack, a platform known primarily for newsletters, is launching a TV app for Apple TV and Google TV. The company announced on Thursday that the beta app will allow subscribers to watch video posts and livestreams on TV created by authors on its platform.\nThe TV app features a TikTok-like “For You” row that will highlight videos from these creators, along with recommended videos.\nFree and paid subscribers can now start using the TV app, with access based on their subscription tier. Substack plans to add paid content previews for free subscribers in the future. The platform also plans to add audio posts and read-alouds, enhanced search and discovery features, in-app upgrades to paid subscriptions, and dedicated sections for each publication where subscribers can explore all videos from a specific creator.\nThe move comes as Substack has been investing more heavily in video and livestreaming, as it looks to compete with platforms like YouTube and Patreon for both creators and viewers.\nSubstack began its push into video with the launch of video posts back in 2022. It then started allowing creators to monetize videos early last year. Around the same time, it rolled out livestreaming capabilities to all publishers. The company has also embraced short-form video, launching a TikTok-like video feed in its app in March 2025.\n“Substack is the home for the best longform—work creators put real care into and subscribers choose to spend time with,” the company wrote in a blog post. “Now these thought-provoking videos and livestreams have a natural home on the TV, where subscribers can settle in for the extended viewing that great video deserves.”\nWhile Substack sees the launch as the next step in its video ambitions, comments on its announcement tell another story. The top comment on the company’s blog post reads: “Please don’t do this. This is not YouTube. Elevate the written word.” Another popular comment reads: “You guys have gone from saying Substack is the best home for longform writing/writers to ‘Substack is the home for the best longform—work…’. I get trying to evolve, but this just seems like another venture capital-fueled idea.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nOther comments reflect a similar sentiment, questioning why the platform appears to be shifting its focus from writing to video. \nIt’s worth noting that Substack isn’t the only platform pushing into the living room, as Instagram recently launched IG for TV, a new experience that lets users watch Reels on TV, starting with Amazon Fire TV.\n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Substack launches a TV app",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/substack-on-a-phone.jpg?w=150"
      ],
      "datePublished": "2026-01-22T18:58:50.000Z",
      "dateModified": "2026-01-22T18:58:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google now offers free SAT practice exams, powered by Gemini",
    "url": "https://techcrunch.com/2026/01/22/google-now-offers-free-sat-practice-exams-powered-by-gemini/",
    "image": "https://techcrunch.com/wp-content/uploads/2021/02/GettyImages-1250037548.jpeg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T18:27:36.000Z",
    "description": "\n\t\n\t\tImage Credits:Carol Yepes / Getty Images\t\n\t\n\t\t\t\t\t\t10:27 AM PST · January 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nPrepping for the SAT is nobody’s idea of fun, b",
    "body": "\n\t\n\t\tImage Credits:Carol Yepes / Getty Images\t\n\t\n\t\t\t\t\t\t10:27 AM PST · January 22, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nPrepping for the SAT is nobody’s idea of fun, but Google aims to make it less stressful with AI. The company announced that it’s now focusing its AI education efforts on standardized testing with free SAT practice exams powered by Gemini. \nStudents can prompt Gemini by typing “I want to take a practice SAT test,” and the AI will provide them with a free practice exam. Gemini then analyzes the results, highlighting strengths and identifying areas that need further review. It also offers detailed explanations for any incorrect answers. \nImage Credits:Google\nThe company said it partnered with education companies like the Princeton Review to ensure the content is vetted and that students are working with questions that closely mirror what they will encounter on the actual SAT.\nThis recent move by Google is viewed as a game-changer for students who can’t readily access personalized SAT tutoring. By making SAT prep free, Google is trying to open the door for more students to compete on equal footing. However, it also sparks a broader conversation about the role of AI in education and just how much we want AI to shape how students learn.\nThe adoption of AI in education is not without controversy. Many teachers worry that students might end up leaning too heavily on tools like Gemini and ChatGPT to get their work done. If students let AI do all the thinking, it could chip away at their problem-solving skills. There are even studies out there that back this up, suggesting that relying too much on AI can actually weaken students’ ability to think critically and tackle challenges on their own.\nLet’s also not forget about human SAT tutors. Free AI-powered exam prep poses a significant threat to the traditional tutoring industry, which has long thrived on providing personalized coaching to college-bound students. With Google offering a free alternative, the job security of private SAT tutors may be at risk.\nThis news follows Google’s recent launch of a Gemini-powered feature that lets teachers create podcast-style audio lessons, which could help catch the attention of Gen Z students. Other available Gemini tools include features that help teachers brainstorm ideas, build lesson plans, and tailor learning materials for their classes.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google now offers free SAT practice exams, powered by Gemini",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2021/02/GettyImages-1250037548.jpeg?w=150"
      ],
      "datePublished": "2026-01-22T18:27:36.000Z",
      "dateModified": "2026-01-22T18:27:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo continues robotaxi ramp up with Miami service now open to public",
    "url": "https://techcrunch.com/2026/01/22/waymo-continues-robotaxi-ramp-up-with-miami-service-now-open-to-public/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/Waymo-CES-korosec.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T16:59:02.000Z",
    "description": "\nWaymo robotaxis can now be hailed by the public in Miami. \nThe company said Thursday it will initially open the service, on a rolling basis, to the n",
    "body": "\nWaymo robotaxis can now be hailed by the public in Miami. \nThe company said Thursday it will initially open the service, on a rolling basis, to the nearly 10,000 local residents on its waitlist. Once accepted, riders will be able to hail a robotaxi within a 60-square-mile service area in Miami that covers neighborhoods such as the Design District, Wynwood, Brickell, and Coral Gables. \nWaymo said it plans to eventually expand to Miami International Airport, but didn’t provide a timeline beyond that it was coming “soon.”\nWaymo has had a presence in Miami for months in the lead-up to the commercial launch. After mapping and then testing its autonomous vehicles on Miami’s public roads, the company removed safety operators from the fleet in November. The driverless service was initially open to employees.\nImage Credits:Waymo\nThis phased approach is part of Waymo’s launch playbook, and one that is being implemented far more often than even a year ago. Waymo first opened its robotaxis to the general public in Phoenix in 2020. It expanded to San Francisco and Los Angeles and eventually opened it to all riders in 2024. As the company continued to expand in those metro areas — pushing into the larger Bay Area and into Silicon Valley, for example — it also opened in new markets. \nWaymo opened a robotaxi service in spring 2025 in partnership with Uber in Atlanta and Austin, and expanded its service area in existing markets to include freeways. \nWaymo has laid out an aggressive plan to bring its robotaxi service to nearly a dozen more cities over the next year. Those plans include Dallas, Denver, Detroit, Houston, Las Vegas, Nashville, London, San Diego, Seattle, and Washington, D.C. The company has already started testing in some of those cities using a mix of its all-electric Jaguar I-Pace vehicles and newer Zeekr RT vans that have been rebranded “Ojai.”\nWaymo co-CEO Tekedra Mawakana said during an interview at TechCrunch Disrupt last October that “by the end of 2026, you should expect us to be offering 1 million trips per week.” \nThe expansion hasn’t been without problems. Residents in cities like San Francisco have captured video of Waymo vehicles creating traffic jams, notably during a widespread power outage in December. \nIt has also gotten the attention of federal safety regulators.  \nThe National Highway Traffic and Safety Administration’s Office of Defects Investigation (ODI) opened an initial investigation into the company last October over how its robotaxis operated around a stopped school bus in Atlanta. School district officials in Austin have shared video and complaints around the same issue of Waymo moving past school buses even when the lights are on and the stop sign is deployed.\nThe company has issued a voluntary software recall to fix that issue. However, new videos, which show Waymos illegally passing school buses, suggest the problem has not been resolved.\n\n\n\t\tKirsten Korosec is a reporter and editor who has covered the future of transportation from EVs and autonomous vehicles to urban air mobility and in-car tech for more than a decade. She is currently the transportation editor at TechCrunch and co-host of TechCrunch’s Equity podcast. She is also co-founder and co-host of the podcast, “The Autonocast.” She previously wrote for Fortune, The Verge, Bloomberg, MIT Technology Review and CBS Interactive.\nYou can contact or verify outreach from Kirsten by emailing kirsten.korosec@techcrunch.com or via encrypted message at kkorosec.07 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo continues robotaxi ramp up with Miami service now open to public",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/Waymo-CES-korosec.jpg?w=150"
      ],
      "datePublished": "2026-01-22T16:59:02.000Z",
      "dateModified": "2026-01-22T16:59:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google’s AI Mode can now tap into your Gmail and Photos to provide tailored responses",
    "url": "https://techcrunch.com/2026/01/22/googles-ai-mode-can-now-tap-into-your-gmail-and-photos-to-provide-tailored-responses/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/ai-mode-google.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T16:00:00.000Z",
    "description": "\nAI Mode, Google’s conversational Search feature for complex questions, is getting more personalized. The tech giant announced on Thursday that it’s b",
    "body": "\nAI Mode, Google’s conversational Search feature for complex questions, is getting more personalized. The tech giant announced on Thursday that it’s bringing “Personal Intelligence” to AI Mode, enabling it to tap into your Gmail and Google Photos to provide more individualized responses.\nThe company debuted Personal Intelligence last week in the Gemini app to allow the AI assistant to tailor its responses by connecting across your Google ecosystem, starting with Gmail, Photos, Search, and YouTube history.\nThe opt-in feature is now starting to roll out to AI Mode to Google AI Pro and AI Ultra subscribers in English in the U.S. \nBy bringing Personal Intelligence to Gemini and AI Mode, Google is leveraging the wealth of user data already within its ecosystem. Since users already rely on services like Gmail and Photos, Google can deliver more personalized experiences that rivals can’t easily match. Of course, not everyone wants AI looking at their photos and emails, so you can turn Personal Intelligence on or off at any time.\n“With Personal Intelligence, recommendations don’t just match your interests — they fit seamlessly into your life,” Robby Stein, VP of Product, Google Search, explained in a blog post. “You don’t have to constantly explain your preferences or existing plans, it selects recommendations just for you, right from the start.”\nImage Credits:Google\nSay you’re planning a vacation and searching for things to do and places to eat that everyone in your family will enjoy. With Personal Intelligence, AI Mode can draw on your hotel booking in Gmail and past travel memories in Google Photos to suggest a tailored itinerary with something for everyone. For example, you might see recommendations like an old-timey ice cream parlor based on the many ice cream selfies stored in Google Photos.\nGoogle notes that AI Mode won’t just give you a generic list of restaurants and activities; it instead provides a personalized starting point for planning.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Personal Intelligence can also be particularly helpful for shopping, because AI Mode considers the types of items you buy and where you shop,” Stein wrote. “If you need a new coat for your upcoming trip, AI Mode could automatically take into account the brands you prefer, as well as your flight confirmation in Gmail to identify the destination and timing (Chicago in March). You’ll get suggestions for windproof, versatile coats that fit the weather and your preferred look. It’s like a personal shopper who already knows your itinerary and the vibe you’re going for.”\nGoogle says other questions you could ask are: “Make a scavenger hunt for [partner’s name] to celebrate our anniversary. For each location, include a hint about us,” or “I’m decorating [child’s name ]’s bedroom, give me ideas for a theme and suggestions for decor.”\nThe company notes that AI Mode doesn’t train directly on your Gmail inbox or Google Photos library. Instead, it trains on specific prompts and the model’s responses. \n\n\n\t\tAisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University.\nYou can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google’s AI Mode can now tap into your Gmail and Photos to provide tailored responses",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/01/ai-mode-google.jpg?w=150"
      ],
      "datePublished": "2026-01-22T16:00:00.000Z",
      "dateModified": "2026-01-22T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Struggling fusion power company General Fusion to go public via $1B reverse merger",
    "url": "https://techcrunch.com/2026/01/22/struggling-fusion-power-company-general-fusion-to-go-public-via-1b-reverse-merger/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/03/General-Fusion-LM26.jpg?w=150",
    "tag": "Tech",
    "date": "2026-01-22T17:00:25.000Z",
    "description": "\nLast year, fusion power startup General Fusion was struggling to raise funds, laying off at least 25% of its staff before receiving a $22 million lif",
    "body": "\nLast year, fusion power startup General Fusion was struggling to raise funds, laying off at least 25% of its staff before receiving a $22 million lifeline investment while it figured out how to keep the company afloat.\nToday, General Fusion revealed its survival plan: It will go public through a reverse merger with a special purpose acquisition company, Spring Valley III, combined with additional investment from institutional investors. It’s a significant change in fortunes for a company whose CEO wrote a public letter just last year pleading for funding.\nIf the deal closes as planned, General Fusion could receive up to $335 million from the transaction, more than double what it was reportedly seeking to raise last year before it landed the $22 million lifeline.\nThe transaction will value the combined company at about $1 billion, General Fusion said. Before the merger was announced. The fusion startup, which was founded in 2002, had previously raised over $440 million, according to PitchBook.\nGeneral Fusion plans to use the money to complete its demonstration reactor, Lawson Machine 26 (LM26). The device uses an approach called “magnetized target fusion,” which works by compressing a fuel pellet until its atoms fuse together, releasing energy in the process. The National Ignition Facility used inertial confinement in its successful fusion experiments, using lasers to bombard the fuel pellets to unleash the compressive force.\nLM26 eschews the lasers, though. Instead, it uses steam-driven pistons that drive a wall of liquid lithium metal inward to compress the fuel pellet. That liquid lithium then circulates through a heat exchanger, which generates steam to spin a generator. By avoiding expensive lasers or superconducting magnets, which are required in other fusion reactor designs, General Fusion hopes to build a fusion power plant for less money. But first the company has to prove its approach is viable.\nLast year, before it revealed its financial problems, General Fusion said that in 2026, LM26 would hit scientific breakeven, in which a fusion reaction generates more power than was required to start it. Scientific breakeven is a key milestone, though distinct from and easier to attain than commercial breakeven, in which fusion reactions release enough energy to export electricity to the grid. In an email to TechCrunch, General Fusion said it was now aiming to reach breakeven in 2028.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 13-15, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThe acquisition company, Spring Valley, is something of a specialist in reverser mergers with energy companies. It previously took NuScale Power, a small modular nuclear reactor company, public in a deal whose stock price has since fallen more than 50% from its peak last year. The firm is also in the midst of completing a merger with Eagle Energy Metals, a uranium mining company that’s also supposedly developing its own SMR.\nGeneral Fusion isn’t the first fusion company to go public. In December, TAE Technologies announced it would merge with Trump Media & Technology Group in a deal valuing the combined company at more than $6 billion.\nThe common thread connecting these deals is data centers, of course. They’re expected to consume nearly 300% more power by 2035, according to BloombergNEF, and General Fusion explicitly points to rising data center energy demand in its merger announcement. \nBut the company also pointed to broader electrification trends, including EVs and electric heating, that could increase overall electricity demand by up to 50% by 2035. It’s a reminder that, while the Trump administration has cast doubts on an electrified future, other countries are charging ahead. While General Fusion may face technological challenges, trends in the energy world suggest that if it can deliver fusion power at a reasonable cost, it will find plenty of willing buyers.\nUpdate: 1:50 pm ET: Added comment from General Fusion regarding new breakeven target date.\n\n\n\t\tTim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. \r\nDe Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College.\r\nYou can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Struggling fusion power company General Fusion to go public via $1B reverse merger",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/03/General-Fusion-LM26.jpg?w=150"
      ],
      "datePublished": "2026-01-22T17:00:25.000Z",
      "dateModified": "2026-01-22T17:00:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]