[
  {
    "title": "Meta plans to add facial recognition to its smart glasses, report claims",
    "url": "https://techcrunch.com/2026/02/13/meta-plans-to-add-facial-recognition-to-its-smart-glasses-report-claims/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/05/meta-smart-glasses.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T14:58:39.000Z",
    "description": "\nIn Brief\nPosted:\n6:58 AM PST · February 13, 2026\n\nImage Credits:Meta\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta plans to add facial recognition ",
    "body": "\nIn Brief\nPosted:\n6:58 AM PST · February 13, 2026\n\nImage Credits:Meta\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nMeta plans to add facial recognition to its smart glasses as soon as this year, according to a new report from The New York Times. The feature, internally known as “Name Tag,” would allow smart glasses wearers to identify people and get information about them through Meta’s AI assistant.\nMeta’s plans could change, the report notes. The tech giant has been deliberating since early last year on how to release a feature that carries “safety and privacy risks.”\nAccording to an internal memo, the company had originally planned to release Name Tag to attendees of a conference for the visually impaired before releasing it to the public, but didn’t end up doing that. \nMeta reportedly saw the political tumult in the United States as a good time to release the feature. \n“We will launch during a dynamic political environment where many civil society groups that we would expect to attack us would have their resources focused on other concerns,” the document reads.\nMeta considered adding facial recognition technology to the first version of its Ray-Ban smart glasses back in 2021, but dropped the plans over technical challenges and ethical concerns. The NYT reports that the company has revived its plans as the Trump administration has grown closer to Big Tech, and following the unexpected success of its smart glasses.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Hardware\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta plans to add facial recognition to its smart glasses, report claims",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/05/meta-smart-glasses.jpg?w=150"
      ],
      "datePublished": "2026-02-13T14:58:39.000Z",
      "dateModified": "2026-02-13T14:58:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cohere’s $240M year sets stage for IPO",
    "url": "https://techcrunch.com/2026/02/13/coheres-240m-year-sets-stage-for-ipo/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-1251294520.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T15:03:10.000Z",
    "description": "\nIn Brief\nPosted:\n7:03 AM PST · February 13, 2026\n\nImage Credits:Pavlo Gonchar/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t",
    "body": "\nIn Brief\nPosted:\n7:03 AM PST · February 13, 2026\n\nImage Credits:Pavlo Gonchar/SOPA Images/LightRocket / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nAs the top AI labs like Google, Anthropic, and OpenAI chase enterprise adoption, Canadian AI startup Cohere has been quietly cleaning up.\nThe startup told investors in a memo that it surpassed its $200 million annual recurring revenue target in 2025, hitting $240 million with quarter-over-quarter growth of more than 50% throughout the year, per CNBC.\nCohere was founded in 2019 and has the backing of enterprise tech investors like Nvidia, AMD, and Salesforce. The startup’s core tech is its Command family of generative AI models, which Cohere says are efficient enough to be deployed on limited GPUs — an attractive promise for enterprises looking to get a handle on cost and resource management. \nLast summer, Cohere launched North, a higher-level enterprise platform and AI workspace for secure, custom AI agents and workflows built on Cohere’s models. \nCohere’s CEO Aidan Gomez said last October that the startup may IPO “soon.” If “soon” means in 2026, Cohere may be contending against OpenAI, Anthropic, and SpaceX/xAI, which are all reportedly weighing their own public debuts.\nTechCrunch has reached out to Cohere for comment. \n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cohere’s $240M year sets stage for IPO",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/08/GettyImages-1251294520.jpg?w=150"
      ],
      "datePublished": "2026-02-13T15:03:10.000Z",
      "dateModified": "2026-02-13T15:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI removes access to sycophancy-prone GPT-4o model",
    "url": "https://techcrunch.com/2026/02/13/openai-removes-access-to-sycophancy-prone-gpt-4o-model/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T18:10:00.000Z",
    "description": "\nIn Brief\nPosted:\n10:10 AM PST · February 13, 2026\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n",
    "body": "\nIn Brief\nPosted:\n10:10 AM PST · February 13, 2026\n\nImage Credits:Silas Stein/picture alliance / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nStarting Friday, OpenAI will cease providing access  to five legacy ChatGPT models, including the popular but controversial GPT-4o model.\nThe 4o model has been at the center of a number of lawsuits concerning user self-harm, delusional behavior, and AI psychosis. It remains OpenAI’s highest scoring model for sycophancy.\nIn addition to GPT-4o, the GPT-5, GPT-4.1, GPT-4.1 mini, and OpenAI o4-mini models have also been deprecated.\nOpenAI intended to retire GPT-4o in August, when it unveiled the GPT-5 model. But at the time, there was enough backlash for OpenAI to keep the legacy model available for paid subscribers, who could manually choose to interact with that model. In a recent blog post, OpenAI noted that only 0.1% of customers have been using GPT-4o, but for a company with 800 million weekly active users, that small percentage still amounts to 800,000 people.\nThousands of users have rallied against the retirement of 4o, citing their close relationships with the model.\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in AI\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI removes access to sycophancy-prone GPT-4o model",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=150"
      ],
      "datePublished": "2026-02-13T18:10:00.000Z",
      "dateModified": "2026-02-13T18:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fintech lending giant Figure confirms data breach",
    "url": "https://techcrunch.com/2026/02/13/fintech-lending-giant-figure-confirms-data-breach/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/figure-technology-logo-times-squware.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T21:02:46.000Z",
    "description": "\nIn Brief\nPosted:\n1:02 PM PST · February 13, 2026\n\nImage Credits:Michael Nagle/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFig",
    "body": "\nIn Brief\nPosted:\n1:02 PM PST · February 13, 2026\n\nImage Credits:Michael Nagle/Bloomberg / Getty Images\n\n\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\n\nFigure Technology, a blockchain-based lending company, confirmed it experienced a data breach.\nOn Friday, Figure spokesperson Alethea Jadick told TechCrunch in a statement that the breach originated when an employee was tricked with a social engineering attack that allowed the hackers to steal “a limited number of files.”\nThe statement said the company is communicating “with partners and those impacted,” and offering free credit monitoring “to all individuals who receive a notice.”\nFigure’s spokesperson did not respond to a series of specific questions about the breach. \nThe hacking group ShinyHunters took responsibility for the hack on its official dark web leak website, saying the company refused to pay a ransom, and published 2.5 gigabytes of allegedly stolen data. \nTechCrunch saw a portion of the data, which included customers’ full names, home addresses, dates of birth, and phone numbers. \nA member of ShinyHunters told TechCrunch that Figure was among the victims of a hacking campaign that targeted customers who rely on the single sign-on provider Okta. Other victims of the campaign include Harvard University and the University of Pennsylvania (UPenn). \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\n\tTopics\n\n\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n\n\nLatest in Security\n\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fintech lending giant Figure confirms data breach",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/figure-technology-logo-times-squware.jpg?w=150"
      ],
      "datePublished": "2026-02-13T21:02:46.000Z",
      "dateModified": "2026-02-13T21:02:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Roku to launch streaming bundles as part of its efforts to continue growing its profitability",
    "url": "https://techcrunch.com/2026/02/13/roku-to-launch-streaming-bundles-as-part-of-its-efforts-to-continue-growing-its-profitability/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/04/roku-logo.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T16:39:27.000Z",
    "description": "\nRoku shared its fourth-quarter earnings for 2025 this week, as well as some exciting plans in the pipeline. The company is rolling out new streaming ",
    "body": "\nRoku shared its fourth-quarter earnings for 2025 this week, as well as some exciting plans in the pipeline. The company is rolling out new streaming bundles, expanding its $3 subscription service, Howdy, to more platforms, and partnering with more premium streaming services following the successful addition of HBO Max.\nLaunching bundles in 2026 is a smart move, as it could attract more viewers looking for enticing deals amid rising subscription prices. Many streaming platforms have been increasing their rates recently, and Roku aims to appeal to cost-conscious consumers. The positive impact of HBO Max on Roku’s premium subscriptions has encouraged the company to continue this strategy by adding more top-tier partners, which is likely to drive growth going forward.\nAdditionally, Roku launched its ad-free subscription streaming service, Howdy, last year and plans to expand its availability beyond the Roku platform. While specific details remain undisclosed, Roku CEO Anthony Wood stated at CES last month that the goal is to distribute Howdy widely, saying, “We want to distribute it everywhere.”\nOther highlights include Roku users streaming 145.6 billion hours of video in 2025, marking a 15% increase from 2024. The company is also nearing the milestone of 100 million streaming households, though it has decided to report this figure less frequently.\nFinancially, Roku delivered an impressive quarter, posting net income of $80.5 million, a rebound from a $35.5 million loss in the same period last year. Total revenue for Q4 2025 reached $1.4 billion, representing a 16% year-over-year increase.\nLooking ahead, Roku is optimistic, projecting total net revenue of $5.5 billion and gross profit of $2.4 billion.\n“In 2023, our priority was to rightsize our cost structure and reach adjusted EBITDA breakeven in 2024, and we achieved that goal a full year ahead of schedule,” Wood told investors during the call yesterday afternoon. “Looking ahead to 2026 and beyond, we are confident in our ability to sustain double-digit platform revenue growth while continuing to grow profitability.”\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Roku to launch streaming bundles as part of its efforts to continue growing its profitability",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/04/roku-logo.jpg?w=150"
      ],
      "datePublished": "2026-02-13T16:39:27.000Z",
      "dateModified": "2026-02-13T16:39:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dutch phone giant Odido says millions of customers affected by data breach",
    "url": "https://techcrunch.com/2026/02/13/dutch-phone-giant-odido-says-millions-of-customers-affected-by-data-breach/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T15:54:13.000Z",
    "description": "\nDutch phone company Odido has confirmed a data breach affected millions of its customers.\nThe company said in a statement Thursday that unidentified ",
    "body": "\nDutch phone company Odido has confirmed a data breach affected millions of its customers.\nThe company said in a statement Thursday that unidentified hackers gained access to its customer contact system and covertly downloaded reams of customer information. A spokesperson for Odido told local Dutch media that the breach affects more than 6.2 million customers, or about a third of the country’s population.\nThe stolen data includes customer names, phone numbers, postal and email addresses, dates of birth, bank account numbers (IBAN), and details of customers’ government-issued IDs, such as passport or driver’s license numbers and dates of validity.\nThe company said former customers who had service within the past two years may also be affected.\nOdido said the data did not include customer call records, location data, billing information, or image scans of government IDs. The data does not affect business customers, the company said.\nThe breach affects customers of both Odido and its subsidiary Ben NL. Both companies said that their phone, internet, and television operations were unaffected by the breach.\nThis is the latest in a series of data thefts targeting phone and telecommunication giants in recent years, as governments and financially motivated hackers continue to seek highly confidential information that telcos have on their customers.\nEarlier this week, the Singaporean government confirmed that a China-related hacking group had previously broken into four of the country’s top phone giants as part of a surveillance operation, but did not access customers’ personal information.\nAll the while, hackers associated with the China-backed threat group known as Salt Typhoon have hacked hundreds of phone companies around the world, including in Canada, Norway, the United Kingdom, and the United States, as part of an ongoing espionage campaign aimed at spying on senior government officials and diplomats.\n\n\n\t\tZack Whittaker is the security editor at TechCrunch. He also authors the weekly cybersecurity newsletter, this week in security. \nHe can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dutch phone giant Odido says millions of customers affected by data breach",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/odido.jpg?w=150"
      ],
      "datePublished": "2026-02-13T15:54:13.000Z",
      "dateModified": "2026-02-13T15:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Airbnb plans to bake in AI features for search, discovery and support",
    "url": "https://techcrunch.com/2026/02/13/airbnb-plans-to-bake-in-ai-features-for-search-discovery-and-support/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/08/brian-chesky-GettyImages-2217178973.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-14T02:40:42.000Z",
    "description": "\nAirbnb has taken its time to launch AI features within the app, but CEO Brian Chesky on Friday said the company is now planning to bake in features p",
    "body": "\nAirbnb has taken its time to launch AI features within the app, but CEO Brian Chesky on Friday said the company is now planning to bake in features powered by large language models that would help users search for listings, plan their trips, and aid hosts in managing their properties.\nSpeaking at the company’s fourth-quarter conference call, Chesky said the company wants to increase its use of large language models for customer discovery, support and engineering. \n“We are building an AI-native experience where the app does not just search for you. It knows you. It will help guests plan their entire trip, help hosts better run their businesses, and help the company operate more efficiently at scale,” he said.\nThe company separately said it is testing a new feature that lets users search and ask questions about properties and locations using natural language queries. \nCurrently, Airbnb offers an LLM-powered customer service bot, for some personalization, and communications. The new AI search feature is expected to “evolve into a more comprehensive and intuitive search experience that extends through the trip.” \nQuestioned by analyst whether Airbnb would roll out sponsored property slots within AI search, Chesky said the company wants to get the design and user experience right first.\n“AI search is live to a very small percentage of traffic right now. We are doing a lot of experimentation. Over time, we are gonna be experimenting with making AI search more conversational, integrating it into more than the trip, and, eventually, we will be looking at sponsor listings as a result of that,” Chesky said, adding that Airbnb would consider designing an ad unit that fits the conversational search flow.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nChesky said Airbnb plans to tap the AI expertise of its new CTO, Ahmad Al-Dahle (he worked on Meta’s  Llama models previously), to use its trove of identity and review data to make the app more useful.\nAirbnb claimed its AI-powered customer support bot, launched in North America last year, now handles a third of customer problems without needing any human intervention. Chesky noted there are plans to enable customers to call the AI bot for support, and expand language coverage to customer support as well.\n“A year from now, if we are successful, significantly more than 30% of tickets will be handled by a custom service agent, in many more languages, in all the languages where we have live agents. AI customer service will not only be chat, it will be voice,” he said.\nThe company is also thinking about increasing AI usage internally. Airbnb said 80% of its engineers use AI tools, but the goal is to get to 100%.\nAirbnb reported better-than-expected revenue of $2.78 billion in the fourth quarter, up 12% from a year earlier. \n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Airbnb plans to bake in AI features for search, discovery and support",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/08/brian-chesky-GettyImages-2217178973.jpg?w=150"
      ],
      "datePublished": "2026-02-14T02:40:42.000Z",
      "dateModified": "2026-02-14T02:40:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indian pharmacy chain giant exposed customer data and internal systems",
    "url": "https://techcrunch.com/2026/02/13/indias-major-pharmacy-chain-exposed-customer-data-and-internal-systems/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/medications-drugs-2237708773.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-14T03:30:00.000Z",
    "description": "\nA security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer o",
    "body": "\nA security lapse by one of India’s largest pharmacy chains allowed outsiders to gain full administrative control of its platform, exposing customer order data and sensitive drug-control functions, TechCrunch has exclusively learned.\nThe issue affected DavaIndia Pharmacy, the pharmacy arm of Zota Healthcare, which operates a large network of retail outlets across India. Security researcher Eaton Zveare told TechCrunch that he discovered the flaw after identifying insecure “super admin” application programming interfaces on DavaIndia’s website and privately shared details with Indian cybersecurity authorities.\nThe bug is now fixed, and Zveare disclosed his findings.\nThe exposure comes as Zota Healthcare rapidly scales DavaIndia Pharmacy’s retail business. The Gujarat-headquartered company operates more than 2,300 DavaIndia stores across India, including 276 new outlets announced in January, and plans to add another 1,200 to 1,500 over the next two years.\nZveare told TechCrunch that the flaw stemmed from insecure admin interfaces, which allowed unauthenticated users to create “super admin” accounts with high privileges. \nWith that level of access, an attacker could view thousands of online orders containing customer information, modify product listings and prices, create discount coupons, and change settings governing whether certain medicines required a prescription, the researcher said.\nBased on system timestamps, Zveare said the vulnerable administrative interfaces appeared to have been live since late 2024. The access exposed nearly 17,000 online orders and administrative controls spanning 883 stores, he said, allowing changes to product pricing, prescription requirements, and promotional discounts. Zveare said the access allowed edits to website content that could have been used for defacement or disruption.\nPharmacy order data can be particularly sensitive, as it may reveal information about a person’s health conditions, medications or other private purchases. Exposure of such data, even without evidence of misuse, carries heightened privacy and patient-safety risks compared with other consumer information.\n“Customer information was linked to their orders,” said Zveare. “This includes name, phone numbers, email IDs, mailing addresses, total amount paid, and the products purchased. Since this is a pharmacy, the products being purchased could be considered private and even embarrassing for some people.”\nZveare said he reported the issue to CERT-In, India’s national cyber emergency response agency, in August 2025. The vulnerability was fixed within weeks, though confirmation from the company took longer and was provided to the cyber authorities in late November, he said.\nSujit Paul, chief executive of Zota Healthcare, did not respond to emails sent by TechCrunch last month. The researcher said there was no indication the flaw had been exploited before it was patched.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indian pharmacy chain giant exposed customer data and internal systems",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/medications-drugs-2237708773.jpg?w=150"
      ],
      "datePublished": "2026-02-14T03:30:00.000Z",
      "dateModified": "2026-02-14T03:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sex toys maker Tenga says hacker stole customer information",
    "url": "https://techcrunch.com/2026/02/13/sex-toys-maker-tenga-says-hacker-stole-customer-information/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/eggplant-blue-background.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T20:19:05.000Z",
    "description": "\nSex toy maker Tenga notified customers of a data breach on Friday, according to an email obtained by TechCrunch.\nIn the message, the Japanese company",
    "body": "\nSex toy maker Tenga notified customers of a data breach on Friday, according to an email obtained by TechCrunch.\nIn the message, the Japanese company said that “an unauthorized party gained access to the professional email account of one of our employees,” which gave the hacker access to the contents of the employee’s inbox. This access potentially allowed the hacker to see and steal customer names, email addresses, and historical email correspondence, “which may include order details or customer service inquiries.”\nThe hacker also sent spam emails to the hacked employee’s contacts, including customers, according to the email sent to customers.\nTenga did not respond to a request for comment and to provide more information, such as the total number of customers affected. The company says on its website that it has shipped over 162 million products worldwide.\nOrder details and customer service inquiries are likely to include intimate information that many customers probably wouldn’t want to disclose, given the nature of the products in question.\nThe company recommended customers change their passwords, even though it did not say that customers’ passwords were compromised, and to be vigilant of suspicious emails, especially coming from a specific employee, who appears to be the one whose account was breached. \nTenga said it took several measures after the breach, including resetting the hacked employee’s credentials and enabling “across our systems,” a basic security feature called multi-factor authentication, which prevents access to accounts with stolen passwords. The company did not respond when it was asked if there was no multi-factor on the email account prior to this breach. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nTenga was founded in 2005 in Japan, and is headquartered in Tokyo. Tenga sells a variety of sex toys, mostly for men. It’s unclear if the breach affected customers outside of the United States, given that the email came explicitly from Tenga Store USA.\nTenga is the latest in a long list of sex toy makers, such as Lovense last year, and adult websites, such as Pornhub last year and SexPanther in 2020, that have been hacked.\n\n\n\t\tLorenzo Franceschi-Bicchierai is a Senior Writer at TechCrunch, where he covers hacking, cybersecurity, surveillance, and privacy. \nYou can contact or verify outreach from Lorenzo by emailing lorenzo@techcrunch.com, via encrypted message at +1 917 257 1382 on Signal, and @lorenzofb on Keybase/Telegram.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sex toys maker Tenga says hacker stole customer information",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/eggplant-blue-background.jpg?w=150"
      ],
      "datePublished": "2026-02-13T20:19:05.000Z",
      "dateModified": "2026-02-13T20:19:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why top talent is walking away from OpenAI and xAI",
    "url": "https://techcrunch.com/video/why-top-talent-is-walking-away-from-openai-and-xai/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2236544077.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T21:00:00.000Z",
    "description": "\n\t\t\n\nLoading the player…\n\nAI companies have been hemorrhaging talent the past few weeks. Half of xAI’s founding team has left the company — some on th",
    "body": "\n\t\t\n\nLoading the player…\n\nAI companies have been hemorrhaging talent the past few weeks. Half of xAI’s founding team has left the company — some on their own, others through “restructuring” — while OpenAI is facing its own shakeups, from the disbanding of its mission alignment team to the firing of a policy exec who opposed its “adult mode” feature. \nWatch as TechCrunch’s Equity podcast hosts Kirsten Korosec, Anthony Ha, and Sean O’Kane dig into the week’s biggest deals and departures, from billion-dollar bets on fusion and robotics to the tech exodus reshaping AI companies. \nSubscribe to Equity on YouTube, Apple Podcasts, Overcast, Spotify and all the casts. You also can follow Equity on X and Threads, at @EquityPod. \n\n\t\t\n\tTopics\n\n\n\n\t\tTheresa Loconsolo is an audio producer at TechCrunch focusing on Equity, the network’s flagship podcast. Before joining TechCrunch in 2022, she was one of 2 producers at a four-station conglomerate where she wrote, recorded, voiced and edited content, and engineered live performances and interviews from guests like lovelytheband. Theresa is based in New Jersey and holds a bachelors degree in Communication from Monmouth University. You can contact or verify outreach from Theresa by emailing theresa.loconsolo@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n\n\t\n\t\n\t\tSubscribe for the industry’s biggest tech news\n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why top talent is walking away from OpenAI and xAI",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/GettyImages-2236544077.jpg?w=150"
      ],
      "datePublished": "2026-02-13T21:00:00.000Z",
      "dateModified": "2026-02-13T21:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The SEC closed its investigation into Fisker",
    "url": "https://techcrunch.com/2026/02/13/the-sec-closed-its-investigation-into-fisker/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/07/fisker-ocean-black.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T17:48:43.000Z",
    "description": "\n\t\n\t\tImage Credits:Fisker\t\n\t\n\t\t\t\t\t\t9:48 AM PST · February 13, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe Securities and Exchange Commission closed its investigation int",
    "body": "\n\t\n\t\tImage Credits:Fisker\t\n\t\n\t\t\t\t\t\t9:48 AM PST · February 13, 2026\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nThe Securities and Exchange Commission closed its investigation into bankrupt electric vehicle startup Fisker  last September, roughly one year after the probe was opened.\nTechCrunch learned the investigation was closed when the financial regulator responded to a Freedom of Information Act (FOIA) request in January. The SEC’s FOIA department said it had identified “approximately 21.7 gigabytes of electronically maintained records” related to the investigation. The agency doesn’t typically make records available if investigations are still open, and it explained in a follow-up email that it “was closed in September 2025.”\nIt’s not clear how far the investigation progressed. The SEC revealed the existence of the probe in an October 2024 filing in Fisker’s bankruptcy case. The agency wrote at the time that it had sent subpoenas to the company and that it may need to “request or subpoena additional documents in the future relating to its ongoing investigation.”\nA spokesperson for the agency declined to comment. Founder and former CEO Henrik Fisker did not respond to a message seeking comment.\nThe closure of the Fisker investigation comes amid a significant drop in enforcement actions and settlements during President Trump’s second term. The SEC initiated 313 enforcement actions in 2025 — the lowest in a decade and down 27% from the the final year of President Biden’s term, according to an analysis by law firm Paul, Weiss. Only four of those enforcement actions were against public companies. Total monetary settlements fell 45% from 2024.\nFisker was one of the last remaining electric vehicle startups under investigation by the SEC. Over the last few years, the agency settled fraud or other charges brought against Nikola, Lordstown Motors, Canoo, Hyzon Motors, and others. In 2023, it closed an investigation into Lucid Motors without a lawsuit.\nThe only known active investigation remaining into an electric vehicle startup is the one related to Faraday Future, which is now nearly four years old. In July 2025, the SEC sent Faraday and multiple executives “Wells notices,” or letters that inform a subject that the investigators recommend an enforcement action. No action has been taken since those letters were sent, though, and Faraday’s own regulatory filings indicate it has not yet responded to the Wells notices. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nFisker filed for bankruptcy in June 2024 amid a raft of problems with its first EV, the Ocean SUV. The company spent years making bold promises about developing radical new technologies, but pivoted from those ideas multiple times. It also had major financial trouble in the run-up to its collapse. It used the Chapter 11 bankruptcy process to sell off its remaining inventory of Oceans to a company that leases vehicles to ride-hail drivers and liquidate its other assets.\n\n\t\t\t\n\tTopics\n\n\n\n\t\tSean O’Kane is a reporter who has spent a decade covering the rapidly-evolving business and technology of the transportation industry, including Tesla and the many startups chasing Elon Musk. Most recently, he was a reporter at Bloomberg News where he helped break stories about some of the most notorious EV SPAC flops. He previously worked at The Verge, where he also covered consumer technology, hosted many short- and long-form videos, performed product and editorial photography, and once nearly passed out in a Red Bull Air Race plane.\r\nYou can contact or verify outreach from Sean by emailing sean.okane@techcrunch.com or via encrypted message at okane.01 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The SEC closed its investigation into Fisker",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/07/fisker-ocean-black.jpg?w=150"
      ],
      "datePublished": "2026-02-13T17:48:43.000Z",
      "dateModified": "2026-02-13T17:48:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "India partners with Alibaba.com for export push despite past China tech bans",
    "url": "https://techcrunch.com/2026/02/13/india-partners-with-alibaba-com-for-export-push-despite-past-china-tech-bans/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T17:32:59.000Z",
    "description": "\nIndia’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas ",
    "body": "\nIndia’s government has partnered with China’s Alibaba.com on an export-focused program aimed at helping startups and small businesses reach overseas buyers. The move highlights New Delhi’s selective engagement with Chinese-linked tech platforms years after it imposed sweeping bans on consumer apps and games.\nThis week, the Indian government’s Startup India initiative announced the collaboration with Alibaba.com to identify and support Indian startups that can help onboard and scale Indian exporters on the group’s global B2B platform. The program offers commissions and technical support to those startups to assist small manufacturers and traders in reaching overseas markets.\nThe new partnership arrives after years of strained India–China relations. New Delhi banned dozens of Chinese-linked apps in 2020 following a deadly border clash, including major platforms such as TikTok, PUBG Mobile, and AliExpress, an e-commerce app operated by Alibaba Group. Those restrictions remain in place, making the Indian government’s public collaboration with Alibaba’s export-focused platform a carefully circumscribed form of engagement rather than a broader policy reset.\nIndia’s export ambitions are closely tied to its small businesses and the platforms they use to reach overseas markets. Micro, small, and medium enterprises account for nearly half of the country’s exports and about 31% of GDP, according to the Indian government’s latest Economic Survey, underlining why New Delhi has focused on expanding digital market access for smaller firms through global B2B channels, including Alibaba.com.\nAlibaba.com’s B2B platform connects more than 50 million active buyers across over 200 countries and regions, said Rocky Lu, head of India business at the company.\n“Alibaba.com has been active in India for over two decades, and we remain dedicated to our core mission of empowering MSMEs to scale their businesses globally,” Lu told TechCrunch. “Our focus continues to be on leveraging our digital infrastructure to help ‘Made in India’ products reach an international audience through digital transformation.”\nLu did not confirm whether the Startup India initiative marks Alibaba.com’s first direct partnership with India’s federal government since 2020. He said, however, that the company has “maintained a consistent cadence of engagement with various government and semi-government bodies integral to the Indian export ecosystem,” including through digital training programs for MSMEs and collaborations with export promotion councils.\nThe partnership reflects India’s differentiated approach toward China, maintaining restrictions in strategic and security-sensitive sectors while allowing economic engagement where there is clear benefit, said Kazim Rizvi, founding director of the New Delhi-based public policy think tank The Dialogue.\n“Going forward, regulatory clarity will be important,” Rizvi told TechCrunch. “Predictable policy environments will help ensure that startups feel confident participating in such initiatives.”\nThe Indian government seems to be drawing a distinction between export-focused platforms and consumer-facing Chinese apps, said George Chen, partner and co-chair of the digital practice at The Asia Group, a Washington-based consultancy that advises companies on policy and geopolitical risks across Asia. Chen, who previously served as a regional public policy director at Meta, said New Delhi sees value in Alibaba’s role in supporting B2B exports, particularly given the platform’s reach in markets such as Africa, which could help Indian exporters diversify their global sales.\nIndia appears to be drawing lessons from China’s approach to digital platforms, Chen told TechCrunch.\n“China bans foreign apps like Facebook and Instagram for Chinese individual users but still allows Facebook and Google to do business with Chinese companies, especially exporters who rely on those platforms to sell products abroad,” Chen said.\nThe Startup India collaboration follows other recent steps by Alibaba.com to expand export-focused services in India. In June 2025, the company launched its Trade Assurance program in the country, aimed at helping Indian small and medium-sized exporters manage risks in cross-border transactions through payment protection and dispute-resolution tools.\nThe developments also come as India and China show tentative signs of improved engagement in multilateral technology forums, with Chinese representatives expected to attend the India AI Impact Summit in New Delhi next week. Indian officials, however, have not indicated any change to restrictions on Chinese consumer technology platforms.\nThe Indian commerce ministry did not respond to a request for comments.\n\n\n\t\tJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. \r\nYou can contact or verify outreach from Jagmeet by emailing mail@journalistjagmeet.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "India partners with Alibaba.com for export push despite past China tech bans",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/alibaba-com-jagmeet-singh-techcrunch.jpg?w=150"
      ],
      "datePublished": "2026-02-13T17:32:59.000Z",
      "dateModified": "2026-02-13T17:32:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
    "url": "https://techcrunch.com/2026/02/12/waymo-is-asking-doordash-drivers-to-shut-the-doors-of-its-self-driving-cars/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T04:41:41.000Z",
    "description": "\nIt still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future c",
    "body": "\nIt still feels like a technological marvel: Waymo’s autonomous cars are now transporting passengers across six cities. Alas, this driverless future comes with its own set of problems. These vehicles can be rendered inert if a passenger accidentally leaves the door open.\nAccording to a Reddit post, one DoorDash driver discovered this issue when an odd request appeared in their queue. Instead of making a delivery, the driver was offered $6.25 to drive less than one mile to a Waymo vehicle and close its door. After “verified completion,” they would get an extra $5.\n“You actually ‘door’ dashed,” one commenter noted.\nImage Credits:Reddit (opens in a new window)\nIt seems too ironic to be real. Waymo vehicles represent technological breakthroughs that once seemed unfathomable. The Alphabet-owned company just raised $16 billion to take its driverless cars international!\nBut Waymo and DoorDash confirmed to TechCrunch that this Reddit post is legitimate. This is, in fact, a real problem.\n“Waymo is currently running a pilot program in Atlanta to enhance its AV fleet efficiency. In the rare event a vehicle door is left ajar, preventing the car from departing, nearby Dashers are notified, allowing Waymo to get its vehicles back on the road quickly,” Waymo and DoorDash said in a joint response. (The door-closing partnership, which began earlier this year, is just one facet of Waymo and DoorDash’s broader relationship. In October, the companies launched an autonomous delivery service in Phoenix, where Waymo vehicles deliver food and groceries to DoorDash customers.)\nIf a Waymo door is left open, it’s worth it to the company to pay someone to close it — the car cannot complete any more rides if it’s left immobile. Not to mention, an unmoving car could block the flow of traffic. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis isn’t the first time Waymo has enlisted help with its door troubles. In Los Angeles, Waymo works with Honk, an app that’s like Uber for towing services. According to reports, Honk users in L.A. have been offered up to $24 to close a Waymo door — more than double what Atlanta DoorDash drivers receive.\nThe company noted that Waymo’s future vehicles will have automated door closures. But for now, gig workers are Waymo’s best bet.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waymo is asking DoorDash drivers to shut the doors of its self-driving cars",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/waymo-getty-streets.jpg?w=150"
      ],
      "datePublished": "2026-02-13T04:41:41.000Z",
      "dateModified": "2026-02-13T04:41:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon’s Ring cancels partnership with Flock, a network of AI cameras used by ICE, feds, and police",
    "url": "https://techcrunch.com/2026/02/13/amazons-ring-cancels-partnership-with-flock-a-network-of-ai-cameras-used-by-ice-feds-and-police/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/11/flock-camera-sf-surveillance-2157492329.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T15:40:15.000Z",
    "description": "\nRing, the Amazon-owned home security company, announced on Thursday that it will no longer partner with Flock Safety, a maker of AI-powered surveilla",
    "body": "\nRing, the Amazon-owned home security company, announced on Thursday that it will no longer partner with Flock Safety, a maker of AI-powered surveillance cameras that share footage with law enforcement.\nThe two companies announced a deal in October that would have allowed Ring doorbell users to share footage with Flock and its network of public safety agencies to assist with “evidence collection and investigative work.” As reported by 404 Media, Flock’s footage has been used by Immigration and Customs Enforcement (ICE), the Secret Service, and the Navy, which all have had access to Flock’s tens of thousands of AI-enabled cameras. (Flock maintains that it does not explicitly work with ICE.)\nRing wrote in a blog post that it made a joint decision with Flock to cancel the partnership because the integration would “require significantly more time and resources than anticipated.”\nThis news comes less than a week after Ring’s Super Bowl ad aired, which showed how its AI-powered Search Party feature could use a network of neighborhood cameras to find lost dogs. The ad stoked controversy from viewers who worried that this technology could be leveraged against humans.\nA Ring spokesperson has stated that this technology is “not capable of processing human biometrics.”\nBut this technology is not dissimilar from that of Flock. Using footage from Flock cameras, Flock’s government and police partners can make natural language searches of their video footage to find people who match specific descriptions. When this AI-powered technology is used by law enforcement, it has been shown to exacerbate racial biases.\nRing even rolled out a facial recognition feature in December called “Familiar Faces,” which allows users to catalog the faces of people who often visit their homes — that way, they might get a notification that says “Mom at Front Door,” rather than “a person is at your door.”\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis technology is being marketed to consumers during a time in the United States when people are especially cognizant of the dangers of mass surveillance. ICE uses this same type of facial recognition technology, powered by companies like Clearview AI, to locate people in its mass deportation efforts.\nThough its partnership with Flock won’t come to fruition, Ring has existing measures that enable users to share footage with law enforcement if they so choose. The company accomplishes this in part through a partnership with Axon, a company similar to Flock.\nRing has also historically had trouble keeping customers’ videos safe and secure. In 2023, the FTC ordered the company to pay $5.8 million over claims that employees and contractors had unrestricted access to customers’ videos for years.\n\n\n\t\tAmanda Silberling is a senior writer at TechCrunch covering the intersection of technology and culture. She has also written for publications like Polygon, MTV, the Kenyon Review, NPR, and Business Insider. She is the co-host of Wow If True, a podcast about internet culture, with science fiction author Isabel J. Kim. Prior to joining TechCrunch, she worked as a grassroots organizer, museum educator, and film festival coordinator. She holds a B.A. in English from the University of Pennsylvania and served as a Princeton in Asia Fellow in Laos.\nYou can contact or verify outreach from Amanda by emailing amanda@techcrunch.com or via encrypted message at @amanda.100 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon’s Ring cancels partnership with Flock, a network of AI cameras used by ICE, feds, and police",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/11/flock-camera-sf-surveillance-2157492329.jpg?w=150"
      ],
      "datePublished": "2026-02-13T15:40:15.000Z",
      "dateModified": "2026-02-13T15:40:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10",
    "url": "https://techcrunch.com/2026/02/13/anthropics-super-bowl-ads-mocking-ai-with-ads-helped-push-claudes-app-into-the-top-10/",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/Claude-app-gettyImages-2216579136.jpg?w=150",
    "tag": "Tech",
    "date": "2026-02-13T17:16:27.000Z",
    "description": "\n\t\t\t\t\t\t9:16 AM PST · February 13, 2026\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\nAnthropic’s Super Bowl ads — which feature darkly comedic scenarios of people seeking advice fro",
    "body": "\n\t\t\t\t\t\t9:16 AM PST · February 13, 2026\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\nAnthropic’s Super Bowl ads — which feature darkly comedic scenarios of people seeking advice from chatbots, only to be steered to “cougar” dating sites and height-boosting insoles — have been paying off. In the days since, Anthropic’s AI chatbot Claude has climbed from No. 41 on the U.S. App Store to become a top 10 app. As of Friday, Claude sits at No. 7 — its highest rank to date — suggesting its “no ads” pitch resonates strongly with users.\nAccording to new data from market intelligence provider Appfigures, Claude’s U.S. downloads across both iOS and Android totaled an estimated 148,000 from Sunday through Tuesday — the most recent data available. That’s a 32% increase from the preceding three days, Thursday through Saturday, where downloads totaled approximately 112,000.\nImage Credits:Appfigures\nClaude’s daily average number of downloads from Sunday through Tuesday was 49,200, up 32% from the usual Sunday through Tuesday average of 37,400 per day.\nThe numbers suggest that Anthropic’s Super Bowl commercials, combined with Anthropic’s recent release of its new Opus 4.6 model, worked to drive attention to Claude’s app and its key differentiator from ChatGPT. The latter rolled out ads to free users this week, just as Anthropic’s ads had warned.\nAs a result, Claude’s app is gaining more attention than it did when it first debuted on mobile. \nImage Credits:Appfigures\nThe consumer-focused AI app arrived on iOS in May 2024 to a fairly tepid reception. ChatGPT had beaten it to market on mobile devices and had grown to nearly half a million installs in its first five days. By comparison, Claude had only pulled in 157,000 total global downloads within its first week and didn’t reach a rank higher than No. 55 on the U.S. App Store.\nGlobally, Claude saw some gains this past week, too. Overall worldwide downloads of Claude across both the App Store and Google Play grew 15% from Sunday to Tuesday versus last Thursday to Saturday. However, this was less than half the gains seen in the U.S., Appfigures noted.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tBoston, MA\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tJune 23, 2026\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic’s Super Bowl ads mocking AI with ads helped push Claude’s app into the top 10",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2026/02/Claude-app-gettyImages-2216579136.jpg?w=150"
      ],
      "datePublished": "2026-02-13T17:16:27.000Z",
      "dateModified": "2026-02-13T17:16:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]