[
  {
    "title": "High school’s AI security system confuses Doritos bag for a possible firearm",
    "url": "https://techcrunch.com/2025/10/25/high-schools-ai-security-system-confuses-doritos-bag-for-a-possible-firearm/",
    "image": "https://techcrunch.com/wp-content/uploads/2023/01/GettyImages-1225201409.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-25T19:05:11.000Z",
    "description": "\nA high school student in Baltimore County, Maryland was reportedly handcuffed and searched after an AI security system flagged his bag of chips as a ",
    "body": "\nA high school student in Baltimore County, Maryland was reportedly handcuffed and searched after an AI security system flagged his bag of chips as a possible firearm.\nTaki Allen, a student at Kenwood High School, told CNN affiliate WBAL, “I was just holding a Doritos bag — it was two hands and one finger out, and they said it looked like a gun.” But as a result, Allen said, “They made me get on my knees, put my hands behind my back, and cuffed me.” \nIn a statement shared with parents, Principal Katie Smith said the school’s security department had reviewed and canceled a gun detection alert, while Smith (who didn’t immediately realize the alert had been canceled) reported the situation to the school resource officer, who called the local police.\nOmnilert, the company that operates the AI gun detection system, told CNN, “We regret that this incident occurred and wish to convey our concern to the student and the wider community affected by the events that followed.” Nonetheless, Omnilert said “the process functioned as intended.”\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "High school’s AI security system confuses Doritos bag for a possible firearm",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2023/01/GettyImages-1225201409.jpg?w=150"
      ],
      "datePublished": "2025-10-25T19:05:11.000Z",
      "dateModified": "2025-10-25T19:05:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI reportedly developing new generative music tool",
    "url": "https://techcrunch.com/2025/10/25/openai-reportedly-developing-new-generative-music-tool/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-2021258442.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-25T19:48:54.000Z",
    "description": "\nOpenAI is working on a new tool that would generate music based on text and audio prompts, according to a report in The Information.\nSuch a tool coul",
    "body": "\nOpenAI is working on a new tool that would generate music based on text and audio prompts, according to a report in The Information.\nSuch a tool could be used to add music to existing videos, or to add guitar accompaniment to an existing vocal track, sources said. It’s not clear when OpenAI plans to launch such a tool or whether it would be available as a standalone product (as opposed to integrating with OpenAI’s ChatGPT and video app Sora).\nOne source told The Information that OpenAI is working with some students from the Juilliard School to annotate scores as a way to provide training data.\nWhile OpenAI has launched generative music models in the past, they predate the launch of ChatGPT; more recently, the company has been developing audio models focused on text-to-speech and speech-to-text. Other companies with generative music models include Google and Suno.\nTechCrunch has reached out to OpenAI for comment.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI reportedly developing new generative music tool",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/12/GettyImages-2021258442.jpg?w=150"
      ],
      "datePublished": "2025-10-25T19:48:54.000Z",
      "dateModified": "2025-10-25T19:48:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ads might be coming to Apple Maps next year",
    "url": "https://techcrunch.com/2025/10/26/ads-might-be-coming-to-apple-maps-next-year/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-1224111372_9d6ea2.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-26T19:38:39.000Z",
    "description": "\nApple Maps users could start seeing ads in the app as soon as next year, according to a new report from Bloomberg’s Mark Gurman.\nSimilar to Google Ma",
    "body": "\nApple Maps users could start seeing ads in the app as soon as next year, according to a new report from Bloomberg’s Mark Gurman.\nSimilar to Google Maps and other mapping apps, Apple’s plan is to allow restaurants and other businesses with brick-and-mortar locations to pay to promote themselves in search results, Gurman says. While Apple already runs ads in the App Store, this could be part of a larger strategy to introduce more advertising in iOS.\nApple will reportedly try to distinguish itself from the competition with a better interface, and by using AI to show relevant results. \nThe question, Gurman says, is whether Apple device owners will start to rebel as Apple devices and apps increasingly become billboards trying to convince you to pay for more Apple services.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ads might be coming to Apple Maps next year",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/05/GettyImages-1224111372_9d6ea2.jpg?w=150"
      ],
      "datePublished": "2025-10-26T19:38:39.000Z",
      "dateModified": "2025-10-26T19:38:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mercor quintuples valuation to $10B with $350M Series C",
    "url": "https://techcrunch.com/2025/10/27/mercor-quintuples-valuation-to-10b-with-350m-series-c/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/IMG_9747_3d5c52.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:53:34.000Z",
    "description": "\nMercor, which connects AI labs with domain experts for training their foundational AI models, has raised $350 million at a $10 billion valuation, the",
    "body": "\nMercor, which connects AI labs with domain experts for training their foundational AI models, has raised $350 million at a $10 billion valuation, the company confirmed to TechCrunch.\nFelicis Ventures, which led the company’s previous $100 million Series B at a $2 billion valuation, is also leading this round. Existing investors Benchmark and General Catalyst, and new investor Robinhood Ventures also participated.\nTechCrunch reported in September that Mercor was in talks with investors to raise a Series C at a valuation of $10 billion, up from its target of $8 billion a few months prior. The company at the time told potential investors that it already had multiple offers.\nMercor started off as an AI-driven hiring platform, but quickly pivoted to providing companies with specialized domain experts to perform AI model training — such as scientists, doctors, and lawyers — and charging an hourly finder’s fee and matching rate for their work.\nThe company has also been adding more software infrastructure for reinforcement learning — a training method where a model’s or agent’s decisions are verified or disputed, enabling it to incorporate feedback and improve over time. The company intends to eventually build an AI-powered recruiting marketplace.\nMercor’s fortunes rose after leading AI labs like OpenAI and Google DeepMind reportedly cut ties with data-labeling startup Scale AI after Meta invested $14 billion in the data vendor and hired its CEO. \nThe company apparently told investors that it’s on track to hit $500 million in ARR faster than Anysphere, the startup behind Cursor, which famously hit the milestone roughly a year after launching its core product.\n“Since we founded Mercor almost three years ago, AI has advanced at an astonishing pace. But it still struggles with the subtleties that drive economically valuable work—balancing trade-offs, understanding intent, developing taste, and deciding what should be done, not just what can be done,” the company wrote in a blog post emailed to TechCrunch.\nThe startup says it currently pays more than $1.5 million per day to its contractors. It has more than 30,000 experts on its roster, who it pays over $85 per hour on average.\nMercor said it will focus on three areas: expanding its talent network, improving its systems for matching its contractors with clients, and building new products to automate more of its processes.\n\n\n\t\tRam is a financial and tech reporter and editor. He covered North American and European M&A, equity, regulatory news and debt markets at Reuters and Acuris Global, and has also written about travel, tourism, entertainment and books.\nYou can contact or verify outreach from Ram by emailing ram.iyer@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mercor quintuples valuation to $10B with $350M Series C",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/02/IMG_9747_3d5c52.jpeg?w=150"
      ],
      "datePublished": "2025-10-27T15:53:34.000Z",
      "dateModified": "2025-10-27T15:53:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pinterest experiments with new AI-powered personalized boards",
    "url": "https://techcrunch.com/2025/10/27/pinterest-experiments-with-new-ai-powered-personalized-boards/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Pinterest_Stylesforyou.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:35:38.000Z",
    "description": "\nPinterest announced on Monday new AI-powered upgrades to its boards to make them more personalized for users. These features include an AI-driven col",
    "body": "\nPinterest announced on Monday new AI-powered upgrades to its boards to make them more personalized for users. These features include an AI-driven collage, “Styled for you,” that helps users create outfits from saved fashion Pins, and “Boards made for you,” personalized boards curated with AI. \n“Styled for you” collages allow users to combine different clothing and accessories to create new outfits tailored to their individual style preferences. By tapping an item in the collage, users can swipe through AI-recommended saved pins for mixing and matching.\nPinterest is also testing “Boards made for you,” personalized boards curated from a blend of editorial input and AI-powered suggestions. These boards —featuring trending styles, weekly outfit inspiration, and shoppable content — will be featured in users’ home feeds and in their inboxes. \nThe company is initially experimenting with the AI features in the U.S. and Canada. They’ll start rolling out in the next few months.\nImage Credits:Pinterest\nThe company says the aim of these AI features is to evolve Pinterest boards from mere organizational tools into a more personalized way to explore, shop, and find outfit inspiration. This initiative aligns with Pinterest’s goal to position itself as an “AI-enabled shopping assistant,” as indicated by the CEO during the company’s second-quarter earnings call. Pinterest has already integrated AI in various ways, including AI-driven recommendations and visual search.\nHowever, while the platform is introducing more AI features on the one hand, it’s also trying to keep AI-generated content off its platform on the other. In April, the company announced its plan to label AI-generated and AI-modified images. It also introduced controls that let users reduce the number of AI-generated Pins they see in their feed.\nIn addition to the new AI experiments, there will be new tabs that sort Pins into categories, accessible by viewing boards from user profiles. These updates are set to roll out globally in the coming months.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nOne of the new tabs, called “Make It Yours,” will recommend fashion and home decor products based on a user’s saved Pins. The “More Ideas” tab will suggest related Pins across categories such as beauty, recipes, and art. Lastly, an “All Saves” tab will let users easily find all their previously saved Pins.\n\n\n\t\tLauren covers media, streaming, apps and platforms at TechCrunch.\nYou can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pinterest experiments with new AI-powered personalized boards",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Pinterest_Stylesforyou.jpeg?w=150"
      ],
      "datePublished": "2025-10-27T15:35:38.000Z",
      "dateModified": "2025-10-27T15:35:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Threads adds ‘ghost posts’ that disappear after 24 hours",
    "url": "https://techcrunch.com/2025/10/27/threads-adds-ghost-posts-that-disappear-after-24-hours-and-responses-go-to-dms/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/threads-ribbon-app-text-GettyImages-1508644788.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T16:00:00.000Z",
    "description": "\nMeta’s X competitor, Threads, is introducing a new “disappearing posts” feature that will allow the app’s over 400 million monthly users to share the",
    "body": "\nMeta’s X competitor, Threads, is introducing a new “disappearing posts” feature that will allow the app’s over 400 million monthly users to share their thoughts and engage in conversations that are automatically archived after 24 hours.\nThe option, dubbed “ghost posts,” launches on Monday for Threads users worldwide. \nUsers will now be able to create a ghost post on mobile devices by toggling on the new “ghost” icon on the app’s compose screen. When the post is published, it appears in others’ timelines with a dotted conversation bubble around it to differentiate the post from other content.\nOther users on both desktop and mobile devices can reply to the post, but these responses are sent directly to the poster’s DMs (direct messages); these replies don’t appear in the timeline. \nUnderneath the post, people can see if others have liked and replied to the ghost post, which is indicated by smiley-faced icons. But only posters can see the actual number of likes and replies, and who engaged.\nAfter 24 hours, the posts disappear from the timeline, but are still available to the original poster from the “archived” section, accessed from the main settings menu.\nImage Credits:Meta/Instagram Threads / Getty Images\n(Note: If you’ve turned off message requests, people you don’t follow won’t be able to reply to your ghost posts. If message requests are enabled, any replies from people you don’t follow go to your message request inbox instead. You can adjust these settings from the drop-down menu in the top right of your profile.)\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nParent company Meta told TechCrunch the feature was designed to encourage more low-stakes sharing within the feed.\nThe addition could also give Threads a new way to challenge Elon Musk’s X, where users today have to opt for third-party, often paid services to delete their old tweets if they don’t want to do a lot of manual labor. \nThis is not the first time a text-first social network has tried ephemeral posts. Before it was X, Twitter experimented with this form of sharing back in 2020 with Fleets, which appeared as disappearing Stories. However, the company pulled the feature the following year, citing a lack of adoption.\nMeta, meanwhile, believes there’s still potential in disappearing content — something that has worked well for Stories on Instagram and Facebook, for instance. On Threads, the company says it expects people will be encouraged to share more of their unfiltered thoughts, engage in live threading, or try other sorts of experimental content via ghost posts.\nThe tech giant has been rapidly iterating on Threads since its July 2023 launch, rolling out features like custom feeds, DMs, fediverse sharing (which connects Threads to open social networks like Mastodon), and, more recently, support for up to 10,000 characters through text attachments, tools to hide spoilers, and the launch of interest-based communities.\n\n\n\t\tSarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software.\nYou can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. \t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Threads adds ‘ghost posts’ that disappear after 24 hours",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/threads-ribbon-app-text-GettyImages-1508644788.jpeg?w=150"
      ],
      "datePublished": "2025-10-27T16:00:00.000Z",
      "dateModified": "2025-10-27T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PSA: Re-register your hardware 2FA key for X before Nov. 10 to avoid getting locked out",
    "url": "https://techcrunch.com/2025/10/27/psa-re-register-your-hardware-2fa-key-for-x-before-nov-10-to-avoid-getting-locked-out/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/03/twitter-x-phone-call.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:30:32.000Z",
    "description": "\n\t\n\t\tImage Credits:Bryce Durbin/TechCrunch\t\n\t\n\t\t\t\t\t\t8:30 AM PDT · October 27, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSocial network X said over the weekend that it plan",
    "body": "\n\t\n\t\tImage Credits:Bryce Durbin/TechCrunch\t\n\t\n\t\t\t\t\t\t8:30 AM PDT · October 27, 2025\t\t\t\t\t\t\t\t\t\t\t\n\n\t\t\t\nSocial network X said over the weekend that it plans to retire its twitter.com URL for authentication. This means users who have enabled two-factor authentication using a hardware key like YubiKey will have to re-enroll their keys before November 10.\n“By November 10, we’re asking all accounts that use a security key as their two-factor authentication (2FA) method to re-enroll their key to continue accessing X. You can re-enroll your existing security key, or enroll a new one,” the social network’s safety account posted last Friday.\nTwo days later, the company explained that this was necessary because the company wanted to retire its old twitter.com domain. The domain change is not expected to impact other 2FA authenticators like Google Authenticator, Microsoft Authenticator, or Authy.\n“To clarify: this change is not related to any security concern, and only impacts Yubikeys and passkeys – not other 2FA methods (such as authenticator apps). Security keys enrolled as a 2FA method are currently tied to the twitter[.]com domain. Re-enrolling your security key will associate it with x[.]com, allowing us to retire the Twitter domain,” the account said. \nChristopher Stanley, a security engineer at X, xAI and SpaceX, said this move is to ensure domain trust. “Getting off of Twitter enrolled keys so we can stop doing hacky things for domain trust. Physical security keys are cryptographically registered to Twitter’s domain and need to be re-enrolled under X,” he said. \nIf you’re using a hardware key to secure your account, head to “Settings” -> “Security and account access” -> “Two-factor authentication” -> “Manage security keys”.\nIt is not clear if X plans to retire the twitter.com domain for all activities, or if this is just a security measure. We have asked the company to clarify, and will update the story if we hear back.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n\n\t\t\t\n\tTopics\n\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n\n\t\t",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PSA: Re-register your hardware 2FA key for X before Nov. 10 to avoid getting locked out",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/03/twitter-x-phone-call.jpg?w=150"
      ],
      "datePublished": "2025-10-27T15:30:32.000Z",
      "dateModified": "2025-10-27T15:30:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump and Xi will ‘consummate’ TikTok deal on Thursday, treasury secretary says",
    "url": "https://techcrunch.com/2025/10/26/trump-and-xi-will-consummate-tiktok-deal-on-thursday-treasury-secretary-says/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2193244774.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-26T17:29:27.000Z",
    "description": "\nThe United States and China are ready to move forward on a TikTok deal, according to Treasury Secretary Scott Bessent.\nBessent had already said last ",
    "body": "\nThe United States and China are ready to move forward on a TikTok deal, according to Treasury Secretary Scott Bessent.\nBessent had already said last month that the two countries reached a “framework” on a deal during discussions in Madrid, and President Donald Trump subsequently signed an executive order to facilitate the transaction.\nIn a Sunday morning appearance on CBS’ Face the Nation, Bessent said the U.S. and China have reached “a final deal on TikTok.”\n“We reached one in Madrid, and I believe that as of today, all the details are ironed out, and that will be for the two leaders to consummate that transaction on Thursday in Korea,” Bessent said. He declined to discuss the details of the agreement, but added, “My remit was to get the Chinese to agree to approve the transaction, and I believe we successfully accomplished that over the past two days.”\nTrump has repeatedly extended the deadline of a law that requires TikTok’s owner ByteDance to sell the app or see it banned in the United States. \nUnder the terms of his executive order, TikTok’s U.S. operations — including its recommendation algorithm, source code, and content moderation — will come under the control of a new board of directors, with Oracle becoming responsible for security operations.\nOracle (led by Trump ally Larry Ellison), Fox Corp (owner of Fox News), Andreessen Horowitz, and Silver Lake Management have been reported as investors in the new joint venture, with Fox’s participation seemingly confirmed by Trump.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nBessent made today’s comments from Kuala Lumpur, Malaysia, where Chinese and American trade negotiators also said they had reached a framework for an agreement over tariffs and other trade issues.\nU.S. trade negotiator Jamieson Greer told reporters that rare earth minerals were covered in the discussion, though he did not specify how. (China has said it will tighten export controls on those minerals, which are critical to the manufacture of semiconductors and other tech products.)\n“We talked about extending the truce, we talked about rare earths, of course, we talked about all kinds of topics,” Greer said.\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump and Xi will ‘consummate’ TikTok deal on Thursday, treasury secretary says",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/01/GettyImages-2193244774.jpg?w=150"
      ],
      "datePublished": "2025-10-26T17:29:27.000Z",
      "dateModified": "2025-10-26T17:29:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TechCrunch Disrupt 2025: How to watch Astro Teller, Startup Battlefield, and more live",
    "url": "https://techcrunch.com/2025/10/27/techcrunch-disrupt-2025-how-to-watch-astro-teller-startup-battlefield-and-more-live/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/TC26_Disrupt_General_Article_1920x1080_V1.png?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:30:00.000Z",
    "description": "\nTechCrunch Disrupt 2025 is here! If you’re still on the fence about attending in person, dive into the extensive schedule of speakers, networking opp",
    "body": "\nTechCrunch Disrupt 2025 is here! If you’re still on the fence about attending in person, dive into the extensive schedule of speakers, networking opportunities, workshops, afterparties, and more that’s available here. There’s still plenty of time to get a ticket! \nBut if you’re not able to attend in person, the next best thing is to check out our livestream of the Disrupt Stage, which features some of our most prominent speakers and the highly anticipated Startup Battlefield 200 pitch competition. We’re streaming via YouTube, so you can catch the embed below, or just follow this link to watch live. \n\n\n\nHere’s a rundown of what you can expect from the Disrupt Stage on Monday to build your schedule around: \nOpening remarks, Startup Battlefield Session One: 10-11:45 a.m. \nOur first round of Battlefield finalists will deliver their pitches live on stage in front of a lineup of judges featuring Allison Baum Gates of SemperVirens, Cathy Friedman from GV, Seven Seven Six’s Katelin Holloway, Precursor’s Charles Hudson, and Nicolas Sauvage of TDK Ventures. \nThe Self-Driving Reality Check: 11:15-11:45 a.m. \nTekedra Mawakana, Co-CEO of Waymo, takes the stage to talk about where AVs actually stand, what it’s taken to get to real deployments, and why the race isn’t just about tech — it’s about trust. \n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nStartup Battlefield Session Two: 1:30-2:45 p.m. \nThe second lineup of Battlefield competitors take to the stage, where they’ll be vetted by our panel of judges featuring Eryk Dobrushkin of Index Ventures, Nvidia’s Jen Hoskins, Insight Ventures’ Thomas Krane, DXV’s Jon McNeil, and Katie Stanton of Moxie Ventures. \nWhat Sequoia Sees Coming Next: 2:45-3:15 p.m. \nRoelof Botha is among the most influential VCs of the modern era, and this is your chance to hear how today’s most ambitious founders are navigating AI, geopolitics, and a shifting capital landscape.  \nMoonshots, AI, and the Future of Alphabet: 3:15-3:45 p.m. \nAstro Teller leads the lab where Alphabet incubates the nearly impossible, and he’s going to provide a rare look into what’s succeeding within X, how the company’s “fail fast” mantra is faring, and his perspective on, you guessed it, AI. \nAnd that’s just the lineup for the first day. On Tuesday hear from renowned investor Vinod Khosla and his thoughts on the future of tech; Netflix CTO Elizabeth Stone on what’s next for the streaming giant; and Slate Auto CEO Chris Barman will bring one of her electric trucks to the stage.  \n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TechCrunch Disrupt 2025: How to watch Astro Teller, Startup Battlefield, and more live",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/TC26_Disrupt_General_Article_1920x1080_V1.png?w=150"
      ],
      "datePublished": "2025-10-27T15:30:00.000Z",
      "dateModified": "2025-10-27T15:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sequoia unveils $950M in new early-stage funds as it strives to be ‘only as good as our next investment’",
    "url": "https://techcrunch.com/2025/10/27/sequoia-unveils-950m-in-new-early-stage-funds-as-it-strives-to-be-only-as-good-as-our-next-investment/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Investor-wall-Sequoia.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T14:00:00.000Z",
    "description": "\nDespite the growing chatter of an AI bubble, Sequoia Capital insists its investment approach is unswayed by the market frenzy.\n“Markets go up and dow",
    "body": "\nDespite the growing chatter of an AI bubble, Sequoia Capital insists its investment approach is unswayed by the market frenzy.\n“Markets go up and down, but our strategy remains consistent. We’re always looking for outlier founders with ideas to build generational businesses,” said Bogomil Balkansky, a partner on Sequoia’s early-stage investment team.\nTo prove this consistency, Sequoia announced two new funds on Monday that nearly match the sizes launched about three years ago: a $750 million early-stage fund targeting Series A startups and a $200 million seed fund.\nThese funds were introduced after what has been a tumultuous period for the legendary firm. In 2021, Sequoia overhauled its structure into an evergreen main fund supported by strategy-specific “sub-funds,” primarily to enable the firm to retain stock in portfolio companies long after their IPO. The firm took a significant financial hit in late 2022, losing over $200 million when its investment in cryptocurrency exchange FTX blew up, followed by the 2023 separation from its India and China divisions.\nThe storied firm, which famously backed Airbnb, Google, Nvidia, and Stripe in their infancy, is putting recent challenges behind it and returning to its core purpose: investing in promising founders at the earliest stages of creation.\nBalkansky reinforced this mission: “Our ambition has always been and continues to be to identify these founders as early as possible; to roll up our sleeves and be a very active participant in their company-building journey.”\nWith AI startup valuations skyrocketing, Sequoia wants to use the new funds to invest in the most promising founders at the beginning of their startup-building journey. This strategy allows the firm to secure a low price while locking in a significant ownership stake.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nThis early-stage focus is even more crucial for the firm now. As valuations soar at an unprecedented pace, getting in early is the key to locking in a lower price and securing a substantial stake.\nThis approach is paying off: Sequoia’s seed and Series A investments in Clay, Harvey, n8n, Sierra, and Temporal have appreciated manyfold amid the AI boom.\nEven with its renowned Series A history, Balkansky made it clear that Sequoia aims to defend its legacy by investing even earlier: “We have an amazing track record and tradition to partner with companies at the very earliest stage, which today will be classified as a pre-seed.”\nHe highlighted the firm’s early conviction: Sequoia recently wrote the first check into security tester Xbow, AI reliability engineer Traversal, and DeepSeek alternative Reflection AI — all companies that have since raised significant capital at much higher valuations. Among the ways the firm has helped behind the scenes, it says it recruited a former Databricks CRO to Xbow’s board, connected Traversal with more than 30 potential customers, and arranged a meeting between Reflection AI and Nvidia’s Jensen Huang, leading directly to a $500 million investment from the chipmaker.\nEven with these recent successes, Sequoia is relentlessly focused on upholding its five-decade legacy as Silicon Valley’s top investor. To ensure this mindset persists, the firm’s newly renovated office features a wall where every investor handwrote this reminder: “We are only as good as our next investment.”\n\n\n\t\tMarina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation.\r\nYou can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sequoia unveils $950M in new early-stage funds as it strives to be ‘only as good as our next investment’",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Investor-wall-Sequoia.jpg?w=150"
      ],
      "datePublished": "2025-10-27T14:00:00.000Z",
      "dateModified": "2025-10-27T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Workout app Ladder launches  nutrition-tracking experience",
    "url": "https://techcrunch.com/2025/10/27/workout-app-ladder-launches-nutrition-tracking-experience/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Nutrition-Main-Screen.jpeg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T11:30:00.000Z",
    "description": "\nAs advanced AI models become better at understanding different types of input — such as text, voice, and images — and converting them into nutritiona",
    "body": "\nAs advanced AI models become better at understanding different types of input — such as text, voice, and images — and converting them into nutritional data, fitness apps that let people log their food using these methods have exploded in popularity. We have seen new startups like Alma and Cal AI — along with existing apps like LifeSum, Healthify, MyFitnessPal, and MyNetDiary — either launching new apps or adding new functionality around nutritional tracking.\nNow, strength training app Ladder is throwing its hat into the ring by launching its own calorie-tracking platform called Ladder Nutrition within the main app. Like other trackers, Ladder Nutrition allows you to input your food intake in any way: taking a picture, scanning a barcode, typing it in, or describing the food you had through voice. The app will estimate your macronutrients (proteins, carbohydrates, and fats) based on your input, and you can edit the portion sizes as well.\nLadder said that its advantage is that people are already tracking workouts through the Ladder app, with nutrition tracking their inputs (macros, calories)  and outputs (workouts) in one place.\nImage Credits:Ladder\nThe company said it uses a series of AI models for image recognition, ingredient identification, and calculating macros. It noted that by default, most AI food models are trained on U.S.-centric data, which means they may not accurately recognize international cuisines, so it partnered with a nutrition data provider to get accurate data for food from other parts of the world. This approach means that if one model fails to identify a dish or macros, another can step in.\nThe tracker also has a protein mode, which helps you track your daily protein intake. Ladder said that it has also included streaks, badges, and progress reminders to gamify the process of nutrition tracking and help people regularly log their food.\nLadder said that when it surveyed its members last year, the results showed that they wanted a nutrition tracker within the app, rather than having to use another app for it. This is why the company focused on shipping the nutrition tracking feature this year.\nImage Credits:Ladder\nThe company said it has been testing food tracking over the last month and that 70% of testers said that they intended to switch calorie tracking apps after using Ladder’s features.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\n“Nutrition was the next logical step for Ladder, and our members were pleading with us for it,” Ladder CEO Greg Stewart told TechCrunch over email. “They wanted a simple, smarter way to connect what they eat with how they perform — and that’s exactly what Ladder Nutrition delivers.”\nIt’s just the start, Stewart continued. He said that in the future, Ladder will “build on this foundation with features that offer more prescriptive guidance — what to eat, how to fuel, and how to optimize nutrition based on individual training habits and goals continuously.”\nThe nutrition tracking feature is free for all Ladder members, who pay $29.99 per month or $179.99 a year. According to Ladder, the app has more than 300,000 paid members worldwide.\n\n\n\t\tIvan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web.\r\nYou can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Workout app Ladder launches  nutrition-tracking experience",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Nutrition-Main-Screen.jpeg?w=150"
      ],
      "datePublished": "2025-10-27T11:30:00.000Z",
      "dateModified": "2025-10-27T11:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who are AI browsers for?",
    "url": "https://techcrunch.com/2025/10/25/who-are-ai-browsers-for/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/chrome-with-ai-GettyImages-2184968624.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-25T16:51:36.000Z",
    "description": "\nOpenAI launched an AI-powered web browser called ChatGPT Atlas this week, which makes me wonder: Is it finally time to ditch Safari?\nThat news was on",
    "body": "\nOpenAI launched an AI-powered web browser called ChatGPT Atlas this week, which makes me wonder: Is it finally time to ditch Safari?\nThat news was on our minds as Max Zeff, Sean O’Kane, and I discussed the browser landscape — including some lesser-known alternatives — on the latest episode of the Equity podcast. But it doesn’t sound like any of us will be making a big switch soon.\nFor one thing, Sean noted many companies have tried and ultimately failed to unseat the major browsers due to their inability to make money on the browser alone. Of course, that’s less likely to be a problem for OpenAI, with its increasingly massive funding rounds.\nMax, meanwhile, has actually tried out Atlas and other browsers that promise AI agents will do the work for you, and he said there’s a “slight efficiency gain” at best. At other times, you end up watching the agent “click around on a website” — is that something normal users are really crying out for? Plus, there are significant security risks.\nRead a preview of our conversation below, edited for length and clarity.\nAnthony: I’m still on Safari, but as far as the search engine, which is tied to browsers, I’ve actually been trying to experiment with non-Google [options] because I’m just tired of seeing all the genAI stuff at the top of my search results.\nI think also there’s this question of: If these AI browsers take off, what does that mean for the idea of the open web in general? You can still go to web pages, but I don’t think it would be crazy to suggest that a website is just going to become less and less important as more and more of our browsing is controlled by these AI interfaces and chatbots.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nMax: I think that this has been a big idea that people talk about a lot: What does the agentic web look like? And I think it is a fascinating question. People have tried to come up with all these solutions to work toward this future that [they] feel is coming. \nAnd I think that there is a certain aspect of it that reminds me of previous tech waves where it’s like, “Okay, but what is the actual experience? What is the value proposition to a consumer of using one of these tools?”\nAnd it’s just not super compelling today. I’ve tried out ChatGPT Atlas and I’ve tried out Comet and the most generous estimation of them is, it’s a slight efficiency gain. It makes you slightly more efficient.\nBut most of the time that I’ve tried these things, you’re slowly watching it click around on a website, doing some task that I would probably never do in the real world. I would have it, like, look up a recipe and add all of the ingredients to Instacart. I’ve never done that. I think all the tech bros always say that example in the videos, and I’m like, “I don’t know if people are doing that that much.”\nThis is just this huge gap, in the face of the tech industry right now [saying], “We’re building all these tools for the agentic web,” but why would a normal person use this? And I don’t know.\nSean: I have not used any of those [AI browsers] but that’s in large part because I’m still very much an old head when it comes to search and browsing in general — a lot of the work that I’m doing involves looking for documents, which just naturally involves looking through different discrete parts of web pages that I’m familiar with, lots of Boolean searches on Google. Maybe I’ll try these one day if Google really does up and kill Boolean search, which it feels like is coming at some point, but it’s not there yet. \nThe thing that is interesting to me about these AI browsers is that we’ve seen other companies try to compete in the browser space and they always lose because it’s just impossible to make money on a browser as a product. And some have tried to charge up front for it, they can kind of get by for a little while, but it’s just ultimately not sustainable in the face of competing against Safari or Chrome or Firefox, for that matter. \nWhat’s interesting to me … is you finally have these companies that just have infinite money, so they can ride it out as long as they want, because they’re not actually trying to make money on these things yet. Eventually they probably will, but OpenAI doesn’t need to make money on this thing in the next year or two, they can just have it out there and let it take shape.\n\n\n\n\n\n\t\tAnthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City.\nYou can contact or verify outreach from Anthony by emailing anthony.ha@techcrunch.com.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who are AI browsers for?",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/07/chrome-with-ai-GettyImages-2184968624.jpg?w=150"
      ],
      "datePublished": "2025-10-25T16:51:36.000Z",
      "dateModified": "2025-10-25T16:51:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Accel and Prosus team up to back early-stage Indian startups",
    "url": "https://techcrunch.com/2025/10/26/accel-and-prosus-team-up-to-back-early-stage-indian-startups-building-for-1-4b-people/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-26T23:30:00.000Z",
    "description": "\nStoried investors Accel and Prosus have launched a new investment partnership to back Indian startups from day zero, targeting founders building larg",
    "body": "\nStoried investors Accel and Prosus have launched a new investment partnership to back Indian startups from day zero, targeting founders building large-scale solutions with the potential to serve the masses in the South Asian nation.\nAnnounced on Monday, the collaboration marks the first time Prosus is investing at the formation stage. Both firms will co-invest from a startup’s earliest days, with a focus on companies addressing systemic challenges across sectors such as automation, energy transition, internet services, and manufacturing.\nIndia, the world’s most populous country with over 1.4 billion people, is seeing rapid growth in its digital economy. The country has more than a billion internet users and over 700 million smartphone users, making it the second-largest smartphone market after China. The Indian government-backed platforms such as the Unified Payments Interface (UPI) and Aadhaar have created a digital infrastructure that enables startups to build and scale services quickly. Yet much of India’s startup activity to date has focused on adapting global business models, with fewer companies tackling large-scale domestic challenges. The Accel–Prosus alliance is looking to change that.\nThe partnership expands Accel’s early-stage founder program, Atoms X, launched in July to back what the firm calls “leap tech” startups — companies working on large-scale, systems-driven problems.\n“We feel now the time is right for the Indian startup ecosystem to move from adapting global businesses to creating Indian models that help India leapfrog its journey in becoming a developed country,” said Pratik Agarwal, a partner at Accel, in an interview.\nHe added that startups working on population-scale solutions often struggle to raise sufficient early capital, given their long gestation periods and the risk of heavy dilution before reaching meaningful traction.\n“Hopefully, we are bringing a lot more early capital to them at the right time so that they can make substantial progress without going through several rounds of false starts before they make progress,” he told TechCrunch.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nUnder the partnership, Prosus has committed to match Accel’s investment in each company, with initial checks ranging from $100,000 to $1 million — a figure that could increase over time.\n“We could both continue to do our own things in this space, but given how large the ambition is with these founders, and given how difficult a problem that they are trying to solve, it made all the sense for us to put our resources together,” said Ashutosh Sharma, head of India ecosystem at Prosus.\nTraditionally, Prosus has focused on late-stage investments globally. The Amsterdam-headquartered firm counts Swiggy, Meesho, and PayU among its key investments in India.\nWhile Prosus has committed to matching Accel’s investment in this partnership, Sharma indicated it is not seeking an equivalent equity stake.\n“For us, getting that equity in the first round is not important at all,” he told TechCrunch. “If we can truly identify a Swiggy, a Meesho, an iFood, or a Tencent of tomorrow — today — that is success enough.”\nThe partnership also broadens the scope of Accel and Prosus’s activity in India. In recent months, the two firms have co-invested in startups such as AI-powered tutoring platform Arivihan and low-cost internet service provider Wiom.\n“Because of this AI-led disruption that is happening around us, some countries will be disproportionate beneficiaries of this — and some countries will be disproportionate net, net losers,” said Sharma. “Two countries that seem very placed to be beneficiaries are the U.S. and China. Now in that world order, and in that world narrative, what is India’s space? And can India, therefore, as part of this ‘leap tech’ revolution, find the rightful place, not just in AI, but beyond AI, is the other, let’s say, ambition that we have with this program.”\nThe alliance comes amid growing geopolitical tensions that have disrupted capital flows, technology supply chains, and market access — prompting global investors to reassess where capital can be deployed safely and at scale. With a large domestic market, expanding digital infrastructure, and a deepening pool of technical talent, India is increasingly seen as a strategic priority in this landscape.\n“India’s place in the global economy and the geopolitical system is such that India needs to chart and accelerate its path like a self-sovereign, independent, developed country,” Agarwal told TechCrunch.\nAccel has already backed more than 40 startups through its early-stage program, Atoms. Over 30% of them have gone on to raise follow-on funding from external investors, with Accel itself leading more than half of those rounds.\nVC funding in India fell 25% year-over-year to $4.8 billion in the first half of 2025, per Tracxn, with late-stage deals dropping 27% to $2.7 billion and early-stage funding down 16% to $1.6 billion.\nStill, India remains a key focus for global investors, driven by its large population and expanding digital adoption. In September, eight U.S. and Indian VC and private equity firms — including Accel, Blume Ventures, Celesta Capital, and Premji Invest — formed a coalition to back deep tech startups with over $1 billion in commitment. The Accel–Prosus partnership is the latest example of how global VCs continue to place long-term bets on India.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Accel and Prosus team up to back early-stage Indian startups",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/09/india-flag.jpg?w=150"
      ],
      "datePublished": "2025-10-26T23:30:00.000Z",
      "dateModified": "2025-10-26T23:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli intelligence vets raise $20M to track developer buying signals",
    "url": "https://techcrunch.com/2025/10/27/israeli-intelligence-vets-raise-20m-to-track-developer-buying-signals/",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/Onfire-Founders.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T13:13:46.000Z",
    "description": "\nDevelopers hate (bad) marketing, but they still need a way to find useful tools and services. That’s why you’ll find a preponderance of developers on",
    "body": "\nDevelopers hate (bad) marketing, but they still need a way to find useful tools and services. That’s why you’ll find a preponderance of developers on forums and sites like Hacker News, Reddit, and Stack Overflow discussing their dev kits and why some tools are better than others.\nThat buying intent is the signal that Israeli startup Onfire wants to help software vendors capture. The company monitors public forums to learn what tools devs are discussing, and then uses AI to identify which companies those commenters work with and who the decision makers there are. The platform also layers in data on budget cycles, and puts it all together to help B2B sales teams time and contextualize their outreach.\nOnfire is now coming out of stealth with $20 million in funding, TechCrunch has learned exclusively. This includes a fresh $14 million Series A co-led by Israeli VC firms Grove Ventures and TLV Partners. IN Venture, the venture arm of Japan’s Sumitomo Corporation, also participated, as did LeumiTech 77, a special fund marking Israel’s 77th anniversary.\nLike many other Israeli founders and VCs, Onfire’s CEO Tal Peretz, CTO Shahar Shavit, and CPO Nitzan Hada are alumni of the Israel Defense Forces’ Unit 8200, an intelligence unit akin to the NSA that both won awards and sparked controversy for its alleged mass surveillance of civilians using advanced AI and data tools.\nAfter joining the private tech sector, the trio (pictured above, from left to right: Hada, Peretz, and Shavit) saw the opportunity to use their intelligence expertise in SaaS. The startup estimates it has driven “more than $50 million in closed deals” for its clients since its beta launch 12 months ago, and says its early users include ActiveFence, Aiven, Cyera, Port, and Spectro Cloud, as well as other companies selling data, cybersecurity, FinOps, and observability solutions to technical buyers.\nStill, one can’t ignore the elephant in the room: Given the founders’ intelligence background, Onfire’s trawling of public data to identify commenters’ employers is sure to raise eyebrows. But Grove Ventures managing partner Lotan Levkowitz frames the startup’s outcomes as a win-win. “Our customers are happy, and by the way, even their prospects are happy, because people pitch them with the right things at the right time,” he said.\nThe company hopes its vertical, data-centric focus will give it an edge over competitors. While other AI-enabled tools promise to boost enterprise sales, Peretz says one can’t do personalized outreach without something to base it off. “What set us apart is we started as a data-first company, and then we added the AI engine on top of that,” he said.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nAccording to Levkowitz, Onfire is filling a gap that the venture firm had identified before it met the founders: software infrastructure companies aren’t leveraging AI in their go-to-market (GTM) strategy. “The missing piece there was the data,” he said.\nOnfire comes at a time when companies are facing challenges leveraging only product-led growth for enterprise sales. Some in the industry think a new data layer is now necessary to support GTM teams, and Grove had already come to that conclusion when it connected with Onfire, Levkowitz said. He helped Onfire connect with companies his team had met while developing that thesis.\n“Before we wrote a single line of code, we interviewed around 275 revenue leaders in the IT space,” Peretz told TechCrunch. The co-founders found that most companies were still deriving the majority of their revenue from direct sales efforts, but the adoption of AI tools was changing things.\nThey learned that buyers could benefit from using AI-based contextual tools to “do more with less.” But CISOs, CTOs, and engineering teams, traditionally considered “tough buyers,” now have to filter out more noise than ever thanks to AI tools that enable mass outreach, and context could help salespeople here.\nPeretz stressed that Onfire’s solution is also about mapping signals to the context of a customer — for example, you’d need a different approach to sell a data solution to a large organization compared to a cybersecurity solution. Levkowitz says this is particularly interesting, as it means that “with every customer Onfire has, the dataset is actually getting better and better.”\nThat compounding data layer is what Onfire considers its moat to defend against CRM incumbents like Salesforce and HubSpot. “This verticalized approach enables them to have a very unique value proposition for these go-to-market teams of software infrastructure companies,” Levkowitz said.\nPeretz said the startup plans to use its new funding to make hires in AI, R&D and sales. Its core AI system is built in Israel, where 60% of the team is based, but the “go-to-market machine” is based in New York, as the startup expects the U.S. to be one of its main markets.\n\n\n\t\tAnna Heim is a writer and editorial consultant. \nYou can contact or verify outreach from Anna by emailing annatechcrunch [at] gmail.com.\nAs a freelance reporter at TechCrunch since 2021, she has covered a large range of startup-related topics including AI, fintech & insurtech, SaaS & pricing, and global venture capital trends.\nAs of May 2025, her reporting for TechCrunch focuses on Europe’s most interesting startup stories.\nAnna has moderated panels and conducted onstage interviews at industry events of all sizes, including major tech conferences such as TechCrunch Disrupt, 4YFN, South Summit, TNW Conference, VivaTech, and many more.\nA former LATAM & Media Editor at The Next Web, startup founder and Sciences Po Paris alum, she’s fluent in multiple languages, including French, English, Spanish and Brazilian Portuguese.\t\n\t\n\t\tView Bio \n\t\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli intelligence vets raise $20M to track developer buying signals",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2025/10/Onfire-Founders.jpg?w=150"
      ],
      "datePublished": "2025-10-27T13:13:46.000Z",
      "dateModified": "2025-10-27T13:13:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 2025 Startup Battlefield Top 20 are here. Let the competition begin.",
    "url": "https://techcrunch.com/2025/10/27/the-2025-startup-battlefield-top-20-are-here-let-the-competition-begin/",
    "image": "https://techcrunch.com/wp-content/uploads/2024/11/54105085427_2cae9d0502_o.jpg?w=150",
    "tag": "Tech",
    "date": "2025-10-27T15:00:00.000Z",
    "description": "\nThe Startup Battlefield is the stage where legends are made, and the next 20 contenders have arrived. These are the breakout companies that rose to t",
    "body": "\nThe Startup Battlefield is the stage where legends are made, and the next 20 contenders have arrived. These are the breakout companies that rose to the top of a fiercely competitive, global applicant pool, and they’re headed to the main stage at TechCrunch Disrupt to compete for the $100,000 prize and the coveted Disrupt Cup. \nThis year’s Top 20 finalists are building across the full spectrum of frontier innovation, from life sciences and climate tech preserving human health and planetary survival; to defense, robotics, and mobility powering the next industrial revolution and strengthening our national and global resilience; to compliance, cybersecurity, and fintech infrastructure enabling companies to scale responsibly in an increasingly complex world. And, of course, the tools reshaping how we live, work, learn, and build in a hybrid-first future.\nThese 20 companies are more than just early-stage startups — they’re the architects of what’s next. And they’ll have just six minutes on the Disrupt Stage to prove it.\nDon’t miss a beat of the world’s premier startup competition. This is your final chance to book your pass and get 60% off a second so you can catch every moment of the action. Startup Battlefield is proudly brought to you by our sponsors Google Cloud and MongoDB.\nHere are the 2025 Startup Battlefield Top 20 finalists:\nMonday, October 27, Disrupt Stage\nSemifinals (Session 1): 10:05 a.m. – 11:15 a.m. PT\nMacroCycle Technologies:  Upcycling plastic and textile waste into virgin-grade resin at price parity, all through a zero-carbon, low-energy process developed by world-class polymer scientists.\nMiraqules: Advancing lifesaving wound care with nano-biomaterials engineered to stop bleeding within one minute, regardless of size, shape, or severity.\n\n\t\tTechcrunch event\n\t\t\n\t\t\tSan Francisco\n\t\t\t\t\t\t\t\t\t\t\t\t\t|\n\t\t\t\t\t\t\t\t\t\t\t\t\tOctober 27-29, 2025\n\t\t\t\t\t\t\t\n\t\t\n\t\nNephrogen: Building an AI‑powered platform to discover next‑generation gene-delivery vectors for untreatable diseases, starting with the kidney.\nCOI Energy: Empowering commercial and industrial businesses to eliminate energy waste and monetize or donate excess capacity through their patented AI platform and kW For Good initiative. \nRADiCAIT: Pioneering medical imaging by applying foundational AI that generates synthetic PET images from CT scans, making radiology 10x more accessible, efficient, and sustainable.\nSemifinals (Session 2): 1:30 p.m. – 2:45 p.m. PT\nMbodi: Teaching robots new skills via natural language and enabling production‑ready autonomy deployment in minutes.\nSkyline Nav AI: Delivering GPS-independent navigation for drones, vehicles, aircraft, and ships, using computer vision and geospatial data to localize within 10–100 cm, even without GPS, cellular, or Wi-Fi.\nStrong by Form: Replacing steel and concrete with ultra-light, high-performance timber composites, unlocking wood’s full potential for sustainable construction and mobility.\nPytho AI: Equipping defense and military planners with AI‑powered tools to optimize mission planning and strategic decision‑making.\nGlīd: Transforming freight logistics with autonomous, electrified road-to-rail transport, redefining first-mile delivery to set new standards in efficiency, safety, and sustainability.\nTuesday, October 28, Disrupt Stage\nSemifinals (Session 3): 10:00 a.m. – 11:05 a.m. PT\nIdentifee: Enabling banks and credit unions to acquire, serve, and grow clients through a modular AI platform that unifies insights, workflows, and relationship management.\nCyDeploy: Raising the standard of cybersecurity resilience by enabling continuous business operations without disruption, powered by proactive AI defense.\nCharter Space: Fueling the future of space finance with a unified operating system that supports spacecraft development, mission insights, and in-orbit asset insurance.\nCyphr: Powering bias-free, scalable capital deployment through an AI backbone built to be every investor’s smartest analyst, enabling smarter, faster, and fairer financial decisions.\nElloe AI: Protecting enterprise AI with an output-level safety platform. The immune system for generative AI that enforces real-time compliance, trust, and accountability.\nSemifinals (Session 4): 2 p.m. – 3:15 p.m. PT\nMappa: Decoding human behavior via voice‑AI at scale with a behavioral intelligence layer that empowers connections to thrive every time.\nSuper Teacher: Educating the next generation with AI‑powered tutoring to enable elementary schools to deliver personalized learning and scale teacher impact.\nCampusAI: Bringing AI education and collaboration to life through an interactive platform and virtual world that helps users learn, apply, and innovate with real-world skills.\nUnlisted Homes: Unlocking the $31 trillion real estate market with a platform built to surface the 98% of homes that aren’t for sale yet, bringing liquidity and transparency to off-market inventory.\nUnthread: Streamlining service management with an AI-powered platform built into Slack, combining human and agentic support to resolve tickets instantly across IT, HR, and customer teams.\nWednesday, October 29, Disrupt Stage\nStartup Battlefield alumni update: 11:25 a.m. PT\nCapella Kerst, founder of geCKo Materials and 2025 Startup Battlefield standout, returns to the stage with a live demo of her game-changing, super-strong dry adhesive.\nStartup Battlefield finals: 11:30 a.m. – 12:45 p.m. PT\nThe top 5 finalists from this cohort will pitch and demo live, once again, for the chance at Disrupt glory. \nStartup Battlefield winner announced: 4 p.m. PT\nIt’s not too late to experience the live startup pitch action at TechCrunch Disrupt 2025 and to dive into 200+ sessions led by 250+ top tech leaders, explore 300 showcasing startups, and connect through 2,000+ curated networking meetings across the venue. Be part of the ultimate launchpad for innovation and scaling.\nRegister to get your ticket here, or save by bringing a guest or a group — don’t wait. Head to Moscone West, located at 800 Howard St., San Francisco. Innovation awaits alongside 10,000+ tech leaders, VCs, operators, and founders shaping the future.\n",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 2025 Startup Battlefield Top 20 are here. Let the competition begin.",
      "image": [
        "https://techcrunch.com/wp-content/uploads/2024/11/54105085427_2cae9d0502_o.jpg?w=150"
      ],
      "datePublished": "2025-10-27T15:00:00.000Z",
      "dateModified": "2025-10-27T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]