[
  {
    "title": "Men of the Manosphere",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002m7j5/men-of-the-manosphere?at_mid=5f7Y7hmZf6&at_campaign=Men_of_the_Manosphere&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002m7j5&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Men_of_the_Manosphere&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mg1w1g.jpg",
    "tag": "Trending",
    "date": "2025-11-12T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeMen of the ManosphereMen of the ManosphereContains strong language.James Blake joins three young men to explore why they’ve turned to the so-called manosphere to achieve success, and how it’s influenced their real lives.  Duration58 minsFirst shown12 Nov 2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Disappearance of Captain NairacUnravelling the Troubles’ most enduring mystery - what happened to Captain Nairac's body?1h 29mThe Chronicles of BelfastIt’s autumn, and as the city changes colour, its wilder side prepares for winter.14 minsKinahan: The True Story of Ireland’s MafiaA dark tale of a Dublin street gang who grew into the world's most feared crime cartelStitched Up? Surgery in the SunUnder the skin of cosmetic surgery abroad. Behind the filters the risks are all too realFarm 999The hidden dangers of rural life as farmers and first responders battle to save lives29 minsThe Crime I Can't ForgetThe front line of trauma and crisis - every detective has a case that's never left themBad NannyA serial scammer. The online influencer whose multiple personas preyed on the vulnerablePatrick:  A Young Traveller LostMental health matters - for all. Unveiling the pain of suicide in the Traveller community50 minsLetters from the BlitzHeartfelt letters and home movies tell the story of Northern Ireland in World War II.58 minsNorth Coast RidersLife on the wild Atlantic edge - where work, life and play are bound by the land and seaRestoration RescueFrom wreck to recovery, the folk on a mission to save Northern Ireland's historic homes29 minsNazis, U-boats and the Battle for the AtlanticDive into history. Rediscover the lost wrecks of WWII's longest and most critical battle",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Men of the Manosphere",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mg1w1g.jpg"
      ],
      "datePublished": "2025-11-12T06:00:00.000Z",
      "dateModified": "2025-11-12T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002m0fz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-11-13T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·13 Nov 2025,·71 minsAvailable for over a yearHow should we balance innovation, power and accountability in the digital age? This week, Amol speaks to Sir Nick Clegg — former UK deputy prime minister and former president of global affairs at Meta — about the power and responsibility of big tech companies. Sir Nick argues that breaking them up won’t solve the problem of their digital dominance, calling instead for greater regulation and user control. \nHe discusses how technology shapes young people’s lives, warning against moral panic whilst calling for stronger age-appropriate safeguards and phone-free schools. And with rare candour, Sir Nick offers an insider’s perspective on how Silicon Valley really works — and why governments, not tech CEOs like Mark Zuckerberg, must ultimately set the rules. \nHe also talks about politics and philosophy, arguing that true liberalism — rooted in reason, openness, and the belief in evidence over emotion — remains vital in an increasingly polarised world. \n(00:03:20) Concerns about the impact of AI \n(00:07:00) The power paradox and network effects \n(00:06:11) Children and smartphones \n(00:22:17) Social media and political polarisation \n(00:34:00) What’s Mark Zuckerberg really like? \n(00:37:56) Why tech bosses are not moral leaders \n(00:41:36) Why he left Meta \n(00:44:10) The future of technology and power \n(00:49:26) The race for AI ‘supremacy’ between the US and China \n(00:52:00) Preparing for this new digital world \n(00:53:11) Why has politics changed so much since he was deputy prime minister? \n(00:57:55) Is liberalism weak? \n(01:01:20) What’s next for Sir Nick Clegg? \n(01:05:16) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Jonny Hall and Ben Andrews. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-11-13T06:00:00.000Z",
      "dateModified": "2025-11-13T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byq?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-14T13:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·14 Nov 2025,·33 minsAre cracks showing inside Trump’s MAGA movement?AmericastAvailable for over a yearFifty year mortgages, recent aid for Argentina, high food prices, a focus on foreign affairs, and Trump telling Fox News that the U.S. needs foreign workers because it doesn’t have enough “talented people”… Americast looks at why some Republicans within the MAGA movement are questioning Trump’s commitment to his campaign promise of “America first”.  \nJustin, Anthony and Marianna look at how and where Trump is under pressure from within the Republican party, and how serious these ‘cracks’ are within the MAGA movement.  Plus, how might Trump satisfy critics who want him to shift his focus back to the economy and domestic policy? \nHOSTS:\n- Justin Webb, Radio 4 presenter\n- Anthony Zurcher, North America Correspondent\n- Marianna Spring, Social Media Investigations Senior Correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Purvee Pattni, George Dabby, Grace Reeve and Laura Cain. The technical producer was Ricardo McCarthy. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155#\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-14T13:06:00.000Z",
      "dateModified": "2025-11-14T13:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "County Donegal: Search under way for missing UK naval crew member",
    "url": "https://www.bbc.com/news/articles/czdrze27n1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d88f/live/e1442280-c24b-11f0-8536-570b5e81b990.jpg",
    "tag": "Trending",
    "date": "2025-11-15T20:03:22.000Z",
    "description": "A multi-agency search is under way off the coast of the Republic of Ireland for a missing Royal Navy crew member.The Irish Department of Transport (Do",
    "body": "A multi-agency search is under way off the coast of the Republic of Ireland for a missing Royal Navy crew member.The Irish Department of Transport (DoT) said in a statement that the crew member was last seen at about 22:30 (local time) on Friday when the boat was near Tory Island, County Donegal.It said the Irish Coast Guard received a distress call at about 09:00 on Saturday. The Ministry of Defence (MoD) said the Royal Navy is assisting in the search and rescue operation to find an individual from the Royal Fleet Auxiliary.The Irish Coast Guard, the Irish Air Corps, the RNLI, the Royal Navy vessel and others are involved in the search which is to continue overnight.A spokesperson for the DoT said the Malin Head Coast Guard is co-ordinating the search off the northwest coast between Tory Island and Eagle Island in County Mayo.\"The search from the air is being conducted by the Coast Guard's fixed-wing plane Rescue 120F, based in Shannon airport; Coast Guard helicopter Rescue 118, based in Sligo; and the Irish Air Corps plane, CASA 284,\" they continued.The Royal Navy support vessel and three RNLI all weather lifeboats based at Ballyglass, Arranmore Island and Lough Swilly, alongside other vessels are also involved in the sea search.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "County Donegal: Search under way for missing UK naval crew member",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d88f/live/e1442280-c24b-11f0-8536-570b5e81b990.jpg"
      ],
      "datePublished": "2025-11-15T20:03:22.000Z",
      "dateModified": "2025-11-15T20:03:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bus driver released after Stockholm crash arrest",
    "url": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png",
    "tag": "Trending",
    "date": "2025-11-15T17:00:29.000Z",
    "description": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are con",
    "body": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are continuing to investigate the circumstances of the incident after a bus crashed into a bus stop queue on Valhallavägen street in the Swedish capital.The Swedish Prosecution Authority said on Saturday there was \"no reason\" to keep the driver, who had been questioned by police, in custody but that \"certain investigative measures remain\".The man had been arrested on suspicion of three counts of causing death and three of causing bodily harm. Police said there was no reason to think the incident was intentional. Officials are still trying to establish the identities of the victims. The bus was not in service at the time and no passengers were on board, local media report. The crash happened near the Royal Institute of Technology university at about 15:23 (14:23 GMT).Images from the scene show rescue crews appearing to help people trapped underneath the double-decker bus.A witness who owns a shop on the street told SVT the bus hit a pole in front of the bus shelter. They said several people ran into the shop crying.A woman told the local Expressen newspaper that the bus \"mowed down an entire bus stop queue\". She said people were screaming and trying to help the injured, while dead people lay on the ground.\"There must have been more people under the bus,\" she said.Prime Minister Ulf Kristersson said his thoughts were with the victims and their families.\"People who might have been on their way home to family, friends, or a quiet evening at home. We do not yet know the cause, but right now my thoughts are primarily with those affected and their loved ones,\" he posted on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bus driver released after Stockholm crash arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-15T17:00:29.000Z",
      "dateModified": "2025-11-15T17:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will sue BBC for at least $1bn over Panorama edit",
    "url": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-15T19:43:03.000Z",
    "description": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologi",
    "body": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologised but refused to compensate him.Speaking to reporters on board Air Force One on Friday evening, Trump said: \"We'll sue them for anywhere between $1bn [£759m] and $5bn, probably sometime next week.\"On Thursday, the BBC said the edit of the 6 January 2021 speech had unintentionally given \"the mistaken impression that President Trump had made a direct call for violent action\" and said it would not be broadcast again.The corporation apologised to the president but said it would not pay financial compensation.The BBC released that statement after Trump's lawyers threatened to sue the BBC for $1bn in damages unless the corporation issued a retraction, apology and paid him compensation. \"I think I have to do it,\" Trump told reporters of his plan to take legal action. \"They cheated. They changed the words coming out of my mouth.\"The president said he had not raised the issue with Sir Keir Starmer but that the prime minister had asked to speak to him. Trump said he would call Starmer over the weekend.A search of public court record databases confirmed that no lawsuit had been filed in federal or state court in Florida as of Friday evening.A BBC spokesperson said on Saturday evening: \"We have had no further contact from President Trump's lawyers at this point. \"Our position remains the same.\"In a separate interview on Saturday recorded before his comments on Air Force One, Trump said he had an \"obligation\" to sue the BBC, adding: \"If you don't do it, you don't stop it from happening again with other people.\"He called the edit \"egregious\" and \"worse than the Kamala thing\", a reference to a dispute he had with US news outlet CBS over an interview on the 60 Minutes programme with his 2024 election opponent Kamala Harris.In July this year, US media company Paramount Global agreed to pay $16m (£13.5m) to settle a legal dispute over that interview.Sir Craig Oliver, former BBC editor and ex-director of politics and communications for former Prime Minister David Cameron, told BBC Today programme that this is a \"nightmare\" situation for the public broadcaster. \"The problem is that public money could be spent fighting this or settling this,\" Sir Craig said, adding that Trump doesn't \"understand the BBC, how it is funded or how it works\". Watch: Trump says he will sue the BBC. Gary O'Donoghue explains what's nextThe controversy stems from the way in which Trump's 6 January 2021 speech was edited by Panorama for a documentary which aired in October 2024. During his address, he told supporters: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"In the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Controversy around how Trump's speech was edited has led to the resignations of BBC director general Tim Davie and head of news Deborah Turness.In its Corrections and Clarifications section, published on Thursday evening, the BBC said the Panorama programme had been reviewed after criticism of how Trump's speech had been edited.\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the statement said.Lawyers for the BBC have written to Trump's legal team, a BBC spokesperson said this week.\"BBC chair Samir Shah has separately sent a personal letter to the White House making clear to President Trump that he and the corporation are sorry for the edit of the president's speech on 6 January 2021, which featured in the programme,\" they said.They added: \"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim.\"In its letter to Trump's legal team, the BBC set out five main arguments for why it did not think it had a case to answer.First it said the BBC did not have the rights to, and did not, distribute the Panorama episode on its US channels.When the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.Secondly, it said the documentary did not cause Trump harm, as he was re-elected shortly after.Thirdly, it said the clip was not designed to mislead, but just to shorten a long speech, and that the edit was not done with malice.Fourthly, it said the clip was never meant to be considered in isolation. Rather, it was 12 seconds within an hour-long programme, which also contained lots of voices in support of Trump.Finally, an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.The BBC's apology came hours after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.Watch: How the BBC works... in under two minutes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will sue BBC for at least $1bn over Panorama edit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-15T19:43:03.000Z",
      "dateModified": "2025-11-15T19:43:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC should pay nothing to Donald Trump, ex-director general Lord Tony Hall says",
    "url": "https://www.bbc.com/news/articles/cy0yz13057do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bbe8/live/7fbffe00-c226-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-15T13:26:11.000Z",
    "description": "7 hours agoTom McArthurLicence fee payers' money should not be paid to Trump, former BBC director general saysThe BBC should never agree to pay any mo",
    "body": "7 hours agoTom McArthurLicence fee payers' money should not be paid to Trump, former BBC director general saysThe BBC should never agree to pay any money to Donald Trump, former director general Lord Tony Hall has said.The corporation has apologised to the US President for a Panorama episode that spliced parts of his 6 January 2021 speech together, but rejected his demands for compensation.Since the corporation's retraction, Trump has indicated he may continue legal action, upping the amount he could sue for to between $1bn (£759m) and $5bn.Asked if he could ever conceive of licence fee payers' money being used to pay Trump off, Lord Hall told the BBC's Sunday with Laura Kuenssberg: \"No, [it] should not happen. You're talking about public money. It would not be appropriate.\"Lord Hall stepped down as director general in 2020 after seven years in the role.Controversy around how Trump's speech was edited has led to the resignations of BBC director general Tim Davie and head of news Deborah Turness.The video edit was a \"serious error\", Lord Hall told the BBC, adding that it should have \"been recognised as such much earlier in the whole process\".Lord Hall also said he worried that the \"hard work, diligence and the belief in impartiality\" of BBC journalists had been lost in the debate.The resignation of two senior figures at the start of the BBC's charter renewal makes the process more difficult \"at a crucial time for its future\", he added.On Thursday evening, the BBC published a statement on its Corrections and Clarifications page in which it said the Panorama programme, which was only broadcast on 28 October 2024, had been reviewed after criticism of how Trump's speech had been edited.\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the statement said.Lawyers for the BBC have written to Trump's legal team, a BBC spokesperson said this week.But in an interview with GB News on Saturday, Trump said he had an \"obligation\" to sue the BBC, adding: \"If you don't do it, you don't stop it from happening again with other people.\"He called the edit \"egregious\" and \"worse than the Kamala thing\", a reference to a dispute he had with US news outlet CBS over an interview on the 60 Minutes programme with his 2024 election opponent Kamala Harris.The full interview with Lord Tony Hall can be seen on Sunday with Laura Kuenssberg at 0900GMT on BBC One, 16 November 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC should pay nothing to Donald Trump, ex-director general Lord Tony Hall says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bbe8/live/7fbffe00-c226-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-15T13:26:11.000Z",
      "dateModified": "2025-11-15T13:26:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sabrina Carpenter to star in Alice in Wonderland-inspired film",
    "url": "https://www.bbc.com/news/articles/c9862073v28o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/04a6/live/b67a4b70-bfb1-11f0-a36c-4baeaffbee82.jpg",
    "tag": "Trending",
    "date": "2025-11-12T16:21:53.000Z",
    "description": "3 days agoJasmine SandharBBC NewsbeatGetty ImagesIt will be the first time the US singer will lead a major studio movieSabrina Carpenter looks set to ",
    "body": "3 days agoJasmine SandharBBC NewsbeatGetty ImagesIt will be the first time the US singer will lead a major studio movieSabrina Carpenter looks set to swap her signature Espresso for tea - with the Mad Hatter. The US pop star is going back to her acting roots with plans to star in and produce a musical movie inspired by Alice in Wonderland, BBC Newsbeat understands. The unnamed project is being made for Universal Pictures and will be written and directed by US filmmaker Lorene Scafaria.It's not clear who Carpenter will play in the adaptation or when it will go into production.A 'Busy Woman'If it goes ahead, it will be Carpenter's first time leading a major studio film.The 26-year-old singer approached Universal last year with ideas for it, according to US media outlets. As the wonderland became more of a reality, Scafaria reportedly decided to join the madness.Writer and director Scafaria is best known for her work on Hustlers, a 2019 film fronted by Jennifer Lopez about a crew of strippers in New York City. Carpenter has recently been nominated for six Grammy Awards, including the coveted album of the year prize for her seventh album, Man's Best Friend. She is currently on the last leg of her Short n' Sweet Tour, which included two headline shows at London's BST Festival this summer. The upcoming film will not be the first time she's gone down the rabbit hole of acting. Getty ImagesCarpenter began her acting career on Disney Channel, playing Maya Hart in the TV series Girl Meets WorldCarpenter started out as a child actor on Disney Channel playing a recurring role as Maya Hart on the comedy series Girl Meets World.Since then, she's appeared in Netflix films Work It and Tall Girl, as well as 20th Century Fox's The Hate U Give.More recently, she's been announced as a \"guest star\" in a one-off Muppet Show special for Disney+, which will premiere in 2026.Previous Alice in Wonderland versions include the 1951 animated movie by Disney and Tim Burton's 2010 take with Johnny Depp as the Mad Hatter. The story comes from Victorian author Lewis Carroll, who first published Alice's Adventures in Wonderland as a children's novel in 1865.It tells the tale of a girl named Alice who falls down a rabbit hole and lands in a fantasy world of talking animals and creatures. Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sabrina Carpenter to star in Alice in Wonderland-inspired film",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/04a6/live/b67a4b70-bfb1-11f0-a36c-4baeaffbee82.jpg"
      ],
      "datePublished": "2025-11-12T16:21:53.000Z",
      "dateModified": "2025-11-12T16:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Children in Need: Boy learns to walk again after life-saving surgery",
    "url": "https://www.bbc.com/news/articles/cx2nk0gkzrro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/42c7/live/3d539210-bf3e-11f0-9786-35d98f9cc3e7.jpg",
    "tag": "Trending",
    "date": "2025-11-13T06:05:44.000Z",
    "description": "3 days agoLouise BrierleyWest MidlandsFamily handoutChace was in hospital for five months after it was discovered he had a brain tumourChace was seven",
    "body": "3 days agoLouise BrierleyWest MidlandsFamily handoutChace was in hospital for five months after it was discovered he had a brain tumourChace was seven years old when he was diagnosed with medulloblastoma, a cancerous brain tumour, which required immediate surgery and follow-up care.The life-saving surgery at Birmingham Children's Hospital in 2021 left him paralysed, cognitively impaired and unable to swallow or speak.Now 11 years old, the boy from Wellesbourne, Warwickshire, is able to eat, drink, talk and even walk with the support of a frame.For the last three years, the family has been supported by Shine a Light, a childhood cancer charity based in Rugby, Warwickshire, which receives funding from BBC Children in Need.His mother Emma said she was putting him to sleep one night in September 2021 when he had a stroke.In hospital it was discovered he had tumours on his brain and spine and he remained there for five months for treatment, including chemotherapy and radiotherapy.The 46-year-old said: \"It didn't sink in for weeks that he had cancer and the severity of it, because he was stage four.\"Sarah Haywood PhotographyYounger brother Cole, Emma, and Chace have all been supported by the Warwickshire charity Shine a LightChace's tumour is incurable due to where it is in his brain.\"We live day-by-day, it's like you're living with a ticking time bomb\", said Emma.The surgery has also left him with a condition called Posterior Fossa Syndrome, which can cause memory loss, unsteadiness and a decreased ability to talk.But she said there had also been \"quite a funny\" side effect.\"We call him no filter Chase now because, when he started talking again, his new personality came out and he'll say what's on his mind.\"Despite all of the challenges Chase now faces, he has returned to school, and although he is now a couple of years behind where he should be, Emma said \"he just gets on with it\".Sam Schoolar was diagnosed with leukaemia when she was 10 years oldShine a Light was founded in 2016 by Sam Schoolar, a survivor of childhood cancer.\"When we first met Emma and the boys, I think all of them had lost a lot of confidence and were really struggling, and we have seen how they have grown,\" Ms Schoolar said.The charity offers hands on support for families through counselling, home visits, activity days and day trips.\"We are the only centre in Warwickshire that support childhood cancer families in the way that we do,\" said Ms Schoolar.BBC Children in Need provides core costs which she said was \"vital\" to keep the charity running, and next year they plan to purchase a new building to ensure a \"secure future\".Emma added she was \"really grateful\" for the support of the charity.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Children in Need: Boy learns to walk again after life-saving surgery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/42c7/live/3d539210-bf3e-11f0-9786-35d98f9cc3e7.jpg"
      ],
      "datePublished": "2025-11-13T06:05:44.000Z",
      "dateModified": "2025-11-13T06:05:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iliman Ndiaye: From Rising Ballers to the Prem",
    "url": "https://www.bbc.com/news/articles/cp3x6ndzdkvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d559/live/80ce4480-bf17-11f0-9b5b-bdadc82a2180.jpg",
    "tag": "Trending",
    "date": "2025-11-12T09:17:27.000Z",
    "description": "From YouTube team to the Prem: Ndiaye's unusual run to the top 3 days agoAbu Bakar YasinBBC NewsbeatPA MediaEverton's Iliman Ndiaye did not have an ea",
    "body": "From YouTube team to the Prem: Ndiaye's unusual run to the top 3 days agoAbu Bakar YasinBBC NewsbeatPA MediaEverton's Iliman Ndiaye did not have an easy run on his way to the top\"The way I play football gets people off their seats,\" says Iliman Ndiaye.Everton fans were certainly on their feet when the midfielder netted an early goal of the season contender against Sunderland earlier this month.After getting the ball on the right wing, he flashed past his opponents' defence in an impressive display of speed and skill before putting it away with his weaker foot. The Senegalese winger's talent is taken for granted now, but he had to work hard to prove himself before landing a spot in a Premier League starting line-up. He tells BBC Newsbeat that Rising Ballers, a media brand that uses grassroots initiatives to show off unsigned talent, was instrumental in helping him to showcase his skills.\"The things I was doing there, I wasn't doing at other clubs. It helped me stay fit and enjoy football more, especially when you don't have a club,\" he says.PA MediaIliman Ndiaye put Everton ahead against Sunderland this monthThe French-born footballer did not have an easy run on his way to the top, with numerous clubs rejecting him over the years, including Chelsea and Tottenham.He got close while with the Southampton development team, which led to a six-week trial at the club, but he didn't make the cut.The disappointing run continued until Boreham Wood, who are in the fifth tier of English Football, signed him in 2017.He later went on trial at Sheffield United where he was signed for the following season when he turned 19, but he needed to stay fit before starting.That's when Rising Ballers came in.\"I was playing five-a-side to keep fit and one of the guys was like: 'You've got to play for them',\" he recalls.  \"At first, they were like: 'No' - because they didn't know who I was.\"Then they said I could come in for a game and that's where they found out about my skill.\"'If you haven't been in an academy, it doesn't mean you won't make it'Only 180 of the 1.5 million boys playing organised youth football in England will ever play in the Premier League.Despite the odds being stacked against him, Ndiaye was determined to succeed, especially after one team told his father that he wouldn't make it as a professional.\"I have trained my whole time to be a football player and just believe in my ability,\" he says.\"You know that everything that you do in training, it's all going to pay off for one day.\"Don't focus on the rejection and one day your luck is going to come through.\"Rising Ballers says more than 15 players it has showcased have gone on to sign for professional clubs.They include Jerome Richards, who plays for Derby County, and Mohamed Keita, who is at Wycombe Wanderers.The brand taps into the power of social media by highlighting players to its millions of followers across its Instagram, YouTube and TikTok channels. It also generates more attention by working with brands on campaigns and hosting showcase events.'He was the one who made it'HandoutCurrent Rising Baller Kevar March-Mckenzie (left) is trying to follow in Ndiaye's footstepsTwo young footballers - 18-year-old Kevar March-Mckenzie and 20-year-old George Edwards - are trying to follow in Ndiaye's footsteps.At 16, Kevar was rejected after a three-week trial at Coventry, while George was part of many academies.Now, both have taken part in Rising Baller showcase games, where a group of grassroots players in London play in front of scouts.Both see Ndiaye as an inspiration to those who still haven't been signed.Kevar says everyone around him sees Ndiaye as a \"role model\" as \"he was the one who made it\".George grew up playing in junior squads for Arsenal, Tottenham and Queens Park Rangers before he stopped growing at around age 13 to 14.\"Everywhere I went I was told I was too small. I want to keep carrying on and prove them all wrong,\" he says. \"People would look at me and Kevar and probably think we've got no chance, but Iliman inspires us. He signed a professional contract at 19. Look at him now.\" HandoutGeorge Edwards grew up playing in junior squads for professional football teamsAcademies remain the most likely way into a professional football career.According to a report by the Premier League's Elite Performance Plan, over 11% of its top-level academy graduates go on to play at least 20 professional league games.And the English Football League - which represents clubs in the Championship, League One and League Two - say more homegrown academy players are now playing in their teams.Ndiaye believes his journey can be a source of inspiration for those who are not part of an academy.\"It's not easy being in an academy, but it's easier than those who are not in it, as they don't have that pathway,\" he says.\"So, you've just got to stay focused, train how they train, always stay sharp and take your chance when it comes.\"He feels his time at Rising Ballers helped him to become a professional after suffering so much rejection.\"When you have that atmosphere, it keeps you going.\"He says he will let others decide if he is the best \"baller\" in the Premier League, but he certainly puts himself up there.\"If I didn't score after my dribble against Sunderland, people would say they like the skill, but people would say I didn't finish after it.\"I don't just try and dribble, I try and get goals and assists.\"Premier League players are not going to let you get past them, you've got to work for it.\"In terms of what makes a baller, Ndiaye says it's simple. \"For me, it's skills,\" he says. \"It doesn't have to be a rainbow flick.\"The way you dribble past three, four players in the Prem, that's skills to me.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iliman Ndiaye: From Rising Ballers to the Prem",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d559/live/80ce4480-bf17-11f0-9b5b-bdadc82a2180.jpg"
      ],
      "datePublished": "2025-11-12T09:17:27.000Z",
      "dateModified": "2025-11-12T09:17:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At 16, I was experimented on by the CIA and now I'm suing",
    "url": "https://www.bbc.com/news/articles/cvgdngkxedzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-11-15T00:14:49.000Z",
    "description": "20 hours agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former ps",
    "body": "20 hours agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former psychiatric hospital in Montreal, Canada, is the smell - almost medicinal.\"I didn't like the look of the place. It didn't look like a hospital to me,\" she told the BBC from her home in Manitoba.That hospital – once the home of a Scottish shipping magnate – would be her home for a month in April 1958, after a judge ordered the then-16-year-old to undergo treatment for \"disobedient\" behaviour.It was there that Ms Ponting became one of thousands of people experimented on as part of the CIA's top-secret research into mind control. Now, she is one of two named plaintiffs in a class-action lawsuit for Canadian victims of the experiments. On Thursday, a judge denied the Royal Victoria Hospital's appeal, paving the way for the lawsuit to proceed.According to her medical files, which she obtained only recently, Ms Ponting had been running away from home and hanging out with friends her parents disapproved of after a difficult move with her family from Ottawa to Montreal.\"I was an ordinary teenager,\" she recalled. But the judge sent her to the Allan.Once there, she became an unwitting participant in covert CIA experiments known as MK-Ultra. The Cold War project tested the effects of psychedelic drugs like LSD, electroshock treatments and brainwashing techniques on human beings without their consent.Over 100 institutions – hospitals, prisons and schools – in the US and Canada were involved.At the Allan, McGill University researcher Dr Ewen Cameron drugged patients and made them listen to recordings, sometimes thousands of times, in a process he called \"exploring\".The Allan Memorial Institute in Montreal is where the CIA-backed experiments were conducted in CanadaDr Cameron would make Ms Ponting listen to the same tape recording hundreds of times.\"It ran over and over again, you're a good girl, you're a bad girl,\" Ms Ponting recalled.The technique was a form of \"psychic driving,\" says doctoral student Jordan Torbay, who has researched his experiments and their ethical implications.\"Essentially the minds of patients were manipulated using verbal cues,\" she says, adding he also looked at the effects of sleep drugs, forced sensory deprivation, and induced coma.Medical records show Ms Ponting was given LSD, as well as drugs like sodium amytal, a barbiturate, desoxyn, a stimulant, as well as nitrous oxide gas, a sedative known as laughing gas.\"By April 30th, the patient had explorations… she had become quite tense and extremely violent when given the Nitrous Oxide, throwing herself half out of bed and starting to scream,\" Dr Cameron wrote in one of her medical files, which Ms Ponting has obtained through a freedom of information request.The harsh truth about the MK-Ultra experiments first came to light in the 1970s. Since then, several victims have tried to sue the US and Canada. Lawsuits in the US have largely been unsuccessful, but in 1988, a Canadian judge ordered the US government to pay nine victims $67,000 each. In 1992 the Canadian government paid C$100,000 (about $80,000 at the time) to each of 77 victims – but did not admit liability.Ms Ponting was not among them, because she did not yet know that she was a victim, she saysWatch: The CIA's secret pursuit of 'mind control'Listen: The Woman Who Resisted Mind ControlFor decades, Ms Ponting said she felt something was wrong with her, but she did not learn of the details of her own involvement in the experiments until somewhat recently.She says she had little memory of what happened at the Allan, or in the years that followed.Ms Ponting eventually married and moved to Manitoba, where she had two children whom she is still close to. Now, she's a grandmother to four grandchildren. But she says she has suffered life-long repercussions from her time at the Allan.\"I felt it all my life, because I was wondering why I would think this way, or, you know what happened to me,\" she said.She says she's had to be on a cocktail of medications her whole life to deal with mental-health issues, which she attributes to her time at the Allan, as well as recurrent nightmares.\"Sometimes I wake up screaming in the night because of what happened,\" she said.The Royal Victoria Hospital and McGill University declined to comment as the case is before the courts. The government pointed the BBC to its previous settlement, in 1992, which it said was done for \"humanitarian\" reasons and did not accept legal liability.For Ms Pointing, the lawsuit is a chance to finally get some closure.\"Sometimes I sit in my living room and my mind goes back, and I can think of the things that happened to me, you know,\" she says. \"Every time I see a picture of Dr Cameron, it makes me so angry.\"Although Dr Cameron's work has since become synonymous with MK-Ultra experiments, Ms Torbay says her research shows he didn't know he was being funded by the CIA at the time. His work with the US intelligence agency ended in 1964, and he died shortly after, of a heart attack, in 1967.But regardless of whether he knew of where the money was coming from, Ms Torbay says he should have known the experiments he was conducting were not ethical.She says she hopes the lawsuit goes forward, and the victims get some sense of justice.\"It isn't really about giving the patients back what they lost, because that's not possible, but sort of almost making sure their suffering wasn't in vain, that we do learn from this,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At 16, I was experimented on by the CIA and now I'm suing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-15T00:14:49.000Z",
      "dateModified": "2025-11-15T00:14:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rail worker who saved passengers from stabbings leaves hospital",
    "url": "https://www.bbc.com/news/articles/c1j84149g7ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63f3/live/ef856930-b977-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-11-15T18:31:58.000Z",
    "description": "Train stabbings hero discharged from hospital2 hours agoAimee DexterLNERSamir Zitouni is credited with saving lives on the trainA rail worker credited",
    "body": "Train stabbings hero discharged from hospital2 hours agoAimee DexterLNERSamir Zitouni is credited with saving lives on the trainA rail worker credited with saving multiple lives during a mass stabbing on a train has been discharged from hospital.Samir Zitouni was a member of the catering crew on the Doncaster to London King's Cross service on the evening of 1 November when an attacker struck as it passed through Cambridgeshire.The 48-year-old was one of 11 people treated for their injuries.\"While we are really happy to have him home, he still has a significant recovery ahead,\" said his family, in a statement released by the British Transport Police (BTP).\"We are so grateful for the outpouring of support from the public, and very touched by all the kind words about Sam's brave actions on the night of the attack.\"The BTP has already described his actions as \"nothing short of heroic\".Last week, the force said he remained \"critically unwell\" but stable at Addenbrooke's Hospital in Cambridge.Mr Zitouni has been credited with blocking the attack suspect from stabbing a girl, leaving him with a gash on his head and neck.An online crowdfunding page set up by one of his colleagues has raised more than £67,000 to help support the family.The train was operated by LNER, and managing director David Horne has already said his actions \"were incredibly brave, and we are so proud of him\".In their statement, the family asked to be \"left in privacy to care for him as a family\".PA MediaBritish Transport Police said multiple people needed hospital treatment following the train attackPassengers on board the train said a person brandishing a knife began stabbing people after it passed through Peterborough.The driver brought the train to an emergency halt at Huntingdon.Anthony Williams, 32, of no fixed address, was charged with 10 counts of attempted murder relating to the train stabbings and a count of attempted murder in connection with an alleged attack in London.He is due to appear at Cambridge Crown Court on 1 December.BTP has said it is linking the train stabbings with three other incidents that happened in Peterborough in the hours beforehand, as well as the stabbing of a 17-year-old person on a DLR train in east London.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rail worker who saved passengers from stabbings leaves hospital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63f3/live/ef856930-b977-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-15T18:31:58.000Z",
      "dateModified": "2025-11-15T18:31:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What next as Donald Trump says he will take legal action against the BBC",
    "url": "https://www.bbc.com/news/articles/cy0yz5r8lypo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ad7/live/512ea160-c22e-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-15T12:26:07.000Z",
    "description": "BBC now faces tough legal battle with world's most powerful man. What happens next?8 hours agoKatie RazzallCulture and Media EditorAnyone who thought ",
    "body": "BBC now faces tough legal battle with world's most powerful man. What happens next?8 hours agoKatie RazzallCulture and Media EditorAnyone who thought the BBC's apology to Donald Trump was going to stop his threat of a lawsuit was, quite frankly, deluded.The BBC chairman Samir Shah perhaps summed it up in the interview he gave me the day after the director general and the CEO of News resigned. He called the president \"a litigious fellow\".That's an understatement, evident in the number of legal cases Trump has taken out against various US media companies.The president, based on his GB News interview, is clearly hurt by what he sees as an \"egregious\" edit, and he has now apparently upped the amount he says he will sue the corporation for. While on board Air Force One on Friday, Trump told reporters the figure would be \"anywhere between $1bn [£759m] and $5bn\".To put this in context, the BBC's annual income from the licence fee was £3.8 billion last year.On Friday, Trump said: \"They changed the words coming out of my mouth.\" He wants to know why Panorama edited two clips of his speech together to give a \"totally different meaning\".He doesn't accept the BBC's response that what happened was unintentional.This is a very serious moment in the history of the BBC. It stands or falls by being viewed as impartial - a source to trust in a world where trust in institutions is falling.Instead, the corporation is being accused of the opposite - and faces an expensive and very public battle with the most powerful man in the world.So where does it go from here?Ever since the president first threatened legal action, it was clear that the corporation did not intend to offer him compensation. It believes it has a case that, whatever error was made, no harm was caused to Trump by the Panorama programme. He was elected president soon after it went out and anyway, says the BBC, the programme wasn't broadcast on any US channels, so how could it have harmed him?I think there was a certain consensus, inside and outside the corporation, that the notion of using licence fee payers' money to settle with Trump was a non-starter.As one former senior BBC executive put it to me, after the BBC had rejected offering compensation, \"they've made the right call\". But this person also said, if the president did decide to sue, the BBC would have to \"batten down - and get the best lawyers in Florida\".The reason to settle would have been to bring down costs in the long run.Now it looks as if the BBC will be involved in a protracted, costly court battle at a time when it should be 100% focused on the discussions over the renewal of its charter, which are ramping up.The people at the top of the BBC should be fully concentrating on what is, in normal times, a fundamental moment for the corporation - when what it's for, its scope, how it will be funded, the details of its very existence are all hammered out between government and BBC in time for a new charter at the start of 2028.It's already losing the man who should have led that - Tim Davie, the director general. Now top BBC brains will be diverted, to game out its next moves in what could be a very damaging, even existential fight with Donald Trump. The legal fees alone could get very expensive.This might all have been avoided if the BBC had been open about the error much earlier and corrected it. Instead, it faces a long road. But there may be routes off it. Might the BBC ask the UK government to step in through back channels? Would a call from Prime Minister Keir Starmer persuade Trump to change his mind? Would Starmer even want to get involved and expend his own political capital with the US president?One positive for the BBC this week was the robust nature in which the culture secretary Lisa Nandy defended the corporation. She talked about the widespread trust in BBC News and described the corporation as \"a light on the hill for people in times of darkness\" which brings the country together, whether through Celebrity Traitors or its VE Day coverage.Donald Trump, on the other hand, has called the BBC \"worse than fake news\". He claims the corporation and its journalists are corrupt.The fight is well and truly on.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What next as Donald Trump says he will take legal action against the BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7ad7/live/512ea160-c22e-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-15T12:26:07.000Z",
      "dateModified": "2025-11-15T12:26:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo welcomes cinema stars to the Vatican",
    "url": "https://www.bbc.com/news/articles/cdxr5drrpqxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30ea/live/86c877c0-c237-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-15T16:06:45.000Z",
    "description": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeReutersPope Leo has held an audience with Hollywood stars, urging actors and ",
    "body": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeReutersPope Leo has held an audience with Hollywood stars, urging actors and directors including Cate Blanchett, Viggo Mortensen and Monica Bellucci to continue their work as \"pilgrims of the imagination\", helping to \"bring hope\".The celebrity meeting was a sprinkling of star dust for a still relatively new pope and a way for the Catholic Church to engage more with the world beyond.It was also a strong show of support from Leo XIV for the global film industry, as he spoke out against the \"troubling decline\" in cinema-going.Hailed by director Spike Lee as a \"great day\", the gathering was the first of its kind in the Vatican.Beneath the magnificent frescoes of the Clementine Hall, Pope Leo spoke in Italian to praise the power of cinema to entertain and to educate – and for its \"capacity to amaze\".But he urged filmmakers not to shy away from what he called \"the world's wounds\".\"Violence, poverty, exile, loneliness, addiction and forgotten wars are issues that need to be acknowledged and narrated,\" the Pope said. \"Good cinema does not exploit pain; it recognizes and explores it. This is what all the great directors have done.\"Six months since a conclave of cardinals elected the first North American to the Papacy, some Catholics feel that Leo has been slow to stamp his own mark on the role.His predecessor, Francis, was a charismatic Argentinian known for his off-the-cuff comments and dramatic gestures. Leo's style is far quieter, so this star-studded engagement is a new look.Watch: Among the stars to meet the Pope was Spike Lee who had a unique gift for Leo XIV.It's not clear how the cast list was drawn up, although none of the directors in the hall – who came from all over the world – made it onto the Pope's own top film list.This week, the Vatican revealed that his favourite four watches of all time included the 1960s nun-themed classic The Sound of Music, It's a Wonderful Life and Italian Roberto Benigni's multi award-winning Life is Beautiful.Among those who did join today's A-list audience were Mortensen, Chris Pine and filmmaker Gus Van Sant – of Milk and Good Will Hunting fame. The large Italian contingent included Gianni Amelio and Cinema Paradiso creator, Giuseppe Tornatore.At a time of immense pressure on film, not long after a major Hollywood strike and with funding strains here in Italy, the Pope spoke in defence of the industry.He was applauded loudly when he talked of the \"quiet dedication\" of all those behind the scenes with vital roles.ReutersThe audience for the international filmmakers was held beneath the magnificent frescoes of the Clementine Hall He also warned against the closure of cinemas which he characterised as the \"beating heart of communities\".\"More than a few people are saying that the art of cinema and the cinematic experience are in danger. I urge institutions not to give up, but to cooperate in affirming the social and cultural value of this activity,\" the Pope said.After a fifteen-minute speech and a blessing he then received each audience member in turn, led by Blanchett.\"He really urged us to go back into our day jobs and inspire people,\" the Australian-born star told reporters.One of many who came bearing gifts, the actress – who works with the UN refugee agency, UNHCR – placed a woven bracelet in the Pope's hand. \"It was a bracelet I wear in solidarity with people who are displaced,\" she explained later.Lee handed the Chicago-born Pope a New York Knicks shirt printed with the number 14 and the words Pope Leo.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo welcomes cinema stars to the Vatican",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30ea/live/86c877c0-c237-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-15T16:06:45.000Z",
      "dateModified": "2025-11-15T16:06:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]