[
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Martin O'Neill leaves with Celtic's thanks as well as a new tracksuit",
    "url": "https://www.bbc.com/sport/football/articles/ckg941rn8r6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5be/live/2eb60b00-d0ac-11f0-b487-79c943b69f96.jpg",
    "tag": "Trending",
    "date": "2025-12-04T01:01:28.000Z",
    "description": "He came. He conquered. He nicked a tracksuit.Martin O'Neill's return to Celtic has been anything but dull. Box office news conferences, an Old Firm cu",
    "body": "He came. He conquered. He nicked a tracksuit.Martin O'Neill's return to Celtic has been anything but dull. Box office news conferences, an Old Firm cup semi-final victory, a revival of fortunes in the league, and line after line lapped up by the adoring Parkhead support.The adulation for the 73-year-old pours out of the place, and on Wednesday, it was gushing on his final bow as Wilfried Nancy prepares to take charge. After Celtic's 1-0 win over Dundee brought them level with Hearts at the top of the Scottish Premiership, O'Neill led a lap of honour around Celtic Park, players applauding him in his wake, and he played to the gallery singing his name. \"These players have been absolutely fantastic and that's why they are champions,\" he told the crowd. \"It's been a privilege.\"Back in the guts of the Celtic Park main stand speaking to the media, O'Neill's form mirrored that of the team he's helped haul back on the rails.\"Do you know what? I'm going to take the tracksuit,\" he told the press pack. \"Steven, the kit man, he doesn't know, but I'm putting this in the bag.\"Seriously, absolutely. I'm definitely taking this.\"O'Neill, much like predecessor Brendan Rodgers, is a showman. The self-deprecating Northern Irishman might have carried himself with a humble air of astonishment over these last few weeks, but his presence has been a PR and coaching masterstroke. The wily old fox, his patter and his influence has juxtaposed a disconnect between the board and the stands. Fan disruption at the recent club AGM led to it being abandoned, and during Rodgers' final months, protests were a regular thing. Fury and venom at Celtic's calamitous attempt at a Champions League bid and a transfer window has spewed and sparked like hot lava from sections of the support.O'Neill's arrival was a gear change. It provided a unity and a serene calm in the midst of discombobulation and disquiet. Eight games, seven wins, and a League Cup final reached. Celtic have gone from being eight points off the top to level with Hearts and hold a game in hand. It's not all been swashbuckling like it was in Rotterdam - when they beat Feyenoord in the Europa League - but ways to win have been found.\"It's like a complete blur,\" said O'Neill after claiming it's been \"the time of his life\" back at Celtic.\"I was secretly hoping that Easter Road [against Hibernan last Sunday] was going to be the last game, so I didn't want to make a mess of it tonight.\"It wasn't the most flamboyant of victories. But three points on the board keeps it going. How did Hearts do?\"O'Neill's bombshell arrival hauled Celtic out of one hole. But some could argue his fond farewell - and timing of it - puts a bit of pressure the man coming behind him.The veteran boss arrived in Glasgow claiming he had no claims on taking the job permanently. Whether secretly he harboured ambitions to the contrary we will never know. But there was a steady warming from some fans that O'Neill, who has proven the safest of safe hands, should stick about for longer. At the very least, be given the chance to lead Celtic out against St Mirren in the League Cup final a week on Sunday.Instead, Nancy will come in faced with a run of fixtures which will require him to hit the ground running like an Olympic sprinter. On Sunday, leaders Hearts come to Celtic. That is followed by Serie A giants Roma coming to Glasgow on Thursday. Then that final at Hampden. Celtic could finish that hat-trick of games top of the league, heading towards the Europa League knockouts, and with a trophy in the cabinet.Or, they may not. For any new manager coming in, it's a colossal baptism of fire to try and navigate your way through. O'Neill remaining in post may have alleviated that instant pressure, but faith has been put in his replacement.Celtic's season has been righted, and O'Neill will leave with his heralded legacy intact, and if anything, improved. It's a tough act for Nancy to follow.The club legend leaves behind a Celtic team with a renewed identity. He leaves behind a support with renewed belief. He leaves behind a high bar. He does not leave behind a tracksuit.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Martin O'Neill leaves with Celtic's thanks as well as a new tracksuit",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5be/live/2eb60b00-d0ac-11f0-b487-79c943b69f96.jpg"
      ],
      "datePublished": "2025-12-04T01:01:28.000Z",
      "dateModified": "2025-12-04T01:01:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldzp8?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-03T19:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·44 minsIs Russia Really Ready For War With Europe?NewscastAvailable for over a yearToday, NATO ministers have been meeting to discuss the US’s 28-point plan for peace between Russia and Ukraine after Russia rejected the plan and said it was “ready” for war with Europe.\nAdam is joined by Europe editor, Katya Adler and the Economist’s defence editor, Shashank Joshi to discuss what President Putin’s statement means for a divided NATO.\nPlus Faisal Islam, BBC Economics Editor, joins the conversation to discuss the UK’s possible involvement in a new European defence fund and the government’s latest suggestions it could be looking to get closer to the EU again. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Kris Jalowiecki. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-03T19:13:00.000Z",
      "dateModified": "2025-12-03T19:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Did Donald Trump fall asleep at a cabinet meeting? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldr2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-03T18:45:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·34 minsDid Donald Trump fall asleep at a cabinet meeting?AmericastAvailable for over a yearIn Trump’s last cabinet meeting of the year, we hear the US Defense Secretary Pete Hegseth - under pressure over possible war crimes in the Carribean Sea - give his fullest explanation yet over what he knew, and when. Citing the “fog of war” in a chaotic situation, Hegseth said he “did not personally see survivors” after a deadly strike on an alleged drug boat in the Carribean, amid concerns that US forces may have violated laws governing armed conflict.  \nSarah, Anthony and Justin unpack Hegseth’s explanation, and where it leaves Trump’s ongoing dispute with the Venezuelan president, Nicolas Maduro.  \nWe also hear Trump’s tirade against Somalian immigrants and why he doesn’t want them in the United States, telling reporters they are “garbage” who should go back to where they came from and that “their country is no good for a reason”. Americast looks at the reasons behind Trump's outburst, and how immigration authorities will now be targeting Minnesota’s large Somali community.  \nAnd - did Trump fall asleep during Tuesday's cabinet meeting? \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by George Dabby and Grace Reeve.  The technical producer was Dafydd Rees. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Did Donald Trump fall asleep at a cabinet meeting? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-03T18:45:00.000Z",
      "dateModified": "2025-12-03T18:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Earthquake shakes homes in north-west England",
    "url": "https://www.bbc.com/news/articles/cgjn8wg53q7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c68/live/4c67b230-d0ce-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-04T05:38:24.000Z",
    "description": "A 3.3-magnitude earthquake rattled homes in north-west England on Wednesday night, the British Geological Survey (BGS) reported.The tremor, which stru",
    "body": "A 3.3-magnitude earthquake rattled homes in north-west England on Wednesday night, the British Geological Survey (BGS) reported.The tremor, which struck shortly after 23:23, was felt across Lancashire and the southern Lake District, including the towns of Kendal and Ulverston, within 12 miles of the epicentre.The quake occurred just off the coast of Silverdale, Lancashire at a depth of 1.86 miles, data suggested. There were no immediate reports of damage.Residents told the BGS it \"felt like an underground explosion\" and was \"so powerful it shook the whole house\".Lancashire Fire and Rescue Service said \"many residents felt or heard a loud bang\" in the area of Carnforth, 18 miles north of Lancaster. Lancaster police also said it had received reports of a \"loud explosion\" in the area. The force said there had been a \"minor earthquake in the area, near to the Lancashire and Cumbria border, measuring 3.3 magnitude\".It added: \"There have been no reports of anyone injured or damage caused but we have officers in the area, together with colleagues from the Lancashire Fire and Rescue Service and the North West Ambulance Service.\"The Volcano Discovery website said it had received more than 1,000 reports about the earthquake, with some as far away as Blackpool.On Carnforth resident posted on the site: \"Heard a rumbling sound which intensified in to a loud bang. Thought my roof was collapsing or something! Very scary.\"Another, in Silverdale, posted: \"Loud rumble and rattling of fixtures in house, as though something had collapsed or the chimney had fallen off. Significant enough to go outside to check.\"BGS detects about 300 earthquakes every year in the UK, but only about a tenth of these are felt or heard by people.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Earthquake shakes homes in north-west England",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c68/live/4c67b230-d0ce-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-04T05:38:24.000Z",
      "dateModified": "2025-12-04T05:38:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Energy grid investment of £28bn to push up household bills",
    "url": "https://www.bbc.com/news/articles/cp84yymxpjno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b61a/live/4f19c5f0-d0e6-11f0-b0cc-cf4d0e5d41e2.jpg",
    "tag": "Trending",
    "date": "2025-12-04T08:10:34.000Z",
    "description": "6 minutes agoRachel Clun,business reporterandKevin Peachey,cost of living correspondentGetty ImagesHousehold energy bills will rise to help fund a £28",
    "body": "6 minutes agoRachel Clun,business reporterandKevin Peachey,cost of living correspondentGetty ImagesHousehold energy bills will rise to help fund a £28bn investment in the UK's energy network.Energy regulator Ofgem has approved the funding in its five-year plan on improving electricity and gas grids. Most of the money will go towards maintaining gas networks, but £10.3bn will be used to strengthen the electricity transmission network.Households will see an additional £108 added to energy bills by 2031 under the plan.But Ofgem said that what people would end up paying for energy will only rise by £30 a year, as the investment will help lower the reliance on imported gas and make wholesale energy cheaper.Companies that run energy networks - including power lines, cables and gas pipes - are separate from suppliers. They have monopolies in different parts of the country.This plan sets the framework for how they deliver a safe and secure supply, and the cost controls they face for five years, from next year.Ofgem chief executive Jonathan Brearley said the investment \"will keep Britain's energy network among the safest, most secure and resilient in the world\".Speaking to BBC's Breakfast programme, Mr Brearley said the UK needed to move away from its dependence on gas.\"Gas has a really big part to play in our energy system for some time but we need to diversify our risk,\" he said.Diversifying risk means \"we'll be much better at electricity prices in the future and that will protect people's bills\".Of the £108 added to energy bills, £48 will be for gas and £60 for electricity.But Ofgem said the investment will deliver about £80-worth of savings, including £50 in savings alone from the energy grid expansion.Mr Brearley said the £108 added to bills by 2031 \"will go up over the five years, so it's not all happening at once\".\"It's about 2-3% on bills in April and increases roughly in a straight line from there.\"Ofgem chief Jonathan Brearley says the UK needs to move away from the dependence on gasThe regulator also said the investment will also remove inefficiencies in the system such as offshore wind farms being paid billions a year to switch off as the grid cannot take their power.Speaking ahead of Ofgem's announcement, Keith Anderson, the chief executive of Scottish Power told the BBC's Today programme the removal of those constraints in the system was important.\"This will be the biggest wave of investment in our electricity infrastructure since it was built by our grandfathers back in the 1950s and it will give us a system that is fit for purpose for the country for the 21st Century,\" he said.National Gas owns and operates Britain's gas transmission network, and will receive funding through the Ofgem plan.Its chief executive Jon Butterworth welcomed the investment, saying it confirmed \"the critical role that the gas transmission system plays in Britain's energy security now and for decades to come\".\"In the coming weeks, we will undertake a more detailed review of Ofgem's decision to ensure it enables us to deliver a safe, resilient network that secures Britain's energy, maintains our industrial competitiveness and supports the country's clean energy ambitions.\"Greenpeace UK's senior climate adviser, Charlie Kronick, said the energy grid was \"no longer fit for purpose\" and needed immediate, vital upgrades.\"This money must be spent effectively, however, with robust safeguards and strong regulation to protect bill-payers, and ensure these upgrades deliver genuine value for money, offering fair but not excessive returns,\" he said.Ofgem's announcement comes after a government pledge in the Budget to remove certain costs, the equivalent to about £150 from a typical annual energy bill.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Energy grid investment of £28bn to push up household bills",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b61a/live/4f19c5f0-d0e6-11f0-b0cc-cf4d0e5d41e2.jpg"
      ],
      "datePublished": "2025-12-04T08:10:34.000Z",
      "dateModified": "2025-12-04T08:10:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Court sides with Adidas in appeal over Kanye West collaboration",
    "url": "https://www.bbc.com/news/articles/cqjg7w8z7dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg",
    "tag": "Trending",
    "date": "2025-12-04T02:51:49.000Z",
    "description": "5 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur Ka",
    "body": "5 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur Kanye West - otherwise known as Ye - before their partnership broke down in 2022.A San Francisco court said the sportswear giant did not mislead investors, who claimed they had lost money after Adidas shares plunged when it cut ties with West.The Yeezy tie-up with West had been one of Adidas' most successful partnerships, but its collapse after a spate of anti-Semitic comments by the rapper cost the brand hundreds of millions of dollars.The BBC has contacted Adidas for comment but could not reach the firm leading the class action or West's team.West, who is not party to the lawsuit, was widely criticised after repeatedly making antisemitic remarks and promoting conspiracy theories.His Yeezy brand collaboration with Adidas was put under review after he showed a \"White Lives Matter\" T-shirt design at a fashion show in 2022. Shortly after, he posted anti-Semitic comments online, which prompted Adidas to pull his products from sale.West's behaviour also prompted several companies, including Gap and JP Morgan, to sever ties with the rapper.Court documents filed on Wednesday show that HLSA-ILA Funds, the firm representing investors, alleged that Adidas continued its partnership with West despite knowing about his controversial conduct for years.The filing claims Adidas \"internally grappled\" with West's behaviour but misled shareholders by failing to disclose the risk in its reports.The 9th US Circuit Court of Appeals in San Francisco ultimately sided with Adidas. The court said on Wednesday that a reasonable investor would know that a partnership with a celebrity like West could come with \"inherent risks relating to improper behaviour\".A district court had previously dismissed HLSA-ILA's case, and the firm later appealed.The collapse of Adidas' partnership with West caused the German firm's share price to tank in 2023.Yeezy, luxury trainers designed by West, had been a particularly lucrative line of products for Adidas, generating around €1.5bn (£870m; $1.17bn) in sales in 2021.The partnership breakdown left Adidas with more than €1bn worth of Yeezy shoes sitting in storage. In 2023, the brand announced that it would sell those products and donate some of the proceeds to charities who worked on combating hate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Court sides with Adidas in appeal over Kanye West collaboration",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg"
      ],
      "datePublished": "2025-12-04T02:51:49.000Z",
      "dateModified": "2025-12-04T02:51:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel receives coffin that Hamas says contains Gaza hostage's body",
    "url": "https://www.bbc.com/news/articles/cd6x2j4g3z7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ac3f/live/daf7fe70-d0e1-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-04T05:25:21.000Z",
    "description": "Israel has identified the body it received via the Red Cross on Wednesday as 43-year-old Thai agricultural worker, Suthisak Rintalak, according to the",
    "body": "Israel has identified the body it received via the Red Cross on Wednesday as 43-year-old Thai agricultural worker, Suthisak Rintalak, according to the prime minister's office.Rintalak was one of the last two deceased hostages still in Gaza. The body of the last remaining hostage, Ran Gvili, a 24-year-old Israeli police officer, remains in Gaza.Israel received the coffin carrying Rintalak after the Palestinian Islamic Jihad (PIJ) military wing said it had found a hostage's body in northern Gaza.The handover came hours after the Israeli prime minister's office said tests showed another set of remains received from Hamas on Tuesday did not belong to either of the dead hostages.The Israel Defense Forces (IDF) said they informed Rintalak's family of the news and expressed their \"deep condolences\".They added that they will continue to push for the return of the body of Gvili, urging Hamas to \"make the necessary efforts\" to return him to his family.Israeli officials are coordinating with the Thai embassy in Israel for Rintalak's remains to be returned to Thailand, the prime minister's office said in a statement.Israeli and Thai authorities say both hostages were killed during the Hamas-led attack on southern Israel on 7 October 2023 and that their bodies were then taken to Gaza.Under the first phase of the US-brokered ceasefire deal, which took effect on 10 October, Hamas agreed to return the 20 living Israeli hostages and the bodies of the 28 dead Israeli and foreign hostages still in Gaza within 72 hours.All the living hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.So far, the remains of 23 dead Israeli hostages have been handed over, along with those of four foreign hostages - two of them Thai, one Nepalese and one Tanzanian.In exchange, Israel has handed over the bodies of 345 Palestinians killed during the war.Israel has accused Hamas of deliberately delaying the recovery of the hostages' bodies, while Hamas has insisted it is struggling to find them under rubble.The slow progress has meant there has been no advance on the second phase of US President Donald Trump's Gaza peace plan. This includes plans for the governance of Gaza, the withdrawal of Israeli troops, the disarmament of Hamas and reconstruction.The dead hostage still in Gaza was among the 251 people abducted by Hamas and its allies on 7 October 2023, when about 1,200 other people were killed.Israel responded to the attack by launching a military campaign in Gaza, during which more than 70,100 people have been killed, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel receives coffin that Hamas says contains Gaza hostage's body",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ac3f/live/daf7fe70-d0e1-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-04T05:25:21.000Z",
      "dateModified": "2025-12-04T05:25:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New mayoral elections to be delayed in four areas of England",
    "url": "https://www.bbc.com/news/articles/c5yjg2r7z9zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1ac/live/c262bfd0-d0cd-11f0-898c-8733c7a292af.jpg",
    "tag": "Trending",
    "date": "2025-12-04T08:12:16.000Z",
    "description": "8 minutes agoIain Watson,Political correspondentandOttilie MitchellThe government is set to postpone elections for newly created mayors in four areas ",
    "body": "8 minutes agoIain Watson,Political correspondentandOttilie MitchellThe government is set to postpone elections for newly created mayors in four areas of England, the BBC has confirmed.The new mayoralties in Greater Essex, Norfolk and Suffolk, Hampshire and the Solent, and Sussex and Brighton were due to be contested in May next year but will elections will instead be in 2028.A formal announcement is expected later. The government will argue that the areas need more to time to complete their local government reorganisation.Opposition parties are calling for the elections to go ahead as planned, with shadow local government secretary James Cleverly accusing Labour of \"subverting democracy\".These new positions were announced under an extension of the government's devolution priority programme (DPP) in February, which promised \"sweeping\" powers for local authorities to fast track growth and said the new positions would be created \"at pace\".Reform UK deputy leader Richard Tice called the move a \"deliberate, dictatorial cancelling of democracy\". \"There is just a fear of how successful Reform are doing, they've been talking about these mayoral elections for years and years, they've been getting ready,\" he told BBC Radio 4's Today programme. Meanwhile, Liberal Democrats local government spokesperson Zoe Franklin said the party would work to see the vote next May does go ahead, adding, \"democracy delayed is democracy denied\".And the Conservative candidate for Hampshire and the Solent called the decision to delay them a \"disgrace and an affront to democracy\".\"It is clear Labour are afraid to face the British public at the ballot box,\" Donna Jones said.The government had announced the original election date when they said in February that six new areas were joining the DPP.It said the plans were the \"key to unlocking regional growth\" and came after \"political power has been hoarded in Whitehall\" for \"too long\".But the body representing district councils warned at the time that the plans could spark \"turmoil\" and argued \"mega-councils\" could undermine local decision-making.Cumbria and the soon-to-be merged triple councils of Cheshire and Warrington were due to have local mayors elected in May 2026 but both have been pushed back by a year. The former was postponed in a bid to save money, while the latter was delayed after concerns from local leaders.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New mayoral elections to be delayed in four areas of England",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1ac/live/c262bfd0-d0cd-11f0-898c-8733c7a292af.jpg"
      ],
      "datePublished": "2025-12-04T08:12:16.000Z",
      "dateModified": "2025-12-04T08:12:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta starts kicking Australian children off Instagram and Facebook ",
    "url": "https://www.bbc.com/news/articles/cdxekqryn1jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d788/live/228b1e20-d0a1-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-04T06:00:44.000Z",
    "description": "Watch: Australia's social media ban explained... in 60 secondsMeta has started removing Australian children under 16 years old from its Instagram, Fac",
    "body": "Watch: Australia's social media ban explained... in 60 secondsMeta has started removing Australian children under 16 years old from its Instagram, Facebook and Threads platforms, a week before an official teen social media ban begins.The tech giant announced last month it had begun notifying users aged between 13 to 15 years old that their accounts would start being shut down from 4 December.An estimated 150,000 Facebook users and 350,000 Instagram accounts are expected to be affected. Threads, similar to X, can only be accessed via an Instagram account.Australia's world-first social media ban starts on 10 December, with companies facing fines of up to A$49.5m (US$33m, £25m) if they fail to take \"reasonable steps\" to stop under-16s from having accounts.A spokesperson for Meta told the BBC on Thursday that \"compliance with the law will be an ongoing and multi-layered process\".\"While Meta is committed to complying with the law, we believe a more effective, standardised, and privacy-preserving approach is needed,\" she said.The government should require app stores to verify the age of users when they download apps and ask for parental approval for under-16s, Meta said, as this would eliminate the need for teens to verify their age across different apps. Last month, Meta said users it had identified as under 16 would be able to download and save their posts, videos and messages before their accounts are deactivated.Teens who believe they have been wrongly categorised as under 16 can ask for a review and submit a \"video selfie\" to verify their age. They can also provide a driver's licence or a government-issued identification.Alongside Meta's three platforms, the other social media sites affected by the ban are YouTube, X, TikTok, Snapchat, Reddit, Kick and Twitch.The government says the ban is aimed at protecting children from the harms of social media but critics say the move may isolate certain groups who depend on platforms for connection and push children to less-regulated corners of the internet.Communications Minister Anika Wells on Wednesday said she expected teething problems in the first few days and weeks of the ban but it was about protecting Gen Alpha - anyone under 15 years - and future generations. \"With one law, we can protect Generation Alpha from being sucked into purgatory by the predatory algorithms described by the man who created the feature as behavioural cocaine,\" Wells said.She described youngsters as being connected to a \"dopamine drip\" from the moment they got a smartphone and social media accounts.Wells also said that she was closely watching lesser-known apps like Lemon8 - created by the makers behind TikTok - and Yope to see if children were migrating to those platforms after the ban.Earlier this week, Australia's eSafety Commissioner Julie Inman Grant wrote to Lemon8 and Yope - both are video and photo-sharing apps - asking them to self-assess if they fell under the ban.Yope's chief executive and co-founder Bahram Ismailau said the start-up had not received any inquiries from Inman Grant yet but had already carried out a self-assessment and found it was not a social media platform.\"Because in practice Yope functions as a fully private messenger with no public content at all,\" he told the BBC.Yope works much like WhatsApp, Mr Ismailau said, where it's about \"seeing your people every day and sharing your life with them safely and privately\".Lemon8 has reportedly said it will exclude under-16s from its platform from next week, despite not being included in the ban.YouTube, which was originally exempt from the ban but then later included, labelled the law as \"rushed\" and claimed that banning children from having an account - which comes with parental controls - will make its video-sharing platform \"less safe\". Australia's social media ban, the first of its kind in the world, is being closely watched by global leaders.The government commissioned a study earlier this year which found that 96% of Australian children aged 10-15 used social media, and that seven out of 10 of them had been exposed to harmful content such as misogynistic and violent material as well as content promoting eating disorders and suicide.One in seven also reported experiencing grooming-type behaviour from adults or older children, and more than half said they had been the victim of cyberbullying.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta starts kicking Australian children off Instagram and Facebook ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d788/live/228b1e20-d0a1-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-04T06:00:44.000Z",
      "dateModified": "2025-12-04T06:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A driver killed my parents - attitudes to speeding need to change",
    "url": "https://www.bbc.com/news/articles/c4g9ez9p4y7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3095/live/95e6b8a0-d067-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-04T00:05:23.000Z",
    "description": "A speeding driver killed my parents - there needs to be a cultural change8 hours agoKaty AustinTransport correspondent BBCClaire Corkery is calling fo",
    "body": "A speeding driver killed my parents - there needs to be a cultural change8 hours agoKaty AustinTransport correspondent BBCClaire Corkery is calling for a change in attitudes towards speeding after her parents were killedClaire Corkery was out celebrating a friend's engagement when a call from a policeman changed her life forever.Her parents, Sue and Tom, were walking on a country road when they and the dog they were looking after were hit by a speeding driver and killed.Last week, Scott Gunn, who had reached 87mph in his BMW X5 shortly before the crash, was found guilty of death by dangerous driving and jailed for 16 years.Claire is calling for \"cultural change\" around speeding, which is the most common factor recorded in fatal collisions in Great Britain, according to official data.Claire CorkeryClaire describes her mum Sue as a \"very warm person\" and her dad Tom a \"very clever man\"It was a normal Saturday in January 2024, when Claire was enjoying celebratory drinks with friends, that she spotted a missed call and a message from a policeman. When she called back, he said it was about her mum and dad, and he needed to speak to her in person.\"I think I knew they were both dead,\" she said.\"I had them both on \"Find my Friends\" and I couldn't see where they were. I tried to call them but it went to voicemail.\"She met the police officer at her house, where he delivered the worst possible news.Claire was told there had been ice on the road, and thought it must have been a tragic accident.Sue was a former children's nurse who Claire describes as a \"very warm person\". Tom was an accountant, a \"very clever man\", who liked to help other people. He was about to retire. More than 300 people attended the couple's funeral.The police investigation revealed Gunn had driven the BMW he had recently bought at 87mph shortly before the crash, on Thurnham Lane, in the village of Bearsted in Kent.He had denied causing death by dangerous driving, but was found guilty following a trial.Kent PoliceIn November, Scott Gunn was convicted of causing death by dangerous drivingFor Claire, the sentence brought \"a sense of relief\". However, she also feels \"a pain that's always there\".\"Weddings, birthdays, celebrations, these are joyous moments... But when you have these moments and you've lost someone, the joy becomes bitter sweet.\"Earlier this year Claire became a mum. \"It was really hard going through the pregnancy without my mum and dad,\" she said. \"I feel we've been robbed. My parents would have been fantastic grandparents. They were so loving and so generous with their time.\"Speed most common factor in road deathsLast year, 1,600 fatalities were reported in road collisions in England, Scotland and Wales. This represented a slight fall of 1% compared to 2023.Speed was the most common factor recorded in fatal collisions, according to official statistics published by the Department for Transport.The data also indicates that although more casualties occur on roads in urban areas, collisions in rural areas are more likely to result in death.In 2024, the majority of road fatalities, 60%, occurred in rural areas - despite those roads taking 45% of traffic. Motorways accounted for just 6% of deaths.'Worst examples for some time'Nicholas Lyes, from the road safety charity I AM Roadsmart, described the death of Claire's parents as \"an example of serious speeding and dangerous driving, probably one of the worst examples that I've seen for quite some time\". He said investment is needed to make rural roads safer.On road safety in general, Mr Lyes said: \"I feel that we've had something of a lost decade.  We've seen the number of road traffic collisions and particularly serious [incidents], effectively plateaued. So we're not seeing any great improvement on the numbers.\"He argues a \"perceived lack of enforcement\" could have a part to play on this, but adds \"what we really need to see is an updated road safety strategy\".The government is expected to publish a new road safety strategy by the end of the year. A Department for Transport spokesperson said it was \"committed to reducing deaths and injuries on our roads, and our forthcoming Road Safety Strategy, the first in over a decade, will set out further measures to keep people safe.\"'Cultural change'Claire's anger at the driver who killed her parents is palpable as she speaks to the BBC in her new house in south west London.\"The fact anyone could be so selfish just shocks me today,\" she said.She would like her story to make people to think carefully about how they drive.\"We need to see a cultural change in how we approach speeding and road safety in general,\" she said.\"When we talk about speeding we kind of dismiss it, people say 'oh god, a speeding fine'. They kind of shrug their shoulders and it's almost like it's socially acceptable. But it shouldn't be.\"\"A few seconds is all it takes. My life is completely changed because of it.\"\"Speeding, even for a few seconds it's not worth it - get to your destination five minutes later,\" she said.\"If you are caught speeding and you go on a speed awareness course, or get your 3 points on your licence, take it really seriously and learn from that. And if you can't learn from it, then you shouldn't be driving.\"Chief Inspector Craig West of Kent Police's Roads Policing Unit urged motorists to observe the highway code, particularly in poor weather conditions.\"We remind road users that stopping distances double in wet weather and can be up to 10 times greater in snow and ice. Please drive responsibly, especially as the winter weather sets in,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A driver killed my parents - attitudes to speeding need to change",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3095/live/95e6b8a0-d067-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-04T00:05:23.000Z",
      "dateModified": "2025-12-04T00:05:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reddit strangers were Cardiff couple’s only wedding guests",
    "url": "https://www.bbc.com/news/articles/ce8g8yp1l8jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a68f/live/35eb7610-d09a-11f0-af9b-9b8e7a88ec8c.png",
    "tag": "Trending",
    "date": "2025-12-04T06:00:40.000Z",
    "description": "Couple says 'I do' in front of two strangers found through Reddit2 hours agoEleri GriffithsBBC WalesFelixine HickSeán Mauremootoo says it was \"a reall",
    "body": "Couple says 'I do' in front of two strangers found through Reddit2 hours agoEleri GriffithsBBC WalesFelixine HickSeán Mauremootoo says it was \"a really lovely day\" and that they \"couldn't have asked for more\"Planning a wedding often means stress and endless debates over the guestlist.But Harmony Elmy and Seán Mauremootoo wanted none of that, choosing to elope to a place that held \"special\" memories for them both.The couple, who live in Norwich, travelled 261 miles (420km) to Cardiff for their unconventional ceremony, attended by just two guests they met after posting on Reddit.With a minimum requirement of two witnesses to a marriage in the UK, Mr Mauremootoo said they picked strangers Ruairi and Sam over friends and family in order to keep the day \"easy, natural and stress-free\". Felixine HickAfter the ceremony, the couple had their first dance to Waterloo Sunset in Bute ParkTheir wedding day involved their favourite things - fish and chips on Penarth Pier, an escape room and a carousel ride in Cardiff Bay.\"It was a day where we really felt like we got to celebrate the love we have for each other - and feel the love from the people of Cardiff,\" said Mr Mauremootoo, 32.RedditA few months before the wedding, Mr Mauremootoo posted on Reddit asking for two witnesses to join them for their ceremonyHe and Ms Elmy, 31, met while studying the same course and living in the same halls at Queen Mary University of London. \"We never really planned our relationship,\" he said. \"Everything just felt natural - from being friends, to dating, to moving in together, even doing long distance.\"To pop the question he designed a homemade escape room, which is one of their favourite things to do together.The pair decided a traditional wedding wasn't for them and instead chose to tie the knot in Cardiff, a city they had visited several times when they lived in Worcester.'Wouldn't change a thing'The couple said they picked a date - 1 August - about a year in advance so they could explain the plan to their parents, who were \"incredibly supportive\", said Mr Mauremootoo.He said he expected little interest when he posted on Reddit a few months before the wedding asking for two witnesses, but was met with an \"overwhelming response\". Ruairi was one of those who stepped forward, and Sam, his friend, joined for the occasion.Mr Mauremootoo added the pair felt like a natural fit and were \"so accommodating\", asking thoughtful questions, even what they should wear.\"As long as you're not in a wedding dress, you're fine,\" he told them. \"It all just fell into place.\"Felixine HickThe newlyweds went to Bakestones in Cardiff Market for a Welsh cake instead of a wedding cakeOn the day of the wedding, the couple walked to the Temple of Peace for the ceremony before having their first dance to Waterloo Sunset in the nearby park.Mr Mauremootoo said the area was busy because of a Faithless concert and strangers kept stopping to congratulate them and take photos.\"It felt very glamorous for what we thought would be a low-key affair,\" he said. \"It was so kind-hearted and really made it special.\"Escape Rooms CardiffDuring the day, the pair completed an escape room - one of their favourite activities After a chippy lunch, they headed to Cardiff Bay for a Mr Whippy ice cream, the carousel and the big wheel, followed by an escape room where staff surprised the bride with a huge bouquet of flowers.The day ended with dinner at CasaNova, where another couple, Rob and Ruth, \"quietly\" paid their bill - a gesture Mr Mauremootoo described as \"incredibly touching\".They told the pair they had recently celebrated 50 years together, he said.Felixine HickThe pair, from Norwich, eloped 261 miles to Cardiff for their unconventional wedding The newlyweds said they \"wouldn't change a thing\" about their big day, which also included eating a Welsh cake in lieu of a wedding cake.Mr Mauremootoo described it as a \"really lovely day\" with \"perfect\" weather, adding that they \"couldn't have asked for more\".While their families did join the ceremony by video call, the \"love and kindness from strangers made the day even more special\", he said.\"Cardiff has always meant a lot to us but this made it even more meaningful. I don't think we could ever replicate it or have done it better even if we tried.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reddit strangers were Cardiff couple’s only wedding guests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a68f/live/35eb7610-d09a-11f0-af9b-9b8e7a88ec8c.png"
      ],
      "datePublished": "2025-12-04T06:00:40.000Z",
      "dateModified": "2025-12-04T06:00:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Previously unseen images of Jeffrey Epstein's island released ",
    "url": "https://www.bbc.com/news/articles/c4g5rrlve33o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3d26/live/90ef1cb0-d086-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-04T00:02:54.000Z",
    "description": "8 hours agoBernd Debusmann JrWatch: Newly released video of Jeffrey Epstein's private island homeDemocrats on the House Oversight Committee have relea",
    "body": "8 hours agoBernd Debusmann JrWatch: Newly released video of Jeffrey Epstein's private island homeDemocrats on the House Oversight Committee have released never-before-seen images of Jeffrey Epstein's infamous island. The photographs and video appear to show several bedrooms in the US Virgin Islands home, as well as a room with masks on a wall and a phone with names written on speed-dial buttons.In a statement, the committee's Democratic leader, Robert Garcia, said they collectively form a \"disturbing look\" into Epstein's world and are being released to \"ensure public transparency\".On 19 November, President Donald Trump signed a bill that ordered the release of government files on the late convicted sex offender - a significant turning point in a months-long fight over the documents.US CongressUS CongressMultiple survivors have alleged that they were trafficked to and abused on the island, known as Little St James, which Epstein purchased in 1998.The new images from 2020 also show what appears to be a dental chair and a room with a black chalkboard on which is scrawled with words including \"truth\", \"deception\" and \"power\". Some of the words have been redacted. In a statement, Democrats on the oversight committee said that the images and videos stem from an 18 November request to the attorney general of the US Virgin Islands for information about investigations into Epstein and his imprisoned co-conspirator, Ghislaine Maxwell. \"These new images are a disturbing look into the world of Jeffrey Epstein and his island,\" Garcia said. \"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes,\" he added. \"We won't stop fighting until we deliver full picture of Epstein's horrific crimes.\" According to Garcia, the committee has also received records from JP Morgan and Deutsche Bank, which they intend to release \"in the days ahead\".Little St James was one of two islands in the Virgin Islands owned by Epstein. In 2022, the attorney general of the US territory reached a settlement of over $105m (£78.6m) after local authorities alleged that \"dozens of young women and children\" were trafficked, raped and assaulted on the two islands. The images shed little new light on the case, besides providing a glimpse of one of Epstein's crime scenes and opulent lifestyle in the Virgin Islands. The release, however, comes as the Trump administration remains under pressure to release the broader set of documents kept by the US justice department, with Garcia saying in his statement that \"it's time for President Trump to release all the files, now\". Later on Wednesday, the committee released a second batch of some 200 images as well as several videos. Most of those showed the same rooms as the first batch, with some new close-ups of the apparent dentist chair and the masks on the walls of that room.All of the masks are in a similar style and depict male faces.Other images show personal items around the house, such as a large selection of shampoos and conditioners and various art items including statues and paintings.There is also a picture of Epstein and Maxwell meeting Pope John Paul II.The photos seem to have been taken in 2020 according to the metadata - after the death of Jeffrey Epstein in 2019 - so the house appears to have been packed away, with furniture stacked up and artwork removed from walls.US CongressUS CongressOne image shows a telephone with names written on speed-dial buttonsThe release also includes a video showing a walk through of Epstein's property. It shows a palm tree-lined swimming pool with a statue of an archer and a path to the ocean.The bill Trump signed last month gives the department a 30-day window - until 19 December - to make them available in a \"searchable and downloadable format\".But there are obstacles to the files being shared with the US public on that date.For one, the bill said that the justice department can hold back any documents that jeopardise \"an active federal investigation or ongoing prosecution, provided that such withholding is narrowly tailored and temporary\".That could potentially lead to delays, given that Trump has called for investigations into Epstein's links with prominent Democrats, such as Bill Clinton and former Treasury secretary Larry Summers \"to determine what was going on with them, and him [Epstein]\".The latest bill also says Attorney General Pam Bondi can \"withhold or redact\" records that include victims' names, medical files and other personal information that \"would constitute a clearly unwarranted invasion of personal privacy\".US CongressVarious bedrooms on the property were shown in the new images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Previously unseen images of Jeffrey Epstein's island released ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3d26/live/90ef1cb0-d086-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-04T00:02:54.000Z",
      "dateModified": "2025-12-04T00:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eurovision faces crucial decision over Israel",
    "url": "https://www.bbc.com/news/articles/cx2gq5q5p47o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/212e/live/9a6aa1d0-d061-11f0-b76c-637a0d75f572.jpg",
    "tag": "Trending",
    "date": "2025-12-04T00:30:19.000Z",
    "description": "8 hours agoMark SavageMusic correspondentGetty ImagesSinger Yuval Raphael, who survived the 7 October Hamas attack in 2023, represented Israel at this",
    "body": "8 hours agoMark SavageMusic correspondentGetty ImagesSinger Yuval Raphael, who survived the 7 October Hamas attack in 2023, represented Israel at this year's EurovisionThe Eurovision Song Contest faces a battle for its future at a \"watershed\" meeting in Geneva on Thursday.Organisers and participating countries will debate whether Israel should be allowed to continue in the competition, amid protests over the way its government conducted its war in Gaza, and accusations of unfair voting practices.Countries including Ireland, Spain, the Netherlands and Slovenia have said they will boycott Eurovision if Israel participates. Germany has indicated it will pull out if Israel is excluded.The meeting comes after anti-Israel protesters attempted to disrupt both the 2024 and 2025 contests, citing their opposition to the Palestinian death toll in Gaza.During this year's grand final in Basel, Switzerland, two people attempted to storm the stage and throw paint over Israel's contestant, Yuval Raphael. They were stopped by crew members and later arrested.Raphael eventually took second place in the contest, after a convincing victory in the public vote.However, the result triggered a backlash from other countries, who said Israel's government had artificially boosted their position through a broad, paid-for advertising campaign, urging people across Europe to vote for their song.Israel has not responded to these accusations but frequently argues it has faced a global smear campaign.Last month, Eurovision organisers announced they were tightening the competition's voting rules to limit the influence of governments on the results.The BBC's Colin Paterson explains why the Eurovision rules are being changedWithout naming Israel, the European Broadcasting Union  (EBU) said it would \"discourage disproportionate promotion campaigns\", particularly if they were \"undertaken or supported by third parties, including governments or governmental agencies\".It also announced that fans would only be able to cast 10 votes each, down from 20; and that steps would be taken to improve the detection of \"fraudulent or co-ordinated voting activity\".\"We very much hope the package of measures will assure members that we have taken strong action to protect the neutrality and impartiality of the Song Contest,\" the EBU said.'Crisis point'It is hoped that the new rules will be enough to assuage participants' concerns over Israel's presence at the contest.The package will be put to EBU members - including BBC director general Tim Davie - at the organisation's biannual general meeting on Thursday. If they are not convinced the changes are adequate, there will be a vote on Israel's future.Natalija Gorščak, president of the management board at Slovenian broadcaster RTV, told BBC News she expected such a vote to go in Israel’s favour.If that were to happen, Slovenia would refuse to participate in or broadcast the contest.“I know that fans in Slovenia are disappointed,” Gorščak said. “I'm a fan as well and it's so bad because Vienna is so close to us and we won't be able to go. “But still, we need to follow our principles and I think this is the correct way. Sometimes we need to be on the right side of history and this is the moment we are on the right side of history.”Eurovision expert Paul Jordan called the situation “a real crisis point for Eurovision and the EBU“.\"There are no winners here. And it's a great shame that something which is meant to be apolitical has actually become a bit of a political football.\"ReutersThe 2026 contest will be held in Vienna, Austria - after their competitor, JJ, won this year's editionA vote on Israel's participation was originally due to take place in November, but it was cancelled after the declaration of a ceasefire in the Gaza Strip on 10 October.Roland Weissman, director general of Austrian broadcaster ORF - which will host next year's contest in Vienna - subsequently travelled to Israel to meet with its Eurovision team and Israeli President Isaac Herzog.There, he told reporters that Israel is \"an inseparable part of Eurovision\".Others disagree. Spain, one of the \"Big Five\" countries that contribute significant funding and audiences to Eurovision, has pledged to withdraw if Israel competes, saying the country had used the competition politically.Speaking to a parliamentary commission, the president of Spanish broadcaster RTVE said he felt Israel's participation was \"untenable\", calling its actions in Gaza a genocide.\"As President of the (RTVE) corporation, I keep thinking that Eurovision is a contest, but human rights are not a contest,\" he said.Israel has consistently denied accusations of genocide in Gaza, where the death toll has surpassed 70,000, according to Hamas-run health authorities.If a vote against Israel were successful, Germany would probably withdraw and not broadcast the contest, a broadcasting industry source told the Reuters news agency.Sources within Israeli broadcaster KAN said it believed discussions about excluding Israel were unjustified, asserting that KAN was in full compliance with EBU rules.On Wednesday, pre-empting the EBU's general meeting, the broadcaster issued a press release confirming it was pressing ahead with its preparations for the 2026 contest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eurovision faces crucial decision over Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/212e/live/9a6aa1d0-d061-11f0-b76c-637a0d75f572.jpg"
      ],
      "datePublished": "2025-12-04T00:30:19.000Z",
      "dateModified": "2025-12-04T00:30:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]