[
  {
    "title": "Newscast - The Week: Immigration Reform, Burnham And The Budget - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhzlr1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Nov 2025,·28 minsThe Week: Immigration Reform, Burnham And The BudgetNewscastAvailable for over a yearToday, the home secretary makes second big change to migration policy in a week. \nShabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million who arrived since 2021. The changes will not apply to people who had already obtained settlement. Adam, Joe, Faisal and Sarah Montague, presenter of the World at One, discuss this plus more Labour leadership questions and preview the budget.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producers were Joe Wilkinson and Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Immigration Reform, Burnham And The Budget - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Why was KPop Demon Hunters banned by a school?",
    "url": "https://www.bbc.com/news/articles/cj414lgjykpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/3f796040-c639-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T19:36:18.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live21 ",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live21 hours agoThis week, Donald Trump ordered the release of the Epstein files, heavy rain and cold weather gripped the UK, and the BBC's annual Children In Need appeal raised more than £45m for charity.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy testing your memory? Try last week's quiz, or have a go at something from the archives.TelevisionK-popFilmSouth KoreaNetflix",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Why was KPop Demon Hunters banned by a school?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/3f796040-c639-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T19:36:18.000Z",
      "dateModified": "2025-11-20T19:36:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scientists reveal what triggered Santorini 'earthquake swarm'",
    "url": "https://www.bbc.com/news/articles/cz7p783g2j5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f1d/live/40020cb0-c643-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-21T01:52:15.000Z",
    "description": "14 hours agoVictoria GillScience correspondentThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this year was",
    "body": "14 hours agoVictoria GillScience correspondentThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this year was triggered by molten rock pumping through an underground channel over three months, scientists have discovered.They used physics and artificial intelligence to work out exactly what caused the more than 25,000 earthquakes, which travelled about 20km (12 miles) horizontally through the Earth's crust. They used each of the tremors as virtual sensors, then used artificial intelligence to analyse patterns associated with them.One of the lead researchers, Dr Stephen Hicks from UCL, said combining physics and machine learning in this way could help forecast volcanic eruptions.The seismic activity started to stir beneath the Greek islands of Santorini, Amorgos, and Anafi in January 2025. The islands experienced tens of thousands of earthquakes - many of which were over magnitude 5.0 and could be felt.Many tourists fled, and locals feared that the nearby underwater volcano, Kolumbo, might be about to erupt -  or that this was a seismic prelude to a larger earthquake, like the devastating, magnitude 7.7 quake that struck the same region in 1956.The scientists, who published their findings in the journal Science, created a 3D map of the Earth around Santorini. They then mapped the evolving patterns of seismic activity of each tremor and the movement and stress in the crust. This resulted in a detailed model of exactly what drove this months-long seismic swarm.The team found that the event was driven by the horizontal movement of magma - from beneath Santorini and the Kolumbo volcano - through a 30km channel that is more than 10km beneath the seafloor between the two islands of Santorini and Anydros.The researchers estimated that the volume of magma that moved through the crust could have filled 200,000 Olympic-sized swimming pools. These \"magma intrusions\", as they are known, smashed through layers of rock, triggering thousands of tremors. Lead author on the study, Anthony Lomax, a research geophysicist who develops scientific software to analyse seismic activity, explained: \"The tremors act as if we had instruments deep in the Earth, and they're telling us something.\"[When we analyse] the pattern those earthquakes make in our 3D model of the Earth, it matches very, very well what we expect for magma moving horizontally.\"For now, the researchers say, it appears to be over.\"The magma remained quite deep - more than 8km depth - in the crust,\" explained Dr Hicks. \"We know that magma can ascend and erupt at the surface in a matter of hours to days, but because the activity has now died down, we can be almost certain that the melt eventually got stuck and cooled down deep in the crust.\"Volcanoes, though, can enter prolonged phases of unrest and unpredictability that can last many years. Recent volcanic activity in south-west Iceland has demonstrated that.And these researchers say using AI, in combination with the fundamental physics of how the Earth's crust moves and responds to stress, could transform the ability to monitor, understand and even forecast volcanic activity. This could help keep people in seismically active parts of the world safe.\"Ultimately, this could be used as a forecasting tool,\" explained Dr Hicks. Whenever we see a cluster of earthquakes, \"that is data that can be used to work out the most likely cause\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scientists reveal what triggered Santorini 'earthquake swarm'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f1d/live/40020cb0-c643-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-21T01:52:15.000Z",
      "dateModified": "2025-11-21T01:52:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - The cost of USAID cuts to women in Afghanistan - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct719b?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mb7yc6.jpg",
    "tag": "Trending",
    "date": "2025-11-06T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·23 Oct 2025,·26 minsAvailable for over a yearSince the Taliban takeover in 2021, the US has contributed billions of dollars in aid to Afghanistan for food and medical care – a lifeline in a country ravaged by two decades of war. \nBut earlier this year, following deep cuts to USAID under the Trump administration, more than 400 USAID-backed medical clinics have closed, and for pregnant women in desperate need of care, the impacts are devastating. \nThe BBC’s South Asia and Afghanistan correspondent, Yogita Limaye, tells us about the families she met on her recent reporting trip, and the lives lost because women did not get the care they needed. \nProducer: Hannah Moore \nMix: Travis Evans \nSenior news editor: China Collins\nPicture: Taliban bans female medical education, Afghan female doctors and midwives face setback, Kabul, Afghanistan, 24 Dec 2024. Samiullah Popal/EPA-EFE/REX/ShutterstockProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - The cost of USAID cuts to women in Afghanistan - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mb7yc6.jpg"
      ],
      "datePublished": "2025-11-06T10:00:00.000Z",
      "dateModified": "2025-11-06T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gabriel injury: Arsenal defender out for weeks with thigh injury",
    "url": "https://www.bbc.com/sport/football/articles/cdd579dnpp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b81/live/d0d8d700-c6d9-11f0-a418-cd69f988232b.jpg",
    "tag": "Trending",
    "date": "2025-11-21T14:26:46.000Z",
    "description": "Arsenal defender Gabriel will be unavailable for \"weeks\" after sustaining a thigh injury on international duty, says head coach Mikel Arteta.The centr",
    "body": "Arsenal defender Gabriel will be unavailable for \"weeks\" after sustaining a thigh injury on international duty, says head coach Mikel Arteta.The centre-back limped off in visible discomfort during Brazil's friendly against Senegal at Emirates Stadium last weekend and was ruled out of the draw against Tunisia three days later. The 27-year-old has been in fantastic form for the Gunners, being a key part of a defence that has conceded just five league goals so far this season as they have opened a four-point lead at the top of the table.\"Gabi is going to be out for weeks,\" said Arteta, who added that the defender will have another scan next Wednesday, which should give a clearer timeframe of how long he will be out for.Piero Hincapie and Cristhian Mosquera are both in contention to deputise for Gabriel when Arsenal host rivals Tottenham on Sunday (16:30 GMT).\"It's clearly a blow because he's our leader in our backline and to me it's never a positive thing,\" added Arteta.\"The good thing is that we have very good options and people have to stand up now and do the job.\"Gabriel, a £23.1m signing from Lille in 2020, has started all 11 of Arsenal's Premier League matches this term.Defender Riccardo Califiori is a doubt for the north London derby, having withdrawn from international duty with Italy with a hip problem.The Italian is yet to train since returning to London but Arteta says he will be given every opportunity to prove his fitness. \"He has been carrying a few things,\" said Arteta.\"He hasn't trained yet. Tomorrow we have another training session, let's see how he is.\"Swedish striker Viktor Gyokeres remains unavailable with a hamstring problem. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gabriel injury: Arsenal defender out for weeks with thigh injury",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b81/live/d0d8d700-c6d9-11f0-a418-cd69f988232b.jpg"
      ],
      "datePublished": "2025-11-21T14:26:46.000Z",
      "dateModified": "2025-11-21T14:26:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eurovision Song Contest changes rules after Israel voting controversy",
    "url": "https://www.bbc.com/news/articles/cly2yey51wko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/40bd/live/738f5ab0-c6cf-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T09:10:25.000Z",
    "description": "7 hours agoLauren Turner and Ian Youngs,Culture reporterGetty ImagesIsrael's Yuval Raphael topped the public vote at this year's contest, and finished",
    "body": "7 hours agoLauren Turner and Ian Youngs,Culture reporterGetty ImagesIsrael's Yuval Raphael topped the public vote at this year's contest, and finished second overallThe Eurovision Song Contest is changing its rules around voting and promotion in the wake of controversy about Israel's result at this year's competition.Some countries raised concerns after Israel topped the public vote at the contest in May, finishing second overall after the jury votes were taken into consideration.Fans will now be able to cast 10 votes each, down from 20, and juries will return for the semi-finals.Organisers will also ban contestants and broadcasters from taking part in promotional campaigns by third parties including governments. Last year, there were reports that an Israeli government agency paid for adverts and used state social media accounts to encourage people to vote for its entry.Eurovision director Martin Green said there had been \"a lot of feedback from members and our fans\" following the 2025 show, saying they wanted Eurovision to \"have a good look at our rules\".\"There was a little fear that we're seeing some undue promotion particularly by third parties, perhaps governments, that are out of proportion of the rest of the natural promotion that you should see in the show,\" he said.He stressed he was \"not going to single any one participating broadcaster out\" but that the changes had been triggered by a number of promotional campaigns over recent years - especially by third parties - that were \"out of kilter\" with the spirit of the annual contest.Getty ImagesMartin Green said he hoped the measures would reassure participating broadcastersThe presence of Israel at Eurovision has also faced opposition from some participating countries because of the war in Gaza.Spain, Ireland, Slovenia, Iceland and the Netherlands have all said they would consider boycotting next year's contest if Israel takes part. While Green did not address Israel's participation directly, he said he hoped the measures would \"give people reassurance that the contest remains an impartial and neutral space\".In a statement, he added: \"We are taking clear and decisive steps to ensure the contest remains a celebration of music and unity. The contest should remain a neutral space and must not be instrumentalised.\"The new rules:They will \"discourage disproportionate promotion campaigns... particularly when undertaken or supported by third parties, including governments or governmental agencies\". Organisers said broadcasters and artists would not be permitted to \"actively engage in, facilitate or contribute to promotional campaigns by third parties that could influence the voting outcome\".The number of votes that can be cast by members of the public will be cut from 20 to 10 per person, which Green said would mean people could still spread their votes \"amongst many acts\". After this year's contest, a Flemish MP said allowing 20 votes was \"a system that encourages manipulation\".Juries, currently only used for the grand final, are being brought back for the semi-final stage to \"make sure we're assuring that quality, that diversity of music\", Green said, \"as well as respecting what the public want\".Organisers will improve technical monitoring to \"detect and prevent fraudulent or co-ordinated voting activity, and strengthen monitoring of suspicious patterns\".Boycott threatA vote on Israel's participation had been due to take place in November, but the European Broadcasting Union, organisers of the annual contest, cancelled it due to \"recent developments in the Middle East\", including the ceasefire in Gaza.It said at the time that Israel's participation would instead be discussed at an in-person meeting in December, but it is not yet clear if a vote will still take place.Green said broadcasters and their artists participate, not governments, and it was important to \"keep the geopolitics off of the stage\".Austrian national broadcaster ORF, which will host the contest in 2026, has previously urged countries not to boycott the contest next year in Vienna.Asked if the vote would still be happening, Green said: \"We very much hope this package of measures gives our members the reassurance they need to ensure Eurovision remains a neutral and impartial space.\"Israel came second in the most recent Eurovision Song Contest in May, with its singer Yuval Raphael receiving the largest combined public vote.However, the addition of jury votes led to Austria's JJ being declared the winner for his song Wasted Love.ReutersJJ, the winner of the 2025 Eurovision Song Contest for Austria The final of the 70th Eurovision Song Contest will be held on 16 May. The semi-finals will be held earlier that week at the same venue, the Wiener Stadthalle. It will be the third time Vienna has hosted the annual show, most recently held there in 2015.  In the UK, Eurovision is broadcast by the BBC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eurovision Song Contest changes rules after Israel voting controversy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/40bd/live/738f5ab0-c6cf-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T09:10:25.000Z",
      "dateModified": "2025-11-21T09:10:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Laos methanol poisoning: Victim's brother pushes for answers",
    "url": "https://www.bbc.com/news/articles/c3dnd9pxpzeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc37/live/12495110-c630-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-21T06:17:30.000Z",
    "description": "'Seeing friends drink shots brings back sister's methanol death'10 hours agoJack GrayBBC NewsbeatZak WhiteZak White's sister Simone died after drinkin",
    "body": "'Seeing friends drink shots brings back sister's methanol death'10 hours agoJack GrayBBC NewsbeatZak WhiteZak White's sister Simone died after drinking a shot laced with methanol in LaosAt Zak White's family home you don't have to look far to spot a photo of his older sister, Simone.There are shots of graduations, holidays - typical reminders of special moments and milestones.Simone's passion, though, was seeing the world. Late last year, she headed out on what was supposed to be the trip of a lifetime, backpacking with mates in Laos, south-east Asia.\"She was really excited because she was going out there to meet up with her friend Bethany [Clarke], who she hadn't seen for seven months,\" Zak tells BBC Newsbeat.He says his 28-year-old sister, a trainee lawyer, was a \"very experienced traveller\", so seeing her off was nothing out of the ordinary.The siblings' farewell was \"more just wishing her to go and have a nice time\", says Zak. \"'See you when you're back', kind of thing.\"It was the last time he would see her.'We'll never get justice'Simone was one of six tourists who died after drinking free shots at a hostel in Vang Vieng, Laos' famous party town.It is thought those drinks were tainted with methanol, a toxic substance normally found in paint thinner but that is sometimes mixed with alcohol illegally to cut costs.Simone and Bethany started to feel unwell after their night at the Nana Backpacker Hostel, when about 100 guests were given free shots.After the friends were admitted to hospital and diagnosed with methanol poisoning, Simone's family was contacted.\"I remember my mum got told it was serious and she should go and fly out there. I remember it not kind of really feeling real,\" says Zak.Simone was eventually put on life support - but it was too late. \"Not really knowing what was going on, that was quite difficult,\" says Zak.\"I didn't think she was ever going to die.\" He says losing Simone still weighs heavy on him.\"I don't drink, but when I go out to bars and things with my friends I still get a bit nervous and anxious when I'm at a bar and they drink shots and things,\" he says. \"It kind of brings it all back, really.\"Who is responsible? White FamilySimone had been staying at the Nana Backpacker Hostel in Vang ViengWhile the future of the Nana hostel remains unclear, Zak says Simone's family are no closer to getting answers about who's responsible for her death.Emails from the UK and Australian governments, seen by Newsbeat, claim charges have been proposed against 13 people in Laos.They're accused of offences linked to food safety breaches, which would not find anyone legally responsible for Simone's death. Reports have suggested the hostel is preparing to reopen with a new name.\"I can't believe it's trying to reopen,\" says Zak. \"It's taken six people's lives.\"I just feel sorry and worried for any young traveller that's going there, because they're almost playing Russian roulette with their lives if this hostel reopens.\"Backpackers have told Newsbeat Vang Vieng is a \"ghost town\" heading into high season, and tourism may have been affected by the deaths and investigation that followed.Newsbeat has attempted to contact the Nana Backpacker Hostel's owner and authorities in Laos for comment.'Let down' by Foreign OfficeSimone's family say they've found themselves having to chase the UK government for new information on the investigation, with the last substantial update in May.Zak says the Foreign Office, the government department that deals with deaths abroad, could have done more.It says it's been \"working hard\" to raise awareness of the risk of methanol poisoning since last November. This has included highlighting 27 countries deemed high-risk, and working with content creators to spread messages on social media.But Zak doesn't think these steps are enough.He echoes the feelings of Simone's friend, Bethany, who has also expressed doubts about the effectiveness of the Foreign Office's campaign. \"I'd love for there to be a push from the prime minister to try and get some more information from the Laos government,\" he says.BBC Newsbeat put the family's criticisms of the government and concerns about the awareness campaign to the Foreign Office.In response, the department said: \"No family should endure what the campaigners' families, including the family of Simone White, have suffered. \"Their determination to prevent others facing the same tragedy has been instrumental in driving forward these vital updates to our travel advice.\"White familyZak says Simone was a \"kind and caring\" sisterSimone's family remains frustrated with the lack of information from Laos.\"I think we've perhaps accepted we're not going to get answers, but that shouldn't be the case,\" says Zak.\"There's been no justice at all, really.\"We just want to know what's going on.\"His thoughts turn to Simone, and the memories that remain.\"She always wanted the best for me. She was really kind and caring and she always stood up for what she believed in,\" he says.\"Every day is really hard and challenging without her. People say it gets better with time, but it doesn't really. \"Just great sadness she's not here any more.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Laos methanol poisoning: Victim's brother pushes for answers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc37/live/12495110-c630-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-21T06:17:30.000Z",
      "dateModified": "2025-11-21T06:17:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "St Mary's School in Niger state: Pupils abducted from Nigerian Catholic school ",
    "url": "https://www.bbc.com/news/articles/cj4qxvy74qyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8c6/live/4a896900-c6cd-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-21T13:58:46.000Z",
    "description": "Pupils abducted from Catholic school in fresh Nigeria attack 2 hours agoChris Ewokor,BBC Africa, in Abuja, and Wycliffe MuiaGoogleAn unknown number of",
    "body": "Pupils abducted from Catholic school in fresh Nigeria attack 2 hours agoChris Ewokor,BBC Africa, in Abuja, and Wycliffe MuiaGoogleAn unknown number of pupils have been abducted by armed men from a Catholic school in central Nigeria, the second mass school kidnapping this week. The latest attack targeted St Mary's School in Papiri, Niger state, where authorities had already ordered the temporary closure of all boarding schools due to rising security threats.Details remain unclear but residents fear that close to 100 students and staff may have been taken away during the early-morning raid. Nigeria has faced a renewed wave of attacks by armed groups in recent days, including the kidnapping on Monday of more than 20 schoolgirls, who the BBC has been told are Muslim, from a boarding school in neighbouring Kebbi state.A church was also attacked in the south-western Kwara state, with two people killed and 38 abducted while the service was being broadcast online.Police said armed men - locally known as bandits - stormed St Mary's School on Friday at about 02:00 local time (01:00 GMT) and abducted an unconfirmed number of students from their hostel. Fear and uncertainty have gripped the area as families wait for news.The authorities in Niger state said the school had disregarded an order to close all boarding facilities following intelligence warnings of a heightened risk of attacks.\"Regrettably, St Mary's School proceeded to reopen and resume academic activities without notifying or seeking clearance from the state government, thereby exposing pupils and the staff to avoidable risk,\" they said in a statement.The school has not commented.The police said that security agencies were \"combing the forests with a view to rescue the abducted students\".The attack follows claims by US President Donald Trump that Christians are being persecuted in Nigeria, an allegation dismissed by the Nigerian government.Earlier this month, Trump said he would send troops into Nigeria \"guns a-blazing\" if its government \"continues to allow the killing of Christians\".The Nigerian government has pushed back on these claims, describing them as \"a gross misrepresentation of reality\".An official said that \"terrorists attack all who reject their murderous ideology - Muslims, Christians and those of no faith alike\".Nigeria is currently grappling multiple overlapping security crises.The country's 220 million people are roughly evenly split between followers of the two religions, with Muslims in the majority in the north.The kidnapping of people for ransom by criminal gangs, known locally as bandits, has become a major problem in many parts of the country.Africa Independent Television via ReutersArmed men exchanged fire with police officers before abducting girls from this school in Maga, Kebbi state, earlier this weekIn the north-east, jihadist groups have been battling the state for more than a decade. Organisations monitoring violence say most of the victims of these groups are Muslim because most attacks happen in the north.In the centre of the country, there are also frequently deadly attacks between herders, who are mostly Muslim, on farmers, who are largely Christian. However, analysts say these are often motivated by competition for resources such as water or land, rather than religion.Local media report that the kidnappers have demanded a ransom for those abducted from the church in Eruku, Kwara state.The payment of ransoms has been outlawed in an attempt to cut the supply of money to the criminal gangs but to little effect.Two of the schoolgirls abducted on Monday in Maga, Kebbi state have managed to escape, while 23 are still missing. Two people were killed in that attack. They were both Muslim.President Bola Tinubu this week postponed his foreign trips to address the rising wave of attacks across Africa's most populous country.More about Nigeria from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "St Mary's School in Niger state: Pupils abducted from Nigerian Catholic school ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8c6/live/4a896900-c6cd-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-21T13:58:46.000Z",
      "dateModified": "2025-11-21T13:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kate Forbes: Being a mum is harder than being deputy first minister",
    "url": "https://www.bbc.com/news/articles/c620281p8pko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/851e/live/e30ec7b0-c62d-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T06:20:34.000Z",
    "description": "10 hours agoLaura GoodwinBBC ScotlandBBCKate Forbes is due to leave the Scottish parliament in 2026 Kate Forbes has admitted that motherhood is more d",
    "body": "10 hours agoLaura GoodwinBBC ScotlandBBCKate Forbes is due to leave the Scottish parliament in 2026 Kate Forbes has admitted that motherhood is more difficult than being deputy first minister of Scotland.The Skye, Lochaber and Badenoch MSP has revealed that trying to manage a huge job in government, a young family and a lengthy commute to parliament have proven impossible.Talking about her reasons for walking away from politics, she told BBC Scotland News that nothing would tempt her back - not even the top job.\"From the very depths of my heart, I have no intentions of coming back to politics,\" she said.\"I can't promise you what I will be doing age 75, but I have no desire to return to frontline politics anytime soon.\"And I don't think there is any prize that's big enough to change my mind.\"Getty ImagesForbes was the first woman to deliver a Scottish BudgetThree months ago, Forbes - once a rising star of the SNP government - dropped the bombshell that she would not stand in next year's Scottish election.She insists she has had no wobbles since her announcement that she would now focus on family life.We are meeting in her hometown of Dingwall, 168 miles from Edinburgh where the Scottish Parliament sits.It is by any stretch, a hefty weekly commute and coupled with a young family and a demanding job, she says it became too big a challenge.A young high-flier, Forbes was thrust into the spotlight in February 2020 when she was promoted to finance secretary following the resignation of Derek MacKay.Earlier that month, with less than 24-hours' notice, she had become the first woman to deliver a Scottish Budget.Forbes marked another first when she became the first Scottish cabinet minister to take maternity leave, when she left to have her daughter Naomi in August 2022.'I realised I didn't have to'Already a step-mum to three daughters, it was coming back to work after having Naomi that saw problems appear.She said: \"I went back to work post maternity leave. It has always felt impossible. Every day has felt like an exercise in logistical impossibilities, and we got through it.\"It was after a summer break with the family that she decided not to return to politics.\"Then it was like this epiphany - this bolt from the blue - that I didn't have to,\" she said. \"I had choices I could make.\"Despite Holyrood's claim to be a family-friendly parliament, four female MSPs cited family as their reason for not seeking re-election in 2021.This year it emerged seven MSPs were choosing to leave after only a single term at Holyrood.All are female, and concerns have been raised about young women like junior minister Natalie Don-Innes leaving parliament to focus on their families.Getty ImagesForbes would take her daughter Naomi to work with her at the Scottish ParliamentForbes has criticised the Scottish Parliament's crèche facilities, which are only available for three hours a day from Tuesday to Thursday.The Scottish Parliament said its creche capacity was limited due to space but added it was \"constantly looking\" for ways to support members with caring responsibilities.The deputy first minister said: \"I am not the first and, unless anything changes, I am unlikely to be the last.\"So many parents know the pressures and the guilt of balancing all of this.\"Since announcing her decision to leave, she says other women have spoken to her about the difficulties they face in juggling motherhood and work.\"I hear that a lot from other women and I will hear it in the context of it being really difficult but not as difficult as my life and my job. My response to them is always,  from someone who has done the second biggest job in the Scottish government and been a mum - being a mum is harder.\"Getty ImagesKate Forbes was criticised for her faith and views on issues like gay marriage, gender and children born outside marriageIn her 10 years at Holyrood, Forbes rose through the ranks to her current position as John Swinney's deputy.She was seen as a potential future first minister, and came out of maternity leave early to run in the party's leadership race after the departure of Nicola Sturgeon.In March 2023, she came second to Humza Yousaf in that race.During the leadership campaign, Forbes faced criticism for her stance on issues like gay marriage, gender and children born outside marriage.\"The problem with our media culture is there is no space for nuance. In a lot of these issues there needs to be space for genuine open conversation,\" she said. Asked what she would do if one of her girls came to her and said, 'Mum I am pregnant' or 'I am gay' or 'I am trans', she says: \"Exactly as I would handle anything they come and speak to me about.\"Exactly as any mum would handle anything from a daughter or son, which is 'What do you need?' \"I am not challenging the question - but I think the premise of that question is the suggestion that people of faith can't love their kids in the same way that anyone can love their kids. All of us - faith or no faith - have a moral compass by which they live their lives.\"Getty ImagesA mother has never been first minister of Scotland. Given her experience, Forbes says she does think it would be possible, but with certain adjustments.\"Yes - but only with the right support around her,\" she said. \"Government taking seriously that she may not be able to do commitments before a certain time in the morning.\"It would need civil service support around her - including recognition that she will need support with her children and her family.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate Forbes: Being a mum is harder than being deputy first minister",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/851e/live/e30ec7b0-c62d-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T06:20:34.000Z",
      "dateModified": "2025-11-21T06:20:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sweaty Betty offered Middlesbrough trainer £4k for slogan use and silence",
    "url": "https://www.bbc.com/news/articles/cq50n57e64do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53c2/live/e5051530-c487-11f0-81c9-694acfdc27bb.jpg",
    "tag": "Trending",
    "date": "2025-11-21T14:48:03.000Z",
    "description": "1 hour agoStuart Whincup and Tom Burgess,North East and CumbriaBBCGeorgina Cox says she wants Sweaty Betty to apologiseA personal trainer has revealed",
    "body": "1 hour agoStuart Whincup and Tom Burgess,North East and CumbriaBBCGeorgina Cox says she wants Sweaty Betty to apologiseA personal trainer has revealed women's activewear brand Sweaty Betty offered her a settlement of £4,000 over a disputed slogan if she agreed not to further challenge the firm's use of it, and agreed to keep the deal confidential.Georgina Cox, from Middlesbrough, said the company used the \"Wear The Damn Shorts\" phrase from her Instagram posts without crediting her in its latest campaign.She had used the slogan, and others like it, in a number of posts encouraging women to wear what they wanted, regardless of body shape, before being contacted by the firm, she said.Sweaty Betty said it \"respectfully disagreed\" with her claims and said the slogan had been part of its campaign for three years.A company spokesperson said: \"We have offered and continue to offer to meet with Ms Cox as we remain committed to resolving this matter constructively and reaching a fair and amicable resolution.\" The fitness trainer said she came up with the slogan for her younger sister in 2020 and the words quickly went viral. In 2023, she was approached by a Sweaty Betty marketing executive, who said the firm was planning a campaign \"with similar messaging as your Wear the Damn Shorts post a few years ago\" and asking if she was happy for it to do so.Georgina CoxThe personal trainer said she posted the image to encourage her younger sisterMs Cox was subsequently paid £3,500 to promote the campaign in social media posts.The company contacted her again the following year before its new campaign, but did not do so before the third year, she said.\"The third year they just omitted me completely, I didn't know it was happening,\" she said.\"I was so hurt in that moment because nobody had reached out to me.\"They're meant to care about women, they're meant to support them and empower them, and I've never felt less empowered than I have this year.\"Ms Cox's lawyer sent the company a legal \"cease and desist\" letter, asking that it stop using the phrase, but she said the response described her as \"bitter\".She had also been threatened with legal action for defamation after posting about the situation online, she said.Georgina CoxGeorgina Cox regularly posts body-positive messages on her social mediaMs Cox said she had been \"terrified\" and the stress had affected her physically and mentally.\"They are such a big company and I am just one woman and to be threatened by them is incredibly scary,\" she said.The fitness influencer said she had not been sleeping, her hair was falling out and she was having panic attacks.She wanted an apology from the company and a pledge from them to pay the influencers they work with, such as her, fairly, she said.Sweaty Betty say they \"respectfully disagree\" with Georgina Cox's claimsIn correspondence with Ms Cox, Sweaty Betty said it was willing to offer £4,000 as a final settlement, provided she agreed the firm would continue to use the slogan, she would not challenge this use, she would not make any public statements about the firm, and the terms of this settlement would be confidential.The company said: \"We have great respect for the community Ms Cox has built around body confidence and empowerment, and were surprised and saddened to find ourselves in this situation. \"'Wear the Damn Shorts' has been part of our campaign for three years, and we chose it because it perfectly captures what Sweaty Betty stands for.\"While none of us has exclusive legal rights to this phrase, we have always aimed to respect Ms Cox's association with it. \"Since she first raised her concerns earlier this year, we've been in regular contact.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sweaty Betty offered Middlesbrough trainer £4k for slogan use and silence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53c2/live/e5051530-c487-11f0-81c9-694acfdc27bb.jpg"
      ],
      "datePublished": "2025-11-21T14:48:03.000Z",
      "dateModified": "2025-11-21T14:48:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Africa declares gender violence a national disaster after protests",
    "url": "https://www.bbc.com/news/articles/cn979g302l9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a66b/live/e1375ea0-c6e8-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T15:20:30.000Z",
    "description": "51 minutes agoKhanyisile Ngcobo, Nomsa Maseko,BBC Africa, Johannesburg and Danai Nesta KupembaSouth Africa has classified violence against women a nat",
    "body": "51 minutes agoKhanyisile Ngcobo, Nomsa Maseko,BBC Africa, Johannesburg and Danai Nesta KupembaSouth Africa has classified violence against women a national disaster following an online campaign culminating in countrywide protests on Friday.Women were urged to \"withdraw from the economy for one day\", and lie down for 15 minutes at 12:00 local time (10:00 GMT) in honour of the 15 females who are murdered in the country every day.The state had refused to make the categorisation but changed tack after \"evaluating the persistent and immediate life-safety risks posed by ongoing acts of violence\".South Africa experiences some of the world's highest levels of gender-based violence (GBV), with the rate at which women are killed five times higher than the global average, according to UN Women.The National Disaster Management Centre (NDMC) has classified GBV and femicide a disaster following \"a thorough reassessment of previous reports and updated submissions from organs of state as well as civil organisations\", said Cooperative Governance and Traditional Affairs Minister Velenkosini Hlabisa.The NDMC had earlier said calls to make the categorisation did not meet legal requirements.Warning: This report contains descriptions of sexual assaultFridays \"lie downs\" happened in 15 locations across South Africa, including major cities such as Cape Town, Durban and Johannesburg.Allies in Eswatini, Kenya and Namibia have also expressed their support for the protest and say they joined in.The demonstrators wore black as a sign of \"mourning and resistance\".The protest, dubbed the G20 Women's Shutdown, has been organised by Women for Change, which has also been spearheading the online campaign that has seen many people, including celebrities, change their social media profile pictures to purple – a colour often linked to GBV awareness.There has also been an online petition, signed by over one million people. On Thursday, President Cyril Ramaphosa told the G20 Social Summit that South Africa had \"declared gender-based violence and femicide a national crisis\" in 2019. Shortly afterwards, Mr Hlabisa confirmed it had been upgraded to a national disaster and that an announcement would be made on Friday, according to Women for Change.The organisation shared a statement on its Instagram page on Thursday welcoming the news and telling its followers \"we have won\" and that their \"persistence has been recognised\".\"We have written history together [and] we have finally forced the country to confront the truth,\" it said.The categorisation allows government departments to use their allocated budgets to \"implement every measure possible\" to reduce the scourge, the cooperative governance ministry told the BBC.If these measures fail to bring change, the government can then declare a national state of disaster which would allow for the issue to be treated with even more urgency.Before the announcement, Women for Change spokesperson Cameron Kasambala told the BBC that \"so many beautiful acts and legislations\" had been followed by \"lack of implementation and transparency\" on the government's part.\"We've integrated violence… into our culture [and] into our social norms,\" she said.\"Once the government truly reacts to this issue, I feel like we'll already be able to see a reaction on the ground. Because they set the precedent and the tone for how the country responds.\"Grammy-award winning singer Tyla is among the thousands of celebrities and citizens who have rallied behind the call and changed their social media profiles. Some have gone further, posting pictures of purple hearts, nail polish and even clothing in what has since been dubbed the \"purple movement\".A South African professor who asked to remain anonymous told the BBC she had taken leave so she could travel to Johannesburg from Free State province to take part in the silent protest.It's important for her because she said she had second thoughts about simple things like jogging and hopes that the protest will \"slow the scourge\" of GBV.However, some women have faced a backlash from employers for wanting to participate in the protest. One product designer who works for a major cooperation said they were strongly advised against taking part. Some women who feel the government is not doing enough have taken matters into their own hands. Lynette Oxeley founded Girls on Fire to help women protect themselves through gun ownership.  It is legal to own a firearm in South Africa for self-defence if a person has a valid licence. Most of the women in her group have been raped, attacked, robbed, or experienced some level of violence.A growing number of women in South Africa are learning to use guns to protect themselvesPrudence joined the group after she was raped in 2022. \"I said: 'No'. I screamed, I cried but he didn't take no for an answer,\" she told the BBC. Trying to find justice was an \"uphill battle\" as her case was withdrawn because her rape kit - the DNA they take after the crime - was lost. It isn't a \"police problem, it is a nation problem,\" she said. Although the women are trained to shoot firearms, Ms Oxeley said using a gun was a \"last resort\". \"It's not about actually defending yourself with a firearm. I want ladies to change what they think about themselves. Stop being silent,\" she said. \"Even if you do not win the fight, at least you are fighting back.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Africa declares gender violence a national disaster after protests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a66b/live/e1375ea0-c6e8-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T15:20:30.000Z",
      "dateModified": "2025-11-21T15:20:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What we know about leaked US draft plan to end Russia's Ukraine war",
    "url": "https://www.bbc.com/news/articles/cde6yld78d6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2ab6/live/91451930-c6f4-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T15:21:53.000Z",
    "description": "54 minutes agoPaul KirbyEurope digital editorMarharyta Fal/Frontliner/Getty ImagesThe draft US-Russia peace plan has been widely leaked and we now kno",
    "body": "54 minutes agoPaul KirbyEurope digital editorMarharyta Fal/Frontliner/Getty ImagesThe draft US-Russia peace plan has been widely leaked and we now know that it proposes to hand over those areas of Ukraine's industrial eastern Donbas region still under Ukrainian control to the de facto control of Vladimir Putin's Russia.Latest versions of the text also call for Ukraine to cut the size of its armed forces to 600,000 people.But what else is known about the text and who stands to benefit from it most?What are the key points?There are 28 key points and there are several on the face of it that could be acceptable to Ukraine. Others come across as vague and imprecise.Ukraine's sovereignty would be \"confirmed\" and there would be a \"total and complete comprehensive non-aggression agreement between Russia, Ukraine and Europe\", with robust or reliable \"security guarantees\" for Kyiv and a demand for snap elections in 100 days.If Russia were to invade Ukraine a \"robust co-ordinated military response\" is proposed along with a restoration of sanctions and a scrapping of the deal.Although elections are impossible in Ukraine as there is martial law in place, they could theoretically be held if a peace deal is signed.But on security guarantees, there is no detail on who would provide them and how robust they might be. This falls well short of a Nato-style Article Five commitment to  treat an attack on Ukraine as an attack on all. Kyiv would want more than a vague promise if it were to sign up.Handover of Ukraine's territory and cut in armed forcesAmong the most contentious proposals are Ukraine handing over its own unoccupied territory and cutting the size of its armed forces.\"Ukrainian forces will withdraw from the part of Donetsk Oblast that they currently control, and this withdrawal zone will be considered a neutral demilitarized buffer zone, internationally recognized as territory belonging to the Russian Federation. Russian forces will not enter this demilitarised zone.\"Ceding territory where at least a quarter of a million Ukrainians live - the Donetsk \"fortress belt\" cities of Slovyansk, Kramatorsk and Druzhkivka - will not be acceptable to most Ukrainians. Russia has spent well over a year trying to capture the town of Pokrovsk - Ukraine is unlikely to hand over such important strategic hubs without a fight.\"The size of the Ukrainian Armed Forces will be limited to 600,000 personnel.\"Ukraine's military was estimated last January at 880,000 active personnel, up from 250,000 at the start of the full-scale invasion in February 2022.While 600,000 might seem a potentially acceptable number in peacetime, that kind of limitation would infringe on Ukrainian sovereignty. It might also be too big a number for Russia to accept.\"Our red lines are clear and unwavering,\" Ukrainian representative Khrystyna Hayovyshyn told the UN security Council: \"There will never be any recognition formal or otherwise of Ukrainian territory temporarily occupied by the Russian Federation as Russian. Ukraine will not accept any limits on its rights to self defence or on the size or capabilities of our armed forces.\"The draft also proposes that \"Crimea, Luhansk and Donetsk will be recognized as de facto Russian, including by the United States\".In other words Ukraine and other countries would not need to recognise Russian control by law. That could enable Kyiv to accept such phrasing, as it would not impinge on Ukraine's constitution that says its borders are \" indivisible and inviolable\".Elsewhere, in the southern regions of Kherson and Zaporizhzia, the front lines would be frozen and Russia would relinquish areas it has occupied in other areas.Ukraine's future - with EU but not NatoThe draft proposes significant commitments on Ukraine's strategic future:\"Ukraine agrees to enshrine in its constitution that it will not join Nato and Nato agrees to include in its statutes a provision that Ukraine will not be admitted in the future.\"\"Ukraine is eligible for EU membership and will get short-term preferred market access to the European market while this issue is being evaluated.\"There is little chance of Ukraine joining Nato any time soon and Russia has in recent months softened its stance on Ukraine's candidacy for EU membership. The document appears to offer Kyiv access to EU markets while ignoring the views of 27 European countries. Joining both the EU and Nato are part of Ukraine's constitution and another of Khrystyna Hayovyshyn's red lines at the UN on Thursday was: \"Nor will we tolerate any infringement on our sovereignty including our sovereign right to choose the alliances we want to join.\"Other draft proposals are that Nato agrees not to station troops in Ukraine and that European fighter jets will be stationed in Poland. Kyiv would also have to commit to being a \"non-nuclear state\".That appears to reject the West's Coalition of the Willing's plans led by the UK and France to help police any future deal.Bringing Russia back from isolationSeveral points refer to Russia being brought back from isolation with \"Russia to be re-integrated into the global economy\" and invited back into the G8 group of powers. That seems a long way off for now, with Putin under an arrest warrant from the International Criminal Court. Russia was thrown out of the G7 after it seized and then annexed Crimea in 2014 and Trump tried to bring Putin back into the fold six years later.If the UK, Canada, France, Germany, Italy and Japan were reluctant before the full-scale invasion, there's even less chance of that happening now.What about Russia's frozen assets?The draft proposes that $100bn of frozen Russian assets should be invested \"in US-led efforts to rebuild and invest in Ukraine\", with the US receiving 50% of the profits and Europe adding $100bn in investment for reconstruction.This is reminiscent of the US minerals deal with Ukraine earlier this year, extracting an American price for involvement, and it also leaves the European Union with nothing but hefty bills.The sums it mentions may not be sufficient, either: earlier this year the total cost of reconstruction in Ukraine was put at $524bn (€506bn).Some €200bn in Russia frozen assets are largely held by Euroclear in Belgium, and the European Union is currently working on a plan to use the money to fund Kyiv financially and militarily.The rest of those frozen assets would go to a \"US-Russian investment vehicle\", under the draft, so Russia would see some of its money come back, but again there would be a financial benefit for the US.What is not in the plan?Several commentators have pointed out that the plan does not require weapons limitations on Ukraine's military or its arms industry, even though there is a provision saying: If Ukraine fires a missile at Moscow or St. Petersburg then the security guarantee will be considered null and void.But it does not place an restriction on the long-range weapons Ukraine has been developing - such as its Flamingo and Long Neptune missiles.Is this a definitive peace plan?We know the US is keen to press ahead fast under an \"aggressive timeline\" with this draft, with reports suggesting Ukraine has until Thanksgiving late next week to agree to it.Equally US Secretary of State Marco Rubio, who was involved in drafting it, described it as \"a list of potential ideas for ending this war\", and German Foreign Minister Johann Wadephul has made clear he does not see the 28 points as a definitive plan, having spoken to the other key US official involved, Trump envoy Steve Witkoff.In some respects the draft document seems like work in progress, with some details that were leaked to US websites on Thursday no longer apparent. The European Union said on Friday morning it had not officially seen the plan yet, and the Russian foreign ministry said the same.Is the draft a Putin wishlist?Russian special envoy Kirill Dmitriev is known to have spent as long as three days with Witkoff discussing this plan, raising suggestions of a stitched-up deal to suit Moscow. But Russia's response has so far been cautious and it says it has not even seen the plan.The handover of Ukrainian territory to Russia, even in a demilitarised zone, is the biggest sign of a slant towards Russia's narrative, but freezing the front lines in the south could prove difficult for the Kremlin which has annexed both Kherson and Zaporizhzhia in its constitution.One of the proposals is for the lifting of sanctions to be \"agreed upon in stages and on a case-by-case basis\" - which Moscow will probably see as far too slow.However, a plan for a \"full amnesty\" for all parties will go down well in Moscow and very badly in Kyiv and European capitals.Commentators have pointed out that while there do appear to be major concessions to Putin, some of the requirements for Nato might be too vague for Kremlin tastes.Russia has also consistently demanded that a peace plan would need to eliminate what it sees as \"the root causes\" of the war. One of those root causes is halting Nato expansion in Eastern Europe, which the draft appears to deal with.Some of the other 28 points of the draft also a nod to Russia's claims of discrimination of Ukraine's Russian-speaking population without explicitly endorsing them. One point is explicit but even-handed: \"Both countries will agree to abolish all discriminatory measures and guarantee the rights of Ukrainian and Russian media and education.\"Another apparent attempt to be even-handed comes from a proposal to distribute electricity generated by the Russian-occupied Zaporizhzhia nuclear power plant - the biggest in Europe - \"equally between Russia and Ukraine\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What we know about leaked US draft plan to end Russia's Ukraine war",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2ab6/live/91451930-c6f4-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T15:21:53.000Z",
      "dateModified": "2025-11-21T15:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scotland make 14 changes to face Tonga as Zander Fagerson returns",
    "url": "https://www.bbc.com/sport/rugby-union/articles/c4g4l737l3zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/27c4/live/5d91b940-c6ef-11f0-b222-8b5ed945ab17.jpg",
    "tag": "Trending",
    "date": "2025-11-21T15:42:40.000Z",
    "description": "Image source, SNSImage caption, Zander Fagerson has been sidelined through injury since AprilAutumn Series Test: Scotland v TongaVenue: Scottish Gas M",
    "body": "Image source, SNSImage caption, Zander Fagerson has been sidelined through injury since AprilAutumn Series Test: Scotland v TongaVenue: Scottish Gas Murrayfield, Edinburgh Date: Sunday, 23 November Kick-off: 13:40 GMTCoverage: Listen on BBC Radio Scotland Extra & Sounds, listen on the BBC Sport website & appZander Fagerson will make his first appearance in more than seven months, while captain Sione Tuipulotu is the only player to retain his place, in Scotland's starting line-up to face Tonga on Sunday.Glasgow Warriors tighthead Fagerson has been sidelined since April through a combination of calf and knee injuries.But he will be part of an experienced front row alongside fellow Warriors prop Rory Sutherland and Harlequins hooker George Turner, who will win his 50th cap, in Scotland's final autumn Test.There is no place in the squad for Bath fly-half Finn Russell, joint record try-scoring wing Darcy Graham and full-back Blair Kinghorn as Gregor Townsend makes sweeping changes.Scotland lost 33-24 at home to Argentina last Sunday, despite leading by 24 at one stage.Joint record try scorer Duhan van der Merwe returns after being missing from the starting line-up for the past two Tests against New Zealand and the Pumas, with Kyle Rowe on the other wing.Bristol Bears' Tom Jordan starts at full-back, while Saracens fly-half Fergus Burke will win his third cap in place of Russell.In the back row, Edinburgh's Magnus Bradbury will make his first start for three-and-a-half years in the number eight jersey, while flankers Andy Onyeama-Christie and Jamie Ritchie are handed their first appearances of the autumn.Scotland team to face TongaStarting XV: Tom Jordan (Bristol Bears), Kyle Rowe (Glasgow Warriors), Ollie Smith (Glasgow Warriors), Sione Tuipulotu (Glasgow Warriors, capt), Duhan van der Merwe (Edinburgh); Fergus Burke (Saracens), Ben White (Toulon); Rory Sutherland (Glasgow Warriors), George Turner (Harlequins), Zander Fagerson (Glasgow Warriors), Alex Samuel (Glasgow Warriors), Max Williamson (Glasgow Warriors), Andy Onyeama-Christie (Saracens), Jamie Ritchie (Perpignan), Magnus Bradbury (Edinburgh).Replacements: Ewan Ashman (Edinburgh), Nathan McBeth (Glasgow Warriors), Will Hurd (Leicester Tigers), Marshall Sykes (Edinburgh), Josh Bayliss (Bath), George Horne (Glasgow Warriors), Stafford McDowall (Glasgow Warriors), Kyle Steyn (Glasgow Warriors).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scotland make 14 changes to face Tonga as Zander Fagerson returns",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/27c4/live/5d91b940-c6ef-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T15:42:40.000Z",
      "dateModified": "2025-11-21T15:42:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Ashes 2025 highlights: England fight back v Australia as 19 wickets fall on incredible day one",
    "url": "https://www.bbc.com/sport/cricket/videos/cvgr4mvd7d7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/6c2a/live/de3150c0-c6cb-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-21T11:23:48.000Z",
    "description": "Captain Ben Stokes took five wickets as England's fast bowlers sensationally tore into Australia on an electrifying opening day of the Ashes.MATCH REP",
    "body": "Captain Ben Stokes took five wickets as England's fast bowlers sensationally tore into Australia on an electrifying opening day of the Ashes.MATCH REPORT: Superb England tear into Australia in Ashes openerAvailable to UK users only.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Ashes 2025 highlights: England fight back v Australia as 19 wickets fall on incredible day one",
      "image": [
        "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/6c2a/live/de3150c0-c6cb-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T11:23:48.000Z",
      "dateModified": "2025-11-21T11:23:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]