[
  {
    "title": "Elvis",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzws?at_mid=mGEMw411dH&at_campaign=Elvis&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzws&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Elvis&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg",
    "tag": "Trending",
    "date": "2025-12-27T22:12:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeElvisElvisContains some strong language.Elvis Presley's story seen through the lens of his complicated relationship with his enigmatic manager, Colonel Tom Parker. Duration2h 26mFirst shown2022Available for 25 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCall the MidwifeThe nurses of Nonnatus House face up to a country fizzing with change and challenge.The War Between the Land and the SeaWe inherited their world - they want it back. When oceans rise, whose side do you choose?ShetlandEven the most beautiful places have a dark side. Detective Jimmy Perez returns homeDeath in ParadiseDon't be fooled by the beautiful island of Saint-Marie - even paradise can be murder.OppenheimerCillian Murphy stars as the man who built the bomb - and changed the world forever2h 49mBeyond ParadiseNew adventures for DI Humphrey Goodman. Back from Saint Marie to a new life in DevonFour Weddings and a FuneralHe's quite engaging. She's already engaged. Hugh Grant in Richard Curtis' timeless tale1h 52mReturn to ParadiseComing home can be tough, but sometimes it's murder. An Aussie twist on Death in ParadiseBack to the FutureGreat Scott! The most iconic time-travel adventure ever told, starring Michael J. Fox1h 49mMission: ImpossibleGlobal threats, daring stunts and one agent's fight to save the world. Tom Cruise stars1h 43mPrisoner 951Drama based on the true story of Nazanin Zaghari-Ratcliffe and the struggle to free her.The HolidayKate Winslet stars. Sometimes the heart needs a holiday to find where it truly belongs2h 7m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elvis",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg"
      ],
      "datePublished": "2025-12-27T22:12:00.000Z",
      "dateModified": "2025-12-27T22:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Puss in Boots: The Last Wish",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzvn?at_mid=7iCYilTXXa&at_campaign=Puss_in_Boots_The_Last_Wish&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzvn&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Puss_in_Boots_The_Last_Wish&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg",
    "tag": "Trending",
    "date": "2025-12-26T16:53:25.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePuss in Boots: The Last WishPuss in Boots: The Last WishTo restore his nine lives, Puss must beat a host of fairy-tale characters to the magical map of the Wishing Star, but a fearful adversary is on his trail. Duration1h 32mFirst shown2022Available for 24 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesMinions: The Rise of GruA villain will rise! In 70s suburbia, Gru plots his world take over. It's not going well1h 20mPuss in BootsNine lives. One destiny. Puss takes on Jack and Jill to get a goose that lays golden eggs1h 21mPaddington 2Magic. Mystery. Marmalade. Paddington's only a small bear... but he’s in big trouble1h 37mPeter RabbitBorn to be wild. Peter had the perfect life, until a new neighbour changed everything1h 25mMinionsIt's going to be a blast. They've had despicable masters, but this one might destroy them1h 24mDespicable Me 2Back to being bad, or maybe a little good. Gru goes undercover to find a new supervillain1h 31mHow to Train Your Dragon 3: The Hidden WorldFly on your own. A fight to the ends of the Earth to save the dragons from evil1h 33mDespicable MeBeing good's SO overrated. Gru’s out to steal the moon - if his heart isn't stolen first1h 28mThe Scarecrows' WeddingTwo devoted scarecrows dream of wedding bliss - until a rival plots to ruin all this25 minsWallace & Gromit: The Curse of the Were-RabbitIt gnaws no fear... The duo's pest control business takes action against a huge rabbit1h 16mShaun the SheepShaun, Bitzer and the flock are always getting into mischiefThe Croods: A New AgeAll in a day's survival. The Croods face their biggest challenge yet - another family!1h 26m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Puss in Boots: The Last Wish",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg"
      ],
      "datePublished": "2025-12-26T16:53:25.000Z",
      "dateModified": "2025-12-26T16:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mqch0p?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-24T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·52 minsThe Newscast Review of the Year 2025NewscastAvailable for over a yearAdam, Chris, Laura and Paddy go through the biggest stories of 2025 with the help of economics editor Faisal Islam and international editor Jeremy Bowen.\nThey also reveal what it was like to be on the inside as they happened, and discuss how Keir Starmer will reflect on his first full year as prime minister, how Donald Trump's tariffs reshaped the world's economy, and how a ceasefire between Israel and Hamas was reached.\nAnd we look at where the rise of Nigel Farage’s Reform UK and Zack Polanski’s Green Party have left politics in the UK.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming, Chris Mason, Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-24T12:00:00.000Z",
      "dateModified": "2025-12-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dad pays tribute to 'wonderful family' killed in Stroud Boxing Day fire",
    "url": "https://www.bbc.com/news/articles/c14r88ylvl1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c667/live/abf192b0-e6ff-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T12:16:18.000Z",
    "description": "13 minutes agoAlexandra BassinghamWest of EnglandFacebookFionnghuala Shearman and her daughter Eve and son Ohner died in the fire on Boxing DayA man w",
    "body": "13 minutes agoAlexandra BassinghamWest of EnglandFacebookFionnghuala Shearman and her daughter Eve and son Ohner died in the fire on Boxing DayA man whose wife and two children died in a Boxing Day fire has paid tribute to his \"wonderful family\". Tom Shearman escaped the fire after it engulfed their home on Brimscombe Hill in Stroud, Gloucestershire, killing seven-year-old Eve, four-year-old Ohner, and their mother, Fionnghuala Shearman, known as Nu.\"I cannot begin to describe the anguish and trauma of the events of Boxing Day 2025,\" he said in a tribute released by Gloucestershire Constabulary.\"My family had its very core, its very essence, ripped from it in the most violent way.\"Mr Shearman, a serving police officer with Gloucestershire Constabulary, escaped the burning house and tried multiple times to re-enter to save his family.He said in the tribute: \"I have stared at my keypad for what seems like an eternity waiting for the words to appear. \"I have no way to thank any of you for the unbelievable out of this world generosity that you have shown to me in the darkest of hours.\"PAMr Shearman was unable to regain entry to the house after trying multiple timesMr Shearman continued: \"My life, the lives of my loved ones, my friends and the whole community changed on Boxing Day.\"Most importantly, and tragically, three of the greatest humans to ever grace our presence were taken from not just me, but all of us.\"The mother and father were woken by the fire and Mr Shearman smashed his way out through the bathroom window to try and reach their children in the back bedroom.But he was unable to because of the \"ferocity and heat\" of the blaze, Det Supt Ian Fletcher said.Police believe the fire started on the ground floor and investigations are ongoing to establish the cause, but it is not being treated as suspicious.The bodies of the mother, two children and the family dog, Hutch, have all been recovered from the property.Floral tributes have been placed near the homeHundreds of thousands of pounds in donations has been raised to support Mr Shearman in the wake of the tragedy.The police officer said he was \"humbled beyond comprehension\" by the generosity and had started a plan to \"make sure my unbelievably talented, empathetic, compassionate and beautiful wife's legacy of craft, design and making lives on\".He said he wanted to ensure \"that my bright spark Eve's legacy of enjoyment from books and writing be carried on\" as well as his \"incredible son's sheer compassion and desire to help people\".\"I thank each and every one of you for your donations. I shall forever be in your debt and you will now forever be in my thoughts and prayers, hopefully I can repay in some way,\" he said.He urged people to take \"every opportunity to hug your loved ones and tell them you love them\".\"Because, as [Brazilian author] Paulo Coelho said, one day you will wake up and there won't be any more time to do the things you want. Do it now,\" he said.\"My heartfelt thanks to the emergency services whom tried everything to save my wonderful family. I hope they are all being looked after by their colleagues and friends. Boxing Day was horrific for all involved.\"Now go light up the darkest corners and the black sky.\"In memory of Nu. Eve. Ohner. Hutch.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dad pays tribute to 'wonderful family' killed in Stroud Boxing Day fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c667/live/abf192b0-e6ff-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-01T12:16:18.000Z",
      "dateModified": "2026-01-01T12:16:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What we know about the Switzerland ski resort fire",
    "url": "https://www.bbc.com/news/articles/c9dvyyjyj18o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2f23/live/44cf9110-e702-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T12:20:59.000Z",
    "description": "8 minutes agoBen TobiasWatch: BBC reports from the scene of Swiss resort bar fireSeveral dozen people are presumed to have died and more than 100 inju",
    "body": "8 minutes agoBen TobiasWatch: BBC reports from the scene of Swiss resort bar fireSeveral dozen people are presumed to have died and more than 100 injured following a fire in a ski resort in southern Switzerland, officials have said.Police said several nationalities were likely involved in the New Year's Day fire, which happened at 01:30 local time (00:30 GMT) in a bar called Le Constellation in the resort of Crans-Montana. It is being treated as a fire and there is \"no question\" of an attack, the region's chief prosecutor said.A helpline has been set up for concerned families: +41 848 112 117Here's what we know so far. How many people were killed?At a news conference on Thursday morning police said \"several dozen\" people were presumed to have died in the fire, although it was too early to give a precise number. The Italian foreign ministry - citing Swiss police - said it believed around 40 people had died. Follow live updatesAround 100 people have been injured, mostly with severe burns, Swiss officials said. Most have been taken to Valais hospital where the intensive care unit is now full, according to local authorities. Ten helicopters, 40 ambulances and 150 emergency workers were sent to the scene. Work is ongoing to identify the victims and return bodies to families as quickly as possible, the region's chief-prosecutor Beatrice Pilloud said.The Italian ambassador to Switzerland says it could take weeks to identify the dead. Earlier, Italy's foreign minister said identification would be difficult due to the severe burns. People from several countries are believed to be involved and French media has reported that at least two of the injured are French nationals. French President Emmanuel Macron has offered \"the full solidarity of France and our fraternal support\" to Switzerland. The UK embassy in Switzerland says it is monitoring the situation but it has not been approached for assistance. Consular staff are on standby to support any British nationals affected, a Foreign Office statement said.Video shows Swiss ski resort bar on fireWhat caused the fire? The cause of the fire is unknown but Ms Pilloud said it is currently being treated as a fire and \"at no time is there a question of any attack\". Police initially said there had been an explosion, but have since referred to it as a fire and have said it is too early to speculate on the cause. Asked about the reports of an explosion, regional security official Stéphane Ganzer said it \"is not the detonation of an explosive device that causes the fire, it is the fire which, as it develops, causes an explosion and a general conflagration of the premises\".Local reports had also suggested pyrotechnics could have been involved. The regional police commander Frédéric Gisler said smoke was first seen emanating from a bar at around 01:30 local time, at which point emergency services were called. The first police officers were quickly on the scene followed by a major deployment of rescue teams, Mr Gisler said. What do we know about Le Constellation bar? Le Constellation is a large bar in the the Swiss ski resort of Crans-Montana which has been around for many years. Although the resort itself is quite upmarket, Le Constellation was not particularly posh, the BBC's Silvia Costeloe reported from the resort.Upstairs, there is an area with TV screens where people go to watch football matches. Downstairs is a big bar where people were likely drinking and dancing. It could hold up to 300 people and had a small terrace, although it is unknown how many people were there at the time of the fire. The Christmas and New Year holidays are one of the busiest times of the year for Alpine ski resorts, and it is likely the bar was full of Swiss people and tourists celebrating the start of 2026. Police Cantonale ValaisannePolice have released images from inside the bar after the fire showing chairs and benches strewn across the room",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What we know about the Switzerland ski resort fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2f23/live/44cf9110-e702-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T12:20:59.000Z",
      "dateModified": "2026-01-01T12:20:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK welcomes new year with celebrations across the country ",
    "url": "https://www.bbc.com/news/articles/cy594gkele3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ab4/live/ba331a40-e6ac-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T09:45:49.000Z",
    "description": "3 hours agoTabby WilsonandSuzanne LeighMillions of people across the UK have officially rung in the new year, gathering at firework events and parties",
    "body": "3 hours agoTabby WilsonandSuzanne LeighMillions of people across the UK have officially rung in the new year, gathering at firework events and parties all over the country. In London, 12,000 fireworks were set off in the city's biggest pyrotechnic display to date, with 100,000 people watching on from the banks of the Thames.Edinburgh Castle was lit up by six minutes of carefully choreographed explosions, surrounded by tens of thousands of revellers attending the famous Hogmanay street party. The new year brings chilly weather with snow and ice forecast across much of the UK.A yellow weather warning for snow and ice is in place for northern Scotland from 06:00 GMT until the end of Friday. On 2 January, a further yellow warning for snow and ice has been issued across large parts of England and Wales between midnight and noon, extending as far south as London and Kent.As the iconic midnight bongs of Big Ben sounded across London, the London Eye was at the centre of Europe's biggest firework display, which celebrated some of the highlights of 2025.The soundtrack included Raye, Sabrina Carpenter, Ed Sheeran and Coldplay, and featured voiceovers from stars such as Celia Imrie, Andrew Cotter and Alison Hammond. England's Women's Rugby World Cup triumph was acknowledged in the display, along with the Lionesses' win at the Euros and Cynthia Erivo's performance in Wicked: For Good. London Mayor Sir Sadiq Khan hailed the display as the most \"legendary\" in the world, writing on X that the city's new year celebrations held a clear message about \"the importance of togetherness\". Other celebrations took place across the country, from Belfast to Cardiff, Manchester and Newcastle.Edinburgh held its last official celebration in 2024, after \"extreme weather\" forced organisers to cancel Hogmanay celebrations.This time, approximately 45,000 people attended the sold-out street party to usher in 2026, with some of the fireworks used in the display salvaged from last year's cancelled event. The spectacle was accompanied by a soundtrack that featured some of Scotland's biggest artists, such as Lewis Capaldi and Simple Minds, before concluding with a version of Auld Lang Syne by Skye duo Valtos.Liverpudlians Cheryl and Terry Brown were among those making merry in the Scottish capital, soaking up all four days of the city's celebrations alongside their seven-year-old son, Oliver. \"We done it a few years ago and we just had to come back,\" Terry told the BBC, explaining that the family had celebrated in Belfast and London on previous years but Edinburgh's party atmosphere has kept them coming back. And they aren't the only ones. Cosmio and Neal, two friends from the US state of New Jersey, crossed the pond specifically to ring in 2026 from Edinburgh. \"The dancing, the people, the energy, the vibe - it's just the best way to bring in the new year together,\" said Neal. Cosmio added that the pair have made travelling for new year a regular thing but says the energy from the street party in Edinburgh is \"a thousand times better\" than watching the famous ball drop in New York's Times Square.Celebrations have already taken place in much of the rest of the world, too. Japan and South Korea marked the event with bell-ringing ceremonies in their capital cities, while Australians celebrated with a spectacular firework display in Sydney.Copacabana Beach in Rio de Janeiro was lit up by a similarly enormous series of pyrotechnics, with organisers hoping to beat their 2024 Guinness World Record for the biggest New Year's Eve celebration.On the RRS Sir David Attenborough, stationed in the Antarctic, the crew and science teams rang in the new year with the ship's bell.By midday GMT, it will officially be 2026 worldwide.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK welcomes new year with celebrations across the country ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ab4/live/ba331a40-e6ac-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T09:45:49.000Z",
      "dateModified": "2026-01-01T09:45:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: snow and ice warnings in force as Arctic air sweeps in for new year",
    "url": "https://www.bbc.com/weather/articles/ceqzn5rnz74o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/abfc/live/d1a73a30-e6fc-11f0-837e-09a2247f0a0a.jpg",
    "tag": "Trending",
    "date": "2026-01-01T10:40:58.000Z",
    "description": "Amber severe weather warnings for snow and ice have been issued by the Met Office with numerous other yellow warnings across the United Kingdom as we ",
    "body": "Amber severe weather warnings for snow and ice have been issued by the Met Office with numerous other yellow warnings across the United Kingdom as we start the new year.Arctic air is spreading across the UK with the beginning of a lengthy period of colder weather.With lower temperatures, amber cold health alerts from the UK's Health Security Agency (UKHSA) cover the whole of England.There could be some disruption to travel plans as the wintry weather and warnings continue into the weekend.New year revellers in southern England saw temperatures below freezing around midnight and there is a widespread frost on the first morning of 2026.Overnight lows fell to -6.2C in Bournemouth and -2.5C in Cardiff, with temperatures widely below zero elsewhere across southern England and South Wales.Further north, cloud and patchy rain prevented most areas from falling below freezing but with colder Arctic air moving in, heavy snow has begun to fall in Northern Scotland.With snow showers expected in Northern Scotland, a Met Office yellow warning is in force until 23:59 on Friday where there'll widely be around 2-5cm, locally up to 15cm of snow.But with heavier and more frequent snow in Angus, Perth and Kinross, Grampian, Aberdeenshire, Moray and parts of the Highlands, a more severe amber warning will come into effect at 12:00 GMT Friday until 12:00 Saturday.Accumulations of 10-20cm are likely at low levels with 30-40cm possible on high ground with some drifting and blizzards.Delays on the roads with the risk of vehicles becoming stranded are possible.Some rural communities could also be cut off, according to the Met Office.Elsewhere on New Year's Day cloud and rain will clear southward leaving a lot of dry and sunny weather.But, with a strong northerly wind it will feel cold despite temperatures of 1 to 7C.Amber cold health alerts from the UKHSA for the whole of England will be in place until 12:00 on 6 January.The alerts warn of a rise in deaths particularly among elderly and vulnerable people.Other consequences of cold weather include temperatures inside hospitals and care homes dropping below the levels recommended for assessing health risks, and challenges for people keeping indoor temperatures at the recommended 18C, according to the UKHSA.Overnight into Friday an area of rain, sleet and snow will spread through Northern Ireland, Wales, parts of north-west England, the Midlands and southern England.A Met Office yellow warning has been issued for large parts of England and Wales from midnight on Friday until 12:00 GMT on 2 January.A separate yellow warning is in place for Northern Ireland between midnight and 10am on Friday,Snowfall may last a couple of hours, with 1-2cm possible at low levels and up to 5cm of snow over the higher ground of Wales and the southern Pennines so new year travel disruption is possible.Another area of snow showers will feed in across eastern coastal areas England during Saturday.Here, another Met Office yellow warning has been issued for all of Saturday where around 1-3 cm of snow is likely to accumulate quite widely, with 5-8 cm possible in places such as the North York Moors.Meanwhile the frequent snow showers will continue in northern Scotland right through until the weekend.Strong winds on Saturday will bring blizzards and drifts of snow with the north-west Highlands and Grampians perhaps seeing as much as 60cm of snow by the end of the weekend.An additional Met Office yellow warning is in force for northern and western Scotland covering the whole weekend.Temperatures will be around 3-5C at best with some parts of Scotland and northern England experiencing 'ice-days' where temperatures won't rise above freezing.These low temperatures with widespread overnight frosts are expected to continue well into next week.Stay up to date with the latest forecast on the BBC Weather website or app as details are likely to change.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: snow and ice warnings in force as Arctic air sweeps in for new year",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/abfc/live/d1a73a30-e6fc-11f0-837e-09a2247f0a0a.jpg"
      ],
      "datePublished": "2026-01-01T10:40:58.000Z",
      "dateModified": "2026-01-01T10:40:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military says five killed in strike on alleged drug boats",
    "url": "https://www.bbc.com/news/articles/czdq1ple2l4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb7a/live/28724790-e6e6-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2026-01-01T10:19:32.000Z",
    "description": "2 hours agoVanessa BuschschlüterUS Southern CommandA screengrab from a video posted by US Southern Command shows a small vessel in the sea with what a",
    "body": "2 hours agoVanessa BuschschlüterUS Southern CommandA screengrab from a video posted by US Southern Command shows a small vessel in the sea with what appears to be debris floating nearby.The US military says it struck two boats it alleges were carrying drugs on Wednesday, killing five people on board.US Southern Command did not say where it had carried out the latest strikes but US forces have been targeting vessels they suspect of smuggling narcotics to the Caribbean and the eastern Pacific for the past three months. Wednesday's strike came a day after the US targeted what it said were \"three narco-trafficking vessels travelling as a convoy\", killing at least three people.The Trump administration has cast its operations as a non-international armed conflict with the alleged traffickers but legal experts say they could be in violation of the laws governing such conflict.In total, there have been more than 30 strikes on vessels as part of the Trump administration's \"war on drugs\" with more than 110 people killed since the US carried out its first attack on a boat in international waters on 2 September. That first attack has come under particular scrutiny from lawmakers in Washington since it emerged that US forces struck the targeted boat twice.Two people who had survived the first strike and were clinging to the hull of their boat were killed in the second. Some lawmakers expressed concern that the \"double-tap\" strike breached the rules of engagement. In its post announcing the strike on a convoy of three boats carried out on 30 December, US Southern Command said that there had been a number of survivors, without specifying how many.It said that \"the remaining narco-terrorists abandoned the other two vessels, jumping overboard and distancing themselves before follow-on engagements sank their respective vessels\". It added that the US Coast Guard had been \"immediately notified\" to search for the survivors.Reuters news agency reports that it was told by a US official who asked to remain anonymous that eight survivors were being searched for.It is not yet clear if any of them have been found. The US has provided no evidence that the boats it has targeted are carrying drugs but in its most recent post, Southern Command again insisted that \"intelligence confirmed the vessels were transiting along known narco-trafficking routes and engaged in narco-trafficking\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military says five killed in strike on alleged drug boats",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb7a/live/28724790-e6e6-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2026-01-01T10:19:32.000Z",
      "dateModified": "2026-01-01T10:19:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Joshua discharged from hospital after Nigeria car crash",
    "url": "https://www.bbc.com/news/articles/c5yvdw77j04o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/775d3eb0-e6a4-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:32:22.000Z",
    "description": "12 hours agoChris GrahamSocial mediaLatif Ayodele (left) and Sina Ghami (right) were close friends and team members of Anthony JoshuaBritish heavyweig",
    "body": "12 hours agoChris GrahamSocial mediaLatif Ayodele (left) and Sina Ghami (right) were close friends and team members of Anthony JoshuaBritish heavyweight boxer Anthony Joshua has been discharged from hospital in Nigeria days after a fatal car accident that killed two of his close friends.The former world champion was deemed fit to recuperate at home, the Ogun and Lagos states said in a joint statement, describing him as \"heavy hearted\" over the loss of his friends.The 36-year-old was a passenger in a Lexus SUV that collided with a stationary truck on a major expressway in Ogun State, near Lagos, on Monday.The two men who died were Joshua's close friends and team members Sina Ghami and Latif \"Latz\" Ayodele.After leaving the hospital on Wednesday, the Briton visited the funeral home where the bodies of his friends were \"being prepared for repatriation\", the joint statement added.Earlier, Eddie Hearn, who has promoted Joshua since he turned professional after winning gold at the 2012 Olympics, paid tribute to Joshua's close friends and team members.\"Rest in peace Latz and Sina,\" Hearn posted on Instagram.\"Your energy and loyalty among so many other great qualities will be deeply missed. Praying for strength and guidance for all their family, friends and of course AJ during this very difficult time.\"Ghami was Joshua's full-time sport and exercise rehabilitation coach and worked with him for more than 10 years.Moment Anthony Joshua is taken out of carSpeaking to the BBC on Wednesday, Ogun State police spokesperson Oluseyi Babaseyi said \"investigations are still ongoing\" and described the process as \"still discreet\".The Traffic Compliance and Enforcement Agency (TRACE) in Ogun state, where the accident occurred, has said preliminary investigations showed the vehicle had burst a tyre before crashing into the truck.Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria after his win over Jake Paul in Miami on 19 December.Earlier, Tony Bellew, the retired cruiserweight world champion, posted on X: \"Thoughts and prayers to the families of these men. Tragic losses in horrific circumstances!\"I hope he (Joshua) is able to process this with time because there is no pain in life worse than grief.\"Two-time undisputed heavyweight champion Oleksandr Usyk and British former heavyweight champion Tyson Fury also posted Instagram stories to offer condolences.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Joshua discharged from hospital after Nigeria car crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/775d3eb0-e6a4-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-01T00:32:22.000Z",
      "dateModified": "2026-01-01T00:32:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Children from struggling families to be offered jabs at home",
    "url": "https://www.bbc.com/news/articles/cn407dyx24go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16f9/live/d0471cf0-e657-11f0-a8f2-d9e8fba7dc3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:04:41.000Z",
    "description": "12 hours agoPhilippa RoxbyHealth reporterYoung children from struggling families in some parts of England will be offered vaccinations at home to prot",
    "body": "12 hours agoPhilippa RoxbyHealth reporterYoung children from struggling families in some parts of England will be offered vaccinations at home to protect them from preventable diseases, the health secretary has said.The pilot scheme, announced on Thursday as part of a drive to increase vaccine uptake, will see health visitors trained to spend more time with small numbers of families who could fall through the cracks of the NHS.Wes Streeting told the BBC that children's healthcare had not been given the priority it deserved.The Royal College of Paediatrics and Child Health said it was \"a national scandal\" that more than half a million children faced long waits to access health services in England.In an interview with BBC Radio 4's Today programme, Streeting said he was \"shocked\" by what he described as a lack of focus on children's health when he was in opposition.\"As human beings, it is in our nature to prioritise children. You talk to the overwhelming majority of parents, good parents, they will take bullets for their children,\" the health secretary said.\"There is that kind of innate sense of 'I will do everything I can to protect my child'. I don't think that's reflected sufficiently in the state,\" he added.The pilot scheme was part of that aim, he said, targeting families who are not signed up to a GP surgery or face language barriers, travel costs or childcare issues which stop them getting to a doctor.Uptake of childhood vaccines has declined over the past 10 years - no jabs met the 95% coverage target for children aged five and below, according to the latest data.Twelve areas in London, the Midlands, the North East and Yorkshire, the North West, and South West will test the approach over the next year.The government said all other families should continue to have children vaccinated at their local surgery.Streeting said there had been a decline in the number of health visitors and community nursing over a number of years, and that government was developing a workforce plan to address recruitment.Health visitors are registered nurses or midwives who have additional training in community public health nursing. They work with families with a child aged five and under to identify health needs.In response to Streeting's comments, the Conservatives accused Labour of having \"no plan for children's health or the health service as a whole\". \"Labour are trying to distract from their dismal failures by pointing the finger at the last government,\" shadow health secretary Stuart Andrew said.Professor Steve Turner, President of the Royal College of Paediatrics and Child Health, welcomed the plan and called on the health secretary to \"right the wrongs of the past\".Addressing NHS waiting times, he said it was now a \"matter of routine\" that children were not being seen by health professionals within the NHS's 18-week target, adding that he was \"particularly astounded\" that a quarter of children wait more than a year for community treatment, compared with just 1% of adults.\"Long waits for community and elective care are unacceptable at any age, but this is especially true for children where delays can cause irreversible and lifelong harm if care isn't provided during critical developmental windows,\" Prof Turner said.He added that the unequal treatment of adults and children \"must end\" by tackling obesity, protecting mental health, reducing exposure to nicotine and boosting vaccinations in children.Children up to the age of six across the UK are to be offered vaccine protection against chickenpox free on the NHS from January 2026.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Children from struggling families to be offered jabs at home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16f9/live/d0471cf0-e657-11f0-a8f2-d9e8fba7dc3b.jpg"
      ],
      "datePublished": "2026-01-01T00:04:41.000Z",
      "dateModified": "2026-01-01T00:04:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shamima Begum: Home secretary to 'robustly defend' citizenship decision",
    "url": "https://www.bbc.com/news/articles/c3wzp693nv3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/67bf/live/0b0da7c0-e6ec-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-01T09:01:43.000Z",
    "description": "Government to defend decision to strip Begum's UK citizenship3 hours agoSuzanne LeighSam Tarling/Getty ImagesThe home secretary will \"robustly defend\"",
    "body": "Government to defend decision to strip Begum's UK citizenship3 hours agoSuzanne LeighSam Tarling/Getty ImagesThe home secretary will \"robustly defend\" the decision to strip Shamima Begum of her British citizenship, as European judges scrutinise the move, according to a government source.The European Court of Human Rights (ECHR) has called for an investigation, but a government source said the the decision had already been upheld by UK courts.Ms Begum was 15 when she travelled from east London to the Middle East, to a territory held by the Islamic State group, where she married a fighter.Now 26, she was subsequently stripped of her British citizenship on the grounds that she posed a threat to national security but her lawyers say this failed to consider whether she was a victim of grooming and trafficking.The ECHR has asked the Home Office whether ministers at the time considered whether Ms Begum had been a victim, and whether the UK had obligations to her.But a government source said: \"The home secretary will robustly defend the decision to revoke Shamima Begum's citizenship, which has been tested and upheld time and again in our domestic courts.\"The home secretary will always put this country's national security first.\"In a document published by the ECHR earlier this month, it states that Ms Begum is challenging the decision to revoke her British citizenship under Article 4 of the European Convention of Human Rights - prohibition of slavery and forced labour.The case was lodged in December 2024 after the UK's Supreme Court denied her the chance to challenge the decision.The four questions posed by judges in Strasbourg to the Home Office, include: \"Did the Secretary of State  have a positive obligation, by virtue of Article 4 of the Convention, to consider whether the applicant had been a victim of trafficking, and whether any duties or obligations to her flowed from that fact, before deciding to deprive her of her citizenship?\"Ms Begum was born in the UK to parents of Bangladeshi heritage and was 15 when she left Bethnal Green, east London, with two schoolfriends in 2015 to support the Islamic State group.She had married an Islamic State fighter soon after arriving and went on to have three children, none of whom survived.She was later found in a refugee camp in Syria and a tribunal ruled in February 2020 that because she was \"a citizen of Bangladesh by descent\" removing her British nationality would not make her stateless.A series of appeals were made, ending in the decision that she would not be allowed to challenge it at the Supreme Court.Lawyer Gareth Pierce, who is representing Ms Begum, said it was \"impossible to dispute\" that a 15-year-old was \"lured, encouraged and deceived for the purposes of sexual exploitation to leave home and travel to Isil-controlled territory\".She added: \"It is equally impossible not to acknowledge the catalogue of failures to protect a child known for weeks beforehand to be at high risk when a close friend had disappeared to Syria in an identical way and via an identical route.\"It has already been long conceded that the then home secretary, Sajid Javid, who took the precipitous decision in 2019 very publicly to deprive Ms Begum of citizenship, had failed entirely to consider the issues of grooming and trafficking of a school child in London and of the state's consequent duties.\"The Conservatives said Ms Begum should not be allowed to return to the UK \"under any circumstances\".Shadow home secretary Chris Philp said Ms Begum \"chose to go and support the violent Islamist extremists\".He added: \"She has no place in the UK and our own Supreme Court found that depriving her of citizenship was lawful.\"It is deeply concerning the European Court of Human Rights is now looking at using the ECHR to make the UK take her back.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shamima Begum: Home secretary to 'robustly defend' citizenship decision",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/67bf/live/0b0da7c0-e6ec-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-01T09:01:43.000Z",
      "dateModified": "2026-01-01T09:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Energy price cap rises slightly as temperatures fall",
    "url": "https://www.bbc.com/news/articles/clyzy5488qqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa79/live/5fe54280-e575-11f0-b0d9-0db50843eef2.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:03:14.000Z",
    "description": "Energy prices rise slightly for millions of households as temperatures fall12 hours agoKevin PeacheyCost of living correspondentGetty ImagesEnergy bil",
    "body": "Energy prices rise slightly for millions of households as temperatures fall12 hours agoKevin PeacheyCost of living correspondentGetty ImagesEnergy bills are rising for millions of households in England, Scotland and Wales as the new year begins, after Ofgem raised its price cap slightly.Prices for those on variable tariffs are rising by 0.2% from now, the equivalent to a £3 annual increase for a household using a typical amount of gas and electricity.Campaigners say this means billpayers are facing another winter of high energy prices with the latest increase, albeit small, coinciding with the coldest period of the year.However, changes announced in the Budget should mean a fall in the cost of energy from April.Regulator Ofgem's energy price cap sets the maximum price for each unit of gas and electricity for those on variable tariffs, not the total bill - so those who use more energy, pay more.The regulator's cap is illustrated with a household using a \"typical\" amount of 11,500 kWh of gas and 2,700 kWh of electricity a year with a single bill for gas and electricity, settled by direct debit. This household would see a £3 rise in its annual bill from £1,755 to £1,758.However, the amount used varies significantly between households, so the best way to calculate the change is to work out the percentage change from your own usual annual bill.Standing charges - the fixed costs that cover the cost of running the network as well as government levies - will rise by 2% for electricity and 3% for gas, driving the overall increase.Electricity unit rates are rising, offset by a slight fall in gas rates, meaning that heavy users of electricity will see the biggest impact.The price cap affects England, Wales and Scotland, as the sector in Northern Ireland is regulated separately.Ofgem says people can often save money by moving to a fixed tariff. That sets the unit price for a certain period of time, so anyone already on a fixed deal will not see a change now.Emily Seymour, energy editor at consumer group Which?, said there were several deals on the market at prices lower than the price cap. \"As a rule of thumb, we'd recommend looking for deals cheaper than the current price cap, not longer than 12 months and without significant exit fees,\" she said.For many households, the heating will be on for longer as we enter January and February, with snow and ice warnings in place for some areas.Some vulnerable households in certain areas of England, Wales and Northern Ireland are receiving cold weather payments, worth £25 a week, if the average temperature in a local area is recorded as, or forecast to be, 0C or below for seven days in a row. Households can check their eligibility via a government online service. A separate winter heating payment operates in Scotland.The £150 Warm Home Discount has been extended by the government to apply to more lower income households.Simon Francis, from the End Fuel Poverty Coalition, said more needed to be done to help those who were struggling following the latest, small price increase.\"This is a case of every little hurts... we need to see much lower bills but also measures to keep people's homes warmer every winter.\"James Jones and his wife Christine, like millions of other pensioners, have seen their winter fuel payment reinstated following a government U-turn on restricting the allowance. \"Obviously we've got it for the cold months. We've got the central heating on more. It's made a big difference. You know it's coming, so it's your standby,\" said Mr Jones.James Jones and his wife Christine flank his mum Evelyn Williams and stepdad HarryBut the Warrington couple are still cutting back on luxuries to cover bills.\"We get a rise on our pension but it gets taken off you by food, petrol and everything else going up all the time so really you don't benefit,\" he said.There is some hope on the horizon in spring, though. In the Budget, Chancellor Rachel Reeves said some levies placed on energy bills would go, lowering bills for millions of households by £150 a year from April.That included cutting a scheme that was designed to tackle fuel poverty and help reduce carbon emissions, as well as shifting some costs onto general taxation.People on fixed deals in April would still benefit from the changes, the government has confirmed.However, about £30 will be knocked off those annual savings from April to pay for maintaining gas networks and strengthening the electricity transmission network.There are also signs of lower wholesale costs, paid by suppliers. Analysts at energy consultancy Cornwall Insight predict an 8% drop in the price cap in April - the equivalent of a fall of £138 to £1,620 a year for a household using a typical amount of gas and electricity.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Energy price cap rises slightly as temperatures fall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa79/live/5fe54280-e575-11f0-b0d9-0db50843eef2.jpg"
      ],
      "datePublished": "2026-01-01T00:03:14.000Z",
      "dateModified": "2026-01-01T00:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Traitors cast: Ex-detective and crime novelist among new contestants",
    "url": "https://www.bbc.com/news/articles/c77klkrprd2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b092/live/b6652d80-e658-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:24:42.000Z",
    "description": "12 hours agoSteven McIntoshEntertainment reporterBBCLeft-right: The new players include hairstylist Jessie, retired detective Amanda and personal trai",
    "body": "12 hours agoSteven McIntoshEntertainment reporterBBCLeft-right: The new players include hairstylist Jessie, retired detective Amanda and personal trainer RossA retired police detective, a crime novelist and a psychologist will be among the players sitting at the round table on the new series of The Traitors, which kicks off on New Year's Day.The 22 new contestants also include a poker-playing gardener, a barrister, a cyber security consultant, a civil servant, a builder, a nursery school teacher and a personal trainer.Fans have been speculating about a major new twist in this series after trailers broadcast over Christmas showed a figure wearing a red cloak in a departure from the usual traitors' green. Claudia Winkleman will return to host the series, which launches on BBC One and iPlayer at 20:00 GMT on Thursday.Claudia Winkleman returns as host to welcome 22 new contestants to Ardross Castle near InvernessCrime author and former barrister Harriet Tyce, 52, is on the line-up for the new series and said her career has prepared her for the show.\"I spend my life making up horrible ways for people to die and killing people on the page,\" she said ahead of the launch.\"The idea that I might get to actually plot to kill people or to track down a murderer, but without actual blood being shed, it's the closest that I'd get to that experience in real life. So quite honestly, what's not to like?\"She added: \"I write books which are all about people not being who they seem, and The Traitors is like the quintessence of people not being who they seem. I might bring an ability to see patterns in people's behaviour.\"'Deceptive, devious and cunning'Also on the line-up is retired police detective Amanda, 57, from Brighton, who also plans to utilise her professional skills.\"I've done lots of interviews with criminals and victims,\" she noted. \"You have to put the pieces together to find the truth and see through the lies.\"To be a traitor, you have to be good at lying, have a good poker face and be a master of deflection to prevent you being identified. I've learned a lot about being deceptive, devious and cunning.\"Crime novelist Harriet, poker-playing gardener James and psychologist Ellie will be sitting at the round tablePsychologist Ellie, 33, plans to keep her job a secret from her fellow contestants.\"Hopefully I'm going to be able to use all my psychological techniques to play the game as well as possible, whether I'm a traitor or a faithful, whether that's building up relationships with people or deceiving people and concealing how I really feel,\" she said.\"I'm going to be analysing what other contestants are doing and trying to think through what their motivations are for behaving in certain ways.\"Gardener James, 38, believes he could fare well in the castle because he was \"mildly successful playing poker\" in the past.\"I was even nicknamed The Librarian by a few people because I have this innate ability to read people like a book,\" he explained.And 32-year-old cyber security expert Stephen, from the Outer Hebrides but now based in London, has done the maths and decided he would rather be a traitor than a faithful.\"I can be a bit of a control freak, and I feel like as a traitor, it really is the best way to take control of the game,\" he said.\"Your chances of going home are slashed by 50% because you can only go out by banishment. Whereas, if you're a faithful, you've got two chances of being banished or murdered.\"The Traitors 2026: The cast in fullThe new contestants will be seen entering Ardross Castle in Thursday's launch episodeAdam, 34, a builder from EssexAmanda, 57, retired police detective from BrightonBen, 66, retiree from HampshireEllie, 33, psychologist from LondonFaraaz, 22, internal auditor from MiddlesbroughFiona, 62, local government officer from SwanseaHarriet, 52, crime writer and former barrister from LondonHugo, 51, barrister originally from CardiffJack, 29, personal trainer from EssexJade, 25, PhD Student from the West MidlandsJames, 38, gardener from WeymouthJessie, 28, hairstylist from HullJudy, 60, child liaison officer from DoncasterMatthew, 35, creative director from EdinburghMaz, 59, civil servant from PrestonNetty, 42, nursery school teacher from GlasgowRachel, 42, head of communications from County DownReece, 27, sweet shop assistant from SheffieldRoss, 37, sales exec and personal trainer from LondonRoxy, 32, recruiter from AmsterdamSam, 34, account manager from North YorkshireStephen, 32, cyber security consultant from London",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Traitors cast: Ex-detective and crime novelist among new contestants",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b092/live/b6652d80-e658-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-01T00:24:42.000Z",
      "dateModified": "2026-01-01T00:24:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]