[
  {
    "title": "Is Beadnell's ban the solution for villages with too many holiday homes?",
    "url": "https://www.bbc.com/news/articles/cy59gznnz0zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e64/live/3864f160-1310-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T01:18:20.000Z",
    "description": "'The second home ban has breathed new life into my village' 1 day agoJo LonsdaleBBC North East and Cumbria InvestigationsBBCMany generations of Jennif",
    "body": "'The second home ban has breathed new life into my village' 1 day agoJo LonsdaleBBC North East and Cumbria InvestigationsBBCMany generations of Jennifer Hall's family fished out of a now largely empty Beadnell Harbour Nearly eight years ago, Beadnell on the Northumberland coast became one of the first villages in the country to ban any homes built on new sites being used as second homes or holiday lets. The number of permanent residents has increased, bringing what some say is \"new life\" but others argue the policy is not enough to save rural communities or think it an unwarranted attack on tourism.Driving towards Beadnell harbour, 75-year-old Jennifer Hall nods one by one at the large houses overlooking the sea.\"Holiday let, second home, second home, holiday let, second home, holiday let,\" she intones. Clustered barnacle-like at the end of a glorious arc of sand, Beadnell, along with the neighbouring villages of Bamburgh and Seahouses, has long been a magnet for those seeking refuge from the madding crowd. According to the 2021 census, 64% of homes in Beadnell are second homes or holiday lets, up from 55% in 2011.Almost every house on Beadnell seafront is a holiday let or second homeHall's family has been in Beadnell since at least the 1700s. \"Fishing folk mainly,\" she says, but her great-grandmother opened the village's first hotel, an irony not lost on her given her years-long campaign against over-reliance on tourism. \"I don't hate holiday lets and I don't hate second homes at all,\" she says.\"But, in winter when there are no lights on, it can be very lonely.\" For much of the last half century, planning policy encouraged tourism. As recently as 2016, a new estate of 40 houses, Bernicia Way, was completed with a legal condition they could only be used as second homes or holiday lets. \"We were thinking there would come a point when there was nobody living here at all,\" Hall says.Among its policies was a requirement that all homes built on new sites would come with a legal restriction that they could only be used as a permanent residence. Planning policies previously supported tourism so the 40 homes in Bernicia Way, completed in 2016, can only be used as holiday lets or second homesAn estate of 45 houses called The Kilns was built and it included nine homes designated \"affordable\" - available for a set amount below market rate. The policy has been positive, Hall says, with the number of residents \"up by more than 10%\". \"It's really brought new life,\" she says. \"We have several new clubs in the village, and a fantastic new playground.\" Homes on The Kilns estate can only be lived in as permanent residencesAmong the newcomers to The Kilns determined to get \"stuck in\" to village life are Jacolyn Priestley-Jayes and Tim Jayes, both in their mid-sixties.They host a new monthly wine club, have joined Beadnell volunteers and Priestley-Jayes has begun a book club.  Jayes is also on the parish council \"for my sins\", he says with a wry smile. \"There's so much going on,\" his wife adds.Jacolyn Priestley-Jayes and Tim Jayes have begun a book club and a wine clubHall accepts the policy is \"not perfect\". Some houses in The Kilns remain unsold, and rumours abound that a few are being used as second homes despite the legal restriction.\"There are definitely some people who don't appear to be using their houses as their permanent residence, which is a shame,\" Priestley-Jayes says. Northumberland Estates, which was behind the project, said responsibility for enforcing the planning condition rests with Northumberland County Council and pointed out the residency requirement was \"very clearly communicated throughout the sales and marketing process\". The council said it would be inappropriate to comment further as the situation was \"part of an active investigation\".Getty ImagesBeadnell, NorthumbriaA further problem is the policy only applies to new sites.\"We've had developers buy up an old house, knock it down and replace it with a bigger property which has become holiday lets,\" Hall says. \"So that's a frustration.\"We've built The Kilns but there's not much space for more new houses.\" The parish council made a map using red and orange dots for holiday homes to demontrate how they dominate BeadnellDespite this, other villages have followed Beadnell in adopting the same policy. Helen Coyne, 72, has a flat in one of them, Alnmouth, with panoramic, ever-changing views of another of Northumberland's seemingly endless beaches. Although this is her second home, she says she understands the rationale behind the changes, and accepts the doubling of council tax since April last year. But she thinks second home owners contribute a lot to local businesses. \"We're here at least two or three nights every week, I use the lovely gift shop, we go out for meals, we drink in the pubs,\" she says.\"When family and friends stay, they do that even more.\"Helen Coyne, who has a holiday home in Alnmouth, says she tries hard to support local businessesBut Tim Farron, the MP for Westmorland and Lonsdale in Cumbria, says some second home owners visit \"just a couple of times a year\". \"They're definitely not sending their children to local schools either,\" he adds. The Liberal Democrat's constituency includes part of the Lake District National Park where one in four properties is a holiday home.Farron wants to go even further than applying restrictions to new-builds and is advocating a change in planning law.\"If I wanted to change my house into a fish and chip shop, I'd have to apply for planning permission,\" he says. \"But if I want to turn it into a second home or a holiday let, I can just do that. But it has a material impact on the community I live in.\"He wants separate categories of planning use for holiday lets and second homes, which would allow local authorities to limit their numbers.\"That way we can ensure rural communities don't die.\" The Lake District National Park Authority hopes to build affordable homes available only as a principal residenceThe Lake District National Park Authority's head of development management, Andrew Smith, agrees the current tools it has are \"quite limited\" and school populations continue to decline.The authority has set a target for 1,200 new permanent homes by 2035 but has no control over what happens to the existing housing stock.\"All you can do is approve or refuse new houses and try and facilitate new housing coming forward,\" he says. The Ministry of Housing, Communities and Local Government said it knew \"too many second homes and holiday lets can be harmful for communities\" and was taking action.Councils had the power to charge more council tax for second homes and the ministry was \"removing the incentive for landlords to prioritise short-term holiday lets over longer-term homes\", a spokesperson said.\"We'll continue to monitor impacts on communities and consider more powers for councils where needed,\" they added.PATourism revenue for the Lake District in 2024 was £2.3bnHowever, Richard Sayer, a former director of the North-East estate agents Rook Matthews Sayer, is wary of anything that might reduce the number of visitors.  \"An elderly person living permanently in a village has a perfect right to be there but is not hiring paddleboards and kayaks, or going to restaurants,\" he says.\"A holiday let with six people, they're spending thousands every week which is all going into the local economy.\"He has a holiday property near Keswick in Cumbria and thinks the doubling of council tax on second homes is already causing some to sell up. \"What is really needed is accommodation for the staff who work in the tourist industry, not fewer holiday homes,\" he adds. \"Every business in Keswick seems to have a sign up saying they are looking for staff.\"PAMore than half the properties in the Northumberland village of Bamburgh are second homes or holiday lets Back in Beadnell, on the kind of grey blustery day when the rain pecks at your face, the Craster Arms has a steady stream of windbent visitors. Owner Michael Dawson, who employs about a hundred staff across three cafes and pubs - \"young people, local people\" - also has little time for policies which deter second homes and holiday lets. \"The gift shops, ice-cream parlours, fish and chip shops, pubs, restaurants,\" he says\"Make no mistake, we all rely on them.\"  Publican Michael Dawson would like to see even more holiday lets and second homes in Beadnell What everyone agrees on is rural communities need more young families amid falling birth rates and an ageing population.    There are about 750 properties in Beadnell but no school and only about 20 children. Esther Graham, 46, grew up in the village but could only afford to live there with her children by moving in with her parents, who extended their home to accommodate. \"There's nothing for the kids, no clubs, no brownies or scouts,\" she says.Like Hall, her family have been in Beadnell for centuries but she worries about future generations. \"What we need more than anything is affordable housing and more jobs,\" she says. Esther GrahamEsther Graham grew up in Beadnell but says she can only afford to live there because she shares a house with her parentsNorthumberland County Council said the provision of affordable housing was one of its \"top priorities\" and it had updated its Housing Allocation Policy so council houses were only offered to people with \"a very strong connection to Northumberland\". It said, between 2017 and the end of 2025, more than 1,700 affordable homes had been built across the county and planning permission had been granted for 1,369 more.Related internet linksRelated stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Is Beadnell's ban the solution for villages with too many holiday homes?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e64/live/3864f160-1310-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T01:18:20.000Z",
      "dateModified": "2026-02-26T01:18:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Will The US Attack Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3jqc4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-26T19:14:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·26 Feb 2026,·33 minsAvailable for over a yearToday, we discuss the indirect US-Iran talks happening in Geneva.\nThe talks are happening against a backdrop of increased tensions between the two countries, with the US sending what Trump calls an ‘armada’ to the region. President Trump has threatened to strike Iran if a nuclear deal isn’t agreed during the talks.\nWe also discuss President Trump’s State of the Union speech, happening a time where many Americans are feeling frustrated about the cost of living, and off the back of the supreme court striking down his tariff policy.\nAdam discusses all with economics editor Faisal Islam, chief North America correspondent Gary O’Donoghue and Panorama filmmaker Jane Corbin.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi.  The social producer was Joe Wilkinson and Gabriel Purcell-Davis. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Will The US Attack Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-26T19:14:00.000Z",
      "dateModified": "2026-02-26T19:14:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n32y2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-25T07:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Feb 2026,·31 minsTrump's big, long, State of the Union speechAmericastAvailable for over a yearThe Americast team assembles for a late evening/early morning special as President Trump delivers the longest State of the Union address ever. On the agenda was a full-throated defence of the administration’s record, hailing a \"turnaround for the ages,” whilst playing down the Supreme Court's ruling against his signature tariff policy (with the judges themselves in the crowd).\nDespite the speech lasting nearly two hours,  there was little to suggest a change of course from Trump’s favourite taking points. He focused on the economy, immigration, the Democrats…. And the US men’s olympic hockey team.\nBut with growing voter dissatisfaction souring the polls, will Trump’s sales pitch be enough to counter sliding approval ratings and convince voters to stick with him for November's midterm election?\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Stephen Bailey. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-25T07:03:00.000Z",
      "dateModified": "2026-02-25T07:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No 10 will have no say on which Mandelson papers are released",
    "url": "https://www.bbc.com/news/articles/cp85j06ezyro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fbe/live/b92e9af0-1340-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T18:24:18.000Z",
    "description": "11 hours agoBBCSenior MPs and peers will have the final say on whether sensitive information is published relating to Peter Mandelson's appointment an",
    "body": "11 hours agoBBCSenior MPs and peers will have the final say on whether sensitive information is published relating to Peter Mandelson's appointment and role as US ambassador.Parliament's Intelligence and Security Committee (ISC) said it had confirmed with the government that it alone would make the decision.The committee said agreement had been reached on which papers would be published, with hopes some could be released \"shortly\".Additionally, the Metropolitan Police and government have \"agreed a framework\" to determine which documents can be released without prejudicing a criminal investigation into Lord Mandelson.A UK government spokesperson said officials were \"proceeding at pace to publish the first tranche of documents in early March\" and \"working closely\" with the ISC to fulfil their requests.Lord Mandelson is under criminal investigation over allegations he passed sensitive information to convicted sex offender Jeffrey Epstein when he was a Labour minister.The peer was arrested by the Metropolitan Police on suspicion of misconduct in public office on Monday and later released on bail, pending further investigation.Lord Mandelson did not respond to requests for comment but the BBC understands his position is that he has not acted in any way criminally and that he was not motivated by financial gain.The Metropolitan Police has told the government not to release certain documents that could undermine its investigation.Prime Minister Sir Keir Starmer told MPs he wanted to release the documents but said he would not publish anything that could damage national security or diplomatic relations.The government is likely to start publishing documents relevant to Lord Mandelson's appointment as the UK's ambassador to the US as soon as next week.But material the government considers damaging to national security or diplomatic relations will be sent to the cross-party ISC and the parliamentarians will decide what to publish.The government was forced to hand over control of that part of the process to the ISC following concern by MPs that Downing Street could have too much say in what is published.On Thursday, the ISC said it had received a written guarantee that neither the prime minister nor the government would have the final say on what is considered too sensitive to disclose.Darren Jones, the chief secretary to the prime minister, told MPs on Monday that the first tranche of Lord Mandelson documents would be published in early March.Jones said police had already advised ministers that certain documents, including exchanges between Lord Mandelson and No 10, should not be published in the first tranche.The BBC understands that one specific exchange police have blocked from being released next month includes three questions Sir Keir put to Lord Mandelson about his friendship with Epstein prior to his appointment as US ambassador. The questions were related to his continued contact with Epstein after his first conviction for soliciting prostitution with a minor, reports that he had stayed at Epstein's home while the financier was in prison, and his association with a charity founded by Epstein associate Ghislaine Maxwell.Sir Keir has claimed the documents will show Lord Mandelson lied to him about the extent of his friendship with Epstein, which continued after he had been convicted in 2008.The BBC understands Lord Mandelson's view is that he answered questions about his relationship with Epstein in the vetting process accurately.The request to the European Anti-Fraud Office (Olaf) was made last week, a Commission spokeswoman said, after communications between the peer and Epstein were among the published documents.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No 10 will have no say on which Mandelson papers are released",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fbe/live/b92e9af0-1340-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T18:24:18.000Z",
      "dateModified": "2026-02-26T18:24:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MoD launches review into whether Epstein used RAF bases",
    "url": "https://www.bbc.com/news/articles/c86y466v0x6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/361f/live/e61e0130-1355-11f1-a24b-e9ec85119d46.jpg",
    "tag": "Trending",
    "date": "2026-02-26T20:52:51.000Z",
    "description": "8 hours agoNick Eardley,Political correspondentandIan AikmanReutersThe Ministry of Defence (MoD) has launched a review into whether RAF bases were use",
    "body": "8 hours agoNick Eardley,Political correspondentandIan AikmanReutersThe Ministry of Defence (MoD) has launched a review into whether RAF bases were used by Jeffrey Epstein.It is expected the review, first reported by the Telegraph, will look into records and emails, while Defence Secretary John Healey was said to have ordered officials to turn over every stone to establish whether the late sex offender landed his private jet at military sites when visiting the UK.An MoD source said it would \"ruthlessly pursue any information that can shed light on this scandal\".It comes after former Prime Minister Gordon Brown demanded a police investigation into whether Andrew Mountbatten-Windsor had used RAF bases to meet Epstein.Brown said he had submitted a five-page dossier to several UK police forces – including the Met, Sussex and Thames Valley Police – providing new and additional information from Epstein-related documents published in the US.Last Sunday, the Sunday Telegraph reported that the former prime minister was understood to be concerned about a flight Epstein took on a Gulfstream jet that landed at RAF Marham air base in Norfolk in December 2000. The base is around 20 miles (32 km) from the Sandringham Estate.Last year, a BBC News investigation established that around 90 flights linked to Epstein had arrived and departed from UK airports, some with British women on board who say they were abused.At the time, the Ministry of Defence said it was \"standard practice for spare capacity at RAF airfields in the UK to be used for private or commercial aircraft, subject to fees which cover all costs\".Mountbatten-Windsor has previously denied any wrongdoing in relation to Epstein, who died in a New York prison cell in 2019 as he awaited trial on sex trafficking charges.An MoD spokesperson said: \"The defence secretary has ordered a review of all records that the department may hold relating to Epstein flights landing at RAF bases to ensure that any information which relates to Epstein's crimes is uncovered and provided to the relevant authorities.\"The MoD will support any civilian police investigations. Our thoughts are with all the victims of Epstein's vile crimes.\"Stansted Airport said in a statement that the terminals used for private flights are \"entirely independent\" and that \"no private jet passengers enter the main airport terminal\".Immigration and customs checks for passengers arriving via private jets are carried out \"directly by Border Force\", it said, adding that it does not \"manage or have any visibility of passenger arrangements on privately operated aircraft\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MoD launches review into whether Epstein used RAF bases",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/361f/live/e61e0130-1355-11f1-a24b-e9ec85119d46.jpg"
      ],
      "datePublished": "2026-02-26T20:52:51.000Z",
      "dateModified": "2026-02-26T20:52:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ed Miliband says climate impact of data centres is uncertain",
    "url": "https://www.bbc.com/news/articles/cx2drxgz7x8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d21b/live/65810f20-1334-11f1-ba29-8dbbd227222d.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:03:54.000Z",
    "description": "5 hours agoJoshua NevettPolitical reporterPA MediaEnergy Secretary Ed Miliband is leading the UK government's efforts to reduce carbon emissionsEnergy",
    "body": "5 hours agoJoshua NevettPolitical reporterPA MediaEnergy Secretary Ed Miliband is leading the UK government's efforts to reduce carbon emissionsEnergy Secretary Ed Miliband has said the impact of the rapid expansion of data centres on the UK's efforts to lower carbon emissions to net zero is \"inherently uncertain\".Miliband made the comment in a letter to MPs who had expressed concerns about data centres not being mentioned in the government's plans to deliver net zero.MPs have launched a new inquiry into the environmental impacts of data centres in the UK after receiving Miliband's letter.Data centres are giant facilities full of powerful computers used to run digital services, such as streaming and artificial intelligence (AI).The UK government wants the country to be a world leader in AI and is seeking to attract investment in data centres to achieve this goal.But there are concerns about the large amounts of water and electricity needed to run them, including from gas-powered generators.Dozens of new data centres, many funded by US tech firms, are being planned and environmental campaigners fear this could significantly increase emissions.The UK government is under a legal obligation to reduce carbon emissions to net zero by 2050, after a law change passed in 2019 with cross-party support.In his letter, Miliband said the government's modelling \"accounts for potential emissions from data centres through our projection of overall electricity demand growth, which reflects broader economic trends\".But he added: \"Future demand from data centres, and interaction with wider energy system demands, remains inherently uncertain.\"Miliband said the modelling would \"test a range of trajectories to assess the potential emissions impact under different outcomes\".It is the most detail Miliband has given yet on his department's approach to factoring in the impact of data centres.Increasing demandThe response was prompted by a letter from the chair of the Environmental Audit Committee, Toby Perkins, who asked Miliband whether data centres had been factored into net-zero plans.His committee's new inquiry will examine how much energy and water data centres are likely to use, and how this could impact the government's net zero goals.\"Will data centres power the UK's economic growth? Perhaps,\" Perkins said.\"But what kind of implications will they have for energy and the environment?\"The Labour MP said it was \"critical that we really consider what the impacts of data centres will be before we charge into approving them en masse\".The Conservative shadow energy secretary, Claire Coutinho, said barring data centres from the UK \"because of domestic net zero targets will do nothing to tackle climate change, but it will make us all poorer\".She added: \"If we adopted a more rational approach we could have the benefits of growth from AI, focus our attention on exporting the clean tech the rest of the world needs, and protecting nature here and abroad.\"Getty ImagesThe number of data centres, like this Google facility in Hertfordshire, is increasingThe UK government has been investing heavily in renewable energy in its bid to meet 95% of electricity demand with clean power by 2030.But the rapid rise in electricity demand could make it more difficult to meet the target.This month Ofgem, the UK's energy market regulator, said a surge in demand for grid connections last year had been \"driven by the rapid growth\" of data centres.In a report, Ofgem said it was aware of 140 proposed data centres, which would require about 50 gigawatts (GW) of electricity – 5GW more than the country's current peak demand.Friends of the Earth, a campaign group, said if all of those data centres came online, \"they could consume more electricity each day than the entire country does now\".\"It's no wonder the government views the future usage of data centres as 'inherently uncertain',\" said Mary Stevens, a spokesperson for the group.\"What isn't uncertain is this government's growth-at-all-costs agenda.\"\"Having greenlit rampant airport expansion, and now potentially a raft of data centres, it's unclear how ministers will ensure the UK sticks to its legally binding climate targets and prevents rocketing emissions and water usage,\" the Friends of the Earth spokesperson added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ed Miliband says climate impact of data centres is uncertain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d21b/live/65810f20-1334-11f1-ba29-8dbbd227222d.jpg"
      ],
      "datePublished": "2026-02-27T00:03:54.000Z",
      "dateModified": "2026-02-27T00:03:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celine Cremer: Remains found in Tasmania most likely belong to missing Belgian backpacker ",
    "url": "https://www.bbc.com/news/articles/cgqgl88w155o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0797/live/5cd18b90-1364-11f1-af0d-af544dd82419.jpg",
    "tag": "Trending",
    "date": "2026-02-26T23:33:49.000Z",
    "description": "6 hours agoLana LamSydneyTasmania PoliceCeline Cremer, 31, went missing in 2023 after going for a hike in a Tasmanian rainforestPolice have confirmed ",
    "body": "6 hours agoLana LamSydneyTasmania PoliceCeline Cremer, 31, went missing in 2023 after going for a hike in a Tasmanian rainforestPolice have confirmed that human remains found in a Tasmanian rainforest are most likely those of a Belgian backpacker who went missing in 2023 after going for a hike.Celine Cremer, 31, was reported missing days after she went for a hike near Philosopher's Falls in Waratah, in Tasmania's northwest. Police spent months searching for her but failed to find anything.A private search involving dozens of volunteers in recent months uncovered her bones, teeth, mobile phone and clothing, prompting police to renew their efforts. On Friday, police - with permission from her family - said the remains had been \"provisionally identified\" as Cremer's with expert reports providing \"compelling evidence\".Tasmania Police Commander Nathan Johnston extended his sincere condolences to Cremer's family and loved ones. \"While this provisional confirmation will not ease their loss, we hope the outcome will provide them with some measure of clarity and closure,\" he said. He also thanked all community members for their support and interest in her case, praising search and rescue personnel and volunteers who \"dedicated significant time and resources during the many search phases\".For months, Cremer's case had baffled many as initial police searches failed to lead to any clues about her whereabouts.Limited resources and extreme weather hampered police efforts, with searchers hindered by heavy rainfall, freezing conditions and snow. After police called off their search, Cremer's family hired a private investigator who trained a group of volunteers to scour the area of dense wilderness, according to the Australian Broadcasting Corporation (ABC).Some of those volunteers had joined the search party after seeing videos posted by a local filmmaker who was closely following the case, the ABC reported.A report will be prepared by the coroner to officially determine the identity of the remains.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celine Cremer: Remains found in Tasmania most likely belong to missing Belgian backpacker ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0797/live/5cd18b90-1364-11f1-af0d-af544dd82419.jpg"
      ],
      "datePublished": "2026-02-26T23:33:49.000Z",
      "dateModified": "2026-02-26T23:33:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: How did this baby monkey break the internet's heart?",
    "url": "https://www.bbc.com/news/articles/cn4gwn9w30yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9020/live/7b9e80b0-132c-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-26T17:31:57.000Z",
    "description": "13 hrs agoGorilla dies days after moving to new homeBristol Zoo Project's gorilla had a number of known conditions, but his health deteriorated after ",
    "body": "13 hrs agoGorilla dies days after moving to new homeBristol Zoo Project's gorilla had a number of known conditions, but his health deteriorated after the move.13 hrs ago2 days agoJapan to deploy missiles on island near Taiwan by 2031The remote Yonaguni island lies on the frontlines of self-governing Taiwan's growing tensions with China.2 days ago4 days agoMuch-loved unlikely animal friends die on same dayA tapir and a capybara with a strong bond are euthanised on the same day so neither would be lonely.4 days ago4 days agoWhat now for Asia after Trump's tariffs struck down?After the Supreme Court ruling, Trump said he would impose new levies of 15% on goods entering the US.4 days ago6 days agoPenguin pool upgraded ahead of breeding seasonA new viewing area is an \"important milestone\", keepers at the Cornwall zoo say.6 days ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: How did this baby monkey break the internet's heart?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9020/live/7b9e80b0-132c-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-26T17:31:57.000Z",
      "dateModified": "2026-02-26T17:31:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China removes nine military officials ahead of key political meeting ",
    "url": "https://www.bbc.com/news/articles/c6270z0dr6no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/68e7/live/2331aec0-1386-11f1-93b0-b93a7c0c5701.jpg",
    "tag": "Trending",
    "date": "2026-02-27T04:29:01.000Z",
    "description": "40 minutes agoYvette TanGetty ImagesSince coming to power, Xi has launched waves of anti-corruption drivesChina has removed 19 officials, including ni",
    "body": "40 minutes agoYvette TanGetty ImagesSince coming to power, Xi has launched waves of anti-corruption drivesChina has removed 19 officials, including nine from the military, from its list of lawmakers ahead of its biggest annual political meeting next week.The removals were announced by the country's top legislative body, the National People's Congress (NPC) Standing Committee. No official reason for the removal has been given, but it comes just weeks after President Xi Jinping removed Zhang Youxia, his highest-ranking general and also one of his closest military allies, from his role. Since coming to power, Xi has launched waves of anti-corruption drives, calling corruption \"the biggest threat\" to the Communist Party. However, some critics say it has been used as a tool to purge political rivals.According to a report by state media outlets, those removed include Li Qiaoming, commander of the People's Liberation Army (PLA) Ground Force and Shen Jinlong, a former PLA Navy commander. Also on the list were several other military officers and a number of provincial officials including Sun Shaochong, the former party chief of the Inner Mongolia region. It comes just weeks after Zhang was removed from his post, after he was accused of \"serious violations of discipline and law\" - typically a euphemism for corruption.But it is also the latest in a series of purges of high-profile figures in the military over the last few years, including a October 2025 crackdown which saw nine top generals removed from their posts. Authorities at the time said the purges were part of an anti-corruption drive. Xi has made the fight against corruption a central pillar of his rule beginning with his \"tigers and flies\" anti-corruption drive targeting both high-level and low-level officials, launched shortly after he took power in 2013. He has said recently that the battle \"remains grave and complex\".Thousands of delegates are due to descend on the capital Beijing next week for the Two Sessions. These are- the annual meetings of the NPC, which is China's legislature, and the Chinese People's Political Consultative Conference which is the country's top political advisory body.The Two Sessions will run from March 4 to 11 and will see the government announce its five year plan, where it outlines its key policy objectives, and its annual economic targets. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China removes nine military officials ahead of key political meeting ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/68e7/live/2331aec0-1386-11f1-93b0-b93a7c0c5701.jpg"
      ],
      "datePublished": "2026-02-27T04:29:01.000Z",
      "dateModified": "2026-02-27T04:29:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jack Dorsey's Block cuts thousands of roles as it embraces AI",
    "url": "https://www.bbc.com/news/articles/cq570d12y9do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1325/live/9097d0e0-1361-11f1-af0d-af544dd82419.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:06:40.000Z",
    "description": "5 hours agoLucy HookerandKali Hays,Technology reporterBloomberg via Getty ImagesJack Dorsey co-founded TwitterTwitter co-founder Jack Dorsey says his ",
    "body": "5 hours agoLucy HookerandKali Hays,Technology reporterBloomberg via Getty ImagesJack Dorsey co-founded TwitterTwitter co-founder Jack Dorsey says his technology firm Block is laying off almost half its workforce because artificial intelligence (AI) \"fundamentally changes what it means to build and run a company.\"\"Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes,\" he wrote in a letter to shareholders.The layoffs will mean headcount at the company - which owns Square, CashApp and Tidal - will fall to less than 6,000 from 10,000.Block has seen several rounds of layoffs since 2024 but this is the first time it has cited AI as the reason for redundancies and marks the latest in a series of major job cuts in the tech industry.In a subsequent call discussing financial results, Brian Olsavsky, Amazon's chief financial officer, said the company was looking at cost reductions elsewhere as it ramps up AI spending. Meta, Microsoft and Google have also laid off workers as their focus has shifted to huge investments in AI.Mark Zuckerberg, Meta's co-founder and chief executive, said he is expecting \"2026 to be the year that AI dramatically changes the way we work.\"\"We're starting to see projects that used to take big teams now be accomplished by a single, very talented person,\" Zuckerberg said.Most tech companies today are using AI tools that automatically write the computer code required to operate software or websites, like Claude Code from Anthropic or Codex from OpenAI. But some analysts have suggested the immediate threat to jobs has been exaggerated by executives who want to appear ahead of the curve.According to Dorsey, only more change related to AI capabilities is on the way.\"I don't think we're early to this realisation,\" he said Thursday. \"I think most companies are late\". Block's financial report showed strong demand for its products and services, pushing up profits at the end of last year.The firm also said it will incur up to $500m (£370m) in restructuring costs as it pivots to the new strategy.Its shares rose by more than 20% in extended trading after the announcement.Dorsey is a co-founder and former chief executive of Twitter, the online micro-messaging platform that was later bought by Elon Musk and renamed X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jack Dorsey's Block cuts thousands of roles as it embraces AI",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1325/live/9097d0e0-1361-11f1-af0d-af544dd82419.jpg"
      ],
      "datePublished": "2026-02-27T00:06:40.000Z",
      "dateModified": "2026-02-27T00:06:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Invisible welfare state' and 'Huntley fights for life'",
    "url": "https://www.bbc.com/news/articles/cdxz4rq8z48o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d1d4/live/51fae870-1377-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-27T04:54:15.000Z",
    "description": "5 minutes ago\"Parents have become 'invisible welfare state' for jobless young\", is the front page headline on the Times. Former Labour Minister Alan M",
    "body": "5 minutes ago\"Parents have become 'invisible welfare state' for jobless young\", is the front page headline on the Times. Former Labour Minister Alan Milburn, who is leading a government review into youth unemployment, tells the paper parents are \"often having to cope with the 'mental health crises' of children who were struggling to find jobs\". Meanwhile, the lead story says Lord Mandelson's lobbying firm Global Counsel found a \"tranche of his business email record was missing\". The government has agreed to release emails related to his time as the UK ambassador to the US. Lord Mandelson did not respond to the paper's requests for comment.The number of young people \"Not in Education, Employment, or Training\" (Neet) has risen \"perilously\" close to one million, the Metro reports in its top story. Chancellor Rachel Reeves faces \"demands to act\", the paper writes, as fears mount of a \"lost generation of 16 to 24-year-olds\".\"Assisted dying legislation faces collapse\" and \"is widely expected to fail\" writes the i paper. Lord Falconer, a supporter of the bill, accuses peers of \"filibustering\", according to the paper, while a critic, Baroness Berger, defends the prolonged debates as Lords \"doing their job of scrutinising a bill they argue is not safe in its current form\".Soham double murderer Ian Huntley \"fights for life\" after a \"jail beating\", the Daily Mirror says in its top story. It reports Huntley was \"battered around the head with a metal bar by a fellow inmate\" on Thursday, adding he \"was targeted in a workshop at HMP Frankland\" in County Durham. Huntley \"clinging to life\" is the Daily Star's lead story, noting he was \"taken to hospital by helicopter\". A photograph 10 year-olds Jessica Chapman and Holly Wells, who Huntley murdered in 2002, is embedded on the front page. The Daily Mail describes it as a \"vicious ambush\" which has left Huntley in a \"bad, bad way\".\"Triple killer Anthony Russell, 43, is suspected of battering [Huntley] in a workshop using the makeshift weapon\", the Sun reports. After being the first newspaper to report on the attack on Thursday, it now writes the alleged suspect yelled \"I've done it, I've done it!\" after the assault. Meanwhile, the Guardian leads with experts warning a \"drop in migrant workers 'will be a car crash' for NHS and care homes\". The paper writes \"the number of foreign nurses granted entry to Britain has fallen by 93% over three years\", citing analysis of Home Office figures by the charity Work Rights Centre.The Daily Express leads with new figures from the Home Office showing \"only 6% of Channel migrants were deported last year\". Critics, including Reform UK and senior Conservative MPs, claim \"Labour lacks the backbone to stop the boats\", the paper says. Minister for border security and asylum, Alex Norris, tells the paper the latest figures show the government is \"making progress\" but more \"must be done to stop people crossing the Channel illegally\".\"Spanish police to patrol Gibraltar\" is the Daily Telegraph's lead story. \"Under the British territory's Brexit deal\", Spanish officers will have the powers to \"make arrests and monitor borders\", it says. The paper says the measure breaks \"a previous pledge for no boots on the ground\", which Gibraltar's chief minister Fabian Picardo denies. The paper also features an enlarged image of West End actress Ruthie Henshall under the headline \"the showgirl and the Prince\", teasing her memoir \"inspired by her 'bittersweet' relationship with Prince Edward\". The front page does not include comments from Buckingham Palace or the Duke of Edinburgh.The Financial Times says \"Government debt sales are expected to drop for the first time in four years\", in a boost to Chancellor Rachel Reeves.  This is partly \"bolstered by a cut in the government's borrowing needs after a broad rise in taxes\", it says.The early editions of Friday's papers came out before the result of the Gorton and Denton by-election.The tabloids focus on the attack on child murderer Ian Huntley in prison. \"I've done it! I've done it!\" headlines the Sun, quoting the apparent words shouted by the prisoner who allegedly struck Huntley with a metal pole. A source tells the Daily Mirror \"the attacker got him when he least expected it\". The Daily Mail says Huntley is \"close to death\".The Guardian says experts are warning that hospitals and care homes face \"an impending car crash\" as research shows the number of nurses and care workers coming from overseas has collapsed. The paper points to analysis of Home Office figures which suggests the number of \"foreign nurses granted entry to Britain has fallen by 93% over three years\".The Times says the lobbying company founded by Lord Mandelson has discovered that a \"significant\" tranche of his business emails are missing. Global Counsel conducted an internal audit of the peer's emails, after the government agreed this month to release messages relating to his time as the British ambassador to the US. The paper says Lord Mandelson did not respond to requests for comment, but it is known that he stopped being able to access his email address last February. Global Counsel went into administration last week.The \"i\" Paper says peers have been accused of sabotaging assisted dying legislation in England and Wales, which it says faces \"collapse\". A critic of the proposals, Baroness Berger, says supporters of the bill are \"attacking Lords who are only doing their job\". The Daily Telegraph says if the legislation does fail, about 50 MPs in favour of assisted dying will attempt to force it into law by putting their names forward for private member's bills.The front page of the Financial Times features a picture of the North Korean leader, Kim Jong Un, and his teenage daughter Kim Ju Ae, in matching leather jackets. The paper says their appearance, at a military parade, has \"fuelled speculation she is being groomed to become the eventual leader of the dictatorship\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Invisible welfare state' and 'Huntley fights for life'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d1d4/live/51fae870-1377-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-27T04:54:15.000Z",
      "dateModified": "2026-02-27T04:54:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taking collagen keeps skin elastic but won't stop wrinkles, say scientists ",
    "url": "https://www.bbc.com/news/articles/cge82vq9x9ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/38c8cb00-130a-11f1-bf20-f10c8e9eb926.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:00:11.000Z",
    "description": "5 hours agoMichelle RobertsDigital health editorGetty ImagesCollagen is a type of protein made naturally in the body but that declines with ageTaking ",
    "body": "5 hours agoMichelle RobertsDigital health editorGetty ImagesCollagen is a type of protein made naturally in the body but that declines with ageTaking daily collagen supplements can rejuvenate the skin by boosting elasticity and hydration or moisture - but it won't stop wrinkles, says a new scientific review. Experts looked at the available evidence and say they are highly confident that collagen pills or powder provide \"some legitimate\" skin gains if taken over time but are no quick fix. The supplements may also ease wear and tear, arthritis joint pain and stiffness, according to the results from 113 trials involving nearly 8,000 people. Collagen is a type of protein made naturally in the body but that declines with age. It supports and strengthens skin, nails, bones and connective tissues, including tendons and cartilage.'Collagen is not a cure-all'From early adulthood onwards, the body produces less collagen and existing collagen breaks down at a slightly faster rate.Smoking and sun damage make this worse.Around the menopause, when women stop having periods, skin loses even more collagen - about a third, say the researchers who have published their findings in the Aesthetic Surgery Journal Open Forum. There are several types of supplements people can take, including marine, bovine and vegan collagen. The review was unable to show if certain types worked better than others.Collagen supplements - The secret to perfect skin or marketing hype? Can eating collagen improve your skin and joints?Getty Images\"Collagen does have credible benefits when used consistently over time,\" says Prof SmithThe researchers from Anglia Ruskin University stress that many of the studies conducted with supplements have been funded by the supplement industry, and that \"bold claims\" have been made about collagen anti-ageing benefits. The review did not have any industry funding.One of the lead investigators, Prof Lee Smith, said: \"This study brings together the strongest evidence to date on collagen supplementation.\"Collagen is not a cure-all, but it does have credible benefits when used consistently over time, particularly for skin and osteoarthritis. Our findings show clear benefits in key areas of healthy ageing, while also dispelling some of the myths surrounding its use.\"Collagen may be best positioned not as an anti-wrinkle treatment, but for holistic maintenance for ageing and sun-damaged skin, say the researchers. Smith says: \"If we define anti-ageing as a product or technique designed to prevent the appearance of getting older, then I believe our findings do support this claim for some parameters.\"For example, an improvement in skin tone and moisture is associated with a more youthful-looking appearance.\"Skin-friendly diet Bridget Benelam, a nutrition scientist at the British Nutrition Foundation, said diet was also important for skin health. \"Vitamin C helps with collagen formation and so ensuring you get enough from foods such as citrus fruits, berries, green vegetables, peppers and tomatoes may help. Zinc, found in meat, poultry, cheese, some shellfish, nuts, seeds and wholegrains, also helps the body produce collagen.\"Dietary sources of collagen and many collagen supplements are made from animal products and so not suitable for vegan diets. However, the body makes its own collagen from the amino acids found in dietary protein and so protein from sources such as beans and lentils can provide the amino acids needed for collagen production. There are also vegan supplements available.\"Dr Tamara Griffiths, president of the British Association of Dermatologists, welcomed the research but recommended more: \"Further data with targeted, robust dermatological studies are required to build on the promise raised by this systematic review.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taking collagen keeps skin elastic but won't stop wrinkles, say scientists ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/38c8cb00-130a-11f1-bf20-f10c8e9eb926.jpg"
      ],
      "datePublished": "2026-02-27T00:00:11.000Z",
      "dateModified": "2026-02-27T00:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK winter nowhere near a record breaker despite relentless rain and storms",
    "url": "https://www.bbc.com/weather/articles/c1e9d20pg2lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/32c0/live/90fc9ee0-12ed-11f1-89c0-597e6cfce3ac.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:06:49.000Z",
    "description": "Image source, Joe Giddens/PA WireByBen RichLead Weather PresenterIf you have been hit by relentless rain and flooding this winter you might well be ex",
    "body": "Image source, Joe Giddens/PA WireByBen RichLead Weather PresenterIf you have been hit by relentless rain and flooding this winter you might well be expecting the weather to have broken some records.Provisional statistics from the Met Office show that is not the case, with rainfall so far this season, for the UK as a whole, just 9% above average overall - wet, but far from the wettest.However those national figures mask some huge regional variations. Some parts of southern England are on course for their second-wettest winter on record, while much of north-west Scotland has been significantly drier than normal.It is largely down to a blocked weather pattern that sent rain into the same parts of the country repeatedly for much of the winter and left others predominantly dry.Relentless rain for some - but not allMeteorological winter runs until the end of February - so there are still a couple of days of potential rainfall to count.However, the Met Office has crunched the numbers up until 25 February and revealed that southern England has already had its seventh-wettest winter since records began in 1836.That figure may change with more rain in the forecast for the end of the season.England overall has had 35% more rainfall than it would expect in a typical winter, with Northern Ireland 25% wetter than normal and Wales 14% above its usual rainfall figure.But Scotland has actually had 16% less rainfall than in a normal winter - despite some parts of the east being very wet indeed.Image caption, Blue areas on this map show above-average rainfall, with below-average figures shown in brownThese variations in rainfall can largely be explained by a so-called blocked weather pattern which left our weather stuck in a rut for most of January and February.The jet stream sent areas of low pressure spinning in from the Atlantic, but their progress was blocked by an area of high pressure that became slow-moving across Scandinavia.Image caption, A blocked weather pattern with south-easterly winds has lingered for most of 2026 so farThat kept the UK in a feed of south-easterly winds, meaning relentless rain for areas exposed to those winds such as southern England and eastern Scotland - while keeping sheltered areas like western Scotland and north-west England drier than they would normally expected.That is why some places experienced seemingly relentless rain - including 55 consecutive wet days at Cardinham in Cornwall - while others were left wondering what all the fuss was about.Four named stormsWinter brought four named storms - Bram, Goretti, Ingrid and Chandra.Storm Bram brought widespread impacts but was described by the Met Office as a \"notable but not exceptional Atlantic winter storm\".Storm Goretti was a different story.Its most significant impacts were felt in the far south-west of England where it was one of the most impactful storms to affect Cornwall and the Isles of Scilly in decades. A rare Met Office red warning was issued triggering an emergency alert to be sent to thousands of mobile phones.A wind gust of 99mph (159km/h) recorded at St Mary's was the highest wind speed recorded in the Isles of Scilly for 47 years.Julie Luscombe from Redruth, Cornwall, explained that winds picked up suddenly and caused damage to her home as she told BBC Your Voice.\"Almost immediately it went from silence to all my fences being taken down.Media caption, Wind and rain from Storm Goretti caused significant damage to Julie Luscombe's property\"The tiles and the bathroom roof were literally lifting up and slamming back down - it was just so quick\".Julie says she felt \"disbelief that a storm could have caused so much damage, especially when the trees were ripped out of the ground\".Heavy rain brought flooding in parts of southern England with significant snow in parts of Wales, the Midlands and northern England as the storm bumped into cold air.Storm Ingrid and Storm Chandra then hit the south and south-west of the UK in the space of less than a week, adding to the flooding problems and bringing disruption to road and rail transport.A lack of sunshine - but snow for someSunshine was in short supply - as people in Aberdeen will confirm.The city spent three weeks under grey skies in the midst of what looks to have been Scotland's fifth dullest winter since 1910.Things were a little brighter for some places further south in the UK, but overall the country has only seen 80% of the sunshine it would expect in an average winter.Temperatures have been above average overall but there were colder interludes and some places have seen significant snow.Ski resorts in Scotland say they have had their best season in years.It is proof that even as the climate warms overall there will still be short-term spells of cold winter weather.What does climate change mean for UK winters?Our winters are already getting warmer and wetter.According to the Met Office, UK winters have already warmed by 1C (1.8F) since the 1950s due to human-induced global warming. Six of the ten warmest winters on record have occurred since the year 2000, with only one 21st century winter (2009/2010) featuring in the top ten coldest.This means we are seeing less snow and fewer frosts - in fact we now get around four weeks less ground frost than we did half a century ago.However, one thing we are seeing more of is rain.Out of nearly 260 years of records, six out of the ten wettest winter half-years - the period from October to March - have been since the year 2000.These changes are predicted to continue as the world continues to warm.In a situation where high levels of greenhouse gas emissions continue, the Met Office expects winters to be between 1 and 4.5C (1.8-8.1F) warmer than they were in 1990 - and up to 30% wetter.That is because a warmer atmosphere is able to hold more moisture, so when rain comes it will be heavier and more intense.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK winter nowhere near a record breaker despite relentless rain and storms",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/32c0/live/90fc9ee0-12ed-11f1-89c0-597e6cfce3ac.jpg"
      ],
      "datePublished": "2026-02-27T00:06:49.000Z",
      "dateModified": "2026-02-27T00:06:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthropic boss rejects Pentagon demand to drop AI safeguards",
    "url": "https://www.bbc.com/news/articles/cvg3vlzzkqeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7142/live/8c4d2350-136b-11f1-986d-69868da76563.jpg",
    "tag": "Trending",
    "date": "2026-02-27T03:54:27.000Z",
    "description": "1 hour agoKali HaysTechnology reporterReutersAnthropic  chief executive Dario AmodeiAnthropic has said it will not back down in a fight with the US De",
    "body": "1 hour agoKali HaysTechnology reporterReutersAnthropic  chief executive Dario AmodeiAnthropic has said it will not back down in a fight with the US Department of Defense (DoD) over how its artificial intelligence (AI) technology is used.The firm's chief executive Dario Amodei said on Thursday that his company would rather not work with the Pentagon than agree to uses of its tech that may \"undermine, rather than defend, democratic values.\"His comments come two days after a meeting with US Secretary of Defense Pete Hegseth over demands that Anthropic accept \"any lawful use\" of its tools. It ended with a threat to remove Anthropic from the DoD's supply chain.\"These threats do not change our position: we cannot in good conscience accede to their request,\" Amodei said.At issue for Anthropic is the potential use of its AI tools like Claude for two purposes: \"Mass domestic surveillance\" and \"Fully autonomous weapons.\"Amodei said \"such use cases have never been included in our contracts with the Department of War, and we believe they should not be included now.\"The Department of War is a secondary name for the Defense Department under an executive order signed by US President Donald Trump in September.\"Should the Department choose to offboard Anthropic, we will work to enable a smooth transition to another provider,\" Amodei said.An Anthropic spokeswoman added on Thursday that while the company received updated wording from the DoD for its contract on Wednesday night, it represented \"virtually no progress on preventing Claude's use for mass surveillance of Americans or in fully autonomous weapons.\"    \"New language framed as compromise was paired with legalese that would allow those safeguards to be disregarded at will,\" she said. \"Despite [the Department of War's] recent public statements, these narrow safeguards have been the crux of our negotiations for months.\"A representative of the Defense Department could not be reached for comment.Emil Michael, the US Undersecretary for Defense, personally attacked Amodei on Thursday night, writing on X that the executive \"wants nothing more than to try to personally control the US Military and is ok putting our nation's safety at risk.\"A Pentagon official previously told the BBC that should Anthropic not comply, Hegseth would ensure the Defense Production Act was invoked on the company.The act essentially gives a US president the authority to deem a given company or its product so important that the government can require it to meet defence needs.But Hegseth also threatened to label Anthropic a \"supply chain risk\", meaning the company would be designated as not secure enough for government use.A former DoD official who asked not to be named told the BBC on Thursday that Hegseth's grounds for either measure were \"extremely flimsy\".A person familiar with the negotiations who asked not to be named said tensions between Anthropic and the Pentagon \"go back several months,\" before it was publicly known that Claude was used as part of a US operation to seize Venezuelan President Nicolás Maduro.While Amodei did not specify exactly how Anthropic could be or had been used by the DoD for mass surveillance or fully autonomous weapons, he wrote in a company blog post that AI can be used to \"assemble scattered, individually innocuous data into a comprehensive picture of any person's life - automatically and at massive scale.\"\"We support the use of AI for lawful foreign intelligence and counterintelligence missions,\" Amodei said. \"But using these systems for mass domestic surveillance is incompatible with democratic values.\"As for AI being used in weapons, Amodei said even today's most advanced and capable AI systems \"are simply not reliable enough to power fully autonomous weapons.\"\"We will not knowingly provide a product that puts America's warfighters and civilians at risk,\" Amodei said. \"Without proper oversight, fully autonomous weapons cannot be relied upon to exercise the critical judgment that our highly trained, professional troops exhibit every day. They need to be deployed with proper guardrails, which don't exist today.\"He added that Anthropic had \"offered to work directly with the Department of War on R&D to improve the reliability of these systems, but they have not accepted this offer.\"Hegseth had demanded the Tuesday meeting with Amodei, a source previously told the BBC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthropic boss rejects Pentagon demand to drop AI safeguards",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7142/live/8c4d2350-136b-11f1-986d-69868da76563.jpg"
      ],
      "datePublished": "2026-02-27T03:54:27.000Z",
      "dateModified": "2026-02-27T03:54:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]