[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpbrwl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg",
    "tag": "Trending",
    "date": "2026-01-05T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·05 Jan 2026,·21 minsAvailable for over a yearHistorian and The Rest Is History co-host Tom Holland answers your questions about whether Britain is currently in a more precarious state than it was in the 1970s, what definition of ‘radical’ best describes him and if he will ever score a century playing cricket.\nHe also explains why American presidents are often compared to Julius Caesar and faces a question he’s never heard before.\nGET IN TOUCH\n* WhatsApp: 0330 123 9480\n* Email: radical@bbc.co.uk\nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent.\nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis and Joe Wilkinson. Technical production was by Mike Regaard. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg"
      ],
      "datePublished": "2026-01-05T06:00:00.000Z",
      "dateModified": "2026-01-05T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msg62t?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-06T21:26:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·06 Jan 2026,·39 minsUK Troops In Ukraine…But Only Under A Peace DealNewscastAvailable for over a yearToday, Adam and Chris discuss the latest agreement between the Coalition of the Willing and the US to provide security guarantees for Ukraine as part of ongoing efforts to secure a ceasefire with Russia.\nThe talks in Paris saw the UK and France agree to put troops on the ground \"in the event of a peace deal\".\nPlus we look at why President Trump has his sights set on Greenland and whether he really might annex the island.\nAdam is joined by the Economist’s defence editor Shashank Joshi and Dr Gabriella Gricius, senior fellow at the Arctic Institute to discuss the strategic importance of Greenland to security in the Arctic. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi. The social producers were Joe Wilkinson and Beth Pritchard. The technical producer was Ben Andrews. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-06T21:26:00.000Z",
      "dateModified": "2026-01-06T21:26:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Workers' rights bill concessions to save firms billions, analysis shows",
    "url": "https://www.bbc.com/news/articles/c5yv6n536vno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a073/live/07a0b7c0-ec1f-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-07T23:48:54.000Z",
    "description": "Labour's workers' rights concessions to save businesses billions, assessment shows1 hour agoArchie MitchellBusiness reporterGetty ImagesA series of co",
    "body": "Labour's workers' rights concessions to save businesses billions, assessment shows1 hour agoArchie MitchellBusiness reporterGetty ImagesA series of concessions on Labour's flagship workers' rights reforms will save businesses billions of pounds, a government impact assessment shows.An initial analysis by officials found that implementing the party's measures to bolster workers' rights would cost firms up to £5bn a year.However, an updated analysis on Wednesday, which accounted for major concessions made by ministers, said it will now cost companies £1bn a year.The concessions were welcomed by business groups, but faced fierce criticism from some left-wing Labour MPs and union leaders.The Employment Rights Act will give workers access to sick pay and paternity leave from the first day on the job and introduce new protections for pregnant women and new mothers.In November, Labour dropped plans to give all workers the right to claim unfair dismissal from their first day in a job. Instead, it will bring in enhanced protections after six months in employment, the bill's most significant measure.Alongside concessions on unfair dismissal, the government will phase in the overall package over several years, with many of the measures still subject to consultation and secondary legislation.The revised impact assessment also said the lower cost estimate reflected \"clearer implementation timelines\" and more available evidence about the policies.But the British Chambers of Commerce said the £1bn figure \"is likely to be a massive underestimate\".Policy director Kate Shoesmith said: \"The impact figure doesn't adequately account for the harder to quantify costs. Those include staff time for understanding and implementing new processes or explaining these to colleagues.\"Concessions such as introducing the six-month qualifying period will reduce costs – but not on the scale this latest assessment suggests.\"The latest impact assessment also said the Employment Rights Act would have a small positive impact on employment, boosting the amount of people in work by 0.1%.It also said the new measures could have a \"small, positive direct impact on economic growth\".Meanwhile, stronger workers' rights could benefit about 18 million workers, up from an earlier estimate of around 15 million, the analysis showed.Trade unions welcomed the latest impact assessment, saying it would bring \"significant benefits to UK workers, our economy and wider society\".The Trades Union Congress (TUC) said stronger rights at work are \"good for workers and employers – driving up labour market participation, improving health, raising productivity and boosting demand\".Its general secretary Paul Nowak called for ministers to \"finish the job as soon as possible\", warning that secondary legislation to bring in the measures must be \"watertight\".Mike Clancy, general secretary of the Prospect trade union, said: \"This impact assessment is clear that the Employment Rights Act is good for workers, good for growth, and good for wider society.\"The sensible compromises agreed between Government, businesses, and trade unions were intended to make this legislation more workable for all parties, while still delivering robust protections for workers, and this report clearly demonstrates the success of that approach.\"The Department for Business and Trade (DBT) said the Employment Rights Act will \"transform the world of work, delivering stronger protections and higher living standards\".A spokesperson said: \"By making work pay, and more secure, this new analysis demonstrates how it will boost productivity, cut staff turnover, and put more money in the pockets of working people.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Workers' rights bill concessions to save firms billions, analysis shows",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a073/live/07a0b7c0-ec1f-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T23:48:54.000Z",
      "dateModified": "2026-01-07T23:48:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Splash & grab' and 'UK ready to seize more of Putin's ships'",
    "url": "https://www.bbc.com/news/articles/czx3kz4q6yko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a392/live/aa305f40-ec24-11f0-a422-4ba8a094a8fa.png",
    "tag": "Trending",
    "date": "2026-01-08T00:56:38.000Z",
    "description": "9 minutes agoBBCMetro calls the US seizure of a Russian-flagged oil tanker in the North Atlantic a \"splash & grab\". President Donald Trump has \"gamble",
    "body": "9 minutes agoBBCMetro calls the US seizure of a Russian-flagged oil tanker in the North Atlantic a \"splash & grab\". President Donald Trump has \"gambled on another confrontation with the world\", it writes, adding that RAF aircraft aided American forces in the mission.The i Paper understands that the UK is \"ready to seize more\" of Putin's \"shadow ships\" on its own. The possible future missions would be intended to \"stop the illegal flow of oil\" and would be part of a growing \"grey war\". This refers to hostile action that doesn't meet the threshold of an all-out war.The US has said it will control Venezuelan crude oil sakes \"indefinitely\" on the same day that it seized the Russian tanker in the North Atlantic, the FT reports. This marks \"an escalation in Donald Trump's gambit to overhaul the global oil market\". The Times headlines: \"UK joins in the pursuit of Putin's shadow fleet\". Unnamed sources have told the paper that the UK had been aiding the US in planning the mission after it \"slipped through a maritime blockade of Venezuela\". The paper also highlights the \"crime spree\" committed by Met police officers who were not properly vetted.The Guardian also leads with the \"high-stakes Atlantic operation\", adding that a second vessel is \"said to be violating sanctions in Carribbean\".There is \"Kremlin fury\" over the UK's help in the tanker seizure operation, reports the Independent. The vessel was captured between Iceland and Scotland in a \"dramatic move that could put Donald Trump on a collision course with Vladimir Putin\", the paper says.The \"Badenoch blueprint to save our pubs\" leads the Daily Telegraph, as the Conservative leader pledges to abolish business rates for \"thousands of pubs\". The paper also reports on the Met Police vetting story.\"Don't run down clock on 'safe' right to die law\" says the Daily Express. Campaigners say that the House of Lords will cause \"significant harm\" to its reputation if peers don't pass the assisted dying legislation.\"You need to be on fat jabs for life\" writes the Daily Mail following the publication of a University of Oxford study. Most people using the injections will regain the weight they lose \"inside two years of stopping treatment\", it reports. Meanwhile there is \"shock\" as Claudia Winkleman reveals \"lovely\" secret traitor.\"Look who's Huw\" headlines the Sun as it heralds a new TV drama based on its investigation into former BBC News presenter Huw Edwards. Actor Martin Clunes will play the newsreader, who plead guilty to making indecent images of children in July 2024.The Daily Mirror calls for \"Jesy tests\" after the former Little Mix star Jesy Nelson spoke out about her babies' muscular condition SMA (spinal muscular atrophy). All newborns should be tested for the devastating condition, the paper writes.\"As Trump nabs oil ship\" the Daily Star speaks to farmers in Scotland - which it refers to as \"the UK's Greenland\". They tell \"golf nut Don\" that \"you can take our greens but not our land\". So there you go.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Splash & grab' and 'UK ready to seize more of Putin's ships'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a392/live/aa305f40-ec24-11f0-a422-4ba8a094a8fa.png"
      ],
      "datePublished": "2026-01-08T00:56:38.000Z",
      "dateModified": "2026-01-08T00:56:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Murderer and fellow inmate who absconded from HMP Leyhill caught",
    "url": "https://www.bbc.com/news/articles/ce9yg59y5r0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2026-01-07T15:50:36.000Z",
    "description": "A convicted murderer and another inmate who absconded from an open prison on New Year's Day have been arrested, police say.Matthew Armstrong, 35, who ",
    "body": "A convicted murderer and another inmate who absconded from an open prison on New Year's Day have been arrested, police say.Matthew Armstrong, 35, who was jailed for life for murder in 2009, and Daniel Washbourne, 40, who has previous convictions for violence, both failed to return to HMP Leyhill in South Gloucestershire.Armstrong was found near Henley-in-Arden railway station, Warwickshire, at 12:00 GMT, following a sighting from a member of the public. Washbourne was located in Bristol city centre at 13:30. Both were arrested on suspicion of escaping lawful custody.Armstrong was also arrested on suspicion of robbery, after an incident in a village near Leyhill the night before he absconded.A man had forced his way into a home on 31 December at about 18:45 GMT and threatened the occupants before stealing a mobile phone and a quantity of cash, Avon and Somerset Police said.Following the incident, officers interviewed the victims and neighbours, which led to Armstrong being arrested in relation to the offence.A third man accused of absconding from HMP Leyhill at the same time was arrested in Bristol on 3 January. He will next appear at Bristol Crown Court in February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murderer and fellow inmate who absconded from HMP Leyhill caught",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2026-01-07T15:50:36.000Z",
      "dateModified": "2026-01-07T15:50:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First person charged under new small boat Channel crossing law",
    "url": "https://www.bbc.com/news/articles/cy4gm1x23j3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b1c3/live/ec4a0fd0-9378-11ef-b001-c5ad4742e0c1.jpg",
    "tag": "Trending",
    "date": "2026-01-07T18:07:20.000Z",
    "description": "7 hours agoJacob PanonsSouth EastGetty ImagesThe new offence came into force under the Border Security, Asylum and Immigration ActA teenager believed ",
    "body": "7 hours agoJacob PanonsSouth EastGetty ImagesThe new offence came into force under the Border Security, Asylum and Immigration ActA teenager believed to be the first person to be charged with endangering others during a sea crossing to the UK without valid entry clearance said he was \"forced to do so\".Aman Naseri, 18, is accused of piloting a small boat with 46 people on board during the first Channel crossing of the year on 5 January, the day the new law came into force.At Margate Magistrates' Court on Wednesday he pleaded not guilty to the offence.Naseri, who is an Afghan national and followed proceedings through a Dari interpreter, has been remanded into custody to appear at Canterbury Crown Court on Friday.Julie Farbrace, prosecuting, said: \"We submit Mr Naseri has piloted a boat across the Channel. \"There were 46 other people on that boat and that by piloting the boat he put them in danger.\"The Crown Prosecution Service said Naseri was the first person to be charged with the offence, which is part of a range of measures introduced to limit Channel crossings on small boats.New offenceThe new offence came into force under the Border Security, Asylum and Immigration Act, which became law in December.According to the Home Office, the charge of endangering others during a sea crossing is to stop more people being crammed into unsafe boats and would apply to those involved in physical aggression and intimidation, as well as anyone who resists rescue.When the plans for the offence were first announced in January 2025, Home Office sources said there had been instances of \"floating crime scenes\" where people had acted in such a reckless way people died on board in crushes and drownings.The new charge could include physical or psychological injury, and covers journeys by water to the UK from France, Belgium and the Netherlands.Under the offence, those who endanger or risk another life at sea could face up to six years in prison.Boat supplier jailedIn a separate case a man who supplied thousands of small boats and engines to people smugglers has been jailed. Adem Savas, a Turkish national, was sentenced to 11 years in prison and received a fine of €400,000 (£346,000) on Wednesday, after admitting to offences of people smuggling and being a member of an organised crime group.The National Crime Agency (NCA) said it was thought he had made millions from the operation and described Savas as without a doubt the most significant supplier\" to gangs behind the dangerous crossings between 2019 and 2024.An NCA spokesperson said equipment supplied by Savas is thought to have been used in about half the Channel crossings in 2023. Savas was sentenced at a court in Bruges, Belgium, after a joint operation between the NCA and Belgian authorities, having been arrested at Amsterdam's Schiphol Airport in November 2024.Additional reporting from PA Media.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First person charged under new small boat Channel crossing law",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b1c3/live/ec4a0fd0-9378-11ef-b001-c5ad4742e0c1.jpg"
      ],
      "datePublished": "2026-01-07T18:07:20.000Z",
      "dateModified": "2026-01-07T18:07:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Harry not planning to meet King on next trip to the UK",
    "url": "https://www.bbc.com/news/articles/c5y5e7l5250o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/18cf/live/cab894c0-ebf3-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-07T16:43:28.000Z",
    "description": "8 hours agoSean CoughlanRoyal correspondentThe Duke of Sussex is not expected to meet his father King Charles on his next trip to the UK, when he come",
    "body": "8 hours agoSean CoughlanRoyal correspondentThe Duke of Sussex is not expected to meet his father King Charles on his next trip to the UK, when he comes to give evidence in a court case against the publisher of the Daily Mail.It is expected that the King will keep his distance during such a court case, which, unless it is settled beforehand, is due to start later in January.On his previous trip to the UK last September,  Prince Harry had a private meeting with his father in London that was seen as a symbolic step towards improving family relationships.It followed a BBC interview with Prince Harry in which he talked of the importance of \"reconciliation\" with his family.There still seems to be uncertainty about the court timetable, but later in January a civil case will be brought by Prince Harry and others claiming that Associated Newspapers' publications gathered information by unlawful means.Among the other plaintiffs are Sir Elton John, Liz Hurley and Baroness Doreen Lawrence, mother of the murder victim Stephen Lawrence.Associated Newspapers Ltd has strongly denied the \"preposterous allegations\".But the court case could see Prince Harry giving evidence and facing questions about his claims about how information was obtained for stories written about him.During a visit for a previous court case in 2023 against Mirror newspapers, Prince Harry did not meet his father.A separate claim against News Group Newspapers was dramatically settled in January 2025, with an out of court settlement reached just as the case was getting under way, with the newspaper group apologising and paying damages.Since then Prince Harry and King Charles had their first face-to-face meeting in 19 months, when they had tea together at Clarence House in London in September 2025, during a week of engagements for Harry in the UK.The meeting appeared to be a sign of warming relationships and followed Prince Harry saying in a BBC interview: \"I would love reconciliation with my family. There's no point continuing to fight any more, life is precious.\"But as the Telegraph first reported, it is not expected that there will be a meeting on this latest visit.There could be a smoother path to future visits though, with a review taking place of Prince Harry's police protection when he is in the UK.Harry has cited his security worries as a major barrier to visiting the UK, and why he is reluctant to bring his children, and an upgrading of his security could make that less of an issue.However no decision on his security has yet been confirmed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Harry not planning to meet King on next trip to the UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/18cf/live/cab894c0-ebf3-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-07T16:43:28.000Z",
      "dateModified": "2026-01-07T16:43:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin outage highlights German vulnerability to sabotage",
    "url": "https://www.bbc.com/news/articles/cvgrpzn6gz4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-07T17:17:34.000Z",
    "description": "8 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a f",
    "body": "8 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a five-day blackout in Germany's snow-covered capital, Berlin.The outage was caused by a suspected arson attack and came as temperatures dipped below freezing.It is reportedly the longest blackout in the capital's post-war history. A far-left militant group has claimed it was behind the outage.This week's images of residents - young and old - living through a prolonged blackout in the country's capital has reignited a debate about Germany's vulnerability to sabotage attacks, whether by domestic or foreign actors.Schools, hospitals and care homes are among the tens of thousands of properties that were affected in south-west Berlin.In Berlin's Steglitz-Zehlendorf district, on Mexikoplatz, a police van drove around announcing the imminent return of power over a tannoy.Residents regularly approached a group of emergency service workers for the latest information.Lena said her family had felt \"lost\" - relying on a battery-powered radio for updates.They have been cooking on a camping stove at home while trying to make sure their water pipes didn't freeze.Reinhold, 79, was still without power on Wednesday morning and going to his daughter's house to get warm.\"But I always came back to sleep here even in the cold weather with a bobble hat on and sweater and a woollen blanket.\"The retired architect said that he was used to hardship having been born in post-war Germany.\"I was born in 1947. When my mother and I came from the hospital... it was -20C in our shack.\"My parents took turns every hour to see whether my hands were tucked in under the cover so my fingers wouldn't freeze off.\"Reinhold has been sleeping in a woolly hat to keep warm at nightRestoring electricity was happening on a \"step-by-step basis\", said fire service spokesman Adrian Wentzel.Resources have been pulled in from across Germany, he told the BBC, with an estimated 100,000 people affected.Hospitals have had to rely on emergency generators while some schools have had to close.It was early on Saturday when several cables on a bridge were spotted burning near the Lichterfelde gas-fired power plant.Subsequently, the far-left Vulkangruppe - or Volcano Group - appeared to claim responsibility, saying its target was the fossil energy industry.\"We apologise to the less wealthy people in the south-west of Berlin,\" a lengthy statement read.\"With the many owners of villas in these districts, our sympathy is limited,\" it added, likely referring to the fact that Steglitz-Zehlendorf is one of Berlin's wealthiest neighbourhoods.However, a different statement was later published online on the Indymedia site - purportedly from Vulkangruppe's founders.\"We expressly distance ourselves from all actions of recent years,\" it said.AFP via Getty ImagesTraffic lights were cut off, tooAnother recent high-profile incident saw activists admit being behind a suspected arson attack that halted production at the huge Tesla factory just outside Berlin in 2024.The exact structure and workings of Vulkangruppe is unclear, but German authorities describe them as left-wing extremists and say attacks have happened at irregular intervals since 2011 in Berlin and the surrounding state of Brandenburg.Domestic intelligence state that the group's aim is to disrupt \"the day-to-day functions in order to harm the hated capitalist system\".Federal prosecutors are investigating the latest incident as a terrorism offence, with possible charges including \"membership in a terrorist organisation, sabotage, arson and disruption of public services\".This week's outage was larger and lasted longer than a similar incident in September.Plans for a federal law to protect critical infrastructure have been in the works for years but were only presented to the German parliament in November.The \"Kritis\" bill sets out plans to identify key critical infrastructure transport as well as introduce minimum protection standards.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin outage highlights German vulnerability to sabotage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-07T17:17:34.000Z",
      "dateModified": "2026-01-07T17:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenlanders express fear and indignation as Trump eyes territory",
    "url": "https://www.bbc.com/news/articles/cvgx8w4pgk0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3613/live/27934480-ec10-11f0-bb47-dd0326c45745.jpg",
    "tag": "Trending",
    "date": "2026-01-07T22:59:09.000Z",
    "description": "2 hours agoGabriela Pomeroy,Alicia CurryandAdrienne Murray,in CopenhagenMia ChemnitzMia Chemnitz says \"the people of Greenland do not want to become A",
    "body": "2 hours agoGabriela Pomeroy,Alicia CurryandAdrienne Murray,in CopenhagenMia ChemnitzMia Chemnitz says \"the people of Greenland do not want to become American\"\"The people of Greenland do not want to become American,\" Mia Chemnitz tells the BBC. \"We are not for sale.\"The 32-year-old business owner in the Greenlandic capital Nuuk reflects the sentiments of many who spoke to the BBC about how they felt about recent rhetoric from the Trump administration.The White House has said it was \"actively\" discussing an offer to buy the territory that has for centuries belonged to Denmark. US President Donald Trump and his officials had earlier intimated a willingness to take it by force if necessary.This has been met with nervousness and opprobrium among Greenlanders - both on the world's largest island and elsewhere.This nervousness has only grown since the US took Venezuela's President Nicolas Maduro from his residence in Caracas to New York on drug-trafficking and narco-terrorism charges in an unprecedented military move.Almost immediately after, the wife of a senior White House staffer indicated that Greenland was next.\"That's when it stopped feeling abstract,\" says Tupaarnaq Kopeck, 40, who moved to Canada - another place Trump has threatened to annex - for family and work.\"For the first time, I contacted my sister in Greenland and told her that if the unthinkable ever became reality, they would have a place to stay with us.\"Aaja Chemnitz, one of two MPs in the Danish parliament representing Greenland, says the comments from the Trump administration are \"a clear threat\" that she was \"appalled\" by.\"It's completely disrespectful from the US side to not rule out annexing our country and to annex another Nato ally,\" she says.Tupaarnaq KopeckTupaarnaq Kopeck says the military intervention in Venezuela made the abstract feel realGreenland is the world's most sparsely populated territory. With much of the Arctic island covered by ice, most of the population lives in Nuuk and the surrounding south-western coastline.But it is strategically significant to the US - which is why it has had a military presence there since World War 2. Greenland's location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks.More recently, there has also been increased interest in Greenland's natural resources, including rare earth minerals, which are becoming easier to access as its ice melts due to climate change.\"It's not fun being 56,000 people and having these threats - if you can call them that - from a giant like the US,\" says Masaana Egede, editor of Greenlandic newspaper Sermitsiaq.\"The citizens of Greenland are nervous about this, because this is not something that we take lightly.\"Experts generally agree that a military takeover of Greenland would be an easy undertaking for the US - but that the geopolitical fallout would effectively end the Nato alliance.After the issue of Greenland's ownership was raised anew by the White House, six European allies issued a statement saying its future should be decided by its people - something Mia says she is grateful for.But she worries this will matter little to the US \"if it's not backed with consequences and actions\".\"As a Greenlander, I can't help but wonder: what are we worth to these allies? To what lengths are they willing to go to protect us?\"Tupaarnaq says: \"Respect is about more than alliances on paper. When powerful nations talk about you instead of with you, that respect disappears very quickly.\"Aleqatsiaq PearyAleqatsiaq Peary, a 42-year-old Inuit hunter says a US takeover would just \"replace one occupier with another\"The Trump administration has stressed its intention was to buy Greenland from Denmark - despite Copenhagen reiterating the territory was not for sale - while retaining a military intervention as an option.Aaja sees annexation by force as unlikely - instead, \"what we are going to see is that they will put pressure on us in order to make sure that they will take over Greenland over time\".Polling consistently shows that Greenlanders generally favour eventual independence from Denmark but oppose being owned by the US. The territory is largely self-governing, with control of foreign affairs and defence retained by Copenhagen.This is perhaps why Aleqatsiaq Peary, a 42-year-old Inuit hunter living in the remote northerly town of Qaanaaq, seemed unfazed by the prospect of US ownership.\"It would be switching from one master to another, from one occupier to another,\" he says. \"We are a colony under Denmark. We are already losing a lot from being under the Danish government.\"But he says: \"I don't have time for Trump. Our people are in need,\" explaining hunters like him hunt with dogs on the sea ice and fish, \"but the sea ice is melting and hunters cannot make a living anymore\".For Sermitsiaq editor Masaana, the rhetoric from the US is pushing a fallacious binary choice.\"We really have to try to avoid getting the story going to a place where it's Greenland that has to decide between the US and Denmark, because that is not the choice that the Greenlandic people want.\"Christian KeldsenChristian Keldsen says \"people in Greenland are getting really irritated with this\"For others, who see the strong relationship Greenland already has with the US being soured, there is a clear sense of indignation.\"People in Greenland are getting really irritated with this,\" says Christian Keldsen of the Greenland Business Association.\"Greenlanders are welcoming and open-hearted, it's the best thing about the country. But now with this, some people are scared.\"Greenland is open for business with the US, Christian stresses, noting that there are new direct flights from Greenland to New York - a sure sign \"they don't need to take us over\".\"We are a well-functioning democracy and our government has a strong mandate,\" Mia says. \"We are a Nato ally and the US has had military bases in Greenland for over 70 years - and still has the right to establish and run new and more.\"As it has been stated from Greenland before: we are not for sale, but we're open for business.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenlanders express fear and indignation as Trump eyes territory",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3613/live/27934480-ec10-11f0-bb47-dd0326c45745.jpg"
      ],
      "datePublished": "2026-01-07T22:59:09.000Z",
      "dateModified": "2026-01-07T22:59:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump actively discussing potentially buying Greenland, White House says",
    "url": "https://www.bbc.com/news/articles/cly39pgmvrzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3eaa/live/60583660-ec09-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-07T19:39:42.000Z",
    "description": "US President Donald Trump and his officials are \"actively\" discussing a potential offer to buy the Danish territory of Greenland, the White House has ",
    "body": "US President Donald Trump and his officials are \"actively\" discussing a potential offer to buy the Danish territory of Greenland, the White House has confirmed.It is \"something that's currently being actively discussed by the president and his national security team\", White House spokeswoman Karoline Leavitt told reporters on Wednesday.Both Greenland and Denmark have repeatedly stressed the island was not for sale.Asked why the Trump administration had previously said it was not ruling out using military force to acquire Greenland, Leavitt replied that all options were always on the table but Trump's \"first option always has been diplomacy\".Concerns over the future of the territory resurfaced after Trump's unilateral use of military force against Venezuela on Saturday to seize its President Nicolás Maduro. Denmark, a fellow Nato ally, says an attack on its territory would end the military alliance. The Trump administration says Greenland is vital to US security. Despite being the most sparsely populated territory, its location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks, and for monitoring vessels in the region.Pituffik Space Base, formerly known as Thule Air Base, has been operated by the US since World War 2.In recent years, there has also been increased interest in Greenland's natural resources, including rare earth minerals, uranium and iron that are becoming easier to access as its ice melts due to climate change. Scientists think it could also have significant oil and gas reserves.US Secretary of State Marco Rubio said on Wednesday that he will hold talks with Denmark next week.Trump previously made an offer to buy the island in 2019, during his first presidential term, only to be told it was not for sale.\"The acquisition of Greenland by the United States is not a new idea,\" Leavitt said.\"The president has been very open and clear with all of you and with the world, that he views it in the best interest of the United States to deter Russian and Chinese aggression in the Arctic region, and so that's why his team is currently talking about what a potential purchase would look like.\"The White House said earlier this week that Trump had been discussing a range of options to acquire Greenland, including using military force.\"All options are always on the table for President Trump as he examines what's in the best interests of the United States,\" Leavitt said.Earlier in the day, French Foreign Minister Jean-Noël Barrot said Rubio had \"ruled out the possibility of an invasion\" of Greenland in a phone call with him.Barrot is due to discuss the Arctic island with his German and Polish counterparts later on Wednesday.On Tuesday, European leaders issued a joint statement rallying behind Denmark.\"Greenland belongs to its people, and only Denmark and Greenland can decide on matters concerning their relations,\" the leaders of France, the UK, Germany, Italy, Poland, Spain and Denmark said in a joint statement.Stressing they were as keen as the US on Arctic security, the European signatories said this must be achieved by Nato allies, including the US, \"collectively\".They also called for \"upholding the principles of the UN Charter, including sovereignty, territorial integrity and the inviolability of borders\".A day after the US military action in Venezuela, Katie Miller, the wife of one of Trump's senior aides, posted a map on social media of Greenland in the colours of the US flag, alongside the word \"SOON\".On Monday, her husband, Stephen Miller, said it was \"the formal position of the US government that Greenland should be part of the US\".Aaja Chemnitz, one of two MPs in the Danish parliament representing Greenland, told the BBC that the comments from the Trump administration were \"a clear threat\".\"It's completely disrespectful from the US side to not rule out annexing our country and to annex another Nato ally,\" she said.But Chemnitz said she saw this as unlikely - instead, \"what we are going to see is that they will put pressure on us in order to make sure that they will take over Greenland over time\".Aleqatsiaq Peary, a 42-year-old Inuit hunter living in Greenland's remote northerly town of Qaanaaq, appeared indifferent to the potential of US ownership.\"It would be switching from one master to another, from one occupier to another,\" he told the BBC. \"We are a colony under Denmark. We are already losing a lot from being under the Danish government.\"Saying that he did not have \"time for Trump\", he added that people were \"in need\". Hunters like him, he explained, hunted with dogs on the sea ice and fish \"but the sea ice is melting and hunters cannot make a living anymore\".Additional reporting by Adrienne Murray in Copenhagen",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump actively discussing potentially buying Greenland, White House says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3eaa/live/60583660-ec09-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-07T19:39:42.000Z",
      "dateModified": "2026-01-07T19:39:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former BBC presenter Huw Edwards to be played by Martin Clunes in new drama",
    "url": "https://www.bbc.com/news/articles/czejp9dpw7ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/93a9/live/76ad10d0-ebef-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-07T20:02:49.000Z",
    "description": "5 hours agoDanielle HerbertBBC Wales Doc Martin star Martin Clunes will portray former BBC presenter Huw Edwards in a new drama.The two-part factual s",
    "body": "5 hours agoDanielle HerbertBBC Wales Doc Martin star Martin Clunes will portray former BBC presenter Huw Edwards in a new drama.The two-part factual series, provisionally titled Power: The Downfall of Huw Edwards, will recount how one of the most recognisable figures in British television became the centre of a high-profile scandal which saw him receive a suspended jail sentence.Edwards, whose career started in Wales before he became one of the public broadcaster's highest-paid newsreaders, presented BBC's News at Ten for decades. In that time he delivered some of the biggest stories in British recent history including Queen Elizabeth II's death, before pleading guilty to making indecent images of children in July 2024.Clunes will portray the Bridgend-born newsreader in the series by television channel 5, which says it will recount how the scandal unfolded and feature interviews from those who first reported the story.Ben Frow, chief content officer at 5, said: \"This is an important and shocking story of how a man in a position of power and trust betrayed that status.\"By gaining exclusive access to the key individuals involved and those who investigated the story, we explore the human cost behind the headlines.\"Edward's career ended in disgrace after a report by the Sun in July 2023 alleged a \"top BBC Star\" had paid a teenager for sexual pictures.Days later, his wife named him as the presenter at the centre of the scandal and the newsreader resigned in April. In June 2024,  following a Met Police investigation, he was charged with three counts of making indecent images of children in relation to WhatsApp exchanges with a man called Alex Williams.Edwards pleaded guilty to the charges a month later,  and admitted to having 41 photographs on WhatsApp, including seven of the most serious type.He was given a six-month prison sentence, suspended for two years, and was placed on the sex offenders' register for seven years.The new series will be directed by Michael Samuels, known for British dramas The Windermere Children and Any Human Heart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former BBC presenter Huw Edwards to be played by Martin Clunes in new drama",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/93a9/live/76ad10d0-ebef-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-07T20:02:49.000Z",
      "dateModified": "2026-01-07T20:02:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mudeford beach hut owners look into legality of council tax rise",
    "url": "https://www.bbc.com/news/articles/cvgje1pkr2po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/38b4/live/6d5b9d20-ea4c-11f0-a4c4-1d0f54763880.jpg",
    "tag": "Trending",
    "date": "2026-01-07T16:56:49.000Z",
    "description": "8 hours agoAmy Woodward,Local Democracy Reporting ServiceandStephen Stafford,South of EnglandBeach hut owners say they are looking into the legal basi",
    "body": "8 hours agoAmy Woodward,Local Democracy Reporting ServiceandStephen Stafford,South of EnglandBeach hut owners say they are looking into the legal basis of plans to reclassify their huts as second homes for the purposes of council tax.More than 300 owners will have to pay full council tax from April on huts at Mudeford Spit in Dorset, if plans by Bournemouth, Christchurch and Poole (BCP) Council are agreed.Mudeford Sandbanks Beach Hut Association (MSBHA) said the second home rule was being applied to \"a wooden shed with no mains connections or individual toilet facilities\".BCP Council said it was \"looking at every nook and cranny\" as it attempted to tackle a £9m budget shortfall.The 344 huts on the sandbank near Christchurch can only be used overnight for part of the year but can sell for hundreds of thousands of pounds.The 2026/27 council tax is expected to be set in February but, based on the 2025/26 charge for band A properties, bills for the huts would increase from £618 to £1,236 a year.MSBHA chair Darren Pridwell said owners had already seen their annual fees \"almost treble to over £5,200\" as the council sought to harmonise charges along the coast.He said: \"Mudeford hut owners may have a degree of sympathy for these increased costs if the level of services were at an acceptable level, but there has been next to no investment in facilities in the recent past and these are now desperately needed. \"It feels like this is all take and no give.\"Beach hut owner Gemma Paterson said her family, who have owned their hut for three generations, already had to rent it out to afford the ground rent and existing council tax payments.\"Most people think all the beach hut owners are rolling in money, this is not the case, especially for myself and my family,\" she said. \"We don't have running water and we haven't seen any improvement in the facilities over 20 years. \"How can they justify increasing the council tax when we can only stay in them for 8 months of the year?\"The council hopes the change will raise about £211,000.BCP finance councillor Mike Cox said: \"It is a small amount, but we have to pull every lever we've got and this is just one of them.\"The proposal will be discussed by cabinet on 14 January.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mudeford beach hut owners look into legality of council tax rise",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/38b4/live/6d5b9d20-ea4c-11f0-a4c4-1d0f54763880.jpg"
      ],
      "datePublished": "2026-01-07T16:56:49.000Z",
      "dateModified": "2026-01-07T16:56:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police chief describes how Minneapolis shooting unfolded",
    "url": "https://www.bbc.com/news/videos/cx2ypz4zjvxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/67e5/live/db14f450-ec14-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-07T22:53:45.000Z",
    "description": "A woman in a car was shot and killed by a US immigration officer on a residential street in Minnesota. Chief Brian O'Hara, of the Minneapolis Police D",
    "body": "A woman in a car was shot and killed by a US immigration officer on a residential street in Minnesota. Chief Brian O'Hara, of the Minneapolis Police Department, described the scene in a press conference following the incident.2 hours agoMinnesotaMinneapolisUS Department of Homeland SecurityUnited StatesWatch: Moment 400-pound runaway prop injures Disney employeeThe incident took place during a live recreation of a scene from the film of Indiana Jones US & CanadaHousing, Europe ties, economy... what Canadians are hopeful for in 2026The BBC spoke to people in Toronto and Montreal to find out what they’re optimistic about heading into the new year.US & CanadaWatch: Bomb cyclone hits parts of the US with heavy snowThe powerful storm system brought blizzard conditions to areas of the Midwest and East Coast causing some travel delays.US & CanadaWatch: Mudslides, flooding and debris - storms batter southern CaliforniaGovernor Gavin Newsom has declared a state of emergency for parts of California, including Los Angeles, San Bernardino and San Diego.US & CanadaWatch: Moment robbers rip ATM from inside Texas storeThe White Settlement Police Department is searching for two suspects.US & CanadaWhere is Santa now? Trump answers kids' Christmas calls to Norad trackerNorad got some help from President Donald Trump as it marked its 70th year tracking Santa Claus on Christmas Eve.US & CanadaWatch: Kīlauea volcano sends lava fountains 1,400ft into the airFountains of fiery red lava erupted from Hawaii’s Kīlauea volcano late Tuesday, continuing for nearly six hours before ending abruptly early on Christmas Eve.US & CanadaHo Ho No! Santa pulled over for speeding in Ohio  Santa is speeding through his Christmas deliveries, but a sheriff had to stop him for \"flying a little too fast\".US & CanadaWatch: Rescuers find survivor in wreckage of Mexican Navy medical flightFootage captures the moment rescuers discover a survivor in the wreckage of a plane crash that killed at least 5 people, with one person still missing.US & CanadaAI app apologises over false crime alerts across USAn AI-powered app called CrimeRadar has apologised for the distress caused by false crime alerts issued to local US communities after a BBC Verify investigation.US & CanadaWatch: JD Vance and Nicki Minaj speak to conservative youth at AmericaFestThe rapper's comments led to an unexpected moment when she referred to Vice President Vance as an 'assassin' in front of Erika Kirk.US & CanadaWatch: Images, cassettes and high-profile figures from Epstein filesThe partial release of documents includes photos of the late sex offender's properties, audio files and redacted documents.US & CanadaWatch: DOJ re-releases 2005 video showing Epstein's Florida homeThe trove of new files related to the late sex offender includes previously released footage of police searching his Palm Beach mansion.US & CanadaWatch: President Trump's name added to facade of Kennedy CenterCrews work on the facade of the Kennedy Center after the board voted to add Trump's name to the performing arts venue.US & CanadaWatch: 'It's finally happening' - Trump supporters await Epstein files releaseAt a TurningPoint USA event, the president's supporters weigh in on the potential release of documents relating to convicted sex offender Jeffrey Epstein.  US & CanadaWatch: Famous men, a text and maps - What's in the latest batch of Epstein photos?A new batch of 68 photographs connected to the late sex offender was made public by Democratic US lawmakers on Thursday.US & CanadaWatch: Mother polar bear seen interacting with adopted cubResearchers have tracked how the mother, who also has a biological cub, has taken in a second young bear in a rarely documented case.US & CanadaWatch: Moment Nick Reiner is arrested after being seen in convenience storeFootage shows a man believed to be the 32-year-old wandering in a shop before his arrest in the deaths of his parents, Rob and Michele.US & CanadaWatch: Drone footage shows extent of flooding in Washington stateAt least one person has died after a second round of heavy rain hit the region, with levee failures prompting more evacuations.US & CanadaWatch: Fans react to death of Rob Reiner and wife MicheleThe director and his wife were found dead in their Brentwood home on Sunday night.US & Canada",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police chief describes how Minneapolis shooting unfolded",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/67e5/live/db14f450-ec14-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T22:53:45.000Z",
      "dateModified": "2026-01-07T22:53:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tracking the oil tankers seized by the US",
    "url": "https://www.bbc.com/news/videos/cx2gm7109rwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a35/live/faea0e00-ec05-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-07T21:53:24.000Z",
    "description": "BBC Verify has been tracking the Marinera for weeks. Merlyn Thomas has more.Produced by Alex Dackevych.Verification by Kayleen Devlin, Josh Cheetham, ",
    "body": "BBC Verify has been tracking the Marinera for weeks. Merlyn Thomas has more.Produced by Alex Dackevych.Verification by Kayleen Devlin, Josh Cheetham, Thomas Spencer and Paul Brown.Graphics by Mark Edwards.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracking the oil tankers seized by the US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2a35/live/faea0e00-ec05-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-07T21:53:24.000Z",
      "dateModified": "2026-01-07T21:53:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]