[
  {
    "title": "Champions League - why are Premier League sides dominating?",
    "url": "https://www.bbc.com/sport/football/articles/cy0520ey7jjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6cf1/live/348c75c0-fca1-11f0-9beb-e3402c5a09de.jpg",
    "tag": "Trending",
    "date": "2026-01-29T00:24:07.000Z",
    "description": "Why have English teams dominated as Real & PSG face play-offs?Image source, Getty ImagesImage caption, Tottenham finished fourth in the Champions Leag",
    "body": "Why have English teams dominated as Real & PSG face play-offs?Image source, Getty ImagesImage caption, Tottenham finished fourth in the Champions League but are 14th in the Premier LeagueBySam DruryBBC Sport journalist and Gary RoseBBC Sport journalistThe Premier League is flexing its muscles in Europe as five English teams finished in the top eight of the Champions League to reach the knockouts.That could become six in the last 16 if Newcastle win their two-legged play-off after they finished 12th in the league phase following a 1-1 draw at defending champions PSG on Wednesday.Arsenal finished in first place with Liverpool third, Tottenham fourth, Chelsea sixth and Manchester City finishing eighth.History could be made if Newcastle progress through the play-offs as never before have there been six Premier League teams in the Champions League knockouts.\"That is dominant,\" said Spurs boss Thomas Frank. \"I think we all said for a few years the Premier League is the best league in the world and I think this is another sign of it.\"So why have Premier League sides been so dominant against Europe's elite?Image source, AFP via Getty ImagesFinancial power and physicality?The most obvious starting point is the financial power of the Premier League, which significantly outweighs other leagues.Six Premier League sides sit inside the top 10 of the Deloitte Football Money League, while 50% of the top 30 come from the English top flight.TV rights have generated enormous broadcast revenues for Premier League sides, with the income from that source dwarfing those of other countries.Last summer, Premier League clubs outlaid more than ever before in the transfer window as spending surpassed £3bn.To highlight just how much financial power Premier League clubs have over elsewhere in Europe, the total spent in the summer window was more than was spent by Bundesliga, La Liga, Ligue 1 and Serie A clubs combined.More money means clubs can invest in bigger squads, with Arsenal seeing the benefits of spending big to increase their strength in depth as they finished first in the league phase of the Champions League and sit top of the Premier League.\"The biggest single reason that the English clubs have been dominant so far is the financial power of the Premier League,\" former Liverpool defender Stephen Warnock told BBC Sport.\"Also, it is about how competitive they have got by fighting it out and being in and around each other - they have pushed each other on.\"Newcastle forward Anthony Gordon also says a more open style of play in Europe has benefited English teams, while the Premier League is \"more physical than I've ever known it to be\".\"I think in the Champions League, teams are more open. They all try to play. It's less transitional,\" he added.\"It [the Premier League] is like a basketball game sometimes, it's so relentless physically. There's not much control, it's a running game and sometimes it's about duels, whoever wins the duels wins the game. Or moments.\"The Champions League is a bit more of an older style of game, more football based. Teams come and try and play proper football.\"In the Premier League, you see a lot more long throw-ins, set pieces - it's become a lot slower and more set piece based, I would say.\"Did Premier League teams have easier fixtures?It is undoubtedly an impressive achievement for five - and potentially six - Premier League teams to reach the knockouts.But was the fixture computer kinder for them than other teams?At the start of the season, football data statisticians Opta analysed, external every team's Champions League fixtures and ranked them all to work out who had the kindest draw.Arsenal's fixtures were ranked the third easiest, with Tottenham fourth, Liverpool seventh and Chelsea eighth.Manchester City were deemed to have the 14th easiest fixtures while Newcastle - who played defending champions Paris St-Germain - were 32nd in the rankings.Image gallerySkip image galleryImage source, OptaSlide 1 of 2, Easiest Champions League fixures, On target to be record breakers, but could fatigue hit?The last - and only - time five Premier League teams made it through to the knockouts was in 2017, when Chelsea, Liverpool, Manchester City, Manchester United and Tottenham all progressed.However just two of those sides - Liverpool and Manchester City - got beyond the last 16, while the Reds went all the way to the final after knocking City out in the quarter-finals.With five Premier League sides finishing in the top eight of this season's league phase, and therefore avoiding the prospect of facing one another in the last-16, there is the chance of a record number of English teams making the quarter-finals.Having numerous English clubs in latter stages of the Champions League is nothing new with four sides progressing to the quarters in both 2007-08 and 2008-09, as well as 2018-19 - leading to an all-English final in 07-08 and 2018-19.No other country have ever had four teams in the quarter-finals - this year England could have as many as six.But the demands of playing in the Premier League alongside the Champions League takes its toll, which is why many managers were relieved to avoid the two extra play-off games.\"I still think it will be very difficult for one of them to go on and win it, just because of how difficult the Premier League is every week - whether you are fighting for the title or for a place in the top four,\" Warnock added.\"Clearly the English clubs are in a good position going into the knockout stages, though. Some of the other big clubs that we thought would peak or start to show better form - like Paris St-Germain for example - have not really got going yet.\"How are other countries doing?Media caption, Benfica keeper scores stoppage time goal to seal win over Real MadridThe three other countries who had teams join English sides in progressing to the knockouts were Germany (Bayern Munich), Spain (Barcelona) and Portugal (Sporting CP).That has left some surprises having to go through via the play-offs, with Paris St-Germain failing to get the win they needed against Newcastle to secure a top-eight spot.Real Madrid, meanwhile, were on the wrong end of a thrilling and dramatic match with Benfica. Real were reduced to nine men while a last-second goal by goalkeeper Anatoliy Trubin secured a memorable 4-2 win for Jose Mourinho's side that earned them a play-off spot.Other big sides who are facing the lottery of the play-offs include Italian sides Juventus and Inter Milan, along with Germany's Borussia Dortmund and Spain's Atletico Madrid - who were stunned by Bodo/Glimt on Wednesday.The Norwegians have been the surprise package of the Champions League and their win against Atletico came just eight days after they beat Manchester City.Those results meant they are into the play-offs and have become the first Norwegian side to progress from the league or group phase in Champions League since Rosenborg in 1996-97.Champions League highlightsMedia caption, Spurs see off Frankfurt to secure automatic last-16 spotMedia caption, Joao Pedro scores superb double to give Chelsea top-eight finishMedia caption, Man City avoid play-offs with win against GalatasarayMedia caption, Salah scores Liverpool's third in victory over QarabagMedia caption, Newcastle come from behind to draw with holders PSGMedia caption, Arsenal maintain perfect record with narrow win over KairatWatch highlights of every Champions League game from 22:00 on Wednesday on BBC iPlayer and the BBC Sport website and app.There will also be a Champions League Match of the Day on BBC One on Wednesday, from 22:40 to 00:00.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Champions League - why are Premier League sides dominating?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6cf1/live/348c75c0-fca1-11f0-9beb-e3402c5a09de.jpg"
      ],
      "datePublished": "2026-01-29T00:24:07.000Z",
      "dateModified": "2026-01-29T00:24:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Kemi Badenoch Accuses Opponents of 'Psychodrama’ - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxpgwh?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-28T18:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·28 Jan 2026,·25 minsKemi Badenoch Accuses Opponents of 'Psychodrama’NewscastAvailable for over a yearToday, Kemi Badenoch, gave a speech addressing Conservative defectors and detractors. \nAdam chats to Alex, in Westminster about how Kemi Badenoch’s speech accused her opponents of ‘psychodrama’, called defectors ‘drama queens’ and presented her vision for the future of the Conservative party.\nAnd we catch up with Chris in Beijing about what he’s seen and heard so far on his trip with the Prime Minister.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Miranda Slade with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Kemi Badenoch Accuses Opponents of 'Psychodrama’ - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-28T18:03:00.000Z",
      "dateModified": "2026-01-28T18:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Can Trump really “de-escalate” Minneapolis tensions following ICE shootings? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxqlqr?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-28T21:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·28 Jan 2026,·1 minCan Trump really “de-escalate” Minneapolis tensions following ICE shootings?AmericastAvailable for over a yearWhat does Donald Trump actually mean when he says his administration plans to “de-escalate a little” in Minneapolis? On Tuesday Democratic Rep Ihan Omar was attacked at a local event in the city and protests are continuing following Saturday’s shooting of US citizen Alex Pretti by federal immigration agents. Video evidence contradicts claims by Trump administration officials immediately after Pretti’s killing that he was a “domestic terrorist”, planning a “massacre” and “brandishing” a weapon. \nIn this episode, Sarah, Anthony and Marianna discuss the president’s controversial response to the attack on Democrat Ihan Omar, and whether Trump can actually de-escalate tensions when thousands of ICE agents remain in Minnesota.\nHOSTS:\n- Sarah Smith, North America Editor\n- Anthony Zurcher, North America Correspondent\n- Marianna Spring, Social Media Investigations Senior Correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Purvee Pattni, Kris Jalowiecki and Grace Reeve. The technical producer was Dafydd Evans. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Can Trump really “de-escalate” Minneapolis tensions following ICE shootings? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-28T21:03:00.000Z",
      "dateModified": "2026-01-28T21:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shoplifter killed Asda security guard during struggle",
    "url": "https://www.bbc.com/news/articles/cd9e5jxdv7go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8246/live/ca95ea30-fd0d-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:34:52.000Z",
    "description": "Just nowPolice ScotlandNatasha Smith was told to expect a significant custodial sentenceA shoplifter has admitted killing a security guard during a st",
    "body": "Just nowPolice ScotlandNatasha Smith was told to expect a significant custodial sentenceA shoplifter has admitted killing a security guard during a struggle at an Asda superstore as she tried to flee the premises.Alun Harris-Richards fell to the ground and struck his head after trying to prevent Natasha Smith from leaving the Arbroath store with stolen alcohol in June 2024.Smith, 38, admitted causing the 61-year-old such physical and emotional distress during the incident that he suffered a fatal heart attack.Smith will be sentenced at the High Court in Edinburgh on 5 March.Smith also admitted assaulting another Asda employee during the same altercation.The court heard that following the death of Harris-Richards, pathologists carried out a post-mortem examination and found that he had a coronary artery condition.They said people with the condition were \"at risk of sudden death at any time\" and this was particularly true in times of illness or stress.Police ScotlandAlun Harris-Richards was pronounced dead at the scene of the incidentThe court heard that during the confrontation, which was recorded on Harris-Richards' body-worn camera, Smith shouted, swore and repeatedly attempted to pull a bag containing the alcohol from his grasp.In footage shown to the court, Smith shouted, swore and screamed: \"You're not allowed to touch me\" and \"get your hands off me\".Smith could be heard swearing at the victim and saying \"who do you think you are Hulk?\" as she continued to pull at the bag containing bottles of alcohol which she said she planned to sell to a pub.After Harris-Richards had fallen to the floor Smith continued to struggle with two female employees at the store and grabbed one of them, put her hands around her neck and told her: \"I will end you\".Wallace FerrierPolice were called to Asda in Arbroath following the incidentAdvocate depute Adrian Stalker said that shortly before the struggle, Smith was seen in the spirits aisle at the supermarket and a staff member became suspicious that she might be shoplifting.The prosecutor said: \"Other members of staff were alerted, including the deceased Alun Harris-Richards.\" Smith went to a self-service checkout area carrying a can of alcohol and bags, but then went towards the exit, triggering alarms.Harris-Richards and another staff member intercepted her and took hold of a reusable bag she was carrying containing two bottles, but Smith would not let it go.During the confrontation, Harris-Richards' breathing became laboured and he fell to the floor.Mr Stalker said: \"He was immediately unresponsive. \"The deceased received first aid, CPR and emergency medical treatment from staff, customers and paramedics where he had fallen, these efforts were to no avail.\"A judge told Smith, formerly of North Grimsby, Arbroath, that the only possible disposal for her offending was \"a significant custodial sentence\".Lord Haldane adjourned sentence on her for the preparation of a background report and told her she would continue to be remanded in prison.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shoplifter killed Asda security guard during struggle",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8246/live/ca95ea30-fd0d-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-29T12:34:52.000Z",
      "dateModified": "2026-01-29T12:34:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homicides at lowest level in nearly 50 years, ONS statistics show",
    "url": "https://www.bbc.com/news/articles/cgk86rr0vxyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/273c/live/f78ee2a0-fcfc-11f0-a871-2dc7e156bd40.jpg",
    "tag": "Trending",
    "date": "2026-01-29T11:58:48.000Z",
    "description": "38 minutes agoRobert Cuffe,Head of statisticsandSuzanne LeighMonty Rakusen/GettyHomicides have fallen to their lowest level for nearly 50 years across",
    "body": "38 minutes agoRobert Cuffe,Head of statisticsandSuzanne LeighMonty Rakusen/GettyHomicides have fallen to their lowest level for nearly 50 years across England and Wales, official statistics show.There were 499 victims of murder and manslaughter in the year to September, according to crime statistics published by the Office for National Statistics (ONS).It is the lowest number since 1977 and a 7% fall on the previous year, largely due to a drop in the number of people killed by knives - 174, down 23%.Crimes with weapons also continued a downward trend. Knife crime offences were down by 9% to 50,430 and firearms offences fell by 9% to just under 5,000, their lowest since 2003.The statistics are split into police recorded crime and a crime survey of people's experiences of crime.The broader trends in violent crime in the survey, which is of adults aged over 16, were more flat. The ONS estimates there were around 1.1m incidents of violent crime, ranging from threats and jostling to assault and murder, which was little changed on the previous year.The number of robbery offences remained broadly similar at 82,678 but shoplifting increased by 5%, from 492,660 offences the previous year to 519,381.Home Secretary Shabana Mahmood said the government was \"having real success\" tackling crime.But she added: \"The crimes that tear at the fabric of communities, like shop theft and shop robbery, continue to rise and we must do more.\"She said 13,000 more neighbourhood officers were being put on the beat and reforms set out earlier this week would mean \"local forces will be focused on policing their area and protecting their communities\".ONS spokesperson Billy Gazard said: \"The majority of police forces have seen knife crime fall in the past year, including the larger urban Greater Manchester, Metropolitan and West Midlands areas.\"This is supported by NHS data, which continue to show a decrease in hospital admissions for assault by a sharp object.\"The force said 97 homicides were recorded in 2025, the lowest figure since 2014, at a rate of 1.1 per 100,000 people, lower than New York (2.8), Berlin (3.2) and Milan (1.6).Met Police Commissioner Sir Mark Rowley said that while \"every murder is a tragedy\", fewer families had been \"shattered\" by violence.Statistics released by the Scottish government in October showed there were 45 victims of homicide in 2024-25, 12 fewer than the previous year and the lowest level for almost 50 years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homicides at lowest level in nearly 50 years, ONS statistics show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/273c/live/f78ee2a0-fcfc-11f0-a871-2dc7e156bd40.jpg"
      ],
      "datePublished": "2026-01-29T11:58:48.000Z",
      "dateModified": "2026-01-29T11:58:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Girl, 12, strangled and raped in Nuneaton, court hears",
    "url": "https://www.bbc.com/news/articles/cz9v0lg5kxno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c77/live/35dbf830-fcf9-11f0-a871-2dc7e156bd40.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:27:51.000Z",
    "description": "11 minutes agoVanessa Pearce,West MidlandsandJoan Cummins,at Warwick Crown CourtBBCAhmad Mulakhil and Mohammad Kabir deny committing offences against ",
    "body": "11 minutes agoVanessa Pearce,West MidlandsandJoan Cummins,at Warwick Crown CourtBBCAhmad Mulakhil and Mohammad Kabir deny committing offences against the youngster in Nuneaton A 12-year-old girl was targeted by two Afghan nationals before being raped by one of them in a secluded cul-de-sac, a court has heard. The prosecution told a trial at Warwick Crown Court that Mohammad Kabir tried to strangle the girl as he attempted to abduct her in Nuneaton in July, before Ahmad Mulakhil sexually assaulted her a few hours later.Barrister Daniel Oscroft said it was obvious to anyone that she was a very young and vulnerable child.Mulakhil, 23, has previously pleaded guilty to one charge of raping a child under the age of 13, but denies two further counts, as well as other charges. Kabir, 24 denies all charges, including attempted abduction. Opening the case for the prosecution, Oscroft told the jury Mulakhil had initially denied all allegations of rape and \"maintained what happened was consensual and initiated by her\".He said the two men appeared to be friends and targeted the 12-year-old in the early evening of 22 July 2025.\"Mohammad Kabir did so by trying to get her to come with him - which is the attempted abduction of a child - and also grabbing her by the neck, strangling her,\" he said.\"This is a legal definition, it doesn't necessarily mean he choked her.\"'Young and vulnerable'Kabir was with Mulakhil at the time, the court heard. \"The prosecution suggests that Mohammad Kabir, when he tried to take her away, can only have had some sexual purpose. What alternative could there have been?\" Oscroft told the jury.\"While she didn't go with Mr Kabir, the other person there, Ahmad Mulakhil, remained in the area for the next few hours, and later met her.\"He talked to her and led her away to a secluded cul-de-sac, Cheverel Place, where he raped her, sexually assaulted her and took indecent images of her.\"Mulakhil had \"repeatedly insisted\" the girl went with him voluntarily, adding he believed she looked like she was aged in her 20s. But it would have been \"obvious to anyone that she was a very young, vulnerable child,\" said Oscroft.Mulakhil, denies child abduction, two counts of rape, two counts of sexual assault and taking indecent photographs of a child.Kabir, also of no fixed address, denies intentional strangulation, committing an offence with intent to commit a sexual offence and attempted abduction.Additional reporting by PA MediaRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Girl, 12, strangled and raped in Nuneaton, court hears",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c77/live/35dbf830-fcf9-11f0-a871-2dc7e156bd40.jpg"
      ],
      "datePublished": "2026-01-29T12:27:51.000Z",
      "dateModified": "2026-01-29T12:27:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Hemsworth and Mark Ruffalo: We're like a couple of naughty school kids",
    "url": "https://www.bbc.com/news/articles/cn9z4xnv544o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3321/live/3cc342e0-fc9d-11f0-b934-81e74c6120db.jpg",
    "tag": "Trending",
    "date": "2026-01-29T02:19:27.000Z",
    "description": "10 hours agoYasmin RufoLeicester SquareGetty ImagesChris Hemsworth and Mark Ruffalo have been close friends for many yearsChris Hemsworth and Mark Ruf",
    "body": "10 hours agoYasmin RufoLeicester SquareGetty ImagesChris Hemsworth and Mark Ruffalo have been close friends for many yearsChris Hemsworth and Mark Ruffalo are no strangers to sharing the screen, having previously starred together in Marvel films such as Thor and Hulk.Now the pair have reunited for a very different type of film.They are starring alongside each other in Crime 101, a tense thriller that swaps superhero spectacle for a game of psychological cat and mouse.Speaking at the premiere, Hemsworth told the BBC that their long-standing friendship brought both energy and challenges to the set.\"The two of us get together and we're like a couple of naughty kids at school that need to be wrangled to be focused,\" he said. In the film, Hemsworth plays an elusive jewel thief planning one final heist, while Ruffalo stars as a determined detective intent on catching him.While the pair are well known for their comedic chemistry, Crime 101 marks a shift into darker territory.\"We have a familiarity in the comedic space,\" Hemsworth said. \"This is a dramatic film so it was quite an adjustment and discomfort at first.\"Getty ImagesMonica Barbaro (second left), Halle Berry (third left), and Barry Keoghan (second right) also star in Crime 101 Ruffalo said Crime 101 gave Hemsworth the opportunity to take on a very different type of role from those that audiences may be used to seeing.\"I got to see him do something I've been dying to see him do that I know he can do but hadn't had the director to help him,\" the 58-year-old actor said. \"When I saw him walk on set, I didn't recognise him, he was totally transformed and I thought this is what I want to see you do.\" The Poor Things actor revealed that the pair had been discussing working together outside the Marvel universe for years.\"We've been talking about doing a project for years,\" he said. \"I love him and we have a really close relationship. We always see each other and ask, 'What are we going to do together?'\"Ruffalo said it was Hemsworth who first approached him about the film.\"Chris reached out to me immediately. I read the script and thought, absolutely,\" he said.Getty ImagesBerry plays an insurance broker who gets entangled in the heistStarring alongside Hemsworth and Ruffalo is Halle Berry, who plays an insurance broker who gets entangled in the heist. The 59-year-old said her character showed that \"women of a certain age are not indispensable and resists that by standing up for herself\". That mentality is very similar to how Berry sees herself, telling the BBC she is focused on \"building a company to help women going through perimenopause\", which she was diagnosed with in her early 50s.The American actor says she is \"always\" being pigeonholed into a certain role due to her age but she \"resists at every turn\". Berry is set to play President Joanna Duncan, a gender-swapped version of the lead role from the The President is Missing, a political thriller novel by Bill Clinton. \"It's my fantasy to have a female American president and I would love to see a woman lead the country and I hope to get to see that in my lifetime but at least I get to play one.\" 'Grit and authenticity'Crime 101 features all the classic car chases and stunts you'd imagine from an old school crime thriller and Hemsworth said that was one of the most enjoyable parts of filming. \"The stunts were intense for all the right reasons - you have the adrenaline pumping and you're like a big kid, and that's what I love about doing those films.\" The Australian actor joked that his upbringing \"on farms where we were bashing about in old cars\" helped prepare him for the car chasing stunts. Avoiding stunt doubles and green screen added to the film's authenticity, according to Hemsworth. \"It is really us experiencing those emotions so there's an added layer of grit and authenticity,\" he said. Outside of acting, Hemsworth has been throwing himself into new challenges, from fitness experiments to learning new skills.His Limitless documentary sees him explore ways to live longer and healthier and as part of the show which aired last summer he learnt to play drums, eventually performing live with Ed Sheeran. National GeographicHemsworth joined Ed Sheeran on stage in Romania last year after learning to play the drums\"I had planned to continue the drumming,\" he said, \"but that period was so intense I get PTSD when I see a drum set.\"With three children, he said he knew he should return to it \"for my brain health\", but suggested his brief moment on stage might remain a one-off.\"Ed Sheeran is doing a tour in Australia and he said he'd come get me and three beers into that conversation I agreed. \"I thought about it again when I was sober and told him I'm not doing that again. I've done it once and checked that box.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Hemsworth and Mark Ruffalo: We're like a couple of naughty school kids",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3321/live/3cc342e0-fc9d-11f0-b934-81e74c6120db.jpg"
      ],
      "datePublished": "2026-01-29T02:19:27.000Z",
      "dateModified": "2026-01-29T02:19:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hampstead ponds trans access challenge dismissed by High Court",
    "url": "https://www.bbc.com/news/articles/c70lyrpekr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cd5a/live/592cbd90-a044-11f0-9251-31c97a45eb73.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:34:06.000Z",
    "description": "5 minutes agoGetty ImagesThe issue of who should be allowed to use which ponds was sent to public consultationA charity's legal challenge against rule",
    "body": "5 minutes agoGetty ImagesThe issue of who should be allowed to use which ponds was sent to public consultationA charity's legal challenge against rules allowing trans people to use the single-sex facilities at Hampstead Heath's swimming ponds cannot proceed at the High Court, a judge has ruled.Sex Matters took legal action against the City of London Corporation, which operates the men's, ladies' and mixed bathing ponds in north London.It said the policy of allowing trans people to use the facilities for the gender with which they identify amounted to sex discrimination.But Mrs Justice Lieven dismissed the challenge, saying the \"appropriate forum\" for the claim is the county court rather than the High Court.Getty ImagesThe pools date back to the 18th CenturyCampaign group Sex Matters filed for a judicial review, arguing the corporation's policy was unlawful based on the April 2025 Supreme Court ruling that a woman is defined by biological sex under the 2010 Equality Act.Tom Cross KC, for the charity, said at a hearing in December that the rules treat an individual woman \"less favourably\" than an individual man, as they are at \"greater risk of suffering the detriment of her privacy, dignity or safety being compromised\".He said the City of London Corporation should change its policy after the Supreme Court ruling.Getty ImagesThe pools get very busy in summerDaniel Stilitz KC, for the corporation, said the claim should have been dismissed for being out of time because the current policy has been in place since 2017.He described the legal action as \"unhelpful, premature and the wrong way for doing these things\".A consultation run by the City of London Corporation and published on Thursday found that nearly 90% of respondents backed trans-inclusive access to the ponds.More than 38,000 people took part in the consultation over a period of two months.Of those, 84% of respondents to the consultation had swum at the bathing ponds and 74% lived in London, the City of London said.Six options were considered for the Kenwood Ladies, Highgate Men's and Hampstead mixed ponds, with 86% of respondents supporting the existing trans-inclusive access arrangements.A similar proportion also opposed introducing strict single-sex access, while 90% rejected requiring trans swimmers to use separate changing rooms or have separate swimming sessions, and 66% opposed making all ponds mixed sex.More stories on Hampstead Heath's swimming ponds",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hampstead ponds trans access challenge dismissed by High Court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cd5a/live/592cbd90-a044-11f0-9251-31c97a45eb73.jpg"
      ],
      "datePublished": "2026-01-29T12:34:06.000Z",
      "dateModified": "2026-01-29T12:34:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'House of horrors' abuser had 26 convictions before he was foster carer",
    "url": "https://www.bbc.com/news/articles/cg5gpj9ev8eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0340/live/7b4466d0-fb93-11f0-923b-bb3c9dd82cc7.jpg",
    "tag": "Trending",
    "date": "2026-01-29T06:16:56.000Z",
    "description": "6 hours agoChris ClementsScotland social affairs correspondentSpindriftDouglas Daniel and his wife Barbara were found guilty of abuse earlier this wee",
    "body": "6 hours agoChris ClementsScotland social affairs correspondentSpindriftDouglas Daniel and his wife Barbara were found guilty of abuse earlier this weekA foster carer who was convicted of abusing children in a \"house of horrors\" was allowed to start looking after young people despite a lengthy criminal record, the BBC can reveal.Douglas Daniel had 26 convictions - including for housebreaking and car theft - when he and his wife Barbara began fostering children in 1986.One of the couple's victims also told the BBC that she reported the abuse to social workers 27 years ago.A Glasgow City Council spokesperson said it was investigating that complaint and what it knew about Daniel's criminal history, and that the process of approving foster carers had \"significantly improved\".Earlier this week Douglas and Barbara Daniel, who are now aged 80 and 75, were found guilty of cruel and unnatural treatment of six youngsters in their care between 1986 and 1991.Their victims included Lynn, whose name we have changed to protect her identity.She was seven years old when she was sent to live with the Daniels at their home in the Parkhead area of Glasgow in 1991.The mother, now 42, gave evidence during the trial and described her four-month ordeal living with the Daniels.\"They had a makeshift cell at the back of another room, where they basically barricaded you in,\" she told the BBC.\"Barbara also used to put me in the bird pen with the geese.\"They used to make me stand on one leg naked in the corner of the living room… They would be sitting eating their dinner as if it was normal.\"'Lynn' - not her real name - was the victim of cruel and unnatural treatment during her four-month stay with the Daniels in 1991.She continued: \"I think they are just twisted… There is no valid reason to say, 'You deserved it, you were misbehaving.'\"I don't know why they would do it. It's just wild.\"She added: \"I definitely think that, if that hadn't have happened, my life would be very different.\"Douglas and Barbara Daniel were found guilty of six charges after a trial at Glasgow Sheriff Court.The couple - who claimed to have fostered a total of 100 children - forced a four-year-old girl into a chicken coop, ordered one to bathe in a bird bath and made another eat a cow tongue meant for a pet ferret.Sheriff Louise Arrol KC commended the bravery of the victims and likened the Daniels' home to a \"house of horrors\".Addressing Douglas Daniel, she added: \"Remarkably given your record of dishonesty, you were trusted with children.\"Your past has caught up with you.\"Foster care abusers avoid questions outside courtThe retired mechanic now lives in Kent, but in the 1980s and 1990s his now-demolished home in Glasgow doubled as his motor repair business.He lived there with his wife and children, alongside animals including chickens, ducks, geese, dogs and ferrets.Daniel was no stranger to the courts and had spent time in prison before he had become a foster carer.The BBC has uncovered a list of previous convictions for Daniel – who, according to court documents, also used the alias Douglas Duncan.He was convicted in Scottish courts of multiple crimes of dishonesty – including theft, housebreaking, handling stolen goods and car theft – between 1965 and 1978, as well as one count of burglary in Northampton in 1972.His final conviction before he became a foster carer was theft from a lockfast place in 1978 - eight years before he began fostering. After the couple stopped fostering and moved to England, he was jailed for four years for an offence under the Customs and Excise Management Act in 2003.Documents also state Maidstone Crown Court ordered the confiscation of £100,000 from the then-58-year-old.Lynn said: \"I think for a child - not just a child, a vulnerable child – to be put in the care of someone with a large number of charges, is a severe failure of social work at that point in time.\"A letter between social work staff revealed the council were aware of abuse allegations made by 'Lynn' in February 1999.Another document seen by the BBC revealed Glasgow City Council's social work department knew of allegations against the Daniels in 1999.A letter written by a senior social worker references complaints made by Lynn when she was 15 and still in the care of the council.It reads: \"As you may remember, this team believes [Lynn] suffered abuse while placed with the foster carers, the Daniels family in Parkhead.\"[Lynn] now wishes to make a formal complaint about this.\"It is not clear what action was taken by council staff.When asked what the outcome of her complaint had been, Lynn said: \"Nothing... Nothing at all.\"'Greater oversight'Glasgow City Council said it was looking into Lynn's 1999 complaint and investigating what it knew about Daniel's criminal history.A spokeswoman said: \"Whilst we offer our sincere sympathy to anyone who experienced abuse while in local authority care, we can provide assurance that practice standards and foster care approval arrangements have significantly improved with greater oversight and more rigorous assessments in place.\"We will consider the detail which surrounds this historic case noting the specific concerns which have been highlighted in considering our next steps.\"Additional reporting by Jax Sinclair and Eric Pomphrey.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'House of horrors' abuser had 26 convictions before he was foster carer",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0340/live/7b4466d0-fb93-11f0-923b-bb3c9dd82cc7.jpg"
      ],
      "datePublished": "2026-01-29T06:16:56.000Z",
      "dateModified": "2026-01-29T06:16:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ministers reject Waspi calls for compensation after rethink",
    "url": "https://www.bbc.com/news/articles/c1jeyn3yxn9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/262b/live/c9f90ef0-fd02-11f0-9200-e148478a5756.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:33:22.000Z",
    "description": "Just nowKevin PeacheyCost of living correspondentSUPPLIEDAngela Madden has been leading the Waspi campaign for yearsWomen affected by changes to the s",
    "body": "Just nowKevin PeacheyCost of living correspondentSUPPLIEDAngela Madden has been leading the Waspi campaign for yearsWomen affected by changes to the state pension age have reacted with fury after ministers again rejected their claim for compensation.The government reconsidered the case after a new document came to light, but has again concluded no compensation should be paid.Campaigners say 3.6 million women born in the 1950s were not properly informed of the rise in their state pension age, which brought it into line with men.The Women Against State Pension Inequality (Waspi) group said the latest decision demonstrated \"utter contempt\" for those affected.\"The government has kicked the can down the road for months, only to arrive at exactly the same conclusion it has always wanted to,\" said Angela Madden, who chairs the group.\"This is a disgraceful political choice by a small group of very powerful people who have decided the harm and injustice suffered by millions of ordinary women simply does not matter.\"The government said the vast majority of 1950s-born women already knew the state pension age was increasing, thanks to a wide range of public information, including through leaflets, education campaigns, in GP surgeries, on TV and radio, in cinemas, and online.Others, however, said they were unaware of the changes.In 2024, a parliamentary ombudsman recommended compensation of between £1,000 and £2,950 each for those affected.While the Parliamentary and Health Service Ombudsman (PHSO) could recommend compensation, it could not enforce it and the government rejected it.  Speaking in the House of Commons, Work and Pensions Secretary Pat McFadden said the government accepted that \"individual letters about changes to the state pension age could have been sent earlier\".He repeated the apology given by his predecessor Liz Kendall over when the letters were sent.But he said the government also agreed with the Ombudsman's previous finding that \"women did not suffer any direct financial loss from the delay\".The emergence of a 2007 survey, which had not been handed to Kendall, prompted a review of the government's decision, with McFadden promising to check no other documents had been overlooked.Now, the government has said a flat-rate compensation scheme for those affected would \"cost up to £10.3bn and would simply not be right or fair given it would be paid to the vast majority who were aware of the changes\".More individual compensation \"would not be practical to set up\", it said.McFadden said on Thursday that overall, the evidence suggests that most of those affected would not have read \"an unsolicited pensions letter, even if it had been sent earlier\".He also said that those who knew the least about pensions — \"the very women who most needed to engage with a letter\" — were the least likely to read it.Liberal Democrat work and pensions spokesperson Steve Darling said affected women will feel \"utterly betrayed\" by the decision.\"False hope was given to them in the autumn, and so that hope has been dashed,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ministers reject Waspi calls for compensation after rethink",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/262b/live/c9f90ef0-fd02-11f0-9200-e148478a5756.jpg"
      ],
      "datePublished": "2026-01-29T12:33:22.000Z",
      "dateModified": "2026-01-29T12:33:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Labour blocking my bid to be MP was hard to take, says Burnham",
    "url": "https://www.bbc.com/news/articles/c1klyz4rg80o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/614d/live/f71a24a0-fcf8-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:16:38.000Z",
    "description": "23 minutes agoRichard WheelerPolitical reporterPA MediaLabour's ruling National Executive Committee (NEC) blocked Burnham's candidacy over the weekend",
    "body": "23 minutes agoRichard WheelerPolitical reporterPA MediaLabour's ruling National Executive Committee (NEC) blocked Burnham's candidacy over the weekendAndy Burnham has said Labour's decision to block him from standing as the party's candidate in a forthcoming parliamentary by-election was \"hard\" to take.The Greater Manchester mayor told the BBC he put his name forward to stand in Gorton and Denton as he believed he was \"probably in a better position than anybody to fight back\" against Labour's opponents, including Reform UK. But Burnham said he accepted the decision made by Labour's ruling National Executive Committee (NEC) and ruled out standing as an independent candidate.The NEC cited the \"disproportionate\" cost to the party of a mayoral election to replace Burnham when it blocked his bid to stand as an MP.Burnham, who has been viewed as a potential leadership rival to Prime Minister Sir Keir Starmer, told BBC Radio Manchester: \"It's hard when something like that happens, it's really disappointing.\"He added: \"What I was offering the party, I think, was an alternative path to the one that the party is now on.\"What I was saying to them was that I think, without being arrogant about it, because of what I've contributed to building in Greater Manchester, I was in a strong position to fight back this different type of politics that is trying to come in and trying to win our council seats and come into Greater Manchester in a big way.\"I believed I was probably in a better position than anybody to fight back against that.\"Sir Keir was among eight NEC members who voted to bar Burnham from standing in the by-election, which will take place on 26 February.In the aftermath, one senior Labour MP told the BBC that Starmer was \"running scared\" of Burnham although a senior party figure also claimed \"no-one is convinced that Andy is coming in to be a team player\".Burnham and Starmer both later denied reports that the mayor had been told in advance he would not be accepted as a candidate.Explaining the decision on Sunday, Labour said: \"The NEC believes that causing an unnecessary election for the position of Greater Manchester mayor would have a substantial and disproportionate impact on party campaign resources before the local elections and elections to the Scottish Parliament and Welsh Senedd in May.\"It added while the party would be \"confident\" of retaining the mayoralty, the NEC \"could not put Labour's control of Greater Manchester at any risk\".Burnham said he had wanted to assure the prime minister he \"wasn't coming in to undermine him or the government, I was coming in to see if I could contribute\". Burnham added he had a \"good conversation\" with Sir Keir after he was blocked from standing.He went on to criticise briefings against him and other elected politicians, adding \"anybody paid by the public purse does not get licence to lie\".He said: \"In the aftermath of all of this, I'm not going to be sort of bitter and I'm going to be out there campaigning in the by-election but I am going to call that one thing out.\"I have been 30 years in the Labour Party, it is a hard decision for me to take as I agonised over it but I believed I was making it in the best interests of Greater Manchester.\"'Major disservice'Burnham said \"I accept the decision\" made by the NEC, adding: \"But the one thing I won't leave just there and not question is the kind of sense that some people can go out and impugn the character of elected politicians.\"Because it happens to the cabinet, it happens to ministers, so I'm speaking for all of those people down there as well as myself - this culture really does a major disservice to politics in this country.\"On suggestions that he should stand as an independent in the by-election, Burnham said: \"No, I wouldn't do that because I meant it when I said I am team player.\"The BBC has been told around 50 Labour MPs signed a letter to the NEC objecting to the decision to block Burnham, describing it as a \"real gift\" to Reform.Bloomberg via Getty ImagesAndy Burnham (left) with Sir Keir in 2024The 2024 mayoral election in Greater Manchester cost taxpayers about £4.7m to stage.Labour won Gorton and Denton in 2024 with a 13,000 majority but could face a challenge to retain the seat, which is being targeted by Reform and the Green Party.The seat in Greater Manchester is vacant after former Labour minister Andrew Gwynne stood down as an MP on health grounds.On Tuesday Reform announced it had selected GB News presenter and academic turned activist Matt Goodwin as their candidate.Other parties are yet to announce their candidates for the contest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Labour blocking my bid to be MP was hard to take, says Burnham",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/614d/live/f71a24a0-fcf8-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-29T12:16:38.000Z",
      "dateModified": "2026-01-29T12:16:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Volunteers wanted to to live on Skomer Island and count puffins",
    "url": "https://www.bbc.com/news/articles/cdexjz58e3zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/149c/live/1a07ebd0-fcf1-11f0-9c55-8bade468c676.jpg",
    "tag": "Trending",
    "date": "2026-01-29T11:47:49.000Z",
    "description": "Stay on this stunning island for free... if you're willing to count puffins50 minutes agoAngela FergusonBBC WalesPA MediaSuccessful applicants will ge",
    "body": "Stay on this stunning island for free... if you're willing to count puffins50 minutes agoAngela FergusonBBC WalesPA MediaSuccessful applicants will get to live alongside the island's wildlife including its \"iconic\" puffinsA beautiful, remote island off the coast of south-west Wales could be your new home - as long as you are happy to count puffins.Skomer Island is a 1.13 sq mile (2.92 sq km) seabird island off of Pembrokeshire, managed by the Wildlife Trust of South and West Wales (WTSWW).Successful applicants will get to spend several months on Skomer over spring, summer or autumn as part of conservation efforts.The island's visitor officer Rob Knott said its at-risk puffins were \"absolutely iconic birds\" and counting them was \"quite a job\".While the roles are unpaid, free accommodation and travel expenses to and from the island within the UK will be provided by WTSWW, plus a bursary ranging from £200 to £400.Knott said the counting operation involved splitting the island into sections and going around about two hours before sunset when a larger number of puffins were on land.\"We get our clickers out and we count all the ones on the land, then the sea and the ones in the air as well,\" he added.Puffins are listed as vulnerable to extinction on the global International Union for Conservation of Nature's Red List.The fact they are on the list \"is wrong for so many reasons, not least, because they used to be absolutely thriving, so we're doing what we can to try and improve those numbers\", Knott added.Rob Knott said counting the puffins on the island was \"quite a job\"Three long-term volunteer positions and a seabird monitoring volunteer role are currently being advertised on the island, which is a national nature reserve.The WTSWW carries out a seabird count on the island every year, monitoring how many birds return in the spring to breed.Last year, it reported that a record number of 43,626 puffins had been recorded on the island, despite global populations declining rapidly.The WTSWW linked the population growth \"to the abundance of food in the wider area, meaning there is plenty of fish for chicks\" and the absence of predators like rats and foxes on the island.Mike Alexander/The Wildlife Trusts/PA MediaPuffins are listed as vulnerable to extinction on the global International Union for Conservation of Nature's red listSkomer is also home to 350,000 breeding pairs of Manx shearwaters and thousands of guillemots and razorbills.The job advert said: \"In spring, the focus is on our breeding seabirds - so that'll mean puffin counts and assisting with boat counts of seabird species. \"In summer, the focus moves to chick productivity, whilst in autumn the focus of our work is on grey seal monitoring and some of our other species, including Skomer voles, reptiles, cetaceans and moths.\"The volunteers will work on the island for about three months at a time between the end of March through to the end of September, while the seabird monitoring officer will work from 23 May to 23 June.Volunteer duties could also include boat counts of seabird species and checking on chick productivity or grey seal monitoring, depending on the time of year.They will also help with the day-to-day running of the island and welcoming its 25,000 visitors a year, the WTSWW said.The Marine Conservation Society said the waters around Skomer and the Marloes peninsula constitute Wales' only marine conservation zone. More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Volunteers wanted to to live on Skomer Island and count puffins",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/149c/live/1a07ebd0-fcf1-11f0-9c55-8bade468c676.jpg"
      ],
      "datePublished": "2026-01-29T11:47:49.000Z",
      "dateModified": "2026-01-29T11:47:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Urgent appeal to save Margate's Scenic Railway from closing ",
    "url": "https://www.bbc.com/news/articles/c93129w924qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/801e/live/6d70c3f0-fcf1-11f0-9c55-8bade468c676.jpg",
    "tag": "Trending",
    "date": "2026-01-29T12:15:34.000Z",
    "description": "Urgent call to save Britain's oldest rollercoaster23 minutes agoSimon JonesandHsin-Yi Lo,South EastGetty ImagesThe deputy leader of Thanet District Co",
    "body": "Urgent call to save Britain's oldest rollercoaster23 minutes agoSimon JonesandHsin-Yi Lo,South EastGetty ImagesThe deputy leader of Thanet District Council has written to the Culture Secretary, Lisa Nandy, to intervene and save the Scenic Railway, Britain's oldest rollercoasterThe culture secretary is being urged to intervene and save Britain's oldest rollercoaster from closure. Dreamland Margate announced on Tuesday the Grade II* listed  wooden ride was no longer viable saying it wanted to \"reimagine the rollercoaster's purpose\" and was asking the public for ideas. Helen Whitehead, deputy leader of Thanet District Council (TDC), has written to Lisa Nandy insisting the ride is of \"international importance\" and of historical and cultural significance. The Department for Culture, Media and Sport has been approached for a response. Even though the Kent seaside attraction has been out of action since developing a structural fault in 2024, TDC says the rollercoaster is an \"intrinsic\" part of the Dreamland amusement park.  \"While the council was informed of the decision in advance, councillors have asked to see more details of the issues as this is a matter of such local importance,\" a council spokesperson said. PA MediaA previous restoration of the ride, completed in 2015, required 320 tonnes of timber A restoration of the Grade II* listed rollercoaster was completed in 2015 as part of an £18m investment in the park, which had spent a decade closed to the public. In 2008, while the park was closed, the Scenic Railway was severely damaged in an arson attack.Restoration work included replacing all the wooden parts of the rollercoaster. Getty ImagesThe Scenic Railway in Margate will \"take well-earned retirement\"As a listed structure any alterations or change of use would require both planning permission and listed building consent, including consultation from Historic England.Whitehead said, to her understanding, there was no requirement for listed structures \"to be in operation\", but just \"simply maintained\". \"I would argue both operation and maintenance are equally significant for structures such as the Scenic Railway,\" she said, adding the operation of a listed structure was \"integral\" to its heritage function and relevance. Whitehead said: \"We are being advised by Dreamland the health and safety executive has specified the track needs to be inspected daily to remain in use.\"\"If Dreamland isn't proposing any change of use or to the structure, the council has no role,\" TDC said. Mirrorpix via Getty ImagesThe Scenic Railway, pictured in 1966, has long been a major attraction at Dreamland in MargateMargate residents have shared their thoughts on the closure of the historic rollercoaster.Jane Bishop, owner of the Walpole Bay Hotel in the town, said it was \"sad\" that Margate's \"important artefact\" could no longer be enjoyed by visitors. \"At Walpole we spend our lives preserving the past for the education and enjoyment for the next generations and reminiscence for those of us who lived it,\" she added.Dreamland has been approached for comment.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Urgent appeal to save Margate's Scenic Railway from closing ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/801e/live/6d70c3f0-fcf1-11f0-9c55-8bade468c676.jpg"
      ],
      "datePublished": "2026-01-29T12:15:34.000Z",
      "dateModified": "2026-01-29T12:15:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First arrest after high-value Bristol Museum raid",
    "url": "https://www.bbc.com/news/articles/cvgx74y0e2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f287/live/f3d78510-d69e-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2026-01-29T11:39:16.000Z",
    "description": "58 minutes agoChloe HarcombeWest of EnglandBristol MuseumA carved ivory Buddha and a belt buckle from the East India Company uniform were among the it",
    "body": "58 minutes agoChloe HarcombeWest of EnglandBristol MuseumA carved ivory Buddha and a belt buckle from the East India Company uniform were among the items takenA 41-year-old man has been arrested on suspicion of handling stolen goods after more than 600 artefacts were taken from Bristol Museum's archive.On Thursday, detectives announced they have made their first arrest in relation to incident, which saw military memorabilia, jewellery, natural history pieces and carved ivory, bronze and silver figurines taken.The force is still hunting for four other suspects and has released CCTV images of the men.Avon and Somerset PolicePolice have released an image of four men they want to speak to after more than 600 artefacts were stolenAll of the men are thought to be white. The first was described as of medium to stocky build and was wearing a white cap, black jacket, light-coloured trousers and black trainers.The second was described as being of slim build and was wearing a grey, hooded jacket, black trousers and black trainers.The third man was wearing a green cap, black jacket, light-coloured shorts and white trainers. Police said he appeared to walk with a slight limp in his right leg.The fourth was described as being of large build and was wearing a two-toned orange and navy or black puffy jacket, black trousers and black and white trainers.Police confirmed the arrested man has been released under investigation.Avon and Somerset PoliceThe items were taken from a building in the Cumberland BasinThe gang is believed to have entered the property between 01:00 and 02:00 BST.The stolen items were from the collection of the former British Empire & Commonwealth Museum, which was donated to the Bristol Museum after its liquidation in 2013.Police said the stolen artefacts had \"significant cultural value\".Following the incident, Bristol City Council released images of an elephant carved in ivory, an ivory statue of the Buddha, a ship lantern and an Emancipation token.A police spokeswoman said: \"We continue to appeal for the public's help to identify the four men pictured and have released two short video clips of the people we wish to speak to.\"Anybody with information is asked to contact the force.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First arrest after high-value Bristol Museum raid",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f287/live/f3d78510-d69e-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2026-01-29T11:39:16.000Z",
      "dateModified": "2026-01-29T11:39:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]