[
  {
    "title": "How a 'fertility gap' is fuelling the rise of one-child families ",
    "url": "https://www.bbc.com/news/articles/cwyv7211jljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/189d/live/f6435930-d0f1-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T14:39:45.000Z",
    "description": "6 hours agoHazel ShearingEducation correspondentBBCListen to Hazel reading this storyNatalie Johnston was scrolling on Facebook a couple of years ago,",
    "body": "6 hours agoHazel ShearingEducation correspondentBBCListen to Hazel reading this storyNatalie Johnston was scrolling on Facebook a couple of years ago, when she came across a group called, \"One And Done On The Fence\". Seeing it, she felt a sense of relief.\"It was nice to hear someone giving it a name,\" she says.She and her husband have a five-year-old daughter called Joanie but they knew they probably wouldn't have a second child - not because they couldn't, but not out of choice, either: Natalie finds it hard to imagine having the time and money for one.\"You know you'd love that baby, everyone tells you, but there's a little teeny niggle where you think, 'what if I put my first in that position where she can't do the activity she wants to do because I've got to spread money out between two'?\"She adds: \"Is it okay to say you're only having one because they don't fit into modern ways of parenting?\"Getty ImagesPeople aren't 'turning their backs on parenthood', says the UN - some people simply can't afford it. One expert explains that there is a fertility gap - or 'for every three kids wanted… only two are born'Modern parenting, for Natalie, 35, looks like family holidays with Joanie. It looks like weekday evenings hearing about her day at school and helping her with homework. But, with demanding jobs and no family living nearby to help with childcare, it also looks like an expensive childcare jigsaw.But ultimately, deciding whether or not to have a second is a tough decision. \"I think you worry you'd regret it,\" she says.The fertility rate was 1.41 children per woman in England and Wales last year, according to the Office for National Statistics (ONS) - the lowest on record for a third year running. Separately, the proportion of families with one dependent child has grown since the turn of the century - that includes families with one child, as well as those who also have children over 18 or may have left home.They made up 44% of all families in England and Wales with dependent children living with them, up from 42% in 2000. (Though the peak was 47% in the early 2010s, which then dipped before picking up again after Covid.)The UK's falling birth rate is part of what the United Nations calls a \"global fertility slump\", which it puts down, in part, to money worries.People aren't \"turning their backs on parenthood\", says the UN in a summary of its Population Fund's State of World Population report, which surveyed people across 14 countries. Instead it says they \"are being denied the freedom to start families due to skyrocketing living costs, persistent gender inequality and deepening uncertainty about the future\".Bridging the 'fertility gap'Education Secretary Bridget Phillipson said earlier this year that she wants \"more young people to have children, if they so choose\". She pointed to the expansion of funded childcare hours in England as a way the government was trying to recover \"dashed dreams\".Annual nursery costs for a child under two in England did fall this year for the first time in 15 years, according to the children's charity Coram. They are now an average of £12,425, down 22% on the previous year. However they are slightly up in Scotland and Wales, at £12,468 and £15,038 respectively.A study from University College London (UCL) last year suggested two-fifths of 32-year-olds in England want children – or more children, if they are already parents – but only one in four of them are actively trying to conceive.Dr Paula Sheppard, an anthropologist at the University of Oxford, believes parents in the West still think of having two children as \"the norm\".However, she says there is a \"fertility gap\" and that \"for every three kids wanted… only two are born\".\"A lot of this gap is driven by… people starting families later and later in life,\" she explains – often a result of education and career opportunities for women and changing gender roles.\"It becomes a whole lot more difficult to get pregnant [and] it becomes a whole lot more difficult to keep the pregnancy.\"Fewer pupils, less cash for schoolsThe falling birthrate is giving education policymakers a headache.The number of pupils in England has dropped by 150,000 since 2019, and will fall by a further 400,000 by the end of the decade, according to the Education Policy Institute.Schools are given money per pupil, so fewer pupils means less cash. Less cash, in turn, is an issue for those head teachers struggling to fund staffing and resources.Getty ImagesBridget Phillipson said she wanted 'more young people to have children, if they choose to'About a year ago, a post on a UK Reddit thread for teachers raised what one contributor saw as another potential impact of more only children on the education system.The contributor wrote that they had seen a rise in \"spoilt\" children with \"demanding behaviour due to overindulgent parenting\". These children tended to have siblings who were much older or no siblings at all, they claimed.The idea that children without siblings may be selfish or spoiled dates back to research conducted in the late 19th century by psychologists G Stanley Hall and E W Bohannon.\"Selfishness is one of the most striking traits of the only children in families,\" they wrote in their Study of Peculiar and Exceptional Children. \"'The only child' is deficient on the social side.\"Getty ImagesSchools are given money per pupil, so fewer pupils means less cash. Less cash, in turn, can be an issue for head teachers struggling to fund staffing and resourcesBut more recent studies have debunked that idea. \"Numerous studies have disproven these myths that only children are maladjusted, spoiled, and lonely,\" explains Dr Adriean Mancillas, a psychologist and professor in California State University's education department.Only children and academic performanceDr Mancillas has spent her career exploring family dynamics, the development of only children, and mental health intervention in schools - and says most research \"consistently demonstrates advantages of being an only child, particularly in educational and academic outcomes\".This is down, mainly, to a theory called \"resource dilution\". In simple terms, she says this means parents with one child \"are able to be more involved in their child's education\".\"Children with siblings share in parents' time, emotional support, attention, and financial resources whereas the only child does not,\" says Dr Mancillas. \"This singular focus of resources tends to provide academic advantages for the only child.\"She points to some research that suggests many only children did better academically when schools closed to most pupils in lockdowns during the Covid-19 pandemic, \"because of the relative availability of parental resources\".Getty Images'Children with siblings share in parents' time, emotional support, attention, and financial resources whereas the only child does not,' argues Dr Mancillas\"Resource dilution\" is one of three social science theories about the consequences of being an only child, according to University College London (UCL) academics.The second is \"confluence theory\", which also suggests that only children perform better than children with siblings academically because a family's \"intellectual environment\" declines as the number of children grows.Then there is \"socialisation theory\" which, in contrast, argues that siblings help children learn how to share, negotiate and resolve conflict.More from InDepthExisting research, according to the UCL academics, support the first two theories. But, like Dr Mancillas, they say it \"generally does not support the socialisation theory as it finds that only children are comparable to children with siblings (especially those with few siblings) in terms of personality, parent-child relationships, achievement, motivation and personal adjustment\".Dr Mancillas suggests there could be something else feeding into only children's better academic performance, too.\"Studies show that parents with one child tend to have attained higher educational outcomes themselves than parents of multiple children,\" she says.\"Much of the time, parents have delayed having children in order to complete career or higher educational goals. This would suggest that parents who have one child likely place a high value on education overall.\"'Little emperors' and 'one-child dynasties'Earlier this year, Susan Newman, an American psychologist explored so-called only-child dynasties - where parents who are only-children, have one child themselves - in an article to accompany her new book, Just One: The New Science, Secrets & Joy of Parenting an Only Child.One of the most surprising findings from the new research for her book was, she wrote: \"Adult only-children are increasingly choosing to have \"just one\" child themselves.\"The resulting only-child dynasties underscore the trend. Count on seeing more of them, most noticeably without the spoiled, entitled 'little emperors' we heard so much about for so long -despite a lack of evidence to support such misinformed stereotypes.\"The phrase has been used as shorthand to describe the only children born under China's one-child policy, the idea held by some being that it led to a generation of \"solitary children pampered and paraded with a retinue of parents and elders\".Getty ImagesNanny training in China, where there was previously a one-child policyHowever, while the policy did leave a lasting legacy after its end in 2015 - an ageing population, for example, and a gender imbalance because of a traditional preference for male children - research has suggested that the \"little emperor effect\" has not been a part of it. There were \"very few only-child effects\" on children's personality, according to a study of Chinese schoolchildren carried out by American researchers at two Texas Universities.'People feel very alone in this'The phrase \"one and done\" was only just beginning to emerge when New York-based journalist Lauren Sandler began writing her 2013 book, One and Only: The Freedom of Having an Only Child, and the Joy of Being One.\"I would be on the subway with my adorable child and someone would say, 'so cute, when are you having another one?'\"There is so little discussion about what it means to have single children, which is incredible to me considering how many there are.\"She adds: \"I think that people feel very alone in this.\"She began to question why some people assumed she would want more children, something she also explored for her work. It used to be that having larger families was how we survived, she points out. \"A family was a workforce, and that was very much a necessity until the industrial revolution.\"Only after the industrial revolution, and the introduction of child labour and welfare laws did that change. \"The opportunity costs and the economic costs of children shifted dramatically,\" she explains.Getty Images'I would be on the subway with my adorable child and someone would say, 'so cute, when are you having another one?' says Lauren Sandler. (Pictured: Gregory Peck filming The Million Pound Note)She also questioned the negative connotations that can sometimes be associated with having one child.\"There's also a lot of research that shows that only children do not take relationships for granted at a very, very young age. So, [it's not the same as when you] fight with your older brother and then just, through exposure, need to make up again. \"These people aren't going to be at the dinner table with you every night. Because of that, there's a lot of care that seems to come into relationships. And so that is sort of the opposite of the selfish stereotype of only children.\"Trump and the $5,000 'baby bonus'So teachers may not really have a generation of \"little emperors\" on their hands. But the impact of the falling birth rate is still very much being felt by some schools, and more widely too.Policymakers, for example, are grappling with the impact of the UK's ageing population on public services, taxes, and the growing cost of state pensions.\"Falling birth rates and an ageing population can create pressures on public services and public finances because the balance between the number of people working and the number of people drawing on age-related services changes over time,\" says Dr Alina Pelikh of University College London, who specialises in demography. \"Governments may need to consider adjustments - whether through pension age, contributions, or other measures - to ensure long-term sustainability.\"AFP via Getty ImagesThe Trump administration raised the idea of a $5,000 'baby bonus' to incentivise people to have more childrenThe concerns are global, and governments around the world are trying to encourage people to have more children.US President Donald Trump has mentioned the idea of a $5,000 \"baby bonus\". Poland has just introduced a policy of zero personal income tax for families with two or more children. And in Hungary, Prime Minister Viktor Orban has introduced tax exemptions for mothers.But for all the the statistics and policymaking this is, ultimately, a very personal decision.Natalie couldn't be prouder of her daughter, who has recently been made \"values ambassador\" in her class, encouraging other children to show empathy and respect. \"She has been chosen, not because she's an only child, because they don't know whether she's got siblings or not. She's been chosen based on her personality,\" says Natalie.\"I don't think I was ever worried about not giving her [a sibling], because you can never have a child for somebody else.\"You've got to have a child for yourself, haven't you?\"Lead image: Getty Images (stock picture of a child)BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How a 'fertility gap' is fuelling the rise of one-child families ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/189d/live/f6435930-d0f1-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T14:39:45.000Z",
      "dateModified": "2025-12-05T14:39:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Architect Frank Gehry dead at 96 ",
    "url": "https://www.bbc.com/news/articles/c5y2p22z9gno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T20:08:43.000Z",
    "description": "Legendary architect Frank Gehry dead aged 96 6 minutes agoSakshi VenkatramanUS reporterREUTERS/Mike Blake/File PhotoFrank Gehry, considered one of the",
    "body": "Legendary architect Frank Gehry dead aged 96 6 minutes agoSakshi VenkatramanUS reporterREUTERS/Mike Blake/File PhotoFrank Gehry, considered one of the most influential architects of the century, has died aged 96.Gehry is known for his avant garde, experimental style of architecture. His titanium-covered design of the Guggenheim Museum Bilbao in Spain catapulted him to fame in 1997. He sealed his daring reputation years before that when he redesigned his own home in Santa Monica, California, using materials like chain-link fencing, plywood and corrugated steel.\"Gehry is survived by two daughters from his first marriage, Leslie and Brina; his wife, Berta Isabel Aguilera, and their two sons, Alejandro and Samuel,\" his chief of staff Meaghan Lloyd told the BBC on Friday. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Architect Frank Gehry dead at 96 ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T20:08:43.000Z",
      "dateModified": "2025-12-05T20:08:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldzp8?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-03T19:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·44 minsIs Russia Really Ready For War With Europe?NewscastAvailable for over a yearToday, NATO ministers have been meeting to discuss the US’s 28-point plan for peace between Russia and Ukraine after Russia rejected the plan and said it was “ready” for war with Europe.\nAdam is joined by Europe editor, Katya Adler and the Economist’s defence editor, Shashank Joshi to discuss what President Putin’s statement means for a divided NATO.\nPlus Faisal Islam, BBC Economics Editor, joins the conversation to discuss the UK’s possible involvement in a new European defence fund and the government’s latest suggestions it could be looking to get closer to the EU again. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Kris Jalowiecki. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-03T19:13:00.000Z",
      "dateModified": "2025-12-03T19:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002mz6w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-12-04T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·04 Dec 2025,·61 mins,·Available for over a yearHow is online porn affecting sex and relationships? In this episode, musician and campaigner Jordan Stephens calls for a new approach to sex education and a modern redefinition of masculinity. \nFrom Paris Hilton to Bonnie Blue and AI generated porn he discusses how sexual content is evolving and the impact it is having on young people’s lives. \nJordan also explains how his childhood and the whirlwind fame he found with Rizzle Kicks led to heartbreak and addiction. \nAnd how that led him to become an advocate for boys and men. \n(00:02:30) Why Jordan became an advocate for boys and men? \n(00:08:30) Jordan’s childhood \n(00:12:17) Reflections on fame \n(00:13:36) How he learned about healthy relationships \n(00:15:30) Is there a crisis of masculinity? \n(00:20:25) The reality of pornography \n(00:28:50) How he would design the sex education curriculum? \n(00:31:26) AI and pornography \n(00:38:25) Thoughts on Bonnie Blue \n(00:42:30) Legalisation of sex work and drugs \n(00:45:25) What his partner, the popstar Jade Thirwall, has taught him about relationships \n(00:47:30) Politics and young people \n(00:54:50) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Ricardo McCarthy. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-12-04T06:00:00.000Z",
      "dateModified": "2025-12-04T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "December full cold moon: Stunning photos capture last supermoon of 2025",
    "url": "https://www.bbc.com/weather/articles/cn5lk2512gyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7e10/live/f496dd70-d1bc-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T09:37:59.000Z",
    "description": "The last supermoon of 2025 dazzled bright in the night sky on Thursday night.Appearing brighter and larger than a normal full Moon, the third supermoo",
    "body": "The last supermoon of 2025 dazzled bright in the night sky on Thursday night.Appearing brighter and larger than a normal full Moon, the third supermoon of the year was also spotted by some in the UK with an atmospheric phenomenon called a halo.This halo even has its own folklore - 'Ring around the Moon, rain real soon'.It was a perfect opportunity for sky gazers around the world, along with the BBC's Weather Watchers, to get capture some stunning images. Supermoon's occur because the Moon's orbit around Earth is not perfectly circular, but slightly elliptical - meaning it is sometimes closer to us than at other times.When the Moon is in \"perigee\" - or near its closest point to Earth - and that coincides with a full Moon, fully illuminated by the sun's light, we call it a supermoon.The Moon appears larger and brighter in the night sky.Clear skies will also mean a great view of the Moon but sometimes you might also see a ring around the Moon.Known as a 22 degree halo, this occurs when there is a layer of very high, ice cloud in the sky.Light from the Moon passes through the ice crystals where it bends and reflects creating the ring effect.The presence of a the ice cloud in the sky can be an indicator of an approaching weather system and hence why the folklore suggests 'rain real soon'.Early on Friday morning high ice cloud moved in across southern areas of England where the halo was spotted.So, rain real soon?Yes, rain will be spreading to most parts of the UK during Friday with a strengthening wind.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "December full cold moon: Stunning photos capture last supermoon of 2025",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7e10/live/f496dd70-d1bc-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T09:37:59.000Z",
      "dateModified": "2025-12-05T09:37:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer rejects EU customs union after Lammy comments",
    "url": "https://www.bbc.com/news/articles/cj38ryp8k81o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82c8/live/4ca69b00-d202-11f0-936b-f537e2f59ee5.jpg",
    "tag": "Trending",
    "date": "2025-12-05T18:05:29.000Z",
    "description": "2 hours agoPaul SeddonPolitical reporterEPA/ShutterstockSir Keir Starmer has repeated that he is not planning to rejoin the EU's customs union, after ",
    "body": "2 hours agoPaul SeddonPolitical reporterEPA/ShutterstockSir Keir Starmer has repeated that he is not planning to rejoin the EU's customs union, after the deputy prime minister said countries in such unions see a boost to their economies.Speaking on a podcast on Thursday, David Lammy said it was \"self-evident\" that Brexit had damaged the British economy.He added that rejoining the EU's customs union was \"not currently our policy\" - but highlighted that Turkey had seen growth as a result of its own union with the bloc.The prime minister - who has said economic growth is his government's top priority -  said he wanted to build closer trading ties with the EU but not break Labour's post-Brexit commitments.Labour's election manifesto ruled out taking the UK back into the EU's customs union, in which the remaining 27 member states charge the same taxes on goods imported from outside the bloc.The party also said it would not rejoin the EU's single market, where countries adopt common laws in some areas to make it easier to trade goods and services.Instead, the government is attempting to forge closer economic ties through a series of side-deals covering rules on food standards, visas for young people, carbon pricing and electricity trading.But the issue has reappeared on the political agenda in recent weeks, with the Liberal Democrats pushing the idea of a new customs union deal with the EU.Turkish modelSpeaking to The News Agents podcast, Lammy said: \"It's self-evident that leaving the European Union badly damaged our economy, took us out of an important marketplace and created serious friction.Asked whether he wanted to see the UK in a customs union with the EU, he replied: \"That's not currently our policy, that's not currently where we are.\"However, he highlighted that Turkey, which is in a customs union with the bloc, was \"seemingly benefiting and seeing growth in their economy\".Turkey's deal, which does not apply to agricultural goods, or services, reduces the the need to prove the origin of many goods it trades with the EU - a considerable source of trade friction for the UK since Brexit.The model has previously been suggested as a more realistic option for bolstering ties than rejoining the EU's customs union itself. However, the arrangement does significantly curtail Turkey's ability to pursue an independent trade policy - a key promise made by Brexiters.'Vote with us'Asked about Lammy's remarks on Friday, Sir Keir said: \"The position that we are taking has been clearly set out in the manifesto, and then we've been following it.\"He claimed that the UK's relationship with Europe had been \"totally reset\" since Labour entered office last year.Speaking earlier to reporters, a Downing Street spokesman appeared to play down Lammy's comments, reiterating that the government would seek to rebuild ties \"while sticking to our red lines\".He added that Labour wanted to bolster growth through \"open trading relationships\" - pointing to the government's trade and tariff reduction deals with India and the US, two agreements made possible by Brexit.The Liberal Democrats seized on Lammy's remarks, calling on him to \"vote with us\" next week, when the party is hoping to force a vote on the customs union issue.The party's Europe spokesperson Al Pinkerton added: \"The penny is dropping that a customs union is the best way to fix the economic problems plaguing Britain. It's time for Lammy to put his money where his mouth is\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer rejects EU customs union after Lammy comments",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82c8/live/4ca69b00-d202-11f0-936b-f537e2f59ee5.jpg"
      ],
      "datePublished": "2025-12-05T18:05:29.000Z",
      "dateModified": "2025-12-05T18:05:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein: US judge orders unsealing of grand jury records from abandoned case",
    "url": "https://www.bbc.com/news/articles/c4ge8p0n0zko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66e9/live/f42e0d10-d20a-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T19:44:24.000Z",
    "description": "A US judge has ordered the unsealing of grand jury transcripts from the 2005 and 2007 investigation into convicted paedophile Jeffrey Epstein. The Flo",
    "body": "A US judge has ordered the unsealing of grand jury transcripts from the 2005 and 2007 investigation into convicted paedophile Jeffrey Epstein. The Florida judge granted the justice department's request for the material following Congress' passage last month of a bill ordering the release of all files on the disgraced financier. The law \"applies to unclassified records, documents, communications, and investigative materials\" that relate to Epstein and his accomplice-girlfriend Ghislaine Maxwell, the court order said.A similar Department of Justice request was rejected in August because it violated a federal rule on grand jury materials, which the newly signed law overrides.US District Judge Rodney Smith granted the government's expedited motion to unseal the typically secret grand jury transcripts and modify a protective order that previously barred the release of the materials. In Friday's order, reviewed by the BBC, Judge Smith noted \"the later-enacted and specific language of the Act trumps prohibition on disclosure\".The justice department is also requesting the unsealing of documents in New York from Epstein's 2019 sex-trafficking case and Maxwell's 2021 sex-trafficking case.The documents relate to a case investigating whether Epstein abused underage girls. It ended without any federal charges being filed against the late financier. Epstein's struck a controversial non-prosecution agreement in 2008 and pleaded guilty to lesser state prostitution charges.Questions have swirled ever since about how Epstein was allowed to avoid federal sex-trafficking charges.US President Donald Trump signed the Epstein Files Transparency Act into law last month after previously rejecting calls to release the files, which have dogged him during his second term in office. The law compels the justice department, FBI and federal prosecutors by 19 December to disclose the tranche of materials amassed during investigations into Epstein, who died in jail in 2019 while awaiting trial.Maxwell, who is serving a 20-year sentence for sex trafficking, was moved from a Florida prison to a new minimum-security facility in Texas in August. On Wednesday, Maxwell's attorney filed a letter in Manhattan federal court asking to be released early. While the transparency law gives the justice department 30 days to release the files, it also allows it to withhold material related to an active criminal investigation, identify victims of Epstein's abuse or invade their privacy, or contain images of physical and child sex abuse, death, or injury.Material that could jeopardize an active federal investigation, is classified or that pertains to national defence or foreign policy is typically not made public, per justice department policy.Earlier this week, Democrats on the House Oversight Committee released images of Epstein's infamous island.The photos showed several bedrooms in the US Virgin Islands home, as well as a room with masks on a wall and a phone with names written on speed-dial buttons.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein: US judge orders unsealing of grand jury records from abandoned case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66e9/live/f42e0d10-d20a-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T19:44:24.000Z",
      "dateModified": "2025-12-05T19:44:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Cattrall marries fiancé she met at BBC Woman's Hour",
    "url": "https://www.bbc.com/news/articles/cdd5zelp7v6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2bcb/live/daa5bde0-d1e0-11f0-ba14-cf9dc7308cae.jpg",
    "tag": "Trending",
    "date": "2025-12-05T13:55:36.000Z",
    "description": "Kim Cattrall marries fiancé she met on BBC radio show6 hours agoHelen BushbyCulture reporter Getty ImagesSex and the City actress Kim Cattrall has mar",
    "body": "Kim Cattrall marries fiancé she met on BBC radio show6 hours agoHelen BushbyCulture reporter Getty ImagesSex and the City actress Kim Cattrall has married Russell Thomas, almost a decade after they met when she was a guest on a radio show at the BBC, where he worked.The actress shared an image of them kissing on Instagram, after People reported that they had tied the knot at London's Chelsea Old Town Hall.People said the ceremony was attended by 12 family members and close friends, reflecting their \"preference for intimacy and authenticity\".Liverpool-born Cattrall, who is most famous for playing Samantha Jones in the popular HBO comedy-drama, met Thomas in 2016 when she appeared on BBC Radio 4's Woman's Hour.She recently told the Times: \"We've been together almost 10 years now. And we've had a blast. We've just had so much fun.\"The newspaper said they met in April 2016 when she appeared on Woman's Hour to read diary entries written during a bout of \"crippling insomnia\", which had forced her to pull out of a play at London's Royal Court.She said Thomas has been \"erroneously reported\" as being a sound engineer.While she did not expand on his exact role, she said: \"He was an actor originally. He's had an incredibly interesting life and really done it on his terms. He's a bit of a rebel, which I love,\" she said.Getty ImagesKim Cattrall, Kristin Davis, Sarah Jessica Parker and Cynthia Nixon, pictured in 2000, starred in six series and two films of Sex and the City Sex and the City ran for six series from 1998 to 2004 and generated two spin-off films. It co-starred Sarah Jessica Parker, Cynthia Nixon and Kristin Davis.Cattrall won a Golden Globe for her role in 2003, and received three other nominations for the show, along with five primetime Emmy nominations. Parker, Nixon and Davis appeared in spin-off series And Just Like That from 2021, while Cattrall just made a brief appearance in the final episode of season two in 2023.She reportedly did not play a greater part in the spin-off because of a strained relationship with the show and her cast-mates.Her other acting work includes the BBC's Bafta-nominated series The Witness for the Prosecution in 2016, the 2022 revival of Queer as Folk, 1987 film Mannequin and the original Police Academy film in 1984. Her stage work includes Sweet Bird of Youth in 2013 at London's Old Vic and Private Lives on Broadway in 2011.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Cattrall marries fiancé she met at BBC Woman's Hour",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2bcb/live/daa5bde0-d1e0-11f0-ba14-cf9dc7308cae.jpg"
      ],
      "datePublished": "2025-12-05T13:55:36.000Z",
      "dateModified": "2025-12-05T13:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doctor charged with sexually assaulting West Midlands hospital patients",
    "url": "https://www.bbc.com/news/articles/cdd5z3qdjv4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b2e/live/36049cb0-d1f5-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T17:14:07.000Z",
    "description": "3 hours agoAndy GiddingsWest MidlandsA doctor has been charged with sexually assaulting 38 patients while working at major hospitals in the West Midla",
    "body": "3 hours agoAndy GiddingsWest MidlandsA doctor has been charged with sexually assaulting 38 patients while working at major hospitals in the West Midlands, the Crown Prosecution Service (CPS) has said.Nathaniel Spencer, 38, of Quinton, Birmingham, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration and nine counts of sexual assault of a child under 13.Mr Spencer also faces three counts of assault of a child under 13 by penetration, and one count of attempting to assault by penetration.The charges relate to alleged offences against 38 patients at the Royal Stoke University Hospital in Stoke-on-Trent, and Russells Hall Hospital in Dudley, between 2017 and 2021, the CPS said.The BBC has asked whether multiple children were involved, but the CPS and Staffordshire Police said they were not able to provide further details.Mr Spencer is due to appear at the North Staffordshire Justice Centre on 20 January 2026.The CPS said the decision to prosecute had followed a \"detailed and complex investigation by Staffordshire Police\".Mr Spencer has been suspended from medical practice in the UK pending the outcome of the investigation.He was a former resident doctor, previously known as junior doctor, who worked at the University Hospitals of North Midlands (UHNM) NHS Trust between August 2017 and August 2020.Mr Spencer later worked as a resident doctor on a placement at The Dudley Group NHS Foundation Trust from August 2020 to April 2021.Both trusts have set up dedicated helplines for those with concerns or questions about the care they had received.Dr Paul Hudson, the Dudley Group's operational medical director, said: \"We understand that many of our patients, staff, and people in the wider community will find this news very distressing.\"The trust said it had been working with the police throughout the investigations.UHNM said: \"As this is an ongoing criminal process, we cannot comment further at this time but we would like to reassure the public that the safety and well-being of our patients and their relatives are our highest priority.\"The General Medical Council said it had taken action to prevent Mr Spencer from practising while it investigated his fitness to practise.Its investigation would continue once criminal proceedings had concluded, it said and Mr Spencer remained suspended until that time.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doctor charged with sexually assaulting West Midlands hospital patients",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4b2e/live/36049cb0-d1f5-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T17:14:07.000Z",
      "dateModified": "2025-12-05T17:14:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reform UK revokes Staffordshire County Council leader's membership",
    "url": "https://www.bbc.com/news/articles/cn09z578p4lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a1cf/live/1fc9e130-d123-11f0-9d18-614b3678ebf8.png",
    "tag": "Trending",
    "date": "2025-12-05T18:41:45.000Z",
    "description": "The Reform UK leader of Staffordshire County Council has been removed from the party after being accused of making racist comments on social media.The",
    "body": "The Reform UK leader of Staffordshire County Council has been removed from the party after being accused of making racist comments on social media.The posts at the centre of complaints about Ian Cooper included one making reference to then foreign secretary David Lammy, which stated \"no foreign national or first generation migrant should be allowed to sit in Parliament\".\"Following an investigation into the failure to declare social media accounts during the candidate vetting process, councillor Ian Cooper has had his membership of Reform UK revoked\", said a party spokesperson.Cooper currently remains leader of the council, but is no longer leader of its Reform group.The national leader of Reform, Nigel Farage, said on Thursday the party's investigation into Cooper did \"not look good\" for the council leader.The BBC has repeatedly contacted Cooper for comment, and he has not responded.His dismissal comes after activist group Hope Not Hate claimed to have found racist posts on an account on X allegedly linked to the council leader.His alleged activity on Facebook also came under scrutiny after a group called Reform UK Exposed claimed he was a top fan of a page called The European Race, which promotes white supremacy.A top fan is someone who has high engagement with a Facebook page.The leader of Staffordshire's Conservative group, which ran the council until the May elections, said Cooper should now resign.Philip White said: \"It was inevitable that Ian Cooper would have to go, but Reform have done nothing to address the bigotry that appears to be embedded in their Staffordshire branch.\"Nigel Farage needs to instigate an urgent review of his entire Staffordshire operation. This is the third time since May this has happened with a Staffordshire Reform councillor and that pattern cannot be ignored.\"Earlier this week, when allegations about Cooper first surfaced, nine of Labour's Staffordshire MPs called for his resignation.They said in a statement prior to Friday's announcement: \"Ian Cooper has, by sharing this kind of material, exposed his far-right and racist opinions. \"Staffordshire deserves better than this outright bigotry.\"Cooper had been formally selected as leader of the authority in May, after Reform UK secured 49 seats on the council.Councillor Martin Murray has been appointed interim leader of the Reform group at Staffordshire County Council, until the group elects a new permanent leader.A spokesperson for Staffordshire County Council said proposals to nominate a new leader would need to be agreed at a meeting of full council, and it would work with the administration on the next steps.The next full council meeting is due on Thursday 11 December.\"Our job will be to continue serving the residents of Staffordshire and delivering services without disruption,\" the council spokesperson added.Cooper is not the first of Staffordshire's Reform councillors to face scrutiny over their social media activity.Last month the county council's cabinet member for highways Peter Mason apologised for his choice of words over posts he wrote about black women and the police.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reform UK revokes Staffordshire County Council leader's membership",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a1cf/live/1fc9e130-d123-11f0-9d18-614b3678ebf8.png"
      ],
      "datePublished": "2025-12-05T18:41:45.000Z",
      "dateModified": "2025-12-05T18:41:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man, 18, hit by car on motorway was Tasered before death",
    "url": "https://www.bbc.com/news/articles/cpvdjjy182go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/5293d6e0-ce88-11f0-863d-7b9c77ed56fe.jpg",
    "tag": "Trending",
    "date": "2025-12-05T12:21:23.000Z",
    "description": "8 hours agoSarah TurnnidgeBristolNational HighwaysLogan Smith, 18, died after being hit by a car on the M5 in North Somerset on SundayAn 18-year-old w",
    "body": "8 hours agoSarah TurnnidgeBristolNational HighwaysLogan Smith, 18, died after being hit by a car on the M5 in North Somerset on SundayAn 18-year-old who got out of an ambulance on a motorway was Tasered by police before he was hit by a car and died, the police watchdog has said.Logan Smith, from Weston-super-Mare, died on the M5 in North Somerset late on Sunday evening. The Independent Office for Police Conduct (IOPC) said he was being taken to hospital when concerned paramedics stopped the ambulance on the hard shoulder of the northbound carriageway of the M5. Police were called when Mr Smith walked onto the carriageway, and the officer was captured on bodycam footage discharging their Taser, causing him to fall to the ground where he was hit by a car. Mr Smith was given emergency first aid, but died at the scene. A post-mortem examination has since been carried out ahead of a future inquest.Investigators at the IOPC are now looking into the actions and decisions made by Avon and Somerset Police prior to Mr Smith's death. The watchdog's director Derrick Campbell said his thoughts were with Mr Smith's family and friends, as well as \"everyone affected by this shocking and tragic incident\".\"We want to reassure everyone that we will independently investigate all the circumstances surrounding this incident, including the use of a Taser,\" he added, explaining that initial accounts had been taken from the officer and ambulance staff involved.He said the IOPC met with Mr Smith's family on Tuesday to give their condolences and explain the investigation, including the matter of the Taser being discharged. In a statement given after the incident, Avon and Somerset Police Assistant Chief Constable Joanne Hall said: \"This incident has had a significant effect on our officers and ambulance crews who are understandably incredibly upset by what happened.\"As well as providing support to the man's family, we are also making sure that the appropriate welfare arrangements are in place for our staff and also for those members of the public who were either directly involved or who witnessed the incident.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man, 18, hit by car on motorway was Tasered before death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/5293d6e0-ce88-11f0-863d-7b9c77ed56fe.jpg"
      ],
      "datePublished": "2025-12-05T12:21:23.000Z",
      "dateModified": "2025-12-05T12:21:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jamie's Italian to reopen in the UK six years after its collapse",
    "url": "https://www.bbc.com/news/articles/cj9yvz4ewg8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c06/live/3e27ff80-d20a-11f0-936b-f537e2f59ee5.jpg",
    "tag": "Trending",
    "date": "2025-12-05T18:13:30.000Z",
    "description": "2 hours agoJosh MartinBusiness reporterJamie's Italian will return to the UK dining scene next year, six years after the chain went into administratio",
    "body": "2 hours agoJosh MartinBusiness reporterJamie's Italian will return to the UK dining scene next year, six years after the chain went into administration.Its founder, celebrity chef Jamie Oliver, will reopen the first new site in central London backed by the investors behind another Italian restaurant chain, Prezzo.They plan to expand the brand further, a return Oliver said was \"incredibly important\" for him personally.At its peak, there were more than 40 Jamie's Italian sites across the UK, but after rapid expansion and a changing market, the company ran into trouble.The restaurants closed across the UK in 2019 with the loss of more than 1,000 jobs, but more than 30 international restaurants survived.Oliver, who has overseen the menu for the new site in Leicester Square, said he recognised it would be a challenge restarting the brand.\"In theory it's not the easiest time to return but conversely, I think it's the perfect time.\"I believe the mid-market needs excitement, surprise and delight and that's exactly what I am planning on delivering,\" he said.The return of Jamie's Italian to the UK is part of a franchise agreement between Oliver and Brava Hospitality Group, which runs Prezzo. Unlike last time, Oliver is not investing his own cash in the venture.Listen: Toast: What went wrong at Jamie's ItalianAfter the chain's collapse he was left with debts of £80m. However his other business interests remained in healthy shape: there is estimated to be one Jamie Oliver cookery book for every two UK households and his TV series, which began with The Naked Chef in 1999, have been shown in 189 territories.The brand's resurrection comes at a time when UK hospitality bosses have complained of a tough trading environment and cost pressures such as increased staffing costs and changes to business rates.At the time of Jamie's Italian 2019 collapse, Oliver blamed \"the well-publicised struggles of the casual dining sector and decline of the UK High Street, along with soaring business rates,\" for the company's demise.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jamie's Italian to reopen in the UK six years after its collapse",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c06/live/3e27ff80-d20a-11f0-936b-f537e2f59ee5.jpg"
      ],
      "datePublished": "2025-12-05T18:13:30.000Z",
      "dateModified": "2025-12-05T18:13:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's going on with Edinburgh's scaffolding hotel?",
    "url": "https://www.bbc.com/news/articles/c17x52v812po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/618d/live/19cfa780-d130-11f0-a0cc-673bf7abfc30.jpg",
    "tag": "Trending",
    "date": "2025-12-05T06:04:53.000Z",
    "description": "14 hours agoJames DelaneyBBC ScotlandBBCScaffolding surrounding the hotel on George IV Bridge may not be fully removed until 2027On one of the busiest",
    "body": "14 hours agoJames DelaneyBBC ScotlandBBCScaffolding surrounding the hotel on George IV Bridge may not be fully removed until 2027On one of the busiest tourist streets in the heart of Scotland's historic capital sits a monolith of scaffolding.For five years Radisson's G&V Hotel, on the corner of Edinburgh's Royal Mile and George IV Bridge, has been a plastic-wrapped eyesore. Travellers cannot book rooms, pedestrians are squeezed through walkways, and businesses have abandoned the building.Remedial work started in 2020 and was only expected to last a few months, but now fed-up residents have been told the scaffolding could remain until 2027.Sir Robert McAlpine (SRM), the main contractor, says it will be \"towards the end\" of 2026 before the first sections of the frame can be dismantled.Edinburgh's council leader Jane Meagher has called it a \"blight\" on the area, while heritage campaigners say the work is \"extremely disruptive\".What is going on with this seemingly endless project?Radisson HotelsUnwrapped - how the hotel appears scaffold-free on the Radisson websiteThe 136-bedroom hotel was built on the site of the former Lothian Regional Council offices in 2009.Estimates from when it first opened under the Missoni Hotel banner, put the cost of construction at about £30m.Work on the building started shortly after the start of the Covid pandemic with the hotel itself closed to guests since 2022.Part of the road and a large section of pavement leading up to the corner of the Royal Mile have been left out of action by the development.Pedestrians going to and from the Lawnmarket and Victoria Terrace have been forced single-file into a narrow, covered walkway.Seafood restaurant Ondine quit the building and moved to St Andrews in Fife in 2024.In a statement, its operators said building work had forced them to alter the restaurant's appearance, adding that \"customers deserved better\".It is also home to restaurant chain Pizza Express – which has hung large banners on the scaffold to remind customers it is still open.GoogleGoogleThe G&V Hotel under construction in September 2008Work on the hotel began in 2020, not long after the start of the Covid pandemicAn update to the council's transport and environment committee in January this year suggested that the process of \"uncovering\" the façade would begin in February, with a full removal by the end of the year.But SRM has said that will not happen, citing \"extremely complex\" construction issues for the delay.\"We anticipate starting to dismantle sections of the scaffold towards the end of next year, with further improvements continuing thereafter,\" they said.\"We are working closely with all parties to ensure we deliver an improved site for the community.\"Rowan Brown, director of heritage body the Cockburn Association, said the work had added to the city's reputation of being \"slow\" for development.She said those involved in the project had a \"public duty\" to minimise disruption and should incorporate the work into the city's design.She said: \"It is making the pedestrian experience in that part of town really difficult.\"I don't understand why there is not some attempt to bring it into the streetscape or create something more artistic and avant-garde.\"Pedestrians have been forced to walk down a narrow covered walkway on part of the streetA project spokesperson said work on \"solutions to aesthetically improve the site\" was ongoing.They added: \"We understand the frustrations felt by local residents and businesses.\"This has been a lengthy and protracted process, reflecting the complexity and scale of the remedial work required, however we are focused on completing this essential work as soon as is practicable.\"Ms Meagher said the local authority would \"continue to put pressure\" on those involved to finish the project.She said: \"This scaffolding has been a blight for years, and I share the frustration of residents and local businesses over these continued delays.\"However, I also appreciate that the contractor has a responsibility to make the building safe and that this restoration has proved to be hugely complex.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's going on with Edinburgh's scaffolding hotel?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/618d/live/19cfa780-d130-11f0-a0cc-673bf7abfc30.jpg"
      ],
      "datePublished": "2025-12-05T06:04:53.000Z",
      "dateModified": "2025-12-05T06:04:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netflix to buy Warner Bros film and streaming businesses for $72bn",
    "url": "https://www.bbc.com/news/articles/ce91x2jm5pjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0c11/live/2cffe850-d1e5-11f0-aa5c-59732e940d9c.jpg",
    "tag": "Trending",
    "date": "2025-12-05T14:43:35.000Z",
    "description": "6 hours agoRachel ClunBusiness reporterBloomberg via Getty ImagesNetflix has agreed to buy the film and streaming businesses of Warner Bros Discovery ",
    "body": "6 hours agoRachel ClunBusiness reporterBloomberg via Getty ImagesNetflix has agreed to buy the film and streaming businesses of Warner Bros Discovery for $72bn (£54bn) in a major Hollywood deal.The streaming giant emerged as the successful bidder for Warner Bros ahead of rivals Comcast and Paramount Skydance after a drawn-out battle.Warner Bros owns franchises including Harry Potter and Game of Thrones, and the streaming service HBO Max.The takeover is set to create a new giant in the entertainment industry, but the deal will still have to be approved by competition authorities.Netflix co-chief executive Ted Sarandos said the streamer was \"highly confident\" it would receive the regulatory approval it needs and it was running \"full speed\" towards this. He said that by combining the library of Warner Bros shows and movies with the streaming platform's series such as Stranger Things, \"we can give audiences more of what they love and help define the next century of storytelling\".\"Warner Bros have defined the last century of entertainment, and together we can define the next one,\" he said.Asked whether HBO should remain a separate streaming service, co-chief executive Greg Peters said Netflix believed the HBO brand was important for consumers, but added: \"We think it's quite early to get into the specifics of how we're going to tailor this offering for consumers.\"Netflix estimates it will find $2bn to $3bn in savings, mostly through eliminating overlaps in the support and technology areas of the businesses.Films made by Warner Bros will continue to be launched in cinemas, it said, and Warner Bros television studio will continue to be able to produce for third parties. Netflix will keep producing content exclusively for its own platform.Murray Close/Getty ImagesWarner Bros owns the rights to the Harry Potter filmsLabelling it a \"big day\" for the companies, Mr Sarandos acknowledged the acquisition may have surprised some shareholders but it was a \"rare opportunity\" to set Netflix up for success \"for decades to come\".David Zaslav, president and chief executive of Warner Bros, added the agreement would combine \"two of the greatest storytelling companies in the world\".\"By coming together with Netflix, we will ensure people everywhere will continue to enjoy the world's most resonant stories for generations to come,\" he said.The cash and stock deal is worth $27.75 per Warner Bros share, with a total enterprise value - which includes the company's debts and the value of its shares - of about $82.7bn. The equity value, or cash price, is $72bn.The boards of directors from each company unanimously approved the deal.Michael O'Leary, chief executive of trade organisation Cinema United, said the merger posed \"an unprecedented threat\" to the global  cinema business.\"The negative impact of this acquisition will impact theatres from the biggest circuits to one-screen independents in small towns in the United States and around the world,\" he said.Netflix will complete the takeover after Warner Bros finalises its previously announced plans to separate its streaming and studios division from its global networks division into two companies next year.Its global networks division will become Discovery Global and will include its cable channels such as CNN and TNT Sports in the US, as well as its Discovery and free-to-air channels in Europe. However, TNT Sports International will stay with the streaming and studios division being sold to Netflix.Hollywood shake-upPaolo Pescatore, founder and technology media and telecom analyst at PP Foresight, said the sale was \"a huge statement of intent and underlines Netflix aspirations to be a global leader in the new world order of streaming\".But he warned that while the \"surprising move\" made sense for Warner Bros, it could \"provide a headache for Netflix\" when trying to combine the companies given the size of the deal.While the agreed deal is for part of the Warner Bros business, rival Paramount had tabled a bid to buy the whole company, including its cable networks, in October. Warner Bros rejected this move before putting itself up for sale.Ahead of the announcement of the deal, Tom Harrington, head of television at Enders Analysis, said it was hard to gauge whether the takeover would be approved by regulators, but if it went through it would have a massive impact on cinema.\"Were it to go through it would reorient Hollywood,\" he said.Mr Harrington said there was likely to be \"big reductions\" in television and film output from a newly-merged company, which would lead to resistance to the move from parts of Hollywood and relevant unions.For consumers, Mr Harrington said a merger was likely to lead to higher prices.\"Netflix would get more expensive and even though HBO Max would be shuttered/become non-essential, the greater penetration of Netflix households would likely mean an increase in total overall subscription revenues.\"Danni Hewson, head of financial analysis at AJ Bell, said Netflix had \"offered an olive branch\" to Hollywood with the promise it would continue to release Warner Bros films on the big screen.\"If this deal can clear those significant regulatory hurdles quickly there are likely to be considerable cost savings to be made,\" she said. \"How much of those savings get passed to streaming platform subscribers or whether Netflix will be seen to have too much pricing power is one of the areas that will face a huge amount of scrutiny in the coming months.\"With additional reporting by Natalie Sherman",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netflix to buy Warner Bros film and streaming businesses for $72bn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0c11/live/2cffe850-d1e5-11f0-aa5c-59732e940d9c.jpg"
      ],
      "datePublished": "2025-12-05T14:43:35.000Z",
      "dateModified": "2025-12-05T14:43:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]