[
  {
    "title": "Since Yesterday: The Untold Story of Scotland's Girl Bands",
    "url": "https://www.bbc.co.uk/iplayer/episode/m00265qy/since-yesterday-the-untold-story-of-scotlands-girl-bands?at_mid=XtXu9G8H4S&at_campaign=Since_Yesterday_The_Untold_Story_of_Scotlands_Girl_Bands&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m00265qy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Since_Yesterday_The_Untold_Story_of_Scotlands_Girl_Bands&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0k8mfgr.jpg",
    "tag": "Trending",
    "date": "2024-12-17T23:30:44.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeSince Yesterday: The Untold Story of Scotland's Girl BandsSince Yesterday: The Untold Story of Scotland's Girl BandsContains some strong language.The story of the trailblazing Scottish girl bands who challenged a male-dominated industry. Duration1h 30mFirst shown17 Dec 2024Available for 1 monthWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsTangled Up with Dylan: The Ballad of AJ WebermanDocumentary chronicling the life, times and crimes of Bob Dylan obsessive AJ Weberman.1h 16mIron Maiden: Flight 666Access all areas. With Bruce in the cockpit, the band take metal mayhem around the world1h 52mFanny: The Right to RockThe empowering story of the '70s band who broke barriers of race, gender and sexuality1h 29mSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsBanned in the 80s: Moments That Shook MusicThe sound of rebellion. From N.W.A to Madonna, the controversial hits that made history55 minsABBA: Against the OddsAll gold. 50 years on, priceless archive tells the untold story of a musical phenomenon1h 30mIrish Music IconsMary Black chats to John Toal about forty years in music.Annie Lennox: DivaFeaturing an in-depth interview with Annie Lennox along with archive footage.29 minsBill Douglas: My Best FriendA beautiful bond. Warm portrait of Scotland’s finest filmmaker and his lifelong companion1h 16mKilling Me Softly: The Roberta Flack StoryReinventing soul. How her sweet, pure voice soundtracked turbulent times57 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Since Yesterday: The Untold Story of Scotland's Girl Bands",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0k8mfgr.jpg"
      ],
      "datePublished": "2024-12-17T23:30:44.000Z",
      "dateModified": "2024-12-17T23:30:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will sue BBC for at least $1bn over Panorama edit",
    "url": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63da/live/35262f40-c1bd-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-15T00:55:15.000Z",
    "description": "Trump says he will take legal action against BBC over Panorama edit7 minutes agoHelen SullivanBBC NewsListen: \"I have to do it\" - Trump says he will s",
    "body": "Trump says he will take legal action against BBC over Panorama edit7 minutes agoHelen SullivanBBC NewsListen: \"I have to do it\" - Trump says he will sue the BBC over Panorama editUS President Donald Trump has said he will take legal action against the BBC next week over how his speech was edited by Panorama, after the corporation apologised but refused to compensate him.Speaking to reporters on board Air Force One on Friday evening, Trump said: \"We'll sue them for anywhere between a billion and $5bn probably sometime next week.\"On Friday, the BBC said the edit of the 6 January 2021 speech had unintentionally given \"the mistaken impression that President Trump had made a direct call for violent action\".The BBC apologised but said it would not pay financial compensation.Trump said he would discuss it with UK Prime Minister Sir Keir Starmer over the weekend. Earlier this week Trump's lawyers threatened to sue the BBC for $1bn in damages unless the corporation issued a retraction, apologised and compensated him. Trump's lawyers had given the BBC a deadline of 22:00 GMT (17:00 EST) on Friday 14 November to respond, which it did.The controversy led to the resignations of BBC director general Tim Davie and head of news Deborah Turness on Sunday.Searches of public court record databases earlier showed no legal action had been filed so far.Federal and state courts in Florida, where a case would likely be filed, are now closed for the weekend. Based on Pacer searches for federal cases related to the BBC, no case filed by the Trump administration has been filed.This is a breaking news story and will be updated shortly. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will sue BBC for at least $1bn over Panorama edit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63da/live/35262f40-c1bd-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-15T00:55:15.000Z",
      "dateModified": "2025-11-15T00:55:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Several killed after bus crashes into bus stop in Stockholm",
    "url": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png",
    "tag": "Trending",
    "date": "2025-11-14T21:51:44.000Z",
    "description": "Three people have been killed and and another three injured after a bus crashed into a bus stop in central Stockholm, Swedish police say.Circumstances",
    "body": "Three people have been killed and and another three injured after a bus crashed into a bus stop in central Stockholm, Swedish police say.Circumstances surrounding Friday's crash at 15:23 (14:23 GMT) on the Valhallavägen street in the Swedish capital remain unclear.The bus driver has been arrested and faces charges of causing death and bodily harm, police said in a statement.However, they added there was \"currently no indication that the incident was intentional\".Officials are trying to establish the identities of the victims. It is not clear if there were passengers on board. The incident occurred near the Royal Institute of Technology university.Images from the scene show rescue crews appearing to help people trapped underneath the double-decker bus.A witness who owns a shop on the street told SVT the bus hit a pole in front of the bus shelter. They said several people ran into the shop crying.A woman told the local Expressen newspaper that the bus \"mowed down an entire bus stop queue\". She said people were screaming and trying to help the injured, while dead people lay on the ground.\"There must have been more people under the bus,\" she said.Prime Minister Ulf Kristersson said his thoughts were with the victims and their families.\"People who might have been on their way home to family, friends, or a quiet evening at home. We do not yet know the cause, but right now my thoughts are primarily with those affected and their loved ones,\" he posted on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Several killed after bus crashes into bus stop in Stockholm",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-14T21:51:44.000Z",
      "dateModified": "2025-11-14T21:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump rolls back tariffs on dozens of food products",
    "url": "https://www.bbc.com/news/articles/cdjr4xw83eko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg",
    "tag": "Trending",
    "date": "2025-11-14T23:16:12.000Z",
    "description": "2 hours agoDanielle KayeBusiness reporterUS President Donald Trump has signed an executive order allowing a range of food products, including coffee, ",
    "body": "2 hours agoDanielle KayeBusiness reporterUS President Donald Trump has signed an executive order allowing a range of food products, including coffee, bananas and beef, to escape his sweeping tariffs.The move comes as his administration faces mounting pressure over rising prices. While Trump previously downplayed concerns about the cost of living, he has focused on the issue since his Republican Party's poor performance in last week's elections.The dozens of products included on the White House's list of exemptions range from avocados and tomatoes to coconuts and mangoes.These goods, the Trump administration said on Friday, cannot be produced in sufficient quantities domestically.Trump has long said that his tariffs - currently a baseline 10% on imports from all countries, with additional levies on many trading partners - would not lead to increased prices for US consumers. He also said affordability was a \"new word\" and a \"con job\" by Democrats.But the latest exemptions signal a reversal, as the Trump administration seeks to lower prices by walking back levies on some food staples.Economists have warned that companies would pass the cost of tariffs onto their customers in the form of higher prices.While inflation remained milder than many analysts had expected in September, most items tracked in the Department of Labor inflation report showed price increases, with groceries up 2.7% from last year.The Trump administration's new tariff exemptions for food products take effect retroactively at midnight on Thursday 13 November, the White House said.In another move to address concerns among consumers about grocery prices, the Trump administration said import taxes on coffee and bananas will be lowered as part of trade deals with four Latin American countries.This week, Trump and Treasury Secretary Scott Bessent both vowed to lower coffee prices, which have jumped about 20% in the US this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump rolls back tariffs on dozens of food products",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg"
      ],
      "datePublished": "2025-11-14T23:16:12.000Z",
      "dateModified": "2025-11-14T23:16:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002m0fz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-11-13T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·13 Nov 2025,·71 minsAvailable for over a yearHow should we balance innovation, power and accountability in the digital age? This week, Amol speaks to Sir Nick Clegg — former UK deputy prime minister and former president of global affairs at Meta — about the power and responsibility of big tech companies. Sir Nick argues that breaking them up won’t solve the problem of their digital dominance, calling instead for greater regulation and user control. \nHe discusses how technology shapes young people’s lives, warning against moral panic whilst calling for stronger age-appropriate safeguards and phone-free schools. And with rare candour, Sir Nick offers an insider’s perspective on how Silicon Valley really works — and why governments, not tech CEOs like Mark Zuckerberg, must ultimately set the rules. \nHe also talks about politics and philosophy, arguing that true liberalism — rooted in reason, openness, and the belief in evidence over emotion — remains vital in an increasingly polarised world. \n(00:03:20) Concerns about the impact of AI \n(00:07:00) The power paradox and network effects \n(00:06:11) Children and smartphones \n(00:22:17) Social media and political polarisation \n(00:34:00) What’s Mark Zuckerberg really like? \n(00:37:56) Why tech bosses are not moral leaders \n(00:41:36) Why he left Meta \n(00:44:10) The future of technology and power \n(00:49:26) The race for AI ‘supremacy’ between the US and China \n(00:52:00) Preparing for this new digital world \n(00:53:11) Why has politics changed so much since he was deputy prime minister? \n(00:57:55) Is liberalism weak? \n(01:01:20) What’s next for Sir Nick Clegg? \n(01:05:16) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Jonny Hall and Ben Andrews. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-11-13T06:00:00.000Z",
      "dateModified": "2025-11-13T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byq?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-14T13:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·14 Nov 2025,·33 minsAre cracks showing inside Trump’s MAGA movement?AmericastAvailable for over a yearFifty year mortgages, recent aid for Argentina, high food prices, a focus on foreign affairs, and Trump telling Fox News that the U.S. needs foreign workers because it doesn’t have enough “talented people”… Americast looks at why some Republicans within the MAGA movement are questioning Trump’s commitment to his campaign promise of “America first”.  \nJustin, Anthony and Marianna look at how and where Trump is under pressure from within the Republican party, and how serious these ‘cracks’ are within the MAGA movement.  Plus, how might Trump satisfy critics who want him to shift his focus back to the economy and domestic policy? \nHOSTS:\n- Justin Webb, Radio 4 presenter\n- Anthony Zurcher, North America Correspondent\n- Marianna Spring, Social Media Investigations Senior Correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Purvee Pattni, George Dabby, Grace Reeve and Laura Cain. The technical producer was Ricardo McCarthy. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155#\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-14T13:06:00.000Z",
      "dateModified": "2025-11-14T13:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man admits sex offences against boys at Stathern summer camp",
    "url": "https://www.bbc.com/news/articles/cvgkxvjj054o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a08/live/1bff7c50-c178-11f0-8669-5560f5c90fbe.png",
    "tag": "Trending",
    "date": "2025-11-14T17:46:29.000Z",
    "description": "7 hours agoCaroline LowbridgeEast MidlandsJon Ruben/FacebookJon Ruben admitted 17 offences at Leicester Crown Court on FridayA man who laced sweets wi",
    "body": "7 hours agoCaroline LowbridgeEast MidlandsJon Ruben/FacebookJon Ruben admitted 17 offences at Leicester Crown Court on FridayA man who laced sweets with tranquilliser and gave them to children at a summer camp in Leicestershire has admitted sexual offences against two boys under 13.Jon Ruben was arrested after eight children and one adult fell ill at Stathern Lodge in July.The 76-year-old, from Ruddington in Nottinghamshire, pleaded guilty to a total of 17 charges when he appeared at Leicester Crown Court on Friday.However, he denied one of the sexual offences he was charged with, which was against a boy under 13. Prosecutors have been given two weeks to consider if they will proceed with this charge, meaning Ruben could still stand trial.He was remanded in custody ahead of a further hearing on 28 November.'Sweet game'Mary Prior KC, prosecuting, outlined Ruben's offending to the court.She said his victims were under-privileged children who were staying at a summer camp that he ran.\"The defendant, for at least 27 years, has run a holiday camp,\" she said.\"There is a long history of children feeling sick at the camp over many years.\"Ruben played a \"sweet game\" with the children, Mrs Prior KC said, in which he would go into the boys' rooms when they were getting ready for bed and ask them to eat sweets \"as quickly as they can\".She told the court Ruben had played this game with the boys \"for many years\", and children had previously fallen ill the following morning.She said Ruben had been able to explain this away as the children being \"overwrought by enjoyment\", until his stepson had concerns in July 2025.Mrs Prior KC added: \"This year his stepson had concerns about what was going on, for good reason.\"They decided to have a look in the defendant's belongings.\"PA MediaThe rented premises, Stathern Lodge, were not connected to the camp itself, the court heardMrs Prior KC said items including baby oil, Vaseline and syringes were found, and his stepson notified the police about his concerns.She said Ruben went on to play the \"sweet game\" with six boys that night - Saturday 26 July - and they were all ill the following morning.\"The police had not gone out by that stage,\" she added.The police watchdog, the Independent Office for Police Conduct (IOPC), previously told the BBC it was investigating Leicestershire Police's handling of the incident.Mrs Prior KC said the children were having difficulty walking due to being ill, so Ruben's stepson called the police again.She said Ruben then played the \"sweet game\" in a room of five children.Mrs Prior KC said police did then attend, and Ruben was arrested at a nearby pub, where he was having a meal with some of the children.She said eight of the children were taken to hospital, with five of them being \"very ill\".Devices belonging to Ruben were later analysed and were found to contain more than 50 category A indecent videos of children, which are the most serious kind.Category B and C videos were also found.PA MediaThe court heard eight children from the camp were taken to hospital after playing Ruben's \"sweet game\"The 17 charges admitted by Ruben were:One count of sexual assault of a child under 13One count of assault of a child under 13 by penetrationEight counts of cruelty to a person under 16 years, in relation to eight separate victimsOne count of acquiring or possession of dutiable goods, namely temazepam, by fraudulent intentThree counts of possession of a class C drug, namely flubromazolam, diazepam and temazepamThree counts of making indecent photographs of childrenTemporary Det Ch Insp Neil Holden said: \"This has been a horrific, complex and emotional investigation involving multiple young, innocent, vulnerable victims and a man who committed the vilest crimes.\"Our focus today must of course remain on the young victims and with the support of partners and dedicated family liaison officers, we have and continue to support their welfare and to ensure their safeguarding going forward.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man admits sex offences against boys at Stathern summer camp",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a08/live/1bff7c50-c178-11f0-8669-5560f5c90fbe.png"
      ],
      "datePublished": "2025-11-14T17:46:29.000Z",
      "dateModified": "2025-11-14T17:46:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
    "url": "https://www.bbc.com/news/articles/cn4jn8zmdrdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cb36/live/31eef650-c13f-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-13T18:30:38.000Z",
    "description": "1 hr ago'Wee firecracker' Jenny Baird finishes third in Big Brother finalJenny Baird, a 20-year-old makeup artist from Londonderry is a fan favourite ",
    "body": "1 hr ago'Wee firecracker' Jenny Baird finishes third in Big Brother finalJenny Baird, a 20-year-old makeup artist from Londonderry is a fan favourite in the Big Brother house.1 hr ago1 hr agoChildren in Need 2025 raises more than £45mThe show included appearances from Lewis Capaldi and stars of Strictly Come Dancing, The Apprentice and Gladiators.1 hr ago2 hrs agoHollywood's SAG Awards announces it will change its nameThe rebrand is meant to reflect the name of the ceremony's award, like the Oscars and Grammys.2 hrs ago15 hrs agoBBC apologises to Trump over Panorama edit but refuses to pay compensationLawyers for the US president have threatened to sue the corporation for $1bn (£759m).15 hrs ago1 day agoPat Butcher to return to EastEnders in episode focused on dementiaThe beloved character, played by Pam St Clement, returns next month in Nigel's  memories from the 90s.1 day ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cb36/live/31eef650-c13f-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-13T18:30:38.000Z",
      "dateModified": "2025-11-13T18:30:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarah Ferguson's new book withdrawn from sale, says Nielsen",
    "url": "https://www.bbc.com/news/articles/cz91zg8ly1jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fe40/live/1b280c40-c171-11f0-a388-eda4b11262c1.jpg",
    "tag": "Trending",
    "date": "2025-11-14T18:22:57.000Z",
    "description": "7 hours agoNoor NanjiCulture reporterGetty ImagesSarah Ferguson's new children's book, which had already been delayed, has now been withdrawn from sal",
    "body": "7 hours agoNoor NanjiCulture reporterGetty ImagesSarah Ferguson's new children's book, which had already been delayed, has now been withdrawn from sale, according to analytics firm Nielsen.Flora And Fern: Kindness Along The Way was initially due to be published on 9 October, according to a press release in Bookseller.As of last week, it was showing as being available from 20 November on Amazon, but it is now no longer listed on the website.NielsenIQ Book Data confirmed to the BBC that the title had been marked as \"withdrawn from sale\" at the request of the publisher. Ms Ferguson's representatives declined to comment.Her publisher, New Frontier Publishing, has not responded to multiple requests for comment.Ms Ferguson, 66, lost her duchess title when her ex-husband, Andrew Mountbatten-Windsor, relinquished use of his Duke of York title over his links with convicted sex offender Jeffrey Epstein.Since then, Andrew has also lost his prince title.Last month, Waterstones bookstores told BBC News that the publication date for Flora And Fern: Kindness Along The Way had \"moved\" and that they did not have a new publication date.A spokesperson for Waterstones said they had had no further communication from the publisher since then.No reason has been given for why the book has now been withdrawn from sale.But one industry source told BBC News that the decision \"makes total sense commercially\".\"You have to imagine it's to do with the current controversies,\" said Neill Denny, from the book trade news website Book Brunch.\"It's not the right time to release a book by Sarah Ferguson.\"Mr Denny said the publisher may decide to \"sit on it\" for six months or a year, hoping for a better time to put it out.\"It's not the sort of book that's going to age, and you're not risking a lot of money by holding it back,\" he said.Getty ImagesMs Ferguson's other publishers have remained tight-lipped when asked whether they plan to sever links with her.Harper Collins, which has published two of her titles, the most recent being A Most Intriguing Lady which came out in 2023, previously declined to comment but pointed to the fact that both her books remain in print and available.Mr Mountbatten-Windsor, and Ms Ferguson, are due to move out of his Windsor estate, Royal Lodge.Mr Mountbatten-Windsor will move to the King's Sandringham estate in Norfolk. It is not yet clear where Ms Ferguson will go.On Friday, the Daily Mail reported that she is preparing to move in with her daughter Princess Eugenie in her Portugal home, although there has been no official confirmation of this. Ms Ferguson's representatives declined to comment on these reports.Ms Ferguson has also faced a separate scandal about her own links with Epstein.In September, several charities dropped her as patron or ambassador after an email from 2011 revealed that she called Epstein her \"supreme friend\" and seemed to apologise for her public criticism of him.Away from her philanthropic work, Ms Ferguson has various business ventures, and has written several children's books, non-fiction about Queen Victoria, and her own memoirs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarah Ferguson's new book withdrawn from sale, says Nielsen",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fe40/live/1b280c40-c171-11f0-a388-eda4b11262c1.jpg"
      ],
      "datePublished": "2025-11-14T18:22:57.000Z",
      "dateModified": "2025-11-14T18:22:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man charged after suspected fake navy admiral at Llandudno Remembrance event",
    "url": "https://www.bbc.com/news/articles/ce8zexp2kp5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7312/live/3a4a40f0-c173-11f0-9e77-171133adaa3b.jpg",
    "tag": "Trending",
    "date": "2025-11-14T19:58:06.000Z",
    "description": "5 hours agoAmy MackrillBBC WalesTerry StewartJonathan Carley, 64, has been charged with an offence relating to the unlawful use of military uniformsA ",
    "body": "5 hours agoAmy MackrillBBC WalesTerry StewartJonathan Carley, 64, has been charged with an offence relating to the unlawful use of military uniformsA 64-year-old man has been charged following an investigation into a suspected fake admiral at a Remembrance Sunday event.Jonathan Carley, from the Harlech area of Gwynedd, is accused of wearing uniform bearing the mark of His Majesty's Forces without permission.Images widely circulated in the press and on social media showed a man wearing the uniform and medals of a high-ranking navy officer whilst in attendance at the wreath-laying service in Llandudno on 9 November.He will appear at Caernarfon Magistrates' Court on Thursday, 11 December.Ch Insp Trystan Bevan said: \"We understand that this incident has caused significant public concern, particularly given its occurrence on Remembrance Sunday.\"In response to the reports made to North Wales Police, officers have responded swiftly to make an arrest and proceed with charges.\"We urge members of the public to avoid online speculation and to refrain from sharing any content that could compromise future court proceedings.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man charged after suspected fake navy admiral at Llandudno Remembrance event",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7312/live/3a4a40f0-c173-11f0-9e77-171133adaa3b.jpg"
      ],
      "datePublished": "2025-11-14T19:58:06.000Z",
      "dateModified": "2025-11-14T19:58:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Islands ceases trading and cancels all flights",
    "url": "https://www.bbc.com/news/articles/c04g6eee5n4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e479/live/4a9fcc40-c1a0-11f0-a35b-31d6f80782eb.jpg",
    "tag": "Trending",
    "date": "2025-11-14T22:41:46.000Z",
    "description": "2 hours agoAlex GreenSouth WestBBCThe Channel Islands-based company employed about 100 staffAirline Blue Islands has suspended trading, with all futur",
    "body": "2 hours agoAlex GreenSouth WestBBCThe Channel Islands-based company employed about 100 staffAirline Blue Islands has suspended trading, with all future flights cancelled, the company has confirmed.In a statement, the airline said passengers should not travel to airports unless they have made alternative travel arrangements.The Channel Islands-based airline, which employed about 100 staff, operated flights to various locations in the British Isles, and also to Bruges and Paris.Jersey's Minister for Treasury and Resources, Elaine Millar, said the government was working with an alternative airline to ensure Jersey had \"reliable and sustainable air links for the long-term.\"'Swiftly reinstated'Millar said: \"I am saddened by the announcement that Blue Islands has suspended operations, and my immediate thoughts are with the people whose jobs have been affected and the passengers whose travel will be disrupted. \"For those passengers based in Jersey, government support is ready and available.\"She said contingency plans which had been prepared would mean connections were \"swiftly reinstated\", with priority given to routes essential to the provision of medical services. The minister said all medical transfer passengers would be supported through the Department of Health, and Ports of Jersey would be providing advice to people affected by flight cancellations.Blue Islands borrowed £8.5m from the Government of Jersey to help it secure its services during the Covid-19 pandemic.A report in August revealed the outstanding capital balance was still £7m in June - more than halfway through the loan period.'Deeply regret inconvenience'In a statement on Friday, the airline said all flights it operated had been cancelled.It directed anyone who had made bookings with Blue Islands directly to contact their bank or provider of the card used to make the booking.It said for bookings made with its codeshare partner Aurigny, travelling on a Blue Islands flight, people should contact Aurigny, as some flights may still be operating.\"We deeply regret the inconvenience that this will bring to your travel plans\" it said.Blue Islands was launched in 2006, with its origins dating back to 1999, when it was formed initially as Le Cocq's Air Link to supply perishable goods to the Channel Island of Alderney from Bournemouth using Britten Norman Islanders, according to its website.First passenger services began in 2002, and in 2003 the trading name of Rockhopper was adopted.In 2006, the airline rebranded as Blue Islands.The airline's website said in March 2020, the brand \"evolved\", with an expanded route network.Related storiesRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Islands ceases trading and cancels all flights",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e479/live/4a9fcc40-c1a0-11f0-a35b-31d6f80782eb.jpg"
      ],
      "datePublished": "2025-11-14T22:41:46.000Z",
      "dateModified": "2025-11-14T22:41:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US coach featured on Netflix series dies after on-campus shooting",
    "url": "https://www.bbc.com/news/articles/cly2qv7l5dyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c54b/live/abcfc800-c19e-11f0-a35b-31d6f80782eb.jpg",
    "tag": "Trending",
    "date": "2025-11-14T22:06:18.000Z",
    "description": "Former American football coach John Beam, who was featured in Netflix series Last Chance U, has died after being shot.The shooting took place at Laney",
    "body": "Former American football coach John Beam, who was featured in Netflix series Last Chance U, has died after being shot.The shooting took place at Laney College in Oakland, California, on Thursday. On Friday, police announced that they arrested a suspect, but did not provide any motive for the attack. Oakland police said that the suspect never played football for Beam but knew the coach. US media reports identified the suspect as Cedric Irving Jr. Tributes have been pouring in for Beam, 66, who had been serving as the college's athletics director at the time of his death, including from the mayor of Oakland and his former teammates who now play professionally for the NFL. Hundreds of people attended a vigil for him outside of the hospital where he was being treated on Thursday night, according to officials.Beam was featured in the fifth season of Last Chance U. The series profiles him and his team, the Laney Eagles, as they fend off rival teams in the northern California city.The eight-part documentary series, which aired in 2020, focused on the successes and struggles of the team, as well as the socioeconomics and the gentrification of the city of Oakland.According to police, the suspect was arrested overnight at a local bus stop, and was found carrying a gun. He was taken into custody without incident.Oakland Acting Police Chief James Beere said that while the suspect knew of Beam,  \"they did not have a relationship\" though the coach was \"open to helping everybody in this community\". He added that the suspect - who was not a student of Laney College but was known to hang around the college - had gone to campus for a \"specific reason\", which he declined to identify.Oakland Mayor Barbara Lee hailed Beam as a \"giant in Oakland — a mentor, an educator and a lifeline for thousands of young people\".\"For over 40 years, he has shaped leaders on and off the field, and our community is shaken alongside his family,\"  she said in a statement.Two brothers who had played under Beam before going on to play in the NFL also paid tribute.Rejzohn Wright of the New Orleans Saints posted a photo of Beam with the caption \"you mean the world to me\".Nahshon Wright of the Chicago Bears also shared a photo of Beam, adding an emoji of a broken heart.This was the second school shooting in Oakland in two days.A shooting took place at Skyline High School on Wednesday, injuring one student. Beam had previously coached at Skyline for 16 years before joining Laney College.The person arrested in connection with his death once played at Skyline High but not when Beam was coaching there, according to police.According to the San Francisco Chronicle, a group of Skyline students who had endured a campus lockdown during the shooting Wednesday happened to be visiting Laney on Thursday, when Beam was shot. The students had to shelter in place on a campus in lockdown for the second day in a row due to gunfire.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US coach featured on Netflix series dies after on-campus shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c54b/live/abcfc800-c19e-11f0-a35b-31d6f80782eb.jpg"
      ],
      "datePublished": "2025-11-14T22:06:18.000Z",
      "dateModified": "2025-11-14T22:06:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chao Xu jailed for life for drugging, raping and filming victims",
    "url": "https://www.bbc.com/news/articles/ced671e5l1wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8019/live/c3e594b0-c176-11f0-9e77-171133adaa3b.png",
    "tag": "Trending",
    "date": "2025-11-14T17:24:32.000Z",
    "description": "'Prolific' rapist who drugged women gets life term8 hours agoMet PoliceChao Xu is believed to have sexually assaulted more women and police are urging",
    "body": "'Prolific' rapist who drugged women gets life term8 hours agoMet PoliceChao Xu is believed to have sexually assaulted more women and police are urging them to come forwardA serial rapist thought to be \"one of the most prolific sex offenders of all time\" who drugged, raped and secretly filmed his victims has been sentenced to life imprisonment with a minimum term of 14 years.Chao Xu, a Chinese national, pleaded guilty to 24 sexual offences, including sexual assault, voyeurism and upskirting against six women between November 2021 and June 2025.Sentencing Xu at Woolwich Crown Court, Judge Christopher Grout described him as a \"sexual predator\" and \"an incredibly dangerous man\".Police believe the total number of his victims is in the hundreds and have appealed for women who were abused by Xu to contact them.'Spring of life'The 33-year-old, who has lived in the UK since 2016 and is a graduate of the University of Greenwich, hosted networking events at his flat in south-east London, where he spiked drinks and raped some of the women who attended, detectives said.They found videos on his devices in which he had recorded himself raping women who seemed incapacitated or unconscious.Xu, who was the director of a recruitment business that helped recent Chinese graduates secure employment in London, set up secret cameras at his flat in an air-freshener and in a speaker to allow him to film people showering, using the toilet and getting changed.He would supply drinks, including a cocktail he dubbed the \"spring of life\" that contained a mixture of alcohol and Chinese herbal medicines.Police found he had made \"compilations\" from his voyeuristic activities, editing together recordings of him raping women who were incapacitated.Met PoliceThe \"spring of life\" cocktail, which contained a mixture of alcohol and Chinese herbal medicines\"Upon forensic examination of Xu's phone, officers uncovered deeply disturbing material,\" Acting Det Supt Lewis Sanderson said.\"The device contained videos and images taken from a point-of-view perspective, showing Xu raping and seriously sexually assaulting women who appear to be unconscious or heavily incapacitated.\"The detective added: \"We believe he is one of the most prolific sex offenders of all time.\"Prosecutor Catherine Farrelly KC told the court that the videos revealed sexual abuse of at least 11 additional unknown women, and said Xu had recorded \"what he was doing as some sort of token\".Xu was a \"bold and persistent sexual predator whose offending steadily became more and more serious\", the court was told.Met PoliceA picture Xu took of himself installing hidden cameraOne victim told the court: \"I don't think I will ever be the same person again.\"I am afraid that I will never be able to forget what that man did to me and how he stole the person I was.\"I fear that I may have introduced Xu to other women who may have suffered the same fate as me. I carry that too.\"I felt out of control and so very alone. I have been told that the drugs he used on me are for animals.\"She described how despite being drugged she was still conscious and knew what was happening to her.Met PoliceAn air-freshener in the bathroom in Xu's flat had a hidden camera\"The terrifying thing had been that I couldn't open my eyes and mouth,\" she said. \"Nor could I move my body. I felt everything that he did, pulling my dress off and touching me intimately. I was horrified.\"I could just see through my eyes every now and then that he had his phone out. I just couldn't understand why he was doing that to me.\"He was supposed to be a friend.\"'Most appalling'Xu was apprehended following a social event at his residence in Glashier Street, Greenwich, in May, when he raped a guest who was later found to have the drug GHB and the muscle relaxant scopolamine in her system.After the woman regained consciousness, she recalled parts of the attack, including Xu filming on his mobile phone. She and another woman reported him and he was arrested on 1 June.In August, Xu admitted four counts of rape, eight counts of assault by penetration, four counts of sexual assault, four counts of voyeurism, two counts of administering a substance with intent, and two counts of operating equipment beneath the clothing of another without consent, between February 2022 and June 2025.Sentencing the Chinese national, Judge Grout told him: \"I have reached the inevitable conclusion that you are an incredibly dangerous man.\"Your behaviour was calculated and planned. You betrayed the trust of a number of women, in the most appalling ways imaginable.\"You are a sexual predator who will gain the trust and confidence of women before raping and sexually assaulting them.\"Because Xu is a foreign national, Judge Grout told him he was \"liable in principle\" to be returned to his \"country of origin, which is China\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chao Xu jailed for life for drugging, raping and filming victims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8019/live/c3e594b0-c176-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-14T17:24:32.000Z",
      "dateModified": "2025-11-14T17:24:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What's behind Rachel Reeves's hokey cokey on income tax rises?",
    "url": "https://www.bbc.com/news/articles/cx2yzj6619wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/73b9/live/d57c0240-c194-11f0-b1da-c7b043da88d2.jpg",
    "tag": "Trending",
    "date": "2025-11-14T22:03:52.000Z",
    "description": "3 hours agoFaisal IslamEconomics editorAfter weeks of wondering will she, won't she, and recent heavy hints that she would indeed raise income taxes i",
    "body": "3 hours agoFaisal IslamEconomics editorAfter weeks of wondering will she, won't she, and recent heavy hints that she would indeed raise income taxes in the Budget, Chancellor Rachel Reeves has now decided against the manifesto-breaching move.Amid the fog of Budget speculation, here is what we do know.That plan, to raise income tax rates by 2p but compensate workers with a 2p National Insurance cut was sent to the OBR as an option earlier this month to be costed, to help fill what was then a £30bn gap in the public finances, mainly caused by a downgrade to productivity.The so-called \"2 up, 2 down\" plan, pioneered by the Resolution Foundation think tank, would have raised several billion pounds, mainly from non-wage income such as landlords and savings.Newer assessments from the OBR appear to have increased the projected strength of wages and tax receipts in the coming years and offset several billion pounds of that gap, taking it closer to £20bn in total.As a consequence, the plan to raise income tax rates has not been advanced in the latest set of measures sent to the OBR to analyse. While this \"iterative\" process is part of the normal forecasting round that precedes a Budget, on Monday of this week the chancellor suggested very strongly that tax rates would go up in a BBC interview. Health Secretary Wes Streeting on Friday appeared to confirm the shift away from anything that could be seen to break election promises:\"It is really important that we keep our promises and we stand by our manifesto. The fact that there's been speculation about income tax shows how difficult the situation is with public finances and secondly that the chancellor is determined to stick to her fiscal rules,\" he said.There is some irony in the health secretary making these comments, given suggestions from Downing St about leadership bids and claims about the unique power of the prime minister and chancellor over the bond markets.By the end of the week the bond markets were more than nervous as a result of the hokey cokey over income tax.It is always questionable to assume a singular motive behind the awesome financial power of the debt markets, but let me try to divine what happened over the past 24 hours. After the Financial Times' scoop about the dropping of the tax rate plan, there was a notable spike up in the effective borrowing cost for the Government. It was up 0.12% points for a 10-year gilt. Markets had been reassured by the tough fiscal talk by the chancellor over the past month. Much of this was driven by expectations of lower Bank of England interest rates amid a weakening jobs market. The willingness by the chancellor to take political pain, in the form of breaking tax rate manifesto promises, in order to restrain borrowing in a straightforward way, is a plus for the bond vigilantes. But this week's developments, including the dropping of other kites being flown - from extra tax on partnerships, and entrepreneurs leaving the UK -  injected doubt about the appetite to trade political pain for lower bond yields.Even when it was confirmed that better - or less bad - economic forecasts had helped reduce the budget gap, and create room to avoid the tax rate hike, the markets only calmed briefly, before they crept up to even higher effective rates by the end of the day. The jitters are back.Insiders said that the chancellor's Budget strategy  \"remains the same\" to increase the buffer or \"headroom\" on meeting her borrowing rules significantly higher from the current £10bn a year,  to tackle cost of living pressures, and to make \"fair choices\" on tax. That would appear to mean an extension in the £40bn a year freeze on tax thresholds - which raises an extra £8bn a year as more worker's salaries creep into the higher tax brackets  .Ministers point to how they are planning to raise tax, as well as the amount, suggesting a squeeze on wealth, capital and income from those sources, rather than long-suffering pay packets.There are real questions about the loose lips around Whitehall, floating all sorts of significant tax reform, and the impact in markets.It's worth noting too that final decisions on the Budget have not yet been made, and the process continues. everyone will hope it is smoother from here until the big speech on November 26 .",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What's behind Rachel Reeves's hokey cokey on income tax rises?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/73b9/live/d57c0240-c194-11f0-b1da-c7b043da88d2.jpg"
      ],
      "datePublished": "2025-11-14T22:03:52.000Z",
      "dateModified": "2025-11-14T22:03:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]