[
  {
    "title": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2m9m5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-22T15:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·22 Feb 2026,·33 minsGordon Brown turns detective over AndrewNewscastAvailable for over a yearToday, we discuss a report in the Sunday Telegraph that Gordon Brown has demanded a police investigation into whether Andrew Mountbatten-Windsor used taxpayer-funded jets and RAF bases to meet the paedophile Jeffrey Epstein.\nThe former PM says he’s sent a five-page memorandum to the Metropolitan, Surrey, Sussex Thames Valley and other UK police constabularies.\nLaura and Paddy are joined by Henry Zeffman to discuss why he’s turned investigator, what it means for the Royal Family, and whether rules around the line of succession should be changed.\nAhead of the Government’s Schools White Paper on Monday, we also discuss some of Labour’s proposed changes to special educational needs and disabilities (SEND) support, as well as Kemi Badenoch’s vow to lower interest on some student loans which she says feel \"increasingly feel like a scam\".\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC.\nThe presenters were Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Kris Jalowiecki. The social producer was Grace Braddock. The technical producer was Hannah Montgomery. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-22T15:03:00.000Z",
      "dateModified": "2026-02-22T15:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2d11v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-20T20:08:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·21 minsTrump's Tariffs... Trump attacks the Supreme Court over tariff banAmericastAvailable for over a yearDonald Trump has called the Supreme Court’s ruling blocking many of his sweeping tariffs ‘deeply disappointing’ and has announced a new 10 per cent tariff on global imports.\nJustin, Sarah and Anthony jumped into action following the President’s press conference to unpack the day’s drama: starting with the US Supreme Court decision to block global tariffs and ending with the President’s withering attack on some of the justices for their decision. \nThe president spoke a few hours after the US Supreme court struck down the legal justification for a large portion of Trump's sweeping global tariffs in a major blow to the president's economic agenda.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Miranda Slade, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-20T20:08:00.000Z",
      "dateModified": "2026-02-20T20:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The key changes being made to special educational needs - at a glance",
    "url": "https://www.bbc.com/news/articles/cwyke5n1z4po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/048f/live/7fda1870-10c4-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-23T12:47:38.000Z",
    "description": "4 hours agoHazel ShearingEducation correspondentGetty ImagesThe government has published plans to reform the special educational needs and disabilitie",
    "body": "4 hours agoHazel ShearingEducation correspondentGetty ImagesThe government has published plans to reform the special educational needs and disabilities (SEND) system in England - and there are a lot of new terms to get your head around.You might already be familiar with education, health and care plans (EHCPs), but now we're talking about individual support plans (ISPs), too.There will also be \"targeted\", \"targeted plus\" and \"specialist\" layers of support, as well as new national inclusion standards.All of these phrases will become crucial to anyone working out how they'll be affected by the new system, which the education secretary says will get support to children with SEND \"when they need it, as routine and without a fight.\"Here are the key changes that have been announced.1. EHCPs are changingThe big change is that, by 2035, only children with the most complex needs will qualify for EHCPs.They are legal documents that identify a pupil's needs and set out what support they should receive. Local authorities are responsible for ensuring EHCPs are followed.Until 2015, the proportion of pupils with EHCPs in schools was relatively stable at 2.8%. Since then it has nearly doubled to 5.3%.The government is worried that without changes, demand will only grow and it won't be possible to meet it.Children who already have an EHCP, or who have been assessed as needing one, will keep them until they finish whichever phase of education they are in - primary or secondary school, for example.At that point – starting from September 2029 - they'll be reassessed.For example, pupils who are now in Year 2 will undergo the reassessments when they reach Year 6.Parents will still be able to apply for EHCPs, which will be delivered by local authorities, and challenge the decisions made about what support their child can get at tribunal.That proportion of children receiving EHCPs is expected to grow in the foreseeable future while the reforms roll out, but the government hopes its changes will mean it happens at a slower rate and will fall back to its current level by 2035. 2. The introduction of ISPsThe government's new vision is that pupils with SEND, including those who don't have EHCPs, will have new ISPs.As a reminder, ISP stands for \"individual support plans\".These documents will set out a child's needs, what support they should receive and what it hopes to achieve.The government described them as \"flexible\" plans that set out what the child needs day to day - as opposed to an EHCP, which is the framework giving them legal entitlement to support.Children with EHCPs will also have ISPs, which will set out how the content of the EHCP will be delivered.All children will have a legal right to an ISP and their nursery, school or college will be responsible for consulting with parents and drawing them up. They will be reviewed at least once a year.If parents are not happy with what's in a child's ISP, they will have to go through a school complaints system first before being able to complain to the local authority, or to the government.3. New ways to work out who gets what supportGot all that? Good.Because those two different documents - EHCPs and ISPs - sit alongside three new layers of support for children with SEND, in addition to what the government is calling a \"universal offer\" for all children.All children with SEND will have an ISP. What the ISP says about their needs determines which layer of support they will receive.There's \"targeted\" support, which might involve pupils receiving help in small groups, and reasonable adjustments such as the provision of coloured paper or laptops for children with dyslexia, for example.Then there's \"targeted plus\" support, which will give a child access to specialists like speech and language therapists and educational psychologists, as well as to  dedicated SEND spaces within schools called \"inclusion bases\".The third level is \"specialist support\", for children with the most complex needs.This is where things get a bit more complicated. When a child receives \"specialist support\", they will be given a \"specialist provision package\", which will be created by education, health and care experts and will spell out what they need.However, only children with \"specialist provision packages\", as part of the specialist support layer, are intended to qualify for new EHCPs. The Department for Education says EHCPs will be \"based on\" those packages and will give children a legal right to the support they set out.The government wants children to be able to switch between these three layers if and when their needs change. And it says by 2028 \"national inclusion standards\" will be in place, setting out what support children and families should be able to expect from schools.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The key changes being made to special educational needs - at a glance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/048f/live/7fda1870-10c4-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-23T12:47:38.000Z",
      "dateModified": "2026-02-23T12:47:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northumberland teen guilty over banned neo-Nazi group membership",
    "url": "https://www.bbc.com/news/articles/c77k0yddpgjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3597/live/e9f549f0-10ce-11f1-b4d3-abf57a569766.jpg",
    "tag": "Trending",
    "date": "2026-02-23T15:54:16.000Z",
    "description": "Teen guilty of belonging to banned neo-Nazi group48 minutes agoPeter HarrisNorth East and Cumbria correspondentCounter Terror Policing North EastThe t",
    "body": "Teen guilty of belonging to banned neo-Nazi group48 minutes agoPeter HarrisNorth East and Cumbria correspondentCounter Terror Policing North EastThe teenager cannot be named because of his ageA 16-year-old boy from Northumberland has been found guilty of being part of a banned neo-Nazi organisation.A jury at Leeds Crown Court unanimously convicted him of membership of the paramilitary group The Base, as well as possessing and sharing terror publications.They were unable to reach a decision on the most serious allegation he faced - that he was preparing acts of terrorism - and the Crown Prosecution Service confirmed it would not seek a retrial.The boy, who cannot be named because of his age, will be sentenced on 27 March.Counter terror police raided the teenager's home last February and said it discovered an \"arsenal\" of weapons, including a crossbow, knives and a gas-powered air pistol.The jury were shown images of the boy's bedroom where police found a replica Nazi Schutzstaffel (SS)-style cap, a full-sized skeleton with a mask, and posters relating to The Base.The defence had told jurors the boy denied \"he ever actually intended to carry out any act of terrorism\" and they needed to consider his life experience.Counter Terror Policing North EastThe teenager had posters in support of the banned neo-Nazi organisation called The Base in his roomPolice said the teenager, who was 15 at the time he was arrested, was part of extreme right-wing online chat groups on platforms such as Telegram, Snapchat, TikTok and Wire.Det Ch Supt James Dunkerley, head of Counter Terrorism Policing North East, said: \"This case provides a stark reminder around the dangers of extreme content online that is accessible to the public and how individuals can be drawn into serious offending.\"The defendant told the court he created an online persona to escape reality and his use of online platforms and social media escalated through his childhood.Counter Terror Policing North EastCounter terror police found an air rifle in the teenager's homeThe jury heard the banned group the boy joined, The Base, believed in race war and wanted to bring about the collapse of society to create a \"white supremacist utopia\".Steven Rai, from research and advocacy group Institute for Strategic Dialogue, said it was not the only case of a minor being connected with the organisation, with young people also being arrested in Italy and the Netherlands for membership.He said: \"I think it is a very alarming sign of how youth are being increasingly drawn to some of these extremist networks.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northumberland teen guilty over banned neo-Nazi group membership",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3597/live/e9f549f0-10ce-11f1-b4d3-abf57a569766.jpg"
      ],
      "datePublished": "2026-02-23T15:54:16.000Z",
      "dateModified": "2026-02-23T15:54:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former boss of Halifax Skircoat Lodge care home abused children for decades",
    "url": "https://www.bbc.com/news/articles/cn48xg1pz7xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20f9/live/5c8fc250-f541-11f0-882c-db1e330b50d4.png",
    "tag": "Trending",
    "date": "2026-02-23T16:05:17.000Z",
    "description": "40 minutes agoEmma GlasbeyYorkshire home and social affairs correspondentBBCMalcolm Phillips was found unfit to stand trial so a finding of facts hear",
    "body": "40 minutes agoEmma GlasbeyYorkshire home and social affairs correspondentBBCMalcolm Phillips was found unfit to stand trial so a finding of facts hearing took place insteadA former children's home manager and his assistant sexually abused children in their care for decades.Malcolm Phillips, 93, carried out the abuse against four girls and two boys at Skircoat Lodge in Halifax between 1976 and 1994, a jury has found.He was deemed unfit to stand trial and a trial of facts was held at Bradford Crown Court on charges of rape, indecent assault and indecency with a child.Linda Brunning, 66, was found guilty of indecent assault against one boy and helping Phillips abuse another boy in the 1980s and 1990s. Brunning, who burst out crying as she was told she faced a \"substantial\" jail term, is due to be sentenced in April.Phillips had been in charge of the children's home since it opened in 1976 and his trial heard that \"he let no-one challenge his authority\".He lived at Skircoat Lodge and had \"unfettered access\" to all areas, including the children's bedrooms.The jury was told that during the course of almost two decades, Phillips used his power to \"isolate specific children to use for his sexual gratification\".The court heard children were chosen carefully as targets and were deprived of food and pocket money and threatened that visits from family would be taken away.Youngsters would often run away after being sexually abused but were taken straight back to the home by police and accused of being troublemakers.West Yorkshire PoliceLinda Brunning worked as Malcolm Phillips' assistant at Skircoat Lodge children's homeFormer care worker Brunning was described as a \"large, domineering woman who took pleasure in physically hurting and humiliating children\".The jury agreed that Brunning indecently assaulted a boy and also \"facilitated the abuse by Malcolm Phillips upon a small, defenceless child\".The youngest victim was between nine and 13 years old when he was sexually assaulted by Phillips, with Brunning assisting the abuse by restraining the child.The prosecution said the boy missed his mother and Brunning had exploited this weakness by telling the child that his mother did not love him.Kelly Lees, who has waived her lifelong right to anonymity, was sexually abused by Phillips in the 1990s, after being told to do her homework in his office.She began skipping school, hoping it would stop if she did not have any homework.\"I was a good child and I loved school but if you were well-behaved there, the more targeted you were,\" she said.\"If you started running off or skiving school or shoplifting, they were scared of us being picked up by the police and opening our mouths.\"Chris Wild was sent to Skircoat Lodge in 1991Chris Wild was sent to Skircoat Lodge aged 11 in the 1990s after his father died.He was not a victim of sexual abuse, but described Skircoat as a \"house of horrors\" and has campaigned for further investigation.\"I had many friends in there who are not here anymore because they took their own lives,\" he said.\"There are young people whose lives were destroyed, adults who are suffering with mental health issues and there's never been a public apology.\"Phillips, who turned 93 during the trial, was previously convicted in 2001 of indecently assaulting eight girls at Skircoat Lodge in the 1970s and 80s and was sentenced to seven years in jail.If you have been affected by the issues raised in this story you can visit the BBC Action Line for support.The NSPCC investigated allegations of abuse at Skircoat Lodge in 1994 and found that excessive force was being used and children were being deprived of food and sleep.Following the jury's verdicts, an NSPCC spokesperson said Phillips and Brunning had run an \"appalling campaign of abuse against children in their care, many of whom had suffered previous trauma\".It said: \"The pair worked together to exploit these vulnerable young people and protect each other from police suspicion for almost two decades.\"While Phillips targeted specific children and led the abuse, Brunning's complicity helped silence victims and ensure any young person who tried to seek help was not believed, meaning their crimes went undetected for many years.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former boss of Halifax Skircoat Lodge care home abused children for decades",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/20f9/live/5c8fc250-f541-11f0-882c-db1e330b50d4.png"
      ],
      "datePublished": "2026-02-23T16:05:17.000Z",
      "dateModified": "2026-02-23T16:05:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ronnie O'Sullivan signs up for World Seniors Snooker Championship",
    "url": "https://www.bbc.com/sport/snooker/articles/cwy815gj5q4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1cfc/live/be2fd2d0-10bb-11f1-b370-c5751d84f588.jpg",
    "tag": "Trending",
    "date": "2026-02-23T14:22:02.000Z",
    "description": "Ronnie O'Sullivan is set to make his debut in the World Seniors Snooker Championship at Sheffield's Crucible Theatre in May.The tournament begins on 6",
    "body": "Ronnie O'Sullivan is set to make his debut in the World Seniors Snooker Championship at Sheffield's Crucible Theatre in May.The tournament begins on 6 May - two days after the completion of the main World Championship where the 50-year-old will be aiming for a record-breaking eighth win.Changes to seniors tournament rules mean players aged 45 or over who are ranked in the world's top 64 are now eligible to take part.Despite skipping several tournaments this season, O'Sullivan - who won his most recent world title in 2022 - is currently 11th in the rankings.Four-time seniors champion Jimmy White - the most-successful player in the event's history - is also set to take part this year.Other names in the draw include 1997 world champion Ken Doherty, 2015 winner Stuart Bingham, 12-time women's world champion Reanne Evans and current British Seniors Open champion Joe Perry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ronnie O'Sullivan signs up for World Seniors Snooker Championship",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1cfc/live/be2fd2d0-10bb-11f1-b370-c5751d84f588.jpg"
      ],
      "datePublished": "2026-02-23T14:22:02.000Z",
      "dateModified": "2026-02-23T14:22:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia backs removing Andrew from royal line of succession",
    "url": "https://www.bbc.com/news/articles/cr5lrny83dgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1cc2/live/07a98f30-10af-11f1-ae9c-bbdf8b825e1a.jpg",
    "tag": "Trending",
    "date": "2026-02-23T13:05:14.000Z",
    "description": "4 hours agoMaia DaviesGetty ImagesAndrew Mountbatten-Windsor is eighth in line to the throneAustralia's prime minister has told Sir Keir Starmer his g",
    "body": "4 hours agoMaia DaviesGetty ImagesAndrew Mountbatten-Windsor is eighth in line to the throneAustralia's prime minister has told Sir Keir Starmer his government would back plans to remove Andrew Mountbatten-Windsor from the line of royal succession.Anthony Albanese expressed his support for such a proposal in a letter to the UK prime minister.Andrew remains eighth in line to the throne despite being stripped of his titles, including \"prince\", in October amid pressure over his ties to paedophile financier Jeffrey Epstein.The UK government is considering introducing legislation to remove him from the line of succession. It follows Andrew's arrest on suspicion of misconduct in public office on Thursday. He has consistently and strenuously denied any wrongdoing.The former prince was released under investigation 11 hours after his arrest by Thames Valley Police.Removing Andrew from the line of succession would require an act of Parliament supported by the 14 Commonwealth countries where King Charles III, his brother, is head of state, including Australia.Albanese's letter reads: \"Dear Prime Minister Starmer, in light of recent events concerning Andrew Mountbatten-Windsor, I am writing to confirm that my government would agree to any proposal to remove him from the line of royal succession.\"I agree with His Majesty that the law must now take its full course and there must be a full, fair and proper investigation.\"These are grave allegations and Australians take them seriously.\"Speaking after his brother Andrew's arrest, King Charles had said: \"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities.\"A spokesman for the UK prime minister confirmed the letter had been received and said the government was \"considering whether further steps are required in relation to Andrew Mountbatten-Windsor\". He said they were \"not ruling anything out\".\"Given the ongoing police investigation it would not be appropriate for the government to comment further at this stage.\"Removing Andrew from the line of succession would require an act of Parliament approved by MPs and peers, and would come into effect when given royal assent by the King.Canada, Jamaica and New Zealand are among the Commonwealth countries who would also need to support it.The last time someone was removed from the line of succession by an act of Parliament was in 1936, when the former Edward VIII and his descendants were removed due to his abdication.Getty ImagesAnthony Albenese wrote to his UK counterpart on MondayBuckingham Palace has not publicly commented on the government's consideration of legislation to remove Andrew from the line of succession.On Friday, Defence Minister Luke Pollard told the BBC that the move - which would prevent Andrew from ever becoming King - was the \"right thing to do,\" regardless of the outcome of the police investigation.Chief Secretary to the Treasury James Murray meanwhile said \"any questions in that sphere would be quite complicated\", adding that the live police investigation needed to \"play out\".Reform UK leader Nigel Farage said on Monday that Parliament should not pass legislation to remove the former prince from the line of succession \"until the police have finished their jobs\". He also cautioned against a \"trial by media\".The former prince was arrested at 08:00 GMT on Thursday at Sandringham, the King's Norfolk estate where Andrew has been living since leaving his Windsor home, Royal Lodge, in early February.Police searches at Sandringham concluded late on Thursday. It is understood they continued at the 30-room property in Windsor over the weekend, where several unmarked police cars were seen on Saturday.Andrew has previously denied any wrongdoing in relation to Epstein. He has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of millions of files in January connected to the late financier's case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia backs removing Andrew from royal line of succession",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1cc2/live/07a98f30-10af-11f1-ae9c-bbdf8b825e1a.jpg"
      ],
      "datePublished": "2026-02-23T13:05:14.000Z",
      "dateModified": "2026-02-23T13:05:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "El Mencho: At least 25 National Guards killed in violence after death of Mexican drug lord",
    "url": "https://www.bbc.com/news/articles/cx2lp7xwql4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e39e/live/a5ab2ba0-10cb-11f1-b4d3-abf57a569766.jpg",
    "tag": "Trending",
    "date": "2026-02-23T16:04:33.000Z",
    "description": "40 minutes agoJack BurgessGetty ImagesA member of Mexico's National Guard stands near the charred wreckage of bus that appears to have been set on fir",
    "body": "40 minutes agoJack BurgessGetty ImagesA member of Mexico's National Guard stands near the charred wreckage of bus that appears to have been set on fire by organised crime groups in Jalisco state on SundayAt least 25 members of Mexico's National Guard have died during a wave of violence in the state of Jalisco after the killing of a drug lord, the country's security minister has said.Unrest has erupted in at least 20 states since Nemesio Oseguera Cervantes - better known as \"El Mencho\" - died in custody on Sunday shortly after being captured by Mexican special forces.Mexico has sent 2,500 soldiers to the west of the country to bolster security, Defence Secretary Ricardo Trevilla said on Monday.The Jalisco New Generation Cartel (CJNG) is one of the most feared criminal organisations in Mexico and its leader was Mexico's most wanted man before his death on Sunday. Watch: Vehicles set ablaze across Mexico amid violenceEl Mencho was captured on Sunday after forces tracked down a romantic partner he was meeting, according to Mexico's defence secretary.He was seriously injured in a firefight between his bodyguards and the military commandos deployed to capture him.El Mencho died while the military was transporting him from the town of Tapalpa, in Jalisco state, to the capital, Mexico City.At least six of El Mencho's security guards were also killed in the operation, while three members of the Mexican military were injured, the defence ministry said.Security secretary Omar Garcia Harfuch said a prison guard, a member of the state prosecutor's office and 30 members of El Mencho's criminal organisation were killed in the unrest since his death, according to the AFP news agency.Mexico's President Claudia Sheinbaum has praised the army's operation that led to El Mencho's death and said her priority is to guarantee peace and security across the country.As news of El Mencho's death spread, members of his cartel launched attacks in many towns and cities where the CJGN is active.In some towns, they blocked roads by throwing spikes and nails on to the tarmac - in others, they commandeered buses and other vehicles then torched them in the middle of the road.Sheinbaum said that the road blocks had been cleared by Monday morning.However, dozens of banks and local businesses have been damaged after they were set alight by cartel members.In many towns, streets were deserted on Sunday as local authorities told residents to seek shelter in their homes.ReutersThe US State Department had offered a $15m (£11.1m) reward for information leading to El Mencho's capture.The Mexican Ministry of Defence said that the raid aimed at capturing El Mencho had been carried out by the Mexican army, with support from the country's National Guard and Air Force.It added that \"complementary information\" provided by the US had helped seize the drug lord but Mexico confirmed on Monday that no US forces were involved in his killing, according to the AFP news agency.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "El Mencho: At least 25 National Guards killed in violence after death of Mexican drug lord",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e39e/live/a5ab2ba0-10cb-11f1-b4d3-abf57a569766.jpg"
      ],
      "datePublished": "2026-02-23T16:04:33.000Z",
      "dateModified": "2026-02-23T16:04:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Porn company fined £1.35m by Ofcom over age verification failings",
    "url": "https://www.bbc.com/news/articles/c0mglnzprdyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f66c/live/066d3510-10a3-11f1-b72a-e7014dcc8357.jpg",
    "tag": "Trending",
    "date": "2026-02-23T11:27:13.000Z",
    "description": "5 hours agoLaura CressTechnology reporterGetty ImagesOfcom has fined a porn company £1.35m for failing to introduce proper age verification measures o",
    "body": "5 hours agoLaura CressTechnology reporterGetty ImagesOfcom has fined a porn company £1.35m for failing to introduce proper age verification measures on its websites.The media regulator said 8579 LLC's sites did not have \"highly effective\" methods to check UK visitors were over 18 and prevent children accessing the content.The fine - Ofcom's largest levied under the Online Safety Act (OSA) so far - comes after it began probing the firm \"within days\" of age check rules taking effect in July 2025.8579 LLC has also been fined a further £50,000 for not responding to Ofcom's information requests.According to Ofcom, the company failed to implement highly effective age checks on most of its porn sites between 25 July and at least 19 November 2025.The regulator says 8579 LLC must implement robust methods to check UK visitors are over 18 on one remaining site before 17:00 GMT on Monday, or face an additional £1,000 daily penalty.George Lusty, director of enforcement at Ofcom, said it had \"been clear\" adult sites needed to deploy robust age checks to protect children in the UK form seeing porn.\"Those that fail to do this – or ignore legally binding requests from us – should expect to face fines,\" he added.The regulator is also requiring 8579 LLC to provide Ofcom with a complete list of all sites it operates, after failing to respond to the regulator's information requests.It risks a further additional daily fine of £250 if it does not comply.Ofcom has already launched probes into many porn sites lacking age checks and handed down decisions, including fines, for some.Ofcom later said AVS had rolled out age checks on some of its porn sites.Aylo, Pornhub's parent company, said the OSA had \"not achieved its goal of protecting minors\".It also said the law had \"diverted traffic to darker, unregulated corners of the internet\".The Act is a set of laws and duties online platforms must follow, that are implemented and enforced by Ofcom.Under its Children's Codes, platforms must also prevent young people from encountering harmful content relating to suicide, self-harm, eating disorders and pornography.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Porn company fined £1.35m by Ofcom over age verification failings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f66c/live/066d3510-10a3-11f1-b72a-e7014dcc8357.jpg"
      ],
      "datePublished": "2026-02-23T11:27:13.000Z",
      "dateModified": "2026-02-23T11:27:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK says 'nothing is off the table' in response to US tariffs",
    "url": "https://www.bbc.com/news/articles/cx2rv212wwyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05ce/live/f4cd5b60-10b5-11f1-b370-c5751d84f588.jpg",
    "tag": "Trending",
    "date": "2026-02-23T15:59:19.000Z",
    "description": "45 minutes agoMitchell Labiak,Business reporterandJack Fenwick,Political correspondentGetty ImagesDowning Street has said no reciprocal action is \"off",
    "body": "45 minutes agoMitchell Labiak,Business reporterandJack Fenwick,Political correspondentGetty ImagesDowning Street has said no reciprocal action is \"off the table\" if the US does not honour its tariff deal with the UK, but added that \"no one wants a trade war\".The prime minister's official spokesman said the \"majority\" of the UK-US deal, such as the tariffs on cars, steel, and pharma, was not expected to change, but described the situation as \"evolving\" and said discussions between the UK and US were ongoing.On Friday, the US Supreme Court outlawed most of the global tariffs that Trump had announced last year, saying the president had overstepped his powers.That ruling affected all tariffs Trump had introduced using the International Emergency Economic Powers Act (IEEPA), which includes all those announced on \"Liberation Day\" last year.That 15% tariff will be introduced as a temporary solution under Section 122 of the 1974 Trade Act. Some products will be exempted under the levy, such as critical minerals, metals and pharmaceuticals.Meanwhile, the GTA said countries such as China and Brazil, which currently have higher tariff rates, would be better off.The 15% global levy does not affect tariffs the UK and US had agreed on specific sectors, such as steel, aluminium, pharmaceuticals, automobiles and aerospace, which represent most of the UK's trade with the US.Only sectors beyond those the UK had negotiated separate sectorial tariffs would face the 15% global rate.This is because the Section 122 legislation Trump has said he will use to impose his 15% tariff is different from the way in which tariffs on specific sectors are introduced.The British Chamber of Commerce's president, Andy Haldane, told the BBC the UK would \"sit towards the bottom of league table\" of trade partners if Trump's 15% tariff came into effect.\"The perversity of what happened of the weekend was that those who got good deals, the allies, have been most disadvantaged,\" he added.'On hold until further notice'US trade representative Greer told CBS on Sunday that he had spoken to the EU and other countries over the weekend.\"The deals were not premised on whether or not the emergency tariff litigation would rise or fall,\" he said.\"These deals are going to be good deals. We expect to stand by them. We expect our partners to stand by them.\"Despite Greer's assurances, the EU Parliament said on Monday it would put the deal it had secured with the US last year \"on hold until further notice\".In a possible reference to the EU's decision, Trump wrote on Truth Social on Monday that \"Any Country that wants to \"play games\" with the ridiculous supreme court decision [...] will be met with a much higher Tariff, and worse, than that which they just recently agreed to\".The UK prime minister's official spokesman said: \"Our approach to the US has always been pragmatic.\"We continue to have productive conversations with them... and those discussions are happening at all levels, but nothing is off the table at this stage.\"Industry doesn't want to see a trade war where both sides keep escalating the situation, and that's why our focus is on constructive engagement with our US counterparts to retain the UK's competitive advantage.\"Richard Rumbelow, director of international business at manufacturing industry body Make UK, said many UK exporters will be \"concerned at the further prospect of trade disruption to goods entering the US market\".\"Clarity is now urgently required on how UK exports will be treated on arrival into the United States,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK says 'nothing is off the table' in response to US tariffs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05ce/live/f4cd5b60-10b5-11f1-b370-c5751d84f588.jpg"
      ],
      "datePublished": "2026-02-23T15:59:19.000Z",
      "dateModified": "2026-02-23T15:59:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who was El Mencho, Mexico's most wanted man?",
    "url": "https://www.bbc.com/news/articles/c1jkw18e19jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1bd9/live/a48edb70-10a5-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-23T03:17:03.000Z",
    "description": "13 hours agoWill GrantMexico correspondentBBC on what the killing of drug lord 'El Mencho' means for MexicoThere are only a handful of names that have",
    "body": "13 hours agoWill GrantMexico correspondentBBC on what the killing of drug lord 'El Mencho' means for MexicoThere are only a handful of names that have had a lasting impact in the history of Mexican organised crime.Nemesio Oseguera Cervantes – more commonly known as \"El Mencho\" – is one of them. Hailing from humble rural roots in the western state of Michoacán, his rise to the top of one of the most feared and dangerous cartels in modern Mexico, the Jalisco New Generation Cartel (CJNG), was meteoric. And it was achieved through aggression, ambition, brutality and ruthlessness.His killing has been heralded as a victory in both Mexico and the United States.The Mexican authorities and the US reported that US intelligence was involved in bringing down the kingpin, lending the operation a sense of cross-border co-operation that could benefit both governments. For the Mexican military, a cartel leader has been removed from the equation, thereby weakens – at least in theory, and maybe for a time – the criminal group he ran.The response from El Mencho's men has been swift.Roadblocks have been erected and violence has spilt over into the streets in as many as eight different states, from Guerrero on the Pacific coast to Tamaulipas in the north-east. Even the capital, Mexico City, and the surrounding Mexico State have seen incidents.Some of the worst violence has been in Jalisco itself, with masked gunmen setting fire to stores in the state capital, Guadalajara – one of the venues for this summer's Fifa World Cup. In the beach resort of Puerto Vallarta, tourists and locals alike are sheltering in place until the wave of violence passes.It's a show of loyalty from El Mencho's foot-soldiers and a show of fury at the authorities for eliminating their leader. But whether the roadblocks and burning cars are for anything more than just show – that is, whether the violence de-escalates or ramps up – will only become clear over next few days. The reaction by law enforcement will be critical in that regard.It is a long-held truth about such transnational criminal groups that, even with a cartel head as influential as Oseguera, there are inevitably three or four well-placed lieutenants on hand to replace him.Undoubtedly, though, El Mencho was key to the group's ascendancy.When he moved to the US as an undocumented immigrant in the 1980s, he had already had his first brushes with criminality in cultivating the marijuana fields of his native state. Various arrests in the US followed as he dug deeper into narcotics crime in California, before eventually being sentenced to several years in prison in the US.ReutersCars burn in Zapopan, near Guadalajara, after El Mencho's death on SundayOseguera was deported back to Mexico aged 30 and began to fully immerse himself in cartel activity. He worked for the Milenio Cartel, based out of his native Michoacán, and grew in stature and reputation as a calculating and cruel boss.He was ideally placed when the cartel fractured and, from its remnants, the CJNG sprang up with El Mencho at its head.Through a combination of territorial expansion and the nimbleness to pivot the cartel's activity into new and lucrative illegal activities, he turned the group into what it has become today – arguably the predominant criminal force in Mexico.His leadership and his cartel benefitted from the collapse of the Sinaloa Cartel after the extradition of its leader, Joaquín \"El Chapo\" Guzmán, to the US. Subsequent battles between warring factions in Sinaloa have ultimately torn the group apart.The New Generation Cartel was on hand to hoover up an important portion of the fentanyl trade after the fall of El Chapo's sons. One of them, Joaquín Guzmán López, handed himself in to the US authorities and brought down his group's biggest rival, Ismael \"El Mayo\" Zambada, with him.El Mencho was a clear beneficiary of the vacuum and the dramatic sequence of events in Sinaloa. But, as is so often the case in Mexican drug crime, it was not a crown he wore for long.The government of Mexico's President Claudia Sheinbaum will portray the removal of one of the country's most wanted men as a victory and this will be echoed in Washington. It shows progress on the main issue from which US President Donald Trump has demanded action from Mexico after immigration: fentanyl trafficking.Given the element of US intelligence apparently involved, it also underlines the Sheinbaum administration's willingness to work together with Washington in pursuit of the same goals. She would hope it will be enough to stave off any further talk of the need for unilateral US military action on Mexican soil in the form of drone strikes or boots on the ground – something which some in the Republican Party and in the Trump administration have openly called for.Such discussions are still to come. For the time being, Mexicans are still processing that El Mencho is dead, and in his absence watching cartel members set fires in the streets in cities across the nation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who was El Mencho, Mexico's most wanted man?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1bd9/live/a48edb70-10a5-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-23T03:17:03.000Z",
      "dateModified": "2026-02-23T03:17:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why has Alan Carr bought a castle and where is it?",
    "url": "https://www.bbc.com/news/articles/c8d5ep8r709o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aff2/live/82d18880-10ae-11f1-ae9c-bbdf8b825e1a.jpg",
    "tag": "Trending",
    "date": "2026-02-23T14:00:49.000Z",
    "description": "3 hours agoMegan BonarBBC Scotland NewsBBC/Studio Lambert/Paul ChappellsAlan Carr spent the summer at a Scottish Castle filming Celebrity TraitorsJust",
    "body": "3 hours agoMegan BonarBBC Scotland NewsBBC/Studio Lambert/Paul ChappellsAlan Carr spent the summer at a Scottish Castle filming Celebrity TraitorsJust months after being crowned king of The Celebrity Traitors castle, Alan Carr has set his sights on a real one.The comedian has bought 19th Century Ayton Castle in the Scottish Borders, which has 17 bedrooms and comes with 160 acres of land and its own working railway.His efforts will form the backbone of a new TV series following his attempt to turn the ageing estate into a workable home.Carr said he was in his \"turret-era\" after spending time at Ardross Castle in the Highlands last summer while filming The Celebrity Traitors.GSC GraysCarr has bought Ayton Castle which was built in the 19th Century\"Some men when they have a midlife crisis buy a Lamborghini or grow a ponytail, but me - I want my very own castle,\" he said.\"Since I was a boy in Northampton, I've always dreamt big, and have always been enchanted with the history and romance of a stately home and as I turn 50, I feel it's my time.\"All I want is a turret to call my own - get me over that drawbridge.\"The comedian's journey will be filmed for a new Disney+ programme.The programme has the working title Castle Man in reference to his former Channel 4 talk show Chatty Man.BBC/Studio Lambert/Paul ChappellsCarr's time filming the Traitors is said to have spurred him on to buy his own castleCarr's sprawling new pad was put on the market with an asking price of more than £3.25m last summer. Set in more than 160 acres near Eyemouth, it is one of only two baronial buildings designed by architect James Gillespie Graham.The castle's history stretches back to a medieval tower house, and its interiors were once decorated by Edinburgh firm Bonnar and Carfrae.Their work had an unlikely brush with literary fame: during a visit in 1873, Mark Twain was so taken with the dining‑room mantelpiece at Ayton Castle that he purchased it. It now sits in the Mark Twain House and Museum in Connecticut.Stories you may have missedThe site also includes a rare 16th Century beehive-shaped dovecot and a private chapel.The previous owners, who bought the property in 2014, carried out substantial refurbishment.As part of that, they built a 600m (1,969 ft) narrow‑gauge railway that runs through part of the grounds, which visitors to the castle can pay to ride.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why has Alan Carr bought a castle and where is it?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aff2/live/82d18880-10ae-11f1-ae9c-bbdf8b825e1a.jpg"
      ],
      "datePublished": "2026-02-23T14:00:49.000Z",
      "dateModified": "2026-02-23T14:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man killed after entering secure perimeter of Trump's Mar-a-Lago residence, Secret Service says",
    "url": "https://www.bbc.com/news/articles/cp32l9w9pgyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a550/live/c7902e10-1002-11f1-909d-47e99fcb7a58.jpg",
    "tag": "Trending",
    "date": "2026-02-23T13:32:01.000Z",
    "description": "3 hours agoGeorge WrightGetty ImagesAn armed man has been shot dead after entering the secure perimeter of US President Donald Trump's Mar-a-Lago resi",
    "body": "3 hours agoGeorge WrightGetty ImagesAn armed man has been shot dead after entering the secure perimeter of US President Donald Trump's Mar-a-Lago residence in Florida, the Secret Service has said.The man was carrying a shotgun and fuel can when he was stopped and shot by Secret Service agents and a Sheriff's deputy, authorities said.The incident happened around 01:30 ET (06:30 GMT) on Sunday morning, when the president was in Washington DC. The suspect has been named as 21-year-old Austin T Martin of Cameron, North Carolina, according to the BBC's US partner CBS.His family in North Carolina had reported him missing in the early hours of Sunday morning, the Moore County Sheriff's Office said in a statement to the BBC. The missing persons information has since been turned over to federal authorities, the sheriff's office said.They added that the department had no record of prior history concerning Martin and that it was not involved in the Florida investigation.Officials are looking into whether he bought the gun along the driving route he took from North Carolina to Florida, according to CBS.US Secret Service agents fired at him after they saw him \"unlawfully entering the secure perimeter at Mar-a-Lago early this morning\", agency spokesman Anthony Guglielmi posted on X on Sunday.The suspect \"was observed by the north gate of the Mar-a-Lago property carrying what appeared to be a shotgun and a fuel can\", the agency said in a statement.The man was then shot after refusing orders, Palm Beach County Sheriff Ric Bradshaw said.\"The only words that we said to him was 'drop the items', which means the gas can and the shotgun,\" Bradshaw told a news conference. \"At which time he put down the gas can, raised the shotgun to a shooting position,\" he said. At that point, agents fired their weapons to \"neutralise the threat\", Bradshaw added.The officers were wearing body cameras and no law enforcement officers were injured, he said.Bradshaw said that he did not know whether the suspect's gun was loaded, saying that will form part of an investigation the FBI will be assisting with.US Secret Service Director Sean Curran travelled to Florida on Sunday for \"after-actions\" and had \"reinvigorated operational communication and agency response to critical incidents\", the agency said in a post on X. Security at Mar-a-Lago is extremely tight, with an outer cordon of local Palm Beach sheriffs and an inner one maintained by the Secret Service. Visitors are searched, and cars and bags are swept by dogs and metal detectors.FacebookThe suspect had been reported missing by relatives, according to CBSThose who knew Martin expressed their shock in interviews with US media. Braeden Fields, his cousin, told AP News that Martin was \"a good kid\" who worked at a golf course and did not know how to use a gun. \"I wouldn't believe he would do something like this. It's mind-blowing,\" he told the outlet. Fields described the family as \"big Trump supporters\", but that his cousin did not discuss politics.Other US media including the Miami Herald said Martin had not declared a party affiliation.One of Martin's friends, Dustin Rollins, 20, told the New York Times that the man was \"probably one of the kinder souls that I've actually ever met\", and that he had struggled with the death of his sister three years earlier.The suspect was reportedly also an enthusiastic artist who specialised in illustrating scenes of golf courses.Trump has been the target of several assassination plots or attempts.In July 2024, Trump was shot in the ear as he stood in front of crowds in Butler, Pennsylvania. One bystander was killed and two were injured in the shooting. The gunman, 20-year-old Matthew Crooks, was immediately shot and killed by security forces and his motive remains unknown.Months later, a Secret Service agent spotted a rifle sticking out of bushes at Trump International Golf Club in West Palm Beach. The man, later identified as Ryan Routh, fled but was caught. The 59-year-old was sentenced to life in prison earlier this month for attempting to assassinate the president.During an appearance on Fox Business after the fatal incident, Treasury Secretary Scott Bessent accused the political left of \"normalising\" political violence,  citing the two attempts on Trump's life in 2024,\"Two would-be assassins dead, one in jail for life, and this venom coming from the other side,\" Bessent said, adding: \"They are normalising this violence. It's got to stop.\"Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man killed after entering secure perimeter of Trump's Mar-a-Lago residence, Secret Service says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a550/live/c7902e10-1002-11f1-909d-47e99fcb7a58.jpg"
      ],
      "datePublished": "2026-02-23T13:32:01.000Z",
      "dateModified": "2026-02-23T13:32:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'I put my bike up for sale - it went from St Andrews to Kenya'",
    "url": "https://www.bbc.com/news/articles/c795eexrv34o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d77e/live/06e51be0-0fed-11f1-bf92-afe9c11d7573.jpg",
    "tag": "Trending",
    "date": "2026-02-23T06:08:05.000Z",
    "description": "11 hours agoJonathan GeddesBBC Scotland NewsAlice Miring'uAlice Miring'u of Kenya's national paracycling team has gratefully received the tandem bike ",
    "body": "11 hours agoJonathan GeddesBBC Scotland NewsAlice Miring'uAlice Miring'u of Kenya's national paracycling team has gratefully received the tandem bike When Dr Carrie Ruxton posted on social media asking if anyone wanted her old tandem bike, she thought there might be some local interest.But the St Andrews gym owner was taken aback when a message came in from the national paracycling team of Kenya.Suitable bikes for blind cyclists and their pilots are hard to find in the African country, and one of the cycling team had spotted Carrie's post.After months of sorting the logistics out, the bike safely arrived in Nairobi last week, where it could now feature in international competition. Stories you may have missedThe bike had originally been used by Carrie for her daughter Erin, who then outgrew it and got her own bike.Last year she uploaded a post to Facebook, putting the bike up for sale. After little interest she then said the bike was free to a good home and could be collected from Cupar in Fife.Among the expressions of interest that followed was a post from Alice Miring'u, a prominent Kenyan cyclist.She wrote: \"currently searching for tandem bike for racing am in paracycling team and have no tandem bike. It can be of great help to me.\" Carrie RuxtonCarrie Ruxton was glad to send her bike off to KenyaAlthough initially taken aback, Carrie soon decided that she would try and help, even if collecting the bike from her home was obviously no longer an option.She told BBC Scotland News: \"I had got a few replies, but I just thought what a wonderful idea.\"In Kenya they don't make tandem bikes, so they have to be donated.\"Alice cycles as a pilot for cyclists with impaired sight, and I thought it would be good to help if we could get the bike there.\"The duo were able to find a Kenyan based in Glasgow, who sent containers with items back to his homeland. He collected the bike to be included in his next shipment.Carrie added: \"With the distance you do wonder if it'll actually get there. \"But out of the blue I got a message last weekend saying it had arrived on Valentine's Day.\"The bike will now be made suitable for racing, with upgraded components, and then tested on the track later this year.Ironically, Kenya are competing at the Commonwealth Games in Glasgow this summer.But the work the bike needs means it is unlikely to be heading back to Scotland.In the meantime it has been fittingly named Valentine by its new owners.Carrie said: \"I tied a tartan ribbon around it before it was shipped away.  \"It was a wonderful feeling to see Alice smiling away with the bike next to her.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'I put my bike up for sale - it went from St Andrews to Kenya'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d77e/live/06e51be0-0fed-11f1-bf92-afe9c11d7573.jpg"
      ],
      "datePublished": "2026-02-23T06:08:05.000Z",
      "dateModified": "2026-02-23T06:08:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]