[
  {
    "title": "Best sports photos of 2025: The stories behind the images",
    "url": "https://www.bbc.com/sport/articles/cly5xnln575o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f46/live/ea9f8470-d298-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-25T10:38:03.000Z",
    "description": "Great journalism without brilliant photography is like Christmas dinner without roast potatoes.Getty Images' team of award-winning photographers cover",
    "body": "Great journalism without brilliant photography is like Christmas dinner without roast potatoes.Getty Images' team of award-winning photographers covered more than 50,000 sports events in 2025, from grassroots tournaments watched by a few dozen fans to World Cups seen by millions around the globe.BBC Sport brings you the best sports photos of the past 12 months - and the photographers explain the stories behind them.Ever wondered how you get a picture at the top of the pole vault? What is a 'star filter'? And how much does luck play a part in capturing amazing images?There's a bonus point if you can spot the photographer in their own photo...Image source, Getty ImagesChristian Petersen: It was an honour to be part of the World Athletics Championship in Tokyo, where I set out to capture unique images and fresh perspectives. Noah Lyles' signature pre-race vertical leap inspired me to shoot from high above and behind, creating a new view that highlighted the graphic lines of the track. I was very happy with the result.Image source, Getty ImagesAdam Pretty: I took this picture at the relatively new Surftown wave pool in Munich, where some elite French Polynesian surfers had booked private training sessions. Athletes use the pool to focus on training specific manoeuvres and aerials on the perfectly consistent man-made wave.I photographed Aelan Vaast, the sister of 2024 Olympic surfing gold medallist Kauli Vaast, as she performed a layback hack on the final section of the wave. The image was shot in the early morning before the sun was up. I used a flash to create the silhouette of her against the bright blue water of the pool and the spray she was throwing with her massive turn.Image source, World Rugby/Getty ImagesMolly Darlington: I took this photo after the Women's Rugby World Cup final in the winners' studio, when the emotions were high and the players were super excited. It is my favourite photo I took from the tournament. Zoe Aldcroft and head coach John Mitchell are a perfect combination, summing up what it feels like to win the World Cup. What you can't see in the picture is all the players and staff who piled into the dressing room, throwing confetti and streamers and cheering them on. It was a special moment.Image source, Getty ImagesMahmoud Khaled: I am always searching for grassroots football tournaments in Egypt's villages and working-class neighbourhoods, where spontaneity meets pure passion. The Al-Qudah tournament in Sharqia was one of the most impressively organised I have seen, almost like a professional league match: huge crowds, co-ordinated team entrances, players from the lower divisions, and even referees who officiate in the Egyptian Premier League.What I love most is the journey itself, from discovering the story to reaching the place. The real reward comes afterward, seeing the joy on people's faces when they see their photos published.This frame was taken during the final, capturing the moment a player from Al-Ghaba takes a penalty in the shootout after a 2–2 draw. Al-Numan eventually lifted the trophy.Image source, Getty ImagesPool photo: The image - taken during the most exciting competition of the World Athletics Championships - illustrates Sweden's superstar Armand Duplantis' dominance in the pole vault final.A tiny camera, no bigger than a pack of cards, was mounted next to the support for the bar, and a customised technical solution allowed the photographer to trigger it remotely and receive the frame live on his laptop within seconds.Duplantis cleared 6.30m in this competition, broke the world record for the 14th time and secured his third world title. It is an exceptional achievement by the athlete and a fantastic piece of work by the photographer to capture the very best at the peak of the action.Matthias Hangst, Getty Images director of contentImage source, International Skating Union/Getty ImagesDean Mouhtaropoulos: Living in the Netherlands, I am lucky to cover speed skating, one of our national sports, although most of it is indoors.This event was near the Dolomites in Italy. Shooting such dynamic and talented athletes in an outdoor setting is a photographer's dream. A nearby building cast an afternoon shadow over the track. Once I spotted it, I quickly ran up the stand, hoping the clouds would not reappear. Some fans watching, plus my shadow, left a nice shape on the ice, leaving me to wait for the skaters to enter the frame.Image source, Getty ImagesEmilee Chinn: Geordie Beamish is shown going down after getting caught in the congestion of the early laps of the 3,000m steeplechase at the World Championships.Along with capturing the split second another runner's foot connected with his face during the fall, what makes this image so powerful and moving to me is that Beamish got up, finished second in the heat, and went on to win the gold medal. Moments like this are what make sports photography so rewarding, reminding us how resilience can turn a setback into something remarkable.Image source, Velo/Getty ImagesDario Belingheri: An unusual moment through the Tuscan hills during the one-day race Strade Bianche, where the gravel sectors and dust are its distinctive beauty. I was a bit lucky to catch the right moment when a train passes next to the peloton in a cloud of dust, so it is perfectly blended with nature.Image source, Getty ImagesCameron Spencer: As the northern hemisphere works through winter, we are fortunate in Australia to start the year with a major international event in the middle of our summer, the Australian Open in Melbourne.In this image, Holger Rune is stretching full length to play a forehand against Zhizhen Zhang. I captured it from an elevated position high above the court in a 'catwalk'. Taking a step back, I was able to shoot through the ceiling rafters. These, combined with the harsh shadows cast by the roofline, created an opportunity to capture an interesting shape on the bright blue court, then I waited patiently for Rune to play a dynamic shot behind the baseline.Image source, Getty ImagesMichael Reaves: This photo was taken during a Major League Baseball game between the Pittsburgh Pirates and the Chicago Cubs at Wrigley Field. Often in sports photography you can plan for the big moments and control factors with light, moment and composition, but other times luck comes into play. This is one of those moments.While shooting a mundane at-bat, Henry Davis broke his bat. Usually broken bats explode forward and out of frame, but this one broke on a centre point and created a unique image with the ball still in frame and the split bat floating in time, almost comically.Image source, Getty ImagesMatthias Hangst: This photograph was taken during the European Artistic Gymnastics Championships in Leipzig. The event was held at the Leipziger Messe, a very functional trade-fair complex and not always the most visually appealing setting. The roof structure was full of steel construction elements with plenty of light reflections, creating a rather distracting background.To work around this, I decided to use a 'star filter' - a layer of glass attached to the front of the lens that refracts light in a specific way. It adds a touch of elegance and helps highlight the dynamics of Sweden's Maya Staahl during her beam routine.Image source, Getty ImagesYong Teck Lim: Photo positions at the World Para Swimming Championships in Singapore were fixed, making it hard to get creative. Still, China's Jincheng Guo was impossible to overlook - competing without goggles, cap and tech suit, and throwing in his trademark bubble technique for good measure.For the first three days he swam only 50m events, leaving me little to capture. On day four the 200m individual medley finally gave me an opening. I went in tight, hoping to catch that bubble magic, and managed this single frame that looks like a UFO. His gold-medal finish made the shot even sweeter.Image source, Uefa/Getty ImagesMaja Hitij: Trophy-lift photos may look simple, but they require a bit of planning. Agencies and photographers divide responsibilities and co-ordinate positions in advance because the entire moment lasts only a few seconds.I wanted to find a different angle after the Champions League final - not the usual spot in front. I tried moving farther back, but the field was crowded with security, TV crews and players, so I settled on a position slightly further to the right, away from most photographers. I got lucky - the confetti was released earlier than expected, covering the whole background as the Paris St-Germain players turned toward Marquinhos.Image source, Getty ImagesJudit Cartiel: During the second half of the La Liga match at Espanyol, Atletico Madrid's Giuliano Simeone started a run down the wing. While following the play from the corner with my camera, I saw Simeone approaching the assistant referee. He collided with him and I quickly decided to keep the focus on the official. I was looking to capture a moment that was unusual in football, where the player usually takes the spotlight.The image shows the assistant completely upside down in an acrobatic posture, with a funny expression on his face, creating a photograph with a comical tone.Image source, Getty ImagesChristian Petersen: Covering alpine skiing is one of the most challenging and rewarding assignments for me. I am always searching for graphic elements to complement the intense action. Slalom's bright gates against the white snow create a striking visual canvas. This image, taken at the Ski World Cup Finals in Idaho, captures that perfectly, blending the racer's motion with a sweep of vivid colour.Image source, Getty ImagesAl Bello: This was an undercard fight before the main event. I like to shoot the undercards because I can try to take more chances with my photo technique. In this case I was shooting tighter than usual, hoping to catch a punch landing. The risk of shooting so tight is that if there is a knockdown you will likely miss the picture. I timed the punch at the exact moment, freezing the full force of the impact on the face.Image source, Getty ImagesHannah Peters: I had been looking forward to the Crankworx mountain biking festival in Rotorua, New Zealand, because it often makes good pictures, but was disappointed when I set off early that morning to clouds and no light.After about 30 minutes' walking and finding a good spot for the warm-up rounds, the sun suddenly broke through for about five minutes. There was only time for two riders to make their runs, so it was a bit of good fortune that Tim Bringer managed to pull off a pretty awesome trick.Image source, Getty ImagesStu Forster: This is the most exciting England cricket team to photograph in my career, with players like Jamie Smith at the forefront. You cannot take your eyes off it for a single ball. Here, Smith shows off his footballing skills to stop the ball from ricocheting on to the stumps during the Lord's Test. It was before this match that I read that the young Smith had been coached in his youth by Matt Holmes, formerly the cricket photography editor at Getty Images. It's a small world.Image source, Getty ImagesAdam Pretty: I have been trying to photograph water polo from the beginning of my sports photography career in 1998, as it has the potential for some amazing images. But it is so difficult to capture them because of the nature of the sport and the unpredictability of the water - the splashes and speed at which the drama happens.This image was extremely fortunate as the timing had to be perfect. I was not in control of anything apart from my camera, which was in an underwater robotic housing at the bottom of the pool. I had to rely on the match beginning at the perfect time, and the athlete diving in just the right way to pass through a tiny pocket of light.Fortunately, everything came together to create the image, and that is what I love about sports photography - it takes a number of elements or layers to create a memorable image.Image source, McKlein Photography/LAT ImagesTom Banks/McKlein Photography: Viera do Minho, a stage of Rally Portugal, features undulating roads and landscape scattered with large, round granite boulders.Having never shot this area myself, we hitched a ride up the mountainside to a remote stretch with the local 4x4 club - an experience in itself. After scouting various vantage points I settled in the valley and awaited the cars. As Adrien Fourmaux blasted into view, the fans delivered a perfectly timed wave of the Portuguese flag - complemented by the arrival of the low-flying TV helicopter.It is one of those moments when everything aligns.Image source, Getty ImagesShi Tang: This image captures a dynamic Tomoka Miyazaki of Japan mid-motion, rendered with a long-exposure effect that transforms her movement into flowing streaks of red light. The blurred trails emphasise the power and fluidity of the action, while the sharpness of her focused expression adds contrast and intensity. Set against a dark background, the vibrant colours and sweeping motion create an almost abstract, dance-like composition.Image source, Getty ImagesDean Mouhtaropoulos: Photographing the best athletes at the height of their powers is one of the many joys of my job. Covering the men's javelin F46 final at the World Para Athletics Championships in New Delhi, I noticed Guillermo Varona Gonzalez with a different pre-throw routine than most. Positioning myself low on the ground before his run-up, he would leap and double click his heels.The power in this leap would be enough to make a strong image, but the red clothing, impressive physique, javelin in hand and black sky all combined to made one of my favourite images of the year.Image source, Sportsfile/Getty ImagesSeb Daly/Sportsfile: For the uninitiated, this is hurling - an Irish sport that is incredibly fast, very skilful and, as this image shows, highly physical. These two players are merely getting to know each other at the start of the match - a little \"pulling and dragging\", as the locals might say, in an effort to throw an opponent off their game, to get into their head, assert a little dominance.All while this is going on, there is also a match to capture. It is a busy, raw, unique, and fantastic spectacle.Image source, Getty ImagesMichael Reaves: This photo was taken during game one of baseball's National League Division Series in Milwaukee. I was excited when they announced the mid-afternoon game time and was hoping the weather would hold off so the roof would stay open. The sun peaked for an inning while Aaron Ashby pitched and, from my position in the first base well, I was able to make a wide frame. I exposed for the highlights and let the shadows of the stadium create a compositionally pleasing frame as he delivered a pitch.Image source, PGA of America/Getty ImagesMaddie Meyer: In professional sports there is often such a distance between fans and athletes. It can feel sterile and as a photographer it can be hard to bring the atmosphere of the crowd and an athlete into one frame. Here Rory McIlroy ran to the adoring Europe fans after his team's win over the USA in the Ryder Cup in New York.He appeared to fully give in to the moment, allowing the fans to embrace him over the barricade. As a photographer it can be challenging to make a well composed image in a chaotic scene, but I like this picture and think it tells the story of Europe's triumph on away territory.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best sports photos of 2025: The stories behind the images",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f46/live/ea9f8470-d298-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-25T10:38:03.000Z",
      "dateModified": "2025-12-25T10:38:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Making of Do They Know It’s Christmas?",
    "url": "https://www.bbc.co.uk/iplayer/episode/m0025gmy/the-making-of-do-they-know-its-christmas?at_mid=Ic6fsbnoVI&at_campaign=The_Making_of_Do_They_Know_Its_Christmas&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0025gmy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Making_of_Do_They_Know_Its_Christmas&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0k68msg.jpg",
    "tag": "Trending",
    "date": "2025-12-06T01:05:46.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeThe Making of Do They Know It’s Christmas?The Making of Do They Know It’s Christmas?Contains some strong language.Forty years on from the release of the hit single by charity supergroup Band Aid, this documentary unearths 75 minutes of rare and previously unseen film footage from the day of recording. Duration1h 14mFirst shown25 Nov 2024Available for 10 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingWhen Blondie Came to BritainTouched by their presence. The story of Blondie featuring the late Clem Burke59 minsBanned in the 80s: Moments That Shook MusicThe sound of rebellion. From N.W.A to Madonna, the controversial hits that made history55 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSounds of the SixtiesFeaturing vintage performances from Tom Jones, the Kinks and the Moody Blues.9 minsThe 80s - Music’s Greatest Decade?Beyond the power ballads. Dylan Jones champions a creative and innovative decade in popThe Story of Fairytale of New YorkUncovering the stories behind The Pogues Christmas classic, Fairytale of New York.56 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsWhat We Were WatchingGrace Dent sets the remote for 1995 to embark on a televisual trip back in time.59 minsReclaiming AmyHer life, loves and legacy. Amy Winehouse’s family remember her incredible talent58 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Making of Do They Know It’s Christmas?",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0k68msg.jpg"
      ],
      "datePublished": "2025-12-06T01:05:46.000Z",
      "dateModified": "2025-12-06T01:05:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mqch0p?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-24T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·52 minsThe Newscast Review of the Year 2025NewscastAvailable for over a yearAdam, Chris, Laura and Paddy go through the biggest stories of 2025 with the help of economics editor Faisal Islam and international editor Jeremy Bowen.\nThey also reveal what it was like to be on the inside as they happened, and discuss how Keir Starmer will reflect on his first full year as prime minister, how Donald Trump's tariffs reshaped the world's economy, and how a ceasefire between Israel and Hamas was reached.\nAnd we look at where the rise of Nigel Farage’s Reform UK and Zack Polanski’s Green Party have left politics in the UK.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming, Chris Mason, Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-24T12:00:00.000Z",
      "dateModified": "2025-12-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
    "url": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg",
    "tag": "Trending",
    "date": "2025-12-25T10:19:28.000Z",
    "description": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the ",
    "body": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the so-called Islamic State group.Mass raids were carried out at 124 addresses across Istanbul, the city's chief prosecutor said, with firearms, ammunition and \"organisational documents\" seized.Officials said IS supporters had been actively planning attacks across Turkey this week, particularly against non-Muslims. Police detained 115 suspects but efforts are ongoing to trace a further 22, an official statement read.The prosecutor's office said the suspects were in contact with IS operatives outside Turkey. The announcement comes two days after Turkish intelligence agents carried out a raid against the group on the Afghanistan-Pakistan border.A Turkish national who is alleged to have held a senior role with the IS wing operating in the region was detained and accused of planning attacks against civilians. Turkey's security services regularly target people with suspected links to IS.The country shares a 900km (560 mile) border with Syria, where the group continues to operate in parts of the country.Syria's president Ahmed al-Sharaa, who has close ties to the Turkish government, has vowed to work with the US and Europe to root out surviving elements of IS. The US launched a wave of air strikes against the group's positions across Syria on Friday in response to the killing of three Americans.Two US soldiers and a civilian interpreter were killed by IS gunmen during an ambush earlier this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg"
      ],
      "datePublished": "2025-12-25T10:19:28.000Z",
      "dateModified": "2025-12-25T10:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jingle bills: Arkansas Powerball player strikes $1.8bn jackpot on Christmas Eve",
    "url": "https://www.bbc.com/news/articles/cwyw4x39jdwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/704a/live/44cf86f0-e1a5-11f0-b650-ab4669d57967.jpg",
    "tag": "Trending",
    "date": "2025-12-25T15:55:36.000Z",
    "description": "A Powerball player in Arkansas won a whopping $1.817bn (£1.34bn) jackpot in a Christmas Eve drawing, making it the second-largest lottery prize ever c",
    "body": "A Powerball player in Arkansas won a whopping $1.817bn (£1.34bn) jackpot in a Christmas Eve drawing, making it the second-largest lottery prize ever claimed.The single winning ticket matched all six numbers  - 4, 25, 31, 52, 59 and red Powerball 19 - giving the winner the option of taking a lump-sum cash payment of  $834.9m.This marks only the second time a Powerball jackpot has been won by a ticket sold in Arkansas, according to the lottery operator. Powerball did not identify the winner.The largest single-ticket prize remains the $2.04bn jackpot won in 2022 by a player in Altadena, California.In order to win the jackpot, a lottery ticket holder must match all five white balls and the red Powerball selected during a drawing.Tickets for the lottery cost $2 each - and the odds of winning the jackpot are 1 in 292.2 million, according to game organisers. A winner has an option to choose a lump-sum payment or receive the full amount in an annuity paid over 29 years, but most winners opt for the upfront cash option.The game, which began in 1992, is played in 45 of the 50 US states, the capital city of Washington, and in the US territories of Puerto Rico and the Virgin Islands.The winnings are subject to federal taxes of between 24% and 37%, and, in most cases, state taxes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jingle bills: Arkansas Powerball player strikes $1.8bn jackpot on Christmas Eve",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/704a/live/44cf86f0-e1a5-11f0-b650-ab4669d57967.jpg"
      ],
      "datePublished": "2025-12-25T15:55:36.000Z",
      "dateModified": "2025-12-25T15:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
    "url": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/44c5/live/6d80ba30-e1ad-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T16:21:18.000Z",
    "description": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Pet",
    "body": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Peter's square.He called for an end to conflicts around the world during his Urbi et Orbi address, which is traditionally delivered by the pontiff on Christmas Day to worshippers gathered in Vatican City. Speaking about Ukraine, the Pope said: \"May the clamour of weapons cease, and may the parties involved, with the support and commitment of the international community, find the courage to engage in sincere, direct and respectful dialogue.\"His plea comes as US-led negotiations on a deal to end the fighting continues. The US has sought to put together an agreement acceptable to both sides, but direct talks between Russian and Ukraine have not taken place during this latest round of diplomatic efforts.Pope Leo also decried turmoil and conflict plaguing other parts of the world, including Thailand and Cambodia where deadly border clashes have flared up despite a ceasefire in July.He asked that the South East Asian nations' \"ancient friendship\" be restored and \"to work towards reconciliation and peace\".During an earlier Christmas Day sermon in St Peter's Basilica, Pope Leo lamented conditions for homeless people the world over, and the damage caused by conflicts.\"Fragile is the flesh of defenceless populations, tried by so many wars, ongoing or concluded, leaving behind rubble and open wounds,\" he said.He said the story of the birth of Jesus showed that God had \"pitched his fragile tent\" among the people of the world. \"How, then,\" he asked, turning his attention to the conditions of Palestinians, \"can we not think of the tents in Gaza, exposed for weeks to rain, wind and cold?\"Gaza has been devastated by Israeli bombardment in a two-year war, triggered by Hamas's attack on Israel on 7 October 2023.Winter storms have compounded the plight of the territory's 2.1m population, nearly all of whom have been displaced and their homes damaged or destroyed.Aid agencies have called for Israel to allow more tents and urgently needed supplies into Gaza. Cogat, the Israeli military body which controls Gaza's border crossings, has dismissed claims of deliberate aid restrictions, saying almost 310,000 tents and tarpaulins had been delivered since the start of the ceasefire in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/44c5/live/6d80ba30-e1ad-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-25T16:21:18.000Z",
      "dateModified": "2025-12-25T16:21:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
    "url": "https://www.bbc.com/news/articles/ce8n1l5vd5xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8f1e/live/96ba18e0-dff7-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-25T00:30:11.000Z",
    "description": "20 hours agoIn the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to ",
    "body": "20 hours agoIn the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to the White House, and actress Millie Bobby Brown hit back at \"bullying\" journalists.But how much attention did you pay to what else happened in the world?Test your memory of January to March in part one of our four-part Christmas quiz - 52 questions for 52 weeks of the year. Quiz compiled by Ben Fell.Fancy some more? Have a go at something from the archives.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8f1e/live/96ba18e0-dff7-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-25T00:30:11.000Z",
      "dateModified": "2025-12-25T00:30:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Front-runner to be Bangladesh PM returns after 17 years in exile",
    "url": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg",
    "tag": "Trending",
    "date": "2025-12-25T06:44:21.000Z",
    "description": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark ge",
    "body": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark general elections.The 60-year-old is the figurehead of the influential Zia family and the son of former prime minister Khaleda Zia. The party he leads, the Bangladesh Nationalist Party (BNP), is eyeing a return to power when Bangladesh goes to the polls in the new year.Rahman, who has lived in London since 2008, is expected to become the country's new leader if the BNP emerges as the largest party. Rahman's return comes in the wake of former Prime Minister Sheikh Hasina being ousted last year.He had been the subject of various criminal investigations launched while her Awami League party was in power but was cleared of all charges when her regime fell. Hasina is living in exile in India and her party is unlikely to be permitted to take part in the elections, which many view as among the most consequential in Bangladesh's history.Last month, Hasina was sentenced to death for her role in suppressing anti-government protests. According to UN investigators, up to 1,400 people died in the student-led unrest.Hasina, who was put on trial in absentia, has denied committing crimes against humanity. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Front-runner to be Bangladesh PM returns after 17 years in exile",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg"
      ],
      "datePublished": "2025-12-25T06:44:21.000Z",
      "dateModified": "2025-12-25T06:44:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League footballers: What are they eating at Christmas? ",
    "url": "https://www.bbc.com/news/articles/c989005xj32o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f32f/live/543ddae0-e0f3-11f0-a016-cd64476883b3.jpg",
    "tag": "Trending",
    "date": "2025-12-25T01:04:51.000Z",
    "description": "What are professional footballers tucking into at Christmas? 19 hours agoSrosh KhanandNaomi de Souza,BBC NewsbeatHandoutTommy Cole works with nutritio",
    "body": "What are professional footballers tucking into at Christmas? 19 hours agoSrosh KhanandNaomi de Souza,BBC NewsbeatHandoutTommy Cole works with nutritionists at football clubs to make sure players get the most out of their mealsMany of us have been waiting all year to tuck into our favourite festive treats.Christmas dinner can look very different for each household - but for professional footballers, it is still a time to stay focused on fitness and recovery for matches.Private chef Tommy Cole whips up meals for Premier League players from major clubs - including Fulham, Chelsea and Brighton - all year round. When it comes to the main Christmas meal, he takes a traditional approach, but makes it \"a little boujee-r\" and healthier. \"With roast potatoes, for example, it's just being careful not to roast them in a crazy amount of fat, whilst still trying to make them nice and crispy,\" he tells BBC Newsbeat.\"Also things like your fillings, again, just being careful with the amount of fat that you're cooking them in.\" Getty ImagesProfessional footballers have still got to stay focused on their fitness at Christmas HandoutHe also tries to stick to slightly leaner cuts of meat.\"Turkey's very popular at Christmas so we would use the breast and not quite so much of the dark meat, which tends to be a bit fattier, and then just try and get plenty of veggies,\" the 33-year-old explains.Tommy works with nutritionists at the footballers' clubs to make sure they get the most out of their meals.\"We communicate with the players themselves and get their likes, dislikes,\" he says.\"Then we basically build a menu around that information and try and feed them some really tasty food.\"HandoutThe Christmas period is a particularly busy time for some of his football clients, so he's got to ensure they're getting the fuel they need to stay at the top of their game.\"The guys that are playing games, especially around Christmas, we'll see the fixtures are a bit more frequent,\" he says. December is notoriously busy for major clubs, with additional Premier League matches, extra European fixtures and cup competitions like the Carabao Cup and FA Cup.Clubs like Chelsea and Arsenal are going to be playing more than 15 matches in December and January. HandoutTommy started his chef journey eight years agoHandoutThe relentless football fixtures have been long spoken about by players and managers, who have complained about injuries and the short turnaround between matches.Due to the increased schedule, Tommy says they will need to be eating more carbohydrates to keep up their energy. \"So more potatoes, pasta, that sort of thing. We're just increasing those in their meals,\" he says.He will also try to get plenty of vegetables in to their diets for added nutrients, and for those who aren't the biggest fan, he has some tricks to sneak them in.  \"We might make some kind of sauces with vegetables,\" he says. \"So quite a popular and tasty one is making a katsu sauce.\"I make the base of the sauce with carrots, onions, garlic, that sort of thing.\"When it comes to helping players' recovery, oily fish, nuts and seeds are top of the menu. HandoutThe chef will try to add plenty of vegetables for added nutrientsHandoutTommy admits he didn't initally plan to get into the culinary worldTommy's cooking videos have racked up millions of views on TikTok, fuelled by a mix of curiosity and fascination into the diets of professional players.The mystery behind who is he catering for also draws people in - but he tells Newsbeat he is keeping that secret to himself.He is part of a growing industry dedicated to cooking high-end dinners for the rich and famous.But Tommy admits he didn't initially plan to get into the culinary world.  \"It never was a real big sort of dream or aspiration to be a chef,\" he says.\"I got into it because I went on a ski season, I just wanted to have a good time and then ended up cooking through that.\"HandoutAfter catching the cooking bug, he trained as a chef. Through his work at luxury chalets and hotels, he cooked for several celebrities and Premier League players, and one thing led to another. But over his eight years as a chef, Tommy has had some strange requests.\"I have had people request just frankfurters,\" he says. \"Which is the most average thing.\"Obviously you give the players what they want, but it's nice to do slightly fancier stuff.\"Matches being played on Boxing Day is a long-standing tradition in English football, but this year only one will be played in the Premier League.For Boxing Day, Tommy leans into tradition: \"It's just going to be bubble and squeak, lots of veggies in there, that good stuff.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League footballers: What are they eating at Christmas? ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f32f/live/543ddae0-e0f3-11f0-a016-cd64476883b3.jpg"
      ],
      "datePublished": "2025-12-25T01:04:51.000Z",
      "dateModified": "2025-12-25T01:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pat Finn, US actor in TV shows Friends and The Middle, dies at 60",
    "url": "https://www.bbc.com/news/articles/c4g5qy80m2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/11ba/live/368d6660-e138-11f0-ba03-b3dff450825b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T04:14:39.000Z",
    "description": "16 hours agoHarry SekulichGetty ImagesPat Finn starred in the popular TV show The MiddleUS actor Pat Finn, who appeared in popular TV shows including ",
    "body": "16 hours agoHarry SekulichGetty ImagesPat Finn starred in the popular TV show The MiddleUS actor Pat Finn, who appeared in popular TV shows including Friends, Seinfeld and The Middle, has died aged 60.The comedy and improvisation performer died at home in Los Angeles on Monday having undergone treatment for cancer since 2022, US media reported. \"Pat never met a stranger - only friends he didn't know yet,\" his family said in a statement posted on social media.He had \"lived his life fully - with joy and exuberance\", the statement added.Finn's first television role was on the George Wendt Show in 1995, where he appeared as the titular character's brother. He also had a recurring role on Murphy Brown between 1995 and 1997.He starred as Joe Mayo in Seinfeld in 1998, playing a party host known to delegate burdensome jobs to his guests.He made guest appearances on popular shows throughout the late 1990s and early 2000s, including on the King of Queens, Friends, That '70s Show, and House. Finn was perhaps best known for his role as Bill Norwood in The Middle, featuring across eight seasons between 2011 and 2018.His film credits include It's Complicated (2009) and Santa Paws 2: The Santa Pups (2012).Getty ImagesPat Finn appeared in two episodes of Friends as Monica Geller's partner Dr RogerBeyond his on-screen roles, Finn was an improv performer and also taught at the University of Colorado, where he was an adjunct professor. He was part of an six-person improv troupe called Beer Shark Mice.\"Pat coached, befriended and mentored countless students throughout the years and you'd be hard-pressed to find anyone anywhere who has an unkind word to say about him,\" his family wrote.In a tribute to Finn, fellow actor Richard Kind said there was \"no kinder, gentler, funnier, down to earth person you could encounter\".\"Always positive, helping you be funnier and better. A great dad, a great guy,\" Kind wrote on Instagram.Finn is survived by his wife Donna, three children, and his parents and siblings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pat Finn, US actor in TV shows Friends and The Middle, dies at 60",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/11ba/live/368d6660-e138-11f0-ba03-b3dff450825b.jpg"
      ],
      "datePublished": "2025-12-25T04:14:39.000Z",
      "dateModified": "2025-12-25T04:14:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two men still missing after Budleigh Salterton Christmas swim",
    "url": "https://www.bbc.com/news/articles/c4g41v0dekgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a9f4/live/1dff0fe0-e1c4-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T19:52:39.000Z",
    "description": "Two men still missing after Christmas swim as coastguard calls off search18 minutes agoArchie FarmerDevonVideo shows sea conditions on Devon coastTwo ",
    "body": "Two men still missing after Christmas swim as coastguard calls off search18 minutes agoArchie FarmerDevonVideo shows sea conditions on Devon coastTwo men are believed to be missing off the Devon coast after reports of swimmers in difficulty, police have said.Devon and Cornwall Police were called at 10:25 GMT to the beach at Budleigh Salterton after concern was raised for people in the water, prompting a significant emergency response which was called off at 17:00.A number of people were safely brought back to shore and were checked either by paramedics at the scene or taken to hospital as a precaution, the force confirmed.It said the men - one aged in their 40s and the other in their 60s - were not located during the search and remained missing, with their families having been informed of the developments.\"A significant amount of emergency service personnel were deployed to the incident and we ask that people do not enter the water for public safety reasons,\" the force added in a statement.The Maritime and Coastguard Agency said Exmouth and Beer Coastguard Rescue Teams, RNLI lifeboats from Exmouth, Teignmouth and Torbay, plus coastguard search and rescue helicopters and fixed wing aircraft were sent to the scene to assist, alongside police and ambulance service.\"Searches have continued throughout the day to find two men believed to still be in the water. After extensive shoreline and offshore searches, the coastguard part of the search was stood down at 5pm,\" it added.Police had urged members of the public not to enter the water along this stretch of coast and asked people not to participate in a Christmas Day swim at Exmouth while emergency services responded to the incident at Budleigh Salterton.On Wednesday, organisers of some Christmas and Boxing Day swims in Devon and Cornwall postponed or cancelled events due to a yellow weather warning for wind.Hundreds of people were either on the beach or in the water on Christmas Day morning, BBC journalist Phillip Stoneman said'Roughest’ seaBBC journalist Phillip Stoneman has been a visitor to Budleigh for the swim for the past few years. He said: \"As soon as we arrived you could tell that the sea was the roughest it's been and that anyone going in would need to be a lot more cautious than usual.”He added: “The waves swept some people exiting the sea off their feet and other swimmers were helping them out.”He said the RNLI boat was out in the water at the time and hundreds of people were either on the beach or in the water. 'Extensive enquiries ongoing'Devon and Cornwall Police Detective Superintendent Hayley Costar said: \"Today, emergency services have been responding to a truly tragic incident in Budleigh Salterton.\"Our thoughts remain firmly with the families and friends of the two men who are currently missing and to all who may have witnessed and be impacted by the incident.\"The local community will have seen a significant amount of emergency services in the area throughout the day as extensive enquiries have been ongoing. \"As dark falls, a number of these searches have been stood down, with some police enquiries on land continuing this evening.\"There have been weather warnings in place this week and a number of official and unofficial swims have already been cancelled. \"While there are no official warnings in place for tomorrow, we urge anyone with plans to go swimming in the sea on Boxing Day not to.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two men still missing after Budleigh Salterton Christmas swim",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a9f4/live/1dff0fe0-e1c4-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-25T19:52:39.000Z",
      "dateModified": "2025-12-25T19:52:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King's speech 2025: Christmas message urges communities to pull together in divided world",
    "url": "https://www.bbc.com/news/articles/ce86x326y08o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8e89/live/6b896d20-e1a4-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T15:28:07.000Z",
    "description": "5 hours agoSean CoughlanRoyal correspondentKing Charles: 'We can find the strength to ensure that right triumphs over wrong'The King's Christmas messa",
    "body": "5 hours agoSean CoughlanRoyal correspondentKing Charles: 'We can find the strength to ensure that right triumphs over wrong'The King's Christmas message has invoked the wartime spirit, calling on communities to pull together in an increasingly divided world and urging people to get \"to know our neighbours\".His traditional speech, recorded in Westminster Abbey, remembered this year's 80th anniversaries of VE Day and VJ Day and said we should \"never lose sight\" of the values in which \"communities came together in the face of such great challenge\".The King, speaking in the abbey's medieval Lady Chapel, also hailed the \"spontaneous bravery\" of those who helped in emergencies, such as the Bondi Beach attack in Australia.A Ukrainian choir sang a carol, with many of the group's singers in the UK because of the war.The speech included a call for quiet and calm as \"our world seems to spin ever faster\", with King Charles quoting poet TS Eliot's words about finding the \"still point of the turning world\".A royal aide said this was a reference to the social impact of new technologies on communities, and that people might consider a \"digital detox\".For the second year, the message was delivered in a location away from a royal palace, the King using a chapel in the abbey to talk about life's \"pilgrimage\" and the lessons for current times.In front of Christmas trees originally used for the Princess of Wales's carol concert at the Abbey, he spoke of the importance of community cohesion and bridging divides.\"As I meet people of different faiths, I find it enormously encouraging to hear how much we have in common,\" said the King, speaking under the chapel's famous vaulted ceiling.\"With the great diversity of our communities we can find the strength to ensure that right triumphs over wrong.\"He praised the wartime generation's \"courage and sacrifice\" and their togetherness in the face of adversity, with the broadcast showing pictures of this year's commemorations marking 80 years since the end of World War Two in Europe and the Far East.\"These are the values which have shaped our country.\"As we hear of division, both at home and abroad, they are the values of which we must never lose sight,\" said the King.Getty ImagesThe setting for this year's speech was the Lady Chapel in Westminster AbbeyThere was praise too for the heroic actions of those caught up in violent incidents.\"Individuals and communities have displayed spontaneous bravery, instinctively placing themselves in harm's way to defend others,\" said the King.His speech was accompanied by images from Bondi Beach in Australia, where earlier this month bystanders intervened against a gun attack on a Jewish community event.There were also pictures of the King at a synagogue in Manchester, where he met members of the congregation who had tried to stop an attacker.As an example of building bridges between religious leaders, the broadcast showed this year's state visit to the Vatican, with the King speaking of the \"historic moment of spiritual unity\" when he prayed with Pope Leo.The King reflected on the Christmas story, describing Jesus, Mary and Joseph as a \"homeless\" family, and saying their message was about \"peace and reconciliation\" and represented a \"prayer for our times\".PA MediaThe King praised the heroic actions of those caught up in violent incidents this yearIt was a Christmas message that did not dwell on any of the King's personal challenges.There was no reference to his health, after he recently recorded a video message saying there was \"good news\" that his cancer treatment would be reduced next year.There were no references to his brother Andrew Mountbatten-Windsor, who was stripped of his titles this year, in the speech.The accompanying film focused on the working royals, including Prince William and Catherine.There were pictures of Prince George on his first visit to the Passage homelessness charity, where he went with his father Prince William last week.The King has been a strong supporter of Ukraine since Russia's invasion and there was a symbolic sign of this with the broadcast including the Carol of the Bells, a Ukrainian carol sung by the Songs for Ukraine Chorus.Many members of the choir are in the UK because of the war in Ukraine.Earlier, the King led the Royals in celebrating the high point of the festive season with a service of Christmas carols and prayers at St Mary Magdalene Church on Charles's private Sandringham Estate in Norfolk.After the service at St Mary Magdalene Church in Norfolk, the royals greeted and interacted with excited crowds who had gathered on the crisp Christmas morning.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King's speech 2025: Christmas message urges communities to pull together in divided world",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8e89/live/6b896d20-e1a4-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-25T15:28:07.000Z",
      "dateModified": "2025-12-25T15:28:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazil ex-president Bolsonaro's surgery for hernia 'successful'",
    "url": "https://www.bbc.com/news/articles/c898zxyznxpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cce0/live/c5c75620-e1b9-11f0-87d9-5d6652c57a15.jpg",
    "tag": "Trending",
    "date": "2025-12-25T18:24:38.000Z",
    "description": "The jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says. The former leader i",
    "body": "The jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says. The former leader is serving a 27-year sentence for plotting a coup after he lost the 2022 presidential election to his left-wing rival, Luiz Inácio Lula da Silva. Brazil's Supreme Court granted permission for the 70-year-old to be transferred from the room in the federal police headquarters where he is serving his sentence to a hospital in the capital, Brasília, for the procedure. Ahead of the surgery, Jair Bolsonaro endorsed the candidacy of his eldest son, Flávio, for the 2026 presidential race. The former president made his decision known in handwritten letter that was read out by Flávio Bolsonaro outside the hospital were his father is being treated.\"During my life, I have fought tough battles, paying a high price with both my health and my family, to defend what I think is best for our country,\" Bolsonaro wrote.\"I hand over what is most important in the life of a father - my own son for the mission of rescuing our country, Brazil.\"Flávio Bolsonaro, a 44-year-old senator, had already announced his decision to run for president for his father's Liberal Party.Ealier this month, he said his father had entrusted him \"with the mission of continuing our national project\". But Jair Bolsonaro's letter, which has been published by Brazilian media, is confirmation the senator has his father's backing.The incumbent, President Lula, has already announced he plans to run again in the presidential election scheduled for October 2026. In 2022, the presidential election went into a run-off, which saw the older Bolsonaro take on ex-President Lula. When Lula narrowly won, Jair Bolsonaro refused to accept the result and plotted with top military leaders to prevent Lula from taking up office. While the plot failed to enlist enough support from the military to go ahead, it did culminate in the storming of government buildings by Bolsonaro's supporters on 8 January 2023.Bolsonaro was found guilty of coup-plotting and sentenced in September this year. Despite the guilty verdict, the older Bolsonaro still wields considerable political influence.Brazil's Congress passed a bill last week to significantly shorten Bolsonaro's sentence but President Lula said he would veto it.  Jair Bolsonaro is expected to be transferred back to federal police headquarters as soon as doctors give the go-ahead. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazil ex-president Bolsonaro's surgery for hernia 'successful'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cce0/live/c5c75620-e1b9-11f0-87d9-5d6652c57a15.jpg"
      ],
      "datePublished": "2025-12-25T18:24:38.000Z",
      "dateModified": "2025-12-25T18:24:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]