[
  {
    "title": "Cadillac and Audi enter F1: Two teams with the same ambition but very different projects",
    "url": "https://www.bbc.com/sport/formula1/articles/c4gjmkj4g88o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ff9/live/77e24780-1175-11f1-ba61-2b399c307393.jpg",
    "tag": "Trending",
    "date": "2026-02-27T06:42:21.000Z",
    "description": "There are two new Formula 1 teams in 2026, representing two of the world's biggest car companies. They have the same ambition, but they are two very d",
    "body": "There are two new Formula 1 teams in 2026, representing two of the world's biggest car companies. They have the same ambition, but they are two very different projects.Audi has taken over the Sauber team to form the basis for its works assault on F1, marking parent company the Volkswagen Group's first foray into the highest level of the sport.US giant General Motors (GM) is also trying out F1 for the first time. It has joined forces with US sports conglomerate TWG to form a new team named after its luxury Cadillac brand.Both were tempted in by the engine rules introduced this year, believing the increased effect of the hybrid part of the engine was an important marketing point for their road-car portfolios.Both want to become world champions. Both realise they have some way to go before achieving that aim.Audi has set themselves a target of being in a position to compete for that in five years' time. Cadillac have been less precise, but team principal Graeme Lowdon has made it clear they have \"limitless ambitions\".Let's take a look at where the two projects are at.Audi team principal Jonathan Wheatley, who joined from his former position of sporting director at Red Bull last March, said at the team's launch this year: \"We're not here to mess around. It's an ambitious project. We're humble. We know where we're starting from and we know where we want to go.\"We want to make Audi the most successful F1 team in history. There are milestones on that journey and we are starting it today.\"No pressure, then.Audi won the Le Mans 24 Hours 13 times in 18 years from 1999 to 2016. And in rallying they were famous for introducing four-wheel drive with the iconic Quattro in the early 1980s.They might not have taken part in F1 before, but they did compete in its forerunner, the European grand prix championship, in the 1930s.In a battle with arch-rivals Mercedes, Auto Union won the title with the great Bernd Rosemeyer in 1936, won five races against Mercedes' seven in 1937, while the legendary Tazio Nuvolari won races for them in 1938 and 1939 before the Second World War brought racing to a halt.Audi's entry this year rekindles that old rivalry with Mercedes, and battle lines have already been drawn in a pre-season row over the rules governing the engines' compression ratio. Audi are said to have been prime among those pushing for a rule change because of a fear Mercedes had found a way of exploiting a loophole to their advantage.Rivals on track with Mercedes, though, Audi are unlikely to be for a while.While Mercedes start the season as championship favourites, Audi have a lot of work to do to transform Sauber into a winning proposition.Following the announcement of Audi's entry in August 2022, the first steps of the programme did not augur well. Audi did not invest anywhere near enough money anywhere near soon enough.Sauber made no progress through 2023 and into the following year. With the clock ticking on its entry in 2026, Audi axed chief executive officer Andreas Seidl, who had left his previous role as team principal of McLaren to join them, in mid-2024.He was replaced with a dual management team of former Ferrari team principal Mattia Binotto, who was tasked with running the factories - Hinwil in Switzerland for Sauber, and Neuberg in Germany for the engine programme - and Wheatley, in charge at the track.Even then, the management changes were not finished. Binotto had initially joined as chief operating and technical officer. Less than a year later, he was made head of the Audi F1 project, and chief executive officer Adam Baker left the company.  The appointment of Binotto and Wheatley had a relatively quick impact, as Sauber finally began to move forward in 2025.Having been marooned at the back, Sauber became more respectable performers, and their veteran German driver Nico Hulkenberg even finally scored a podium after 16 years of trying in last year's British Grand Prix.This year, the driver line-up of Hulkenberg and Brazilian Gabriel Bortoleto, who is heading into his second season, continues, and the new Audi engine makes its debut.So far the team have made a promising start.They ran their car early in January, the first team to do so built to this year's new rules, and put a first aerodynamic upgrade on it in the final pre-season test in Bahrain last week.Pace-wise, the belief is that Audi are in the midfield mix with Haas, Alpine and Racing Bulls, and ahead of Williams. A solid effort so far, although Hulkenberg is not getting carried away.\"It's just speculation right now still,\" the German said last week. \"We really don't know until Melbourne and even a few races in, because I feel at the moment it can be quite track dependent on how your package feels on different circuits.\"So we'll have to wait and see until everybody really pulls their pants down in qualifying and we'll find out. Early days. I hope we're competitive somewhere in the midfield right now.\"But, yeah, the team's been working hard over the winter, pushing all the areas, doing the power-unit side for the first time. It's been busy and a challenge, and I think we're OK. But there's still a lot of work and a lot of room for improvement on that side and a lot to come.\"'We're not putting a man on the moon, but it feels like it sometimes'If Audi was faced with a huge task in taking over a team that had suffered years of underinvestment and trying to make it competitive, while also setting up an F1 engine division, Cadillac's task was just as hard, but in a different way.They had to set up a team from scratch, while battling political headwinds for at least three years.Their journey started with the US-based Andretti team, which competes in a number of series, including IndyCar and Formula E, pondering an entry in the early years of this decade. But things got messy.Michael Andretti, who ran the team, rubbed a lot of people in F1 up the wrong way with what was perceived as his abrasiveness and presumption, and there were questions marks within F1 as to how serious GM's involvement was. Initially, the team had a deal to use Renault engines, and it appeared Cadillac was little more than a sponsorship deal.Andretti put forward its case for an entry through an official FIA process, but despite being accepted by the governing body in October 2023, they were rejected by F1 in January 2024, on the basis that they did not bring extra value to the sport.But Andretti parent group TWG refused to accept defeat. They reconfigured their bid. Michael Andretti was removed from the project, although father Mario, the 1978 F1 world champion, remains as an ambassador, and Cadillac's involvement was made more prominent, including taking on the name of the team.GM pledged to build its own engine - currently scheduled to appear in 2029 - and as it became clearer that Renault might pull out of F1, as it now has, a Ferrari customer deal was inked.A US department of justice investigation into F1's rejection of Andretti further greased the wheels, and the entry was finally confirmed in March last year.While all this was going on, Lowdon, formerly a senior figure at the Virgin/Manor/Marussia team that raced from 2009-16, was charged with setting up a new company from scratch. They had to commit to that long before the entry was confirmed, or they would simply have run out of time.Chief technical officer Nick Chester, technical director of Renault F1 from 2013-20 and subsequently the title-winning Mercedes Formula E team, was the second person to sign after Lowdon. He started in March 2023, and set to work on building up a 600-strong team at the same time as beginning to design a car.Now, Cadillac are occupying six buildings on the business park opposite the main entrance of Silverstone, and have two other bases, the GM technical centre in Warren, Michigan, and the GM Motorsport headquarters in Charlotte, North Carolina, where drivers Valtteri Bottas and Sergio Pérez have been working on the simulator.A new TWG headquarters in Fishers, Indiana, is due to be finished late this year, and will eventually become the F1 team's manufacturing centre, but the UK base at Silverstone will remain, albeit slimmed down to fewer buildings.\"You do need really good communications,\" says Lowdon, \"and we've got a massive necessity for peer-to-peer interaction. So we need engineers talking to engineers. We need an engineer here (at Silverstone) talking to an engineer in Charlotte and another one in Warren, Michigan, or eventually in Fishers.\"So we've looked to have a very, very flat management structure. It's highly modelled on the Apollo project. It's very similar. OK, we're not putting a man on the moon, but it feels like it sometimes.\"Lowdon and Cadillac F1 chief executive officer Dan Towriss, who has the same position at TWG, have been keen to emphasise the size of the task at hand, and their own sense of realism.\"We started with big dreams,\" Towriss says. \"We ran into a lot of obstacles and it was just a cacophony of voices that were telling us no. Not just no, but never.\"We've come at this incredibly complex, competitive time and we're jumping in from a standing start.\"We didn't buy an existing team. We didn't import a bunch of stuff. We started with nothing. So that's a pretty daunting challenge from that standpoint, which is why you heard a lot of people say it's going to be really hard.\"We know it's going to be really hard, but that's where that grit, that fight, that persistence comes.\"Cadillac have made no bones about the fact that they expect to finish last this year.\"Can you imagine if you've owned a Formula 1 team for 10 years and then another team rocks up and beats you?\" Lowdon says. \"You would be apoplectic. You would be so annoyed. And so you have to assume that any new team coming in is going to be last, you know, otherwise, you know, what's gone wrong somewhere else?\"They do indeed appear to be at the back. But Lowdon's words have been prescient. Aston Martin are in such dire straits that there is a significant question mark about which of the two will be slowest in Melbourne.The difference is, if it's Aston Martin, that is a desperate blow. If it's Cadillac, well, it's kind of part of the plan.\"We're up against teams who have been doing this for a very, very long time,\" Lowdon says. \"We're working through the programme. We've had no major issues, just small issues that I think every team in the paddock will have had before.\"We've got a lot of experienced people in the team. But the experience of working together as kind of like a Formula 1 team is less than 12 months.\"But I would say, to sum it up, extremely happy with the team. Very, very happy with the platform that we're building. And we can't wait for Melbourne.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cadillac and Audi enter F1: Two teams with the same ambition but very different projects",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ff9/live/77e24780-1175-11f1-ba61-2b399c307393.jpg"
      ],
      "datePublished": "2026-02-27T06:42:21.000Z",
      "dateModified": "2026-02-27T06:42:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why the Cuban Revolution faces its biggest threat yet",
    "url": "https://www.bbc.com/news/articles/c9q5wdeg4j8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/290c/live/54fb4910-1328-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-27T06:00:38.000Z",
    "description": "Blackouts and emergency aid: Why the Cuban Revolution faces its biggest threat yet2 hours agoWill GrantMexico, Central America and Cuba CorrespondentB",
    "body": "Blackouts and emergency aid: Why the Cuban Revolution faces its biggest threat yet2 hours agoWill GrantMexico, Central America and Cuba CorrespondentBBCA sizeable exhibit in the Museum of the Revolution in Havana is dedicated to conditions in Cuba before the revolution took power in 1959. Inside the ornate former presidential palace, photographs and oral testimony detail the grinding poverty and ingrained corruption of the dictatorship of Cuba's then-military strongman, Fulgencio Batista.The enduring image is of a woman in a dirt-floored palm-leaf hut cooking with firewood. Similar pictures appear in state museums across the island from the Bay of Pigs to Birán, the birthplace of the father of the Cuban Revolution, Fidel Castro. The inference is clear: the revolutionaries saved Cubans from the ignorance and hardship of life under a Washington-backed de facto leader and led them to dignity, education and true independence.Yet today, Lisandra Botey identifies more with the impoverished woman in the photograph than with the revolutionaries who liberated her country from Batista.\"We're living like that now, we're exactly like that\", says housewife Lisandra outside her home in Havana, which is cobbled together with pieces of sheet metal and wood.\"Every morning, we have to go down to the beach [in Havana] and look for firewood. Then we bring it home to cook breakfast with – because if we get power, it comes on during school hours.\"Lisandra says she identifies with the impoverished woman in the photograph from pre-revolution CubaLisandra's nine-year-old daughter set off for school that morning with nothing in her stomach, she explains, tears pricking her eyes. Her husband, Brenei Hernández – a construction worker with next to no work – says they often have no idea where the next meal is coming from.\"Every day is the same hunger, the same misery\", he says, stirring a pot of white rice – so at the very least his daughter will come home from school to something hot to eat.With the Cuban economy in freefall since the coronavirus pandemic, no gas has been delivered to Brenei's flimsy home in a Havana suburb for months. He and his neighbours were already cooking with firewood and charcoal before US troops forcibly removed Cuba's closest ally, the Venezuelan president, Nicolás Maduro, from power on 3 January. Since then, though, Washington has seemingly taken full control of Venezuela's oil industry and the supply of crude to the communist-run island has dried up.Universal Images Group via Getty ImagesBy 1958, the revolution had spread throughout Cuba, culminating in the fall of Havana in early 1959The decades-long US economic embargo on Cuba has been ramped up like never before: US President Donald Trump has threatened tariffs on any nation which sends oil to the stricken island.None of Cuba's traditional allies – whether Mexico, Russia, China, Vietnam or Iran – have stepped up to fill the void left by Venezuela, although the US Treasury this week said it would relax restrictions on a limited number of oil sales, to \"support the Cuban people for commercial and humanitarian use.\"The move comes amid rising tensions between Washington and Havana. Cuba's government has reported that its border guards fatally shot four people travelling in a US‑registered speedboat. It said the individuals were Cuban nationals living in the United States.US Secretary of State Marco Rubio said the US was investigating the \"highly unusual\" incident.\"Washington's old playbook on Cuba doesn't apply anymore and whoever hasn't appreciated that yet is in for a shock,\" says Cuban economist, Ricardo Torres. \"Trump is changing the rules of the game.\"Trump has declared that \"Cuba is ready to fall\", intensifying pressure on the island at its most vulnerable moment since the Cold War. Some commentators have said one of the aims of Washington's removal of Maduro in Venezuela was to deepen Cuba's economic crisis. It appears the Trump administration hopes to weaken the revolution – possibly terminally – and push for the collapse of state-run socialism on the island.The underlying calculation is straightforward: that a worsening internal crisis could create the conditions for the Cuban Revolution to unravel from within. What remains far less certain is whether such a strategy will force regime change, or whether the communist-run Cuban government will, as it has in past crises, find new ways to endure.Blackouts and 'extreme rationing'The effects of the fuel crisis are being felt the length and breadth of Cuba.Blackouts in Havana can last for 15 hours a day or more. Hospitals are in darkness with only emergency cases being admitted. Schools are often shuttered. Rubbish is piled high on street corners with no fuel for the state's garbage trucks to collect it. Scrawny and elderly residents can often be found sifting through the discarded waste.Watch: BBC examines life in Cuba without electricity and gasolineFor an island proud of the social safety net it built for its people since 1959 – universal healthcare, the eradication of illiteracy, tackling infant mortality rates and preventable diseases – the picture is bleak, and getting worse.One constant question since Maduro's arrest is: how long can Cuba hold on without new fuel supplies reaching the island?\"Perhaps the oil inventories could last for six to eight weeks,\" suggests Ricardo Torres – but he admits it's hard to know with any degree of precision. \"Cuba doesn't publish figures on fuel inventories.\"\"Extreme rationing\" could be introduced, he says, but draconian restrictions are already in place. People are limited to 20 litres of fuel at the petrol pumps, which must be paid for in US dollars.They're obliged to use a government-run app called Ticket. But the wait can last for days, even weeks. Drivers are finding more than 10,000 people ahead of them when they join the virtual queue for half a tank of petrol. Unsurprisingly in such circumstances, the price of black-market fuel has skyrocketed.AFP via Getty ImagesThere is a limit of 20 litres of fuel at the petrol pumps, which must be paid for in US dollarsDespite it all, Brenei Hernández doesn't direct his ire at Washington. Quite the opposite, in fact: he blames the Cuban state.\"I'd like Trump to take this place over. Then let's see if things get better,\" he says with unerring honesty. \"What can I tell you? I'm not going to lie,\" he adds.Regime changeHaving spent years listening to Cubans repeat anodyne revolutionary slogans when asked for their opinions on camera, it's disarming to hear such frank views expressed with no outward fear of the repercussions. Such is the level of disgust and exhaustion, the public's fear of reprisals for speaking out is beginning to evaporate.\"It's too much,\" Brenei says. \"We're only eating white rice. Hopefully I can get enough money together in the next couple of days for a packet of hot dogs, or three or four eggs.\"Lisandra already worries that her daughter will want a birthday cake this year, which is well beyond their means.\"Every day is the same hunger, the same misery,\" says Brenei HernándezSuch suffering may be part of the Trump administration's strategy of \"maximum pressure\" on Cuba. But while the methodology may be new, says Ricardo Torres, Washington's ultimate goal in Cuba remains the same as always: regime change.\"Whether the change in Cuba is something very sudden or a negotiated solution, in the end, it's regime change that Trump wants.\"The issue for Cubans is how Washington intends to make that change happen, Torres adds, with more acute pain from the oil shutout on the horizon.The Cuban government has repeatedly described the policy as inhumane, cruel and illegal under international law: \"What right does a world power have to deny fuel and the ability to function to a smaller nation?\" said Cuban President Miguel Díaz-Canel.It's all a far cry from the optimism of Washington's Cuba policy of a decade ago. After decades of enmity, in 2014 President Barack Obama opted to re-establish ties with the island in a historic but short-lived thaw. Hardliners in the Cuban government warned that Obama's overtures amounted to the same aim of regime change dressed up in nicer clothing. For the ordinary Cubans who lived through it, though, the diplomatic reset felt like the polar opposite of the current Trump approach.AFP via Getty ImagesIn 2014 President Barack Obama opted to re-establish ties with CubaNext month marks the tenth anniversary of Obama's visit to Havana as the first sitting US president to step foot on the island in almost a century.In front of the Cuban leader, Raúl Castro, he delivered an extraordinary address – broadcast live on state television – in which he said he had come to \"bury the last remnant of the Cold War in the Americas\" and \"extend the hand of friendship to the Cuban people\".The man who oversaw the diplomatic thaw was the then-US ambassador to Cuba, Jeffrey DeLaurentis. I asked him whether the Cuban Revolution was now facing an existential threat.\"That will depend upon what some other countries might do\", DeLaurentis replied.Venezuela's oil support was worth some 35,000 barrels of crude a day to Cuba. There have been some broad indications that Russia might send oil to the island and the Cuban foreign minister, Bruno Rodríguez, was recently in Moscow for talks with his Russian counterpart and with Russian President Vladimir Putin. So far, though, no Russian fuel tankers have docked in Cuban ports.Rodríguez also travelled to China, Vietnam and Spain trying to drum up support.Getty ImagesUS troops forcibly removed Cuba's closest ally, the Venezuelan president, Maduro, from power on 3 January\"The rush to defend and help has certainly not been as enthusiastic and as significant as we've seen in the past. But there's still a chance that other countries might take some action,\" says DeLaurentis.As to what Trump specifically wants in Cuba, the former lead US diplomat on the island says the administration is \"trying to take coercive steps to bring the government to the table or capitulate but not necessarily collapse\".\"That's a pretty risky strategy it seems to me, with a lot of potential for unintended consequences,\" he adds.Those consequences are already visible in the rapidly worsening humanitarian crisis which prompted Mexico to send tonnes of emergency aid to Cuba, including powdered milk and personal hygiene items. They're already being felt every day by the families forced to cook with firewood and the drivers in urgent need of petrol.Esteban Bello Rodríguez runs several \"almendrones\", 1950s classic American automobiles, in which he ferries tourists around the iconic spots of Havana. His trade has been heavily impacted by the fuel scarcity and the fall in tourism.Esteban Bello Rodríguez's trade has been heavily impacted by the fuel scarcity\"There's a problem here – the fuel problem – so surely the people at the top on both sides have to sit down, figure it out,\" he says bluntly. \"All I know is that a solution must be found because this is affecting the entire country – the people, nationwide. All of us.\"The real powerOn the US side, Cuba policy is largely being led by the Secretary of State, Marco Rubio – a Cuban-American son of exiles and former Florida senator.Trump says Rubio is talking to the top tier of the Cuban government and for days there's been widespread speculation over who might lead that negotiation on the Cuban side. Cuban economist Ricardo Torres says that the only dealmaker on the island is Raúl Castro, even at the revolutionary leader's advanced age of 94.AFP via Getty ImagesTrump says Marco Rubio is talking to the top tier of the Cuban government \"The only people with capacity to engage in a meaningful negotiation are people close to Raúl. The civilian government doesn't have any real power – including President Miguel Díaz-Canel\", he argues.\"The real power in Cuba is Raúl and the closed circle around him.\"Last week, the Axios news outlet reported that his grandson, Raúl Rodríguez Castro – commonly known in Cuba as \"El Cangrejo\", meaning The Crab – is the Trump administration's point of contact inside Castro's inner circle. If so, he's considered one of his grandfather's most trusted confidantes, having been his personal bodyguard, and more business-orientated than ideological, with no high-level diplomatic experience. Neither side, especially not the Cubans, have confirmed he's in talks with Rubio.\"In the case of Venezuela, the Trump administration has been very pragmatic,\" adds Torres.Rubio has seemingly been happy to deal with an interim government in Caracas under Delcy Rodríguez and Washington appears to be looking to persuade the conservative Cuban-American lobby in Florida of the benefits of negotiating with a similarly defenestrated regime in Havana.However, despite the public adherence to the \"maximum pressure\" strategy, Washington does seem to fear that total political change overnight in Venezuela or Cuba would be profoundly destabilising and could prompt a migration crisis as well as humanitarian one.AFP via Getty ImagesRubbish is often left uncollected on street cornersSeveral Cuba watchers have noted that Rubio's tone towards the island was markedly softer in recent comments he made at the Munich Security Conference, with an emphasis on economic reforms rather than a root-and-branch political transformation.\"In a way it almost sounded like a strange variant of Obama 2.0 in terms of economic reforms and so forth,\" said former ambassador DeLaurentis. \"That signalled to me that they are looking for a Delcy-like figure to negotiate with.\"\"Ten to 20 years ago, the diaspora in south Florida would have been completely opposed to that kind of approach. But I guess that now they'd give the president and the secretary the benefit of the doubt, and allow this sort of scenario to play out,\" adds DeLaurentis.Meanwhile, any visitor wanting to see the photograph of the pre-revolutionary woman cooking with firewood will have to wait. The museum has been closed for over a year for refurbishments and now there's no fuel to continue the work.In what is now the most challenging time in the island's modern history, it's not yet clear if only the Museum of the Revolution will be undergoing a renovation this year – or the Cuban Revolution itself.Top picture credit: AFP via Getty ImagesMore from InDepthBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why the Cuban Revolution faces its biggest threat yet",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/290c/live/54fb4910-1328-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-27T06:00:38.000Z",
      "dateModified": "2026-02-27T06:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League predictions: Chris Sutton v Oli Fox from Good Neighbours - and AI",
    "url": "https://www.bbc.com/sport/football/articles/cn4gl0x508lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00e6/live/b0157dd0-1278-11f1-b048-c9424b2cf5fd.png",
    "tag": "Trending",
    "date": "2026-02-26T20:08:02.000Z",
    "description": "AI is still leading the BBC Sport predictions table, but could Albert Einstein be the unlikely inspiration to help Chris Sutton hit back this week?\"Ei",
    "body": "AI is still leading the BBC Sport predictions table, but could Albert Einstein be the unlikely inspiration to help Chris Sutton hit back this week?\"Einstein used to live in a hut across the field from my house,\" said BBC Sport football expert Sutton. \"He would have gone for a walk in my garden, I'm sure, so I'm literally following in his footsteps most days.\"I don't know what he was like at predicting football results, but that kind of genius rubs off, even years later.\"So, AI should beware - for this week's predictions I've been gazing at where his hut used to be and thinking 'what would Albert do?'\"Sutton is making predictions for all 380 Premier League games this season, against AI, BBC Sport readers and a variety of guests.His guest for week 28 is Oli Fox from indie band Good Neighbours, who supports West Ham.An expanded version of Good Neighbours' debut album, Blue Sky Mentality (Complete Edition), is out now.Do you agree with their predictions? You can pick your own below.The most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.A correct result (picking a win, draw or defeat) is worth 10 points. The exact score earns 40 points.Image source, Getty ImagesImage caption, Good Neighbours are Oli Fox (left) and Scott Verrill (right). Their 2024 track, Home, has had more than 500 million streams on Spotify, and more than one billion streams worldwideOli is the younger brother of Wigan's former Wales Under-21s defender Morgan Fox, and his early dreams were to follow him into the professional game.He told BBC Sport: \"I played a bit myself growing up, and had trials here and there, but I was never as close as my brother to being a pro - so I sacked it off pretty quickly.\"I don't think I'll get away with saying I was better than him. Morgan always had the natural ability when we were kids, even at the age of four or five, and he was scouted by Ipswich by the age of seven.\"Our dad's Welsh so he was very proud when Morgan played for their under-21s. He got called up for the senior team as well, against Turkey, which was awesome. That was a fun away day.\"It's been awesome going to watch him down the years - even when I am away on tour I get a link to tune in wherever I am in the world. I've not really missed a game, visually anyway.\"It's been harder for him to come and watch me, but we had our first UK tour in more than a year the other week, and he came to see me in Manchester. That was brilliant too.\"The pair have both featured in the past two editions of best-selling video game EA FC - Good Neighbours songs are on the soundtrack of EA FC 25 and 26, while Morgan is in both as a player.\"We grew up playing it, so that was really cool,\" Oli added.Chris Sutton and Oli Fox were speaking to BBC Sport's Chris Bevan.The AI predictions were generated using Microsoft Copilot Chat - we simply asked the tool to 'predict this week's Premier League scores'.Image source, Getty ImagesImage caption, Morgan Fox played for Charlton, Sheffield Wednesday, Stoke and QPR before joining Wigan. Here, he battles Noni Madueke for possession during their 4-0 FA Cup defeat at Emirates Stadium this monthPremier League predictionsFriday, 27 FebruaryMolineux, 20:00 GMTI keep hearing people say that, mathematically, Wolves still have a chance of staying up, but let me just tell them straight - there is no chance of that happening.There is no doubt Wolves have improved under Rob Edwards, but this is still a game I'd expect Aston Villa to win.Unai Emery's side have slipped up a few times in recent weeks, however, and it has cost them.They have only won one of their past four league games and I am a bit gutted they haven't managed a couple more wins to really be in the title race.Emery has always talked down their title hopes anyhow, and I understand why - he obviously doesn't truly believe they can do it - but until this blip in form they were in with a real shout.I still think they will have too much for Wolves, but they are going to have to work hard for the points. Villa won 1-0 at Villa Park earlier in the season, so I am going for the same scoreline here.Sutton's prediction: 0-1Oli's prediction: I don't think either team is in particularly fine form. Wolves don't have much to play for but they have got a few young players in the team now who are really good, and they can get a result here. 1-1AI's prediction: 1-2Saturday, 28 FebruaryVitality Stadium, 12:30Sunderland just seem to be fading a little bit.They went fourth in the table when they beat Bournemouth 3-2 at the Stadium of Light at the end of November, but their results have tailed off recently and they have missed Granit Xhaka's influence in recent weeks.Xhaka came off the bench in last week's defeat by Fulham and, if he starts this time, they will be better organised here.I still fancy Bournemouth to win it, though. They always create chances and Rayan has done well since signing in January to replace Antoine Semenyo.Sutton's prediction: 2-0Oli's prediction: Bournemouth's front three is frightening and West Ham did well to keep them out last week. Sunderland don't really have the legs in midfield to cope. 3-1AI's prediction: 1-1Turf Moor, 15:00Burnley are still competitive, still scrapping and still picking up points. Their players are still playing for Scott Parker but, even so, it's still not going to be enough to keep them up.The Clarets' draw at Chelsea last week was a good result and they could even have won that game, too, but they didn't. That lack of wins has been their problem all season, not their performances.They have only won four of their 27 games so far and I think they are going to need to win five of their final 11 to stay up from here - and that's not going to happen.I don't think anyone saw Brentford's home defeat by Brighton coming last week - I didn't anyway - but I am still going to back them at Turf Moor.It's going to be another tight one but I can see Igor Thiago getting back on the scoresheet with the winner. That's as exact as predictions can get.Sutton's prediction: 0-1Oli's prediction: I always kind of fancy Burnley to get something at home. Zian Flemming is in good form for them too. 2-2AI's prediction: 1-2Anfield, 15:00I keep hearing how West Ham have turned a corner, and they have improved recently, but I still thought last week's draw at home to Bournemouth was a poor result.The Hammers were helped by Nottingham Forest and Tottenham both being beaten, but a win would have been massive for them.Liverpool were very unconvincing at Forest, but they did nick the win. Some of their fans are still whinging about Arne Slot and he is always being compared to Jurgen Klopp, but they are actually on a decent run of results and showing a bit of spirit too.They are right in the mix for the top four but now they need to keep winning - I expect them to do that on Saturday.Sutton's prediction: 2-1Oli on why he's a West Ham fan: All my family are from East Ham and Upton Park. They grew up watching them,  so when I was a kid I didn't really have a choice. I wouldn't have it any other way, though - I love them to bits.Oli's prediction: The sensible prediction here is that Liverpool will win but I am not going with that. Instead, we will score inside the first 10 minutes because we always start well, but they will come back and then we will be fighting for an equaliser. I am not too hopeful, but I am going to say we will get one. 2-2Will West Ham stay up? The end of last season and the beginning of this one have probably been the toughest times to be a West Ham fan, because of what was happening at the club from the top down - it kind of felt like a wasted effort to try and support them. But I feel like good things are on the horizon for us now - it feels like there is more camaraderie within the team, and they are starting to get Nuno Espirito Santo's methods more. Axel Disasi coming in has been game-changing too, when I didn't think he would have that effect. We've found another gear now and obviously Crysencio Summerville's form has been excellent with Mateus Fernandes, but Tomas Soucek has been really key as well. I am feeling optimistic, because we've got a bit of grit.AI's prediction: 2-1St James' Park, 15:00Everton's inconsistency makes them an absolute nightmare to predict, and the fact their away form is much better than their home results doesn't help me much here either.Anthony Gordon looks sharp as anything up front for Newcastle, with Nick Woltemade playing just in behind.The Magpies won 4-1 at Hill Dickinson Stadium in November and I'd usually back them in this kind of game at St James' Park and be quite confident they would win.But Everton won here last season and, given how good they are on the road, I just have a sneaky feeling they will get something this time too.Sutton's prediction: 1-1Oli's prediction: Everton had a few good chances against Manchester United but they just don't have that end product. Newcastle are at home so I've got to go with them. 2-0AI's prediction: 2-0Elland Road, 17:30This will be a great game. I was at Etihad Stadium when these two teams met in November, and it was a real turning point in Leeds' season.City were 2-0 up at half-time but Leeds boss Daniel Farke put Dominic Calvert-Lewin on and had a real go. They fought back to 2-2, and although they still lost to a last-gasp Phil Foden goal, that performance transformed them - they've been a different team in recent weeks compared with the way they started the season.This is the sort of game where, if you are a City fan, you are thinking we have to go to Elland Road and win if we are going to win the title.Leaders Arsenal did exactly that a few weeks ago, and blew Leeds away.Can City do the same? I am not sure - especially if we class this Saturday evening kick-off as a night game, because Leeds' record in those under Farke is extraordinary - out of 21 so far, they have won 18 and drawn three.It's hard to call, so this was one of the games I mentioned earlier where I was thinking, 'What would Einstein say?'.He was better at physics than he was at predictions but I reckon he would have calculated that the floodlights will inspire Leeds again - but City will still come out on top. So, my theory is that City will win. They don't have the same control in midfield any more, but they have so much firepower - as well as Erling Haaland, Omar Marmoush and Semenyo are both in good form.Haaland is not exactly playing a different role now, but he is showing what an intelligent footballer he is. I don't see Leeds keeping them out.Sutton's prediction: 1-3Oli's prediction: This should be a simple game for City, but Leeds at home is never straightforward. Elland Road is like a fortress and Leeds have got goals in them so I can see this being a bit of a scrap. 2-3AI's prediction: 1-3Sunday, 1 MarchAmex Stadium, 14:00Brighton badly needed last week's win over Brentford, just to settle things down under Fabian Hurzeler. There had been a lot of talk about his future while they were on a poor run.Nottingham Forest did not deserve to lose against Liverpool last week but scoring goals is still a problem for them, and I feel like it could haunt them again here.Sutton's prediction: 2-0Oli's prediction: I obviously hope Forest lose from a West Ham point of view but I'd take a draw here because you never know what you will get from Brighton. 1-1AI's prediction: 2-1Craven Cottage, 14:00The Tudor times have not started well for Tottenham under Igor Tudor.It's been a classic case of a manager coming in and being bullish in his first press conference, saying he is 100% sure they will stay up - then losing his first game and letting loose on the previous manager, saying things like the players aren't fit.I thought it was an astonishing attack on Thomas Frank, because by saying Spurs' players are \"a good group with bad habits\", Tudor is totally blaming him for everything.We know Tudor is a short-term specialist but what does that actually mean about him as a manager? It is OK going in and shoring clubs up for a few games, but why does he keep losing his job after that?I don't think this is an easy game for him after his side were outclassed in the north London derby.Fulham won well at Sunderland last time out and they look full of confidence. Their home record is good and they've already beaten Spurs once this season - there's a good chance they will beat them again.Sutton's prediction: 2-1Oli's prediction: Fulham will take this, 100%. That would be great if it happens. 3-1AI's prediction: 1-2Old Trafford, 14:00Manchester United have been very good under Michael Carrick and they are a team full of confidence - the way Benjamin Sesko is playing when he comes on is a great example of that.Palace picked up a late win over Wolves last time out but it still feels like their manager Oliver Glasner should have left by now, because there is such a negative atmosphere around the whole club.I don't like to question anyone's commitment but, in this scenario, I think you have no choice. Glasner wants to leave, and the whole situation has been handled very badly.Palace have won away at Manchester United in the past two seasons but, the way things are going for both teams, you'd only ever go for a home win here.Sutton's prediction: 2-0Oli's prediction: The way United are playing, I can see them scoring a few. 3-0AI's prediction: 2-0Emirates Stadium, 16:30Arsenal have got to be careful they don't warm up in the Chelsea half again, for starters. If I was playing in this game, I'd do it deliberately!In terms of the game, I can't see anything other than a Gunners win. Chelsea can cause Arsenal a few problems because they have got players who can hurt anyone but, at the other end, I don't see Liam Rosenior's side keeping a clean sheet.I liked the way Arsenal responded to their setback against Wolves by battering Spurs. Chelsea don't like them much either, but this is going to end up with the same result.Sutton's prediction: 2-0Oli's prediction: Off the top of my head I want to say 2-2 for this one, it just feels right - we are going to see a few goals. 2-2Oli on Declan Rice: I loved watching Kaka in the Champions League when I was a kid and I always wanted to play like him. But being able to watch Rice from when he broke into West Ham's first team was incredible. I understood he had to leave to reach the heights he has done and even the way he went to Arsenal, he did it really well. He's up there with Frank Lampard and Steven Gerrard as one of the greatest all-round English midfielders, and to watch that as a West Ham fan, I am just so proud of him.AI's prediction: 2-2How did Sutton do last week?The outcome of week 27 went down to the final game, Manchester United's 2-1 win at Everton on Monday.Chris wrongly predicted a 1-1 draw but his guest, Embrace bassist Steve Firth, correctly backed United to win 1-0 - and those 10 points handed him the weekly win.Overall, Chris got five correct results from 10 Premier League games, including one exact score, for a total of 80 points.That was enough for him to beat the BBC readers, who got five correct results with no exact scores for a tally of 50 points, and also get the better of AI, which managed six correct results with no exact scores for 60 points.But it was Firth who finished on top, with six correct results and one exact score, to end up on 90 points.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League predictions: Chris Sutton v Oli Fox from Good Neighbours - and AI",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/00e6/live/b0157dd0-1278-11f1-b048-c9424b2cf5fd.png"
      ],
      "datePublished": "2026-02-26T20:08:02.000Z",
      "dateModified": "2026-02-26T20:08:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n32y2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-25T07:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Feb 2026,·31 minsTrump's big, long, State of the Union speechAmericastAvailable for over a yearThe Americast team assembles for a late evening/early morning special as President Trump delivers the longest State of the Union address ever. On the agenda was a full-throated defence of the administration’s record, hailing a \"turnaround for the ages,” whilst playing down the Supreme Court's ruling against his signature tariff policy (with the judges themselves in the crowd).\nDespite the speech lasting nearly two hours,  there was little to suggest a change of course from Trump’s favourite taking points. He focused on the economy, immigration, the Democrats…. And the US men’s olympic hockey team.\nBut with growing voter dissatisfaction souring the polls, will Trump’s sales pitch be enough to counter sliding approval ratings and convince voters to stick with him for November's midterm election?\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Stephen Bailey. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-25T07:03:00.000Z",
      "dateModified": "2026-02-25T07:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Will The US Attack Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3jqc4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-26T19:14:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·26 Feb 2026,·33 minsAvailable for over a yearToday, we discuss the indirect US-Iran talks happening in Geneva.\nThe talks are happening against a backdrop of increased tensions between the two countries, with the US sending what Trump calls an ‘armada’ to the region. President Trump has threatened to strike Iran if a nuclear deal isn’t agreed during the talks.\nWe also discuss President Trump’s State of the Union speech, happening a time where many Americans are feeling frustrated about the cost of living, and off the back of the supreme court striking down his tariff policy.\nAdam discusses all with economics editor Faisal Islam, chief North America correspondent Gary O’Donoghue and Panorama filmmaker Jane Corbin.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi.  The social producer was Joe Wilkinson and Gabriel Purcell-Davis. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Will The US Attack Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-26T19:14:00.000Z",
      "dateModified": "2026-02-26T19:14:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gorton and Denton: 'Family voting' concerns raised by election observers ",
    "url": "https://www.bbc.com/news/articles/c5yqpr28jrwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e710/live/e2d94360-138a-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-27T07:38:47.000Z",
    "description": "51 minutes agoJennifer McKiernanPolitical reporterReutersParty observers watch as votes are counted for the Gorton and Denton by-election at Mancheste",
    "body": "51 minutes agoJennifer McKiernanPolitical reporterReutersParty observers watch as votes are counted for the Gorton and Denton by-election at Manchester CentralElection observers have raised concerns about \"extremely high\" levels of family voting in the Gorton and Denton by-election.Family voting is where a family member is seen to be influencing somebody else's vote, for example by entering the polling booth with them. Concerns were raised by Democracy Volunteers, a group of voluntary election observers who check voting processes are being followed correctly.However, the by-election's acting returning officer said polling station staff were trained to look for undue influence on voters and \"no such issues\" had been reported during polling hours.Under the Ballot Secrecy Act 2023, it is an offence to be in a polling booth with another person in order to influence that person to vote in a particular way.Democracy Volunteers director John Ault issued a statement after polls had closed on Thursday, saying observers had seen \"the highest levels of family voting at any election in our 10 year history of observing elections in the UK\".He said: \"We rarely issue a report on the night of an election, but the data we have collected today on family voting, when compared to other recent by-elections, is extremely high.\"In the other recent Westminster parliamentary by-election in Runcorn and Helsby we saw family voting in 12% of polling stations, affecting 1% of voters. \"In Gorton and Denton, we observed family voting in 68% of polling stations, affecting 12% of those voters observed.\"The group said four observers attended 22 of the 45 polling stations in the constituency, spending 30 to 45 minutes in each.Of the 22 polling stations observed, volunteers reported potential family voting in 15.They observed a sample of 545 individuals casting their vote and saw 32 cases of family voting in total, including nine cases in one polling station.The officer responsible for running the by-election rejected the claims, saying no reports of family voting had been made by polling station staff.A spokesperson for the Acting Returning Officer said: \"Polling station staff are trained to look out for any evidence of undue influence on voters. \"No such issues have been reported today.\"If Democracy Volunteers were so concerned about alleged issues they could and should have raised them with us during polling hours so that immediate action could be taken. \"We have operated a central by-election hub which has been rapidly responding to reported issues during the day, in liaison with the police - who had a presence at every polling station - where necessary.\"It is extremely disappointing that Democracy Volunteers have waited until after polls have closed to make such claims.\"Labour Party chair Anna Turley told BBC Newsnight reports of family voting in the Gorton and Denton by-election are \"extremely worrying and concerning\". \"That's not what we want to see in our democracy,\" she said, \"so obviously we need to see the evidence and the report, and then make due decision about what authorities should look into this.\"Green Party leader Zack Polanski told BBC Breakfast if any wrongdoing had happened there should be an investigation, but pointed to Manchester City Council's statement saying no issues had been reported.Reform UK leader Nigel Farage said the claims raised questions \"about the integrity of the democratic process in predominantly Muslim areas\", saying the election was \"a victory for sectarian voting and cheating\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gorton and Denton: 'Family voting' concerns raised by election observers ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e710/live/e2d94360-138a-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-27T07:38:47.000Z",
      "dateModified": "2026-02-27T07:38:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Mason: Green Party win will prompt soul searching within Labour and questions for Starmer",
    "url": "https://www.bbc.com/news/articles/cy03ydp27nno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/97d0/live/8f3f8ce0-13ae-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-27T06:06:17.000Z",
    "description": "2 hours agoChris MasonPolitical editorEPALabour's deputy leader Lucy Powell spoke to reporters before the result was announced in Gorton and DentonNev",
    "body": "2 hours agoChris MasonPolitical editorEPALabour's deputy leader Lucy Powell spoke to reporters before the result was announced in Gorton and DentonNever before have the Green Party won a Westminster by-election.So this is a result that will take its place in the history of parliamentary contests between elections.And it will prompt yet more soul searching within the Labour Party: finishing third was the nightmare result for them.It makes real the long-standing fear of some in the party that they would face an insurgency not just broadly from the Right, in the shape of Reform UK, but from the Left as well, in the form of the Green Party.In Gorton and Denton, that is precisely what has happened.The prime minister will wake up with both a tactical and a strategic question in his mind.Firstly, should he have allowed the Mayor of Greater Manchester, Andy Burnham, to be Labour's candidate? His supporters in the count centre told me they do think he would have made a significant difference.And secondly, has Labour's focus on Reform UK left them exposed among some of their regular supporters?At the 2024 general election, Labour won with a majority of more than 13,000 in Gorton and Denton and secured more than 50% of the vote.The inquest for some Labour MPs began in the middle of the night.\"Keir needs to own this. He's out of chances,\" one texted me.\"Everyone knew the only chance to beat both the Greens and Reform was Andy Burnham. You can't claim to be the party of unity when you're adopting the divisive policies of Reform. Vote Labour to stop Reform rings hollow when you're mimicking them.\"Labour's deputy leader Lucy Powell made a dash for it immediately after the declaration; reporters, me included, chasing after her shouting questions.She had, to be fair, done a few interviews before the result was confirmed, but after it looked clear Labour was doomed.Reform's candidate Matt Goodwin did talk to journalists afterwards, branding the Green Party \"mad\" and claiming that, unlike Reform, they wouldn't be able to replicate this in many places at a general election.The Green Party is delighted. I grabbed a quick word with their relatively new leader, Zack Polanski, just moments after the polls closed, and he wore the smile and demeanour of a confident leader.He can now point to a result that suggests the party's buoyant opinion poll ratings since he became leader have some substance to them. We can expect a victory rally with him and his new MP Hannah Spencer later this morning.And if you are looking for further evidence that politics is fracturing, unpredictable and wildly competitive, take a look at how the Conservatives fared.The Tories managed just 706 votes - 1.9% of the votes cast - for a party that was running the country just two years ago.A final thought that will be part of the conversation in the hours and days after this by election – the suggestion of significant \"family voting\" as it is known.The group Democracy Volunteers reported what it called \"concerningly high levels of family voting in Gorton and Denton\" - which it defines as \"where two voters either confer, collude or direct each other on voting\".Manchester City Council insisted \"no such issues\" were reported by its staff at polling stations.Labour Party Chair Anna Turley told the BBC the reports were \"obviously extremely worrying and concerning\" and Reform UK leader Nigel Farage claimed the by-election was \"a victory for sectarian voting and cheating\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Mason: Green Party win will prompt soul searching within Labour and questions for Starmer",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/97d0/live/8f3f8ce0-13ae-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-27T06:06:17.000Z",
      "dateModified": "2026-02-27T06:06:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: How did this baby monkey break the internet's heart?",
    "url": "https://www.bbc.com/news/articles/cn4gwn9w30yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9020/live/7b9e80b0-132c-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-26T17:31:57.000Z",
    "description": "16 hrs agoGorilla dies days after moving to new homeBristol Zoo Project's gorilla had a number of known conditions, but his health deteriorated after ",
    "body": "16 hrs agoGorilla dies days after moving to new homeBristol Zoo Project's gorilla had a number of known conditions, but his health deteriorated after the move.16 hrs ago2 days agoJapan to deploy missiles on island near Taiwan by 2031The remote Yonaguni island lies on the frontlines of self-governing Taiwan's growing tensions with China.2 days ago4 days agoMuch-loved unlikely animal friends die on same dayA tapir and a capybara with a strong bond are euthanised on the same day so neither would be lonely.4 days ago4 days agoWhat now for Asia after Trump's tariffs struck down?After the Supreme Court ruling, Trump said he would impose new levies of 15% on goods entering the US.4 days ago6 days agoPenguin pool upgraded ahead of breeding seasonA new viewing area is an \"important milestone\", keepers at the Cornwall zoo say.6 days ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: How did this baby monkey break the internet's heart?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9020/live/7b9e80b0-132c-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-26T17:31:57.000Z",
      "dateModified": "2026-02-26T17:31:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MoD launches review into whether Epstein used RAF bases",
    "url": "https://www.bbc.com/news/articles/c86y466v0x6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/361f/live/e61e0130-1355-11f1-a24b-e9ec85119d46.jpg",
    "tag": "Trending",
    "date": "2026-02-26T20:52:51.000Z",
    "description": "12 hours agoNick Eardley,Political correspondentandIan AikmanReutersThe Ministry of Defence (MoD) has launched a review into whether RAF bases were us",
    "body": "12 hours agoNick Eardley,Political correspondentandIan AikmanReutersThe Ministry of Defence (MoD) has launched a review into whether RAF bases were used by Jeffrey Epstein.It is expected the review, first reported by the Telegraph, will look into records and emails, while Defence Secretary John Healey was said to have ordered officials to turn over every stone to establish whether the late sex offender landed his private jet at military sites when visiting the UK.An MoD source said it would \"ruthlessly pursue any information that can shed light on this scandal\".It comes after former Prime Minister Gordon Brown demanded a police investigation into whether Andrew Mountbatten-Windsor had used RAF bases to meet Epstein.Brown said he had submitted a five-page dossier to several UK police forces – including the Met, Sussex and Thames Valley Police – providing new and additional information from Epstein-related documents published in the US.Last Sunday, the Sunday Telegraph reported that the former prime minister was understood to be concerned about a flight Epstein took on a Gulfstream jet that landed at RAF Marham air base in Norfolk in December 2000. The base is around 20 miles (32 km) from the Sandringham Estate.Last year, a BBC News investigation established that around 90 flights linked to Epstein had arrived and departed from UK airports, some with British women on board who say they were abused.At the time, the Ministry of Defence said it was \"standard practice for spare capacity at RAF airfields in the UK to be used for private or commercial aircraft, subject to fees which cover all costs\".Mountbatten-Windsor has previously denied any wrongdoing in relation to Epstein, who died in a New York prison cell in 2019 as he awaited trial on sex trafficking charges.An MoD spokesperson said: \"The defence secretary has ordered a review of all records that the department may hold relating to Epstein flights landing at RAF bases to ensure that any information which relates to Epstein's crimes is uncovered and provided to the relevant authorities.\"The MoD will support any civilian police investigations. Our thoughts are with all the victims of Epstein's vile crimes.\"Stansted Airport said in a statement that the terminals used for private flights are \"entirely independent\" and that \"no private jet passengers enter the main airport terminal\".Immigration and customs checks for passengers arriving via private jets are carried out \"directly by Border Force\", it said, adding that it does not \"manage or have any visibility of passenger arrangements on privately operated aircraft\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MoD launches review into whether Epstein used RAF bases",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/361f/live/e61e0130-1355-11f1-a24b-e9ec85119d46.jpg"
      ],
      "datePublished": "2026-02-26T20:52:51.000Z",
      "dateModified": "2026-02-26T20:52:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jack Dorsey's Block cuts thousands of roles as it embraces AI",
    "url": "https://www.bbc.com/news/articles/cq570d12y9do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1325/live/9097d0e0-1361-11f1-af0d-af544dd82419.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:06:40.000Z",
    "description": "8 hours agoLucy HookerandKali Hays,Technology reporterBloomberg via Getty ImagesJack Dorsey co-founded TwitterTwitter co-founder Jack Dorsey says his ",
    "body": "8 hours agoLucy HookerandKali Hays,Technology reporterBloomberg via Getty ImagesJack Dorsey co-founded TwitterTwitter co-founder Jack Dorsey says his technology firm Block is laying off almost half its workforce because artificial intelligence (AI) \"fundamentally changes what it means to build and run a company.\"\"Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes,\" he wrote in a letter to shareholders.The layoffs will mean headcount at the company - which owns Square, CashApp and Tidal - will fall to less than 6,000 from 10,000.Block has seen several rounds of layoffs since 2024 but this is the first time it has cited AI as the reason for redundancies and marks the latest in a series of major job cuts in the tech industry.In a subsequent call discussing financial results, Brian Olsavsky, Amazon's chief financial officer, said the company was looking at cost reductions elsewhere as it ramps up AI spending. Meta, Microsoft and Google have also laid off workers as their focus has shifted to huge investments in AI.Mark Zuckerberg, Meta's co-founder and chief executive, said he is expecting \"2026 to be the year that AI dramatically changes the way we work.\"\"We're starting to see projects that used to take big teams now be accomplished by a single, very talented person,\" Zuckerberg said.Most tech companies today are using AI tools that automatically write the computer code required to operate software or websites, like Claude Code from Anthropic or Codex from OpenAI. But some analysts have suggested the immediate threat to jobs has been exaggerated by executives who want to appear ahead of the curve.According to Dorsey, only more change related to AI capabilities is on the way.\"I don't think we're early to this realisation,\" he said Thursday. \"I think most companies are late\". Block's financial report showed strong demand for its products and services, pushing up profits at the end of last year.The firm also said it will incur up to $500m (£370m) in restructuring costs as it pivots to the new strategy.Its shares rose by more than 20% in extended trading after the announcement.Dorsey is a co-founder and former chief executive of Twitter, the online micro-messaging platform that was later bought by Elon Musk and renamed X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jack Dorsey's Block cuts thousands of roles as it embraces AI",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1325/live/9097d0e0-1361-11f1-af0d-af544dd82419.jpg"
      ],
      "datePublished": "2026-02-27T00:06:40.000Z",
      "dateModified": "2026-02-27T00:06:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celine Cremer: Remains found in Tasmania most likely belong to missing Belgian backpacker ",
    "url": "https://www.bbc.com/news/articles/cgqgl88w155o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0797/live/5cd18b90-1364-11f1-af0d-af544dd82419.jpg",
    "tag": "Trending",
    "date": "2026-02-26T23:33:49.000Z",
    "description": "9 hours agoLana LamSydneyTasmania PoliceCeline Cremer, 31, went missing in 2023 after going for a hike in a Tasmanian rainforestPolice have confirmed ",
    "body": "9 hours agoLana LamSydneyTasmania PoliceCeline Cremer, 31, went missing in 2023 after going for a hike in a Tasmanian rainforestPolice have confirmed that human remains found in a Tasmanian rainforest are most likely those of a Belgian backpacker who went missing in 2023 after going for a hike.Celine Cremer, 31, was reported missing days after she went for a hike near Philosopher's Falls in Waratah, in Tasmania's northwest. Police spent months searching for her but failed to find anything.A private search involving dozens of volunteers in recent months uncovered her bones, teeth, mobile phone and clothing, prompting police to renew their efforts. On Friday, police - with permission from her family - said the remains had been \"provisionally identified\" as Cremer's with expert reports providing \"compelling evidence\".Tasmania Police Commander Nathan Johnston extended his sincere condolences to Cremer's family and loved ones. \"While this provisional confirmation will not ease their loss, we hope the outcome will provide them with some measure of clarity and closure,\" he said. He also thanked all community members for their support and interest in her case, praising search and rescue personnel and volunteers who \"dedicated significant time and resources during the many search phases\".For months, Cremer's case had baffled many as initial police searches failed to lead to any clues about her whereabouts.Limited resources and extreme weather hampered police efforts, with searchers hindered by heavy rainfall, freezing conditions and snow. After police called off their search, Cremer's family hired a private investigator who trained a group of volunteers to scour the area of dense wilderness, according to the Australian Broadcasting Corporation (ABC).Some of those volunteers had joined the search party after seeing videos posted by a local filmmaker who was closely following the case, the ABC reported.A report will be prepared by the coroner to officially determine the identity of the remains.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celine Cremer: Remains found in Tasmania most likely belong to missing Belgian backpacker ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0797/live/5cd18b90-1364-11f1-af0d-af544dd82419.jpg"
      ],
      "datePublished": "2026-02-26T23:33:49.000Z",
      "dateModified": "2026-02-26T23:33:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disability charities warn of \"fetishising\" AI profiles on social media",
    "url": "https://www.bbc.com/news/articles/c1jkzr9gel7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ff8/live/fd9a5540-1236-11f1-b586-1ba1b8fe72ec.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:39:20.000Z",
    "description": "Instagram investigating AI profiles 'fetishising' disabled people8 hours agoJacob EvansBBC NewsReutersInstagram's parent company, Meta,  is investigat",
    "body": "Instagram investigating AI profiles 'fetishising' disabled people8 hours agoJacob EvansBBC NewsReutersInstagram's parent company, Meta,  is investigating AI-generated social media accounts that sexualise disabled people appearing on its platform.It comes after the BBC flagged dozens of profiles showing AI-generated images of women with disabilities, including Down's syndrome or vitiligo.Some profiles post fake images and videos of women with missing limbs, visible scarring or in wheelchairs. Many are in sexualised positions, wearing revealing clothing. Some accounts have amassed hundreds of thousands of followers in a matter of months. One profile, claiming to be conjoined twins, has about 400,000 followers, despite only joining Instagram in December 2025.Kamran Mallick, chief executive of Disability Rights UK, said the emergence of \"accounts that fetishise, mock, or monetise the identities of disabled people is nothing short of horrific\".He added: \"What we have here is technology weaponised to strip disabled people of their agency and dignity, turning our lived experiences into digital caricatures for the profit and titillation of others.\"Medical charities have also voiced concern. A spokesperson for Gemini Untwined, which funds specialist surgery for rare newborns joined by the head, said portraying conjoined twins as entertainment was \"morally reprehensible\".They added: \"We witness first-hand the medical challenges that these children and their families endure, which makes the portrayal of conjoined twins as a form of entertainment or spectacle especially problematic.\"Dr Amy Gaeta, from the University of Cambridge, told the BBC she researches how AI shifts power in relation to gender and disability. She said the internet is \"flooded\" with free and low-cost generative AI image-making tools. Generative AI is a type of software that creates new content based on patterns it has learned from existing data in response to a user's prompt.Gaeta said while some tools have restrictions on content, like banning sexually explicit prompts, others do not or can be easily bypassed. \"Sometimes, without my prompting or intent, hypersexualized images of disabled people will be generated. This clearly shows a bias in the datasets that these tools are trained upon,\" she said.ReutersThere are countless generative AI platforms, including one made by Meta itselfAn Ofcom spokesperson said it was \"tracking how AI is evolving, the risks that may emerge, and what actions may be needed to address them\".They said the watchdog's online safety rules require tech firms to tackle illegal content and protect children from harmful material - including abusive or hateful content.The Online Safety Act requires platforms like Instagram to apply terms of service consistently, including where content mocks people based on protected characteristics, like their disability.The Equality and Human Rights Commission said the accounts flagged by the BBC were \"deeply disturbing\", adding: \"It's vital there are robust regulatory powers in the digital space to protect people from harm.\"A spokesperson for Meta said it was investigating the content and that it removes material that promotes sexual exploitation or attacks people based on protected characteristics.While these accounts are generating fake personas, there is serious concern over the commands for the generative tools behind them.Alison Kerry, head of communications at disability equality charity Scope, said the practice amounted to \"discrimination dressed up as content\".She added: \"These AI images don't appear from nowhere – they're built from real disabled people's images, often without consent – and unmoderated comment threads turbocharge objectification and harassment.\"Gaeta said moderation on sites like Instagram is not strong enough.\"Even when safeguards are in place, it has been proven relatively easy to bypass these if someone is insistent enough on doing so,\" she said.\"Big tech needs to be held accountable just as much as misogyny and ableism need to be tackled.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disability charities warn of \"fetishising\" AI profiles on social media",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ff8/live/fd9a5540-1236-11f1-b586-1ba1b8fe72ec.jpg"
      ],
      "datePublished": "2026-02-27T00:39:20.000Z",
      "dateModified": "2026-02-27T00:39:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ed Miliband says climate impact of data centres is uncertain",
    "url": "https://www.bbc.com/news/articles/cx2drxgz7x8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d21b/live/65810f20-1334-11f1-ba29-8dbbd227222d.jpg",
    "tag": "Trending",
    "date": "2026-02-27T00:03:54.000Z",
    "description": "8 hours agoJoshua NevettPolitical reporterPA MediaEnergy Secretary Ed Miliband is leading the UK government's efforts to reduce carbon emissionsEnergy",
    "body": "8 hours agoJoshua NevettPolitical reporterPA MediaEnergy Secretary Ed Miliband is leading the UK government's efforts to reduce carbon emissionsEnergy Secretary Ed Miliband has said the impact of the rapid expansion of data centres on the UK's efforts to lower carbon emissions to net zero is \"inherently uncertain\".Miliband made the comment in a letter to MPs who had expressed concerns about data centres not being mentioned in the government's plans to deliver net zero.MPs have launched a new inquiry into the environmental impacts of data centres in the UK after receiving Miliband's letter.Data centres are giant facilities full of powerful computers used to run digital services, such as streaming and artificial intelligence (AI).The UK government wants the country to be a world leader in AI and is seeking to attract investment in data centres to achieve this goal.But there are concerns about the large amounts of water and electricity needed to run them, including from gas-powered generators.Dozens of new data centres, many funded by US tech firms, are being planned and environmental campaigners fear this could significantly increase emissions.The UK government is under a legal obligation to reduce carbon emissions to net zero by 2050, after a law change passed in 2019 with cross-party support.In his letter, Miliband said the government's modelling \"accounts for potential emissions from data centres through our projection of overall electricity demand growth, which reflects broader economic trends\".But he added: \"Future demand from data centres, and interaction with wider energy system demands, remains inherently uncertain.\"Miliband said the modelling would \"test a range of trajectories to assess the potential emissions impact under different outcomes\".It is the most detail Miliband has given yet on his department's approach to factoring in the impact of data centres.Increasing demandThe response was prompted by a letter from the chair of the Environmental Audit Committee, Toby Perkins, who asked Miliband whether data centres had been factored into net-zero plans.His committee's new inquiry will examine how much energy and water data centres are likely to use, and how this could impact the government's net zero goals.\"Will data centres power the UK's economic growth? Perhaps,\" Perkins said.\"But what kind of implications will they have for energy and the environment?\"The Labour MP said it was \"critical that we really consider what the impacts of data centres will be before we charge into approving them en masse\".The Conservative shadow energy secretary, Claire Coutinho, said barring data centres from the UK \"because of domestic net zero targets will do nothing to tackle climate change, but it will make us all poorer\".She added: \"If we adopted a more rational approach we could have the benefits of growth from AI, focus our attention on exporting the clean tech the rest of the world needs, and protecting nature here and abroad.\"Getty ImagesThe number of data centres, like this Google facility in Hertfordshire, is increasingThe UK government has been investing heavily in renewable energy in its bid to meet 95% of electricity demand with clean power by 2030.But the rapid rise in electricity demand could make it more difficult to meet the target.This month Ofgem, the UK's energy market regulator, said a surge in demand for grid connections last year had been \"driven by the rapid growth\" of data centres.In a report, Ofgem said it was aware of 140 proposed data centres, which would require about 50 gigawatts (GW) of electricity – 5GW more than the country's current peak demand.Friends of the Earth, a campaign group, said if all of those data centres came online, \"they could consume more electricity each day than the entire country does now\".\"It's no wonder the government views the future usage of data centres as 'inherently uncertain',\" said Mary Stevens, a spokesperson for the group.\"What isn't uncertain is this government's growth-at-all-costs agenda.\"\"Having greenlit rampant airport expansion, and now potentially a raft of data centres, it's unclear how ministers will ensure the UK sticks to its legally binding climate targets and prevents rocketing emissions and water usage,\" the Friends of the Earth spokesperson added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ed Miliband says climate impact of data centres is uncertain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d21b/live/65810f20-1334-11f1-ba29-8dbbd227222d.jpg"
      ],
      "datePublished": "2026-02-27T00:03:54.000Z",
      "dateModified": "2026-02-27T00:03:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China removes nine military officials ahead of key political meeting ",
    "url": "https://www.bbc.com/news/articles/c6270z0dr6no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/68e7/live/2331aec0-1386-11f1-93b0-b93a7c0c5701.jpg",
    "tag": "Trending",
    "date": "2026-02-27T04:29:01.000Z",
    "description": "4 hours agoYvette TanGetty ImagesSince coming to power, Xi has launched waves of anti-corruption drivesChina has removed 19 officials, including nine ",
    "body": "4 hours agoYvette TanGetty ImagesSince coming to power, Xi has launched waves of anti-corruption drivesChina has removed 19 officials, including nine from the military, from its list of lawmakers ahead of its biggest annual political meeting next week.The removals were announced by the country's top legislative body, the National People's Congress (NPC) Standing Committee. No official reason for the removal has been given, but it comes just weeks after President Xi Jinping removed Zhang Youxia, his highest-ranking general and also one of his closest military allies, from his role. Since coming to power, Xi has launched waves of anti-corruption drives, calling corruption \"the biggest threat\" to the Communist Party. However, some critics say it has been used as a tool to purge political rivals.According to a report by state media outlets, those removed include Li Qiaoming, commander of the People's Liberation Army (PLA) Ground Force and Shen Jinlong, a former PLA Navy commander. Also on the list were several other military officers and a number of provincial officials including Sun Shaochong, the former party chief of the Inner Mongolia region. It comes just weeks after Zhang was removed from his post, after he was accused of \"serious violations of discipline and law\" - typically a euphemism for corruption.But it is also the latest in a series of purges of high-profile figures in the military over the last few years, including a October 2025 crackdown which saw nine top generals removed from their posts. Authorities at the time said the purges were part of an anti-corruption drive. Xi has made the fight against corruption a central pillar of his rule beginning with his \"tigers and flies\" anti-corruption drive targeting both high-level and low-level officials, launched shortly after he took power in 2013. He has said recently that the battle \"remains grave and complex\".Thousands of delegates are due to descend on the capital Beijing next week for the Two Sessions. These are- the annual meetings of the NPC, which is China's legislature, and the Chinese People's Political Consultative Conference which is the country's top political advisory body.The Two Sessions will run from March 4 to 11 and will see the government announce its five year plan, where it outlines its key policy objectives, and its annual economic targets. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China removes nine military officials ahead of key political meeting ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/68e7/live/2331aec0-1386-11f1-93b0-b93a7c0c5701.jpg"
      ],
      "datePublished": "2026-02-27T04:29:01.000Z",
      "dateModified": "2026-02-27T04:29:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]