[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is The Economy On The Up? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mph4k6?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-18T19:32:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Dec 2025,·33 minsAvailable for over a yearToday, the Bank of England has cut interest rates to the lowest level since early 2023. \nChancellor Rachel Reeves calls it \"good news for families with mortgages and businesses with loans\" - but says there's \"more to do\". Meanwhile, the Bank now expects no economic growth at the end of this year. Faisal is with Tristan in the studio to talk it through.\nAnd, tension is still building between the US and Venezuela. President Donald Trump has ordered \"a total and complete\" blockade of all sanctioned oil tankers entering and leaving Venezuela - a move denounced by Caracas as \"warmongering threats\". Tristan is joined by his global story host Asma Khalid and Vanessa Buschschlüter Latin America and Caribbean Editor for the BBC News website. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Tristan Redman. It was made by Jack Maclaren and Jem Westgate. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is The Economy On The Up? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-18T19:32:00.000Z",
      "dateModified": "2025-12-18T19:32:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Has Trump’s chief of staff revealed White House secrets? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-17T22:19:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Dec 2025,·30 minsHas Trump’s chief of staff revealed White House secrets?AmericastAvailable for over a yearSusie Wiles is widely credited as being the mastermind behind Donald Trump’s successful presidential campaign last year. The White House Chief of Staff, referred to by the president as the “most powerful woman in the world”, is the gatekeeper to the Oval Office and a crucial figure in delivering Trump’s national agenda. \nShe also rarely speaks to the media, making her an elusive figure in the president’s top team despite her significant influence. But in a series of interviews for Vanity Fair, she refers to Donald Trump as having an “alcoholic’s personality”, describes JD Vance as a “conspiracy theorist” and Elon Musk as an “odd, odd duck”. The White House has described the articles as a “framed hit piece” and accused Vanity Fair of taking statements out of context.\nIn today’s podcast, Justin and Anthony go through some of the most revealing lines from the interviews, and speak to the journalist who sat down with Susie Wiles - Chris Whipple - to find out why he thinks Wiles wanted to speak with him, and how he responds to White House criticism of the interviews.\nHOSTS:\n• Justin Webb, Radio 4 Presenter\n• Anthony Zurcher, North America Correspondent\nGUEST:\nChris Whipple, Journalist and author of several White House books, including Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History \nGET IN TOUCH:\n• Join our online community: https://discord.gg/qSrxqNcmRB\n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast\nThis episode was made by George Dabby with Alix Pickles. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including The Global Story, The Today Podcast, and of course Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd\nThe Today Podcast: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzmProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Has Trump’s chief of staff revealed White House secrets? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-17T22:19:00.000Z",
      "dateModified": "2025-12-17T22:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French court rejects Shein website ban over childlike sex dolls",
    "url": "https://www.bbc.com/news/articles/c5y9x4pj54eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/46fc/live/702e6780-dceb-11f0-afe3-9729680155d8.jpg",
    "tag": "Trending",
    "date": "2025-12-19T15:49:16.000Z",
    "description": "27 minutes agoMichael Sheils McNameeBusiness reporterGetty ImagesA Paris court has rejected an effort by the French government to suspend the website ",
    "body": "27 minutes agoMichael Sheils McNameeBusiness reporterGetty ImagesA Paris court has rejected an effort by the French government to suspend the website of fast-fashion giant Shein in response to it selling childlike sex dolls on its platform.The court said the request for a three-month suspension was \"disproportionate\" - but did order age verification for the sale of adult products.The action against Shein was taken after France's consumer watchdog last month reported it to authorities for selling \"sex dolls with a childlike appearance\" and weapons. Shein said its priority remained protecting French consumers and ensuring compliance.In its judgement, the court acknowledged the seriousness of selling the childlike sex dolls and weapons, but said these had been isolated incidents. It noted that the Chinese company had taken action to remove the offending items once they were made aware of them, and that the issues related to a small number of the hundreds of thousands of products on sale on its site. In response to the initial controversy, Shein announced it would be banning the sale of all sex dolls on its site internationally. A request by the French government for Shein to be forced to suspend the sale of third-party items on its website - the source of the initial offending items - was also rejected. In ordering age verification measures to be put in place for the sale of adult items, the court said the fine for each breach would be €10,000 (£8,700; $11,700). The decision to suspend Shein's website in early November coincided with the company opening its first physical store in the French capital. Its launch drew both shoppers and protesters, with opposition related to the sale of childlike sex dolls, and also its profile as a fast fashion retailer. In a statement, Shein said: \"We remain committed to continuously improving our control processes, in close collaboration with the French authorities, with the aim of establishing some of the most stringent standards in the industry.\"Our priority remains protecting French consumers and ensuring compliance with local laws and regulations.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French court rejects Shein website ban over childlike sex dolls",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/46fc/live/702e6780-dceb-11f0-afe3-9729680155d8.jpg"
      ],
      "datePublished": "2025-12-19T15:49:16.000Z",
      "dateModified": "2025-12-19T15:49:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aria Thorpe's parents say 'our hearts are broken' by her death",
    "url": "https://www.bbc.com/news/articles/c33m2j4nnkro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8168/live/12f01eb0-dcf5-11f0-bc51-61713ec32de7.jpg",
    "tag": "Trending",
    "date": "2025-12-19T16:13:25.000Z",
    "description": "Family of stabbed girl, 9, say 'our hearts are broken'Just nowFamily photographAria Thorpe's family said her death had left them \"devastated\"The famil",
    "body": "Family of stabbed girl, 9, say 'our hearts are broken'Just nowFamily photographAria Thorpe's family said her death had left them \"devastated\"The family of nine-year-old Aria Thorpe, who died from a single stab wound in Weston-super-Mare on Monday, have described her as \"the most beautiful little soul\".In a statement, they added: \"Our hearts are broken in a way we never imagined possible.\"Aria's father, Tom Thorpe, said her death was \"devastating\" and added: \"You will be greatly missed, you special little angel. A life gone far too early but I hope a life lived well. We all love you dearly. Goodnight darling.\"A 15-year-old boy appeared at Bristol Crown Court on Friday charged with her murder.This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.You can receive Breaking News on a smartphone or tablet via the BBC News App. You can also follow @BBCBreaking on X to get the latest alerts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aria Thorpe's parents say 'our hearts are broken' by her death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8168/live/12f01eb0-dcf5-11f0-bc51-61713ec32de7.jpg"
      ],
      "datePublished": "2025-12-19T16:13:25.000Z",
      "dateModified": "2025-12-19T16:13:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Young people to be hit hardest by UK's ageing society, report suggests",
    "url": "https://www.bbc.com/news/articles/c997l3elxmxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3741/live/159397d0-dcde-11f0-81cc-998682630b3d.jpg",
    "tag": "Trending",
    "date": "2025-12-19T14:53:15.000Z",
    "description": "Young people will be hit hardest by successive governments' failure to focus on financial and societal challenges caused by an ageing population, a Ho",
    "body": "Young people will be hit hardest by successive governments' failure to focus on financial and societal challenges caused by an ageing population, a House of Lords report has suggested.They will need to plan and prepare to work longer and save more from a much earlier age, the economic affairs committee said.The report also found that the crisis in adult social care \"remains a scandal\" which needs to be addressed urgently.Committee chair Lord Wood of Anfield told the BBC it was a \"struggle to find where in government\" there was a focus on ageing and the \"transformational effects\" it was going to have on people. \"Ageing is something that we're just watching happening\", he told BBC Radio 4's Today programme, adding: \"We know that adaptation is the way forward\".Policies governments have used to address the impact of declining fertility and rising life expectancy in the UK - raising the state pension age or increasing immigration for example - were not adequate solutions on their own, the report said.Getting more people in their 50s and 60s to stay in or return to work \"is key\", the committee said, and the government must prioritise incentives to do so.It also said an ageing population will need more care workers, leaving fewer workers for other parts of the economy.There is \"widespread ignorance\" of how much it costs to retire, it said, and the government should consider an education campaign - as well as finding out if the UK's financial services sector is equipped to provide for the population as it ages.Lord Wood said that the government and financial services industry needs to devise \"more innovative ways of getting younger people to think about lives frankly they can't conceive of at the moment - when they're in their eighties and early nineties.\" \"There's a long time for them to be financially planning for at a time when we know young people are doing less financial planning,\" he added.\"Raising the state pension age, which saves the government money, but increases pensioner poverty as many people have already stopped working by their sixties, is a red herring.\"To successfully confront this challenge, the approach to financial management of today's and tomorrow's young people will need to change.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Young people to be hit hardest by UK's ageing society, report suggests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3741/live/159397d0-dcde-11f0-81cc-998682630b3d.jpg"
      ],
      "datePublished": "2025-12-19T14:53:15.000Z",
      "dateModified": "2025-12-19T14:53:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Why has Charlotte Church given up deodorant?",
    "url": "https://www.bbc.com/news/articles/cjdrp53993zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/649e/live/b718eb90-dc30-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-18T17:48:45.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live22 ",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live22 hours agoThis week, Taylor Swift talked about the Southport stabbing attack, King Charles shared good news about his cancer treatment, and a couple from Wales won a second million-pound lottery jackpot.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy testing your memory? Try last week's quiz, or have a go at something from the archives.Charlotte ChurchHealth",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Why has Charlotte Church given up deodorant?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/649e/live/b718eb90-dc30-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-18T17:48:45.000Z",
      "dateModified": "2025-12-18T17:48:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government data stolen in hack, minister confirms ",
    "url": "https://www.bbc.com/news/articles/cj4qpwprw9vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f699/live/c48d92e0-dcb1-11f0-990f-63d399b5e220.jpg",
    "tag": "Trending",
    "date": "2025-12-19T11:59:19.000Z",
    "description": "4 hours agoSam FrancisPolitical reporter Government data has been stolen in a hack though officials believe the risk to individuals is \"low\", Trade Mi",
    "body": "4 hours agoSam FrancisPolitical reporter Government data has been stolen in a hack though officials believe the risk to individuals is \"low\", Trade Minister Chris Bryant has said.That data is understood to have been on systems operated on the Home Office's behalf by the Foreign Office, whose staff detected the incident.It is understood a Chinese affiliated group is suspected of being behind the attack.The UK government has not named who it thinks is responsible, with a spokesperson saying it has been \"working to investigate\" the incident.Speaking to BBC Breakfast, Bryant said investigations were \"ongoing\", adding that the security gap was \"closed pretty quickly\".\"We think that it is a fairly low-risk that individuals will have been compromised or affected,\" he added.Speaking to Times Radio, he said: \"I'm not able to say whether it is directly related to Chinese operatives, or indeed the Chinese state\".The Sun newspaper has reported that the incident took place in October, with information possibly including visa details targeted. The incident has been referred to the Information Commissioner's Office.UK intelligence agencies have warned about increasing, large-scale espionage from China, using cyber and other means, and targeting commercial and political information.The cyber-agency GCHQ said last year that it was devoting more resources to counter threats from China than any other nation.\"Government facilities are always going to be potentially targeted,\" Bryant said on Friday. \"We are working through the consequences of what this is.\" Confirmation of a hack by a Chinese state group would be awkward for the government ahead of a planned visit to Beijing next year by Sir Keir Starmer, the first by a UK prime minister since 2018.The Labour government has said it is important to engage with China as it cannot be ignored on trade, climate change and other major issues, but face-to-face meetings also provide a forum for robust exchanges about issues affecting UK security.The Chinese government has consistently denied it backs cyber-attacks targeting the UK.Last year, responding to the UK government's National Security Strategy, a spokesperson for the Chinese embassy in London said \"accusations such as Chinese espionage, cyber-attacks, and transnational repression against the UK are entirely fabricated, malicious slander\".Earlier this month, Sir Keir said UK government policy towards China could not continue to blow \"hot and cold\".Failing to navigate a relationship with China, he said, would be a \"dereliction of duty\" when China is a \"defining force in technology, trade and global governance\".Building a careful relationship would instead bolster the UK's place as a leader on the international stage and help secure UK national interests, Sir Keir said, while still recognising the \"reality\" that China \"poses national security threats\".While it remains unclear how hackers gained access in this instance, Jamie MacColl, a senior research fellow in cyber and tech at the Royal United Services Institute (RUSI), told the BBC government departments often use \"old IT\" systems.Jake Moore, global cybersecurity adviser to software company ESET, said government departments needed to invest in \"better digital defences\" because \"they will continue to be targeted\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government data stolen in hack, minister confirms ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f699/live/c48d92e0-dcb1-11f0-990f-63d399b5e220.jpg"
      ],
      "datePublished": "2025-12-19T11:59:19.000Z",
      "dateModified": "2025-12-19T11:59:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fraught EU summit backs Ukraine but divisions are clear",
    "url": "https://www.bbc.com/news/articles/cjezpd95v71o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d26/live/bcbd52f0-dcb9-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-19T09:44:56.000Z",
    "description": "After 17 hours of at times heated debate, EU leaders agreed in the early hours of Friday morning to jointly raise €90bn (£79bn; $105bn) in zero-intere",
    "body": "After 17 hours of at times heated debate, EU leaders agreed in the early hours of Friday morning to jointly raise €90bn (£79bn; $105bn) in zero-interest loans to keep Ukraine financially afloat for the next two years. Kyiv had been clear: the money wasn't a nice-to-have; it was a must-have. With the US under Donald Trump no longer looking to provide new direct military aid to Ukraine, the war-torn country has turned to Europe. Without the cash, Volodymyr Zelensky told EU leaders he wouldn't have enough money to pay Ukrainian soldiers or buy the weapons he needed to counter Russian aggression.The now agreed EU loan will be guaranteed by the bloc's common budget. But in a blow to Brussels' desire to demonstrate decisive European unity over Ukraine to EU sceptics in Washington and Moscow, Hungary, Slovakia and the Czech Republic only agreed to support the plan -  it required unanimity to be passed - if they were exempt from it individually. Yet another indication of the divisions in Europe over attitudes to Ukraine and to Moscow.Hungary and Slovakia are known to be closer to the Kremlin. This brings them into direct confrontation with EU countries geographically nearer to Russia such as Poland and the Baltic States. They view Ukraine's survival against Russia as existential. If Kyiv were to lose to Moscow on the battlefield because it was cash or weapons-strapped, they believe that would embolden Russia and would be a disaster for European security and stability more broadly.Arriving at the start of Thursday's fraught summit, Polish Prime Minister Donald Tusk said EU leaders had a clear decision to make: pay money today, he said, or pay in blood tomorrow. He said he wasn't talking about Ukraine. He was talking about Europe.The new EU joint-loan plan for Ukraine replaces a much-debated EU proposal to raise the €90bn using frozen Russian state assets held in the bloc (€210bn euros' worth in total), mostly in Belgium. Kyiv had described that idea as morally justified, considering the billions of dollars' worth of destruction wreaked by Moscow on Ukraine. But a number of EU countries feared legal retribution by Russia. They worried too that the eurozone's international reputation as a safe destination for global assets could be damaged. Brussels said on Friday it was considering using the frozen Russian assets eventually, to repay the EU loan to Ukraine. But that would be something to be worked out in the future - if a peace deal is signed.For now, on top of the new EU loan, it's estimated Ukraine will need another €45bn euros to cover all its costs for 2026/2027.Brussels hopes non-EU allies of Ukraine like the UK, Japan and Canada might pick up some of that tab. Not going bankrupt now also opens the door for Kyiv to receive loans from banks like the IMF.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fraught EU summit backs Ukraine but divisions are clear",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d26/live/bcbd52f0-dcb9-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-19T09:44:56.000Z",
      "dateModified": "2025-12-19T09:44:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Richard Moth new Archbishop of Westminster and Catholic leader in England and Wales",
    "url": "https://www.bbc.com/news/articles/c5yq7l244ydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5298/live/98242b10-dcd4-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-19T13:12:36.000Z",
    "description": "3 hours agoAleem Maqbool, Religion editorThe Vatican has announced that Richard Moth will be the new Archbishop of Westminster, making him the head of",
    "body": "3 hours agoAleem Maqbool, Religion editorThe Vatican has announced that Richard Moth will be the new Archbishop of Westminster, making him the head of the Catholic Church in England and Wales.He succeeds Cardinal Vincent Nichols, who has held the role since 2009 and has stepped down aged 80.For the past 10 years Richard Moth has been Bishop of Arundel and Brighton, and before that served as Bishop of the Forces.As Archbishop of Westminster he will become president of the Bishops' Conference of England and Wales and lead an estimated six million Catholics.Cardinal Nichols reached retirement age when he was 75, but was asked to stay on by Pope Francis. In May he took part in the conclave that elected Pope Leo XIV.The search for a replacement for Cardinal Nichols was led by the Apostolic Nuncio, or papal ambassador to the UK, who presented a list of potential candidates to Pope Leo.Earlier this week, Archbishop Moth released a joint statement calling for empathy for \"those who come to this country for their safety\", reminding Catholics that Jesus's family fled to Egypt as refugees.He has been one of the bishops leading the Church's response to social justice issues in the UK, including praising the scrapping of the two-child benefit cap.Speaking at a news conference on Friday, outgoing Cardinal Nichols said his successor would bring \"experience and practical wisdom to the life of the diocese\".Archbishop Moth said: \"My first task here is to get to know everybody... to get to know priests and people, to get to know schools, to get to know the life of this wonderful diocese here in Westminster\".He said his focus had \"consistently been in the area of social justice\", adding he had a \"particular concern for prisons\".Archbishop Moth will face the challenge of declining numbers of people attending churches nationally, though there is growth in some churches with immigrant Catholics.In response to the growing use of Christian symbols at, for example, rallies organised by the far-right activist Tommy Robinson, Bishop Moth has talked of his concern.Last weekend, Robinson held an event in London saying he wanted to \"reclaim\" the country's heritage and Christian identity.\"We are concerned about the tensions that are growing in society and the desire by some groups to sow seeds of division within our communities. This does not reflect the spirit or message of Christmas,\" Bishop Moth said in a statement with the Archbishop of Birmingham.The Catholic Church has been heavily involved in providing assistance to those who have suffered in the cost of living crisis.As archbishop, Richard Moth will also lead the Church's constant challenge of dealing with safeguarding issues.In 2020, a wide-ranging inquiry into child sexual abuse found that between 1970 and 2015 the Catholic Church in England and Wales received more than 3,000 complaints of child sexual abuse against more than 900 individuals connected to the Church.In fact, the leadership of Archbishop Moth's predecessor, Cardinal Nichols, was criticised in the inquiry report, which said he cared more about the impact of abuse on the Church's reputation than on the victims.At the time, Cardinal Nichols apologised and said he accepted the report, adding: \"That so many suffered is a terrible shame with which I must live and from which I must learn.\"Cardinal Nichols retires having led the Church in England and Wales for 16 years, during which it faced enormous change.He is the son of two teachers and was born in Crosby. The lifelong Liverpool FC fan took up his first role as a priest in Wigan.In 2010, he welcomed Pope Benedict XVI to England on an official visit.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Richard Moth new Archbishop of Westminster and Catholic leader in England and Wales",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5298/live/98242b10-dcd4-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-19T13:12:36.000Z",
      "dateModified": "2025-12-19T13:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will the TikTok deal mean the app changes in the US?",
    "url": "https://www.bbc.com/news/articles/clydp2ygrveo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c377/live/a166ca10-dca8-11f0-bf97-a767b375b25e.jpg",
    "tag": "Trending",
    "date": "2025-12-19T13:45:50.000Z",
    "description": "Will the US TikTok deal make it safer but less relevant?2 hours agoLaura Cress,Technology reporterandLily Jamali,North America technology corresponden",
    "body": "Will the US TikTok deal make it safer but less relevant?2 hours agoLaura Cress,Technology reporterandLily Jamali,North America technology correspondent, San FranciscoGetty ImagesTikTok's Chinese owner ByteDance has signed a deal with investors to run its business in the US.But what does this mean for the over 170 million Americans (or so the social media platform claims) who use the app?The key may lie in how TikTok's recommendation algorithm - the powerful system that curates the platform's For You Page to predict content you might watch - is managed when it changes hands.Social media industry expert Matt Navarra told the BBC the question will not be whether TikTok survives, but \"what version of TikTok survives\".'Smoothing out the edges'Currently, TikTok's system depends on huge amounts of global data and feedback loops, which can change recommendations in an instant.Under the terms of the deal TikTok's algorithm, which will be licensed by investor Oracle, is set to be retrained on American user data.Mr Navarra said this could leave the app feeling \"safer and sturdier\" but also leaving it at a risk of \"becoming less culturally essential\" as a result.\"TikTok's power has always come from feeling slightly out of control - weird, niche, uncomfortable, sometimes politically sharp content for anyone else or before it goes anywhere else,\" he said.\"If you start smoothing those edges, you don't just change moderation. I think you change its relevance.\"Matching ByteDance's algorithmWhether the US version will differ from the TikTok so many know and use already may also depend on if it gets \"all the new features, security updates and platform improvements\" as soon as the international version does, tech journalist Will Guyatt told the BBC.And computing expert Kokil Jaidka from the National University of Singapore said she expected the things that make the platform popular - such as its short videos and shopping - are likely to \"stay intact\" as these features are not dependent on the algorithm.She said the changes might be more subtle and gradual, depending on if the narrower data inputs of the \"siloed\" US version can match the app's global reach.\"If TikTok is operating with a licensed or partially diluted version of its recommendation algorithm, some of the system's blind spots may start to matter more,\" she said.For users, she said this means in practice the US algorithm may \"lag in personalisation\" and take longer to adapt to viral content.To experiment or behave?Oracle is TikTok's longtime cloud computing partner in the United States, and is chaired by Larry Ellison, an ally of President Trump.Another foreign entity, MGX - an Abu-Dhabi government investment fund - will join it along with private equity firm Silver Lake as the main incoming investors.Pressure from these investors may also add to the US app feeling \"blander\" said Mr Navarra.\"I think the real test won't be whether the users leave,\" he said.\"It will be whether TikTok still feels the place the internet goes to experiment - or if it becomes the place it goes to behave.\"Additional reporting by Peter Hoskins.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will the TikTok deal mean the app changes in the US?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c377/live/a166ca10-dca8-11f0-bf97-a767b375b25e.jpg"
      ],
      "datePublished": "2025-12-19T13:45:50.000Z",
      "dateModified": "2025-12-19T13:45:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN-backed experts say Gaza food supplies improving but 100,000 still in 'catastrophic conditions'",
    "url": "https://www.bbc.com/news/articles/ckgdpz0gp3jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7654/live/fad28a70-dcc7-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-19T15:04:23.000Z",
    "description": "1 hour agoYolande Knell,Middle East correspondentandDoug FaulknerUN-backed experts say there have been improvements in nutrition and food supplies in ",
    "body": "1 hour agoYolande Knell,Middle East correspondentandDoug FaulknerUN-backed experts say there have been improvements in nutrition and food supplies in Gaza since the ceasefire, but 100,000 people still experienced \"catastrophic conditions\" last month. In August, the Integrated Food Security Phase Classification (IPC) which monitors and classifies global hunger crises said that half a million people - about a quarter of Gaza's population - lived in areas suffering from famine.The UN and other humanitarian agencies have been able to increase food getting into Gaza since October's ceasefire between Israel and Hamas.Israel's foreign ministry said the IPC report was \"deliberately distorted\" and \"doesn't reflect the reality in the Gaza Strip\".The latest IPC analysis suggests that a month ago, half a million Gazans were still facing emergency conditions and more than 100,000 were still under the highest level of food insecurity - IPC Phase 5 - experiencing \"catastrophic conditions\". It projects that number will continue to decrease but stressed the situation remains \"highly fragile\".  IPC Phase 5 signifies the most extreme level of food insecurity, labelled \"famine\" for an area or \"catastrophe\" when referring to households. The report said no areas in Gaza were now classified as \"in famine\".Israel rejected the original findings of famine by the IPC and has continued to criticise its methodology.  Cogat, the Israeli military body which controls Gaza's crossings, said the number of trucks with food aid entering each week went beyond what the UN had determined it needed.\"The report relies on severe gaps in data collection and on sources that do not reflect the full scope of humanitarian assistance,\" the body said in a statement.Responding to the Cogat ctiticism, the IPC said publicly available data from UN sources and Cogat had been used for the analysis. The IPC said acute malnutrition was at critical levels in Gaza City and serious in Deir al-Balah and Khan Younis.In the coming months the situation is expected to remain severe but the number of people facing the most severe conditions is predicted to fall to 1,900 by April, according to the report.But it added that, if there were renewed hostilities, the entire Strip would be at risk of famine.Israel's Prime Minister Benjamin Netanyahu said earlier this month that the second phase of the US-brokered peace plan - which would see Israel withdraw troops further from Gaza and Hamas disarm - was close but key issues still needed to be resolved.The IPC said key drivers of food insecurity included restricted humanitarian access, displacement of more than 730,000 people and the destruction of livelihoods - including more than 96% of crop land in Gaza being destroyed or inaccessible.Israel imposed a total blockade on aid deliveries to Gaza at the start of March this year, which was eased in May, saying it wanted to put pressure on the armed group Hamas to release hostages remaining in Gaza at the time.Ahead of this IPC report, Cogat said the body had not engaged with the US or Israel and its methodology, \"reinforcing a false narrative, driven in part by Hamas-sourced claims\".It also denied Israel was preventing winter and medical supplies from entering the territory and that there was a shortage of drinking water.Unwra, the UN agency for Palestinian refugees, said that while, the report stated Gaza was no longer in famine, the situation remained \"critical\".\"Overall living conditions in the Gaza Strip are still catastrophic, made worse by the winter weather,\" it said in a statement, adding there must be \"sustained, expanded, and consistent humanitarian and commercial access\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN-backed experts say Gaza food supplies improving but 100,000 still in 'catastrophic conditions'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7654/live/fad28a70-dcc7-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-19T15:04:23.000Z",
      "dateModified": "2025-12-19T15:04:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michelle Mone-linked PPE firm liquidated and unlikely to repay £148m",
    "url": "https://www.bbc.com/news/articles/c80x9gdj159o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4a02/live/8edd50c0-dc18-11f0-babc-21f9e89ffedf.jpg",
    "tag": "Trending",
    "date": "2025-12-19T10:50:37.000Z",
    "description": "5 hours agoPaul Hastie,Paris GourtsoyannisandJosh Martin,Business reporterGetty ImagesBaroness Michelle Mone in the House of Lords with her businessma",
    "body": "5 hours agoPaul Hastie,Paris GourtsoyannisandJosh Martin,Business reporterGetty ImagesBaroness Michelle Mone in the House of Lords with her businessman husband Douglas BarrowmanThe UK Government is unlikely to see most of the £148m it is owed by a faulty PPE supplier linked to Baroness Michelle Mone after the company was wound up.PPE Medpro, a consortium run by Mone's husband Douglas Barrowman, was placed into liquidation at the Insolvency and Companies Court on Thursday. It follows a High Court ruling in October, which found that the firm breached a contract to supply 25 million surgical gowns during the Covid pandemic.PPE Medpro filed for administration in September, a day before the order to pay. HM Revenue & Customs is separately owed £39m in tax.Records filed by PPE Medpro's administrators have revealed it only had around £600,000 available to pay unsecured creditors.At the Insolvency and Companies Court, barristers for the three joint administrators asked for the firm to be kept in administration to pay off money owed.But lawyers for the Department for Health and Social Care (DHSC) said PPE Medpro was \"hopelessly insolvent\" and asked for the firm to be wound up.Despite the order to pay back the money, as an unsecured creditor it's unlikely the DHSC will recover the millions of pounds owed.In his ruling, Judge Sebastian Prentis placed the company into liquidation.He said: \"The department's debt is very large indeed and it is a debt which has been incurred through the supply of defective equipment at a time of national crisis.\"Judge Prentis said that there would be \"questions of how this debt may be recovered\" from the firm, adding that there was \"very little\" money left.Health Secretary Wes Streeting said the DHSC would not rest until it had got back the \"hard-earned taxpayer money paid to rogue operators like PPE Medpro\".He added: \"During the pandemic, when the whole country was making huge sacrifices, separated from family and loved ones, PPE Medpro supplied defective PPE and unfairly profited.\"We will keep going after PPE Medpro with everything we've got to get these funds back where they belong - in our NHS.\"'Establishment win'PPE Medpro was awarded lucrative contracts worth £122m to supply medical gowns to the NHS during the pandemic.It gained access to the  government's VIP lane to fast-track approved suppliers.However, the equipment has been in storage since 2020 after the company failed to prove it was correctly sterilised.Mone described the October court ruling as \"nothing less than an establishment win for the government in a case that was too big to lose\".She was made a peer by Prime Minister David Cameron in 2015, but took a leave of absence and lost the Tory whip following the PPE revelations. Chancellor Rachel Reeves and Kemi Badenoch have both urged the Baroness to depart the Lords altogether.The UK government's insolvency service confirmed that an officer had been appointed to manage PPE Medpro's liquidation.A spokesperson said: \"As with all cases of this nature, they will investigate the cause of the company's failure and conduct of directors.\"Interpath Advisory were appointed joint liquidators of the company. They will wind up the company's affairs in accordance with their statutory duties.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michelle Mone-linked PPE firm liquidated and unlikely to repay £148m",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4a02/live/8edd50c0-dc18-11f0-babc-21f9e89ffedf.jpg"
      ],
      "datePublished": "2025-12-19T10:50:37.000Z",
      "dateModified": "2025-12-19T10:50:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watchdog hits out at potential delays to local elections",
    "url": "https://www.bbc.com/news/articles/cdd5p5gyvveo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d960/live/ae74a270-dceb-11f0-afe3-9729680155d8.jpg",
    "tag": "Trending",
    "date": "2025-12-19T15:43:11.000Z",
    "description": "20 minutes agoBecky MortonPolitical reporterGetty ImagesThe Electoral Commission has raised concerns about the prospect of more delays to council elec",
    "body": "20 minutes agoBecky MortonPolitical reporterGetty ImagesThe Electoral Commission has raised concerns about the prospect of more delays to council elections in England, saying it risks \"damaging public confidence\".Ministers have indicated they would agree to postpone local polls due next May until 2027 if councils request a delay.The government said some were concerned about their capacity to run the polls alongside a planned overhaul of town halls. But the commission, which oversees elections in the UK, said it did not think \"capacity constraints are a legitimate reason for delaying long-planned elections\".Vijay Rangarajan, the watchdog's chief executive, said there was also \"a clear conflict of interest in asking existing councils to decide how long it will be before they are answerable to voters\".Delays to elections risk \"affecting the legitimacy of local decision-making,\" he added. The government plans to get rid of the two-tier system of district and county councils, creating a swathe of new authorities that will be responsible for delivering all local services in their areas from 2028.On Thursday, ministers asked all 63 councils affected by the reorganisation that are due to hold elections in May to say whether they require a delay, with a deadline of 15 January to respond.In a statement - published on the last day before Parliament's Christmas break - Local Government Minister Alison McGovern said \"multiple\" councils had already asked for a postponement.She said they had raised concerns about their capacity to run \"resource-intensive elections to councils who may be shortly abolished\", alongside the reorganisation of local government.Others had questioned the cost to taxpayers of holding elections for councils that are due to be abolished, she added. McGovern argued councils \"are in the best position to judge the impact of potential postponements on their areas\" and \"the government will listen to them\".However, the move prompted a backlash from opposition parties, who have accused Labour of denying people the right to vote for local leaders in an attempt to keep control of councils.Whilst there is a precedent for cancelling elections to councils that are about to be replaced, the slow progress of the reorganisation has seen Labour face accusations it is acting undemocratically. 'Unprecedented' uncertaintyElections originally scheduled for May 2025 in nine areas, including Suffolk, East and West Sussex, and Essex, have already been postponed once.If elections are delayed again in any of these areas, it will mean some councillors will have sat for seven years without facing local voters.East Sussex County Council has already requested a further delay, saying it wants to focus its resources on delivering services, while West Sussex is reported to have done the same.However, councils in Essex and Hampshire have confirmed to the BBC they will not be asking for May elections to be postponed. Mr Rangarajan said: \"Scheduled elections should as a rule go ahead as planned, and only be postponed in exceptional circumstances.\"He said leaving decisions on potential delays until mid-January created \"unprecedented\" uncertainty for campaigners and administrators who needed time to prepare.\"Parties and candidates have already been preparing for some time, and will be understandably concerned,\" he added.'Stitch up'Labour has a majority in 18 of the 63 councils that have been asked about a potential delay, with the Conservatives holding a majority in nine and the Liberal Democrats in seven.However the Conservatives are defending the largest number of seats, at 610 - more than a quarter of those currently due for re-election in May.Reform UK, which is hoping to translate its leads in national opinion polls into big wins in May's local elections, has accused Labour and the Conservatives of working together to prevent the party making further gains.The Liberal Democrats have also claimed the move is a \"Labour and Conservative stitch up to deny people their votes\".The Conservatives have criticised the government's decision to offer further delays, claiming Labour is \"scared of the voters\".However, leader Kemi Badenoch has indicated she would would not stand in the way of Tory councils requesting a postponement.\"We need to listen to what they are saying, but in my view we should just have all these elections and be done with it,\" she told the BBC on Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watchdog hits out at potential delays to local elections",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d960/live/ae74a270-dceb-11f0-afe3-9729680155d8.jpg"
      ],
      "datePublished": "2025-12-19T15:43:11.000Z",
      "dateModified": "2025-12-19T15:43:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]