[
  {
    "title": "Aston Martin: Why they are in trouble before 2026 season starts",
    "url": "https://www.bbc.com/sport/formula1/articles/cr45w421yg4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0dd/live/7125a740-10c9-11f1-912a-116949699904.jpg",
    "tag": "Trending",
    "date": "2026-02-24T06:39:49.000Z",
    "description": "When Aston Martin's new Formula 1 car first appeared in testing at the end of January, it drew admiring glances up and down the pit lane.In its all-bl",
    "body": "When Aston Martin's new Formula 1 car first appeared in testing at the end of January, it drew admiring glances up and down the pit lane.In its all-black temporary colour, the car not only looked menacing, but also noticeably different from all its rivals. It included the sort of innovations that have become famous from design legend Adrian Newey, installed as managing technical partner at Aston Martin since March last year.But reality bit hard as soon as the car started to run. It was already late, and it managed just four laps on its first day in Barcelona before conking out at the entrance to the pit lane.Aston Martin's fortunes have barely improved since.The car was the slowest in the field by the end of pre-season testing last week, and had done the fewest miles.Team owner Lawrence Stroll looked like the bottom had fallen out of his world as he stalked the paddock in Bahrain, his face betraying a combination of anger and despair.The few times the car was out on track amid myriad reliability problems, it looked a handful for the drivers. Publicly, Aston Martin and Honda were saying little. Privately, no-one was trying to hide the reality. They were in trouble, they knew it, and whatever was wrong - and it was a lot - would take time to fix.It all looked so promisingNo Formula 1 team looked towards the 2026 season with greater expectations than Aston Martin.On paper, Stroll had put together a dream combination, one that seemed guaranteed to produce success.The signing of Newey in September 2024 seemed to be the final piece of the jigsaw the Canadian billionaire was creating to turn his team into championship contenders.In the previous years, Stroll had already inked a deal to become the factory engine partner of Honda, who won four consecutive drivers' titles with Red Bull and Max Verstappen from 2021-24, and two constructors' championships.He had funded a sparkling new factory, including a state-of-the-art wind tunnel and driver-in-the-loop simulator.He had put together an enviable sponsorship portfolio of boundless resources, including the full financial might of the state of Saudi Arabia, through its national oil company.And in the cockpit was another legend, Fernando Alonso. Ageing, certainly, now he is in his mid-40s, but still without question a major force behind the wheel.The past few years have not been easy for Aston Martin. A major step forward at the start of 2023, when Alonso first joined the team, led to six podiums in the first eight races and what could have been a win in Monaco, lost only to a wrong tyre choice during a late shower of rain.But in the second half of that season the team slipped back, as they failed to keep up with the development rate of their rivals. The same happened in 2024, from a lower starting point, and in 2025 they were simply uncompetitive, slipping to seventh in the championship from fifth the previous two years.Newey's arrival was supposed to herald the start of the turnaround, especially as historically he has aced regulation changes, producing design philosophies that were followed by rivals - in 1998 with McLaren, and again in 2009 and 2022 with Red Bull.The biggest rule regulation change in F1 history for 2026 gave him the chance to do it again, this time for Aston Martin.But the first car produced under his leadership has fallen far short of expectations, and a glance at the context makes this less of a surprise than it appears on the surface.In F1, success comes from stability, and that is the last thing Aston Martin have had in the past few years. There has been major leadership churn, and right at the top, too.This has included new recruits, such as chief technical officer Enrico Cardile, who finally arrived in July after a year on gardening leave from Ferrari.But also casualties. The most recent was Andy Cowell, the architect of the success of the Mercedes engine in the hybrid era. He was installed as chief executive officer only in October 2024, but just over a year later, after a clash with Newey, was demoted to a different role.Cowell is now spending much of his time in Japan, trying to help Honda sort itself out.Aston Martin were already playing down expectations when they had their official team launch in early February, emphasising the project would need time to become successful.Newey has explained that his starting in March left them some months behind other teams in terms of development.The new 2026 aerodynamic regulations were finally officially published on 2 January 2025, two months before Newey officially started work at Aston Martin.In reality, teams have been working on their 2026 cars for much longer than that. The basics of the cars' layouts in the rules had been known for some time, and the teams had all been in working groups refining the detail with governing body the FIA, so knew where they were going.The word is that when Newey arrived in March 2025, he effectively ordered a redesign of the car on the basis of his ideas. So the current car is several months, at least, behind all its rivals in terms of development. With that sort of deficit, even he cannot work miracles.Newey has described the Aston Martin as \"one of the more extreme interpretations\" of this year's new rules.Right now, in its under-developed form, there is no question it is uncompetitive - slow and unpredictable. It may yet turn out that it can be developed into a good car, but until Honda sorts itself out, it will be hard to tell.Honda's plight has brought back painful memories of a decade ago. When it returned to F1 in 2015 with McLaren, it was underprepared, and spent three difficult seasons with engines that were underpowered and unreliable. The similarities with now are unmistakable.Why it is so unprepared this time is less understandable.Honda officially pulled out of F1 at the end of 2021, when Max Verstappen took a Red Bull powered by their engine to his first world title.It announced its return to F1 with Aston Martin in May 2023.The argument given to explain now being so far behind is that Honda's F1 engine project was essentially disbanded and the engineers involved reallocated to other areas of the company in the 15 months between the two dates.However, it's not like Honda went away. Both Red Bull teams continued to use its engines until the end of last year.Although there was a development freeze, the engine was still being upgraded each year because F1's regulations allowed modifications for reliability reasons. Every manufacturer in F1 uses this loophole to produce performance upgrades in the name of improved reliability.If Honda had not been doing this, it would have fallen behind progressively from 2022 to 2025, which it did not.On top of that, Honda representatives were involved in meetings about the new engine rules all the way through - hence their U-turn on involvement in early 2023.Still, the argument is that without a fully dedicated F1 engine department, Honda lacked a team designing and building a new engine to the revised rules for this year, and had to build one up again more or less from scratch.But so did Red Bull. In 2020, when they announced their decision to build their own engine factory, they had nothing. The original plan was to go into partnership with Porsche, but that deal foundered by late summer 2022.Considering Red Bull had to build a powertrains factory from literally nothing in this period, and recruit an entirely new staff, their timeline is not that dissimilar from Honda's.So why is Honda so far away from where it wants to be? No answer to that has been provided.A new car and engine partnership with Honda that struggles for reliability and performance and has Alonso as one of the drivers. If that sounds familiar, it's because it is.In 2015, Alonso joined McLaren from Ferrari wooed by the promise of Honda's potential. That potential was eventually realised - but not until 2020-21, by which time Honda and McLaren had long since split and Honda had joined forces with Red Bull.Alonso's career, meanwhile, became a kind of living purgatory. One of the greatest drivers the sport has ever known reduced to fighting for scraps, making up his own targets for motivation, rather than what he should have been gunning for - wins and titles in F1.He last won a race in May 2013, and he is now 44. But his performances have continued on a high level, and the respect he has from his peers on the grid is higher than ever. For his talent, and his ability to keep up his motivation in the face of everything.The Newey-Honda-Aston Martin combination on paper promised Alonso something positive, a last hope of a return to success with which to bring his storied career to a close. Either this year, when his current contract runs out, or perhaps after one more, if glory seemed tangible.Instead, he has found himself transported back in time 10 years.Alonso has waited an entire career to work with Newey, the excellence of whose cars - and some terrible luck - have denied the Spaniard at least two further world titles that he should have won.Alonso won't doubt Newey can sort this out. Who would? But after his experiences with Honda last time, can he really convince himself it can turn this around in the limited time he surely still has available?In public, Alonso is staying optimistic, just as he did with McLaren and Honda, bar one or two public slips when it all got too much.\"Everything can be fixed, for sure,\" he says. \"Short and medium term. I don't think there is anything that is impossible to fix.\"We will try to fix everything we can before Australia and after that we try to fix as many things as possible in the first couple of races. Because [otherwise] it's too late in the championship. But no, I'm optimistic. I think there is a solution in place.\"Alonso's partner Melissa Jimenez is expecting their first child in late March.The emergence of the unfolding catastrophe that is Aston Martin-Honda is so recent he has not yet been asked about his thoughts on his future. But he will already be considering what to do.Does he roll the dice one last time, try to summon the energy and commitment to go again after what will doubtless be a very trying year? Or call it quits?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aston Martin: Why they are in trouble before 2026 season starts",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0dd/live/7125a740-10c9-11f1-912a-116949699904.jpg"
      ],
      "datePublished": "2026-02-24T06:39:49.000Z",
      "dateModified": "2026-02-24T06:39:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bowen: Why Ukraine remains defiant and does not feel close to defeat",
    "url": "https://www.bbc.com/news/articles/cd9g2ggq4epo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3691/live/ef0177f0-0e41-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-24T06:02:26.000Z",
    "description": "3 hours agoJeremy BowenInternational Editor, KyivBBCOn a dark and cold night in Donetsk in eastern Ukraine, the netting protecting the road from attac",
    "body": "3 hours agoJeremy BowenInternational Editor, KyivBBCOn a dark and cold night in Donetsk in eastern Ukraine, the netting protecting the road from attacks by explosive drones shimmered and rippled in the headlights of our armoured Toyota Land Cruiser, as we drove down strange and surreal tunnels to get in and out of the most intensive area of fighting in eastern Ukraine. The nets go on for miles, suspended from wooden poles around 20ft high along the sides and over the top of the road. Dystopian military vehicles straight out of Mad Max rumble past, encased in their own cages of steel and netting.Nets snag the propellers of attacking drones, making them a cheap and surprisingly effective physical barrier. Even if their Russian controllers detonate the charge they carry, there is a chance that the explosion will not be close enough to kill people using the road in civilian buses and cars as well as military vehicles.Much of the netting has been donated by European fishermen. Only this week the Scottish government announced it was sending over another 280 tonnes of salmon nets that were about to be recycled. Before any of it gets used, the Ukrainian military crashes drones into it to test its strength.In Ukraine, anti-drone nets go on for miles, suspended from wooden poles The three most feared letters on the battlefield are FPV, standing for \"first-person view.\" FPV drones are major killers, used by both Ukraine and Russia. They have cameras that feed information back to their controllers in a command centre that might be 30 or 40km away. We visited a few of them, hidden away in basements of wrecked buildings or nondescript village houses.Inside there are banks of screens, relaying video and data from drones that is analysed by the Ukrainian military's leading-edge software. The cameras zoom in on small figures of soldiers moving around the ruins, with the controllers directing the men on the ground through walkie-talkies, callsigns and headsets. We could see the men entering buildings where the drones had seen Russians hiding, and emerging after they had killed them. Early versions of the drones were controlled by radio signals, but both sides are experts at electronic warfare and quickly found ways to jam them. Now they are mostly controlled by fibre optic cables, so thin that a spool 25km long (that carries data and video) fits into a container built into the drone that is the size of a large bottle of bleach.The nets snag the propellers of attacking dronesEastern Ukraine used to feel like a throwback to the Western Front in World War One, with trenches and dugouts reinforced against artillery and snipers. After the full-scale invasion four years ago it still, for a while, felt like a 20th Century battlefield. But now drones have transformed the way the war is fought, and armies across the world are watching closely, being forced to change their ideas of how to fight.The narrow confrontation line that used to exist between the two sides is now extended across a broad swathe of land that both sides call the kill zone, stretching perhaps 20km either side of the forward positions of the two armies. Rear positions for logistics and dealing with casualties that used to be relatively safe are now as lethal as the old front line. The skies above get saturated with surveillance drones, making movement extremely dangerous. Social media feeds are full of terrifying videos filmed from FPV drones as they swoop into their targets, sometimes chasing down individuals in the open, or even entering buildings, threading their way through rooms and doorways until they find their quarry. The last shot is often of a horrified man about to die.Artillery and tanks are still formidable weapons. But a drone that costs around a thousand dollars can, in the hands of a skilled pilot, destroy a tank that costs $30m (£22m). The Wall St Journal recently reported that a small group of Ukrainian drone pilots created havoc when they were invited to oppose Nato forces in an exercise in Estonia last year. Nato has a lot of catching up to do. One major consequence of the last four years of war is that Ukraine and Russia are now the most experienced and proficient practitioners of drone warfare in the world.Both countries are constantly innovating to get ahead in the drone war. Both have been using Starlink system owned by the world's richest man, Elon Musk for battlefield communications and navigation. The Russians had a recent setback when Musk agreed to turn off Russian-registered terminals active inside Ukraine. That seems to be a major reason why Ukraine, with an active Starlink system funded by Poland, recently recaptured territory in the south.But all the Ukrainian drone units I visited believed that the Russians would soon find a workaround. They respect the skills of the elite Russian drone units they said were called Rubicon and Day of Judgement. A senior officer told me that western Europeans need to forget the military blunders Russia made after the full-scale invasion four years ago and make a distinction between the thousands of front-line Russian soldiers who are killed every month and the elite drone units that Moscow values as a key part of their war effort. He said they were \"cherished\" by the Russian army.FPV drones have cameras that feed information back to their controllersOn my most recent visit to Ukraine, the threat from drones meant we watched the weather forecast closely before heading into Donetsk, postponing during a day of clear blue skies and waiting for more snow. Drones struggle in bad weather.Feeling a little reassured by the nets and the snow, we headed towards the town of Slovyansk, past the ruined shells of buildings destroyed over the last four years. Slovyansk functions as a town, just about, with some cafes and shops open. But  thousands of residents have moved to safer places, and when the people who have stayed go out, their fear of Russian FPV drones means they hurry down the icy, snow-covered streets to get through their errands to make it home alive. Nets are going up in the town centre.Slovyansk is high on Russian President Vladimir Putin's uncompromising list of terms for a ceasefire. A big part of the price he is demanding is for Ukraine to give up the 20% or so of Donetsk it still controls, along with other land that his army has been unable to capture, in the southern regions of Zaporizhzhia and Kherson. According to Ukranian President Volodymyr Zelensky, the Americans have pushed him to take the deal, to get to a ceasefire by the summer.US President Donald Trump also wants Zelensky to call an election, a demand he has not directed at Putin. The evidence suggests that Trump wants to be able to declare he has ended the war. Even if a ceasefire didn't last, he would treat it as a victory he will take into the US mid-term elections next autumn. He is also eyeing huge business deals with Russia, which cannot happen until sanctions are lifted.The Americans have tried to impose deadlines for a deal. Most recently they told Zelensky he needed to agree to a ceasefire by the summer that Donald Trump could concentrate on the mid-terms. The US inability to bend Ukraine – or Russia – to its will shows that its leverage has limits. Four years after Russia's full scale invasion, there is no discernible evidence that a genuine ceasefire is coming .The dangers in DonetskWhen I saw President Zelensky this weekend in Kyiv, he told me that he could never give up land that Russia has not been able to capture. He would never, he said, abandon the people there, and even if he was tempted to do so it would not work, as within two years by his reckoning, the Russian military would be ready and reequipped and Putin would order them to attack again.The first person we visited in Slovyansk was Oleh Tkachenko, a beefy middle-aged pastor who has built up a remarkable relief operation. He is one of the few people outside the military who travel to the most dangerous areas, delivering bread to outlying villages that he makes in his own bakery, which produces 17,000 loaves per week.After his deliveries he often returns with residents who have had enough of living near the front line. Oleh's bakery is an oasis of order and warmth in the freezing, snow-covered ruins of an industrial area on the edge of Slovyansk.The UN World Food Programme helped him re-establish it when he was forced out of his hometown, which is now occupied. He told me that the dangers in Donetsk have multiplied in the last few months as the drone war has intensified.\"The situation has changed radically. There are only very dangerous places and relatively dangerous places. Nowhere is safe in the Donetsk region anymore.\"I asked him whether Zelensky should give in to Russian and American pressure to sacrifice Donetsk for a ceasefire. It was the same question I put to everyone I met in Slovyansk, and it produced the same kind of answer.\"What more does Putin want? This is my Donetsk region. I was born here. My children were born here. I created my family here. And I should leave all that? What for?\"Putin, he said, should not be allowed to take and keep territory that does not belong to Russia.\"We are destroying the values on which this world is built on one person's whim. Not only will the villain avoid punishment, he [will] also be rewarded? I'm sorry. How many villains like this are there in the world?\"AFP via Getty ImagesZelensky said he could never give up land that Russia has not been able to captureAt a coffee bar I met Oleksii Yukov. He runs an organisation called Advis Platsdarm that collects the bodies of dead soldiers from where they were killed, to honour their memory, and before they get a decent burial, identify them to give their families some certainty about them. Oleksii makes no distinctions between dead Russians and dead Ukrainians, but that does not mean he is also prepared to accept Russian domination in Donetsk. Like Oleh, he does not believe promises made by Putin.\"So if a maniac comes to your home and says, \"Give me your daughter and I won't come back,\" do you really think that a man like this – who rapes and pillages - is simply going to stop?\"\"We all know who the maniacs are, right? It's horrifying. To give away a part of yourself – or your child – to be torn apart… I don't understand why this question is even asked of Ukrainians.\"Oleksii has also recovered the remains of soldiers killed in World War Two in the Donbas, the name used for Donetsk and its neighbouring region, Luhansk, which has fallen to Russia in its entirety. He compares Putin's promises to ones made by Adolf Hitler at the Munich conference in 1938. Hitler claimed that a slice of Czechoslovakia known as the Sudetenland was his last territorial demand in Europe. Britain and France accepted his word as the price of avoiding the World War that started the following year. Like many people in this part of Europe, Oleksii sees parallels with the past.\"Promises made by Russia are worth nothing – just like Hitler's promises that once he took the Sudetenland nothing else would happen. We all saw what that led to: the Second World War. Now it could lead to a Third World War if we do not stop and tell Putin that people live here – people who want to live in their own country, on their own land. Each of them has that right. No Ukrainian has the right to say we can give anything away.\"Oleksii believes that forcing Ukraine to give up Donetsk without a fight would be as much of a betrayal as Czechoslovakia suffered at Munich.Along with its embattled neighbour Kramatorsk, Slovyansk is designated as a \"fortress city\". Both are protected by miles of deep anti-tank ditches filled with razor wire and concrete anti-tank obstacles known as \"dragon's teeth\". The towns sit on a range of hills that is the last high ground before around 150 miles of flat land, mostly fields, that stretch right up to the next natural obstacle, the mighty Dnieper River that bisects Ukraine from north to south. Ukrainians argue that stopping the Russians if they reached the flatlands would be much harder.The BeginningFour years ago, almost to the day, I was at the main railway station in Kyiv, watching a scene straight out of Europe's dark past play out in a bitter wind off the Ukrainian steppe. Kyiv was in the depths of a frigid winter so monochrome that the scene on the platform could have been an old newsreel, but it was 2022 and happening in a technicolour, digital age. It was the loudest warning yet that the world had changed, that old assumptions about European security and the safety of the future had to be forgotten.Since then, other warnings have sounded, in the Middle East, in Sudan and in Taiwan, while the war in Ukraine has incubated the biggest crisis in the North Atlantic alliance since it was created in 1949. The gap remains wide between Trump's openness to Putin and the much harsher view of Moscow held by most European members of Nato.Getty ImagesZelensky said earlier this month that 55,000 Ukrainian soldiers have been killed in the last four yearsIn that first week of the war, the platforms at Kyiv station were packed, mostly with Ukrainian women and children, desperate to board trains going west to escape the advancing Russian army. Russian artillery and answering salvoes from the Ukrainians echoed around the empty streets of the city centre, making the threat to the city frighteningly real. Trains pulled in every 15 or 20 minutes, as many as the endlessly enterprising operators of Ukraine's railway network could find in the sidings and marshalling yards. Frightened people jostled their way on, leaving tearful goodbyes on the platform with those staying to fight. At the height of the evacuation 50,000 people a day were passing through the station.In the station concourse a young soldier with a Kalashnikov slung across his back was hugging his girlfriend before she left to go west and he went back to his unit. They could have been a Norman Rockwell cover for the Saturday Evening Post, the magazine that cheered on Americans after they entered World War Two.Zelensky showed immediately that he was an instinctive war leader, a born communicator who was able to rally his people. On the first dark night of the war, dismissing rumours that he had fled, he appeared in olive green military attire, recording a video selfie in front of the presidency building in Kyiv, with his closest advisors behind him.\"We are all here, our soldiers are here, the citizens of the country are here. We are all here protecting our independence, our country and we are going to continue to do so.\"Getty ImagesUkraine and Russia have been fighting since 2014 when President Putin ordered the occupation and annexation of Crimea on the Black SeaThe first months of Russia's full-scale invasion went by for Ukrainians in waves of fear, determination, grief, and patriotic fervour. Some of the Russian soldiers in towns they had occupied around Kyiv carried out massacres – leaving the bodies sprawled where they had been killed on the highway, on the streets of Bucha and in shallow graves. We saw the bodies after Ukraine forced the Russians to retreat from the capital, a victory that confounded the prediction of their western allies that they would be beaten in a few weeks.Ukraine's unexpected strength persuaded the then US President Joe Biden and other European leaders to send more powerful weapons to Kyiv, though never as many or as fast as the Ukrainians wanted. Ukrainians who stayed were volunteering to fight. Those who couldn't set up workshops that churned out Molotov cocktails and camouflage netting.Four years on that energy has dissipated. That should not be surprising. War is all-consuming, and exhausting.It has been replaced by a grim determination to carry on, especially among front line soldiers and their families. Zelensky said earlier this month that 55,000 Ukrainian soldiers have been killed in the last four years, accepting that many more were classified as missing. The real figure is likely to be much higher than 55,000. The chances are that their remains are somewhere along the 800-mile front line.Recruiting new soldiers to replace them in the terrible danger of the deadly and expanding kill zone on the front lines is a struggle. In the cities and at checkpoints men of military age face snap inspections of their papers. If they are eligible for conscription, and do not have an exemption from service, they can be driven off to the barracks on the spot.Getting enough soldiers to fight on is one of Ukraine's greatest challenges, yet polls show substantial majorities here believe that Ukraine can fight on, despite Russian advances on the battlefield, and has no choice as they believe Russia wants to destroy them as a nation. A majority also do not believe that the US-brokered talks will produce a lasting peace. But even though a majority believe Ukraine does not have a choice about fighting on, putting on a uniform and heading for the front line is not a popular choice.Global Images Ukraine via Getty ImagesIn Kyiv, civilians are being killed in their own homes by Russian drones and ballistic missilesValeriy Puzik, an author and poet, volunteered to fight and has spent months at the front line. I met him in a trendy bar in Kyiv, a world away from the six metre deep dug out he inhabited with his squad at the front line for more than 100 days. I asked him why it was so hard to recruit.\"Because when a person leaves a position, they don't say anything positive. And word of mouth does the worst damage. Because, there is nothing positive there. I wouldn't wish any of my friends to crawl into a burrow and sit there… I was lucky to survive. Usually, people sit in those burrows for 90, 100, 160 days. We were basically supposed to stay there until spring.\"Valeriy survived his latest deployment to the front because he volunteered to evacuate two wounded comrades.Before he could be sent back, his old position was attacked and the men who stayed behind, he says, were killed or are missing. Evacuating the wounded men, he believes, saved his life.\"If it weren't for those injuries, most likely we all would have died there.\"The Long WarUkraine and Russia have been fighting since 2014 when President Putin ordered the occupation and annexation of Crimea on the Black Sea and then seized parts of the Donbas in the east.On this current trip, I have seen no evidence that the war is going to end soon.The full-scale invasion four years ago was Putin's attempt to eliminate the independence of Ukraine once and for all. He has said many times that history shows Ukraine belongs with Russia. A few days before the anniversary of the invasion President Zelensky dismissed that succinctly in a post on X: \"I don't need historical shit to end this war and move to diplomacy. Because it's just a delay tactic. I read no less history books than Putin. And I learned a lot.\"Zelensky has weathered a corruption scandal that forced the resignation last autumn of his chief of staff, Andrii Yermak. He has trenchant critics, and potential rivals, but still has approval ratings of which most western leaders can only dream.Gwara Media/Global Images Ukraine via Getty ImagesThe Kremlin launched its full-scale invasion of Ukraine on 24 February 2022This week, far to the east of Kyiv, the trains that evacuated hundreds of thousands of Ukrainians in February and March 2022 are still taking people out of harm's way. The Russia military moves at a glacial pace, but in the key battleground of Donetsk in the east it is grinding forward, chewing up lives, the landscape, and whole villages and towns. Ukraine still holds around a fifth of Donetsk oblast, or region. It is the most intensely fought-over part of Ukraine.One after another, a series of battles over four years have turned towns and villages into rubble, from Bakhmut earlier in the war to Pokrovsk now.Every day buses cross the regional border from Donetsk to Lozova in the Kharkiv oblast, carrying civilian evacuees. A school has been turned into a warm and clean relief coordination centre – packed with families surrounded with a few bags of possessions, dogs on leads, cats in baskets and most of all tormented by loss. Serhii and Viktoria had arrived from Druzhkivka, a town that has been sucked into the kill zone. Their teenage daughter Diana sat silently next to them, with her cat Mika on her lap. Like millions of others displaced by war, here and in other turbulent stretches of the world, they were leaving to save themselves, knowing too well that also meant not just losing the remains of their old lives, but also personal independence. Now they had to sit and wait while the paperwork was done and someone else told them what to do. Viktoria explained why they had left their home.\"We are on the brink. We didn't have any gas, water or power. No heating. We were staying there till the very last moment, freezing for three days.\"Back at the end of 2022, their town, Druzhkivka, was seen as a relatively safe haven when we used it as a base to report the Russian attack on Bakhmut. But no one goes there now, Viktoria says. Druzhkivka is too dangerous.\"The drones destroy everything alive – the cars, the people, their homes. I can't tell you without tears.\"Serhii looked prematurely old.\"It is very difficult. We have abandoned everything we worked for our whole lives. Everything we worked for, for our families, all we were building. And we had to abandon all that in one moment…everything… We could only pack some small things. We could not have taken more.\"Standing near them was Tamara, with her nine-year-old twin granddaughters, Mila and Tina.\"The kids. We left because of the kids. We live near the forest… There are lots of tanks… drones are flying everywhere… there is no peace …the children are running to me and crying… it is very loud…. Everything is shaking…\"Lviv in western Ukraine, where families were send to from Lozova Once they were registered, the families with their bags and their pets were bused to Lozova station, to board a long train heading for Lviv in western Ukraine. Lozova used to be a busy junction for trains heading further east. Now it is now the last stop for Ukrainian railways. The lines beyond it are too dangerous.A defiant UkraineThe talks brokered by Trump's envoys, the president's son-in-law Jared Kushner and his friend, the real estate billionaire, Steve Witkoff, continue. They are expected to convene again in Geneva after the anniversary of the invasion. Witkoff made positive noises after the last round but both Russia and Ukraine talked about a difficult atmosphere.It is hard to see any kind of ceasefire emerging unless either Putin or Zelensky change their fundamental positions. Since both sides believe they can fight on to some kind of victory that is not likely to change.The negotiations appear more of an exercise in placating Trump, so that he cannot blame either Moscow or Kyiv for their failure. The US president tends to default back to putting pressure on Ukraine. In the past he has claimed, untruthfully, that Zelensky is a dictator who started the war. Zelensky laughed and said it wasn't true when I asked him about it. On the eve of the last round, just before the anniversary Trump told journalists that \"Ukraine better come to the table, fast\".AFP via Getty ImagesPresident Zelensky said if Ukraine is to fight on, it will need increasing levels of European supportTrump has ended almost all military aid, but Ukraine still depends on intelligence only the US can provide. Europe buys US weapons, especially interceptor missiles from the Americans on behalf of Ukraine.On this trip to Ukraine I have found a country that remains defiant. It does not feel close to defeat.The big cities function well, despite Russia's concerted and effective attacks throughout this bitterly cold winter on its power and heating grid. In Kyiv, there are traffic jams, well-stocked shops, restaurants and cafés. There are also air-raid sirens, often in the small hours of the morning, and terrible stories of civilians being killed in their own homes by Russian drones and ballistic missiles. Ukraine is rebuilding the military-industrial complex that existed here in Soviet times, concentrating on long range strikes on Russia.Russia has made concerted and effective attacks on Ukraine's power and heating gridPresident Zelensky told me they can win the war, and if Ukraine is to fight on, it will need increasing levels of European support.Spring is in sight, but in this part of Europe winter can drag on into April. Russia has put immense pressure on Ukraine throughout the coldest winter in years by targeting power stations and Soviet-era plants that provide districts with hot water and heat.In the ruins of a power station that the Ukrainians allowed us to visit on condition we did not identify it, workers were salvaging steel from the wreckage. The plant had been hammered by Russian missiles and drones. Repairs were out of the question. It needed to be rebuilt. With his breath condensing in clouds in temperatures double figures below zero, a foreman summed the attitude that is common here, when I asked him why Russia was attacking them.\"They want to make us kneel. They want to bring Ukraine to its knees.\"That is a fact, and Ukraine's determination to stop it happening is why this war continues.More from InDepthTop picture credit: Global Images Ukraine via Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bowen: Why Ukraine remains defiant and does not feel close to defeat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3691/live/ef0177f0-0e41-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-24T06:02:26.000Z",
      "dateModified": "2026-02-24T06:02:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2m9m5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-22T15:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·22 Feb 2026,·33 minsGordon Brown turns detective over AndrewNewscastAvailable for over a yearToday, we discuss a report in the Sunday Telegraph that Gordon Brown has demanded a police investigation into whether Andrew Mountbatten-Windsor used taxpayer-funded jets and RAF bases to meet the paedophile Jeffrey Epstein.\nThe former PM says he’s sent a five-page memorandum to the Metropolitan, Surrey, Sussex Thames Valley and other UK police constabularies.\nLaura and Paddy are joined by Henry Zeffman to discuss why he’s turned investigator, what it means for the Royal Family, and whether rules around the line of succession should be changed.\nAhead of the Government’s Schools White Paper on Monday, we also discuss some of Labour’s proposed changes to special educational needs and disabilities (SEND) support, as well as Kemi Badenoch’s vow to lower interest on some student loans which she says feel \"increasingly feel like a scam\".\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC.\nThe presenters were Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Kris Jalowiecki. The social producer was Grace Braddock. The technical producer was Hannah Montgomery. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-22T15:03:00.000Z",
      "dateModified": "2026-02-22T15:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2d11v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-20T20:08:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·21 minsTrump's Tariffs... Trump attacks the Supreme Court over tariff banAmericastAvailable for over a yearDonald Trump has called the Supreme Court’s ruling blocking many of his sweeping tariffs ‘deeply disappointing’ and has announced a new 10 per cent tariff on global imports.\nJustin, Sarah and Anthony jumped into action following the President’s press conference to unpack the day’s drama: starting with the US Supreme Court decision to block global tariffs and ending with the President’s withering attack on some of the justices for their decision. \nThe president spoke a few hours after the US Supreme court struck down the legal justification for a large portion of Trump's sweeping global tariffs in a major blow to the president's economic agenda.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Miranda Slade, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-20T20:08:00.000Z",
      "dateModified": "2026-02-20T20:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lord Mandelson arrested on suspicion of misconduct in public office",
    "url": "https://www.bbc.com/news/articles/c8xy5jzrrxzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c564/live/361bc6a0-114d-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T02:25:41.000Z",
    "description": "Lord Mandelson released on bail after arrest on suspicion of misconduct in public office6 hours agoOlivia IrelandWatch: Peter Mandelson arriving at ho",
    "body": "Lord Mandelson released on bail after arrest on suspicion of misconduct in public office6 hours agoOlivia IrelandWatch: Peter Mandelson arriving at home after being released on bailLord Mandelson has been released on bail, the Metropolitan Police says, hours after his arrest on Monday on suspicion of misconduct in public office.The Metropolitan Police said a 72-year-old-man was released pending further investigation. The BBC saw Lord Mandelson returning to his London home at 02:00 GMT. Lord Mandelson was arrested at an address in Camden, north London, on Monday and taken to a police station for interview. The force launched an investigation earlier this month over allegations that, while he was serving as a government minister, Lord Mandelson had passed on market-sensitive government information to the late convicted paedophile Jeffrey Epstein.The arrest on Monday followed search warrants at two addresses in Wiltshire and Camden, the police statement added.Lord Mandelson has not publicly commented in recent weeks on the Epstein files, but the BBC understands his position is he has not acted in any way criminally and that he was not motivated by financial gain.Lord Mandelson became the British ambassador to the US in February 2025 but was sacked in September after Downing Street said new information about the depth of his relationship with Epstein had emerged.The government has said it expects to release the first documents relating to Lord Mandelson's appointment in \"early March\".On Monday afternoon, he was seen being led away from his London home by plain clothes officers who put him in the back of an unmarked car.The BBC understands his arrest was carried out by officers from the Met's central specialist crime division. Consultations between the police and the Crown Prosecution Service are ongoing.The allegations against Lord Mandelson surfaced after the US Department of Justice released a tranche of documents last month, including emails between him and Epstein.An email from 2009 appears to show that Lord Mandelson passed on an assessment by an adviser to the then prime minister Gordon Brown about policy measures, including an \"asset sales plan\". He also appeared to discuss a tax on bankers' bonuses and confirm an imminent bailout package for the Euro on the day before it was announced in 2010.Responding to Lord Mandelson's arrest, the family of the late Virginia Giuffre, who accused Andrew Mountbatten-Windsor of sexual abuse, said they \"commend the British authorities for taking meaningful action and treating the Epstein files with the urgency they demand\". Andrew has consistently denied any wrongdoing in his associations with Epstein.In a statement, Sky and Amanda Roberts said: \"The contrast with the continued inaction in the United States is undeniable. Survivors deserve transparency, swift investigation, and real justice, no matter who is implicated.\"BBC News understands the government will continue talking to police about which documents can be released, after it was previously suggested an arrest could have implications for that process.The government still wants to be able to publish documents, which it hopes will back up Prime Minister Sir Keir Starmer's claim that Lord Mandelson had \"lied\" during his vetting process.Darren Jones, chief secretary to the prime minister, told MPs on Monday that records detailing follow-up questions posed by No 10 during the initial due diligence process for the appointment would not feature in the first tranche of published material, due to the \"interest in this document\" from the Met Police. Conservative leader Kemi Badenoch said Lord Mandelson's arrest was \"the defining moment of Sir Keir's premiership\".Badenoch, who said the prime minister was \"weak\", added: \"Watching the man who he appointed to the highest position in our diplomatic service getting arrested by police is an image which I think is going to stay with us for many, many years to come.\"Pool/BBC NewsLord Peter Mandelson being escorted by a police officer outside his homeLord Mandelson has been urged by US politicians to answer questions as part of a Congress investigation into Epstein.He began working for Labour in the 1980s, playing a key role in the New Labour movement and Sir Tony Blair's landslide election victory in 1997.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lord Mandelson arrested on suspicion of misconduct in public office",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c564/live/361bc6a0-114d-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T02:25:41.000Z",
      "dateModified": "2026-02-24T02:25:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lord Mandelson arrest - how did we get here?",
    "url": "https://www.bbc.com/news/articles/cjd9yelvx7jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/04aa/live/0604b3d0-10e6-11f1-b4ca-a9a29eb10e90.jpg",
    "tag": "Trending",
    "date": "2026-02-24T03:02:55.000Z",
    "description": "6 hours agoBecky MortonPolitical reporterPA MediaLord Mandelson has been released on bail pending further investigation, hours after his arrest on Mon",
    "body": "6 hours agoBecky MortonPolitical reporterPA MediaLord Mandelson has been released on bail pending further investigation, hours after his arrest on Monday on suspicion of misconduct in public office.The arrest came after the former Labour minister and US ambassador was accused of passing market-sensitive government information to financier and convicted sex offender Jeffrey Epstein, who died in 2019.Lord Mandelson has not publicly commented in recent weeks, but the BBC understands his position has consistently been that he has not acted in any way criminally and that he was not motivated by financial gain.So how did we get here? 19 December 2024: Appointment as US ambassadorLord Mandelson - who served in a number of ministerial roles under Tony Blair and Gordon Brown - is announced as the UK's ambassador to the US.His previous friendship with Epstein was public knowledge at the time.8 September 2025: Birthday message to Epstein releasedA letter from Lord Mandelson to Epstein, where he calls the financier his \"best pal\", features in a book compiled for Epstein's 50th birthday in 2003, which is released by US lawmakers. HOUSE OVERSIGHT COMMITTEELord Mandelson (left) wrote that Jeffrey Epstein (right) \"remains my best pal\" alongside this picture11 September 2025: Sacked as US ambassadorLord Mandelson is sacked as US ambassador, after the government said new information about the \"depth\" of his relationship with Epstein had come to light.It followed the publication of supportive emails Lord Mandelson sent to Epstein as he faced charges for sex offences in 2008.30 January 2026: Documents suggest payments from EpsteinDocuments suggesting Epstein made $75,000 (£55,000) of payments to accounts connected to Lord Mandelson between 2003 and 2004 are among a tranche of files released by the US Department of Justice.Lord Mandelson says he has no record or recollection of receiving the sums and does not know whether the documents are authentic.Another email suggests Epstein sent £10,000 to Lord Mandelson's partner, Reinaldo Avila da Silva, in 2009 to pay for an osteopathy course. 1 February 2026: Resignation from Labour PartyLord Mandelson resigns his membership of the Labour Party, saying he does not want to \"cause further embarrassment\" over his links to Epstein.2 February 2026: Emails suggest government information shared with EpsteinEmails released by the US emerge suggesting Lord Mandelson forwarded market-sensitive government information to Epstein in 2009, when he was business secretary in Brown's government.In one email he appears to gives Epstein advance notice of a €500bn bailout from the EU to save the Euro, while in another he discusses plans for a one-off tax on bankers' bonuses. 3 February 2026: Police launch investigationThe Metropolitan Police launches a criminal investigation into Lord Mandelson over allegations of misconduct in public office.23 February: Arrested on suspicion of misconduct in public officeLord Mandelson is seen being led away from his London home by police officers. The Metropolitan Police then release a statement confirming a 72-year-old man has been arrested on suspicion of misconduct in public office and has been taken to a London police station for interview.  Peter Mandelson led away by police following arrest from Camden home24 February: Released on bail pending further investigationLord Mandelson is released on bail, the Metropolitan Police says, hours after his arrest on suspicion of misconduct in public office.In the very early hours of Tuesday, BBC reporters saw him returning to his London home. \"A 72-year-old man arrested on suspicion of misconduct in public office has been released on bail pending further investigation,\" the police statement says. \"We are not able to provide further information at this stage to prevent prejudicing the integrity of the investigation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lord Mandelson arrest - how did we get here?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/04aa/live/0604b3d0-10e6-11f1-b4ca-a9a29eb10e90.jpg"
      ],
      "datePublished": "2026-02-24T03:02:55.000Z",
      "dateModified": "2026-02-24T03:02:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Zealand backs removing Andrew from royal line of succession",
    "url": "https://www.bbc.com/news/articles/c4gjz2p8wr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/afb6/live/39651fb0-1115-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T00:57:42.000Z",
    "description": "8 hours agoSimon AtkinsonandTabby WilsonPA MediaNew Zealand would back plans to remove Andrew Mountbatten-Windsor from the line of royal succession, a",
    "body": "8 hours agoSimon AtkinsonandTabby WilsonPA MediaNew Zealand would back plans to remove Andrew Mountbatten-Windsor from the line of royal succession, a spokesperson for Prime Minister Christopher Luxon has said.\"If the UK Government proposes to remove Andrew Mountbatten-Windsor from the order of succession, New Zealand would support it,\" the spokesperson said in a statement.It comes a day after Australian Prime Minister Anthony Albanese said that his government \"would agree to any proposal\" to remove Andrew from the line of succession over his ties to to paedophile financier Jeffrey Epstein.Andrew was arrested on suspicion of misconduct in public office on Thursday. He has consistently and strenuously denied any wrongdoing. In a press conference on Tuesday in Auckland, the prime minister said his government had been in contact with the UK Cabinet Office over the last week - and that his views had been made clear before the letter from Anthony Albanese was published.\"Our Cabinet Office talks to their Cabinet Office and we have conversations all the time... our position is well understood and I'm telling you what our position is now,\" Luxon said.He continued: \"The bottom line is no one is above the law and once that investigation is closed, should the UK government decide to remove him from the line of succession, that is something we would support.\"Earlier on Tuesday, New Zealand's deputy Prime Minister David Seymour said he did not think the issue was a high priority for people in the country.\"I think we've got 99 problems most New Zealanders are facing right now,\" he told RNZ.\"So, of all of the things that you could ask me about or we could be worried about right now, that's probably a wee way down the list.\"Speaking after his brother Andrew's arrest, King Charles had said: \"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities.\"\"These are grave allegations and Australians take them seriously,\" read the letter, which was addressed to Sir Keir Starmer. A spokesman for the UK prime minister confirmed the letter from Albanese had been received and said the government was \"considering whether further steps are required in relation to Andrew Mountbatten-Windsor\".\"Given the ongoing police investigation it would not be appropriate for the government to comment further at this stage,\" the spokesman added.Getty ImagesAnthony Albanese wrote to his UK counterpart on MondayDarren Jones, chief secretary to the UK prime minister, told MPs on Monday that the government was \"not ruling out action in respect of the line of succession at this stage\", following the arrest of the Andrew on suspicion of misconduct in public office on Thursday. He remains eighth in line to the throne despite being stripped of his titles, including \"prince\", in October.Removing the former prince from the line of succession would require an act of Parliament supported by the 14 Commonwealth countries where King Charles III, his brother, is head of state, including Australia and New Zealand.The last time someone was removed from the line of succession by an act of Parliament was in 1936, when the former Edward VIII and his descendants were removed due to his abdication.Buckingham Palace has not publicly commented on the government's consideration of legislation to remove Andrew from the line of succession.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand backs removing Andrew from royal line of succession",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/afb6/live/39651fb0-1115-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T00:57:42.000Z",
      "dateModified": "2026-02-24T00:57:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's new global tariff comes into effect at 10%",
    "url": "https://www.bbc.com/news/articles/cd6zn3ly22yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5161/live/00754940-1148-11f1-a19b-1f5bb6aba0e7.jpg",
    "tag": "Trending",
    "date": "2026-02-24T08:08:06.000Z",
    "description": "Trump's new tariff comes into effect at lower than expected rate29 minutes agoPeter HoskinsGetty ImagesUS President Donald Trump's new global tariffs ",
    "body": "Trump's new tariff comes into effect at lower than expected rate29 minutes agoPeter HoskinsGetty ImagesUS President Donald Trump's new global tariffs have come into effect at 10% after the Supreme Court blocked many of his sweeping import taxes on Friday.Just hours after last week's ruling, the president signed an executive order to impose the new levy from 24 February.The new tariff rate is lower than expected as Trump had said on Saturday he would impose a levy of 15%. However, an official directive to increase the rate has not yet been issued. The BBC has contacted the White House for comment.\"I think it simply adds to the chaos and mess,\" said Carsten Brzeski, an analyst with investment bank ING, referring to the fast-changing tariffs and their effects on businesses.\"In terms of uncertainty we're back to where we were last year,\" he told the BBC's Today programme, adding there was now a higher risk that the US's trading partners would retaliate.\"The risk of a real fully-fledged tariff war - trade war - escalation is clearly higher than last year,\" he said.The executive order signed by Trump on Friday said the temporary import duty was intended to \"address fundamental international payments problems and continue the Administration's work to rebalance our trade relationships to benefit American workers, farmers, and manufacturers\".The president has argued that tariffs are necessary to reduce America's trade deficit - the amount by which imports exceed exports. But the deficit reached a fresh high last week, widening by 2.1% compared to 2024 and hitting roughly $1.2 trillion (£890bn).The US has already collected at least $130bn in tariffs using the 1977 International Emergency Economic Powers Act (IEEPA), according to the most recent official data.In a 6-3 decision, justices on the highest US court found that the president had overstepped his powers when he introduced sweeping global tariffs last year using the IEEPA. His warning came as countries around the world said they were evaluating what tariffs and trade deals would stand following the decision.The UK said no reciprocal action was \"off the table\" if the US did not honour its tariff deal with the UK, but added that \"no one wants a trade war\".The European Union said it would suspend its ratification of a deal struck over the summer.\"If we get worse conditions then we need to react,\" said the chair of the European Parliament's delegations for relations with the US, Brando Benifei, adding that the EU had asked the US for clarity over the tariffs.\"I think you should demand respect,\" he told the Today programme. \"My plea is that all the countries in the world that do not like that we are being treated this way... try to work a bit together.\"India also said it would defer previously scheduled talks to finalise a recent agreement.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's new global tariff comes into effect at 10%",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5161/live/00754940-1148-11f1-a19b-1f5bb6aba0e7.jpg"
      ],
      "datePublished": "2026-02-24T08:08:06.000Z",
      "dateModified": "2026-02-24T08:08:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Mandelson arrested' and 'Four years of tears' in Ukraine",
    "url": "https://www.bbc.com/news/articles/c8jxpevngveo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba6d/live/147838b0-1113-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T00:14:03.000Z",
    "description": "8 hours agoThe arrest of Lord Mandelson on suspicion of misconduct in public office dominates Tuesday's papers. The Daily Telegraph leads a photo of t",
    "body": "8 hours agoThe arrest of Lord Mandelson on suspicion of misconduct in public office dominates Tuesday's papers. The Daily Telegraph leads a photo of the former ambassador to the US being led away from his London home by police officers. The paper calls his arrest \"a fresh blow\" to Sir Keir Starmer and comes after police launched an investigation earlier this month over allegations that, while serving as business secretary, he passed sensitive government information to late sex offender Jeffrey Epstein. Mandelson has not publicly commented in recent weeks on the Epstein files, but it is understood that his position is he has not acted in any way criminally and that he was not motivated by financial gain.The Guardian follows with the same photo as it reports that Mandelson's arrest comes days before a crucial byelection in Gorton and Denton in Manchester. The paper says it will be \"an uncomfortable reminder\" of what critics have said is one of the prime minister's \"worst lapses of judgment\" - the decision to appoint Mandelson as ambassador to Washington.\"Mandelson arrested over 'secrets passed to Epstein'\" is the Times' headline. The paper adds detectives are expected to interview Mandelson late on Monday night after he was taken to a London police station.Lord Mandelson's arrest \"sparks jeopardy for Number 10\" is the i Paper's take. It says the latest development \"threatens to reignite furore\" over the PM's appointment of Mandelson as US ambassador despite his known links to Jeffrey Epstein.\"Things can only get sweatier\" predicts the Sun as it features Mandelson being led away alongside a picture of the paper's front page from last week of Andrew Mountbatten-Windsor's arrest. Andrew has consistently denied any wrongdoing in his associations with Epstein.\"Disgraced Lord held\" echoes the Daily Mirror.The Daily Mail describes an \"ashen-faced\" Mandelson as he was taken away by detectives on Monday afternoon. \"Now Mandelson faces the music\" is the headline.Alongside its lead of Mandelson's arrest, Financial Times features an interview with President Volodymyr Zelensky on the fourth anniversary of the war in Ukraine. Zelensky says Russia and Ukraine are at the \"beginning of the end\" of the conflict but urged the US to see through Vladimir Putin's negotiating \"games\", the paper reports.\"Four years of tears\" is how the Metro marks the fourth anniversary of the Ukraine war.The Daily Express says Shamima Begum, who travelled to Syria to join Islamic State in 2015, may be planning a return to the UK despite being stripped of her British citizenship. Finally, the Daily Star introduces baby Hugo, the first baby in the UK born using the womb of a deceased donor. Hugo's parents also pay tribute to the donor, saying: \"Part of her will live on forever.\"The i Paper says the arrest has sparked jeopardy for Number 10 as it threatens to reignite the furore over the former business secretary being appointed as the ambassador to the US. The Guardian says the arrest - just days before the Gorton and Denton by-election, will be an uncomfortable reminder of what critics say is one of Sir Keir Starmer's worst lapses of judgement in office. The Daily Express says it will pile fresh pressure on ministers - and the police - to set out a clear timetable for releasing the vetting files that resulted in the appointment.The Times says the EU could \"stub out\" the UK's proposed smoking ban. It points out that seven EU countries believe the proposal to ensure that no-one born after 2009 can legally buy cigarettes breaches the Windsor framework, designed to avoid a hard border on the island of Ireland. But the paper says the Department for Health has stressed that the policy is \"fully compatible with our international treaty obligations in Northern Ireland\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Mandelson arrested' and 'Four years of tears' in Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba6d/live/147838b0-1113-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T00:14:03.000Z",
      "dateModified": "2026-02-24T00:14:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rape suspect freed from HMP Wormwood Scrubs in error now abroad",
    "url": "https://www.bbc.com/news/articles/cgk2rj2yeyjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/571b/live/c8331d90-10ee-11f1-ad76-3b840be8fe05.jpg",
    "tag": "Trending",
    "date": "2026-02-23T20:19:31.000Z",
    "description": "12 hours agoDominic CascianiHome Affairs Correspondent PA MediaThe man was wrongly released from HMP Wormwood Scrubs earlier this monthA suspected rap",
    "body": "12 hours agoDominic CascianiHome Affairs Correspondent PA MediaThe man was wrongly released from HMP Wormwood Scrubs earlier this monthA suspected rapist awaiting trial has been mistakenly set free from prison and has left the country, the BBC has learnt.The man from London was on remand at HMP Wormwood Scrubs, charged with  multiple allegations of rape, sexual assault and violence against a woman.After a pre-trial hearing in early February, a court official wrongly told the prison the defendant could be set free on bail and he was later released, leaving the country soon afterwards.Details of the case emerged as a top judge called on the government to intervene to try to ensure the man returns to stand trial next Monday. The man, who is in his forties, cannot be named for legal reasons.\"We take this error extremely seriously,\" said Judge Martin Edmunds KC, the Recorder of Kensington and Chelsea, in a ruling.\"We will fully investigate how it occurred and what steps can be put in place to prevent it occurring again.\"Isleworth Crown Court heard the defendant, who denies all the charges against him, was remanded in custody after being charged with multiple counts of rape, and was originally due to stand trial in June this year.He appeared in court on 26 January for a hearing to consider whether his trial date should be brought forward to March.Following that hearing, HMP Wormwood Scrubs received a notice from the court stating the defendant had been granted bail.Two passportsOne of the charges he faces did not, on its own, merit remand in custody. But the prison had not been told by the court to continue to detain the man in relation to the more serious charges, including rape.The man was released from prison on 6 February and soon after left the UK for a European country on one of his two passports - the other was being held by the police.The BBC understands that both the man's lawyers and the police have been in contact with the suspect - but he has told them that he cannot return because of complications relating to him having two passports.The judge urged government officials to work out a \"clear, practical\" plan to bring the man back to the UK for trial.A further court hearing is due to take place on Tuesday to determine if the trial in March can take place and whether the defendant will be able to return to the UK.Official figures showed that in the year to March 2025, 262 inmates had been mistakenly let out - a 128% increase on the 115 in the previous 12 months.The government responded to the crisis with promises to improve systems in prisons that deal with releases.More stories like thisRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rape suspect freed from HMP Wormwood Scrubs in error now abroad",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/571b/live/c8331d90-10ee-11f1-ad76-3b840be8fe05.jpg"
      ],
      "datePublished": "2026-02-23T20:19:31.000Z",
      "dateModified": "2026-02-23T20:19:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Queen tells Gisèle Pelicot her new memoir left her 'speechless'",
    "url": "https://www.bbc.com/news/articles/c2e4ng18nv3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e28a/live/35cc1b40-10e5-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-23T20:30:08.000Z",
    "description": "12 hours agoIan AikmanPA MediaThe two women met for tea at Clarence House on MondayQueen Camilla has told French rape survivor Gisèle Pelicot that she",
    "body": "12 hours agoIan AikmanPA MediaThe two women met for tea at Clarence House on MondayQueen Camilla has told French rape survivor Gisèle Pelicot that she was left speechless by her new memoir, which she says she finished reading in just two days.The Queen invited Pelicot to her official residence in London, where the 73-year-old had been promoting her new book, Hymn to Life: Shame Has to Change Sides.Pelicot became a global figurehead of strength and feminism after waiving her right to anonymity and confronting dozens of the men who had raped her.\"I've met so many survivors of rape and sexual abuse,\" the Queen told Pelicot on Monday. \"I never thought I could be shocked by anything anymore, but I was shocked at your case - it left me speechless.\"The two women sat down for tea together at Clarence House, where Pelicot was joined by her partner, Jean-Loup Agopian, and her literary and legal team.The Queen first spoke to her guests in French, joking she had \"forgotten\" the language after studying it \"60 years ago\". Afterwards, she spoke through an interpreter.Pelicot said she had received \"incredible strength\" from the public after coming forward with her story. \"You have so much support,\" the Queen said in response.The meeting came after Pelicot launched her book at a sold-out event at London's Royal Festival Hall on Friday. It featured readings from Hollywood actresses Kate Winslet, Dame Kristin Scott Thomas and Juliet Stevenson.Last year, Queen Camilla sent Pelicot a letter praising her \"extraordinary dignity and courage\". In the letter, the Queen said Pelicot had \"inspired women across the globe\" and \"created a powerful legacy that will change the narrative around shame, forever\".Pelicot said the letter, which left her \"overwhelmed\", was now framed in her office.PA MediaThe Queen joked about her French language skills with Pelicot and her partner, Jean-Loup Agopian.The harrowing details of Pelicot's ordeal shocked the world in 2024.A court heard how for many years she had been drugged unconscious by her then-husband Dominique and raped by dozens of men he had recruited online. After a 16-week public trial, 46 men were found guilty of rape, two of attempted rape and two of sexual assault. Dominique Pelicot was handed the maximum jail sentence of 20 years.Millions were moved by Gisèle Pelicot's presence at the trial, and she received an outpouring of support in France and beyond.She said it was time to make \"shame swap sides\" from the victim to the rapist - a message that resonated with many, including the groups of women that gathered in support outside court every day, carrying signs demanding justice.ReutersFor most of the meeting, the pair spoke through an interpreter.She also recalled the moment she decided to waive her legal right to anonymity - a decision she says she has never regretted.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Queen tells Gisèle Pelicot her new memoir left her 'speechless'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e28a/live/35cc1b40-10e5-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-23T20:30:08.000Z",
      "dateModified": "2026-02-23T20:30:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Number of workers on zero-hours contracts hits record high",
    "url": "https://www.bbc.com/news/articles/czj1m7d4gxpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee34/live/dc122920-10ec-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T06:01:50.000Z",
    "description": "3 hours agoArchie MitchellBusiness reporterGetty ImagesThe number of workers on zero-hours contracts has hit a record high, ahead of Labour's planned ",
    "body": "3 hours agoArchie MitchellBusiness reporterGetty ImagesThe number of workers on zero-hours contracts has hit a record high, ahead of Labour's planned crackdown on the practice from next year.A surge in 16-to-24-year-olds and workers not in full-time education helped drive the number of people employed on the contracts to 1.23 million in December.Analysis by the Work Foundation at Lancaster University, based on Office for National Statistics (ONS) data, revealed that was a 91,000 increase on a year earlier.The Department for Business and Trade (DBT) said it \"will ensure people can have the security they need by giving eligible workers the right to guaranteed hours\".Zero-hours contracts let employers hire staff with no guarantee of work, with employees only offered the hours for which they are needed - often at short notice.Proponents have argued the contracts help support young people into their first jobs and offer flexibility around education or childcare.But critics say zero-hours contracts leave workers facing unpredictable schedules, no guaranteed income and unable to plan ahead financially.Labour's 2024 election manifesto promised a ban on what it called the \"exploitative\" contracts as one of its first policies.It formed part of the government's Employment Rights Act, and is expected to come into force next year as a right to guaranteed hours for workers.Under the Act, workers will also be entitled to what the government considers \"reasonable notice\" of their schedules and compensation for shifts cancelled with short notice.But the Work Foundation said its analysis underlined the \"urgent need\" for the government and MPs to finalise the measures as soon as possible.Its director Ben Harrison said employers were still reliant on the \"highly precarious\" zero-hours contracts, despite Labour's plans.\"Such arrangements underpin the kind of 'one-sided flexibility' that leaves over a million workers unsure how many hours they will work or how much money they will earn next week,\" he said.The figures showed an additional 181,000 people are on zero-hours contracts than when Labour came to power in 2024. Young workers are five times more likely to be on zero-hours contracts, while women make up more than half (54%) of workers on the contracts.The Work Foundation said the proportion of zero-hours contractors who were reliant on them for full-time work stood at a record 32.8%, with many looking for additional hours or second jobs.HandoutAnna Jameson said she has faced \"constantly fluctuating hours and wages\"Anna Jameson, a 22-year-old retail worker from Maltby, South Yorkshire, said zero-hours contracts had left her with \"constantly fluctuating hours and wages\", and that \"you never know what your pay will be at the end of the month\".As a single parent living with her father, stepmother and brother, she said \"you want to create security, but when your wages are unpredictable, everything feels uncertain\".She said zero-hours work had made it difficult to move out into her own rental accommodation, with landlords demanding stability.Trade unions called for measures in the Employment Rights Act to be \"implemented in full as soon as possible\".Paul Nowak, general secretary of the Trades Union Congress (TUC), said zero-hours contracts were \"trapping workers in insecure jobs with little control over their hours and pay\".He said: \"This will make a real difference to working people's living standards.\"A DBT spokesperson said: \"Tackling insecure work is vital if we are to boost incomes, raise living standards and increase productivity.\"We will work closely with workers and employers alike on how the measures are implemented.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Number of workers on zero-hours contracts hits record high",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee34/live/dc122920-10ec-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T06:01:50.000Z",
      "dateModified": "2026-02-24T06:01:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lib Dems in bid to release files on Andrew trade envoy role",
    "url": "https://www.bbc.com/news/articles/cqxdg01w4rno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/231f/live/4e407880-1106-11f1-95d6-71ff8dfa1746.png",
    "tag": "Trending",
    "date": "2026-02-24T08:18:07.000Z",
    "description": "20 minutes agoPaul Seddon & Jennifer McKiernanPolitical reportersGetty ImagesThe Liberal Democrats will push for documents on Andrew Mountbatten-Winds",
    "body": "20 minutes agoPaul Seddon & Jennifer McKiernanPolitical reportersGetty ImagesThe Liberal Democrats will push for documents on Andrew Mountbatten-Windsor's appointment as a UK trade envoy to be released, following his arrest last week.On Tuesday, the party will table a motion to force the government to release files on his appointment to the role in 2001, including those relating to vetting.It comes after the former prince was arrested on suspicion of misconduct in public office.Police had previously said they were considering investigating him over allegations relating to his association with the late sex offender Jeffrey Epstein and were reviewing allegations he shared confidential material. Andrew held the role of \"special representative for international trade and investment\" between 2001 and 2011, giving him privileged access to senior government and business contacts around the world.Emails released in the US from the latest tranche of files related to Epstein include claims that he forwarded government reports from visits to Vietnam, Singapore and China to Epstein in 2010.Andrew has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of files in January related to the late financier. He has previously denied any wrongdoing in relation to Epstein.'Broader principle'The Lib Dems plan to use scheduled debating time allocated to the party on Tuesday to force a Commons vote on a so-called humble address that would compel ministers to release information on Andrew's appointment.Criticism of members of the Royal Family is only allowed in Parliament in specific circumstances - but because Andrew is no longer an active member of the family, comments on his actions are likely to be allowed. MPs are likely to be reminded not to say anything which could prejudice the ongoing police case.The text of the Lib Dem motion, which is expected to be debated on Tuesday afternoon, requests \"all papers relating to the creation of the role of Special Representative for Trade and Investment and Andrew Mountbatten-Windsor's appointment to that role\".The motion also requests \"minutes of meetings and electronic communications regarding the due diligence and vetting\".The party also wants to see any correspondence from Lord Mandelson relating to the appointment, following reports that the former minister pushed for him to be appointed when concerns were raised over his suitability at the time.Lib Dem leader Sir Ed Davey said \"the public is rightly demanding to know\" how Andrew was appointed to the role.\"There's also a much broader principle at stake here. No one, regardless of their title or their friends, should be beyond the scrutiny of Parliament,\" he added. Sir Ed told BBC Radio 4's Today programme: \"The rules of the House of Commons have prevented... MPs from criticising members of the Royal family and sometimes even mentioning them and that really seems old-fashioned.\"  Reminded of his historic praise for Andrew in the role of envoy and dismissal of concerns around him at the time as \"innuendo\" during a parliamentary debate in 2011 when he was a business minister, he said: \"First of all can I apologise to all those victims of Epstein who may have read those words and been upset by them. I really regret them.\"He said he \"wasn't really over the brief\" and added \"no MP mentioned Epstein in that debate and I think that tells a tale about how Parliament and MPs don't hold the Royal Family, didn't hold [the former] Prince Andrew in that really privileged position, properly to account\".Tuesday's debate comes as MPs on the business and trade committee are expected to meet this week to decide whether to launch a parliamentary investigation into the appointment of UK trade envoys.It is understood that any inquiry would start with a focus on possible governance issues within the wider system.Meanwhile on Monday, ministers said a first batch of documents related to Lord Mandelson's appointment as US ambassador would be released in \"early March\".The government will not have to publish material that it considers could damage the UK's national security or diplomatic relations with other countries, which it will instead pass to a committee of MPs and peers to review.He has since been released on bail pending further investigation.Lord Mandelson has not publicly commented in recent weeks on the Epstein files, but the BBC understands his position is he has not acted in any way criminally and that he was not motivated by financial gain. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lib Dems in bid to release files on Andrew trade envoy role",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/231f/live/4e407880-1106-11f1-95d6-71ff8dfa1746.png"
      ],
      "datePublished": "2026-02-24T08:18:07.000Z",
      "dateModified": "2026-02-24T08:18:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bondi Beach attack: Australia royal commission into antisemitism begins",
    "url": "https://www.bbc.com/news/articles/c743dzvp73xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8250/live/8af56410-1111-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-24T05:59:14.000Z",
    "description": "Landmark royal commission into antisemitism prompted by Bondi shooting begins3 hours agoLana LamSydneyGetty ImagesThe federal royal commission will lo",
    "body": "Landmark royal commission into antisemitism prompted by Bondi shooting begins3 hours agoLana LamSydneyGetty ImagesThe federal royal commission will look at antisemitism and its drivers in AustraliaAustralia's royal commission into antisemitism, prompted after the Bondi Beach shootings that killed 15 people and injured 40, has begun public hearings.The federal commission - the country's most powerful form of public inquiry - will investigate the prevalence and key drivers of antisemitism and make recommendations to government.Headed by former High Court Justice Virginia Bell, the inquiry - which started on Tuesday - will also examine the events leading up to the attack, which was Australia's worst mass shooting in decades.Prime Minister Anthony Albanese had resisted calls for a federal inquiry, saying it would hinder social cohesion but later bowed to public pressure.The commissioner is expected to hand down an interim report by the end of April, and a full report no later than the first anniversary of the attack, which took place on 14 December last year.\"I acknowledge that for some, it will never be right to speak of closure, but one small part of coming to terms with the events of that evening will be the work of this commission,\" Bell said in her opening address on Tuesday.\"I regard the delivery of my report on or before the first anniversary as a matter of critical importance,\" she added.Bell said she was \"interested in hearing from Jewish Australians who've experienced antisemitism whether at school or at university, or in the workplace or elsewhere\".Any person could make a submission online, and no one would be pressured into giving evidence in public, she said.Richard Lancaster, senior counsel assisting the commission, described the Bondi shooting as a \"truly horrifying event\" and acknowledged the \"immense trauma\" the attack had caused Jewish Australians.Lancaster proposed to lead evidence on four broad topics: identifying antisemitic conduct, identifying the drivers of antisemitism, examining how law enforcement tackles antisemitism and inquiring into the circumstances of the Bondi shooting - particularly the dealings security agencies and intelligence services had with the alleged gunmen.Sajid Akram, 50, was shot dead by police at the scene of the shootings. His son Naveed Akram - the other alleged attacker - was critically injured and later transferred from hospital to prison.The 24-year-old appeared in court last week for the first time, facing 59 charges, including 15 counts of murder and one of committing a terrorist attack.In light of the ongoing criminal case, the royal commission has been instructed to avoid matters that might prejudice current and future court proceedings. This may mean some hearings are conducted behind closed doors. In the immediate aftermath of the shootings, Albanese announced a review by a former spy chief to look at what federal law enforcement and intelligence agencies did in the lead-up to the attack and what improvements could be made.He said that review, alongside a royal commission called by the state of New South Wales, would be the best way to respond to the attacks and that a federal inquiry would give a platform to antisemitic hate speech.However Albanese was forced to reverse his decision amid continued calls by prominent Jewish leaders and a number of the families affected - which were echoed by the opposition leader at the time.As a result, the review into federal law enforcement and agencies will be folded into the royal commission and the NSW inquiry was cancelled.The shootings also prompted a raft of new gun laws and crackdown on hate speech, as well as greater powers to limit protests.The commission comes amid an already fraught debate raging in Australia over Israel, Gaza and antisemitism.Earlier this month, a rally against a visit by Israeli president Isaac Herzog was marred by violent scuffles between police and protestors. Herzog had been invited by Albanese as a comfort to the families affected by the Bondi attack, but his visit was opposed by thousands of Australians over his government's actions in Gaza.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bondi Beach attack: Australia royal commission into antisemitism begins",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8250/live/8af56410-1111-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-24T05:59:14.000Z",
      "dateModified": "2026-02-24T05:59:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]