[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002m0fz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-11-13T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·13 Nov 2025,·71 minsAvailable for over a yearHow should we balance innovation, power and accountability in the digital age? This week, Amol speaks to Sir Nick Clegg — former UK deputy prime minister and former president of global affairs at Meta — about the power and responsibility of big tech companies. Sir Nick argues that breaking them up won’t solve the problem of their digital dominance, calling instead for greater regulation and user control. \nHe discusses how technology shapes young people’s lives, warning against moral panic whilst calling for stronger age-appropriate safeguards and phone-free schools. And with rare candour, Sir Nick offers an insider’s perspective on how Silicon Valley really works — and why governments, not tech CEOs like Mark Zuckerberg, must ultimately set the rules. \nHe also talks about politics and philosophy, arguing that true liberalism — rooted in reason, openness, and the belief in evidence over emotion — remains vital in an increasingly polarised world. \n(00:03:20) Concerns about the impact of AI \n(00:07:00) The power paradox and network effects \n(00:06:11) Children and smartphones \n(00:22:17) Social media and political polarisation \n(00:34:00) What’s Mark Zuckerberg really like? \n(00:37:56) Why tech bosses are not moral leaders \n(00:41:36) Why he left Meta \n(00:44:10) The future of technology and power \n(00:49:26) The race for AI ‘supremacy’ between the US and China \n(00:52:00) Preparing for this new digital world \n(00:53:11) Why has politics changed so much since he was deputy prime minister? \n(00:57:55) Is liberalism weak? \n(01:01:20) What’s next for Sir Nick Clegg? \n(01:05:16) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Jonny Hall and Ben Andrews. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-11-13T06:00:00.000Z",
      "dateModified": "2025-11-13T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byq?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-14T13:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·14 Nov 2025,·33 minsAre cracks showing inside Trump’s MAGA movement?AmericastAvailable for over a yearFifty year mortgages, recent aid for Argentina, high food prices, a focus on foreign affairs, and Trump telling Fox News that the U.S. needs foreign workers because it doesn’t have enough “talented people”… Americast looks at why some Republicans within the MAGA movement are questioning Trump’s commitment to his campaign promise of “America first”.  \nJustin, Anthony and Marianna look at how and where Trump is under pressure from within the Republican party, and how serious these ‘cracks’ are within the MAGA movement.  Plus, how might Trump satisfy critics who want him to shift his focus back to the economy and domestic policy? \nHOSTS:\n- Justin Webb, Radio 4 presenter\n- Anthony Zurcher, North America Correspondent\n- Marianna Spring, Social Media Investigations Senior Correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Purvee Pattni, George Dabby, Grace Reeve and Laura Cain. The technical producer was Ricardo McCarthy. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155#\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are cracks showing inside Trump’s MAGA movement? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-14T13:06:00.000Z",
      "dateModified": "2025-11-14T13:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France investigating Vinted over alleged links to pornographic content",
    "url": "https://www.bbc.com/news/articles/cr5eygg0l85o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c61/live/f25db310-c3d6-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-17T18:11:49.000Z",
    "description": "2 hours agoHugh Schofield,Paris and Rachel HaganGetty ImagesSecond-hand clothing platform Vinted is under investigation in France after some user acco",
    "body": "2 hours agoHugh Schofield,Paris and Rachel HaganGetty ImagesSecond-hand clothing platform Vinted is under investigation in France after some user accounts were found to be directing visitors to pornographic content.France's Children's Rights Commissioner Sarah El-Haïry said she had asked watchdog Arcom to examine the allegations first reported in French media.Vinted, which has 23 million users in France, has no age-verification procedure - meaning children and teenagers could have been exposed to pornographic material without having to show proof they were over 18.In a statement, the Lithuania-based company said it had a \"zero-tolerance policy regarding unsolicited communications of a sexual nature or the promotion of sexual services\".\"All inappropriate and illegal content is removed, and where necessary we take measures against users, including blocking them definitively from our site,\" it was cited as saying by the AFP news agency.Vinted is taking the situation \"very seriously\", it added. Reports first surfaced after some sellers showing photographs of swimwear or lingerie were found to be luring viewers to their personal pages on adult platforms such as OnlyFans. \"Predators have been using the sale of ordinary items of clothing to direct people to porn sites,\" El-Haïry said.France has recently issued warnings to other global e-commerce platforms, including Shein - headquartered in Singapore - after products including childlike sex dolls appeared in their marketing listings. French officials say the case against Shein forms part of a wider investigation into other major e-commerce platforms accused of allowing illicit products to be sold online.Paris prosecutors are examining whether Shein, AliExpress, Temu and Wish breached laws relating to violent, pornographic or \"undignified\" content accessible to minors.Shein and AliExpress are also being investigated specifically over the alleged dissemination of child-related pornographic material. The cases have been referred to the Paris Office des Mineurs, which handles offences involving the protection of children.Shein has already banned the sale of all sex dolls on its platform worldwide and says it is permanently blocking seller accounts linked to the items. The French consumer watchdog, the Directorate General for Competition, Consumer Affairs and Fraud Control, said descriptions of the dolls left \"little doubt as to their child-pornography nature\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France investigating Vinted over alleged links to pornographic content",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c61/live/f25db310-c3d6-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-17T18:11:49.000Z",
      "dateModified": "2025-11-17T18:11:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bridget Jones statue: 'She's cuter than me,' says Renée Zellweger",
    "url": "https://www.bbc.com/news/articles/c5ylene693no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7548/live/d5ddcff0-c3c6-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-17T14:00:23.000Z",
    "description": "6 hours agoNoor NanjiCulture reporterGetty ImagesThe new statue was unveiled in Leicester Square on MondayRenée Zellweger has called a new statue of B",
    "body": "6 hours agoNoor NanjiCulture reporterGetty ImagesThe new statue was unveiled in Leicester Square on MondayRenée Zellweger has called a new statue of Bridget Jones \"adorable,\" adding: \"I think she's much cuter than me.\"The actress was speaking to BBC News as a new statue celebrating the character she played for more than 20 years was unveiled in London's Leicester Square on Monday.Bridget Jones was created in 1996 by the author Helen Fielding, and first adapted for the big screen in 2001. The fourth film came out earlier this year.Speaking at the unveiling, Fielding refused to rule out taking her story further, saying you should \"never say never\".Zellweger added that everyone can relate to Bridget, which explains her huge appeal.\"[It's her] vulnerability, her humanness,\" she said. \"We recognise ourselves in her, we recognise ourselves in her struggles.\"It makes it OK for the rest of us to be authentically who we are. Imperfect.\"AlamyThe character of Bridget Jones went straight to many women's hearts, who took comfort in her trials and tribulations.From her embarrassing work mishaps, to her infamous granny pants, Bridget spoke to a generation who saw themselves in her - and has recently won over a whole new set of younger fans too.The fourth film in the franchise, Bridget Jones: Mad About the Boy, was released in February, and sees Bridget living as a single mother and tackling modern dating.It received mixed reviews, but earned the best box office opening ever for a romantic comedy in the UK and Ireland, according to Universal.The film was billed as the final one in the series - but speaking to BBC News at the statue unveiling, two superfans, Faye and Wayne, said they were sure there would be a sequel.\"There were so many things that were left unresolved at the end of the last film,\" said Faye.\"Her character keeps evolving. I want to be with Bridget Jones all the way to the nursing home,\" added Wayne.Watch: Moment Bridget Jones statue is unveiled in LondonWhen asked about the possibility of a new chapter in Bridget Jones' story, Fielding said: \"Never say never. Stories come to you as a writer. So if a story came to me that I thought was true and interesting and new then I would write it.\"Some think the floundering and flawed heroine, who's fixated with her weight and relationship status, is not the best role model.And Fielding herself has previously admitted some parts of the story have not aged well.\"Bridget Jones's Diary couldn't be written now, set now, because all those men in the office would be sacked,\" she said last year. \"It was a really different time.\"But speaking on Monday, she said she hoped the wider message of the book would continue to chime for readers.\"I think to have the comfort of seeing a character that you can relate to, because they are real and human and emotionally honest, it's like having the friend you can be honest with,\" she said.The statue is the first to celebrate a rom com on Leicester Square's Scenes in the Square trail.The Scenes in the Square trail originally launched in 2020 with the introduction of eight sculptures featuring Laurel and Hardy, Mary Poppins, Batman, Bugs Bunny, Don Lockwood, Paddington Bear, Mr Bean and Wonder Woman.Since then, statues of Harry Potter, the Iron Throne from Game of Thrones, Clifford the Big Red Dog and Indiana Jones have been added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bridget Jones statue: 'She's cuter than me,' says Renée Zellweger",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7548/live/d5ddcff0-c3c6-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-17T14:00:23.000Z",
      "dateModified": "2025-11-17T14:00:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three things you can do if your child's friends annoy you",
    "url": "https://www.bbc.com/news/articles/c709y0v8gkwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6eaf/live/33efc930-c15c-11f0-9c9a-1124134b6598.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:30:55.000Z",
    "description": "20 hours agoYasmin RufoGetty ImagesYou are not going to like all your children's friends and sooner or later, your child will bring home a friend you ",
    "body": "20 hours agoYasmin RufoGetty ImagesYou are not going to like all your children's friends and sooner or later, your child will bring home a friend you just don't warm to. Maybe they're rude, overconfident or have a habit of helping themselves to snacks without asking. Or maybe it's deeper than that and you feel they bring out the worst in your child.It's easy to just tell your child they can't hang out with a friend, but that often won't solve the problem.Parenting coach Sue Atkins and mum-of-four and comedian Ria Lina share three ways you can navigate this without driving your own kid away.1. Consider why you don't like themIs it something serious like disrespect, bullying or risky behaviour, or is it just that the child rubs you up the wrong way?Atkins says it's worth doing a little self-audit before reacting as it's important to separate what's annoying from what's harmful.If it's a genuine risk like dangerous behaviour or bullying then it's time to step in more firmly, but if the issue is something like manners, you can model the behaviour you want to see.This is something Lina, whose comedy is often about the trials and tribulations of raising four children, often does. \"When a child is under my care, they follow my standards,\" she explains. \"I tell my children off for putting their feet on bus seats and if other kids under my care are doing that, then I'll tell them to take their feet off too.\"Lina says that the reason you may not like your children's friends is often because of a \"clash of values\" with other parents.\"I've had moments where I thought, this kid makes my kid worse but often it's not really that child's fault.\"For example, I don't allow gun play at home at all, no finger guns or playing with toy guns, but lots of boys do that and that's caused tension when I've told my kids they couldn't join in.\"Sometimes talking to the child's parents can help find a middle ground that both parents are happy with, she says.2. Talk, don't banGetty ImagesIdentify the behaviour you don't like in your child's friend and talk to them about it directlyThe worst thing you can do is just ban your child from seeing a friend as \"you're not helping them engage in better friendships nor are you explaining to them why they can't spend time with that child,\" says Atkins.Being too heavy-handed can \"backfire and your child will probably hang out with that friend more just to spite you.\"You should ask your child why they like that friend - what do they have in common? What do they enjoy doing together?Listening to them share this doesn't mean you approve of their friendship but it helps build trust between you.\"When you talk, choose your moment carefully,\" says Atkins. \"Watch your tone and body language because if you go in aggressive or judgemental, they'll shut down.\"You want to build bridges, not walls.\"Lina says that it's important to tell your child \"you don't approve of a particular behaviour and you don't want to see them copying it,\" she adds. \"That way you're not stopping the friendship or forbidding the interaction but you're drawing a line about what shouldn't be repeated or endorsed.\"3. Widen the circleGetty ImagesJoining a sports group can be a good way for children to meet new people If your child seems stuck in a friendship you're uneasy about, subtly expand their social world.\"Introduce other friends into the mix,\" suggests Atkins. \"Invite cousins over, make them join a sports club or try after-school activities - anything that helps them meet new people.\"It's also important to remember that not every friendship is forever and kids often move through phases, so it's best to see how the friendship changes over a few weeks or months before intervening.\"Sometimes it's just a friend for the summer holidays or it's a teenage kid trying to spite you,\" says Atkins.The best thing you can do is model the kind of friendships you hope your child will form.Talking to them about your own relationships can show your child what respect, kindness and healthy boundaries look like and in turn, they are more likely to mimic that.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three things you can do if your child's friends annoy you",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6eaf/live/33efc930-c15c-11f0-9c9a-1124134b6598.jpg"
      ],
      "datePublished": "2025-11-17T00:30:55.000Z",
      "dateModified": "2025-11-17T00:30:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Whaite: Strictly contestant and Bake Off winner reveals steroid addiction",
    "url": "https://www.bbc.com/news/articles/cgr488xxwv1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/47a1/live/62dff990-c3c3-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-17T15:56:47.000Z",
    "description": "4 hours agoSteven McIntoshEntertainment reporterShutterstock/ITVTV chef John Whaite has revealed his five-year addiction to steroids \"made me want to ",
    "body": "4 hours agoSteven McIntoshEntertainment reporterShutterstock/ITVTV chef John Whaite has revealed his five-year addiction to steroids \"made me want to end my life\".The 36-year-old is best known for winning The Great British Bake Off in 2012, and came second as a contestant on Strictly Come Dancing in 2021.In an emotional video posted on Instagram, the 36-year-old revealed he had been \"taking anabolic steroids illegally for five years, and these things have really, really messed with my life\".He said he was speaking out now in the hope that \"young lads will think very carefully about how they treat their bodies\".Whaite is also known for fronting cooking segments on daytime shows such as ITV's Lorraine and Steph's Packed Lunch.'Steroids gave me heart failure at 30 and I could die early'Why is steroid use rising among male bodybuilders?He told his followers he began taking steroids during lockdown \"because I looked in the mirror and hated what I saw\".Whaite explained he has bulimia, an eating disorder, and body dysmorphia, where a person perceives defects in their own body which are often less noticeable to others. He said: \"The more people acknowledged how I looked on steroids, the more I felt good about myself, I felt valid.\"He said one side effect was that his testicles had shrunk: \"I've got tiny balls now, there's your headline,\" he said.Whaite also said steroids had led to him having acne and an unregulated sex drive.John Whaite and his dance partner Johnannes Radebe became the first male same-sex pairing on Strictly in 2023The chef and TV presenter said he decided to speak out after he heard a younger male member of his family discussing a \"dangerously strong steroid\".\"I am genuinely worried for the young lads growing up and seeing these unrealistic physiques on Instagram,\" Whaite said in the tearful video.\"You've only got one body, so please just respect it, please just let it do what it can do, don't try and push it, stretch, eat well, try and get to the place where you look in the mirror and you see yourself with kind eyes.\"Taking steroids, he added, had been a \"stupid decision of my own\", adding that he was \"tired of being tethered to this solution\".In a caption accompanying the video, Whaite concluded: \"Steroids have made me want to end my life. \"That stops now. I choose life. I choose health. I choose love. I choose a simpler life.\"The BBC has contacted Whaite for comment.What are steroids and are they illegal?Anabolic steroids - a man-made substance that copies the male hormone testosterone - are class C drugs that are legal for personal use.Pharmacists can issue them, but only with a prescription.But it is illegal to supply or sell them, including giving them to friends. This carries a maximum prison sentence of 14 years.Seizures of anabolic steroids increased by 26% in the UK last year to 995,830 doses, most were found at the UK border.There is no official medical research or guidance on how to reduce risks of taking them.The steroids stop many of the body's normal function including sperm production. Side effects such as testicle shrinkage can be reversible when men stop taking the drug, but it may take years and often is not complete.If you've been affected by any of the issues in this story, you can find support via BBC Action Line. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Whaite: Strictly contestant and Bake Off winner reveals steroid addiction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/47a1/live/62dff990-c3c3-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-17T15:56:47.000Z",
      "dateModified": "2025-11-17T15:56:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "From seabirds to sea turtles: the fatal toll of plastic revealed",
    "url": "https://www.bbc.com/news/articles/cr5eyjd2zz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/048e/live/0f83aff0-c394-11f0-bf6d-2303f4ff06b7.jpg",
    "tag": "Trending",
    "date": "2025-11-17T20:00:14.000Z",
    "description": "14 minutes agoHelen BriggsBBC environment correspondentGetty ImagesA seal pup entangled in plastic on a beachScientists have analysed 10,000 marine an",
    "body": "14 minutes agoHelen BriggsBBC environment correspondentGetty ImagesA seal pup entangled in plastic on a beachScientists have analysed 10,000 marine animal autopsies to understand how plastic ingestion leads to death.The study found seabirds face extreme risk after swallowing just 23 pieces of plastic, giving them a 90% chance of dying. Marine mammals reach similar danger at 29 pieces, while sea turtles need to ingest around 405 pieces to hit the same threshold.The researchers were surprised by how little plastic can be dangerous - less than a soccer ball's worth of soft plastic by volume can be fatal to a dolphin, while a seabird might die from ingesting a few pieces of rubber smaller than the size of a pea.They say the findings could help shape global efforts to protect wildlife.Getty ImagesPlastic pollution poses a serious risk to sea birds from injury and poisoning\"It's a really important reminder that plastic pollution does pose an existential threat to ocean wildlife,\" said lead researcher, Dr Erin Murphy of the US-based environment group, Ocean Conservancy.The analysis used autopsy data from seabirds, sea turtles, and marine mammals such as seals, sea lions, and dolphins, collected worldwide. Nearly half of the sea turtles studied, a third of the seabirds, and one in ten of the marine mammals had eaten plastic.The researchers estimated the death risks from swallowing different sorts of plastic in each group of marine animals.They found the type of plastic matters: rubber is most dangerous for seabirds; soft plastics and fishing debris pose the greatest risk to marine mammals; and both hard and soft plastics threaten turtles.Getty ImagesA newborn green sea turtle struggles to escape a plastic netThe study examined only plastics found inside the stomachs of animals. It did not assess chemical impacts or entanglement, meaning the true scale of harm is likely to be higher.Hundreds of marine species have been found with plastic in their bodies. Birds often swallow plastic fragments, and turtles mistake plastic bags for jellyfish. Until now, however, scientists lacked precise data on how much plastic is lethal for animals of different sizes.Dr Murphy added: \"To effectively address plastic pollution, the science is clear. We need to reduce the amount of plastic we produce, improve collection and recycling, and clean up what's already out there.\"The research is published in Proceedings of the National Academy of Sciences.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "From seabirds to sea turtles: the fatal toll of plastic revealed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/048e/live/0f83aff0-c394-11f0-bf6d-2303f4ff06b7.jpg"
      ],
      "datePublished": "2025-11-17T20:00:14.000Z",
      "dateModified": "2025-11-17T20:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ariana Grande: Singapore jails Australian man who grabbed Wicked star",
    "url": "https://www.bbc.com/news/articles/c2dr6y0w3rjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/83c5/live/99d9c930-c38c-11f0-b361-a5e2400a8ebf.jpg",
    "tag": "Trending",
    "date": "2025-11-17T09:17:22.000Z",
    "description": "A court in Singapore has sentenced an Australian man to nine days in prison for grabbing Hollywood star Ariana Grande at a movie premiere.Johnson Wen,",
    "body": "A court in Singapore has sentenced an Australian man to nine days in prison for grabbing Hollywood star Ariana Grande at a movie premiere.Johnson Wen, 26, was found guilty of being a public nuisance over the high-profile incident last Thursday at the Asia premiere for Wicked: For Good. Videos posted on social media show Wen jumping the barriers, charging at a visibly shocked Grande and grabbing her shoulders while jumping up and down.The incident sparked outrage in Singapore, where many called for the arrest and deportation of Wen, who has a history of disrupting concerts and celebrity events.Several accused him of \"re-traumatising\" Grande. The pop star turned actress has spoken of experiencing post-traumatic stress disorder after a suicide bomb attack at her May 2017 concert in Manchester, killing 22 people and injuring hundreds.In Wen's trial on Monday, the court heard he had attempted to intrude on the movie premiere twice, Singaporean media reports.Moments after he grabbed Grande, her co-star Cynthia Erivo forcibly pried him off and security staff escorted him out.He then made a second attempt to jump the barricades. Security staff stopped him and this time pinned him down.Wen later posted videos of the incident on his social media accounts thanking Grande and stating that he was \"free\".Police in Singapore arrested him the next day and charged him with public nuisance. Wen pleaded guilty.Prosecutors sought a week's jail for Wen, arguing that he was a \"serial intruder\" who publicised his behaviour to gain popularity online.Wen has posted videos of himself disrupting concerts by Katy Perry and The Weeknd, and invading the pitch at various sporting events. Australian media have reported he is banned from some stadiums and has incurred large fines.Wen, who was not represented in the Singapore court, told the judge in mitigation that he would \"not do it again\".Under Singapore's laws against public nuisance, Wen could have been jailed for up to three months, fined up to S$2,000 (£1,167; $1,537), or both.Grande has not commented on the case, while continuing to appear in public at events in Los Angeles over the weekend.But two days after the incident, Erivo appeared to allude to it when she spoke about her relationship with Grande while making the movie, saying: \"We have come through some stuff in our lives, our daily workings... even this last week, let's be honest.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ariana Grande: Singapore jails Australian man who grabbed Wicked star",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/83c5/live/99d9c930-c38c-11f0-b361-a5e2400a8ebf.jpg"
      ],
      "datePublished": "2025-11-17T09:17:22.000Z",
      "dateModified": "2025-11-17T09:17:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poland rail explosion: PM says blast was 'unprecedented act of sabotage'",
    "url": "https://www.bbc.com/news/articles/cp85g86x0zgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9bdf/live/8c8e3e90-c3d8-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-17T17:42:39.000Z",
    "description": "3 hours agoSarah RainsfordSouthern and Eastern Europe correspondentPoland's prime minister has said an explosion on a railway line leading to the Ukra",
    "body": "3 hours agoSarah RainsfordSouthern and Eastern Europe correspondentPoland's prime minister has said an explosion on a railway line leading to the Ukraine border this weekend was caused by \"an unprecedented act of sabotage\", and vowed to catch those responsible \"regardless of who their backers are\".Visiting the scene this morning, Donald Tusk said the damage done to the railway tracks on Sunday was deliberate and likely aimed at blowing up the train. He expressed relief there were no casualties.Speaking later in Warsaw, after an emergency meeting of security officials, Poland's special services minister said there was a \"very high chance\" that the blast was carried out on the orders of \"foreign services\".He didn't name Russia directly but Poland has experienced a series of major arson and sabotage attacks in recent years, including parcel bombings, that it sees as part of Moscow's hybrid war on the West.The incident happened on the track between Warsaw and Lublin to the south-east, and Tusk noted that the route was \"crucially important for delivering aid to Ukraine\".Poland's railway network is a critical part of the military supply lines for its neighbour as well as a route for civilians moving in and out of the country.Investigators are looking into a second incident that occurred further down the same line on Sunday, where a packed train was forced to stop suddenly. It's thought \"very likely\" to be another case of sabotage – though not an explosion.\"These events show that the people behind it have decided to begin a new phase of threatening the railway infrastructure,\" Special Services Minister Tomasz Siemoniak said.Russia always denies any role in such attacks.The damage near Mika, about 100km (60 miles) south-east of Warsaw, was detected at around 07:30 local time (06:30 GMT) on Sunday morning by a train driver who was forced to make an emergency stop.Photographs from the scene appear to show a section of track missing. There were only two passengers and several staff on board the train and no one was hurt.On Monday the interior minister confirmed that the use of explosives was \"beyond any doubt\", though he didn't go into detail, citing the ongoing investigation.A local resident told Polish TV he had heard a blast the previous evening.\"It shook the whole building, the windows... it all trembled so much,\" the man said, adding that people several kilometres away had felt the impact.He thought at first it was a gas explosion, or a falling drone. A police patrol investigated but found nothing untoward.The following morning, several trains passed over the damaged section of track and one reported the problem back to base but the line was not closed.No suspects have yet been detained but officials say police have collected a significant amount of evidence, including footage from nearby security cameras, to help identify who carried out this \"shameful act of sabotage\".The strong language and close focus on the incident come as Poland investigates another suspected hybrid attack involving parcel bombs sent from Lithuania last year using a courier service.One exploded just outside Warsaw and a second was intercepted. Another reached the UK on a cargo plane and went off in a DHL warehouse.A number of suspects are in custody in Poland awaiting trial, including a Russian man, said to be one of the organisers, who was extradited from Bosnia.There have been multiple other cases using people recruited via the Telegram messenger app, using accounts that Poland believes are run by Russian intelligence.Two years ago, more than a dozen people were found guilty of installing secret cameras close to the railway lines in Poland that are used to send weapons and equipment to Ukraine.But this is the first direct attack on the network.Some experts quoted by Polish media suggest the aim was mainly psychological: that the explosives were meant to derail the train, not destroy it, to scare Poland off continuing its support for Ukraine.But the Justice Minister said anyone involved would be found and prosecuted \"ruthlessly\" and there was \"no place on earth they can hide\".Despite the symbolic show of strength – with several security officials and a prosecutor lined up on stage in suits - government ministers faced a barrage of questions about how such sabotage was possible and why the damage to the track wasn't located sooner.In a tetchy exchange, the officials insisted that the response had been swift and effective and that it was \"untrue and insulting\" to criticise.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poland rail explosion: PM says blast was 'unprecedented act of sabotage'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9bdf/live/8c8e3e90-c3d8-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-17T17:42:39.000Z",
      "dateModified": "2025-11-17T17:42:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Key takeaways: What are the proposed asylum system reforms?",
    "url": "https://www.bbc.com/news/articles/c3eplk4047do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8ceb/live/7f570fd0-671d-11f0-af20-030418be2ca5.jpg",
    "tag": "Trending",
    "date": "2025-11-17T18:33:36.000Z",
    "description": "2 hours agoSam FrancisPolitical reporter PA MediaHome Secretary Shabana Mahmood has unveiled what has been billed as the biggest changes to tackle ill",
    "body": "2 hours agoSam FrancisPolitical reporter PA MediaHome Secretary Shabana Mahmood has unveiled what has been billed as the biggest changes to tackle illegal migration \"in modern times\".The package, modelled on the stricter approach brought in by Denmark's centre-left government, makes refugee status temporary, narrows the appeal process and threatens visa bans on countries that block returns.Here's what we know:Refugee status to become temporaryPeople granted asylum in the UK will only be allowed to stay in the country temporarily, with their status reviewed every 30 months.This means people could be returned to their home country if it is judged \"safe\".The scheme mirrors the approach in Denmark, where refugees get two-year permits and must reapply when they expire.The government says it has already started supporting people to return to Syria voluntarily, following the toppling of the Assad regime.It will now start exploring forced returns to Syria and other countries where people have not routinely been removed to in recent years.Refugees will also need to be resident in the UK for 20 years before they can apply for permanent residence or indefinite leave to remain -  up from the current five years.Meanwhile, the government will create a new \"work and study\" visa route, and encourage refugees to find employment or begin education in order to switch onto this route and earn settlement more quickly.Only those on this work and study route will be able to sponsor family members to join them in the UK.Human rights law overhaulThe home secretary also plans to end the process of allowing multiple appeals in asylum cases and replacing it with a single, consolidated appeal where all grounds must be raised at once. A new independent appeals body will be created, staffed by trained adjudicators and supported by early legal advice.To do this, the government will introduce a law to change how the right to family life under Article 8 of the European Convention on Human Rights (ECHR) is applied in migration court cases.Only those with immediate relatives, like children or parents, will be able to remain in the UK in future.A greater weight will be given to the public interest in removing foreign offenders and people who entered illegally. The government will also narrow the application of Article 3 of the ECHR, which bans inhuman or degrading treatment.Ministers say the current interpretation of the law allows multiple appeals against refusals for asylum - including serious criminals having their deportation blocked because their healthcare needs cannot be met.The Modern Slavery Act will be tightened to curb last‑minute trafficking claims used to halt removals by requiring asylum seekers to disclose all relevant information early. Any information disclosed later will be treated as less credible.Ending housing and financial supportMahmood will revoke the legal duty to provide asylum seekers with support, ending guaranteed housing and weekly pay.Support would still be available for \"those who are destitute\" but will be withheld from those with permission to work who do not, and from people who break the law or defy removal directions. Those who \"have deliberately made themselves destitute\" will also be denied support.Under plans, asylum seekers with assets will be required to contribute to the cost of their accommodation. This echoes Denmark's approach where asylum seekers must use savings to pay for their accommodation and authorities can seize assets at the border.UK Home Office sources have ruled out confiscating sentimental items like wedding rings, but Home Office Minister Alex Norris has suggested that cars and e-bikes could be targeted.The government has previously pledged to end the use of hotels to hold asylum seekers by 2029, which official figures show cost the government £5.77m per day last year.The government is also consulting on plans to end the current system where families whose asylum claims have been refused continue receiving housing and financial support until their youngest child turns 18. Ministers say the current system creates a \"perverse incentive\" to remain in the UK without status. Instead, families will be offered financial assistance to return voluntarily, but if they refuse, enforced removal will follow.New safe and legal routesAlongside tightening access to refugee status, the UK would create new legal routes to the UK, with an annual cap on numbers.Under the changes, volunteers and community groups will be able to sponsor individual refugees, echoing the \"Homes for Ukraine\" scheme where Britons hosted Ukrainians fleeing war.The government will also expand the work of the Displaced Talent Mobility pilot, set up in 2021, to encourage businesses to sponsor at-risk people from around the world to come to the UK to help fill skills gaps.The home secretary will set an annual cap on arrivals via these routes, based on local capacity. But those arriving on the legal routes will be on a streamlined ten-year route to settlement.Visa bansVisa penalties will be applied to countries who fail to co-operate with the returns policies, including an \"emergency brake\" on visas for countries with high asylum claims until they takes back its citizens who are in the UK illegally.The UK has already identified three African countries it plans to penalise if their governments do not improve co-operation on removals.The governments of Angola, Namibia and the Democratic Republic of Congo will have a month to start co-operating before a sliding scale of sanctions are imposed, the Home Office said on Monday. Increased use of technologyThe government is also planning to roll out new technologies to strengthen enforcement.Trials of AI-driven technology to verify the age of asylum seekers, particularly those claiming to be children, will be rolled out more widely.Alongside this, the government plans to introduce a digital ID by the end of Parliament. This will allow more accurate right-to-work checks by employers and make it harder for illegal workers to use fraudulent documents, the government argues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Key takeaways: What are the proposed asylum system reforms?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8ceb/live/7f570fd0-671d-11f0-af20-030418be2ca5.jpg"
      ],
      "datePublished": "2025-11-17T18:33:36.000Z",
      "dateModified": "2025-11-17T18:33:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singing of KPop Demon Hunters songs banned at school in Poole",
    "url": "https://www.bbc.com/news/articles/ceq03r3z2eqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d61/live/f915bed0-82ec-11f0-a819-c948892e2dca.jpg",
    "tag": "Trending",
    "date": "2025-11-17T14:59:30.000Z",
    "description": "5 hours agoCurtis LancasterSouth of EnglandNetflixRumi, Zoey and Mira are Huntr/x - the K-pop trio who also try and save the world from demonsA school",
    "body": "5 hours agoCurtis LancasterSouth of EnglandNetflixRumi, Zoey and Mira are Huntr/x - the K-pop trio who also try and save the world from demonsA school has banned the singing of songs from hit Netflix film KPop Demon Hunters over concerns they are not in keeping with its \"Christian ethos\". Lilliput Church of England Infant School in Poole, Dorset, sent a message to parents on Friday saying some members of the community are \"deeply uncomfortable\" with references to demons. It said this was because they \"associate them with spiritual forces opposed to God and goodness\". In an update on Monday, acting head teacher Lloyd Allington said he had since received feedback from parents, highlighting positive messages from the songs, but said the school was seeking to support those who found the themes \"challenging\".KPop Demon Hunters became Netflix's most viewed film ever in August and follows the adventures of fictional K-pop girl band Huntr/x as its three members use their music and fighting skills to protect humans from demons.It also features a rival group made up of five demons called the Saja Boys, whose song lyrics cover themes including temptation and seduction. In the initial message sent to parents, the school asked them to encourage their children \"not to sing these songs at school out of respect for those who find the themes at odds with their faith\".But one parent told the BBC: \"I thought it was ridiculous. My daughter is very into K-pop and her and all of her little friends love it.\"Getty ImagesThe school's head teacher told parents references to demons can feel \"deeply uncomfortable\" to ChristiansHe said they did performances at after-school clubs.\"It's just a harmless, a nice little thing for them to do to get their confidence up,\" he said.He describes himself as an atheist and said it felt like \"a bit of an imposition and probably a bit unfair and silly\".He said nothing like this had happened before and praised the school in general, but felt it had been put under pressure to make the change.In Monday's update, acting head Mr Allington said the school had received feedback from parents who said songs - such as 10-week UK number one single Golden - had helped their children learn about teamwork, courage and kindness.He continued: \"While we fully respect your right to make choices about the content your child engages with at home, we also want to be mindful of the diversity of beliefs within our school community.\"For some Christians, references to demons can feel deeply uncomfortable because they associate them with spiritual forces opposed to God and goodness.\"He added: \"We are not asking parents to tell their children that there is anything wrong with enjoying the film or its songs if it aligns with your own views and beliefs...\"Our role will simply be to help children understand that some of their peers may hold different views and to explore how we can respect and support those peers in upholding their faith.\"More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singing of KPop Demon Hunters songs banned at school in Poole",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d61/live/f915bed0-82ec-11f0-a819-c948892e2dca.jpg"
      ],
      "datePublished": "2025-11-17T14:59:30.000Z",
      "dateModified": "2025-11-17T14:59:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Birmingham agency bin staff to strike over bullying",
    "url": "https://www.bbc.com/news/articles/cg7nxx7dl40o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b7c7/live/3584ec50-c3c6-11f0-8318-3f3853f530dc.jpg",
    "tag": "Trending",
    "date": "2025-11-17T19:35:29.000Z",
    "description": "Agency staff who had continued working during Birmingham's long-running bin strike have voted to take industrial action themselves over claims of bull",
    "body": "Agency staff who had continued working during Birmingham's long-running bin strike have voted to take industrial action themselves over claims of bullying and harassment.Hundreds of members of Unite in Birmingham have been on all-out strike since March in a dispute over pay and jobs.Now, Unite claims a growing number of agency staff are refusing to cross the picket lines of the striking workers because of \"unsustainable workloads\" and a \"bullying\" workplace culture. Unite confirmed 18 out of 22 agency staff who are members had voted to join official picket lines from 1 December. Birmingham City Council denied the union's claims about the department.Unite general secretary Sharon Graham said: \"This is a real escalation in the dispute with agency workers now joining picket lines due to the terrible way they have been treated by Job&Talent and Birmingham council.\"Birmingham City Council previously denied the allegations and said it did not \"condone any actions which are contrary to legislation and good employment practice.\"In a statement on Monday, the council said \"a small number of agency staff\" were in a separate dispute with the Job&Talent agency and the authority planned to continue to move forward with its changes to services that were \"long overdue\".\"While we are disappointed the dispute has not been resolved as Unite has rejected all our offers, we are continuing to make regular waste collections and our contingency plan is working,\" the spokesman added.\"We have been collecting an average of approximately 1,330 tonnes of kerbside waste every day, more than we did prior to industrial action, and over the last six months we have collected over 100,000 tonnes of kerbside waste.\"Agency workers have been part of the refuse collection workforce since before the strike, and Job&Talent said the numbers employed had not changed during the dispute.Unite union members in the city began a full walkout eight months ago, and in September voted to extend their action until March.Last month, the union accused senior council managers of threatening to blacklist agency staff who refused to cross the striking bin workers' picket line.Footage was shared showing a manager from Job&Talent telling staff that council chiefs would ban them from jobs.Dr Roger Seifert, an industrial relations specialist from the University of Wolverhampton, said the strike was \"terrible\", had been going on far too long and was damaging the city's reputation.\"Once you go down agency road, the employer loses control over how those agency workers are treated by the agency itself.\"What happens is, the pressure builds up and then there's a tendency to push that pressure on to the workers.\"He added: \"What we end up with is bad blood, and two sides as far apart as ever, there's no goodwill and in the middle of all this, the people of Birmingham are having a worse service.\"A spokesperson for Job&Talent said it remained \"firmly committed to operating with transparency, integrity, and full compliance with employment laws\". \"We prioritise the rights, welfare, and safety of our workers and maintain regular communication to ensure they feel supported. It added it took any allegation concerning worker welfare and safety extremely seriously, and would not \"tolerate intimidation or threats against workers for exercising their rights, including participation in industrial action\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Birmingham agency bin staff to strike over bullying",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b7c7/live/3584ec50-c3c6-11f0-8318-3f3853f530dc.jpg"
      ],
      "datePublished": "2025-11-17T19:35:29.000Z",
      "dateModified": "2025-11-17T19:35:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pauline Quirke still funny and recognises us say family, in dementia update",
    "url": "https://www.bbc.com/news/articles/cy9pz4ry3d9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/950e/live/b4b861f0-c3a8-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-17T05:47:24.000Z",
    "description": "14 hours agoHelen BushbyCulture reporter'She's still the funniest person in the world,' Pauline's son told BBC Breakfast\"She's still funny, she's talk",
    "body": "14 hours agoHelen BushbyCulture reporter'She's still the funniest person in the world,' Pauline's son told BBC Breakfast\"She's still funny, she's talking, she's happy.\"Birds of a Feather actress Pauline Quirke was diagnosed with dementia in 2021. Her family, who are unsure what stage she is at, have spoken of their \"disbelief\" at the time. Despite being \"very private\", they told BBC Breakfast they decided to speak out to raise awareness and funds for the condition. \"My mum has always been a charitable person. It's what she would want me to do,\" said her son, Charlie Quirke.Best-known for playing Sharon Theodopolopodous in long-running sitcom Birds of a Feather, 66-year-old Quirke was also nominated for a Bafta in 1997 for playing a convicted murderer in BBC drama The Sculptress.In 2022, she was made an MBE for services to the entertainment industry, young people, and charities.But earlier this year her husband, Steve Sheen, who she married in 1996, had to announce her retirement.This ended both her 50-year acting career, along with her role as head of Pauline Quirke Academy of Performing Arts, which has about 250 academies, and more than 15,000 young students across the UK.Charlie Quirke and Steve Sheen said Quirke still tells them she loves themSteve said they first got an inkling something might be wrong with Quirke in November 2020, after she received a script.\"She started reading it and she phoned me on that day and said, the words are not going in. That's where it started,\" he said.Their reaction after the diagnosis was \"disbelief, really\". \"We looked at each other and went, 'Can't be, it's long Covid. Got the flu'.\"Charlie added he was \"quite surprised that this was possible in a woman in her 60s, and it can happen to people in their 50s, people in their 40s, so it's something you have to deal with and learn about\".Dementia is described as \"young onset\" when symptoms develop before the age of 65. It most often develops in people between the ages of 45 and 65 but can affect people of any age.Asked what stage Quirke is at in her dementia journey, Steve said: \"We don't know. She's still funny. She's talking. She's happy.\"\"Is it four years, eight years, 10 years, 12 years, 20, who knows?\" Charlie added: \"And that's the problem, no one tells you. \"My mum knows exactly who we are. Every time she sees all of us, she smiles, laughs, says 'I love you', says 'hello'.\"They spoke about why they were sharing their experience, and what they had learned so far. \"Unfortunately we are not in the state where we can do much about it,\" Steve said. \"Just take every day and try and take the best moment out of that day you can.\"It's a long journey. If we can just help a little bit by using Pauline as the catalyst to make more people aware, then we should, to use her to boost awareness and raise funds for dementia research.\" (L-R) Pauline Quirke as Sharon Theodopolopodous, Lesley Joseph as Dorien Green and Linda Robson as Tracey Stubbs in Birds of a FeatherSteve said the impact of the condition hit them slowly. \"It's so gradual that for the first year, two years, you're thinking, ah, she's alright. \"Now, we're three or four years in, it's a little bit different. This is why awareness is important. We didn't know how long it lasts or how long you have with it, or how bad it is or how quick it is.\"Charlie added that it \"progresses and changes every day, but so do we - we change and progress, and so we're forever learning\".The NHS website states dementia is a syndrome (a group of related symptoms) \"associated with an ongoing decline of brain functioning\". Quirke was nominated for a Bafta for playing murderer Olive Martin in BBC series The SculptressNext month, Charlie is doing a fundraising walk for Alzheimer's Research UK, going 140 kilometres to places that shaped his mother's life, including homes she has lived in, theatres and TV studios she has worked at. It will also include the Buckinghamshire headquarters of her children's drama academy. \"This is my mum's legacy,\" he said. \"This is going to be one of the stops on my trek, because she wanted to nurture the next generation of young actors.\"Steve paid tribute to his wife, saying: \"What you see is what you get. Loving. Brilliant. She's an iconic actress because her talent is immense.\"Charlie added: \"She is an incredible, strong, courageous woman that's been through a lot and she keeps going. \"She's a fighter and it's incredible to see, yeah, very proud of her.\"If you are affected by any of the issues raised in this story, support and advice is available via the BBC Action Line.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pauline Quirke still funny and recognises us say family, in dementia update",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/950e/live/b4b861f0-c3a8-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-17T05:47:24.000Z",
      "dateModified": "2025-11-17T05:47:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: Snow and ice warnings issued by Met Office as -12C forecast",
    "url": "https://www.bbc.com/weather/articles/cz0xvjrzp4eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/6681/live/01524a10-c39c-11f0-a624-43243f904594.jpg",
    "tag": "Trending",
    "date": "2025-11-17T16:05:24.000Z",
    "description": "Snow and ice warnings issued by Met Office as sub-zero temperatures forecastImage source, GettyBySimon King Lead Weather PresenterUpdated 4 hours agoA",
    "body": "Snow and ice warnings issued by Met Office as sub-zero temperatures forecastImage source, GettyBySimon King Lead Weather PresenterUpdated 4 hours agoArctic air has spread across the United Kingdom as temperatures drop with the threat of snow and ice for some.Met Office yellow severe weather warnings for snow and ice have been issued across Scotland and northern England on Tuesday.There are also amber and yellow cold-health alerts, external, issued by the UK Health Security Agency (UKHSA), valid until Friday across northern England and the Midlands.It will turn less cold by the end of the week.Media caption, When and where will it snow?November has so far been exceptionally mild with temperatures 3-6C above average.But that has now changed as a northerly wind is dragging cold Arctic air across the UK with temperatures now falling 3-6C below the mid-November average.Yellow cold-health alerts from the UKHSA are in force across the Midlands and northern England until 08:00 GMT Friday.But more severe amber alerts have been issued for North West, North East, Yorkshire and Humber for the same period.These alerts are mainly for health and social care services, warning of \"significant\" impacts to more vulnerable members of the community.Extra demands may be put on services to deal with the colder weather.The cold weather leads to excess deaths, particularly those over 65 or those with health conditions.  The UKHSA also warns there maybe impacts to some younger age groups too.Image caption, Snow and ice yellow Met Office warnings for Monday night into TuesdayRain is forecast to spread south and east across the UK on Monday night and Tuesday, with the air is cold enough for this to turn to snow for some.A yellow weather warning for snow has been issued for northern and eastern Scotland starting at 03:00 GMT on Tuesday and valid until 18:00.There could be as much as 5-10cm of snow accumulating over the highest ground (above 400m) but even down to lower levels 2-5cm is forecast.The snow could make some higher routes impassable and there could be some disruption to rail journeys.During Tuesday there could also be hill snow in the North Pennines and the North York Moors.Ice will also be a hazard with additional Met Office yellow warnings issued for northern and eastern Scotland - valid from 19:00 Monday to 10:00 GMT Tuesday.An ice warning is also issued for central Scotland and down to northern England from 05:00 to 12:00 GMT Tuesday.Further frequent and heavy snow showers will spread into northern Scotland overnight Tuesday, even to sea level.  These will continue right through until Thursday.With snow accumulating, another Met Office warning for snow and ice is in force for northern Scotland from 18:00 GMT Tuesday to 21:00 Thursday.Frequent snow showers may bring 2-5cm to low levels but as much as 15-20cm is possible above 300m.Gusty winds and lightning with the snow may bring additional hazards.Image caption, Additional Met Office yellow warnings come into force on Wednesday and Thursday as snow and ice threat continuesThe cold northerly wind on Wednesday will blow in snow showers across mostly northern Scotland but also for a time in Northern Ireland, eastern England, west Wales and even the Moors of south-west England.Some of these snow showers could be heavy with thunderstorms - known as 'thundersnow'.Another Met Office yellow warning is in force for snow and ice in coastal areas of eastern England valid 06:00 GMT Wednesday until 18:00 Thursday.Where the snow showers come in frequently from the North Sea, some areas may get 2-5cm at low levels.But over hills above 300m, up to 20cm of settling snow is possible.As temperatures fall below freezing overnight, ice will form.Image caption, Frequent snow showers will come into parts of the UK on Wednesday on a brisk northerly windHow cold will it get?From Wednesday it will feel especially cold for most of us with temperatures of 2-5C but feeling more like minus 2 to 4C when you're in the wind.There will be some overnight frosts and risk of ice where showers fall.Thursday night will be the coldest night this week with temperatures widely falling below zero and down to -12C in rural Scotland.While Friday will start as the coldest morning of the autumn so far with lots of sunshine, we'll start to see a shift away from the cold northerly wind.An Atlantic weather system will slowly come in from the west bringing more cloud and bit of rain and less-cold air.Temperatures by Saturday will rise slightly to average. So while it won't feel as mild as it was last week, it won't be as cold as much of this week will be.Click here to play 'Cooler than me?'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: Snow and ice warnings issued by Met Office as -12C forecast",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/6681/live/01524a10-c39c-11f0-a624-43243f904594.jpg"
      ],
      "datePublished": "2025-11-17T16:05:24.000Z",
      "dateModified": "2025-11-17T16:05:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]