[
  {
    "title": "Vogue Williams and Tom Read Wilson join I'm A Celebrity... Get Me Out of Here!",
    "url": "https://www.bbc.com/news/articles/cj414xqj2e7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/83dd/live/b6c403c0-c545-11f0-b288-51552c83ad58.jpg",
    "tag": "Trending",
    "date": "2025-11-19T22:47:37.000Z",
    "description": "Vogue Williams and Tom Read Wilson enter TV jungle as I'm A Celebrity's late entrants2 hours agoSteven McIntoshEntertainment reporter ITVIrish TV pres",
    "body": "Vogue Williams and Tom Read Wilson enter TV jungle as I'm A Celebrity's late entrants2 hours agoSteven McIntoshEntertainment reporter ITVIrish TV presenter Vogue Williams and Celebs Go Dating receptionist Tom Read Wilson are to join I'm A Celebrity... Get Me Out Here!The late entrants were revealed on Wednesday night's instalment of the ITV show, and will be shown entering the camp on Thursday's episode.Williams said taking part in the series was a \"massive life experience\", adding that she doesn't normally go \"out of my comfort zone\".Read Wilson said he initially felt \"abject terror\" about taking part but is now \"feeling excited\" about entering the Australian jungle.The pair join fellow campmates, including Martin Kemp, Ruby Wax, Jack Osbourne and Kelly Brook, who have been in the jungle since the show's launch on Sunday.Williams, who is married to former Made In Chelsea star Spencer Matthews, said: \"I always thought I wouldn't do it, because I've gotten too comfortable in my life. I like to have eight hours of sleep, I like to eat nice things, I like to just chill out and I never put myself out of my comfort zone.\"Then when I turned 40, I started to get scared of ridiculous things. I didn't want to be this person. Doing this is such a massive life experience and it is not something you can pay to do.\"So now I am 40, I think it will be pretty cool to do I'm A Celebrity.\"The mother-of-three said she was \"very worried about missing the kids\" while in camp.\"I have never been away this long before and I spend such a huge amount of time with them,\" she explained. \"It will be my biggest struggle.\"ITVRead Wilson, who was also a contestant on the fifth series of The Voice UK in 2016 and then runner-up on Celebrity Best Home Cook in 2021, said he was \"feeling excited\" about entering the jungle.\"My first thought when they approached me about taking part was abject terror,\" said the 39-year-old. \"But I have got a very strict rule in life. If the only reason that you don't want to do it is fear, you must do it, whatever it is.\"I'm fearful as a porcupine and I am very nervous that my grey cells [brains] won't dance properly in camp, too. At home, I do a cryptic crossword every day, I always have a book on the go and I am a bit worried that my frontal lobes will drop off if I don't have a lubricant for it.\"He continued: \"I can be vague at times and I don't want to scatter brain cells over the camp.\"His role as a receptionist and client coordinator on Celebs Go Dating sees him greet the celebrities upon their arrival to the dating agency.He is also well known for his wide vocabulary and published a book about language in 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vogue Williams and Tom Read Wilson join I'm A Celebrity... Get Me Out of Here!",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/83dd/live/b6c403c0-c545-11f0-b288-51552c83ad58.jpg"
      ],
      "datePublished": "2025-11-19T22:47:37.000Z",
      "dateModified": "2025-11-19T22:47:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'North Sea stand-off' and 'Council tax hike for millions'",
    "url": "https://www.bbc.com/news/articles/c2lplzd41gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5285/live/23468d20-c5a4-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2025-11-20T00:58:05.000Z",
    "description": "Just nowThe activity of a Russian spy ship in the North Sea made several front pages on Thursday, with the Mirror quoting Defence Secretary John Heale",
    "body": "Just nowThe activity of a Russian spy ship in the North Sea made several front pages on Thursday, with the Mirror quoting Defence Secretary John Healey in its headline. He told reporters that the Yantar \"dangerously\" directed lasers to disrupt RAF pilots tracking its activity near UK waters. \"We see you, we know what you're doing,\" he warned Moscow.The Independent also made a nod to Healey in their headline, characterising his quotes as a \"stern threat to Putin\". Russia's Embassy in London says it's not undermining UK security and it has condemned Healey's statement as provocative. The Sun says the incident has caused tensions with Russia to escalate, amid \"more damning revelations\" about a British man facing a war crimes charge for spreading what the paper calls \"sick Putin propaganda\".The i Paper reports that local authorities in London and the South East will be allowed to raise their council tax without a public vote. The paper says that the hikes are part of a \"major funding overhaul to protect services\", and suggests that Whitehall grants will be diverted to areas in the North and the Midlands with \"greater needs\".Trans people could be banned from single-sex spaces based on how they look, according to an exclusive report from the Times. The paper says the guidance from the Equality and Human Rights Commission was handed to ministers three months ago, but is yet to be published.\"Starmer calls on Farage to address racism claims,\" says the Guardian, following on from its reporting on Wednesday which alleged that the Reform UK leader had made racist comments when he was in school. Farage has denied making any of the comments and actions attributed to him by former pupils at Dulwich College, in south London, in the 1970s.Officials have spoken to the Daily Telegraph about a secret deal that has been \"thrashed out\" between the US and Russia in a recent \"flurry\" of talks. Sources familiar with the 28-point plan have told the paper that Ukraine could be forced to cede control of the eastern Donbas region to Russia but retain ownership. Moscow would pay the nation an undisclosed rental fee. The Daily Mail says that public confidence in the economy under the Labour government is at \"rock bottom\", just one week out from the Budget. They lead with results from a YouGov poll, which found only 4% of those surveyed rated economic conditions as \"fairly good\".Budget speculation has also made the front page of the Daily Express, which says new analysis has offered proof that the pension triple lock \"must stay\". The paper says that millions of people will suffer \"pensioner poverty\" if Chancellor Rachel Reeves \"bows to pressure and allows pensioners' incomes to be whittled away\".\"Home investors pull £26bn from top London stocks despite blistering rally,\" declares the Financial Times, warning that the Budget is fuelling nervousness in investors amid a \"heightened sense of impending doom\". However, the paper says that the FTSE 100 is on course for its best year since its rebound from the financial crisis in 2009.The Metro alleges that a prestigious fertility clinic has been hacked by a group with links to Russian President Vladimir Putin. The paper says the ransomware gang, Qilin, is believed to have infiltrated the clinic's computer systems last month.Adam Peaty and Holly Ramsey are pictured on the front page of the Daily Star, after the Olympian said his family were \"encouraging false claims\" ahead of the pair's upcoming nuptials.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'North Sea stand-off' and 'Council tax hike for millions'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5285/live/23468d20-c5a4-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2025-11-20T00:58:05.000Z",
      "dateModified": "2025-11-20T00:58:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
    "url": "https://www.bbc.com/news/articles/c62e27j69q9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg",
    "tag": "Trending",
    "date": "2025-11-19T18:45:35.000Z",
    "description": "6 hours agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians have been killed in Israeli strikes across the Ga",
    "body": "6 hours agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians have been killed in Israeli strikes across the Gaza Strip, the Hamas-run health ministry has said. Ten people, including a woman and a young girl, were killed when a ministry of religious endowments building in the eastern Zeitoun neighbourhood of Gaza City was hit, according to rescuers.The Israeli military said it had struck \"Hamas terrorist targets\" after it said gunmen had opened fire towards an area where its soldiers were operating in the southern city of Khan Younis, in violation of the five-week-old ceasefire agreement.There was no immediate comment from Hamas.The flare-up of violence comes after the UN Security Council passed a resolution that endorsed US President Donald Trump's Gaza peace plan to end two years of devastating war.Mahmoud Bassal, a spokesman for Gaza's Hamas-run Civil Defence agency, told the BBC that Israeli air, drone and artillery strikes hit several locations in Gaza City and Khan Younis shortly after sunset on Wednesday.The attacks marked a sharp escalation after several days of relative calm, he said.The Civil Defence reported that the strike in Zeitoun caused severe damage to the religious endowments ministry's building and surrounding structures, and posted a video showing its rescue workers appearing to find two people buried under rubble.Photos published by the Anadolu news agency meanwhile showed the bodies of three young children reportedly recovered from the scene.In a separate incident in Gaza City, one person was killed and several others were wounded when a drone struck a group of people at Shejaiya junction on Salah al-Din Street, Gaza's main north-south road, according to Mr Bassal.He said another person was killed when a tank shell struck a house belonging to the Balboul family in Shejaiya's Mushtaha Street, which is also in eastern Gaza City.In Khan Younis, three people were killed and a number were wounded in a strike on a group inside a sports club run by the UN agency for Palestinian refugees (Unrwa), he added.In a statement, the Israel Defense Forces (IDF) said that \"several terrorists opened fire toward the area where IDF soldiers are operating in Khan Younis\" earlier on Wednesday.\"This action constitutes a violation of the ceasefire agreement. No IDF injuries were reported,\" it added. \"In response, the IDF began striking Hamas terrorist targets across the Gaza Strip.\"Israeli public broadcaster Kan cited a security source as saying the targets of the strikes were the commander of the Zeitoun Battalion of Hamas's military wing, the Izz al-Din al-Qassam Brigades, and the commander of its naval force.On Monday, the UN Security Council passed a resolution that sought to shore up the fragile ceasefire, which took effect on 10 October.Member states authorised the creation of a transitional governance body called the Board of Peace, which will be chaired by President Trump, and a temporary International Stabilisation Force (ISF), which will be tasked with ensuring \"the process of demilitarizing the Gaza Strip\".Trump hailed the resolution as \"a moment of true historic proportion\".A Hamas statement reiterated that the group would not give up its weapons without a Palestinian state, arguing its fight against Israel was legitimate \"resistance\".Israel's ambassador to the UN stressed the importance of disarmament, saying that his country would \"not stop or let up\" until Hamas no longer presented \"a threat\".The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg"
      ],
      "datePublished": "2025-11-19T18:45:35.000Z",
      "dateModified": "2025-11-19T18:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shabana Mahmood hints at shake-up of 'irrational' police structure",
    "url": "https://www.bbc.com/news/articles/cj9790jw34po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2911/live/dd5ea250-c569-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:20:57.000Z",
    "description": "8 hours agoDaniel SandfordUK correspondentThe Home Secretary Shabana Mahmood has hinted that she is thinking of changing how policing in England and W",
    "body": "8 hours agoDaniel SandfordUK correspondentThe Home Secretary Shabana Mahmood has hinted that she is thinking of changing how policing in England and Wales is organised.She told a conference of police leaders \"the structure of our police forces is, if we are honest, irrational\".Mahmood said \"disparities in performance\" meant that policing in England and Wales was a \"postcode lottery\".Some police chiefs want the number of forces to be reduced. Currently, there are 43  in England and Wales. The government is expected to publish a White Paper on the future of policing next month.The home secretary was talking at a conference of police leaders organised by the National Police Chiefs' Council (NPCC) and the Association of Police and Crime Commissioners (APCC). Last week the Home Office announced that the role of Police and Crime Commissioner (PCC) would be abolished. Mahmood told delegates on Wednesday the position \"had not worked\".She told the conference \"I was a reformer at the Ministry of Justice. I will be a reformer at the Home Office too.\"Mahmood told the delegates - mostly senior officers and Police and Crime Commissioners: \"The structure of our police forces is, if we are honest, irrational.\"We have loaded critical functions like the national police air service and vetting onto local forces, drawing attention away from neighbourhood policing.\"We have 43 forces tackling criminal gangs who cross borders, and the disparities in performance in forces across the country have grown far too wide, giving truth to the old store that policing in this country is a postcode lottery.\"She said the government's plans would be laid out in a White Paper due in December, saying she wanted to see \"that national policing is world class without distracting local forces from neighbourhood policing\".\"The detail will follow,\" she said. She did not stay behind to answer questions.Some police chiefs favour a reduction in the number of forces. In July, Gavin Stephens, NPCC chair, said: \"A smaller number of police forces, supported by a national policing organisation, would enable us to make decisions far quicker and maximise funding to invest in technology and our workforce.\"But some local PCCs have opposed the idea of force mergers. Last week the Policing Minister Sarah Jones said the role would be abolished. PCCs are elected officials, but elections have often had a limited turnout. The role was created by the Conservative-Liberal Democrat coalition government in 2012.The home secretary said in her speech on Wednesday: \"I believe the position of a Police and Crime Commissioner, unfortunately, has not worked.\"Without necessary investment in creating a public profile, too many voters were unaware of the existence of the position, or its occupant.\"Police forces are also waiting for the latest funding settlement which is due in early December.Paul Sanford, Chief Constable of Norfolk Constabulary and Chair of the NPCC Finance Coordination Committee, said: \"Policing is in a state of financial distress.\"We are seeing declining financial resilience across all forces.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shabana Mahmood hints at shake-up of 'irrational' police structure",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2911/live/dd5ea250-c569-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-19T17:20:57.000Z",
      "dateModified": "2025-11-19T17:20:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer: Growing up as young man 'not easy' says PM in letter to son",
    "url": "https://www.bbc.com/news/articles/ckgkgnk7nyeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b5d2/live/a9b79940-c576-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2025-11-19T21:51:29.000Z",
    "description": "3 hours agoSam FrancisPolitical reporterSir Keir Starmer/InstagramSir Keir Starmer has said it is \"not easy\" for young men \"growing up in this day and",
    "body": "3 hours agoSam FrancisPolitical reporterSir Keir Starmer/InstagramSir Keir Starmer has said it is \"not easy\" for young men \"growing up in this day and age\", in an open letter to his son to marking International Men's Day.The prime minister urged men to talk openly about their mental health, reflecting on his strained relationship with his own father who he \"never really  spoke\" to.His comments come as the government launched England's first men's health strategy, aimed at tackling issues predominantly faced by men such as suicide, alcohol abuse and problem gambling.In the letter to his 17-year-old son, who he has not publicly named, Sir Keir said there were \"pressures on young men that are difficult to talk about\".Sir Keir also spoke about his experience of not having \"a very close relationship with my own dad\" shaped his relationship with his own children.The prime minister has made much of his background, repeatedly mentioning in speeches his father was a toolmaker and his mother a nurse, who suffered from a debilitating form of arthritis known as Still's disease.In his letter, Sir Keir wrote that he and his father \"never really spoke\" and \"never really got to know each other\".The prime minister said spending time with his son was \"one of the highlights of my week\".\"You've grown into a confident, kind, wonderful young man. And I'm so proud of you,\" he wrote.\"If there's one hope I have, it's that we keep talking, keep learning from each other, keep helping each other.\"Sir Keir also acknowledged the strain his job places on family life, saying he is acutely aware of the \"huge sacrifices\" made by his wife and children since he entered Downing Street. \"The reason I do the job I do, and I know that means huge sacrifices for you, for your sister and your mum, is because I want the world for tomorrow's generation to be better,\" he said.In his letter, Sir Keir wrote that watching Adolescence, the hit Netflix series about a 13-year-old arrested for stabbing a classmate, with his son had helped shaped his perspective on the problems facing young men.The prime minister previously invited the shows creators to a Downing Street meeting to discuss the influence of toxic material online.Sir Keir also used his weekly Prime Minister's Questions (PMQs) session to mark International Men's Day.He praised fellow Labour MP Luke Charters for sharing his mental health battle after nearly losing his wife in the traumatic birth of their first child, saying others would \"be inspired to talk openly about their experiences\".PMQs however was dominated by preparations for what is looking to be a bruising Budget for the prime minister.Conservative leader Kemi Badenoch has said the government's Budget is unravelling before it has even been delivered, after the chancellor appeared to back away from raising income tax rates following weeks of damaging stories.Sir Keir has also been forced to deny he authorised attacks on cabinet colleagues after a flurry of briefings to the press claimed ministers, including Health Secretary Wes Streeting, were plotting leadership bids.As part of the new men's health stratergy, the government has promised £3.6m over the next three years to suicide prevention projects for middle-aged men in local communities where they are most at risk of taking their own lives.Suicide is one of the biggest killers of men under 50 and three-quarters of all suicides are in men.A three-year partnership with the Premier League will also embed mental health messaging into football matches and fan spaces. The Department of Health said men are less likely to seek help and more likely to smoke, drink, gamble and use drugs than women.Under the plans, a new levy will be charged on betting companies - while the government will trial ways to reduce cocaine and alcohol-related deaths, including workplace pilots to bring health checks into male-dominated industries.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer: Growing up as young man 'not easy' says PM in letter to son",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b5d2/live/a9b79940-c576-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2025-11-19T21:51:29.000Z",
      "dateModified": "2025-11-19T21:51:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wicked: For Good leaves critics less spellbound than the first film",
    "url": "https://www.bbc.com/news/articles/c1m3ddkn3gdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dfc5/live/b49ef750-c539-11f0-88be-3bc2aea1a256.jpg",
    "tag": "Trending",
    "date": "2025-11-19T11:57:48.000Z",
    "description": "13 hours agoSteven McIntoshEntertainment reporter UniversalSeveral critics tipped Ariana Grande to repeat her supporting actress nomination at the Osc",
    "body": "13 hours agoSteven McIntoshEntertainment reporter UniversalSeveral critics tipped Ariana Grande to repeat her supporting actress nomination at the Oscars in MarchWicked: For Good has received broadly positive reviews from critics - but many are far less spellbound than they were by the first film.The much-anticipated sequel, released on Friday, sees Cynthia Erivo and Ariana Grande reprise their roles as Elphaba and Glinda in the origin story of the Wicked Witch of the West. Wicked: For Good is \"not quite Wicked: For Great\", said Empire's John Nugent in a three-star review.Total Film's Molly Edwards praised the film as an \"absolute triumph\", but added it \"suffers slightly from thinner source material and weak new songs\".UniversalThe films tell the origin story of Elphaba, the Wicked Witch of the West, played by British actress Cynthia ErivoWicked: For Good also sees Jeff Goldblum return as the Wizard, alongside Michelle Yeoh as Madame Morrible and Jonathan Bailey as Fiyero.The i paper's Francesca Steele said: \"It doesn't quite reach the heights of Part One, but this is still a highly entertaining display of what musical theatre can do on screen with top level performances and a true affection for the world-building.\"Many critics were less enthusiastic. \"There's no magic in this aimless slog of a sequel,\" said the Independent's Clarisse Loughrey in a two-star review.\"If your complaint about last year's Wicked was that it was so oddly lit that you could barely see what was going on, then fear not – in Wicked: For Good, you won't mind so much, because there's so little to look at.\"In a one-star review, the Telegraph's Robbie Collin said: \"It doesn't amount to two hours of story – the stage show clips through the same plot in around half the time – and the padding is as obvious as it is exhausting.\"He suggested the central pair's friendship \"rings false\", adding: \"What should be piercing, impassioned moments are by turns frivolous and sappy.\"However, Kevin Maher of the Times was much more positive, awarding the film four stars.\"They've only gone and done it,\" he said. \"The makers of this musical sequel have delivered a film that surpasses last year's box-office smash in verve, ambition and emotional ache.\"Both movies have been directed by Jon M Chu, who was also behind Crazy Rich Asians, In The Heights and Now You See Me 2.Chu is also set to direct a new big-screen adaptation of Joseph and the Amazing Technicolor Dreamcoat, pencilled in for release in 2027.UniversalThe film's director Jon M Chu was also behind Crazy Rich Asians and In The HeightsMany critics highlighted Grande's performance in Wicked: For Good, with several predicting another supporting actress nomination at the Oscars in March.Variety's Peter Debruge said the pop star shows \"fragility\" in her more \"nuanced\" performance. \"Whereas Grande had a relatively one-dimensional role to play in part one, Glinda now faces a complex evolution,\" he said.\"Grande has been acting since she was a kid,\" noted the Hollywood Reporter's David Rooney, \"and her quiet moments of introspection, anxiety or sadness show tender depths, as does her loyalty to Elphaba.\"But he also praised her co-star. \"Make no mistake, Erivo remains a powerhouse, with pipes that shake the heavens and a wellspring of unforced emotional intensity that never runs dry.\"\"What a performance from Erivo,\" agreed the Guardian's Peter Bradshaw in a four-star review. He added the sequel as a whole \"keeps the rainbow-coloured dreaminess and the Broadway show tune zinginess from part one\".Getty ImagesThe film also stars Jeff Goldblum (far let), Jonathan Bailey (second left) and Michelle Yeoh (far right)The stage musical was split into two parts for its film adaptation, but the two movies were filmed in one go.The first was released last November and grossed more than £750m at the box office worldwide.It went on to win two Oscars and two Baftas, for costume and production design, as well as the cinematic and box office achievement prize at the Golden Globes.One problem facing the sequel is that most of Wicked's best-known songs, including Popular and The Wizard and I, appeared in the first film.It's an issue it shares with the Broadway and West End musical. \"On stage, the second act lacks a song as strong as Defying Gravity,\" Debruge noted.In his Empire review of Wicked: For Good, Nugent concluded: \"The tone is different from that of the first film: less peppy, more glum. \"With the exception of Goldblum - who appears to be acting in his own film, delighting in stuttery drollness - all the characters are much less cheerful than they were last time around, and as a result it's less enjoyable for us to watch.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wicked: For Good leaves critics less spellbound than the first film",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dfc5/live/b49ef750-c539-11f0-88be-3bc2aea1a256.jpg"
      ],
      "datePublished": "2025-11-19T11:57:48.000Z",
      "dateModified": "2025-11-19T11:57:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top US officials in Ukraine for talks on ending war with Russia",
    "url": "https://www.bbc.com/news/articles/cvgdgrqwnq9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66be/live/44cc5b80-c57e-11f0-9053-4f5f8839bda7.jpg",
    "tag": "Trending",
    "date": "2025-11-19T21:55:06.000Z",
    "description": "Senior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army S",
    "body": "Senior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army Secretary Dan Driscoll, is expected to meet Ukrainian President Volodymyr Zelensky in Kyiv on Thursday when he returns from a trip to Turkey.Reports began surfacing on Wednesday that the US and Russia had prepared a new peace plan, containing major concessions from Ukraine. Neither Washington nor Moscow has officially confirmed the plan.Earlier in the day, at least 26 people were killed in a Russian missile and drone attack on Ukraine's western city of Ternopil, officials there said. Russia launched a full-scale invasion of Ukraine in 2022. \"Secretary Driscoll and team arrived this morning in Kyiv on behalf of the administration on a factfinding mission to meet Ukrainian officials and discuss efforts to end the war,\" Army spokesman Col David Butler said in a statement.Driscoll is joined by the US Army's chief of staff Gen Randy George, top US army commander in Europe Gen Chris Donahue, and Srg Maj of the Army Michael Weimer.Driscoll and Gen George are the most senior US military officials to hold talks in the Ukrainian capital since President Donald Trump took office in January.An image on Wednesday showed Driscoll meeting and shaking hands with Ukrainian Defence Minister Denys Shmyhal.In a post on X afterwards, Shmyhal said: \"We focused on the next steps for implementing the historic defence agreements reached by President Zelensky and President Trump\".He also thanked Washington for \"approving the sale of a support package for the PATRIOT air-defence system worth approximately $105m (£80m)\".Earlier, a Ukrainian official told CBS, the BBC's US media partner, that talks on the trip would focus on the military situation on the ground - as well as plans for a possible ceasefire. The official - who was not named - said: \"Presidents Zelensky and Trump have already agreed to stop the conflict along the existing lines of engagement, and there are agreements on granting security guarantees\".It comes as a number of outlets are reporting that the US and Russia have privately drawn up proposals on how to end the war.Citing people familiar with the matter, Axios, the Financial Times and Reuters reported that the plans call for Kyiv to give up some territories and weapons, as well as to significantly cut Ukraine's Armed Forces.Trump's special envoy Steve Witkoff and Russian leader Vladimir Putin's envoy Kirill Dmitriev are believed to have been involved in working on the 28-point peace plan.The BBC has asked the White House and a representative for Witkoff to comment.Kremlin spokesman Dmitry Peskov appeared to downplay the reports.\"In this case, we have no additional innovations to what we call 'the spirit of Anchorage',\" he told Russia's state-run media on Wednesday - referring to the August summit between Putin and Trump in the US state of Alaska.Any agreements reached during the one-day meeting have not been made public.President Zelensky has repeatedly ruled out any territorial concessions to Russia.Kyiv and its Western allies, including the US, have been calling for an immediate ceasefire along the vast front line, but Moscow has ruled that out, repeating demands that Ukraine says amount to its de facto capitulation.Earlier this month, Russian Foreign Minister Sergei Lavrov said Moscow's pre-conditions for a peace deal - including ceding territory, tough curbs on the size of Ukraine's military and the country's neutrality - had not changed since Putin laid them out two months before the full-scale invasion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top US officials in Ukraine for talks on ending war with Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66be/live/44cc5b80-c57e-11f0-9053-4f5f8839bda7.jpg"
      ],
      "datePublished": "2025-11-19T21:55:06.000Z",
      "dateModified": "2025-11-19T21:55:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yantar: How serious is the Russian spy ship move?",
    "url": "https://www.bbc.com/news/articles/c4gpgj6d4e6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8cb6/live/7b27ced0-c574-11f0-92f5-0fd46a9dc2cf.png",
    "tag": "Trending",
    "date": "2025-11-19T22:42:44.000Z",
    "description": "2 hours agoFrank GardnerSecurity correspondentMinistry of DefenceThe Ministry of Defence released new photos on Wednesday of the Royal Navy tracking t",
    "body": "2 hours agoFrank GardnerSecurity correspondentMinistry of DefenceThe Ministry of Defence released new photos on Wednesday of the Royal Navy tracking the Yantar To Russia, the Yantar is a oceanic research vessel - to others, including the UK, it's a spy ship, and a worry for Britain's defence chiefs.The vessel has long been suspected of secretly mapping out Britain's undersea cables, where more than 90% of our data, including billions of dollars of financial transactions, are transferred.But now, a new escalation, with revelations the Yantar's sailors targeted Royal Air Force pilots in patrol planes with lasers.Shining lasers into a pilot's eyes is provocative, and to use the Defence Secretary John Healey's words, \"deeply dangerous\". It's illegal in the UK and can lead to a prison sentence.Healey's direct message to Russia and its leader Vladimir Putin was stark: \"We see you. We know what you're doing. And if the Yantar travels south this week, we are ready.\" By that, he is implying should the Yantar cross inside Britain's 12-mile maritime boundary there would be a military response.This isn't the first time the Yantar has popped up near Britain's shores - at the start of the year a Royal Navy submarine made the highly unusual move to surface right in front of the ship as a sort of deterrent measure.The concern is that this is part of an ongoing operation by the Kremlin to locate and map all the vital undersea cables and pipelines that connect the UK to the rest of the world.It is also part of a wider pattern of Russian activity, as it tests Nato's reactions, resolve and defences. We've seen similar moves with the recent drone incursions across Europe, and Russian warplanes flying into Nato airspace.When three Russian fighter jets entered Estonian skies without permission in September, Italy, Finland and Sweden scrambled jets under Nato's mission to bolster its eastern flank. This is all interesting intel for Russia.As an island nation, Britain is heavily reliant on its network of undersea cables that carry data. There are also vital oil and gas pipelines connecting Britain to North Sea neighbours such as Norway. These cables and pipes are largely undefended and apparently of great interest to Russia's research vessels.Nato has identified deep-sea cables as part of the world's critical infrastructure. But they are also strategic pressure points, it says, warning that adversaries could exploit them through sabotage or hybrid warfare, threatening both civilian and military communications.Retired Royal Navy Commander Tom Sharpe made clear what the spy ship could be doing: \"The most obvious one is they sit above our cables and our critical undersea infrastructure and they nose around in the cables that transfer up to $7tn worth of financial transactions every day between us and America alone\".SPUTNIK/KREMLIN/EPA/ShutterstockPutin gave little away while he visited an AI conference in Moscow on WednesdayThe Yantar may be described by Moscow as a research vessel, but it is part of Russia's secretive Main Directorate for Deep Sea Research, or GUGI, which reports directly to the defence ministry.And while the ship bristles with hi-tech communications equipment, it's what we can't see that is of most concern.It can operate remotely-piloted miniature submarines that can dive down to sea beds many thousands of metres below the surface. These are capable of mapping the locations of cables, cutting them or planting sabotage devices that could, potentially, be activated in a time of war.The Royal Navy is experimenting with various means of combating the threat, such as a new vessel called Proteus, but critics fear much of the damage to Britain's coastal security may already have been done.Any foreign vessel operating in British waters must comply with UK national laws and international maritime conventions.The cornerstone of these complex rules is the UN Convention on the Law of The Sea (UNCLOS). This allows foreign ships to navigate through coastal waters provided that their passage is \"innocent\" - meaning it doesn't threaten the peace or security of a coastal nation like Britain.President Putin was at an AI conference in Moscow on Wednesday, and gave no immediate reaction on the situation unfolding north of Scotland.Russia's Embassy in London says it's not undermining UK security and it has condemned UK Defence Secretary Healey's statement as provocative. But all this is happening while war rages in Ukraine, a conflict Putin blames on the West and which seemingly he has no intention of stopping soon. Additional reporting by Tiffany Wertheimer and Stuart HughesMore on this story:",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yantar: How serious is the Russian spy ship move?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8cb6/live/7b27ced0-c574-11f0-92f5-0fd46a9dc2cf.png"
      ],
      "datePublished": "2025-11-19T22:42:44.000Z",
      "dateModified": "2025-11-19T22:42:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
    "url": "https://www.bbc.com/news/articles/c4gwgdyl52lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-19T18:14:52.000Z",
    "description": "7 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow ",
    "body": "7 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow Andy Burnham to challenge Sir Keir Starmer for the Labour leadership.There has been ongoing speculation that Greater Manchester Mayor Burnham wants to take on Sir Keir for the top job, but he would need to be an MP to do so.Lewis told the BBC's Politics Live that he was willing to step down from his Norwich South seat to allow Burnham to return to the Commons and put \"country before party, party before personal ambition\".Burnham was contacted for comment. Number 10 declined to comment.Lewis, who has been an MP for 10 years, said he had spoken to Burnham, and when asked if he would give up his seat for him, he said it was \"a question I've asked myself\".He added: \"Do you know what? If I'm going to sit here and say country before party, party before personal ambition, then yes, I have to say yes, don't I.\"Last week, he said Sir Keir's position as prime minister was \"untenable\" and told Channel 4 News that Burnham should be given the chance to \"step up\".Later, the Sun's political editor Kate Ferguson said that Lewis had told her he had \"no plans to stand down\".She reported on X that he said: \"A hypothetical question was put to me, and my answer was consistent with what I've been saying, that I am serious about putting country before party.\"Lewis first won his seat in 2015, and last year he increased his majority to more than 13,000.But if he were to step down, any would-be successor would first need to win a selection contest before a by-election was held.Health Secretary Wes Streeting - who last week denied claims he was plotting a leadership bid of his own - told LBC he thought it was a \"peculiar\" move by the Norwich South MP. \"I've got a lot of time for Andy and I think we need our best players on the pitch,\" Streeting said. \"And whether he's doing that as mayor of Greater Manchester or whether he wants to come back into parliament in the next general election, that is an issue for Andy.\"I think it's a bit of a peculiar thing for Clive to have said to his own constituents, 'Oh, well, I'm not interested in being your MP, I'm happy to do a deal with someone'. \"I would just say from personal experience, don't take your voters for granted.\"In September, Burnham said he had \"no intention of abandoning Manchester\" but did not rule out challenging Sir Keir after a series of interviews in which he said colleagues had been urging him to stand.Two Manchester Labour MPs, Andrew Gwynne and Graham Stringer, ruled out standing down for him ahead of the party's conference in September.Sir Keir has, meanwhile, said he will lead Labour into the next general election. It came after a bruising time last week, when anonymous briefings were given to journalists that some cabinet ministers - including Streeting - were plotting to oust him.The ministers concerned have insisted this is not the case - but speculation continues about whether the PM will face a challenge in May, when Labour is expected to do badly in Scottish and Welsh elections, and in English local elections. Anyone mounting a leadership bid would have to secure the backing of 80 Labour MPs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-19T18:14:52.000Z",
      "dateModified": "2025-11-19T18:14:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ultra-processed food is global health threat, experts warn",
    "url": "https://www.bbc.com/news/articles/cy4pjjzd784o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a0dc/live/7ab81ae0-c565-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-19T12:53:04.000Z",
    "description": "12 hours agoPhilippa RoxbyHealth reporterAction is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to healt",
    "body": "12 hours agoPhilippa RoxbyHealth reporterAction is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to health, say international experts in a global review of research.They say the way we eat is changing - with a move away from fresh, whole foods to cheap, highly-processed meals - which is increasing our risk of a range of chronic diseases, including obesity and depression.Writing in The Lancet, the researchers say governments need \"to step up\" and introduce warnings and higher taxes on UPF products, to help fund access to more nutritious foods.However some scientists say this review can not prove that UPFs directly cause health harms and more research and trials are needed to show that.Ultra-processed foods are defined as containing more than five ingredients you would not find at home in your kitchen cupboard, such as emulsifiers, preservatives, additives, dyes and sweeteners. Examples of UPFs include sausages, crisps, pastries, biscuits, instant soups, fizzy drinks, ice cream and supermarket bread. Surveys indicate these industrially-manufactured foods are on the rise in diets around the world, worsening the quality of what we eat with too much sugar and unhealthy fats and a lack of fibre and protein.This review of evidence on the impact of UPFs on health, carried out by 43 global experts and based on 104 long-term studies, suggests these foods are linked to a greater risk of 12 health conditions.These include type 2 diabetes, cardiovascular disease, kidney disease, depression and dying prematurely from any cause.Review author Prof Carlos Monteiro, from the University of Sao Paulo in Brazil, who set up the Nova classification system for categorising food, said the growing consumption of ultra-processed foods \"is reshaping diets worldwide, displacing fresh and minimally processed foods and meals\".\"This change in what people eat is fuelled by powerful global corporations who generate huge profits by prioritising ultra-processed products, supported by extensive marketing and political lobbying to stop effective public health policies to support healthy eating,\" he added.Co-author Dr Phillip Baker, from the University of Sydney, said the answer was \"a strong global public health response - like the coordinated efforts to challenge the tobacco industry\".The review acknowledges a lack of clinical trials showing exactly how UPFs damage health - but says that should not delay action to protect people worldwide from potential health harms.Some scientists have commented that it is difficult to untangle the effects of UPFs in people's diets from other factors in people's lives, such as lifestyle, behaviour and wealth.Critics of the Nova classification system say it relies too much on the level of processing in foods, and not on how nutritious that particular food is. For example, wholegrain bread, breakfast cereals, low-fat yoghurts, baby formula milk and fish fingers all count as ultra-processed but have lots of good in them.Prof Kevin McConway, emeritus professor of applied statistics at the Open University, said: \"A study like this can find a correlation, but it can't be certain about cause and effect.\"He said there was still \"room for doubt and for clarification from further research\".\"It seems to me likely that at least some UPFs could cause increases in the risk of some chronic diseases. But this certainly doesn't establish that all UPFs increase disease risk.\"It is still not clear what it is about ultra-processed foods that could be causing or contributing to diseases.Prof Jules Griffin, from the University of Aberdeen, said there were some positive sides to food processing, and more research to understand how it influences our health was \"urgently needed\".The Food and Drink Federation (FDF), which represents the industry, says UPFs can form part of a balanced diet, like frozen peas and wholemeal bread.\"Companies have been making a series of changes over many years to make the food and drink we all buy healthier, in line with government guidelines,\" says Kate Halliwell, chief scientific officer at the FDF.The amount of sugar and salt in products on sale in shops and supermarkets has gone down by a third since 2015, she added.The UK's Scientific Advisory Committee on Nutrition said earlier this year that the association between higher consumpton of ultra-processed foods and adverse health outcomes was \"concerning\".But it added it was \"unclear\" whether these foods are unhealthy due to processing or because many of them are high in calories, saturated fat, salt and free sugars.Current UK government advice on diet is to eat more fruit, vegetables and fibre, and cut back on sugar, fat and salt.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ultra-processed food is global health threat, experts warn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a0dc/live/7ab81ae0-c565-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-19T12:53:04.000Z",
      "dateModified": "2025-11-19T12:53:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nvidia shares jump after revenue and outlook beat estimates",
    "url": "https://www.bbc.com/news/articles/cly4y2enywro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/41f7/live/3a2f01c0-c59a-11f0-9f17-09a8a6d5ef10.jpg",
    "tag": "Trending",
    "date": "2025-11-20T00:21:50.000Z",
    "description": "39 minutes agoDanielle KayeBusiness reporterReutersChief executive Jensen Huang said sales for some of Nvidia's AI components were \"off the charts\"Chi",
    "body": "39 minutes agoDanielle KayeBusiness reporterReutersChief executive Jensen Huang said sales for some of Nvidia's AI components were \"off the charts\"Chip giant Nvidia beat Wall Street's expectations for revenue and upcoming sales, easing investor concerns about heavy artificial intelligence (AI) spending that have unsettled markets.In its quarterly earnings report on Wednesday, the firm said revenue for the three months to October jumped 62% to $57bn, driven by demand for its chips used in AI data centres. Sales from that division rose 66% to more than $51bn.Fourth-quarter sales forecasts in the range of $65bn also topped estimates, sending shares in Nvidia about 4% higher in after-hours trading.Nvidia, the world's most valuable company, is seen as a bellwether for the AI boom. The chip-maker's results could inform market sentiment.Chief executive Jensen Huang said in a statement that sales of its AI Blackwell systems were \"off the charts\" and that \"cloud GPUs [graphics processing units] are sold out\".\"There's been a lot of talk about an AI bubble. From our vantage point, we see something very different,\" he said, on a call with analysts.\"We excel at every phase of AI.\"The chip-maker's quarterly report garnered even more attention than usual on Wall Street amid mounting concern that AI stocks are overvalued - fears that may persist despite Nvidia's blockbuster results.Those fears had fueled four consecutive daily drops in the S&P 500 index leading up to Wednesday, as questions swirl about returns on AI investments. The benchmark index has fallen nearly 3% so far in November.The bar was high heading into Nvidia's results.Adam Turnquist, chief technical strategist for LPL Financial, said the question was not whether the company would beat expectations, \"but by how much\".\"While AI valuations are dominating the news feeds, Nvidia is going about its business in style,\" said Matt Britzman, senior equity analyst at Hargreaves Lansdown.He said valuations for certain areas of the AI sector \"needed to take a breather, but Nvidia is not in that camp\".Mr Huang had previously said he expected $500bn in AI chip orders through next year. Investors were looking for details about when the company expects those revenues will come to fruition, and how it plans to fulfill the orders.Colette Kress, Nvidia's chief financial officer, told analysts the company would \"probably\" be taking more orders on top of the $500bn that had already been announced.But she also expressed disappointment about regulatory limits that stymie the company's ability to export its chips to China, saying the US \"must win the support of every developer\" including those in China.She said Nvidia was \"committed to continued engagement\" with the American and Chinese governments.Earlier Wednesday at the US-Saudi Investment Forum in Washington, Mr Huang joined Elon Musk to announce a massive data centre complex in Saudi Arabia that will have Musk's AI company, xAI, as its first customer.The facility will be outfitted with hundreds of thousands of Nvidia chips.The Wall Street Journal reported the US Commerce Department has approved the sale of up to 70,000 advanced AI chips to state-backed companies in Saudi Arabia and the United Arab Emirates, reversing an earlier decision.The agreement was brokered following talks between US President Donald Trump and Saudi Arabia's Crown Prince, Mohammed bin Salman, who visited the White House this week.EPA/ShutterstockLast month Nvidia became the first company to be valued at $5tnThe titans of the technology sector are ramping up their spending on AI, as they rush to reap the benefits of a boom that has pushed stocks to record highs.Earnings reports from Meta, Alphabet and Microsoft last month reaffirmed the colossal amounts of money these firms are shelling out for everything from data centres to chips.Sundar Pichai, the head of Google's parent firm Alphabet, told the BBC that while the growth of AI investment had been an \"extraordinary moment\", there was some \"irrationality\" in the current AI boom. His comments came amid other warnings from industry leaders.Nvidia, which makes chips that are crucial for AI data centres, is at the heart of a web of deals among key players in the AI space such as OpenAI, Anthropic and xAI.The deals have drawn scrutiny for their circular nature, as AI firms increasingly invest in one another. The agreements include Nvidia's $100bn investment in OpenAI, the firm behind ChatGPT.Additional reporting by Lily Jamali, North America Technology Correspondent, San Francisco",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nvidia shares jump after revenue and outlook beat estimates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/41f7/live/3a2f01c0-c59a-11f0-9f17-09a8a6d5ef10.jpg"
      ],
      "datePublished": "2025-11-20T00:21:50.000Z",
      "dateModified": "2025-11-20T00:21:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian spy ship pointed lasers at RAF pilots tracking it, says UK",
    "url": "https://www.bbc.com/news/articles/cx24028k7edo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b8db/live/07e5c580-c55b-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-19T19:07:00.000Z",
    "description": "6 hours agoBrian Wheeler,Political reporter and Paul Seddon,Political reporter'We see you': Defence secretary's message to PutinA Russian spy ship has",
    "body": "6 hours agoBrian Wheeler,Political reporter and Paul Seddon,Political reporter'We see you': Defence secretary's message to PutinA Russian spy ship has used lasers for the first time to disrupt RAF pilots tracking its activity near UK waters, the defence secretary has said.John Healey told reporters the \"deeply dangerous\" move from the Yantar was being taken \"extremely seriously\" by the government.He added that the vessel was north of Scotland and had entered UK waters for the second time this year during the last few weeks.The UK would continue monitoring the ship and had \"military options ready should the Yantar change course,\" he added.\"My message to Russia and to Putin is this: we see you. We know what you're doing. And if the Yantar travels south this week, we are ready,\" he added.Healey said the laser incident took place whilst the Yantar was being followed by a Royal Navy frigate and RAF Poseidon P-8 planes deployed to \"track the vessel's every move\". It is understood the episode occurred within the last two weeks.Speaking at a news conference in Downing Street, the defence secretary added he had changed the Royal Navy's rules of engagement so that it could follow the Yantar more closely \"when it is in our wider waters\".Healey said the vessel, which entered service in 2015, was part of Russia's Main Directorate for Deep Sea Research (GUGI), which was designed to \"undertake surveillance in peacetime and sabotage in conflict\".\"We have military options ready should the Yantar change course. I am not going to reveal those because that only makes President Putin wiser,\" he said.Asked about the risks posed by lasers, Healey replied: \"Anything that impedes, disrupts or puts at risk pilots in charge of British military planes is deeply dangerous.\"BBC Verify look at reports of a Russian spy ship entering UK waters and shining lasers at RAF planeThe Russian Embassy released a statement, saying it was \"not interested in British underwater communications\".\"The actions of our country do not touch interests of the UK and they are not aimed at undermining its security,\" the statement said.It added: \"However, London, with its Russophobic path and increasing militaristic hysteria leads to further degradation European security, providing the premise for new dangerous situations. \"We call on the British side to hold off taking any destructive steps which might aggravate the crisis situation on the European continent.\"Ministry of DefenceThe Ministry of Defence released new photos on Wednesday of the Royal Navy tracking the Yantar Labour MP Matt Western, who chairs the Joint Committee on the National Security Strategy, said: \"Today's news demonstrates once again that Russia presents a genuine and immediate threat to the UK's security.\"He added: \"I welcome the seriousness with which the defence secretary is treating this issue, but there is more we can do. More assertive retaliation may be required.\"The defence secretary previously issued a warning about the Yantar after it was spotted in UK waters in January, calling it \"another example of growing Russian aggression\".According to the ship tracking website Marine Traffic, the ship has not broadcast its location since 2 November, and was last tracked in the Baltic Sea north of the Latvian Coast.On 6 November, the Dutch Navy said two of its vessels escorted the Yantar out of the North Sea, where it was operating near Dutch territorial waters.While the Yantar's current position is not clear, flight tracking website FlightRadar24 shows an RAF Poseidon P-8 surveillance plane circling off the Scottish coast, although it is not certain that this is tracking the Yantar.Russia describes Yantar, which is operated by the country's Ministry of Defence, as an oceanic research vessel. Western nations have often tracked it in European waters and they suspect part of its mission has been to map undersea cables.Elisabeth Braw, a senior fellow at the Atlantic Council, an American security think tank, said the Yantar's use of lasers was \"an escalation for sure\".\"Essentially, you do it to impede the pilots from doing their work,\" she told BBC Radio 4's World At One.\"We don't know exactly how strong the lasers were, but even if they didn't blind the pilots, it was provocative,\" she added.The UK and its Nato allies are concerned about the risk Russia poses to offshore cables, pipelines and other infrastructure critical to internet connectivity.In his speech, the defence secretary warned about Russian incursions into Nato airspace, as well as the threats posed by China and armed conflicts around the world, adding: \"Our world is changing. It is less predictable. It is more dangerous.\"Meanwhile, the Ministry of Defence has come under criticism from a committee of MPs for being over-reliant on US defence resources and not being prepared to defend the UK and its overseas territories from military attack.The committee said the UK and its European allies should be building up their capabilities to prepare for potential US withdrawal.Healey said the UK government \"takes a different view\" to the committee about America's commitment to Nato.But he said the committee was \"right to say\" Britain should \"pick up the pace of our commitment\" and that was something Labour has been doing since it came to power last year.Defence talks ongoingThe report comes as British negotiators race to agree a deal with the EU to enable British defence companies to contribute to projects funded by a new €150bn (£130bn) EU defence loan scheme set to launch next year.The Labour government wants to conclude a deal in the coming weeks to allow British companies to take part in the first round of bids from EU countries, with applications due by the end of this month.Healey told reporters the UK wanted to be part of the programme, but not \"at any price\", amid reports the two sides are at odds over the entry fee the UK could pay to enable British firms to take part.It has been reported that the EU is demanding an entry fee running to billions of euros before the UK can take part.He added that any financial contribution to take part would have to be \"good value for money for our taxpayers and our industry\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian spy ship pointed lasers at RAF pilots tracking it, says UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b8db/live/07e5c580-c55b-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-19T19:07:00.000Z",
      "dateModified": "2025-11-19T19:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: Amber warning for snow as freezing cold snap continues",
    "url": "https://www.bbc.com/news/articles/c3dndex9d2po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8e33/live/84ff7550-c55d-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-19T22:09:00.000Z",
    "description": "3 hours agoAlex Kleiderman and BBC WeatherPA MediaA snow plough drives through snow in Carrbridge in the Scottish Highlands on WednesdayWintry weather",
    "body": "3 hours agoAlex Kleiderman and BBC WeatherPA MediaA snow plough drives through snow in Carrbridge in the Scottish Highlands on WednesdayWintry weather is set to continue across the UK on Thursday - with temperatures forecast to fall below zero overnight, and snow and ice affecting some areas.Met Office yellow warnings are in place for Northern Ireland, northern and central Scotland, and coastal areas in south-west Wales, and south-west, east and north-east England.A more severe amber warning is due to come into force later in the North York Moors and parts of the Yorkshire Wolds, where as much as 15-25cm (6-10ins) of snow could fall on higher ground.The UK Health Security Agency (UKHSA) has also issued cold-health alerts for England until Saturday, saying there could be \"significant\" impacts to the elderly and people with health conditions.  Areas from London to Shetland saw snow on Wednesday.There were  dozens of school closures in north-east Scotland and the Highlands and road closures including on the Woodhead Pass between Hollingworth and Flouch in Derbyshire and the B4391 between Rhyd y Sarn and Pen y Bryn in north-west  Wales.Temperatures on Wednesday night could fall to as low as -5C (23F) in Scotland and northern England, and -3C (26.6F) in other parts of England and east Wales.With a frost expected, areas where showers or rain and sleet have left the ground damp are at risk of ice becoming a hazard on roads and pavements. Forecasters warn that buses and trains may be cancelled or delayed.But the conditions are unlikely to resemble the snowy and icy spell this time last year which closed hundreds of schools and saw 12cm of snow in Nottingham.Over recent decades the Met Office have observed a decrease in the frequency, duration, and intensity of cold spells, clearly linked to climate change. According to the latest State of the Climate Report, external, air and ground frosts have reduced by around a quarter since the 1980s.Yellow warnings There are yellow warnings for snow and ice on Thursday in: Cornwall and parts of Devon, and  Carmarthenshire, Ceredigion, Pembrokeshire and Swansea until 23:59 GMT North East England, SW Scotland and Lothian Borders, Yorks & Humber until 23:59 GMTCentral and northern Scotland until 21:00 GMTNorfolk, Suffolk,  Cambridgeshire and Lincolnshire until 11:00 GMTNorthern Ireland until 12:00 GMT'Thundersnow'PA MediaThe village of Leadgate in County Durham woke up to snow on Wednesday morningThursday's amber warning for North Yorkshire is in place from 03:00 to 2100 GMT. Forecasters say snow is expected throughout the day, mostly on hills above 100m elevation and could lead to \"substantial disruption\".They say it is possible some areas, including the North York Moors and the Highlands of Scotland,  could see what is known as thundersnow.It is is a phenomenon which happens when thunderstorms form in wintry weather and give rise to heavy falls of snow rather than rain.Meanwhile, in Wales, the snow warning is linked to what forecasters dub the \"Pembrokeshire Dangler\". This is a line of showers that develop over the warmer waters of the Irish Sea and are pushed southwards over the county of Pembrokeshire in south-west Wales.The Met Office amber warning issued for snow on Thursday affects the North Yorks MoorsDaytime temperatures in most areas of the UK on Thursday will reach between 4C and 6C.Temperatures are expected to become milder by the weekend, rising to average levels by Saturday.Amber cold-health alerts have been issued in England by the UKHSA until 08:00 GMT on Saturday for the North West, North East, and Yorkshire and Humber, with all other areas under less-severe yellow alerts.The alerts are mainly for health and social care services, warning of \"significant\" impacts to more vulnerable members of the community.Extra demands may be put on services to deal with colder weather.BBC Weather Presenter Stav Danaos with the UK forecast",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: Amber warning for snow as freezing cold snap continues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8e33/live/84ff7550-c55d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-19T22:09:00.000Z",
      "dateModified": "2025-11-19T22:09:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reform MS Laura Anne Jones suspended from Senedd over racial slur",
    "url": "https://www.bbc.com/news/articles/crregkj885do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3bfc/live/1b27b380-c4a5-11f0-b1f8-8b57d1c9aaed.jpg",
    "tag": "Trending",
    "date": "2025-11-19T21:11:51.000Z",
    "description": "4 hours agoAdrian BrowneWales political reporterReform's only Welsh Parliament member has been banned from the Senedd chamber for 14 days after using ",
    "body": "4 hours agoAdrian BrowneWales political reporterReform's only Welsh Parliament member has been banned from the Senedd chamber for 14 days after using a racial slur to describe Chinese people.Laura Anne Jones apologised for breaking the parliament's code of conduct over her behaviour, including the offensive comments made in a WhatsApp chat in August 2023.In an emotional statement in the Senedd, she said investigations by police and Senedd standards commissioner, which cleared her of making fraudulent expenses claims, had a hugely detrimental effect on her mental health.The suspension, imposed by fellow Senedd members, stops her taking part in proceedings for two weeks and docks her pay.Senedd standards commissioner Douglas Bain found that Jones had both made offensive comments on WhatsApp and not taken action when one of her staff members had made separate offensive comments on the same messaging service.On Wednesday evening, standards committee chair, Labour's Hannah Blythyn, told the Senedd: \"The committee considers a breach of the code of conduct by any member of the Senedd a serious matter, and we are clear that inappropriate and offensive comments have no place in our Senedd or society.\"More widely, the conduct found in the commissioner's report fell far below the standards expected, and points to an office culture where there was little respect towards others or any consideration of what may be found offensive.\" Jones apologised for the WhatsApp exchanges, but said she had faced the expenses allegations she was cleared on for nearly two years.They \"had a negative impact on my family, especially my children, as well as a hugely detrimental impact on my own health and mental health,\" she said.She said the allegations had \"taken a significant toll on me, which led me to try and drown out that noise and nearly take my own life a number of times\".\"Hasten to say, I wouldn't wish what I've had to experience on my worst enemy,\" she added.Jones will be able to take her seat in the Senedd once more from Wednesday 3 December.Jones represents South Wales East in Wales' parliament, and was a Conservative member at the time of the allegations before defecting to Reform in July and giving the party a seat in Cardiff Bay for the first time.If you have been affected by the issues raised in this story, help and support is available via the BBC Action Line",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reform MS Laura Anne Jones suspended from Senedd over racial slur",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3bfc/live/1b27b380-c4a5-11f0-b1f8-8b57d1c9aaed.jpg"
      ],
      "datePublished": "2025-11-19T21:11:51.000Z",
      "dateModified": "2025-11-19T21:11:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
    "url": "https://www.bbc.com/news/articles/cz919xyx7weo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:31:45.000Z",
    "description": "8 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shu",
    "body": "8 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shut down ahead of the country's social media ban for under-16s.Meta, which owns the three brands, said it had begun notifying users it believes to be between 13 and 15 years old by text, email and in-app messages that their accounts would start being deactivated from 4 December.The ban in Australia comes into force on 10 December. It affects a number of platforms which also include TikTok, YouTube, X and Reddit.Prime Minister Anthony Albanese said the \"world-leading\" ban was aimed at \"letting kids be kids\". Meta and other firms oppose the measure but said they would comply. Australia's internet regulator has estimated there are 150,000 Facebook users and 350,000 teens on Instagram in the 13-15 age bracket.From 4 December, children aged below 16 will not be able to create accounts on Meta's social media platforms. The company said it was asking young users to update their contact details so they could be notified when they became eligible to open an account. They can download and save their posts, videos and messages before their accounts are shut down.Meta said that teens who said they were old enough to use Instagram, Facebook and Threads could challenge the restriction by taking a \"video selfie\" to be used in facial age scans.They could also provide a driver's licence or other government issued-ID.All these verification methods were tested by the UK-based Age Check Certification Scheme (ACCS) earlier this year, in a report commissioned by the Australian state.While the ACCS said that all methods had their merits, it added: \"We did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments.\"Social media platforms which fail to take \"reasonable steps\" to block under-16s face fines of up to A$50m (£25m). \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" Antigone Davis, vice-president and global head of safety at Meta, told Reuters Financial.Meta wants to see a law where under-16s have to get parental approval before they download a social media app. The firm told Australia's Seven News: \"Teens are resourceful, and may attempt to circumvent age assurance measures to access restricted services.\"But it said: \"We're committed to meeting our compliance obligations and are taking the necessary steps to comply with the law.\"Australia's e-Safety Commissioner, Julie Inman Grant, said the ban was aimed at proctecting teens \"from pressures and risks they can be exposed to while logged in to social media accounts\".In a move seemingly to avoid being included in the ban, gaming platform Roblox this week announced that children under 16 would be unable to chat to adult strangers.Mandatory age checks will be introduced for accounts using chat features, starting in December for Australia, New Zealand and the Netherlands, then the rest of the globe from January.The e-safety commissioner has published a list of which social media platforms will be impacted by the age ban.They are: FacebookInstagramKickRedditSnapchatThreadsTikTokX (formerly Twitter)YouTubePlatforms not included are:DiscordGitHubGoogle ClassroomLEGO PlayMessengerRobloxSteam and Steam ChatWhatsAppYouTube Kids",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg"
      ],
      "datePublished": "2025-11-19T17:31:45.000Z",
      "dateModified": "2025-11-19T17:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]