[
  {
    "title": "Oscars 2026: How to watch this year's awards-tipped films from Hamnet to Marty Supreme.",
    "url": "https://www.bbc.com/news/articles/c79vyvyp7d8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e8da/live/3726d5f0-c60a-11f0-bac6-252b1f2b7e52.jpg",
    "tag": "Trending",
    "date": "2026-01-11T22:58:05.000Z",
    "description": "How to watch the Golden Globe-nominated films6 hours agoSteven McIntoshEntertainment reporterGetty ImagesJennifer Lawrence and Robert Pattinson star i",
    "body": "How to watch the Golden Globe-nominated films6 hours agoSteven McIntoshEntertainment reporterGetty ImagesJennifer Lawrence and Robert Pattinson star in Lynne Ramsay's psychological drama Die My LoveHollywood stars are preparing to attend one ceremony after another, as the film awards season gets fully under way. Marty Supreme, Hamnet and Wicked: For Good are a few of the frontrunners in what is shaping up to be a competitive year for the Oscars race.The Golden Globe nominations were announced on Monday 8 December, effectively firing the starting gun on awards season.The competition continues with the Bafta Film Awards and the recently renamed Actor Awards (formerly SAG), before the season concludes with the Oscars on 15 March.Here are 27 of the Golden Globe-nominated films, and how you can watch them. After The HuntSony Pictures ClassicsA promising college student accuses one of her professors of rape, leaving another teacher caught in the middle. A psychological thriller starring Julia Roberts, Ayo Edebiri and Andrew Garfield, and directed by Luca Guadagnino.On Amazon Prime Video now.Read more: Julia Roberts: We're losing the art of conversationAvatar: Fire and Ash20th Century StudiosBlue MoonSony Pictures ClassicsEthan Hawke stars as lyricist Lorenz Hart, who battles alcoholism and mental health issues ahead of the premiere of the musical Oklahoma!, in one of two films in this year's awards race directed by Richard Linklater.In UK cinemas now.BugoniaUniversalTwo young conspiracy theorists kidnap and hold captive the CEO of a giant pharmaceutical company, who they believe is an alien. Director Yorgos Lanthimos reunites with actors Jesse Plemons and Emma Stone.Available to rent digitally.Read more: Emma Stone dazzles Venice with alien kidnap dramaDie My LoveMubiA young couple move to a secluded country house and have a baby, but the mother's mental health suffers under the pressure of domestic life. Jennifer Lawrence and Robert Pattinson star in Lynne Ramsay's movie.In UK cinemas now and on Mubi from 23 January.F1Warner BrosSeveral technical nominations are likely for this film about a former racing driver who returns to the track 30 years after an accident nearly ended his career. Starring Brad Pitt and directed by Joseph Kosinski.On Apple TV+ from 12 December.Read more: Brad Pitt hails Silverstone as F1 hits cinemasFrankensteinNetflixA mad scientist brings a creature to life from dead body parts, only to be repulsed by his creation and abandon it. Guillermo del Toro directs a new adaptation of Mary Shelley's 1818 novel, starring Oscar Isaac and Jacob Elordi.On Netflix now.Frankenstein is monster success at Venice film festivalUniversalIf I Had Legs I'd Kick YouA24Rose Byrne stars as a mother trying to navigate her daughter's illness, her absent husband, a missing person, and hostile relationship with her therapist. Directed by Mary Bronstein.In UK cinemas 20 February 2026.It Was Just An AccidentLes Films PelleasA man recognises the former Iranian intelligence officer who tortured him in prison after a chance encounter at a garage, leading him to take drastic measures to get his revenge. Directed by Jafar Panahi, the film won the top prize at the Cannes Film Festival.In UK cinemas now.Read more: Jafar Panahi given jail sentence while on trip to collect US awardsJay KellyNetflixA popular actor in his 60s grapples with the family life he missed out on because of his career. He downs tools and heads to Europe to spend time with his daughters. Starring George Clooney and Adam Sandler, directed by Noah Baumbach.On Netflix now.Read more: George Clooney film praised as 'midlife crisis masterpiece'Kpop Demon HuntersNetflixMarty SupremeGetty ImagesNo Other ChoiceCJ EntertainmentAfter years of unemployment, a South Korean man comes up with a dark plan to secure a job, eliminating his competition. Directed by Park Chan-wook.In UK cinemas from 23 January 2026.Nouvelle VagueARP ProductionsIn 1959, production begins on Breathless, one of the most famous feature films of the Nouvelle Vague era of French cinema. Directed by Richard Linklater and starring Zoey Deutch.In UK cinemas from 30 January 2026.One Battle After AnotherWarner BrosA father reconnects with his former group of revolutionaries following the kidnap of his daughter. Directed by Paul Thomas Anderson and starring Leonardo DiCaprio and Chase Infiniti.Available for digital rental now.Watch: What Leonardo DiCaprio loves about cinemaThe Secret AgentVictor JucaA technology expert on the run from Brazil's military dictatorship in 1977 seeks refuge in his hometown of Recife - but hired hitmen are hot on his tail. Starring Wagner Moura and directed by Kleber Mendonça Filho.In UK cinemas 20 February 2026.Sentimental ValueMubiFollowing the death of their mother, two sisters reconnect with their distant father, a famous Swedish director who is working on his comeback film. Directed by Joachim Trier and starring Renate Reinsve, Stellan Skarsgård and Elle Fanning.In UK cinemas now.SinnersWarner BrosThe Smashing MachineA24Fighter Mark Kerr makes his name in the 1990s heydey of the Ultimate Fighting Championships (UFC), amid a strained relationship with his partner Dawn Staples. Directed by Bennie Safdie, starring Dwayne Johnson and Emily Blunt.In UK cinemas now.Read more: Dwayne Johnson says he was 'pigeon-holed' as blockbuster starSong Sung BlueFocus FeaturesTwo performers who impersonate famous musicians form a Neil Diamond tribute band and fall in love, but a devastating accident threatens their relationship and dreams. Directed by Craig Brewer, starring Hugh Jackman and Kate Hudson.In UK cinemas now.Springsteen: Deliver Me From Nowhere20th Century StudiosA young Bruce Springsteen shelves the probable hits he's written in favour of the more stripped-back and introverted songs that will become his 1982 album Nebraska. Directed by Scott Cooper and starring Jeremy Allen White and Jeremy StrongAvailable to rent digitally.Read more: Jeremy Allen White sings as Springsteen in film trailerTrain DreamsNetflixAn American railroad worker lives a life of loneliness until he marries and has a daughter, but tragedy soon strikes on one of his long trips away from home. Directed by Clint Bentley and starring Joel Edgerton and Felicity Jones.On Netflix now.The Testament of Ann LeeSearchlightA young woman becomes the founding leader of the Shaker movement, who worship through song and dance and aim to create a utopian society. Directed by Mona Fastvold and starring Amanda Seyfried.In UK cinemas from 20 February 2026.The Voice of Hind RajabAltitudeRed Cross volunteers working in a call centre try to help a six-year-old girl who has phoned them while trapped in a car under fire in Gaza. Directed by Kaouther Ben Hania and starring Motaz Malhees and Saja Kilani.In UK cinemas from 16 January 2026.Read more: Film about Gaza child's killing gets record ovation at VeniceWeaponsWarner BrosWhen all but one child from the same class mysteriously vanish on the same night, a community is left questioning who or what is behind their disappearance. Directed by Zach Cregger and starring Josh Brolin, Julia Garner and Amy Madigan.Available for digital rental now.Wicked: For GoodUniversal",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscars 2026: How to watch this year's awards-tipped films from Hamnet to Marty Supreme.",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e8da/live/3726d5f0-c60a-11f0-bac6-252b1f2b7e52.jpg"
      ],
      "datePublished": "2026-01-11T22:58:05.000Z",
      "dateModified": "2026-01-11T22:58:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt27hj?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:05:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search Sounds              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu   BBC SoundsSounds home pageHomeMusicPodcastsMy SoundsUse BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·09 Jan 2026,·24 minsThe President’s Path: After Venezuela, what next for Trump?The ExplanationAvailable for over a yearTrump's actions in Venezuela and the removal of Nicolás Maduro sparks talk of further US operations in the region. In this episode Caitríona Perry, Sumi Somaskanda and Bernd Debusmann look at the US operation that seized the President of Venezuela.\nEvery weekend, The President’s Path explores the state of US politics in Washington and beyond. We dig into the key issues shaping America and uncover what is on the minds of those closest to power. You can contact us at: path@bbc.co.uk\nSenior Producer: Oksana Kundirenko \nExecutive Producer: Anna HolfordProgramme WebsiteMore episodesCymraegGaeilgeGàidhligBBC Sounds HelpContacts, Privacy and InformationHelp with Signing InNewsletter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg"
      ],
      "datePublished": "2026-01-09T13:05:00.000Z",
      "dateModified": "2026-01-09T13:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt4qyc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-09T16:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Jan 2026,·37 minsThe Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran?NewscastAvailable for over a yearToday marks the thirteenth consecutive day of widespread anti-government protests in Iran.\nIran's top security body has warned that the Iranian judiciary and security forces will show \"no leniency towards saboteurs\", amid internet blackouts.\nAdam is joined in the Newscast studio by BBC chief international correspondent, Lyse Doucet, to discuss the context and history of the unrest in Iran, plus President Trump’s warnings to Ayatollah Ali Khamenei and his response. \nAlso in the studio is New Statesman political editor Ailbhe Rea and The House Mag deputy editor Sienna Rodgers, to wrap up the first calendar week of UK Politics.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Chloe Scannapieco and Jem Westgate. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-09T16:41:00.000Z",
      "dateModified": "2026-01-09T16:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK can legally stop shadow fleet tankers, ministers believe",
    "url": "https://www.bbc.com/news/articles/cy8pn7jgy3no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd23/live/f8eccb40-ef22-11f0-b1a3-cfac234d0717.jpg",
    "tag": "Trending",
    "date": "2026-01-11T22:00:33.000Z",
    "description": "7 hours agoJack FenwickPolitical correspondentReutersThe government has identified a legal basis which it believes can be used to allow UK military to",
    "body": "7 hours agoJack FenwickPolitical correspondentReutersThe government has identified a legal basis which it believes can be used to allow UK military to board and detain vessels in so-called shadow fleets, BBC News understands.Russia, Iran and Venezuela have all been accused of operating ships without a valid national flag to avoid sanctions on oil.Last week British armed forces assisted US troops in seizing the Marinera oil tanker, which American officials accused of carrying oil for Venezuela, Russia and Iran, breaking US sanctions.To date, no UK military personnel have boarded any vessels, but officials have spent the last few weeks exploring what measures could be used.The Sanctions and Money Laundering Act from 2018 can be used to approve the use of military force, ministers believe.It is understood there are plans for the armed forces to use these powers, in what is being described inside government as a ramping up of action against the ships. It is not known exactly when the first UK military action might occur.Two oil tankers subject to US sanctions were reportedly spotted sailing east through the English Channel towards Russia on Thursday.The UK has already imposed sanctions on more than 500 alleged shadow vessels, which it believes are helping to fund hostile activity, including Russia's invasion of Ukraine.Ministers say that action taken by the UK and its allies has forced around 200 ships off the seas, most of which will have been operating without a legitimate flag.Ship flagging is the process used to register a vessel to a specific country, which then allows it to travel in international waters and offers it certain protections under law.The government believes the new legal mechanism they have identified could be applied to any sanctioned vessels not legitimately flagged.Officials say this would have included the Marinera tanker, which was seized last week.The Marinera, a Venezuelan-linked ship previously known as the Bella 1, was stopped by the US Coast Guard as it travelled through the North Atlantic ocean between Iceland and Scotland.The Ministry of Defence said the US asked the UK for assistance, and that RAF surveillance aircraft and a Royal Navy support ship RFA Tideforce took part in the operation.Defence Secretary John Healey said the action was \"in full compliance with international law\", adding the UK \"will not stand by as malign activity increases on the high seas\".Healey told MPs on Wednesday that the government was \"stepping up action on the shadow fleet, developing further military options and strengthening co-ordination with allies\".It is understood that identifying this legal mechanism was one of the further military options that Healey was referring to.The US has increased action against shadow fleet vessels, with five tankers seized in recent weeks.A Ministry of Defence spokesperson said: \"The defence secretary set out in parliament this week that deterring, disrupting and degrading the Russian shadow fleet is a priority for this government\".They added: \"We will not comment on specific operational planning\".Transport Secretary Heidi Alexander said on Sunday that the number of insurance checks were being increased, with more than 600 ships stopped while sailing close to the British Isles.Vessels not legitimately flagged generally have no insurance, which experts have warned could lead to a crisis if they were involved in an incident like an expensive oil spill.But Alexander said it would not be appropriate to say how many alleged shadow vessels were known to have sailed in UK waters.She told Sky News: \"Providing you with that information only helps one person and that is President Putin.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK can legally stop shadow fleet tankers, ministers believe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd23/live/f8eccb40-ef22-11f0-b1a3-cfac234d0717.jpg"
      ],
      "datePublished": "2026-01-11T22:00:33.000Z",
      "dateModified": "2026-01-11T22:00:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EastEnders actor Derek Martin dies aged 92",
    "url": "https://www.bbc.com/news/articles/cr578n5egm9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e453/live/50c62540-ef15-11f0-8189-e99395d44bc9.jpg",
    "tag": "Trending",
    "date": "2026-01-11T17:55:51.000Z",
    "description": "11 hours agoZahra FatimaBBCDerek Martin, the actor best known for playing Charlie Slater in EastEnders, has died aged 92.Martin first appeared on the ",
    "body": "11 hours agoZahra FatimaBBCDerek Martin, the actor best known for playing Charlie Slater in EastEnders, has died aged 92.Martin first appeared on the BBC soap's fictional Albert Square in 2000 as widower Slater, along with his four daughters Lynne, Kat, Little Mo and Zoe.A regular cast member until 2011, he featured in a number of major storylines. Martin then made several guest appearances on the programme until his character suffered a fatal heart attack in 2016.In a statement shared on Sunday by his agent Sharon Henry, Martin's family described him as a father and friend who \"supported us through our highs and lows\", adding they would \"miss him terribly\".The statement said Martin - born in the East End of London himself, in Bow - had died on Saturday. \"For over 50 years, Derek was a truly authentic working-class voice in British television and film,\" it went on.Meanwhile, his agent said it was \"a privilege to be a part of his creative journey\" - and said he had \"cherished his time portraying Charlie Slater\".\"Derek was a devoted father, a generous member of the charitable Water Rats, an avid golfer and all-around good man who will be greatly missed,\" Henry added.Martin began acting in the 1960s, having previously worked in factories and as a butcher at Smithfield Market in the City of London.Despite having no professional training, he went on to appear in programmes such as Doctor Who,  Z-Cars, The Sweeney, Eldorado,  Law & Order and Hart to Hart, before landing the role of Charlie Slater.Martin, in character as Slater, stands beside Jessie Wallace, in character as his on-screen daughter Kat (file photo)An EastEnders spokesperson said the programme's team was \"deeply saddened\" to hear of Martin's death. \"From the moment he arrived, Derek's portrayal of Charlie Slater instantly cemented him in the hearts of the audience, as the head of one of EastEnders' most iconic families,\" they went on.\"Charlie would do anything for his family, and much like his character, Derek would do the same for those around him. Derek was deeply loved by all those that worked with him at EastEnders and will always be remembered with great fondness.\"Our love and thoughts are with his family and friends.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EastEnders actor Derek Martin dies aged 92",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e453/live/50c62540-ef15-11f0-8189-e99395d44bc9.jpg"
      ],
      "datePublished": "2026-01-11T17:55:51.000Z",
      "dateModified": "2026-01-11T17:55:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US figure skater whose parents were killed in plane crash heads to Olympics",
    "url": "https://www.bbc.com/news/articles/cly9nzvn71vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea50/live/e5fdb770-ef44-11f0-92aa-d1be2c3fd0fb.jpg",
    "tag": "Trending",
    "date": "2026-01-12T02:08:10.000Z",
    "description": "3 hours agoAna FaguyWashingtonGetty ImagesUS Figure skater Maxim Naumov, whose parents were killed in a commercial plane crash in Washington DC last y",
    "body": "3 hours agoAna FaguyWashingtonGetty ImagesUS Figure skater Maxim Naumov, whose parents were killed in a commercial plane crash in Washington DC last year, has made the US figure skating team heading to the Milan Olympics next month. Naumov's dream to make the US Olympic Team was one of the last things he spoke about with his parents before they were killed. \"We did it,\" Naumov said when asked what his parents would say if they were watching.His parents, Vadim Naumov and Evgenia Shishkova, were among 67 killed in January 2025 after an American Airlines flight collided with a military helicopter mid-air in Washington DC. They were world champions in pairs figure skating in 1994 and skated for Russia.They later moved to the US and coached at the Skating Club of Boston. On Saturday, Naumov, 24, placed third behind Ilia Malinin and runner-up Andrew Torgashev at the US figure skating championships in St Louis. He will now be one of 16 figure skaters representing the US in the 2026 Winter Olympics.As Naumov was competing this week, he held a photo of himself as a child with his parents. \"I thought of them immediately,\" Naumov said Sunday, according to US Figure Skating. \"I wish they could be here to experience it with me, but I do feel their presence, and they are with me.\"Last January, his parents were among those killed after an American Airlines plane from Kansas carrying 64 people onboard collided with a military helicopter, manned by three personnel. There were no survivors. Vadim Naumov and Evgenia Shishkova were on their way back from Wichita, Kansas, which was hosting the 2025 US championships. Of those on board the flight, 28 were athletes, coaches, or parents connected to US figure skating.The Olympic figure skating competition will take place beginning on 6 February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US figure skater whose parents were killed in plane crash heads to Olympics",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea50/live/e5fdb770-ef44-11f0-92aa-d1be2c3fd0fb.jpg"
      ],
      "datePublished": "2026-01-12T02:08:10.000Z",
      "dateModified": "2026-01-12T02:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four killed and five injured in head-on crash in Bolton",
    "url": "https://www.bbc.com/news/articles/c0r45k245pvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3498/live/1a330980-ef06-11f0-bff1-0379204eb6d3.jpg",
    "tag": "Trending",
    "date": "2026-01-12T01:02:13.000Z",
    "description": "4 hours agoStewart Whittingham,Rumeana Jahangir,North WestandTom Symonds,News correspondentPhil TaylorThe crash happened after midnight in BoltonThree",
    "body": "4 hours agoStewart Whittingham,Rumeana Jahangir,North WestandTom Symonds,News correspondentPhil TaylorThe crash happened after midnight in BoltonThree teenagers and a man in his 50s have been killed in a head-on collision between a car and a taxi, police say.The drivers of both cars are among those who died, while five passengers were also injured in the crash, which happened at about 00:45 on Sunday on Wigan Road, Bolton.Greater Manchester Police (GMP) said the taxi driver was in a dark Citroen, while the three teenagers - aged between 18 and 19 - were in a red Seat.The three teenagers have been named in local funeral notices as Muhammad Danyaal Asghar Ali, Farhan Patel and Mohammed Jibrael Mukhtar, all from Bolton. The taxi driver was named as Masrob Ali, from Blackburn.Police have yet to formally identify the victims but are continuing to investigate what happened. The force is asking for eyewitnesses or anyone who may have dashcam footage of the moments before and afterwards to come forward.Neelam Khan, who lives with her family nearby, told BBC North West Tonight she had seen the aftermath of the crash on the road, \"which was quite disturbing\".Debris was \"everywhere, which was quite scary\", she said.Firefighters used cutting equipment to remove people from the car with five passengers taken to hospital for treatment.GMP's Ch Insp Helen McCormick described it as a \"devastating incident\".\"This was a particularly challenging scene for colleagues in the emergency services and I want to thank the first responders.\"Phil TaylorA local councillor said the community's mood was \"sombre\" after the deathsMother-of-two Khan said other crashes had happened on the road, with drivers hitting cars parked on the sides.\"I don't understand how people don't learn from previous accidents and this is probably the worst one yet,\" she said.\"It's probably only going to get worse if nothing happens so maybe the police and council need to do something about it.\"The number of crashes meant she and her husband were considering moving to a quieter area, she added.\"This is why we park at the back of the house now because we just know there's always going to be accidents on this road.\"Phil TaylorFive passengers were also injured in the crashMcCormick said the collision was \"a tragic reminder of the importance of safety on our roads\".The number of serious and fatal collisions in Bolton had \"massively reduced...but we've all got much more to do\", she added.\"One incident is one too many and they'll do nothing to bring back the four lives lost here today.\"Councillor Ayyub Patel, who represents the local ward of Rumworth, told BBC Radio Manchester that the victims' relatives were \"devastated\". \"The community was waking up to this very sad news, they are shocked - the mood is sombre.\"Any loss of life in any family is devastating news and to wake up to such tragic news is more so than expected.\"If it's expected, you know what's coming but if it's not expected, then obviously it's a shocking experience.\"Related links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four killed and five injured in head-on crash in Bolton",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3498/live/1a330980-ef06-11f0-bff1-0379204eb6d3.jpg"
      ],
      "datePublished": "2026-01-12T01:02:13.000Z",
      "dateModified": "2026-01-12T01:02:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Protester death toll soars' and 'EU demands \"Farage clause\"'",
    "url": "https://www.bbc.com/news/articles/czr48lrr0v4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab0b/live/c58f2440-ef50-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-12T01:40:30.000Z",
    "description": "3 hours agoIran has warned the US not to attack following protests \"that have rocked the country\" as Donald Trump weights up the \"options for a respon",
    "body": "3 hours agoIran has warned the US not to attack following protests \"that have rocked the country\" as Donald Trump weights up the \"options for a response from Washington\", the Guardian reports. Trump has previously threatened to strike Iran over the killings of protesters, and on Saturday said the US stood \"ready to help\". The European Union wants to future proof its post-Brexit \"reset\" deal with Prime Minister Sir Keir Starmer as part of ongoing negotiations with the UK, the Financial Times says. The move has been dubbed the \"Farage clause\", after Reform UK leader Nigel Farage, which would see any future British government pay significant compensation if it quit the deal, the paper reports.The i Paper leads with a warning from US generals saying they are not ready to bomb Iran as Trump contemplates his next move. Iran has said it will retaliate if attacked by the US, the paper says, another reason why US commanders say \"they need more time to prepare military strikes\". Similarly, tensions are ramping up between the US and the Middle East amid the growing number of protester deaths in Iran, the Independent reports. Tehran has said it is \"ready to launch strikes against US bases in the region\", after Trump warned last week that the US would \"hit them hard\" if more protesters were killed, the paper says.The Daily Mail's lead image is of student protester Robina Aminian, 23, who was, it says, killed during \"Iran's regime brutal crackdown on dissent\". Aminian was shot in the back of the head as she left college to join one of the demonstrations, the paper says. The student had a \"thirst for freedom\", according to her uncle. The same image of Robina Aminian is used on the Daily Telegraph's front page, alongside calls for Sir Keir to proscribe Iran's Islamic Revolutionary Guard Corps as a terrorist organisation. Senior Labour figures and leading Tory and Reform UK members want the PM to \"ban Tehran's 'terror army' in a show of solidarity with the demonstrators\", the paper says.The Metro chooses to show the \"brave women\" behind the latest Iranian protests, with one woman pictured lighting a cigarette from a printed picture on fire of Iran's Supreme Leader, Ayatollah Ali Khamenei. The new uprising is believed to be more severe than during the \"Women, Life, Freedom\" uprising in 2022.The Times leads with the latest response to the West Midlands police chief's decision to ban Israeli football fans from a match between Aston Villa and Maccabi Tel Aviv in Birmingham. Senior MPs want Home Secretary Shabana Mahmood to sack the chief constable, Craig Guildford, who deemed the match \"high risk\" because of unrest at previous Maccabi matches.\"Labour's high street tax grab\" has seen more than 650 pharmacies close in England and Wales, the Daily Express reports. As business rates and employers' national insurance contributions continue to rise, Chancellor Rachel Reeves is warned more businesses will suffer, the paper says.The Lord Peter Mandelson \"Epstein scandal\" leads the Daily Mirror after the close friend of Jeffrey Epstein said \"he did not know Epstein abused minors because he 'was kept separate from the sexual side of his life'.\" Lord Mandelson spoke to the BBC for his first interview, after being sacked as the UK ambassador to the US last year because of his ties to the late paedophile and sex offender.The Daily Star showcases Trump as a football umpire holding out a red card for their story on the World Cup 2026 travel bans. Players from Manchester United and Everton could be subjected to a travel ban for the tournament after the US president strengthened his administration's powers on travel restrictions, the paper says. The Sun has chosen to lead with what they say is a \"licence fee scandal\" for the BBC. The paper reports the BBC is set to spend up to £63 million on taxis for \"employees, presenters and guests, as well as equipment\" over a five-year contract. Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Protester death toll soars' and 'EU demands \"Farage clause\"'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab0b/live/c58f2440-ef50-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-12T01:40:30.000Z",
      "dateModified": "2026-01-12T01:40:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands of tourists stranded in Lapland as cold grounds flights",
    "url": "https://www.bbc.com/news/articles/c74vnxlvl40o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8437/live/fa510aa0-ef2c-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-11T21:35:05.000Z",
    "description": "Thousands of tourists have been stranded in Finland's Lapland as a severe cold spell has grounded flights out of one of its airports.Departures from L",
    "body": "Thousands of tourists have been stranded in Finland's Lapland as a severe cold spell has grounded flights out of one of its airports.Departures from Lapland's Kittila airport that would have ferried winter travellers back to places like London, Bristol, Manchester, Paris and Amsterdam were all cancelled on Sunday as temperatures did not go above -35C on Sunday.The issue is expected to continue on Monday as a low of -39C is forecast by Finland's meteorological agency. The first flight out of Kittila has already been cancelled.The extreme cold makes it hard to de-ice planes, while maintenance and refuelling equipment on the ground can freeze.Airport operator Finavia told public broadcaster Yle that moisture in the air was making the situation worse as it was creating slippery frost.While Lapland - which spans northern Norway, Sweden and Finland - is known for the cold and snow, Finnish Lapland usually has a winter average temperature of -14C, with occasional dips to -30C, according to the nation's tourism board.Kittila airport predominantly serves people wishing to travel to nearby ski resorts and to see the Northern Lights, while Rovaniemi airport further south is the \"official\" destination for visitors to Santa Claus's folkloric home.One flight was cancelled out of Rovaniemi on Sunday.Flights were reportedly cancelled in and out of Kittila on Friday and Saturday as well.The cold weather has also made the roads particularly hazardous, with Fintraffic warning of icy conditions in the region.A bus full of Ukrainian passengers drove into a ditch on Sunday morning, Yle reported, citing local police. It said no serious injuries were reported.The unusual cold in Lapland comes as a storm passing over northern Europe has brought wintry conditions and travel disruption to the UK, France and Germany.A man was killed after a tree fell on his caravan in England, while around 100,000 homes were without power in France on Saturday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands of tourists stranded in Lapland as cold grounds flights",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8437/live/fa510aa0-ef2c-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-11T21:35:05.000Z",
      "dateModified": "2026-01-11T21:35:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Parents of under-fives in England to be offered screen time guidance",
    "url": "https://www.bbc.com/news/articles/c041e9xn3leo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/50cf/live/36f7c530-ef13-11f0-9808-7d7e192a3ac6.jpg",
    "tag": "Trending",
    "date": "2026-01-12T02:12:04.000Z",
    "description": "3 hours agoTom McArthurGetty ImagesParents of under-fives in England are to be offered official advice on how long their children should spend watchin",
    "body": "3 hours agoTom McArthurGetty ImagesParents of under-fives in England are to be offered official advice on how long their children should spend watching TV or looking at computer screens.The government says it will publish its first guidance on screen time for the age group in April.It comes as government research was published showing that about 98% of children under two were watching screens on a daily basis - with parents, teachers and nursery staff saying youngsters were finding it harder to hold conversations or concentrate on learning.Children with the highest screen time - around five hours a day - reportedly could say significantly fewer words than those at the other end of the scale who watched for around 44 minutes.A national working group led by Children's Commissioner for England Dame Rachel de Souza and Department for Education scientific adviser Professor Russell Viner will formulate the guidance after speaking to parents, children and early years practitioners.The terms of reference for their work will be published on Monday. The guidance will also help parents come up with alternatives to screen time for their children.The government research showed that at age two, 77% of children in the highest-income families are read to daily, compared with 32% in the lowest-income families.In a statement, Education Secretary Bridget Phillipson said: \"Screens are part of family life now. The question parents are asking isn't whether to use them, but how to use them well.\"Writing earlier in the Sunday Times, Phillipson said: \"Like so many parents, I've had evenings where you give in when your little one wants 'just one more' episode of their favourite show. But we're beginning to see the risks when 'just one more' starts to add up.\"She suggested parents could share a story on a tablet computer or use it for educational games.Felicity Gillespie, director of charitable foundation Kindred Squared, said \"evidence-based\" screentime guidance for parents was \"overdue and very welcome\".Kindred polling suggests that 40% of parents think reducing screen time would help ensure their child is ready for Reception. It says this underlines the demand for practical, trusted guidance in the early years.\"We must increase public understanding of how screens and devices can interfere with the way babies and toddlers learn best, which is by looking at facial expressions, chatting, singing and play,\" Gillespie said.Neil Leitch, from the Early Years Alliance, said he broadly welcomed plans to develop guidance on screen time for under-fives, but added: \"It's important that any such support on this topic sits within a much wider framework of guidance for families and educators on digital literacy and online safety.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Parents of under-fives in England to be offered screen time guidance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/50cf/live/36f7c530-ef13-11f0-9808-7d7e192a3ac6.jpg"
      ],
      "datePublished": "2026-01-12T02:12:04.000Z",
      "dateModified": "2026-01-12T02:12:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nikki Glaser's best jokes as Golden Globes host",
    "url": "https://www.bbc.com/news/articles/cvg19pddvkno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/086a/live/4e234ef0-ef59-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-12T02:21:02.000Z",
    "description": "2 hours agoSteven McIntoshEntertainment reporterHost Nikki Glaser returned to host the Golden Globes on Sunday, delivering a scorching opening monolog",
    "body": "2 hours agoSteven McIntoshEntertainment reporterHost Nikki Glaser returned to host the Golden Globes on Sunday, delivering a scorching opening monologue that roasted many of the celebrities in the room.\"Just like Wicked, I'm back for a sequel,\" she told the A-list crowd. \"Just like Frankenstein, I've been pieced together by an unlicensed European surgeon.\"And just like the podcasters nominated tonight, I should not be allowed to be this close to Julia Roberts.\"Golden Globes: The red carpet in picturesThe full list of winners and nomineesThe stars took her cutting comments in good humour as Glaser reflected on the last year in film and TV. Here are 21 of her best jokes.1. Welcome to the Golden Globes - without a doubt, the most important thing that's happening in the world right now.2. So let's get down to business, shall we? We'll start the bidding for Warner Bros at $5, do I hear $5?3. Tonight we are celebrating the best of TV and film, right here in the heart of Los Angeles, where no TV or film has been made for the past six years.4. There are so many A-listers here, and by A-listers I mean people who are on a list that has been heavily redacted. And the Golden Globe for best editing goes to the Justice Department. 5. George Clooney, you're amazing, I'm such a fan. I've always wanted to ask you this question: My Nespresso has been coming out kind of watery, and I'm wondering, is it like a pod issue, or do you think it might be the filter?6. The Rock is nominated tonight, and luckily for him, the TV show The Paper is not, so he might win.7. Kevin Hart is here, the Rock's plus one-half. 8. You two are like my favourite comedy duo. You're like Steve Martin and Martin Short but for people with under 50 IQ. Jumanji: Next Level - was it? 9. What a career Leonardo DiCaprio has had. Countless iconic performances, you've worked with every great director, you've won three Golden Globes and an Oscar, and the most impressive thing is you were able to accomplish all that before your girlfriend turned 30. 10. Leo, I'm sorry I made that joke, it's cheap, I tried not to, but we don't know anything else about you man. There's, like, nothing else. 11. Sean Penn, you're such an original. Everyone in this town is obsessed with looking younger, meanwhile Sean Penn is like, 'What if I slowly morph into a sexy leather handbag?'12. Fun fact: Hamnet was actually the original name for Spanx. I'm wearing three ham-nets right now.13. In Sinners, Michael B Jordan played two brothers. Am I allowed to say that? He played twins. 14. Wicked was back this year with Wicked: For Money.15. Once agin, Cynthia Erivo and Ariana Grande gave us two career-defining performances. Two hours into that movie, I was in tears. I was like, 'I can't believe there's still 45 minutes left'.16, Ariana, I would listen to you sing the phone book. Grab the one Kevin Hart is sitting on tonight.17. Timothée Chalamet is here for Marty Supreme - he's the first actor in history to have to put on muscle for a movie about ping-pong.18. It's a privilege to be in this room with you all. Please keep doing what you're doing. Guillermo del Toro, keep making weird monster sex movies. And James Cameron, keep making weird monster sex movies. 19. Noah Wyle, keep being the only doctor I've seen regularly for the last 35 years. 20. Jacob Elordi and Paul Mescal, keep being the same person to my mom.21. And lastly, Steve Martin and Martin Short, keep proving that in this industry, you're never too old to still need money.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nikki Glaser's best jokes as Golden Globes host",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/086a/live/4e234ef0-ef59-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-12T02:21:02.000Z",
      "dateModified": "2026-01-12T02:21:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US Fed Chair Jerome Powell under criminal investigation",
    "url": "https://www.bbc.com/news/articles/c801k7rkkd7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f51/live/ae8b18b0-ef57-11f0-92c5-a34e92251946.jpg",
    "tag": "Trending",
    "date": "2026-01-12T03:26:20.000Z",
    "description": "US justice department opens criminal probe into Fed chair Jerome Powell1 hour agoAna Faguy,WashingtonandOsmond ChiaGetty ImagesFederal prosecutors hav",
    "body": "US justice department opens criminal probe into Fed chair Jerome Powell1 hour agoAna Faguy,WashingtonandOsmond ChiaGetty ImagesFederal prosecutors have opened a criminal investigation into Federal Reserve Chairman Jerome Powell, he said on Sunday. In a video announcing the probe, Powell said the US justice department served the agency with subpoenas and threatened a criminal indictment over testimony he gave to a Senate committee about renovations to Federal Reserve buildings.He called the probe \"unprecedented\" and said he believed it was opened due to him drawing Donald Trump's ire over refusing to lower interest rates despite repeated public pressure from the president. The Fed chair is the latest to come at odds with Trump and then face criminal investigation by the US justice department.The BBC has contacted the justice department and the White House for comment.\"This is about whether the Fed will be able to continue to set interest rates based on evidence and economic conditions, or whether instead monetary policy will be directed by political pressure or intimidation,\" Powell said.\"I have deep respect for the rule of law and for accountability in our democracy. No one, certainly not the chair of the Federal Reserve is above the law, but this unprecedented action should be seen in the broader context of the administration's threats and ongoing pressure,\" he went on to say.Trump said in an interview with NBC News on Sunday that he did not have any knowledge of the Justice Department's investigation into the Fed.\"I don't know anything about it, but he's certainly not very good at the Fed, and he's not very good at building buildings,\" he said of Powell.The probe, which prosecutors have not confirmed, would signal a fresh escalation in Trump's ongoing dispute with Powell, who the president nominated for the role as Fed chair in 2017.Trump has repeatedly threatened to remove Powell, who he has criticised for not cutting interest rates as quickly as the president would have liked. In the second half of 2025, the Fed cut interest rates three times.The president has consistently blamed his predecessor, Joe Biden, and interest rates  for inflation and costs in the US.Critics have raised concerns that Trump's pressure to oust the Fed chair would muddy the institution's authority to set interest rates independently from presidents.North Carolina Senator Thom Tillis, a Republican who is a member of the Senate Banking Committee, said he would oppose the nomination of Powell's replacement by Trump, and any other Fed Board nominee, \"until this legal matter is fully resolved\".\"If there were any remaining doubt whether advisers within the Trump Administration are actively pushing to end the independence of the Federal Reserve, there should now be none,\" Tillis said in a statement.\"It is now the independence and credibility of the Department of Justice that are in question,\" the senator said.Senator Elizabeth Warren, a Democrat, said she believed Trump's plan was to push Powell off the Fed board for good and \"install another sock puppet to complete his corrupt takeover of America's central bank\".\"This committee and the Senate should not move forward with any Trump nominee for the Fed, including Fed Chair,\" she said.Powell's investigation will be overseen by the US Attorney's Office for the District of Columbia, according to the New York Times, which first reported the probe.Trump previously took aim at Lisa Cook, a governor at the US central bank, whom he tried to fire over alleged mortgage fraud.The case was blocked by a US federal court and will be heard by the Supreme Court later this month.Criminal charges brought by Trump's justice department against political adversaries like New York Attorney General Letitia James, who brought a civil fraud case against Trump in 2024, and ex-Federal Bureau of Investigation boss James Comey were also dismissed by a court.Comey was accused of making false statements and obstructing justice. He was fired by Trump during his first term after leading a probe into Russian interference in the 2016 US presidential election, which Trump won over Hillary Clinton.Both Comey and James have maintained their innocence and said the prosecutions were politically charged.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US Fed Chair Jerome Powell under criminal investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f51/live/ae8b18b0-ef57-11f0-92c5-a34e92251946.jpg"
      ],
      "datePublished": "2026-01-12T03:26:20.000Z",
      "dateModified": "2026-01-12T03:26:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands of homes in Sussex and Kent still without water supply",
    "url": "https://www.bbc.com/news/articles/c8e5pzwzpy3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/015f/live/d4e42dc0-eef4-11f0-9bba-e7a018685508.jpg",
    "tag": "Trending",
    "date": "2026-01-11T15:55:03.000Z",
    "description": "13 hours agoZac SherrattSouth EastEddie MitchellOne of the two water station in East Grinstead, where people have been queueing to collect suppliesTen",
    "body": "13 hours agoZac SherrattSouth EastEddie MitchellOne of the two water station in East Grinstead, where people have been queueing to collect suppliesTens of thousands of homes in the south-east of England are still without water, with many told supplies will not be restored until at least Tuesday.In Sussex, some 16,500 households in East Grinstead have no or low pressure supplies, with people in Eastbourne and the village of Upper Dicker experiencing similar problems.In Kent, about 4,500 homes in the Hollingbourne, Headcorn, Ulcombe, Kingswood and Sutton Vallance areas have been left with no water, while those in Wrotham, Sevenoaks and the Loose area of Maidstone have low pressure or no supplies.South East Water (SEW) has apologised to all those affected and said it was delivering water to those on its priority register.The supply problems have been caused by a number of issues across SEW's network.The company blamed Storm Goretti and cold weather for the outages in East Grinstead and \"essential network changes\" for those in Eastbourne.It said the issues in Hollingbourne were due to \"neighbouring water companies being unable to give us the bulk supplies of treated water as they normally do\".A number of bottled water stations have been set up around the region but residents say it is causing chaos on the roads.Eddie MitchellLong queues of vehicles are causing traffic problems in and around East GrinsteadA woman from Forest Row, two miles south of East Grinstead, told the BBC: \"Most of the village is currently without water and yet we have to travel to East Grinstead to collect bottled supplies.\"The roads around East Grinstead are gridlocked with people queuing for water. Why aren't there water stations in the villages around East Grinstead that are without water?\"South East Water says it has delivered water to the elderly and vulnerable and indeed my sister, aged 72, had water delivered to her. However, her 92-year-old neighbour received nothing.\"How are the elderly and those without cars expected to travel to East Grinstead to get water?\"She added: \"Two water collection points is obviously woefully insufficient.\"The BBC put these comments to SEW, which said it had taken action following criticism.Mims Davies, the Conservative MP for East Grinstead and Uckfield, said she felt \"extremely sorry and frustrated for vulnerable customers, those with livestock, young children and babies, along with all the businesses which are deeply affected\".She described the ongoing situation as \"the worst case scenario\". 'Entirely unacceptable'Steve Andrews, incident manager at SEW, said: \"We have listened to customer feedback regarding yesterday's bottled water station at Sainsbury's, Brooklands Way, and we have taken the decision not to open this today, with an alternative bottled water station opened at East Grinstead Sports Club. We apologise for the disruption caused to the local community.\"The other bottled water station in East Grinstead is at the Queensway car park.In Kent, water stations are at Tunbridge Wells rugby club and Headcorn Aerodrome in Ashford.The village of Stelling Minnis, near Canterbury, is also experiencing supply issues, while thousands in Tunbridge Wells who have been without water since Tuesday should see it return on Sunday, SEW said.Eddie MitchellMembers of the public have been picking up bottled water at East Grinstead rugby club's water stationMary Creagh, a minister for the Department for Environment, Food and Rural Affairs, said on Saturday the problems were \"unacceptable\".\"I remain very concerned that people in several areas in the South East and South West are experiencing water supply issues following both cold weather and Storm Goretti,\" she said.\"This is entirely unacceptable. This afternoon, I chaired a further meeting with the water companies and local resilience forums to restore supplies as quickly as possible, prioritising vulnerable customers and essential public services.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands of homes in Sussex and Kent still without water supply",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/015f/live/d4e42dc0-eef4-11f0-9bba-e7a018685508.jpg"
      ],
      "datePublished": "2026-01-11T15:55:03.000Z",
      "dateModified": "2026-01-11T15:55:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Masters 2026: Shaun Murphy and Mark Selby both eliminated on opening day",
    "url": "https://www.bbc.com/sport/snooker/articles/c93vy5j73vxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7be6/live/d4dec1d0-ef3c-11f0-a422-4ba8a094a8fa.png",
    "tag": "Trending",
    "date": "2026-01-11T22:55:49.000Z",
    "description": "Reigning champion Shaun Murphy and current UK title holder Mark Selby were both eliminated on a thrilling opening day of the Masters at London's Alexa",
    "body": "Reigning champion Shaun Murphy and current UK title holder Mark Selby were both eliminated on a thrilling opening day of the Masters at London's Alexandra Palace.Murphy lost 6-2 to China's Wu Yize in the first round, before Selby, who won the UK Championship last month, was defeated by the same score against another Chinese debutant, Xiao Guodong.Murphy lost the opening three frames and, despite taking frame four, then lost the fifth on a black-ball finish.Wu, 22, is ranked 13th in the world and picked up his first ranking title in November when he won the International Championship in Yanjing in his home country, beating world champions Judd Trump, Zhao Xintong and John Higgins along the way.On his Alexandra Palace debut, Wu made a superb clearance of 137 in frame two and a break of 56 in frame seven.\"I felt a bit of pressure when I entered the stadium because it was the first time I've played in such a big stadium and the fans were so enthusiastic,\" said Wu.\"After the first frame, I felt a bit more relaxed and I totally enjoyed the atmosphere. It's definitely a great achievement for myself - my first time playing at the Masters and the first time beating Shaun Murphy.\"For 43-year-old Murphy, who reached the semi-final of the UK Championship last month, it was a disappointing afternoon with him failing to register a single break of 50.\"I've been looking forward to today for a year, walking out as champion, but I enjoyed the first 10 minutes,\" said Murphy, who beat Kyren Wilson to win the Triple Crown event for a second time a year ago.\"I'm very disappointed. None of it was there. I felt everything I touched was not there. I've been working very hard, practising hard, playing a lot of snooker, so I didn't expect to play like that and I'm as shocked as anyone.\"I didn't play well, certainly the worst performance of my season, maybe the worst in the Masters.\"Wu looked calm, looked at ease and fully deserved his win. He will be a handful for anyone he plays.\" Wu will now face a quarter-final on Thursday against compatriot Xiao, who played superbly to defeat three-time champion Selby in the evening session.Xiao, 36, made breaks of 95, 62, 76 and 77 as he won the opening four frames, with Selby's highest break only being 21.But the four-time world champion threatened a superb comeback as he made breaks of 101 and 76 to bring it back to 2-4.Xiao had not potted a ball in 46 minutes but then made an excellent break of 118 to move one frame away from victory, which he clinched by edging a scrappy eighth frame.\"The venue is good, the people watching are good and everything is perfect - this was my first time playing in the Masters,\" said Xiao.\"We both played good and I won the first four frames and gave Mark a bit of pressure but then he came back so it was a good game.\"Nobody thought I could win. I just told myself 'enjoy, be more relaxed and not think about winning or losing'. A lot of people were supporting me and that gives me confidence.\"Selby, 42, had no complaints about the result and said: \"In the first four frames I didn't have many chances. Every time Xiao came to the table, I made it easy for him.\"I did well to make it 4-2 and felt I had some momentum, then I missed and Xiao punished my mistakes.\"I feel good about my game even though I lost so it's just one to forget.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Masters 2026: Shaun Murphy and Mark Selby both eliminated on opening day",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7be6/live/d4dec1d0-ef3c-11f0-a422-4ba8a094a8fa.png"
      ],
      "datePublished": "2026-01-11T22:55:49.000Z",
      "dateModified": "2026-01-11T22:55:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]