[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhdbrt?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Nov 2025,·33 minsThe Google Boss And The Massive AI GambleNewscastAvailable for over a yearToday, the CEO of Google gives a rare interview to discuss AI, economic risk, climate change and much more. \nFaisal Islam has been speaking to Sundar Pichai, the head of Google’s parent company Alphabet, about the future of the AI bubble.\nThe tech boss warned that “no company is going to be immune” if the AI bubble bursts after its current period of boom. This comes as some analysts expressed fear that stock markets are heading for a repeat of the dotcom bubble burst of the late 1990s.\nThey also discussed the environmental cost of powering AI, the potential risks to jobs and whether the UK will benefit from the current boom. BBC economics editor Faisal Islam joins Adam in the studio.\nYou can listen to a longer version of the interview with Sundar Pichai here - https://www.bbc.co.uk/sounds/play/p0mh56kj\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi and Anna Harris. The social producer was Beth Pritchard. The technical producer was James Piper. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Will Trump delay releasing the Epstein Files? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhn68x?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-17T19:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Nov 2025,·31 minsWill Trump delay releasing the Epstein Files?AmericastAvailable for over a yearDonald Trump says he will sign a bill to release the Epstein Files after it passed nearly unanimously through both houses of Congress. It’s a notable shift in position from the president, who’s come under increasing pressure from Republicans and Democrats to release all files held by the Justice Department on the convicted sex offender Jeffrey Epstein. Will Trump be able to turn this into a victory, and will he be able to repair the rift that’s been growing among sections of his MAGA base?\nJustin, Sarah and Marianna take a look at what we know so far about Epstein’s relationships with powerful figures in the US, and what we can expect to see from the Epstein Files once they’re released into the public domain.\nAnd we assess just how significant a moment this is in Donald Trump’s second term as president, the tactics he may deploy to turn it into a political victory, and why he told one female reporter to be ‘quiet, piggy’ when asked about the Epstein Files on Air Force One.\nHOSTS:\n- Justin Webb, Radio 4 presenter\n- Marianna Spring, Social Media Investigations Senior Correspondent\n- Sarah Smith, North America editor\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by George Dabby, Grace Reeve and Laura Cain. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155#\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Will Trump delay releasing the Epstein Files? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-17T19:06:00.000Z",
      "dateModified": "2025-11-17T19:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
    "url": "https://www.bbc.com/news/articles/c8jrjr4wrr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png",
    "tag": "Trending",
    "date": "2025-11-20T10:12:36.000Z",
    "description": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23,",
    "body": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23, pleaded guilty to instigating the violent assault on Australian brothers Jake and Callum Robinson and their American friend Carter Rhoad, who were on a surfing trip in the northern Mexican state of Baja California in April 2024 when they disappeared.Their bodies were later found with gunshot wounds to the head at the bottom of a deep well.Ari Gisell had expressed interest in the tyres on the surfers' car and told her then-boyfriend Jesús Gerardo to \"bring me a good phone and good tyres for my pickup truck\", the court heard.Only the first and middle names of the defendants were revealed. Surnames were not, in line with Mexican court reporting rules.Jesús Gerardo and two others, Irineo Francisco and Ángel Jesús, tailed the vehicle to the campsite where the foreigners were staying, then robbed them before shooting them dead. The cases against these three men are still before the courts.According to Mexican newspaper La Silla Rota, Jesús Gerardo and Irineo Francisco have ties with the powerful drug cartel Sinaloa, which was for many years led by the notorious drug lord Joaquín \"El Chapo\" Guzmán.Because of these links, both men are being held in El Hongo, a maximum-security prison in Baja California. Ángel Jesús has been detained in a separate facility in the city of Ensenada.Prosecutors do not suspect any connections between the murders and organised crime, however, according to the Australian Broadcasting Corporation (ABC).The victims' families, who appeared via video conference, made emotional statements at the hearing on Wednesday.\"We dreamed of seeing them grow older, of having children. That's all taken now,\" said Callum and Jake's mother Debra Robinson, as reported by ABC. \"We live with their absence.\"Callum Robinson, 33, was a member of Australia's national lacrosse team and was living in San Diego, just across the US-Mexico border from Baja California.His younger brother Jake, 30, lived in Australia and had travelled to North America to visit Callum. He was due to start a new job as a doctor when he returned.Their friend Rhoad, 30, was a San Diego resident and worked in a technology services company. Rhoad was months away from marrying his fiancee when he was killed.\"He was my safety in the world,\" his fiancee Natalie Wiertz told the court. \"My life is now a nightmare.\"Ari Gisell gave a tearful apology in court, acknowledging that \"nothing I can say will compensate you or give you peace\".\"I am focused on being a better person, and I am very sorry for your losses,\" said the single mother, as quoted by La Silla Rota.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png"
      ],
      "datePublished": "2025-11-20T10:12:36.000Z",
      "dateModified": "2025-11-20T10:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paris court blocks auction of earliest-known calculator",
    "url": "https://www.bbc.com/news/articles/c2kpkq90ygno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg",
    "tag": "Trending",
    "date": "2025-11-20T02:03:14.000Z",
    "description": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic it",
    "body": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic item from being exported.Auction house Christie's has confirmed it will not proceed with bidding for the machine La Pascaline, developed by the French mathematician Blaise Pascal in 1642.Valuations suggested the machine could fetch €2m to 3m (£1.7m to £2.6m), and Christie's called it the \"most important scientific instrument ever offered at auction\".Scientists and researchers made a legal appeal to grant heritage protections to the historic instrument, arguing it should be classified as a \"national treasure\".Pascal was just 19 years old when he developed the earliest version of a calculator, Christie's said. There are only nine of these machines still in existence.\"It is the first attempt in history to substitute the human mind with a machine,\" the official collection description reads.\"Its invention marks a breakthrough, a 'quantum leap' whose importance and significance take on a very special meaning today.\"La Pascaline was exhibited at Christie's venues in New York and Hong Kong throughout the year. The machine was included in Christie's auction of the library of the late Catalonia collector Léon Parcé, which also featured Pascal's philosophical piece Pensées and the first printed version of \"Pascal's wager\".On Wednesday, a Paris administrative court temporarily blocked an earlier export authorisation provided by France's culture minister in May. Two experts had signed off on the minister's certificate, including one from the Louvre Museum.The judge concluded there were \"serious doubts\" over the legality of the certificate, a statement from the Paris court said, adding the decision was provisional until a final judgment is delivered.In a statement to the AFP news agency, a Christie's spokesperson said: \"Given the provisional nature of this decision and in accordance with the instructions of its client, Christie's is suspending the sale of La Pascaline.\" The court noted La Pascaline's historic and scientific value could qualify it as a \"national treasure\", guaranteeing protections under the France's heritage code.The French heritage group Association Sites & Monuments, which was listed as an applicant in the court filing, welcomed the decision.Additional reporting by Sebastian Usher, Global Affairs reporter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paris court blocks auction of earliest-known calculator",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg"
      ],
      "datePublished": "2025-11-20T02:03:14.000Z",
      "dateModified": "2025-11-20T02:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Plans for flexible four-day week in class for Scottish teachers",
    "url": "https://www.bbc.com/news/articles/cn8v855v95jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8ed/live/ad202ec0-c56d-11f0-b9b5-d9ab78bbe49c.jpg",
    "tag": "Trending",
    "date": "2025-11-20T10:46:49.000Z",
    "description": "2 hours agoGetty ImagesTeachers could work a \"flexible\" four-day teaching week under new proposals announced by the Scottish government.Plans also inc",
    "body": "2 hours agoGetty ImagesTeachers could work a \"flexible\" four-day teaching week under new proposals announced by the Scottish government.Plans also include reduced classroom contact time with pupils and agreed national minimum standards for pupil learning hours. These could enable later start times, extended breaks, or restructured school days.Scotland's education Secretary Jenny Gilruth said it demonstrated a \"clear commitment\" to teachers. But the EIS union said was \"not aware\" of how a flexible four-day week would work.The EIS and NASUWT unions are currently balloting members on strike action over a failure to reduce class contact time - periods when teachers are directly teaching pupils.At the last Holyrood election, the SNP promised to cut contact time by 90 minutes a week to give teachers more time for activities such as lesson preparation and marking.It would also provide more capacity to help pupils with additional support needs (ASN).The Scottish government said a flexible four-day week teaching model could offer a dedicated day for \"professional activities\".PA MediaGilruth said the proposals showed a \"clear commitment to teachers\"The education secretary said the plans, along with a new pay deal, would form a new \"National Deal\" for teachers.Gilruth said: \"It is a statement of intent to empower Scotland's teachers with the time, trust and tools they need to deliver transformative learning. \"By investing in teacher capacity, the aim is to create richer learning experiences and raise standards for every learner.\"Working together, we can shape a future where reduced class contact time is not just a logistical change but a catalyst for deeper professional engagement, improved wellbeing, and better outcomes for every learner.\"A survey by the EIS in June found the workload in schools was \"unfair, unhealthy and unsustainable\". Teachers said they were rarely or never able to do the work, preparation and correcting they had been asked to do within their working week.Ongoing delaysEIS general secretary Andrea Bradley said the promised 90-minute reduction in class contact time was a \"red line for teachers\".She said teachers should be trusted to use this time as they see fit.\"There can be no government or employer diktat over how this time should be utilised by teachers,\" she added.Ms Bradley told BBC Radio's Good Morning Scotland programme that the union was not aware of how a flexible four-day week would be implemented.She said the Scottish government's proposals did \"not amount to a plan that can be properly scrutinised\" and said it would not affect the EIS strike ballot.NASUWT said it was pleased with the proposals but it needed \"assurance that teachers will have the responsibility for deciding how such time should be used\". A spokesperson added: \"Our members are frustrated at the ongoing delays in the delivery of a clear Scottish government promise to them, which is why we have opened a ballot on industrial action on this matter.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Plans for flexible four-day week in class for Scottish teachers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8ed/live/ad202ec0-c56d-11f0-b9b5-d9ab78bbe49c.jpg"
      ],
      "datePublished": "2025-11-20T10:46:49.000Z",
      "dateModified": "2025-11-20T10:46:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zayn Malik: Blackpink collaboration made me 'cool again'",
    "url": "https://www.bbc.com/news/articles/cp97d9j4m0zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bded/live/7919a190-c56f-11f0-b9b5-d9ab78bbe49c.jpg",
    "tag": "Trending",
    "date": "2025-11-19T22:35:50.000Z",
    "description": "Zayn's collab with Blackpink singer made him 'cool again' with daughter14 hours agoNaomi Clarke,BBC Newsbeat and Georgia Levy-Collins,BBC NewsbeatGett",
    "body": "Zayn's collab with Blackpink singer made him 'cool again' with daughter14 hours agoNaomi Clarke,BBC Newsbeat and Georgia Levy-Collins,BBC NewsbeatGetty ImagesZayn Malik shares a daughter with his former partner, US model Gigi HadidZayn Malik has said he jumped at the chance to collaborate on a song with Blackpink's Jisoo as his daughter is a \"massive fan\".The former One Direction star, 32, released the track Eyes Closed alongside the South Korean pop star last month. While hosting his first BBC Radio 1 show, Zayn said that when Jisoo approached him about doing a feature he thought: \"My daughter's gonna think I'm cool again so I'll definitely do that.\"The singer shares five-year-old Khai with his former partner, US model Gigi Hadid.It 'was an honour'It is not the first time Zayn has shared his love for the K-pop band. Over the summer, he posted a photo to his Instagram story of him holding his daughter in his arms while they attended a Blackpink concert, and wrote on the post \"Me & Khai loved it\".During his two-hour Radio 1 special, Zayn said he was keen to work with Jisoo as she is \"killing it at the minute\".\"I've wavered a little bit from the pop sound myself, so to come back to it with the people who are basically owning that genre at the minute was an honour,\" he said. \"If I can say thanks to Jisoo, I'm really happy with the way it turned out.\"Blackpink – comprised of members Jisoo, Jennie, Rosé and Lisa – are one of the biggest K-pop girl bands in the world.PA MediaZayn Malik rose to stardom alongside his fellow One Direction band members - Harry Styles, Niall Horan, Louis Tomlinson and Liam PayneAlongside playing a few of his own songs during his radio special, Zayn shouted out some of his favourite artists including US rappers Lauryn Hill and Eminem.The Bradford-born singer also revealed his father was a \"massive\" fan of Biggie Smalls and he would blast songs by the US rapper loudly so the whole street could hear. \"Rap music was a big influence in my younger years and that was definitely made more prominent by the fact that I was living in Bradford, for sure,\" he said. The singer's music career began in 2010 as part of One Direction, the boy band formed on TV talent contest, The X Factor. He rose to stardom alongside the other band members - Harry Styles, Niall Horan, Louis Tomlinson and Liam Payne.Liam died in October 2024 after falling from a hotel balcony in Argentina.Zayn left the group in 2015 to go solo and released his debut album, Mind of Mine, in 2016, which topped the charts. The singer went on to release three more albums. The latest, Room Under The Stairs, peaked at number three in the charts last year. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zayn Malik: Blackpink collaboration made me 'cool again'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bded/live/7919a190-c56f-11f0-b9b5-d9ab78bbe49c.jpg"
      ],
      "datePublished": "2025-11-19T22:35:50.000Z",
      "dateModified": "2025-11-19T22:35:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six-figure sum agreed after baby's choking death at nursery",
    "url": "https://www.bbc.com/news/articles/c98n5w70p78o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4423/live/562fb930-b0b6-11f0-aba1-bffe4144781c.jpg",
    "tag": "Trending",
    "date": "2025-11-20T11:39:54.000Z",
    "description": "44 minutes agoJosie HannettSouth East InvestigationsFamily photoOli Steeper died in hospital after choking at nurseryThe parents of a nine-month-old b",
    "body": "44 minutes agoJosie HannettSouth East InvestigationsFamily photoOli Steeper died in hospital after choking at nurseryThe parents of a nine-month-old baby who died after choking at nursery say after four years of \"unimaginable pain, perseverance and emotional endurance\" they are glad to have reached a financial settlement.Oliver Steeper died in hospital in September 2021, six days after he choked on chopped pasta at the Jelly Beans Day Nursery in Ashford.His parents, Lewis and Zoe Steeper have received a six-figure settlement from the former nursery, without an admission of liability.Former management of Jelly Beans nursery, which closed shortly after Oli's death, have declined to comment.Oli's parents Zoe and Lewis say they will continue to raise awareness of food safety for childrenMrs Steeper said: \"We can put that chapter of Oli's life behind us and remember him positively.\"His father said the settlement allowed the family to draw a line under a \"painful legal chapter\".Mr Steeper added: \"No amount of financial compensation can ever equate to the loss of our child but this resolution allows us to focus our energies on ensuring that no other family endures the same devastation that we have suffered whilst ensuring Oliver's brother Jake has the best of futures ahead.\"He added that he and his wife had \"fought tirelessly to highlight the systemic failings\" that led to Oli's death.An inquest into his death found Oli died as a result of misadventure.At the time of the incident he had pureed meals at home and his parents were told by nursery staff that solids could be blended before being fed to him.An expert in resuscitation at the inquest said the first aid delivered at the nursery was \"poor\" and that guidelines were not properly followed.Following the inquest, a prevention of future deaths report was sent by coroner Katrina Hepburn to the Department for Education under the previous government.Family photoZoe Steeper believes her son's death was \"entirely preventable\"Ms Hepburn raised concerns about paediatric first aid training being in date and staff education over weaning.Since his death, Oli's parents have been campaigning for better safety measures around weaning babies onto solid food and emergency first aid provision for nurseries.They have welcomed new safer-eating measures which came into force in September.Included in the guidelines are that childcare providers must talk to parents about the stage of weaning their child is at, prepare food in a way to prevent choking, and ensure children are always within sight and hearing of a member of staff while eating, among other measures.JOSIE HANNETTJelly Beans Day Nursery in Kingsnorth, Ashford, closed down shortly after Oli's deathMrs Steeper said: \"It really touches at your heartstrings when you see that practitioners are taking on board what has been said and they are actively working towards making their settings as safe as they can be. \"The fact that underpinning all of that is Oli, it's amazing, it's really incredible.\"The Oliver Steeper Foundation, set up in his memory, is aiming to raise enough money to supply anti-choking devices in every registered childcare and early years setting across the UK. So far it has distributed more than 1,450 LifeVacs.The site of the former Jelly Beans Day Nursery in Kingsnorth was sold and is now a school for children with special educational needs.More stories from our investigations team",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six-figure sum agreed after baby's choking death at nursery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4423/live/562fb930-b0b6-11f0-aba1-bffe4144781c.jpg"
      ],
      "datePublished": "2025-11-20T11:39:54.000Z",
      "dateModified": "2025-11-20T11:39:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why trying too hard may be holding you back at work",
    "url": "https://www.bbc.com/news/articles/c5yl1y5gep8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c75f/live/a224cc80-c5f7-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T01:12:04.000Z",
    "description": "11 hours agoHannah KarpelBBC NewsBBC\"It feels like I am constantly setting myself up for failure or disappointment,\" says AswanPerfectionism has a gre",
    "body": "11 hours agoHannah KarpelBBC NewsBBC\"It feels like I am constantly setting myself up for failure or disappointment,\" says AswanPerfectionism has a great reputation. It's one of the most common answers used in a job interview to spin the dreaded \"What's your weakness?\" into a humblebrag.For many, it's about striving for excellence or working tirelessly to reach the highest standard.But what happens when these high (and sometimes unrelenting) expectations of yourself are exactly what's holding you back?\"I know perfectionism is an illusion, but I am always trying to chase it,\" admits 25-year-old Aswan.Even in the workplace, she feels the pressure, \"I know that I can make a mistake and I won't lose my job, yet I constantly feel like I'm one strike away from being fired\".It's an anxiety shared by many perfectionists, says health psychologist Dr Sula Windgassen. Speaking on the BBC Sounds podcast Complex, she explains: \"Poor self-esteem tends to go hand in hand with perfectionism because there is this fear of failing\".That fear often fuels procrastination. Aswan remembers taking her driving theory test: \"I got so pent up about passing it first time that when I failed by a couple of points I've never tried to get it back.\" That was almost four years ago.Perfectionism can be rooted in personality, but childhood experiences, school environments, and parental expectations can also shape what we grow up believing is \"good enough\".Breaking the cycleWhile perfectionism isn't a clinical diagnosis, its effects are very real - from anxiety and tiredness to stress-related physical symptoms such as a weakened immune system.Still, experts say the cycle can be broken. Dr Windgassen suggests beginning what's known in psychology as a behavioural experiment.It starts by asking yourself what you think will happen if the outcome isn't perfect - writing down your predictions, and then testing them in real time.Was the outcome as bad as you expected? And what positive things came from this new approach? It might be that you manage to go to sleep at 10pm rather than 1am, leaving you feeling more refreshed.Over the years, Dayna says she has learned to quiet her harsh inner criticFor 26-year-old Dayna, who describes herself as a \"former perfectionist\", it's a trait she is relieved to have left behind. She once sacrificed her wellbeing in pursuit of flawless results and it's something she never wants to repeat.\"I kept a journal to gain more self-awareness about my tendencies and read self-help books,\" says Dayna. \"I had to learn the hard way how to develop coping mechanisms and strategies to not sacrifice everything and that being a perfectionist is not a noble quality as I used to think it might be.\"At times, her harsh inner critic took over and eventually the path to perfectionism led to burnout.Looking back, Dayna remembers feeling chronically anxious and stressed.\"Right now I have become content with just trying my best and accepting that I can't always get the outcome I want but the outcome I get will be more than good enough and I am at peace with that now.\"Not all perfectionism is necessarily harmful. One form, known as perfectionistic striving, focuses on setting more ambitious personal goals. When these goals can be adapted in response to changing circumstances, they tend to cause less stress and lead to more positive outcomes. For example, an athlete setting tough goals, but cutting back on training when they're injured.But it still has its limitations. A research paper published in July 2025 by the British Psychological Society found that aiming for excessively high goals often leads to long working hours, with only marginal gains in performance.Working through these perfectionistic tendencies can be uncomfortable, says Dr Windgassen - but that discomfort is part of the process.\"That's not a sign that you shouldn't do it - it's a sign that you should,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why trying too hard may be holding you back at work",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c75f/live/a224cc80-c5f7-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T01:12:04.000Z",
      "dateModified": "2025-11-20T01:12:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David Carrick, ex-Met officer, given additional life sentence",
    "url": "https://www.bbc.com/news/articles/cy0y075nyw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d517/live/07a9a680-a28a-11ef-bdf5-b7cb2fa86e10.png",
    "tag": "Trending",
    "date": "2025-11-20T11:47:56.000Z",
    "description": "Rapist ex-Met officer given another life sentence38 minutes agoBrian Farmer,at the Old Bailey and Danny FullbrookHertfordshire PoliceDavid Carrick now",
    "body": "Rapist ex-Met officer given another life sentence38 minutes agoBrian Farmer,at the Old Bailey and Danny FullbrookHertfordshire PoliceDavid Carrick now must wait until 2055 before he can apply for paroleConvicted rapist and former Met police constable David Carrick has received an additional life sentence.The 50-year-old was found guilty on Wednesday of sexually abusing a 12-year-old girl in the 1980s when he was 14 and raping a former partner 20 years later.He had already been serving 36 life sentences with a minimum of 32 years after admitting 71 offences of sexual violence committed over a 17-year period.In a victim impact statement, the woman abused as a child told the court the trauma had \"followed me into adulthood\".Carrick was found guilty of five counts of indecent assault against her between April 1989 and August 1990.He was also convicted of two counts of rape against another woman, once in 2019 and once between December 2014 and April 2016, as well as additional counts of sexual assault and coercive and controlling behaviour against her.How 'monster' Met officer was convicted of more sex crimesCarrick, seen here being arrested by police, shook his head repeatedly as the verdicts were read outProsecutor Tom Little KC said Carrick had to be treated as juvenile for the offences against the girl.He added mitigation was \"limited in its nature\" and the earliest date of parole had already been set at 2054, when he would be aged 78.Judge Mrs Justice McGowan said: \"The sentence I impose today will have little if any practical effect.\"She said Carrick had shown a \"lack of remorse\" and had \"cynically\" caused witnesses to attend court by denying the charges.\"Your behaviour as a sexual predator began when you were a child yourself,\" she told him, adding he had \"bullied and manipulated\" his former partner throughout their relationship.A statement from the woman abused as a child was read to the court by barrister Gareth Munday, representing the prosecution.It said: \"I don't believe David has any remorse... I don't think I will ever be able to trust anyone completely.\"The effects of these offences are not something I can simply move on from.\"PA MediaDavid Carrick, sketched at an earlier court hearing in July, was found guilty of nine offencesThe latest offences came to light after Carrick had pleaded guilty in 2022 and 2023 to other sexual offences.Carrick had denied the allegations, calling the now-adult woman a liar, and insisted sex with his ex-partner had been consensual.During the trial, jurors heard how Carrick had abused the young girl for about 18 months before she told her mother.Referencing this abuse, which took place when Carrick was a teenager, the judge said: \"They were the first examples to come to light of your disposition to commit predatory sexual crimes.\"The new sentence means Carrick, previously eligible for parole in 2054, must now wait until 2055.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David Carrick, ex-Met officer, given additional life sentence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d517/live/07a9a680-a28a-11ef-bdf5-b7cb2fa86e10.png"
      ],
      "datePublished": "2025-11-20T11:47:56.000Z",
      "dateModified": "2025-11-20T11:47:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military officials in Kyiv as Europe warns against reported Russia peace plan",
    "url": "https://www.bbc.com/news/articles/cvgdgrqwnq9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d658/live/eea590e0-c5f6-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T11:55:36.000Z",
    "description": "32 minutes agoJaroslav Lukiv, Laura Gozzi and Paul Kirby,Europe digital editorSenior Pentagon officials have arrived in Ukraine to \"discuss efforts to",
    "body": "32 minutes agoJaroslav Lukiv, Laura Gozzi and Paul Kirby,Europe digital editorSenior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army Secretary Dan Driscoll, held talks with Ukrainian Prime Minister Yulia Svyrydenko on Thursday morning. They are expected to meet Ukrainian President Volodymyr Zelensky later in the day.Reports began surfacing on Wednesday that the US and Russia had prepared a new proposed framework to end the war, requiring major concessions from Ukraine including giving up territory and dramatically shrinking its military.It was reportedly drafted by President Donald Trump's envoy Steve Witkoff and Russian special envoy Kirill Dmitriev.Neither Washington nor Moscow have officially confirmed the plan. However, US Secretary of State Marco Rubio wrote on X that achieving a \"durable peace will require both sides to agree to difficult but necessary concessions\". He said the US was consulting both sides of the conflict to \"develop a list of potential ideas for ending this war\".Driscoll's team is the most senior military group to travel to Kyiv since Trump took office in January. He is joined by Army chief of staff Gen Randy George, top US army commander in Europe Gen Chris Donahue, and sergeant major of the army Michael Weimer. Details of the draft Witkoff-Dmitriev 28-point plan emerged more than three weeks after the two men are said to have spent three days in meetings in Miami, Florida.Citing people familiar with the matter, Axios, the Financial Times and Reuters reported that the plans call for Kyiv to give up areas of the Donbas in eastern Ukraine that it still controls, to cut significantly the size of its armed forces, and to forego many of its weapons.Zelensky has repeatedly ruled out any territorial concessions to Russia.Kirill Dmitriev's team declined to comment on the reports. The BBC has also asked the White House and a representative for Witkoff to comment. Kremlin spokesman Dmitry Peskov said on Thursday that \"contacts\" had taken place with the US, but no \"consultations or negotiations\" were happening. Neither European nor Ukrainian officials are believed to have been involved in drafting the new proposal, sparking fears it could be overwhelmingly favourable to Russia. EU foreign policy chief Kaja Kallas warned on Thursday that for any plan to work, it would need to have Ukrainians and Europeans on board, and French Foreign Minister Jean-Noël Barrot said \"the Ukrainians do not want any form of capitulation\".After meeting US officials, Ukraine's prime minister did not address the rumoured plan - but said their visit provided \"an opportunity for representatives of the American administration to assess the situation on the ground and see the consequences of Russian aggression\".Reports of the plan emerged on Wednesday, the same day Ukrainian officials said at least 26 people had been killed in a Russian missile and drone attack on blocks of flats in Ukraine's western city of Ternopil. Another 22 people were missing at the site, Zelensky said on Thursday. Zelensky was in Turkey at the time of the Ternopil attack, and unconfirmed Ukrainian reports suggested that talks had been planned with Trump's envoy in Ankara, but were called off.There was no mention of the proposed framework when the US army secretary arrived in Kyiv late on Wednesday. Army spokesman Col David Butler said only that Driscoll and his team were there \"on behalf of the [Trump] administration on a fact-finding mission to meet Ukrainian officials and discuss efforts to end the war\".A Ukrainian official told CBS, the BBC's US media partner, that talks on the trip would focus on the military situation on the ground - as well as plans for a possible ceasefire. The unnamed official said: \"Presidents Zelensky and Trump have already agreed to stop the conflict along the existing lines of engagement, and there are agreements on granting security guarantees\".After talks with the US army secretary on Wednesday, Ukrainian Defence Minister Denys Shmyhal posted on X: \"We focused on the next steps for implementing the historic defence agreements reached by President Zelensky and President Trump.\"Kyiv and its Western allies, including the US, have been calling for an immediate ceasefire along the vast front line, but Moscow has ruled that out, repeating demands that Ukraine says amount to its de facto capitulation.Earlier this month, Russian Foreign Minister Sergei Lavrov said Moscow's pre-conditions for a peace deal - including ceding territory, tough curbs on the size of Ukraine's military and the country's neutrality - had not changed since Putin laid them out in 2024.Meanwhile, a White House official confirmed to the BBC that special envoy to Ukraine Keith Kellogg would leave his post in January.He reportedly decided that this would be a natural end to his time in the post, which requires Senate approval beyond 360 days.Kellogg has been seen as an important advocate for Ukraine in the White House during a time when Trump has often appeared to side with Russia in the conflict. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military officials in Kyiv as Europe warns against reported Russia peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d658/live/eea590e0-c5f6-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T11:55:36.000Z",
      "dateModified": "2025-11-20T11:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bridget Phillipson: We will take time to get trans guidance right",
    "url": "https://www.bbc.com/news/articles/cy0y07959djo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ce8/live/bf0de7d0-c5fe-11f0-9c13-f920cfeeae8d.jpg",
    "tag": "Trending",
    "date": "2025-11-20T11:54:31.000Z",
    "description": "32 minutes agoKate WhannelPolitical reporterEducation Secretary Bridget Phillipson has said the government is \"taking the time to get this right\" befo",
    "body": "32 minutes agoKate WhannelPolitical reporterEducation Secretary Bridget Phillipson has said the government is \"taking the time to get this right\" before implementing guidance on the use of single-sex spaces by trans people.The Times has reported that the final guidance, sent to ministers nearly three months ago, would allow places such as hospitals and gyms to question transgender women over whether they should be using single-sex services based on how they look. Phillipson said she would consider the code of practice \"thoroughly and carefully\".She added that it was important to make sure women had access to single-service provisions such as rape crisis centres while ensuring that trans people are treated with \"dignity and respect\". The 300-page document was drawn up the Equality and Human Rights Commission (EHRC) chaired by Baroness Falkner after the Supreme Court unanimously ruled that legally a woman should be defined by biological sex. The EHRC has to provide practical advice to businesses and services about how this should work in practice. It has previously said that single-sex spaces should only be open to people of the same biological sex, otherwise they cease to be single-sex areas. That would mean, for instance, that a trans woman – a biological male who identifies as a woman - would not be able to use women's toilets and changing rooms. Although they said they should offer transgender people suitable alternatives where possible.The EHRC has said transgender people, who are also protected by equalities law, should be treated with dignity and respect.According to the Times, the new guidance says that if there are concerns then decisions about access to spaces may need to be based on how someone looks. It also says that if a transgender person is excluded from a space, the organisation should consider alternatives and that it would not be proportionate to leave the person without essential services, such as toilets. The report says the guidance acknowledges that providing alternatives may not always be possible due to space constraints or cost and that determining someone's sex could be hindered by the fact there is \"no type of official record or document in the UK which provides reliable evidence of sex\".Last month, Baroness Falkner urged the government to speed up its approval of the new code, warning that some organisations were operating under old guidance, which had become unlawful in the light of the court's decision.Her new guidance can only gain legal force once it has been signed off by ministers and laid in Parliament for 40 days. Conservative shadow women and equalities minister Mims Davies has previously suggested Phillipson had chosen not to sign off the guidance because she did not want to damage her chances in the Labour Party deputy leadership election, which ended last month.A source close to Phillipson described the claim as \"utter nonsense\". Approving the guidance could be unpopular in some parts of the Labour Party.During the deputy leadership contest, Lucy Powell, who eventually beat Phillipson to the job, said \"I think we have got some of the language not right on this, and particularly around some of the guidance that's coming forward.\"Last month, 32 Labour MPs wrote to the EHRC arguing that the interim guidance it issued in April, would \"open the door to discrimination and harassment against trans people\". The interim guidance, which was published by the EHRC in April and withdrawn in October, is being challenged in the courts. During the hearing in the High Court, the lawyer, representing the government, suggested the interim guidance may have been too simplistic and that access to spaces such as toilets could be judged on a case-by-case basis.Speaking to Times Radio, Education minister Josh MacAllister said the government was working \"as fast as we can\" but that there was no deadline for reaching a decision. \"We want to get it right, and if we don't get it right it does risk putting this back into the courts and providing even greater uncertainty for people.\"Asked if the government was avoiding making a decision in the hope the issue would be forgotten about, he said that would be \"really bad politics... because the problem isn't going to go away\".\"These are massive issues... when you drill down into examples of how this might be applied, it has big implications for individuals, it has big implications for businesses and public services,\" he said.\"The guidance, as it's written, has implications for both how physical buildings are set up, but also how staff in those settings would need to determine and judge even whether somebody might look like a woman.\"And so we want to avoid being in a position where toilets are being policed by people.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bridget Phillipson: We will take time to get trans guidance right",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7ce8/live/bf0de7d0-c5fe-11f0-9c13-f920cfeeae8d.jpg"
      ],
      "datePublished": "2025-11-20T11:54:31.000Z",
      "dateModified": "2025-11-20T11:54:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs bill ordering release of Jeffrey Epstein files",
    "url": "https://www.bbc.com/news/articles/cly2y40lj5go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/860b/live/021006b0-c60b-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T12:20:13.000Z",
    "description": "Trump signs bill ordering US justice department to release Epstein files6 minutes agoSakshi Venkatraman and David Willis,North America correspondentWa",
    "body": "Trump signs bill ordering US justice department to release Epstein files6 minutes agoSakshi Venkatraman and David Willis,North America correspondentWatch: \"I'm all for it\", Trump says on calls to release Epstein filesUS President Donald Trump says he has approved a bill that orders the release of government files on the late convicted sex offender Jeffrey Epstein - a significant turning point in a months-long fight over the documents.The justice department now has 30 days to publicly share all information from federal investigations into Epstein. However, it can withhold files that relate to active criminal investigations or are deemed to invade personal privacy.In a major reversal, Trump dropped his opposition to the measure last weekend,  after pushback from Epstein's victims and members of his own Republican Party.With his support, the resolution overwhelmingly cleared both chambers of Congress.Until recently, Trump had dismissed the need to release the documents, calling it a Democrat-led \"hoax\" to \"deflect\" attention away from his party's work. That position was itself a change from the stance he took ahead of the 2024 election.\"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he wrote.Although a congressional vote was not required to release the files - Trump could have ordered the release on his own - lawmakers in the House passed the legislation with a 427-1 vote. The Senate gave unanimous consent to pass it upon its arrival, sending the bill to Trump for his signature. The lone vote against the resolution in the House, the lower chamber, was cast by Louisiana Republican Clay Higgins, who objected to the scope of information that could be released. He said it could reveal and threaten \"thousands of innocent people\" who may have talked to investigators about allegations against Epstein.Under the law now signed by Trump, Attorney General Pam Bondi must release the documents within 30 days.The files subject to release are from criminal investigations into Epstein, including transcripts of interviews with victims and witnesses, and items seized in raids of his properties. Those materials include internal justice department communications, flight logs, and people and entities connected to the late financier.But there are exceptions.The resolution allows the justice department to withhold any documents related to criminal investigations. After the estate documents were released last week, Trump said he would ask Bondi to investigate Epstein's ties to people who had apparently communicated with him. Bondi promptly said the justice department \"will pursue this with urgency and integrity\".One of the bill's architects, Republican Congressman Thomas Massie, said he had worries that the move would lead to some federal files being withheld.\"I'm concerned that [Trump is] opening a flurry of investigations, and I believe they may be trying to use those investigations as a predicate for not releasing the files. That's my concern,\" he said.Bondi can also withhold information that may identify victims, leading many to speculate that parts of the files will be redacted - although it remains unclear how heavy the redacting could be.White House: Epstein story 'a manufactured hoax'Trump had promised during his 2024 presidential campaign to make the files public, and early in the year his administration released thousands of pages of documents from the Epstein investigation, mostly flight logs. While Trump said more documents were coming, Bondi later announced in July there would be no further releases.That prompted lawmakers from both parties to introduce the resolution compelling the files' release. One of the resolution's key proponents was Republican Representative Marjorie Taylor Greene, one of Trump's fiercest political allies. She has publicly fought with Trump in recent weeks, as the US president maintained his opposition to the resolution up to a few days before the vote.After the resolution passed, Greene posted to say that she would read the name of any powerful person implicated in any released files aloud on the House floor.The anticipated files are different to the more than 20,000 pages of documents from Epstein's estate released by Congress last week, including some that mention Trump.Those include 2018 messages from Epstein in which he said of Trump: \"I am the one able to take him down\" and \"I know how dirty donald is\".Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.Speaking to reporters on Monday night, Trump said Republicans had \"nothing to do with Epstein\".\"It's really a Democrat problem,\" he said. \"The Democrats were Epstein's friends, all of them.\"The family of Virginia Giuffre, who died by suicide earlier this year, said in a statement Trump signing the bill was \"nothing short of monumental\", for Giuffre and other survivors. \"As we look towards the next chapter, we remain vigilant. This work is not finished. Every name must be revealed, regardless of power, wealth, or party affiliation,\" her brother and sister-in-law, Sky and Amanda Roberts, said.Epstein was found dead in 2019 in his New York prison cell in what a coroner ruled was a suicide. He was being held on charges of sex trafficking. He had been convicted previously of soliciting prostitution from a minor in 2008.The once high-flying financier had ties with a number of high-profile figures, including Andrew Mountbatten Windsor, the brother of King Charles and former prince; Trump; Trump's former advisor Steve Bannon; and a cast of other characters from the world of media, politics and entertainment.On Wednesday, former Harvard president Larry Summers took a leave from teaching at the university while the school investigated his links to Epstein, revealed in a series of chummy email exchanges.  Watch: Moment House passes bill to release Epstein files",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs bill ordering release of Jeffrey Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/860b/live/021006b0-c60b-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T12:20:13.000Z",
      "dateModified": "2025-11-20T12:20:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yantar: How serious is the Russian spy ship move?",
    "url": "https://www.bbc.com/news/articles/c4gpgj6d4e6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ed5/live/4f155cd0-c5e8-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-19T22:42:44.000Z",
    "description": "14 hours agoFrank GardnerSecurity correspondentRoyal Navy/ PAThe Royal Navy tracking the Russian ship Yantar in November 2024To Russia, the Yantar is ",
    "body": "14 hours agoFrank GardnerSecurity correspondentRoyal Navy/ PAThe Royal Navy tracking the Russian ship Yantar in November 2024To Russia, the Yantar is an oceanic research vessel - to others, including the UK, it's a spy ship, and a worry for Britain's defence chiefs.The vessel has long been suspected of secretly mapping out Britain's undersea cables, where more than 90% of our data, including billions of dollars of financial transactions, are transferred.But now, a new escalation, with revelations the Yantar's sailors targeted Royal Air Force pilots in patrol planes with lasers.Shining lasers into a pilot's eyes is provocative, and to use the Defence Secretary John Healey's words, \"deeply dangerous\". It's illegal in the UK and can lead to a prison sentence.Healey's direct message to Russia and its leader Vladimir Putin was stark: \"We see you. We know what you're doing. And if the Yantar travels south this week, we are ready.\" By that, he is implying should the Yantar cross inside Britain's 12-mile maritime boundary there would be a military response.This isn't the first time the Yantar has popped up near Britain's shores - at the start of the year a Royal Navy submarine made the highly unusual move to surface right in front of the ship as a sort of deterrent measure.The concern is that this is part of an ongoing operation by the Kremlin to locate and map all the vital undersea cables and pipelines that connect the UK to the rest of the world.It is also part of a wider pattern of Russian activity, as it tests Nato's reactions, resolve and defences. We've seen similar moves with the recent drone incursions across Europe, and Russian warplanes flying into Nato airspace.When three Russian fighter jets entered Estonian skies without permission in September, Italy, Finland and Sweden scrambled jets under Nato's mission to bolster its eastern flank. This is all interesting intel for Russia.Ministry of DefenceAs an island nation, Britain is heavily reliant on its network of undersea cables that carry data. There are also vital oil and gas pipelines connecting Britain to North Sea neighbours such as Norway. These cables and pipes are largely undefended and apparently of great interest to Russia's research vessels.Nato has identified deep-sea cables as part of the world's critical infrastructure. But they are also strategic pressure points, it says, warning that adversaries could exploit them through sabotage or hybrid warfare, threatening both civilian and military communications.Retired Royal Navy Commander Tom Sharpe made clear what the spy ship could be doing: \"The most obvious one is they sit above our cables and our critical undersea infrastructure and they nose around in the cables that transfer up to $7tn worth of financial transactions every day between us and America alone\".SPUTNIK/KREMLIN/EPA/ShutterstockPutin gave little away while he visited an AI conference in Moscow on WednesdayThe Yantar may be described by Moscow as a research vessel, but it is part of Russia's secretive Main Directorate for Deep Sea Research, or GUGI, which reports directly to the defence ministry.And while the ship bristles with hi-tech communications equipment, it's what we can't see that is of most concern.It can operate remotely-piloted miniature submarines that can dive down to sea beds many thousands of metres below the surface. These are capable of mapping the locations of cables, cutting them or planting sabotage devices that could, potentially, be activated in a time of war.The Royal Navy is experimenting with various means of combating the threat, such as a new vessel called Proteus, but critics fear much of the damage to Britain's coastal security may already have been done.Any foreign vessel operating in British waters must comply with UK national laws and international maritime conventions.The cornerstone of these complex rules is the UN Convention on the Law of The Sea (UNCLOS). This allows foreign ships to navigate through coastal waters provided that their passage is \"innocent\" - meaning it doesn't threaten the peace or security of a coastal nation like Britain.President Putin was at an AI conference in Moscow on Wednesday, and gave no immediate reaction on the situation unfolding north of Scotland.Russia's Embassy in London says it's not undermining UK security and it has condemned UK Defence Secretary Healey's statement as provocative. But all this is happening while war rages in Ukraine, a conflict Putin blames on the West and which seemingly he has no intention of stopping soon. Additional reporting by Tiffany Wertheimer and Stuart HughesMore on this story:",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yantar: How serious is the Russian spy ship move?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ed5/live/4f155cd0-c5e8-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-19T22:42:44.000Z",
      "dateModified": "2025-11-19T22:42:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford boss Lisa Brankin warns against taxing electric cars",
    "url": "https://www.bbc.com/news/articles/c5yp1ky55g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f8df/live/6918b4f0-c5fd-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T00:03:09.000Z",
    "description": "Ford boss: 'Now is not the time to tax electric vehicles'12 hours agoJosh Martin,business reporter and Sean Farrington,business presenterFord UK boss ",
    "body": "Ford boss: 'Now is not the time to tax electric vehicles'12 hours agoJosh Martin,business reporter and Sean Farrington,business presenterFord UK boss says 'now is not the time' for pay-per-mile tax on electric vehiclesTaxes on electric vehicles may put drivers off buying them at a time when demand has \"lost momentum\", Ford's UK boss has warned.It comes after the BBC reported Chancellor Rachel Reeves could be considering new levies on EVs in the upcoming Budget.Ford UK's managing director Lisa Brankin told the BBC: \"It's certainly not the right time to do it.\"A Treasury spokesperson said: \"Fuel duty covers petrol and diesel, but there's no equivalent for electric vehicles. We want a fairer system for all drivers.\"The chancellor has been reported to be considering a new pay-per-mile charge for electric vehicles from 2028.Ms Brankin told the BBC's Big Boss Interview podcast: \"That [policy], in the face of really fragile demand for electric vehicles, is just another brake.\"The admin task of calculating their mileage would put potential EV owners off making the switch, she says.\"It's really easy to sell people things they want,\" she says. \"It's hard to sell people things they don't want. \"Electric vehicles in some instances have gone from being a great thing to being something that we're trying to push people into.\"ReutersThe chancellor has been reported to be considering a new pay-per-mile charge for electric vehiclesFord sells the UK's most popular vehicle, the Ford Puma, while its commercial van the Transit holds the second-most-sold ranking.For years its Focus model was the UK's most-popular, but the US company axed the hatchback and the last Ford Focus rolled off factory lines in Germany last week.It employs around 6,000 people in the UK, with an engine plant in Dagenham and a transmission factory in Halewood. It hasn't manufactured a vehicle here since 2013.Like other car makers Ford is under pressure to meet the UK's net zero plan, part of which says 80% of new car sales must be EVs by 2030 or face fines. The government has reinstated a grant worth up to £3,750 to encourage drivers to buy electric vehicles.Ford would not be able to reach that 80% target without government help, such as the grant, Ms Brankin said.Sales figures from car industry body, the Society of Motor Manufacturers and Traders (SMMT) show how far car makers have to go to reach the target.Fully-electric vehicles made up around 22.4% of total new car sales, data for 2025 up to 31 October shows. This time last year it was 18.1%.In September, the UK new car market experienced its best performance since 2020, driven by a surge in EV sales which hit a record high, according to SMMT figures.However, Ms Brankin pointed to heavy discounting across car sales forecourts as well as a lower resale value in the second-hand EV market as indicators that the market was \"distorted\".\"When that [target] was set a number of years ago, the outlook for demand around electric vehicles was buoyant and there seemed to be momentum behind electric vehicles. What we're seeing now is that customer demand is not in line with that ambition,\" Ms Brankin said.A large share of new EVs are sold to businesses for their employees and they benefit from lower rates of \"company car tax\" compared with diesel or petrol-fuelled options. Ms Brankin has urged the chancellor to retain this tax benefit of companies \"greening\" their vehicle fleets.The shift to EVs could have consequences for the nearly 1,800 staff at the Ford diesel engine plant in Dagenham, which was the largest car factory in Europe when it was first built.Ms Brankin said Ford was yet to make any decisions about the future of the plant, which will build diesel engines up until 2030.\"We're working really hard on what the next life of Dagenham looks like,\" she said, but there was \"nothing that we've settled on at the moment\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford boss Lisa Brankin warns against taxing electric cars",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f8df/live/6918b4f0-c5fd-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T00:03:09.000Z",
      "dateModified": "2025-11-20T00:03:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]