[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mkwyjd?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-01T19:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·01 Dec 2025,·30 minsAmericanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast?AmericastAvailable for over a yearDonald Trump has warned that US efforts to halt Venezuelan drug trafficking \"by land\" would begin \"very soon\". But what’s actually happening off the coast of Venezuela, and why is Trump calling for Venezuela’s airspace to be closed? \nAnd, the president said he would \"permanently pause migration\" to the US from all \"third-world countries\" after an attack on National Guard members last week. Could this heighten immigration tensions in the US? \nPlus, as we return from Thanksgiving break - the busiest travel day in the US calendar - why is Transportation Secretary Sean Duffy launching a campaign to bring ‘civility and manners’ back to plane travel in the US? \nMatt Chorley, Justin, Sarah and Anthony are back to answer your questions on BBC Radio 5 Live…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray with Alix Pickles and Grace Reeve. The technical producer was Dafydd Evans. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-01T19:12:00.000Z",
      "dateModified": "2025-12-01T19:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Jury’s (Kind Of) Out - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0ml4rh7?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-02T19:52:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·02 Dec 2025,·38 minsAvailable for over a yearToday, David Lammy has confirmed plans to get rid of jury trials for crimes with sentences of less than three years.\nThe reforms to the justice system include creating \"swift courts\" under the government's plan to tackle unprecedented delays in the court system. Serious offences including murder, robbery and rape will still go before a jury. Lammy has said the reforms were “bold” but “necessary”. Adam is joined by home and legal correspondent Dominic Casciani.\nAnd, amidst all the noise around last week’s budget you may have missed the Prime Ministers suggestion that he will accept all the recomendations made in a report that criticised the UK’s nuclear power industry as expensive and “overly complex”. \nThe man who wrote it, John Fingleton tells Adam about what he found and what he thinks it tells us about the UK’s approach to regulation. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Anna Harris and Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Ricardo McCarthy. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Jury’s (Kind Of) Out - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-02T19:52:00.000Z",
      "dateModified": "2025-12-02T19:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sabrina Carpenter, Franklin the Turtle in tiff with Trump administration",
    "url": "https://www.bbc.com/news/articles/cy7v022n5kyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/be64/live/2ef60b00-cfcc-11f0-b5fb-03fb61693eba.jpg",
    "tag": "Trending",
    "date": "2025-12-02T18:25:31.000Z",
    "description": "7 hours agoMadeline GerberUsed by permission of Kids Can Press Ltd. TorontoFranklin the Turtle from the cover of Franklin in the Dark A young turtle f",
    "body": "7 hours agoMadeline GerberUsed by permission of Kids Can Press Ltd. TorontoFranklin the Turtle from the cover of Franklin in the Dark A young turtle from a Canadian children's book series is caught in an international feud after the US Defence Department used the character in a cartoon about killing alleged drug traffickers.The publisher of \"Franklin the Turtle\" books is criticising Secretary of Defence Pete Hegseth for a social media post depicting the beloved children's character shooting the alleged criminals.\"We strongly condemn any denigrating, violent, or unauthorized use of Franklin's name or image\", publisher Kids Can Press said. The publisher is not alone. Sabrina Carpenter lashed out at the White House on Tuesday for using her song in a video about deporting migrants, saying it was \"evil and disgusting\".\"Do not ever involve me or my music to benefit your inhumane agenda,\" the singer posted.In Franklin's case, the cartoon posted by Hegseth on social media is a mock book cover depicting Franklin in a military helicopter firing a large weapon at alleged drug boats. The faux title reads: \"Franklin Targets Narco Terrorists.\"Getty ImagesThe image comes amid a string of US strikes on alleged Venezuelan drug boats since early September. The Trump administration says it is acting in self-defence by attacking boats carrying illicit drugs to the US.Hegseth captioned the post: \"For your Christmas wish list...\"Franklin, the 6-year-old cartoon turtle, is known for navigating everyday challenges, from learning to ride a bike to having his first sleepover.He originated as the titular character in the Canadian children's book \"Franklin the Turtle\" and has grown to star in a number of television shows, films, video games and live productions.\"Franklin the Turtle is a beloved Canadian icon who has inspired generations of children and stands for kindness, empathy, and inclusivity,\" publisher Kids Can Press said in its statement, adding that such a violent depiction \"directly contradicts these values\".Chief Pentagon spokesperson Sean Parnell said in a statement on Monday night that \"We doubt Franklin the Turtle wants to be inclusive of drug cartels... or laud the kindness and empathy of narco-terrorists\".The artists credited with creating Franklin and authoring his books did not respond to requests from the BBC for comment.In September, Pokémon said it did not give permission for the use of its theme song and other footage to be used in an ICE deportation raid video posted by the US government.British singer Jess Glynne also criticised White House officials in July after they used a viral Jet2holiday advert featuring her song in a video promoting deportations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sabrina Carpenter, Franklin the Turtle in tiff with Trump administration",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/be64/live/2ef60b00-cfcc-11f0-b5fb-03fb61693eba.jpg"
      ],
      "datePublished": "2025-12-02T18:25:31.000Z",
      "dateModified": "2025-12-02T18:25:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trans girls banned from joining Girlguiding",
    "url": "https://www.bbc.com/news/articles/cz7n921wyzvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e940/live/5f3af090-cfaf-11f0-b476-4d01662cfb69.jpg",
    "tag": "Trending",
    "date": "2025-12-02T19:07:03.000Z",
    "description": "Trans girls can no longer join Girlguiding, organisation says6 hours agoJames MelleySenior Social Affair ProducerAlamyGirlguiding is responsible for y",
    "body": "Trans girls can no longer join Girlguiding, organisation says6 hours agoJames MelleySenior Social Affair ProducerAlamyGirlguiding is responsible for youth girl groups including Brownies and GuidesThe organisation that oversees girl guide groups in the UK has announced it is banning trans girls from joining.Girlguiding said the move – which means it will not accept biological boys who identify as girls - was in response to the Supreme Court ruling earlier this year that said sex meant biological sex in equality law.The trustees said they had made the \"difficult decision\" with a \"heavy heart\" and there would be further announcements on what this will mean for current members.Trans rights organisation TransActual said: \"There is no problem being solved here, only harm being done.\" Women's rights charity Sex Matters said Girlguiding had done the \"right thing\" in making the change. Around 385,000 girls and young women between the ages of four and 18 take part in Rainbows, Brownies, Guides and Rangers groups around the UK.Girlguiding said: \"From today (2 December) trans girls and young women, and others not recorded female at birth, will no longer be able to join Girlguiding as new young members.\"Girlguiding said there would be no immediate changes for young members, but more information would be shared next week. It is not clear how many people the rule change will directly affect, as the organisation says it does not collect data on gender identity.\"This is a decision we would have preferred not to make, and we know that this may be upsetting for members of our community,\" the trustees said. \"Girlguiding believes strongly in inclusion, and we will continue to support young people and adults in marginalised groups.\"In UK law, the 2010 Equality Act sets out the rules for single sex organisations and spaces being able to exclude members of the opposite sex.In April, the Supreme Court ruled that this meant biological sex, meaning, for example, that a trans man could be excluded from a service set up for men.Draft guidelines on how to interpret the law by the equality watchdog, the Equality and Human Rights Commission (EHRC), were presented to the government for consideration in September. A leaked copy was reported on last week, but it has not been officially published.Girlguiding said it has made its decision following consultation with members and legal advice. It will now allow only biologically female members to join.It said: \"Girlguiding's governing charity documents set out that the membership and people who benefit from our organisation are girls and women.\"The organisation was reportedly facing legal action from a parent who felt it was failing to follow the law.Biological girls who identify as boys are still able to join. The organisation also said most adult roles were already open to all and it was \"confident that no volunteers will have to leave\". Other adult roles are already designated specifically as female roles.Reacting to the decision, Sex Matter's CEO Maya Forstater said Girlguiding had done the \"right and only thing for it to do\".\"Both girls and boys deserve to have opportunities for adventure and learning, and Girlguiding provides an organisation that is just for girls.\"Tammy Hymas, from trans rights campaigners TransActual, said: \"It's awful that an organisation, which would happily be inclusive and has been for many years, is being forced to exclude young trans girls\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trans girls banned from joining Girlguiding",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e940/live/5f3af090-cfaf-11f0-b476-4d01662cfb69.jpg"
      ],
      "datePublished": "2025-12-02T19:07:03.000Z",
      "dateModified": "2025-12-02T19:07:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'No justice' over Hillsborough and 'Holly's guilt over crash'",
    "url": "https://www.bbc.com/news/articles/cev8dw00enxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6a01/live/b3afc430-cfe0-11f0-9fb5-5f3a3703a365.png",
    "tag": "Trending",
    "date": "2025-12-03T00:52:54.000Z",
    "description": "10 minutes ago\"No justice\" exclaims the Daily Mirror after a report into the 1989 Hillsborough disaster was published, which it says leaves \"police sh",
    "body": "10 minutes ago\"No justice\" exclaims the Daily Mirror after a report into the 1989 Hillsborough disaster was published, which it says leaves \"police shame\". Not one officer of 12 that could have faced gross misconduct charges over the stadium crush that killed 97 will do so as they have all retired, it writes. The Mirror is also among several papers to feature a photo of television presenter Holly Willoughby on its front page after she pleaded guilty to \"driving without care\" and was fined £1,653.The i Paper echoes the Mirror with a headline reading \"Still no justice\", after 36 years of investigations. It features photographs of all 97 victims of the disaster in a grid,  saying lives were lost after \"failures\" on the day - citing the latest inquiry's findings.The Guardian quotes families of those that died in the Hillsborourgh disaster as saying that it is \"a bitter injustice\" that no officers will face proceedings. Also on the front page, the Guardian reports Vladimir Putin made \"hard-edged remarks\" before meeting US officials for talks over the Ukraine war by saying that \"Russia does not intend to fight Europe, but if Europe starts, we are ready right now\". The paper also highlights criticism from MPs that the handling of the China spy case was \"shambolic\".A photo of Sarah Everard, who was abducted, raped and murdered by police officer Wayne Couzens in 2021, is splashed across the front page of the Daily Express. Her mother has spoken at an inquiry into her death as a new report warns \"more lives are at risk\" from violent sexual attacks on women and girls. There is \"no better time to act\", the Express adds, quoting the report.A warning from economists of \"low growth and higher bills\" leads the Times. The paper also features a photo of Sarah Everard as her mother says she continues to suffer \"sadness, rage and guilt\" more than four years after her murder.Sarah Everard's mother is \"still tormented by the horrors\" of her daughter's final hours, writes the Independent. The chair of the inquiry into her death is quoted by the paper as saying it is \"shocking\" that her police vetting recommendations are yet to be fully implemented after nearly two years.Metro headlines on Justice Secretary David Lammy's decision to end jury trials for thousands with a headline reading \"the jury's out\". MPs \"from all sides\" have \"railed\" against the call according to Metro, which Lammy made to cut a backlog of 80,000 cases.Reform UK leader Nigel Farage has told party donors that he expects a \"deal or merger\" with the Conservatives before the next election, according to the Financial Times. This \"suggests he believes he cannot sweep to power alone\", it writes. In Russia, US special envoy Steve Witkoff has been in talks with Russian President Vladimir Putin. The discussions, at a large white table, are shown on the FT's front.The Daily Telegraph continues to focus on questions over whether the chancellor may have misled the public over the state of the UK's finances before the Budget. It reports senior figures at the Office for Budget Responsibility said Treasury permanent secretary James Bowler - the department's top civil servant - approved the publication of a letter showing the chancellor knew \"the financial hole was smaller than previously thought\".Royal rents are \"under fire\" as \"cut-price\", writes the Daily Mail. Following the scandal of Andrew Mountbatten-Windsor's peppercorn rent of Royal Lodge, now MPs will \"scrutinise deals enjoyed by Sophie, Edward and Princess Alexandra\", it reports.The Daily Star focuses on the Holly Willoughby court case. The paper reports the TV presenter collided with man on a scooter near her home in London, who was knocked to the ground and sustained a fracture to his neck.For the Sun, it is the \"great game robbery\" as it says tickets at the World Cup in the US, Canada and Mexico next year will be \"the most expensive ever seen\". Fifa has \"grabbed\" a share of the resale market and tickets are already going for £1,000, it reports. Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'No justice' over Hillsborough and 'Holly's guilt over crash'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6a01/live/b3afc430-cfe0-11f0-9fb5-5f3a3703a365.png"
      ],
      "datePublished": "2025-12-03T00:52:54.000Z",
      "dateModified": "2025-12-03T00:52:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rare Fabergé egg fetches record £22.9m at London auction",
    "url": "https://www.bbc.com/news/articles/cg7v24m1leyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/abaa/live/5cc8b3e0-cfb6-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-02T20:16:22.000Z",
    "description": "A diamond-studded crystal Fabergé egg that once belonged to Russia's imperial family has sold for a record £22.9m ($30.2m) in London.The Winter Egg - ",
    "body": "A diamond-studded crystal Fabergé egg that once belonged to Russia's imperial family has sold for a record £22.9m ($30.2m) in London.The Winter Egg - considered one of the legendary jeweller's most beautiful creations - was bought by an anonymous bidder on Tuesday, Christie's auction house said.It is decorated with 4,500 diamonds was commissioned by Tsar Nicholas II in 1913 as a present to his mother.The previous record for a Fabergé egg was £8.9m paid at auction in 2007.\"Today's result sets a new world auction record for a work by Fabergé, reaffirming the enduring significance of this masterpiece,\" Christie's Margo Oganesian was quoted as saying by the AFP news agency.The 8.2cm high (3.2in) egg was created by Carl Fabergé, based on the design of Alma Theresia Pihl, one of only two female workmasters at St Petersburg's jewellery company.It was carved from rock crystal and decorated with rose-cut diamonds, as well as platinum snowflake motifs. The egg opens up to reveal a tiny basket of white quartz flowers inside. The Fabergé house only ever made 50 eggs for Russia's imperial Romanov family, and the Imperial Winter Egg is one of just seven left in private hands. The others are either missing or owned by institutions or museums.The eggs were made from 1885 until Tsar Nicholas II was forced to abdicate in 1917.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare Fabergé egg fetches record £22.9m at London auction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/abaa/live/5cc8b3e0-cfb6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-02T20:16:22.000Z",
      "dateModified": "2025-12-02T20:16:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Holly Willoughby fined £1,600 for careless driving",
    "url": "https://www.bbc.com/news/articles/cq5qw1dve46o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dea2/live/3b5089a0-cfa6-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-02T18:13:32.000Z",
    "description": "TV presenter Holly Willoughby has been fined more than £1,600 after admitting to careless driving.The 44-year-old drove her Mini Cooper without due ca",
    "body": "TV presenter Holly Willoughby has been fined more than £1,600 after admitting to careless driving.The 44-year-old drove her Mini Cooper without due care and attention near her home in Richmond, south-west London, on 28 August.At Lavender Hill Magistrates' Court, Willoughby was fined £1,653, which is to be paid within 14 days, and given six points on her licence.She did not attend her court hearing and pleaded guilty by post.The presenter is best known for previously fronting ITV's daytime show This Morning, which she left in October 2023, and Dancing On Ice.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Holly Willoughby fined £1,600 for careless driving",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dea2/live/3b5089a0-cfa6-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-02T18:13:32.000Z",
      "dateModified": "2025-12-02T18:13:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "National Guard shooting suspect charged with murder",
    "url": "https://www.bbc.com/news/articles/cwyl70z3940o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a67/live/a6ef8f70-cfc5-11f0-9fb5-5f3a3703a365.png",
    "tag": "Trending",
    "date": "2025-12-02T21:30:33.000Z",
    "description": "3 hours agoKwasi Gyamfi AsieduWashingtonReutersSarah Beckstrom, 20, died from her injuries, while the other officer Andrew Wolfe, 24, was critically i",
    "body": "3 hours agoKwasi Gyamfi AsieduWashingtonReutersSarah Beckstrom, 20, died from her injuries, while the other officer Andrew Wolfe, 24, was critically injured and remains in hospitalProsecutors officially filed murder charges against the suspected shooter accused of killing one National Guard soldier and injuring another in Washington DC last Wednesday.According to a criminal complaint, Rahmanullah Lakanwal shouted \"Allahu Akbar\" as he fired and was reloading after a Guard member shot and wounded him.  Lakanwal, who came to the US from Afghanistan in 2021, pleaded not guilty during a virtual court appearance from a hospital bed, the BBC's US partner CBS reported. Charges against him include first-degree murder and assault with intent to kill.The Trump administration paused all asylum decisions following the shooting and ordered a review of Afghan refugees in the US.National Guard member Sarah Beckstrom, 20, died from her injuries, while the other officer Andrew Wolfe, 24, was critically injured and remains in hospital. Both were on assignment in the US capital from West Virginia. The charging complaint, which includes photos from security-camera footage, lays out what prosecutors say happened last Wednesday near an underground train station while Beckstrom and Wolfe were on patrol with other National Guard troops. The pair were dressed in military uniforms a few blocks from the White House at about 2:15 p.m. talking to two other Guard members when gunfire erupted. A supervisor heard gunshots and saw Wolfe and Beckstrom collapse. He \"immediately pulled his service weapon and engaged the defendant\", the complaint says.  \"During the subsequent gunfight, the defendant was shot and fell to the ground.\"The supervisor said the shooter stopped firing and was trying to reload when another Guard member jumped on him, and Secret Service officers helped subdue the suspect, the complaint says.Both Wolfe and Beckstrom had been shot in the head and were rushed to hospital.  Beckstrom died the next day. An autopsy found the cause of death was a gunshot wound to the back of her head and the manner of death \"homicide\".ReutersFile photo: Rahmanullah LakanwalWest Virginia Governor Patrick Morrisey on Monday described Wolfe's condition as \"positive\" and said he responded to prompts from a nurse. Morrisey also asked for prayers \"as Andrew fights to survive.\"A judge said the case against Lakanwal was \"exceedingly strong\", according to CBS, and ordered him held without bond.Lakanwal worked with the CIA in Afghanistan and fled to the US after the Taliban overthrew the civilian government in 2021. US officials feared people like Lankanwal would be targeted by the Taliban because of their connections to US forces.Officials told CBS his 2024 asylum request was granted earlier this year and he lived in Bellingham, Washington state with his wife and five children. Lakanwal became withdrawn from society and isolated in a room for weeks, according to emails from a social worker last year who said they thought he had mental health illness.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "National Guard shooting suspect charged with murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2a67/live/a6ef8f70-cfc5-11f0-9fb5-5f3a3703a365.png"
      ],
      "datePublished": "2025-12-02T21:30:33.000Z",
      "dateModified": "2025-12-02T21:30:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cyclone Ditwah: Flood catastrophe awakens volunteerism in Sri Lanka",
    "url": "https://www.bbc.com/news/articles/c058n10727po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/207d/live/525cf3a0-cfe1-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-03T00:34:05.000Z",
    "description": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit29 minutes agoIshara Danasekara,News Editor, BBC News Sinhala,BBC SinhalaandKoh EweWatch: Sri",
    "body": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit29 minutes agoIshara Danasekara,News Editor, BBC News Sinhala,BBC SinhalaandKoh EweWatch: Sri Lankan communities under water after catastrophic floodingSri Lankan actor and musician GK Reginold rides a motorised fishing boat through Colombo's suburbs, hoping to bring food and water to those in desperate need.Some of the families, Mr Reginold says, have not received aid for days, isolated by the South Asian island nation's worst weather disaster in recent years.Cyclone Ditwah lashed the country last week, bringing catastrophic floods and landslides that killed more than 460 people, left hundreds missing and damaged some 30,000 homes.But the deluge has also inspired volunteerism among its people, as they face what their president has described as the \"most challenging natural disaster\" in its history.\"The main reason why I wanted to do this, is to at least help them to have one meal,\" Mr Reginold tells the BBC. \"And I was so happy that I was able to do that.\"BBC SinhalaVolunteers have been taking fishing boats out to rescue flood victims and deliver aidMore than one million people have been affected by the disaster and President Anura Kumara Dissanayake has declared a state of emergency.Sri Lanka's military has deployed helicopters for rescue operations, while humanitarian aid is flowing in from foreign governments and non-governmental organisations.But it will be a long journey to recovery for Sri Lanka, which has seen its fair share of turmoil in recent years.Activists volunteer in community kitchenIn Colombo's Wijerama neighbourhood, activists who protested against former president Gotabaya Rajapaksa in 2022 are now helping run a community kitchen that churns out food aid.The protests from three years ago were fuelled by a spiralling economic crisis that caused shortages of fuel, food and medicine. Public anger exploded and led to Rajapaksa being ousted. Now, that political activism is being channelled to cyclone relief.\"Some volunteers came after work, some took turns and some even took leave to be there,\" Sasindu Sahan Tharaka, a social media activist, tells the BBC.\"We reactivated the group as soon as we heard what was happening last Thursday,\" he says.Sasindu Sahan TharakaAt a community kitchen in Wijerama, volunteers prepare meals for flood-affected residentsMr Sahan also considers the kitchen as an \"extension\" of his volunteer work in 2016, when torrential rain and floods killed 250 people across the country.Volunteers have compiled hundreds of requests for help, sent it to authorities, and organised the distribution of food to residents, Mr Sahan says.\"Whatever we asked for, we got more than enough in response from the community,\" he says.Online campaigns for aidA flurry of activity is also happening online, where social media users have created a public database to direct donations and volunteers.Another volunteer-backed website helps donor find relief camps and what is most needed in those areas.Private companies have organised donation drives, while local television channels have launched an effort to provide food and basic necessities like soap and toothbrushes.Facing criticism over his handling of preparations for Cyclone Ditwah, President Dissanayake has urged Sri Lankans to \"set aside all political differences\" and \"come together to rebuild the nation\".Opposition politicians have accused authorities of ignoring weather warnings, which they say exacerbated the disaster's impact.On Monday, opposition lawmakers staged a walkout in parliament, claiming that the ruling party was trying to limit debate on the disaster.On the ground, however, there remains a sense of unity as Sri Lankans pick up the pieces after the floods.\"In the end, the joy of helping someone else to save lives makes that tiredness fade,\" Mr Sahan wrote in a Facebook post on Monday, after putting in long hours at the community kitchen in Wijerama and other relief sites.\"Disasters are not new to us. But, the empathy and capacity of our hearts is greater than the destruction that occurs during a disaster.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cyclone Ditwah: Flood catastrophe awakens volunteerism in Sri Lanka",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/207d/live/525cf3a0-cfe1-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T00:34:05.000Z",
      "dateModified": "2025-12-03T00:34:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cost of unregistered children's care homes a 'national scandal' - Ofsted",
    "url": "https://www.bbc.com/news/articles/cqjg42zwx99o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2dd6/live/40f82af0-cfa3-11f0-a7ae-216dd0212f3b.jpg",
    "tag": "Trending",
    "date": "2025-12-02T17:09:25.000Z",
    "description": "8 hours agoKristian JohnsonMomentoJpegOfsted warns unregistered care homes can sometimes charge \"exorbitant fees\"Nine in 10 councils across England ar",
    "body": "8 hours agoKristian JohnsonMomentoJpegOfsted warns unregistered care homes can sometimes charge \"exorbitant fees\"Nine in 10 councils across England are placing children in unregistered homes which can charge up to £30,000 a week per child.The findings, published in Ofsted's annual report, describe how local authorities often cannot find places in registered homes to cater for children's needs, despite the number of care homes being at a record high.Ofsted chief inspector Sir Martyn Oliver described the situation as an \"ongoing national scandal\".The Children's Homes Association (CHA), which represents residential childcare providers, said there is no clear national plan and that it is up to the government to \"fix the system\".There were 4,010 registered children's care homes across England in 2024/25 - a 15 per cent rise since the year before and the highest on record.But Ofsted said there is an \"ongoing imbalance\" as some providers choose to open care homes where houses are cheaper, regardless of the local demand. Twenty six per cent of children's homes are in the north west of England, but only 18 per cent of looked-after children live in the region.Sir Martyn says this \"strong profit motive... bends the system out of shape\".\"The rapid growth in the number of homes masks very significant problems with location, affordability and suitability,\" he added.According to Ofsted, the lack of available places in legitimate settings has led to a shadow market of illegal care homes which charge \"exorbitant fees\".In the past year, Ofsted launched 870 investigations into these settings, with 680 found to be unregistered.It is a criminal offence for providers to operate a home without registration.Currently, Ofsted can only issue warning letters and does not have the power to issues fines.However, this is expected to change under new legislation as part of the Children's Wellbeing and Schools Bill.Councils' overall spend on children in care homes has risen from £3.9bn in 2015-16 to £8.1bn in 2023-24.Sir Martyn described this as \"a crisis\", with council budgets unable to keep pace with the \"spiralling costs\" of children in care.\"The government must work with local authorities to drive out all use of unregistered children's homes,\" he said.A Local Government Association spokesperson said the \"astronomical cost\" of children's homes means there is less money to help children before they reach care.\"It is extremely concerning that in many cases, a lack of choice means provision is not fully meeting children's needs,\" it added.\"It is absolutely vital that the entire sector works together to ensure that we have enough homes that can meet children's needs. This includes central and local government, Ofsted, the NHS and providers in all sectors.\"CHA chief executive Dr Mark Kerr said unregistered homes are the result of a failed system and wants more government help for children with the most complex and high-risk needs.\"Those 'exorbitant fees' are the crash-landing of a system that hasn't been planned or funded properly,\" he said.\"If ministers want homes in different places, they need to change the planning rules, fix registration delays and set out a credible regional plan. At the moment, geography follows bureaucracy, not children's needs.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cost of unregistered children's care homes a 'national scandal' - Ofsted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2dd6/live/40f82af0-cfa3-11f0-a7ae-216dd0212f3b.jpg"
      ],
      "datePublished": "2025-12-02T17:09:25.000Z",
      "dateModified": "2025-12-02T17:09:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew Mountbatten-Windsor won't get money back from Royal Lodge",
    "url": "https://www.bbc.com/news/articles/c75vdxd517eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b93/live/e40fd180-cf84-11f0-9de2-29260ccbfaf5.jpg",
    "tag": "Trending",
    "date": "2025-12-02T16:01:05.000Z",
    "description": "Andrew won't get any money back after Royal Lodge move9 hours agoSean CoughlanRoyal correspondentPA MediaAndrew Mountbatten-Windsor is expected to lea",
    "body": "Andrew won't get any money back after Royal Lodge move9 hours agoSean CoughlanRoyal correspondentPA MediaAndrew Mountbatten-Windsor is expected to leave Royal Lodge next yearAndrew Mountbatten-Windsor is unlikely to receive any compensation upon leaving Royal Lodge in Windsor, according to information published by the Public Accounts Committee.As part of his leasing arrangement, Andrew could have been entitled to £488,000 for an early surrender of his 75-year lease.But a report from the Crown Estate for MPs on the public spending watchdog says that the property is so dilapidated and in need of repairs that in \"all likelihood\" Andrew \"will not be owed any compensation\".There will now be an MPs' inquiry launched into the Crown Estate and its royal leases, says committee chair, Sir Geoffrey Clifton-Brown.Sir Geoffrey said the information from the Crown Estate \"clearly forms the beginnings of a basis for an inquiry\" which will begin next year and will consider the Crown Estate and property leases with the Royal Family.It is not known yet whether Andrew Mountbatten-Windsor will be called to give evidence.ShutterstockPrince Andrew had a 75-year lease on Royal Lodge on the Windsor estateThe information supplied by the Crown Estate also showed Andrew handed in his notice on the property on 30 October, the day it had been announced he had lost his titles.He gave a year's notice, so could stay for another 10 months, but it has been expected that he will move from Royal Lodge to Sandringham in Norfolk early next year.There was also evidence that Andrew still had a lease on part of his former home at Sunninghill Park in Berkshire, with the Crown Estate saying he was still the leaseholder of East Lodge, which has a separate lease from the main house, which Andrew sold in 2007.The East Lodge was said by the Crown Estate to have been leased by Andrew for a \"member of staff\".MPs on the cross-party committee had wanted to know the details of Andrew's financial arrangements for Royal Lodge and whether taxpayers' interests had been properly protected.Andrew had taken on a 75-year lease of Royal Lodge in 2003, paying over £8.5m up-front to cover renovation costs and paying in advance to remove any requirement for rent, based on a notional rent of £260,000 per year.There was also a token \"peppercorn\" payment, which the Crown Estate notes is standard practice for long leases, where there's an advance payment in lieu of rent.A clause allowed him to get some of his advance payments back if he left within 25 years, but that depended on the property being maintained.The report says the current condition of Royal Lodge is \"not out of keeping with a tenancy of this duration\", but the cost of repairing \"dilapidations\" meant any payback was unlikely.Overall, the terms of the Royal Lodge deal were \"fair, reasonable and in line with market practice\", says a letter from the Crown Estate commissioners to MPs.The spending watchdog also published information about Forest Lodge, the Prince and Princess of Wales's new home in Windsor, saying it had been taken on a 20-year lease from the Crown Estate.The couple, who moved in this autumn, are described as paying an \"open market rent\" using levels agreed by independent valuers.There had been pressure on Andrew, 65, to move from his Windsor home for over a year, in what had become known as the Siege of Royal Lodge.King Charles had stopped financial support for his brother, but Andrew had a private lease that he had previously shown no signs of relinquishing.But following a growing public outcry about his links to the sex offender Jeffrey Epstein, Andrew was stripped of titles such as the Duke of York and his status as prince, becoming Andrew Mountbatten-Windsor.As part of that announcement in October, Andrew was also to leave Royal Lodge and to move into some other accommodation in Sandringham, the King's private estate in Norfolk.Andrew has also faced calls from Democrat members of the US Congress to give evidence to a committee investigating Epstein's activities.Mr Mountbatten-Windsor had not replied to the request by the end of their deadline last month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew Mountbatten-Windsor won't get money back from Royal Lodge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2b93/live/e40fd180-cf84-11f0-9de2-29260ccbfaf5.jpg"
      ],
      "datePublished": "2025-12-02T16:01:05.000Z",
      "dateModified": "2025-12-02T16:01:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reeves speech did not mislead on challenges facing UK ahead of Budget, says OBR official",
    "url": "https://www.bbc.com/news/articles/czj0ngnkl2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fe3/live/030ad020-cf7c-11f0-8390-cf8c18f355e0.jpg",
    "tag": "Trending",
    "date": "2025-12-02T16:37:55.000Z",
    "description": "8 hours agoMichael RaceBusiness reporterGetty ImagesA senior official at the UK's economic forecaster has said he does not believe the chancellor was ",
    "body": "8 hours agoMichael RaceBusiness reporterGetty ImagesA senior official at the UK's economic forecaster has said he does not believe the chancellor was being misleading when she said the state of the public finances were \"very challenging\" in the run-up to the Budget.Prof David Miles from the Office for Budget Responsibility (OBR) told MPs Rachel Reeves's comments ahead of announcing her tax and spending plans were \"not inconsistent\" with the situation she faced.Reeves has rejected claims she misled the public about the country's finances after the OBR's economic forecasts revealed they were better than widely thought.However, Prof Miles said despite the forecast, the chancellor still faced a \"very difficult Budget and very difficult choices\".He said the OBR raised concerns with Treasury officials about leaks to the media in the run-up to the Budget, adding: \"I think it was clear that we didn't find this helpful. We made that clear.\"He said a letter released by the OBR setting out the timings of its pre-Budget forecast rounds was intended to correct \"misconceptions\" in the media that the OBR was either acting as the government's \"patsy\" or that its forecasts had been \"all over the shop\".But he said the watchdog was not \"at war\" with the Treasury.The OBR assesses the health of the UK's economy and while it is independent, it works closely with the Treasury.Prof Miles faced the Treasury Select Committee alongside fellow OBR official Tom Josephs. The OBR's former chairman, Richard Hughes, did not attend following his resignation on Monday over a Budget day error which saw the watchdog's official forecast document published early.A political row has broken out over the information shared with the public over the past few weeks over the health of the economy and the choices required to be made by the chancellor.Last week's Budget included a total £26bn of tax rises, with £8bn set to be raised by extending the freeze on income tax and National Insurance thresholds for a further three years. The two-child benefit cap was also scrapped.In the build-up to the Budget, Reeves repeatedly talked about a downgrade to the UK's predicted economic productivity that would make it hard for her to meet her borrowing rules, fuelling speculation that the income tax rates themselves would be raised, which would break a Labour manifesto pledge.On 4 November, she used a rare pre-Budget speech in Downing Street to warn the UK's productivity was weaker \"than previously thought\" and that had \"consequences for the public finances too, in lower tax receipts\".However, it has since emerged that the OBR, which assesses the government's tax and spending policies, had told the Treasury on 31 October that it was on course to meet its main borrowing rule by £4.2bn due to the downgrade in productivity being offset by higher wages, which increase the government's tax receipts. Reeves did not mention the downgrade being offset by larger tax revenues in her 4 November speech and subsequent press conference.When questioned on whether the impression provided by the chancellor during her press conference was a \"false one\", Prof Miles told the committee: \"I don't think it was misleading, for my own view, for the chancellor to say that the fiscal position was very challenging at the beginning of that week.\"He also said: \"My interpretation was, and others might interpret differently, that the chancellor was saying that this was a very difficult Budget and very difficult choices needed to be made. \"And I don't think that that was in itself inconsistent with the final pre-measures assessment we'd made, which, although it showed a very small positive amount of so-called headroom, it was wafer thin.\"The Conservatives have claimed Reeves gave an overly pessimistic impression as a \"smokescreen\" to raise taxes in order to increase welfare spending, with leader Kemi Badenoch claiming she \"lied to the public\".The £4.2bn buffer was less than the £9.9bn Reeves had left herself at the previous Budget and Prof Miles said that it still \"posed a significant\" challenge to the government, which wanted to increase the figure overall.The so-called headroom chancellors have left themselves - essentially a buffer to fall back on - has been smaller in recent years. Prior to November 2022, chancellors tended to create a £20bn-£30bn buffer.Prof Miles also told MPs that the OBR was not looking for the £4.2bn surplus in the forecast to be interpreted as \"this is very, very good news, there is no hole to fill - as people were saying\".He said that was because, while a positive number, it was \"by a tiny margin\".Prof Miles added that the £4.2bn buffer would also have been reduced to minus £3bn because the OBR's forecast did not take into account the welfare and winter fuel payment U-turns made by the government.UK ParliamentProf David Miles was giving evidence to MPsMr Josephs also apologised to MPs for the early release of the OBR's forecast document, which effectively confirmed a number of new Budget measures before the chancellor announced them.On Monday, Richard Hughes resigned from the OBR saying he took \"full responsibility\" for the issues identified in the OBR's investigation into the mistake, which it called the worst failure in the organisation's 15-year history.Mr Josephs said the OBR would implement the recommendations of the investigation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reeves speech did not mislead on challenges facing UK ahead of Budget, says OBR official",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fe3/live/030ad020-cf7c-11f0-8390-cf8c18f355e0.jpg"
      ],
      "datePublished": "2025-12-02T16:37:55.000Z",
      "dateModified": "2025-12-02T16:37:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Laura Woods: TV presenter 'OK' after collapsing during England coverage ",
    "url": "https://www.bbc.com/sport/football/articles/cd9zl5vxkxko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/320f/live/24f44f70-cfb0-11f0-b476-4d01662cfb69.jpg",
    "tag": "Trending",
    "date": "2025-12-02T22:37:27.000Z",
    "description": "Presenter Laura Woods said she is \"OK\" after collapsing while leading television coverage of England's friendly against Ghana on Tuesday in Southampto",
    "body": "Presenter Laura Woods said she is \"OK\" after collapsing while leading television coverage of England's friendly against Ghana on Tuesday in Southampton.Woods was caught by pundits Ian Wright and Anita Asante in the opening minutes of the programme, at which point ITV cut to an advert break.When the coverage returned, colleague Katie Shanahan had taken over as presenter and confirmed Woods had been \"taken ill\".Woods later said medical staff told her it was likely a virus.\"Gosh that was a bit weird,\" she posted on Instagram.\"Sorry to worry everyone, I'm OK. Just need a bit of rest and hydration.\" She added: \"I'm really embarrassed that happened on TV but a big thank you to my colleagues at ITV who have really looked after me tonight and for Wrighty and Neets for catching me.\"Woods' fiance, reality TV personality Adam Collard, had earlier issued an update on the presenter's condition on social media after fans expressed concern.\"Laura is all OK and with the right people. Thank you for all of your kind messages,\" he wrote.At half-time during the match, Shanahan also added: \"As you may all be aware, Laura Woods fell ill at the start of the programme. We want to reassure you that she's doing OK. We all send her our love.\"Woods is a regular presenter across men's and women's football on ITV and TNT Sports.She has also worked as a radio presenter on Talksport.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Laura Woods: TV presenter 'OK' after collapsing during England coverage ",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/320f/live/24f44f70-cfb0-11f0-b476-4d01662cfb69.jpg"
      ],
      "datePublished": "2025-12-02T22:37:27.000Z",
      "dateModified": "2025-12-02T22:37:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jury trials scrapped for crimes with sentences of less than three years",
    "url": "https://www.bbc.com/news/articles/cn5lxg2l0lqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2e77/live/6f176b00-cf7e-11f0-8390-cf8c18f355e0.jpg",
    "tag": "Trending",
    "date": "2025-12-02T21:19:04.000Z",
    "description": "4 hours agoDominic Casciani,Home and legal correspondentandTom McArthurJury trials in England and Wales for crimes that carry a likely sentence of les",
    "body": "4 hours agoDominic Casciani,Home and legal correspondentandTom McArthurJury trials in England and Wales for crimes that carry a likely sentence of less than three years will be scrapped, the justice secretary has announced.The reforms to the justice system include creating \"swift courts\" under the government's plan to tackle unprecedented delays in the court system.Serious offences including murder, robbery and rape will still go before a jury, and volunteer community magistrates, who deal with the majority of all criminal cases, will take on even more work.David Lammy said the reforms were \"bold\" but \"necessary\", but the Conservatives described the plans as the \"beginning of the end of jury trials\".Retired Court of Appeal judge Sir Brian Leveson was asked by the Lord Chancellor to come up with a series of proposals to reduce the backlog in the courts, in a process which began back in December 2024.These proposals included jury-free trials and more out-of-court settlements like cautions.In July, Sir Brian said \"fundamental\" reforms were needed to \"reduce the risk of total system collapse\".A previous version of the plan, leaked to the BBC and the Times last week and based on Sir Brian's proposals, was to end jury trial for most crimes attracting sentences of up to five years.But announcing the reforms in the Commons on Tuesday, David Lammy retreated from the most radical reforms.Lammy said the new system would get cases dealt with a fifth faster than jury trials.He added that it was necessary as current projections have Crown Court case loads reaching 100,000 by 2028, from the current backlog of almost 78,000.This means that currently a suspect being charged with an offence today may not reach trial until 2030. Six out of 10 victims of rape are said to be withdrawing from prosecutions because of delays.A defendant's right to a jury trial would also be restricted to prevent them from \"gaming the system\", Lammy said.The reforms to the jury process will remove the right for defendants to ask for a jury trial where a case can be dealt with by either magistrates or a new form of judge-only Crown Court.Defendants facing fraud and complex financial crime accusations will no longer get a jury trial - a recommendation made to the government earlier this year by a retired senior judge.But jury trials will be guaranteed for the most serious offences, including rape, murder, aggravated burglary, blackmail, people trafficking, grievous bodily harm and the most serious drug offences, the Ministry of Justice (MoJ) said. There are around 1.3 million prosecutions in England and Wales every year, and 10% of those cases go before a Crown Court. Of those, three out of 10 result in trials.The reforms appear to mean that more than two out of 10 will still go before a jury. Critics of restrictions to trial by jury - including almost all barristers - say it won't have any impact on the backlogs because the real problem has been cuts to the MoJ.Evidence also shows that ethnic minorities believe they get a fairer hearing with juries, than with magistrates alone.Lammy has previously said that cutting juries would be a mistake, but told the BBC ahead of the announcement that the \"facts had changed\" and the government needed to bring in reforms to clear the backlog.Shadow justice secretary Robert Jenrick accused Lammy of \"scrapping the institution he once lauded\".He told the Commons: \"Why on earth does this justice secretary think he has a mandate to rip up centuries of jury trials without even a mention of it in his party's manifesto?\"Lammy, in response, said the changes were needed because the previous government had cut court sitting days - and magistrates already deal with the vast majority of UK trials.The reforms will give magistrates the power to hear cases that have a maximum sentencing range of up to 18 months. A back-up power to allow them to sentence a criminal up to two years will be created but held in reserve. Currently magistrates can impose a sentence of up to 12 months or a fine of an unlimited amount. Legislation would need to be introduced to bring in the changes.The Liberal Democrats said jury trials were a \"fundamental right\" and called for a strategy that \"increases court sitting days, makes better use of underused courtrooms, fixes broken private contracts that leave defendants stuck in prison vans, and invests in rehabilitation to reduce re-offending.\"Abigail Ashford, a solicitor advocate with Stokoe Partnership, who represents clients in the Crown Court, said the reforms risked trust in justice.\"Judge-only trials risk deepening existing inequalities and eroding confidence among communities who already feel marginalised,\" she said.\"In complex or sensitive cases, removing the community from assessing credibility and fairness undermines trust in a way that cannot be compensated for by concentrating decisions in the hands of a single judge.\"The Criminal Bar Association, which represents specialist criminal barristers in England and Wales, criticised the changes and said they brought \"a wrecking ball to a system that is fundamentally sound and has been in place for generations\". \"Juries work – they do their job superbly, and without bias,\" it said in a statement. \"Juries have not caused the backlog.\"Chair Riel Karmy-Jones KC also expressed concern \"about the lack of detail provided in David Lammy's comments\".Tom Franklin, chief executive of the Magistrates' Association, said the increased powers for magistrates was a \"big vote of confidence\" but more resources were needed for courts including enough trained, well-paid legal advisers, and repairing crumbling buildings.He also pressed the case for the new swift courts to include two magistrates passing sentences with a judge, as originally proposed by Sir Brian, so that \"ordinary people\" are involved in both verdict and sentencing.Sir Brian will publish a second report focusing on measures to improve court efficiency, but he said that \"they would not, on their own, be sufficient to change the overall position\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jury trials scrapped for crimes with sentences of less than three years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2e77/live/6f176b00-cf7e-11f0-8390-cf8c18f355e0.jpg"
      ],
      "datePublished": "2025-12-02T21:19:04.000Z",
      "dateModified": "2025-12-02T21:19:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]