[
  {
    "title": "Newscast - Andrew Mountbatten-Windsor Arrested - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n22992?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-19T14:56:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Feb 2026,·36 minsAndrew Mountbatten-Windsor ArrestedNewscastAvailable for over a yearToday, Andrew Mountbatten-Windsor has been arrested and is in custody on suspicion of misconduct in public office. \nKing Charles says he \"learned with the deepest concern\" of Andrew's arrest, adding \"the law must take its course\" - Prince William and Catherine are understood to support the statement.\nAndrew, who turns 66 today, has previously denied any wrongdoing in relation to Epstein; he has not responded to the BBC's requests for comment on the specific allegations in relation to the release of millions of Epstein files in January\nAdam and Laura are joined by royal correspondent Jonny Dymond and home and legal correspondent Dominic Casciani.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Chris Gray with Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Gareth Jones. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Andrew Mountbatten-Windsor Arrested - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-19T14:56:00.000Z",
      "dateModified": "2026-02-19T14:56:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - Former Prince Andrew arrested - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n22l06?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0n22l4d.jpg",
    "tag": "Trending",
    "date": "2026-02-19T15:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·19 Feb 2026,·31 minsAvailable for 89 daysAndrew Mountbatten-Windsor is in custody over his links to the late sex offender, Jeffrey Epstein. He was arrested on suspicion of misconduct in public office. Police have been looking into allegations he shared documents with Epstein when he was a British trade envoy. Officers have also carried out searches at two addresses in England, including the former prince's residence at Sandringham. Also: a UN fact-finding mission in Sudan has determined that atrocities carried out against non-Arabs by the Rapid Support Forces in Darfur point to genocide. As the Board of Peace meets for the first time in Washington, is Hamas regaining control of Gaza? The paradox of China - the world's biggest polluter has installed more solar and wind projects than the rest of the world. A British couple are sentenced to ten years in prison in Iran. And as the celebrated conservationist David Attenborough approaches 100, we look back at his most memorable broadcast. \nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - Former Prince Andrew arrested - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0n22l4d.jpg"
      ],
      "datePublished": "2026-02-19T15:41:00.000Z",
      "dateModified": "2026-02-19T15:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arrest after two teenagers found dead at Bridlington holiday park",
    "url": "https://www.bbc.com/news/articles/czx41qqgzlko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b2f5/live/6d7d28a0-8714-11f0-84c8-99de564f0440.jpg",
    "tag": "Trending",
    "date": "2026-02-19T15:07:50.000Z",
    "description": "1 hour agoGrace McGroryEast Yorkshire and LincolnshireBBCHumberside Police said it was called to Little Eden Holiday Park in Bridlington on WednesdayA",
    "body": "1 hour agoGrace McGroryEast Yorkshire and LincolnshireBBCHumberside Police said it was called to Little Eden Holiday Park in Bridlington on WednesdayA man has been arrested after two teenagers were found dead at a holiday park in East Yorkshire.Humberside Police said it was called to Little Eden Holiday Park in Bridlington on Wednesday following concern for safety.The force said a 15-year-old girl and a 17-year-old boy were found dead inside a rental property. A 33-year-old man has been arrested on suspicion of gross negligence manslaughter and remains in custody.Ch Supt Matt Peach said: \"Whilst we are in the very early stages and the deaths at this time remain unexplained, we are exploring the possibility that they may be connected to carbon monoxide poisoning, with further inquiries continuing.\"Peach added emergency services and partner agencies had attended all other properties on the site to offer \"advice, support, guidance and ensure everyone's safety\".He said: \"This is incredibly distressing and heartbreaking for the families of the teenagers involved, and they are at the forefront of our minds and actions.\"I would please ask people to refrain from any form of speculation and to respect their privacy.\"Peach said residents would continue to see an increased police presence and a cordon was in place while investigations continued.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arrest after two teenagers found dead at Bridlington holiday park",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b2f5/live/6d7d28a0-8714-11f0-84c8-99de564f0440.jpg"
      ],
      "datePublished": "2026-02-19T15:07:50.000Z",
      "dateModified": "2026-02-19T15:07:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mandelson co-founded lobbying firm Global Counsel faces collapse",
    "url": "https://www.bbc.com/news/articles/cz9q57y9y3xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/da97/live/fc073c10-0daa-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T15:48:17.000Z",
    "description": "52 minutes agoTheo LeggettBusiness correspondentPA MediaGlobal Counsel, the lobbying firm co-founded by Peter Mandelson, has confirmed it is preparing",
    "body": "52 minutes agoTheo LeggettBusiness correspondentPA MediaGlobal Counsel, the lobbying firm co-founded by Peter Mandelson, has confirmed it is preparing to enter administration.Staff have reportedly been told that the move became inevitable when leading clients severed their relationships with the company, after details emerged of apparent links with the convicted sex offender Jeffrey Epstein.Lord Mandelson resigned from the board of Global Counsel in 2024, though he remained a shareholder until earlier this month. His co-founder, Benjamin Wegg-Prosser, stepped down as chief executive on 6 February.Sources close to the company insist that its difficulties stem entirely from \"the Mandelson legacy\" and not from any actions by staff.Global Counsel was set up by Lord Mandelson and Wegg-Prosser after Labour lost the 2010 general election.It became a highly influential lobbying firm in Westminster, advising high-profile clients such as Shell, Tik Tok and Barclays.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mandelson co-founded lobbying firm Global Counsel faces collapse",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/da97/live/fc073c10-0daa-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-19T15:48:17.000Z",
      "dateModified": "2026-02-19T15:48:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why there's no quick fix in sight for the problem of dazzling headlights",
    "url": "https://www.bbc.com/news/articles/cn71xyjpdl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d2e4/live/a860eb00-0cd4-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:43:37.000Z",
    "description": "7 hours agoKaty AustinTransport correspondentBBCWhen Jane Kingsbury, 80, last had her eyes tested, she says her optician told her that her eyesight wa",
    "body": "7 hours agoKaty AustinTransport correspondentBBCWhen Jane Kingsbury, 80, last had her eyes tested, she says her optician told her that her eyesight was OK. But Jane, from Cambridge, says she is giving up driving at night because the feeling of being \"dazzled\" by other vehicles has left her feeling unsafe. \"I am worried about the glare from oncoming lights,\" she says.And when Jane mentioned this at a discussion group she attends, others felt the same. \"Over 90% of us did not want to drive in the dark,\" says Jane. \"So we have changed the time of our meetings from 7.30pm to 1.30pm [for much of the year] so that we can drive home before dark.\"Jane and her friends aren't alone. In a debate at Westminster last October, MPs voiced widespread concerns about bright headlights. Some described social isolation among constituents who had become too scared to drive in the dark.The RAC motoring organisation, which has campaigned on headlight dazzle, has repeatedly asked its members for their views. Most recently, more than half of respondents to a survey of 1,745 UK drivers in January this year felt the problem had worsened in the past 12 months. A third of those who said they were affected by dazzle said they felt less safe when driving at night.Getty ImagesHeadlight glare is an issue for all road users - not just motoristsIt's not only older drivers who feel this way. Emily McGuire from Essex told the BBC: \"I am in my 30s and sometimes I can't tell if [other vehicles'] main beam is on or off and once they have passed, I can't see properly for a good few minutes, it's terrible.\"She owns a smaller car and feels that she can't avoid the lights on higher, bigger cars: \"I suffer with migraines when a car approaches me with extremely bright lights, I have to look down or in the other direction… I also have to slow right down when it's really dark and I'm on a country lane.\"And experts say the problem is getting worse. Denise Voon, clinical advisor at the College of Optometrists - which also campaigns on the issue - says: \"I am a practising optometrist and I've noticed that maybe 15 years ago, you rarely had people coming in complaining about headlight glare. But now it's becoming more and more prevalent.\"It's an issue that has even reached the United Nations - it will mandate all new cars to automatically adjust their headlight levels.But this will only affect new cars. And so the questions many are asking are: what, if anything, can be done about all the cars currently out there causing headlight discomfort - and why did nobody spot that this might be a problem?The impact of changing headlightsExperts believe a number of factors can cause headlight dazzle.One is the angle of headlights. If misaligned, they are more likely to cause glare. Misalignment can cause a vehicle to fail its MoT test.Then there's the fact that headlights have got brighter, to help drivers see better.Headlights have moved a long way from the \"kind of brown glow\" produced by filament bulbs decades ago, according to Dale Harrow, professor of Intelligent Mobility and Car Design at the Royal College of Art in London. They have become more complex and \"a design object in their own right,\" he says.Glass casings have given way to plastic and significantly, the light source has changed too, with most people now using LEDs instead of halogen bulbs, he says - the quality has improved and lights are now \"brighter, but also a lot clearer\".Getty ImagesCar headlights have come a long way since the heyday of the Jaguar E TypeWhile this \"has to be a good thing\" when it comes to helping the driver see clearly, Harrow says, it has also resulted in \"unplanned drawbacks\" - including dazzling other road users.Another problem is the illegal retrofitting of LED bulbs, especially when fitted into units designed for halogen. The Driver and Vehicle Standards Agency has said it has stepped up a crackdown on retrofit bulbs, with sellers facing potential fines of up to £1,000.\"Recent advances in headlight technology have improved visibility but all headlights – whether LED or not – must still be aimed correctly and checked at the MOT test,\" says Mike Hawes, chief executive of the Society of Motor Manufacturers and Traders (SMMT).How bright lights affect our eyesOur eyes adapt in the dark to become a lot more sensitive to light, says Denise Voon. As a result, being suddenly hit by very bright lights can temporarily make it very hard to see, even causing pain.Retinal cells at the back of the eyes which detect the light can get bleached, and take a while to recover. That's when people notice an imprint remaining in their vision after looking away.Although headlight glare does affect younger people, age is thought to be a factor. Older people are more prone to conditions such as cataracts and glaucoma, for example.Bloomberg via Getty ImagesThere is widespread concern that glare is getting worse - but the statistics are unclearVoon says there are a number of reasons why LEDs may be particularly problematic. Firstly, they are two to three times as bright as traditional halogens, and their \"colour temperature\" is bluer and whiter, which mimics natural daylight.Also, LED lights \"are a lot more directional, so you've got this much brighter, whiter light in a very directional point hitting your eye compared to the more diffuse halogen ones\".It's not clear if it is the brightness, colour, temperature or the direction of the lights - or some combination of all of these - that causes most problems, she says: \"But what we know is that's one of the differences.\"What the data says - and doesn'tDespite widespread concerns that the problem is getting worse, there isn't evidence that brighter lights are causing more accidents.Statistics from the Department for Transport (DfT) show that headlight dazzle was recorded as a contributory factor in 216 collisions in 2023. Four of those collisions were fatal.Although the overall number of collisions rose very slightly compared to the previous year, it was far below the 330 recorded in 2014. The figure was also lower than any of the intervening years except 2020, when the pandemic meant fewer drivers on the roads.But the fact that since 2024 \"vision affected by dazzling headlights\" is no longer listed in the DfT's published statistics as a contributory factor in its own right, makes comparisons or identification of a trend harder.Equally, these statistics don't tell us whether some people are choosing not to drive at night and nor do they account for other changes in driver behaviour.Still, a government-commissioned report by the Transport Research Laboratory (TRL), published last year, found that drivers \"perceived glare from vehicle headlamps to be an important and widespread issue when driving at night\".It also concluded that headlamps were perceived as \"too bright\", and that \"whiter\" headlamps and those on larger vehicles were \"generally perceived to be especially problematic for causing glare\".So far so obvious, you may think, based on what campaigners have been saying for some time. But the study went further.Researchers took out a car at night, rigged with equipment to measure light intensity and an observer in the vehicle could press a button if they felt glare might interfere with their driving.The study drew a link between higher levels of luminance - meaning the intensity of light - and the likelihood of experiencing glare. It also suggested that 40,000 candela per sq m - a measure of luminance - may be an \"important threshold for the experience of glare being more likely\".Also, when the research car was travelling uphill or around a right-hand bend, glare was more likely, researchers said - a driver's eyes are more likely to fall within the \"throw\" of headlamps from oncoming vehicles.Echoing the concerns of experts, researchers also found \"some tentative indication that larger body shapes such as SUVs and models with light-emitting diode (LED) headlamps may be more likely to be associated with glare\". However, further research was recommended in this area.The government has since agreed to conduct such further research. But this has not started yet, and it's unlikely to begin for at least a couple of months.An unidentified problemBut all this raises the question of why nobody anticipated widespread complaints about glare - in spite of all the research and development work that's been carried out by carmakers around the world. \"It seems more priority has been put on giving drivers the best possible view of the road at night and less on the consequences for oncoming traffic,\" says Simon Williams, the RAC's head of policy.Manufacturers reject this. \"Safety is every car maker's top priority and providing good visibility to drivers in darkened conditions is essential,\" says Mike Hawes, chief executive of the SMMT. \"All headlights must meet international standards so drivers can see as clearly as possible but without dazzling other drivers.\"In October, I had the opportunity to speak to Thomas Broberg, senior advisor for safety at Volvo's Car Safety Centre in Gothenburg, Sweden. He explained how vehicles have to meet the standards of countries in which the manufacturer wants to sell them - vehicle manufacturing being an international business.LightRocket via Getty ImagesVolvo says avoiding glare is part of its design processThere are regulations around the headlights themselves, he says, covering their shape, intensity and glare. Also, headlights are tested on the road by different authorities and \"as a global car company, we need to comply with all of them\".Broberg said it was a \"concern\" that people are complaining about glare, but insisted that avoiding glare was part of the design process. He also pushed back against the suggestion that SUVs end up dazzling people more. \"The angle of the light is actually regulated,\" he says. \"So if you have a higher vehicle, then you need to have a lower [beam] angle.\"He argues that road geometry, and poor aiming of headlights in cars that don't have automatic levelling systems, are more likely culprits.What is already being done?In theory, technological innovations should help, particularly auto-dimming - although not everyone finds that they dip early enough.Off the back of the TRL report, the government has promised to look further into design factors that may be contributing to glare. The idea would be to use the findings to propose changes to international regulations at the United Nations.The United Nations Economic Commission for Europe (UNECE) has a World Forum for Harmonization of Vehicle Regulations. Following an agreement by this forum, new vehicles are meant to have mandatory automatic headlight levelling by September 2027. The effect of this technology is to correct the aim of headlights if the vehicle's load changes.But this would not change the headlight settings on the millions of cars on our roads already.More from InDepthThe TRL report also points out that \"many instances of glare are likely to remain even with stronger regulation\", because real-world situations of \"road geometry\" - the shape of the road, with ups, downs and corners - are not realistically under DfT's control.\"We know headlamp glare is a real frustration for many drivers and is even discouraging some from driving at night,\" a DfT spokesperson says. \"That's why we're investigating the causes as part of our Road Safety Strategy and are pressing for improvements to international lighting regulations.\"There are some basic things drivers can do to reduce the impact bright lights have on them. For example, keep their windscreen clean, inside and out.The College of Optometrists reminds motorists to always wear glasses if they have them, and make sure they are clean. It also advises staying up to date with vision tests, which can also pick up problems with eye health.More practical advice when confronted with bright oncoming headlights is to briefly look to the side of the road, keeping your eyes open - and of course, be considerate of other drivers when you're behind the wheel yourself.For Emily and others affected by glare, this guidance will have to make do for the time being. She says: \"It's tough but we cope and carry on until something is done about it.\"BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why there's no quick fix in sight for the problem of dazzling headlights",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d2e4/live/a860eb00-0cd4-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T09:43:37.000Z",
      "dateModified": "2026-02-19T09:43:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer appoints Antonia Romeo as head of UK civil service",
    "url": "https://www.bbc.com/news/articles/c3rz8z33rqxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5544/live/6703e600-0b1a-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T15:49:43.000Z",
    "description": "45 minutes agoJoe PikePolitical correspondentCivil Service Blog / GOV.UKDame Antonia Romeo has held senior roles in three government departmentsPrime ",
    "body": "45 minutes agoJoe PikePolitical correspondentCivil Service Blog / GOV.UKDame Antonia Romeo has held senior roles in three government departmentsPrime Minister Sir Keir Starmer has appointed Dame Antonia Romeo as cabinet secretary, the UK's top civil servant.Dame Antonia will be the first woman to hold the post in the role's 110-year history.She faced multiple bullying complaints earlier in her career but government sources have told the BBC that Sir Keir was impressed by her ability to \"get things done\".The government has previously said three allegations relating to Dame Antonia's use of expenses and bullying of staff when she was the UK's consul general in New York were investigated and there was \"no case to answer\".The cabinet secretary is the prime minister's most senior policy adviser and sits next to them during cabinet minister meetings, which usually take place weekly in Downing Street when Parliament is sitting.They are responsible for ensuring policy decisions are put into action and is ultimately responsible for all civil servants in Great Britain.Dame Antonia has a long track record of leading government departments including spells as permanent secretary at the Home Office, International Trade and the Ministry of Justice.Her appointment was made following a due diligence process overseen by crossbench peer Baroness Gisela Stuart, the First Civil Service Commissioner.Sir Keir said Dame Antonia is an \"outstanding public servant, with a 25‑year record of delivering for the British people\".He said: \"Since becoming prime minister, I've been impressed by her professionalism and determination to get things done.\"Dame Antonia said it was a \"huge privilege\" to be appointed, adding: \"The Civil Service is a great and remarkable institution, which I love. \"We should be known for delivery, efficiency and innovation, working to implement the government's agenda and meet the challenges the country faces.\"Dame Antonia, a University of Oxford graduate, joined the Civil Service in 2000 as an economist after previously working for a consultancy firm in the private sector.Her high-ranking jobs included serving as the UK's consul general in New York between 2016 and 2017.Dame Antonia's job involved promoting UK trade and business in New York, which saw her pictured with celebrities, shortly after the referendum to take Britain out of the EU.Concerns were raised about Dame Antonia's use of social media, with one former colleague claiming in an email that she seemed to be \"focusing an undue amount on building her personal Twitter brand\".Shortest servingSir Chris is the shortest serving cabinet secretary in history.His departure came after months of negative media reports suggesting Downing Street was unhappy with his performance.At the time of his appointment, the prime minister said Sir Chris would be tasked with \"the complete re-wiring of the British state to deliver bold and ambitious long-term reform\".As a career civil servant, some questioned whether he was the best person to reform the Civil Service.Sir Chris also had ultimate responsibility for the due diligence checks carried out before Lord Mandelson's appointment as US ambassador, although he took up the role only a few days before the appointment was formally announced.Lord Mandelson was sacked from the role last September after Downing Street said new information about the depth of his relationship with paedophile financier Jeffrey Epstein had emerged.The FDA union for senior civil servants criticised the anonymous briefings against Sir Chris.Liberal Democrat Cabinet Office spokesperson Lisa Smart, responding to Dame Antonia's appointment, said the public are \"tired of the endless sniping and the revolving door of officials\". She said: \"It's time to stop the Downing Street drama and start delivering for the country.\"Reform UK said it would break the role into three if it entered government.They have proposed: a cabinet secretary responsible for the process of cabinet and cabinet committee meetings; a Civil Service leader; and a chief adviser to the prime minister, who would be a political appointee. Reform UK MP Danny Kruger said the current combined role \"is far too much executive responsibility for a single civil servant, and helps explain the chronic bureaucracy and misgovernment of Britain\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer appoints Antonia Romeo as head of UK civil service",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5544/live/6703e600-0b1a-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T15:49:43.000Z",
      "dateModified": "2026-02-19T15:49:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaffe-ridden Olympic commentary prompts Italy's Rai sport chief Petrecca to resign",
    "url": "https://www.bbc.com/news/articles/c1jkx7yg9p6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1281/live/11f16ba0-0d82-11f1-a355-f9c151a9e8be.png",
    "tag": "Trending",
    "date": "2026-02-19T13:10:43.000Z",
    "description": "3 hours agoPaul KirbyEurope digital editorRai TVPaolo PetreccaIt was a moment of national pride for Italians watching the glitzy opening ceremony of t",
    "body": "3 hours agoPaul KirbyEurope digital editorRai TVPaolo PetreccaIt was a moment of national pride for Italians watching the glitzy opening ceremony of the Milan-Cortina Winter Olympics live on state broadcaster Rai earlier this month.But for Paolo Petrecca, whose gaffe-ridden commentary of the event went viral and became a national embarrassment, it signalled the end of his broadcasting career.Petrecca, the head of Rai Sport, has handed in his resignation after his litany of on-air errors broadcast to an audience of 9.2 million viewers prompted a brief strike by news journalists.His tenure will end at the end of the Games, and he will not be commentating on the closing ceremony.Petrecca had been a last-minute stand-in, because the original commentator was dropped for revealing a \"sensational surprise\" element of the ceremony by mistake.He is considered close to the Brothers of Italy party of Prime Minister Giorgia Meloni and, while running Rai's news channel, presented her book I Am Giorgia to the public a year before she came to office.His broadcast had barely begun before he made his first mistake, welcoming viewers to the Stadio Olimpico, instead of Milan's fabled San Siro which had been chosen for the curtain-raising ceremony.What happened next was described by one reviewer as one of Rai's bleakest ever live broadcasts, when its flagship Rai 1 channel had an audience share of more than 46%.He introduced singer Mariah Carey, before correcting himself and explaining it was in fact Italian actress Matilda De Angelis. AFP via Getty ImagesMatilda De Angelis wrote \"Please call me Mariah\" after the opening ceremonyHis gaffe went viral, as Italians posted images of De Angelis with the slogan \"here's the amazing Mariah Carey!\" De Angelis herself went on social media to suggest sharing the rights to Carey's song All I Want for Christmas.When the camera fixed on President Sergio Mattarella, Petrecca referred to the president's daughter Laura beside him applauding, when the woman in the frame was in fact the president of the International Olympic Committee Kirsty Coventry.When the Olympic torch was handed to Italy's two highly successful volleyball teams, he failed to recognise men's volleyball captain Simone Giannelli, naming one member of the women's team.And he then resorted to national stereotypes, saying Brazilians had music in their blood, referring to African \"voodoo rites\" and Spaniards who were \"always very hot\", using the Spanish word calienti.Petrecca's disastrous performance was condemned by Rai's journalists' union Usigrai as a \"serious blow\" to the public broadcaster's image and the commentator who had been dropped for the curtain-raiser, Auro Bulbarelli, has since been given back the job for the closing ceremony.His decision to hand in his resignation was not unexpected and he will be replaced by colleague Marco Lollobrigida, considered one of the broadcaster's top sport presenters.But the affair has highlighted what critics argue is the government's attempt to pressurise the broadcaster at the expense of output quality, dubbing Rai TV as TeleMeloni.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaffe-ridden Olympic commentary prompts Italy's Rai sport chief Petrecca to resign",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1281/live/11f16ba0-0d82-11f1-a355-f9c151a9e8be.png"
      ],
      "datePublished": "2026-02-19T13:10:43.000Z",
      "dateModified": "2026-02-19T13:10:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Read King Charles and police statements in full after Andrew arrest",
    "url": "https://www.bbc.com/news/articles/cd6zjl58734o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3202/live/2ab02810-0d92-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T12:28:43.000Z",
    "description": "4 hours agoVehicles arrive at Sandringham Estate in NorfolkKing Charles III has released a statement after his brother Andrew Mountbatten-Windsor was ",
    "body": "4 hours agoVehicles arrive at Sandringham Estate in NorfolkKing Charles III has released a statement after his brother Andrew Mountbatten-Windsor was arrested on Thursday on suspicion of misconduct in public office.Earlier, Thames Valley Police released a separate statement saying it had arrested a man in his 60s.It comes after police said they were assessing a complaint over the alleged sharing of confidential material with late sex offender Jeffrey Epstein. Andrew has previously denied wrongdoing in relation to Epstein; he has not responded to the BBC's requests for comment on any of the specific allegations in relation to the release of millions of Epstein files in January.Here are both statements in full:King's statement\"I have learned with the deepest concern the news about Andrew Mountbatten-Windsor and suspicion of misconduct in public office.\"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities.\"In this, as I have said before, they have our full and wholehearted support and co-operation.\"Let me state clearly: the law must take its course.\"As this process continues, it would not be right for me to comment further on this matter.\"Meanwhile, my family and I will continue in our duty and service to you all.\"Charles R.\"Thames Valley Police's statement\"As part of the investigation, we have today (19/2) arrested a man in his sixties from Norfolk on suspicion of misconduct in public office and are carrying out searches at addresses in Berkshire and Norfolk.\"The man remains in police custody at this time.\"We will not be naming the arrested man, as per national guidance. Please also remember that this case is now active so care should be taken with any publication to avoid being in contempt of court.\"Assistant Chief Constable Oliver Wright said: \"Following a thorough assessment, we have now opened an investigation into this allegation of misconduct in public office.\"'It is important that we protect the integrity and objectivity of our investigation as we work with our partners to investigate this alleged offence.\"We understand the significant public interest in this case, and we will provide updates at the appropriate time.'\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Read King Charles and police statements in full after Andrew arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3202/live/2ab02810-0d92-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-19T12:28:43.000Z",
      "dateModified": "2026-02-19T12:28:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir David Attenborough's 100th birthday to be marked by BBC with special programmes",
    "url": "https://www.bbc.com/news/articles/c1l7m7j6lzjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1d31/live/8ae65d80-0d6f-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:20:22.000Z",
    "description": "BBC plans David Attenborough celebration for 100th birthday7 hours agoSteven McIntoshEntertainment reporterBBCSir David will appear in a new programme",
    "body": "BBC plans David Attenborough celebration for 100th birthday7 hours agoSteven McIntoshEntertainment reporterBBCSir David will appear in a new programme, Secret Gardens, as part of his centenary celebrationsSir David Attenborough's 100th birthday will be celebrated with three special programmes, the BBC has announced.The corporation will mark Sir David's \"extraordinary milestone\" on 8 May with a week of special programming featuring new and old shows by the beloved presenter.One of the new programmes, titled Making Life on Earth: Attenborough's Greatest Adventure, will go behind the scenes of his landmark BBC One series.Life on Earth was first broadcast in 1979 and followed Sir David as he travelled to 40 countries to film 600 species.The new programme will feature new interviews of the wildlife broadcaster and the original production team as they reflect on the making of the series.It will also touch on the challenges they faced along the way, including a coup in the Comoros, being shot at, as well as Sir David's famous encounter with gorillas in Rwanda.Sir David will also appear in a new series, Secret Garden, in which he will reveal the hidden worlds within Britain's gardens.Over five episodes filmed across the UK, the series will capture the rich diversity of life in Britain's back gardens while also reflecting on how the public can do their bit to save struggling species.And the presenter will appear in David Attenborough's 100 Years on Planet Earth, a live event from the Royal Albert Hall featuring the BBC Concert Orchestra and special guests.The week will also revisit episodes from Sir David's most-loved series including Planet Earth, One Planet, Blue Planet, Frozen Planet, Planet Earth and his most recent special Wild London.Jack Bootle, head of commissioning for specialist factual at the BBC, said: \"It's impossible to overstate what Sir David Attenborough has given us.\"His programmes have not only defined science and natural history broadcasting, but they have also changed how we see our planet and our place within it.\"This special week is a celebration of an extraordinary milestone and of a body of work that continues to inspire awe, curiosity and care for the natural world.\"It's also a moment for all of us at the BBC to say thank you to David - for his generosity, for his brilliance and for a lifetime spent bringing the wonders of nature into our homes.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir David Attenborough's 100th birthday to be marked by BBC with special programmes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1d31/live/8ae65d80-0d6f-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T09:20:22.000Z",
      "dateModified": "2026-02-19T09:20:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yes there is a right way to stack the dishwasher. Here are the 5 rules",
    "url": "https://www.bbc.com/news/articles/cwy89lr3pl4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2dc8/live/58d66900-0d99-11f1-8168-03d32f3820eb.jpg",
    "tag": "Trending",
    "date": "2026-02-19T01:32:26.000Z",
    "description": "15 hours agoAlex TaylorBBC News reporterGetty ImagesIt's a heated debate in many households - is there a right way stack to the dishwasher?It turns ou",
    "body": "15 hours agoAlex TaylorBBC News reporterGetty ImagesIt's a heated debate in many households - is there a right way stack to the dishwasher?It turns out some of us may be doing it wrong so here are five rules to ensure gleaming dishes - and an end to the dishwasher debate.1. Don't pre-rinseGetty ImagesIf you're rinsing your plates before putting them in the dishwasher you're doing it wrong, says Andrew Laughlin, principal researcher at consumer group Which?Modern dishwashers use a turbidity sensor to detect how dirty the water, and therefore the dish, is. If you rinse everything beforehand, the machine thinks the items are clean and lowers its temperature and intensity, reducing its efficiency.\"Instead, it's far better to scrape leftovers into your food waste bin and regularly clean the dishwasher filter,\" says Andrew.Lynsey Crombie, author of The 15 Minute Clean, agrees: \"Modern dishwashers are built to detect dirt so if your plates are too clean going in, they can actually wash less effectively,\" she says.\"Remove leftover food into the bin, but don't stand there pre-washing. You're wasting water and time.\"2. Stack correctlyGetty ImagesAndrew's rule for stacking the dishwasher is - if you eat from it, put it in the lower rack, if you drink from it, place it in the upper rack.Positioning dirty surfaces towards the jets is important too. \"Face everything towards the centre of the machine for the best performance,\" he says.Lastly, make sure no items are touching so that the water can flow and wash effectively.Lynsey says you should angle bowls downwards so they don't collect water and mix up your cutlery so spoons don't nest together.But the biggest mistake many of us make is overloading the dishwasher, she says.\"If water can't circulate properly, nothing will come out clean no matter how expensive your tablet is.\"3. Place the dirtiest items in the centreGetty ImagesThere's nothing more frustrating than loading the dishwasher, only to find some things aren't clean when the cycle is finished.Andrew says the \"worst offenders\" include cereal, scrambled eggs, or starchy food with protein-heavy residues. To fix this, he recommends putting the really dirty items in the middle, where the spray intensity is highest.This will make the wash more efficient and save you time and money by avoiding putting the same things back in again for another wash.4. Use tablets and saltGetty ImagesDishwashers need a helping hand to reach their peak performance.Andrew says it's \"absolutely\" vital to use tablets as these help to break down the dirt and the food waste and start the cleaning process. They contain enzymes to break down proteins and starches, and surfactants so water spreads and cleans better.Special dishwasher salt, meanwhile, helps to \"soften the water preventing lime scale build up and those horrid white marks on glasses.\" Lynsey says even if your tablet says \"all-in-one\", she still recommends topping up salt \"because it protects the machine long-term\".\"Think of it as maintenance, not an extra,\" she says.Rinse aid dispensers are also worth considering, explains Andrew. These \"disperse the water on the surface of the dishes, helping them to dry at the end of the cycle and to run efficiently.\"5. Avoid certain itemsGetty ImagesIt's equally important to remember what to keep out of your dishwasher, adds Andrew.Non-stick cookware, sharp knives, and wooden items should stay out.\"High temperatures and water pressure could damage them,\" he says.Lynsey says you should avoid anything with adhesive labels as these can clog the filter.But what about whose turn it is to empty the dishwasher? That's a question no expert can answer.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yes there is a right way to stack the dishwasher. Here are the 5 rules",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2dc8/live/58d66900-0d99-11f1-8168-03d32f3820eb.jpg"
      ],
      "datePublished": "2026-02-19T01:32:26.000Z",
      "dateModified": "2026-02-19T01:32:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jaywick XL bully attack trial finds Ashley Warren guilty",
    "url": "https://www.bbc.com/news/articles/c1e98d8l2l3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c2e/live/3f190d00-0da4-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T16:41:57.000Z",
    "description": "Man guilty of XL bully offence after fatal attack39 minutes agoShivani Chaudhari,Chelmsford Crown CourtandLewis AdamsJohn Fairhall/BBCAshley Warren wa",
    "body": "Man guilty of XL bully offence after fatal attack39 minutes agoShivani Chaudhari,Chelmsford Crown CourtandLewis AdamsJohn Fairhall/BBCAshley Warren was on trial at Chelmsford Crown CourtAn amateur rapper has been found guilty of owning or being in charge of an XL bully dog that mauled his mother-in-law to death - two days after the breed was banned.The pet, named Bear, killed Esther Martin, 68, while she was at Ashley Warren's home in Jaywick, Essex, on 3 February 2024.Warren was filming a music video in London when Martin suffered \"dozens and dozens\" of bite wounds.The 41-year-old, now of Addlestone in Surrey, will be sentenced at Chelmsford Crown Court on 1 April.The jury spent 14 hours and 28 minutes deliberating before coming to a verdict.Warren sat in the dock wearing a grey hoodie with his head facing down throughout the hearing.He had denied being the owner or in charge of two dogs caused injury resulting in death while dangerously out of control in a private place.Jurors found him guilty by a majority of 11 to one of being the owner of Bear but cleared him of being in charge of the other dog, Beauty, which also injured Martin.He was also found guilty by a majority of 11 to one of possessing a knife at Clacton railway station on 3 February 2024.Ashley WarrenThe jury was shown images of the XL bully puppies - pictured here with Ashley Warren's partner - at the house in JaywickMartin, from Woodford Green, east London, was described in court as a \"doting and loving grandmother\" who had mobility issues that left her with a limp.Leaving her in charge of the two XL bully dogs, and eight puppies, was a \"tragedy waiting to happen\", prosecutor Christopher Paxton KC said.She was attacked within hours of arriving in Jaywick, where Warren had asked her to watch his dogs while he was in London shooting the video.\"Esther suffered dozens and dozens of dog bite marks and wounds, which led to a catastrophic bleed and her death,\" said Paxton, when opening the trial.Family handoutLeaving Esther Martin alone with 10 XL bully dogs was \"a tragedy waiting to happen\", jurors were toldFootage from nearby CCTV, shown to the jury, captured screams coming from the house in Hillman Avenue and dogs barking \"in a frenzied state\".The animals were so ferocious that police officers chose to Taser them through a smashed window, rather than enter the house, Paxton said.But Warren told the jury his XL bullies were \"gentle\" and that \"not in a million years\" could he have predicted them attacking anyone.He wept at times during the trial, insisting \"happy, lovely\" Martin had never shown any unease about the dogs and that he was \"never going to get over\" her death.Warren became the first person to be charged with XL bully-related offences.He was released on bail ahead of sentencing.More related storiesRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jaywick XL bully attack trial finds Ashley Warren guilty",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c2e/live/3f190d00-0da4-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-19T16:41:57.000Z",
      "dateModified": "2026-02-19T16:41:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chagos Islands: Do not give away Diego Garcia, Trump tells UK",
    "url": "https://www.bbc.com/news/articles/c309qqyer8yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63ef/live/533a9e50-0c7a-11f1-bbff-03527479c958.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:03:42.000Z",
    "description": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal8 hours agoJaroslav LukivGettyThe US had previously supported the UK's dec",
    "body": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal8 hours agoJaroslav LukivGettyThe US had previously supported the UK's decision to proceed with the Chagos dealDonald Trump has thrown the UK's Chagos deal into doubt as he launched a stinging criticism of the plan that would see the UK hand over the Chagos Islands to Mauritius and lease back a joint UK-US military base.The US president urged Sir Keir Starmer not to \"give away Diego Garcia\" - the largest island on the archipelago and home to the base. Trump said \"this land should not be taken away from the UK\" and if it did it would be \"a blight on our Great Ally\", in a post on social media. In response to Trump, the UK Foreign Office said the Chagos Islands deal was \"crucial to the security of the UK and our key allies, and to keeping the British people safe\".\"The agreement we have reached is the only way to guarantee the long-term future of this vital military base,\" it said in a statement.Prime Minister Sir Keir Starmer has previously insisted the deal is necessary to protect the continued operation of the base, amid previous attempts from Mauritius to dispute the legality of British sovereignty over the islands.Diego Garcia is the largest island in the archipelago, and is used as a joint military base by the UK and US armed forces.Under the deal - which was announced last May - the UK will lease back Diego Garcia for a period of 99 years at an average cost of £101m a year. Trump's latest comments come ahead of talks between the US and Mauritius planned for next week.The US president's position on the issue has seen rapid U-turns in recent months - from describing the planned transfer as an \"act of great stupidity\" to saying the deal was the \"best\" the prime minister could make.UK ministers have previously said that the deal could not go ahead unless it had the support of the US.The bill, aimed at enshrining the agreement into UK law, has been delayed and there is no date set for the next stage. UK Minister Alex Davies-Jones said the bill would return to the House of Lords \"as soon as parliamentary time allows\".Posting on the Truth Social platform on Wednesday, Trump wrote: \"I have been telling Prime Minister Keir Starmer, of the United Kingdom, that Leases are no good when it comes to Countries, and that he is making a big mistake by entering a 100 Year Lease...\"The US president stressed that Diego Garcia was \"strategically located in the Indian Ocean\".\"Prime Minister Starmer is losing control of this important Island by claims of entities never known of before,\" he said. \"We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them.\"And referring to ongoing US-Iran talks on Tehran's controversial nuclear programme, Trump said: \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia and the airfield located in Fairford in order to eradicate a potential attack by a highly unstable and dangerous Regime.\"The Republican president has repeatedly threatened to use military action against Iran over its deadly crackdown on anti-government protests and its nuclear activities. The US and its European allies suspect that Iran is moving towards the development of a nuclear weapon, something that Tehran has always denied.Asked by the BBC about Trump's latest comments, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\"When you see it on Truth Social you know it's directly from President Trump, that's the beauty of this president in his transparency and relaying this administration's policies.\"Watch: BBC asks White House about Trump U-turn on Chagos Islands dealIn a statement, it said it \"supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago\".Shadow foreign secretary Dame Priti Patel said: \"It's time Starmer finally saw sense, U-turned and scrapped this appalling deal altogether.\"Liberal Democrat leader Sir Ed Davey said: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail.\"Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history.\"Earlier this week, four Chagos islanders - who are opposing the handover deal - landed on the Chagos Islands' remote atoll as part of a protest against the deal.They refused to leave it, despite a threat of eviction by a British maritime patrol.Speaking to BBC Radio 4's Today programme, Misley Mandarin - one of the Chagossians who had travelled to the islands - said they would have to \"drag me from my beach\".He said \"there's no reason\" for the deal \"because Mauritius never owned Chagos Islands in the first place\".\"Keir Starmer, you could be a hero right now - don't ratify that deal, cancel that deal and let Chagossians come back to their homeland as British,\" he added.The Chagos Islands – officially known as the British Indian Ocean Territory – are located about 5,799 miles (9,332km) south-east of the UK and about 1,250 miles north-east of Mauritius, in the Indian Ocean.The islands have been under British control since 1814 and were bought by the government for £3m, which led to the establishment of the islands as an overseas territory in 1965.But Mauritius has long argued that it was illegally forced to give the islands away as part of a deal to gain independence.In the late 1960s, Britain invited the US to build a military base on Diego Garcia, forcibly removing thousands of people from their homes in the process.Some of those Chagossians ended up in Mauritius and the Seychelles, but others settled in the UK, mostly in Crawley, West Sussex.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chagos Islands: Do not give away Diego Garcia, Trump tells UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63ef/live/533a9e50-0c7a-11f1-bbff-03527479c958.jpg"
      ],
      "datePublished": "2026-02-19T09:03:42.000Z",
      "dateModified": "2026-02-19T09:03:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew arrested on suspicion of misconduct in public office",
    "url": "https://www.bbc.com/news/articles/cx28yel4811o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/87ac/live/e50f5ac0-0d8b-11f1-ab35-e1029910cb11.jpg",
    "tag": "Trending",
    "date": "2026-02-19T16:06:28.000Z",
    "description": "34 minutes agoHafsa KhalilPA MediaAndrew Mountbatten-Windsor has been arrested on suspicion of misconduct in public office.Thames Valley Police confir",
    "body": "34 minutes agoHafsa KhalilPA MediaAndrew Mountbatten-Windsor has been arrested on suspicion of misconduct in public office.Thames Valley Police confirmed it had arrested a man in his 60s in Norfolk on Thursday and was carrying out searches at addresses in Berkshire and Norfolk. He remains in custody, it said.King Charles III said the \"law must take its course\" in response to Andrew's arrest and that the police had his \"full and wholehearted support and co-operation\". Police had previously said they were considering investigating Andrew over allegations relating to his association with the late sex offender Jeffrey Epstein and were reviewing allegations he shared confidential material. Follow updates on this storyWhy has Andrew been arrested?Communications between the pair featured among the tranche of files released by the US government.This is the first time Andrew has been arrested. He has consistently and strenuously denied any wrongdoing.Thames Valley Police said that, following a \"thorough assessment\", a formal investigation had now been opened.It also said earlier in February that it was assessing a separate allegation that a second woman was sent to the UK by Epstein for a sexual encounter with Andrew in 2010. The woman, who is not British, was in her 20s at the time.The arrest, which took place at Sandringham at 08:00 GMT on Thursday, is not in relation to any allegations of sexual offences.Vehicles arrive at Sandringham Estate in NorfolkVehicles believed to be unmarked police cars were seen outside the King's Norfolk estate, where the former prince has been living since leaving his home in Windsor, in Berkshire.The BBC understands that Royal Lodge - Andrew's former home in Windsor Great Park - is being searched by police. A number of uniformed officers have been seen beyond the gates.Thames Valley Police said it was not naming the arrested man \"as per national guidance\", and warned that as the case was now active, care must be taken to avoid being in contempt of court.Assistant Chief Constable Oliver Wright said: \"We understand the significant public interest in this case, and we will provide updates at the appropriate time.\"Norfolk Constabulary told the BBC it was \"supporting a Thames Valley Police investigation into misconduct in a public office\".The former Duke of York served as the UK's trade envoy between 2001 and 2011, travelling globally and enjoying privileged access to senior government and business contacts around the world.In 2010, Andrew appears to have forwarded government reports from visits to Vietnam, Singapore and China to Epstein, files relating to the late financier recently released by the US Department of Justice appear to show.The documents also appear to show Andrew forwarded information on investment opportunities in gold and uranium in Afghanistan to Epstein.Under official guidance, trade envoys have a duty of confidentiality over sensitive, commercial, or political information about their official visits.Map of south-eastern England showing the locations of Windsor and SandringhamKing Charles said he learned of the news his brother's arrest with the \"deepest concern\".\"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities,\" he said in a statement.\"Let me state clearly: the law must take its course.\"As this process continues, it would not be right for me to comment further on this matter. Meanwhile, my family and I will continue in our duty and service to you all.\"The BBC understands that the Prince and Princess of Wales support the King's statement.It is also understood that neither the King nor Buckingham Palace were given advance warning of Andrew's arrest, which occurred on his 66th birthday.The royals have been maintaining a business as usual approach, opting to continue with their engagements, despite the extraordinary developments of this morning.The King, who had been attending a solo engagement to mark the start of London Fashion Week on Thursday, did not react to questions from reporters asking for his reaction to his brother's arrest.Queen Camilla was asked about the arrest of her brother-in-law as she left an engagement in Windsor on Thursday.\"Are you concerned about Andrew's arrest, your Majesty?\" the Queen was asked as she got into a waiting car outside a lunchtime orchestral concert at Sinfonia Smith Square Hall. She was seen waving but did not respond.Andrew has always denied any wrongdoing over his association with Epstein. He has not responded to the BBC's requests for comment on the specific allegations in relation to the release of millions of Epstein files in January.Meanwhile, former UK Prime Minister Gordon Brown has told the BBC that he has submitted a five-page letter to several UK police forces providing new and additional information from the Epstein files.In a statement, Brown says the new information is in addition to what he submitted to the forces last week, in which he \"expressed my concern that we secure justice for trafficked girls and women\".The former prince previously faced allegations from Virginia Giuffre, which were settled out of court.She alleged she was made to have sex with Andrew on a number of occasions, including on Epstein's private island Little St James in the early 2000s.The settlement reached between the two made no admission of wrongdoing on Andrew's part.Andrew stepped back from royal duties in 2019 as he said the allegations had become a \"disruption\" for the royal family.He subsequently lost his military titles and royal patronages as Giuffre brought a civil action against him in the US in 2022.Andrew was stripped of his princely title in October 2025, the same month Giuffre's posthumous memoir was published and as fresh details about his association with Epstein came to light.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew arrested on suspicion of misconduct in public office",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/87ac/live/e50f5ac0-0d8b-11f1-ab35-e1029910cb11.jpg"
      ],
      "datePublished": "2026-02-19T16:06:28.000Z",
      "dateModified": "2026-02-19T16:06:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Etsy sells second-hand fashion app Depop to eBay for $1.2bn",
    "url": "https://www.bbc.com/news/articles/cx240kme2k8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ac2e/live/6f0f21d0-0d30-11f1-b73d-5f7429e28cb8.png",
    "tag": "Trending",
    "date": "2026-02-19T11:07:24.000Z",
    "description": "6 hours agoDanielle KayeandOsmond ChiaDepopDepop, the second-hand clothing app that has skyrocketed in popularity among Gen Z shoppers, is being sold ",
    "body": "6 hours agoDanielle KayeandOsmond ChiaDepopDepop, the second-hand clothing app that has skyrocketed in popularity among Gen Z shoppers, is being sold to eBay for $1.2bn (£890m).Etsy, the online platform, is offloading Depop just five years after it bought the business - which was founded in the UK - for $1.6bn.eBay is hoping that the deal will help the online auction firm, which is more than 30 years-old, \"reach a younger demographic across the expanding re-commerce landscape\".Apps that allow people to buy and sell used or \"pre-loved\" garments and footwear have grown in use in recent years as young consumers seek sustainable, low-cost alternatives to traditional retailers, which means increased competition for the likes of Depop.The app, one of the earlier entrants to the fashion-app resale market, has seen its value fall amidst the rise of other savvy fashion apps, such as Vinted.\"The mass appeal of Vinted has had an impact on Depop's value,\" said retail analyst Catherine Shuttleworth. \"As Vinted made investments into global markets and improved its tech platform, more sellers gravitated towards it.\"She said that ultimately, users want the easiest, most accessible platform to buy and sell goods - but Depop simply didn't have the \"frictionless\" and \"universal\" appeal of eBay and Vinted.The all-cash deal is expected to be completed by the middle of this year and will see  Depop retain its name and branding.It will help boost eBay's used clothes sales, which is one of eBay's \"fastest-growing\" categories, said chief executive officer Jamie Ianonne.The announcement came as eBay published its 2025 financial results which showed revenues rose to $11.1bn, up 8% compared to a year earlier.Etsy's share price rose more than 15% in after-hours trading, while eBay's was rose by almost 6.5%.According to Etsy, nearly 90% of Depop's seven million active buyers are under the age of 34.The second-hand fashion platform also has more than three million active sellers.Depop has become \"one of the fastest-growing fashion resale marketplaces in the US\", said Kruti Patel Goyal, chief executive of Etsy. \"I am confident that Depop is well-positioned for its next phase of growth as part of eBay,\" she added.Etsy bought Depop in 2021 as part of a series of major purchases as it tried to compete with online retail giants like Amazon.But Etsy has since pulled back from many of those deals.In 2023, it sold of Elo7 - often referred to as Brazil's version of Etsy - at a loss after paying $217m for it two years earlier.Last year, Etsy said it would sell Reverb, a music equipment resale site that it bought in 2019, in order to prioritise its core business.The Etsy platform, known for its focus on handcrafted and niche goods, thrived during the Covid-19 pandemic as more people shopped online.But the firm has struggled in recent years, faced with shrinking demand and tough competition in the crafts market.Chinese giants like Temu and Shein, which offer cheaper goods and fast delivery, have become increasingly popular.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Etsy sells second-hand fashion app Depop to eBay for $1.2bn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ac2e/live/6f0f21d0-0d30-11f1-b73d-5f7429e28cb8.png"
      ],
      "datePublished": "2026-02-19T11:07:24.000Z",
      "dateModified": "2026-02-19T11:07:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]