[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct7151?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·07 Nov 2025,·26 minsAvailable for over a yearThe man Donald Trump has called a \"great leader\", and who has long provoked admiration in MAGA circles, suddenly finds himself in an unusual position – at odds with the US president on an issue of critical importance. \nViktor Orban, Hungary’s prime minister, is visiting the White House on Friday to try to resolve a dispute over Russian oil and gas. Orban wants to keep buying it, but Trump wants countries to wean themselves off Russian energy and help put the brakes on Russia’s war in Ukraine. Will Trump choose to keep an old friend close, or put pressure on Putin? We speak to Nick Thorpe, the BBC’s correspondent in Budapest, who has covered Orban since the 1980s. \nProducer: Viv Jones \nExecutive producer: James Shield \nSenior news editor: China Collins \nMix: Travis Evans  \nPhoto: U.S. President Donald Trump and Hungarian Prime Minister Viktor Orban. Suzanne Plunkett, Reuters.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg"
      ],
      "datePublished": "2025-11-07T10:00:00.000Z",
      "dateModified": "2025-11-07T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mf970z?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-07T11:38:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·07 Nov 2025,·30 minsThe Week: Mistaken Prisoner Releases and Tax Rises Are Coming?NewscastAvailable for over a yearToday, after another two prisoners were mistakenly released from prison - why is the justice system failing and who is to blame?\nJustice Secretary David Lammy is under increasing pressure after details have emerged that two more prisoners have been wrongly released. Why didn’t Mr Lammy explain the situation when he was speaking during PMQs? And what has gone wrong?\nPlus, after a week where it has become increasingly clear more tax rises are expected at the budget - what is the chancellor’s plan?\nAdam and Chris are joined by the head of the Institute for Fiscal Studies Helen Miller and Luke Tryl from More in Common. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-07T11:38:00.000Z",
      "dateModified": "2025-11-07T11:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-10T06:07:50.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-10T06:07:50.000Z",
      "dateModified": "2025-11-10T06:07:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former French president Sarkozy released from prison after three weeks",
    "url": "https://www.bbc.com/news/articles/cm2eppqd2nyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-10T17:25:17.000Z",
    "description": "Former French president Nicolas Sarkozy has been released from jail, three weeks into a five-year prison term for taking part in a criminal conspiracy",
    "body": "Former French president Nicolas Sarkozy has been released from jail, three weeks into a five-year prison term for taking part in a criminal conspiracy.He will be subject to strict judicial supervision and barred from leaving France ahead of an appeal trial due to be held next year.On 21 October, the former centre-right president, 70, was sentenced to five years for conspiring to fund his 2007 election campaign with money from late Libyan dictator Muammar Gaddafi. His legal team immediately filed a request seeking his release.Writing on social media after the release, Sarkozy said his \"energy is focused solely on the single goal of proving my innocence.\"  \"The truth will prevail... The end of the story is yet to be written.\"Sarkozy's car was seen leaving La Santé prison in Paris just before 15:00 (14:00 GMT), less than an hour-and-a-half after a court agreed to his early release. Soon after, he was seen arriving at his home in western Paris.Christophe Ingrain, one of Sarkozy's lawyers, hailed his client's release as \"a step forward\" and said they would now be preparing for the appeal trial expected in March.One condition of Sarkozy's release is he does not contact any other witnesses in the so-called \"Libyan dossier\" or any justice ministry employees. During his incarceration, he was visited by Justice Minister Gérald Darmanin. The visit prompted 30 French lawyers to file a complaint against Darmanin, highlighting what they said was a conflict of interest as Darmanin was a former colleague and friend of Sarkozy's.Speaking to a court in Paris via video link on Monday morning, Sarkozy described his time in solitary confinement as \"gruelling\" and \"a nightmare\".He said he had never had the \"mad idea\" of asking Gaddafi for money and stated he would \"never admit to something I haven't done\".Sarkozy also paid tribute to prison staff who had made his time in prison \"bearable\". \"They have shown exceptional humanity,\" he said.Sarkozy's wife, the singer and model Carla Bruni-Sarkozy, and two of the former president's sons were present in the courtroom to support him. Sarkozy is the first French ex-leader placed behind bars since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945.Since entering prison, Sarkozy has been held in a cell in the isolation wing. He had a toilet, a shower, a desk, a small electric hob and a small TV – for which he paid a monthly €14 (£12) fee – and the right to a small fridge.He also had the right to receive information from the outside world and family visits, as well as written and phone contact – but was in effect in solitary confinement. He was allowed just one hour a day for exercise, which he did by himself in the wing's segregated courtyard.Two bodyguards were stationed in nearby cells, which the interior minister Laurent Nuñez said was due to Sarkozy's status. There was \"obviously a threat against him\", Nuñez said.Sarkozy was president from 2007 to 2012. Ever since he left office, he has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former French president Sarkozy released from prison after three weeks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T17:25:17.000Z",
      "dateModified": "2025-11-10T17:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeBanned in the 80s: Moments That Shook MusicBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 10 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mAnnie Lennox: DivaFeaturing an in-depth interview with Annie Lennox along with archive footage.29 minsLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30mMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Banned in the 80s: Moments That Shook Music",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg"
      ],
      "datePublished": "2025-09-27T21:22:31.000Z",
      "dateModified": "2025-09-27T21:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Traitors to return for a second series in 2026",
    "url": "https://www.bbc.com/news/articles/cwy12ln7rnlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b8ba/live/2ceed120-be38-11f0-9e99-d1007b558636.png",
    "tag": "Trending",
    "date": "2025-11-10T14:06:42.000Z",
    "description": "The BBC has confirmed that Celebrity Traitors will return for a second series on BBC One in 2026, following a hugely successful debut that became one ",
    "body": "The BBC has confirmed that Celebrity Traitors will return for a second series on BBC One in 2026, following a hugely successful debut that became one of the broadcaster's biggest entertainment hits.It will be hosted once again by Claudia Winkleman and filmed at Ardross Castle in the Scottish Highlands. Companion show Celebrity Traitors: Uncloaked will also return.An average of 11.1 million people tuned in to watch the final episode of this year's Celebrity version last week - the biggest live audience of the year for a single TV show.It was the highest overnight audience since the Gavin and Stacey finale, which attracted 12.3 million on Christmas Day last year, the BBC said.In July, England's victory in the Euro 2025 final had an average of 12 million who watched the match from start to finish, split across BBC One and ITV.The Celebrity Traitors finale saw traitors Cat Burns and Alan Carr, and faithfuls Joe Marler, Nick Mohammed and David Olusoga, compete for a £87,500 prize for charity.Comedian Alan Carr was crowned the winner of the series on Thursday evening after he convinced Mohammed and Olusoga that he was a faithful.An economic impact report, published on Monday, suggests the Traitors franchise - including the UK, US, and Celebrity editions – has added an estimated £21.8 million (gross value added) to Scotland's economy since production began in 2022.The report, compiled with Screen Scotland and Visit Scotland, credits the programme with supporting hundreds of local jobs and promoting the Highlands as a filming destination.The Traitors, based on a Dutch format created by Marc Pos, first aired on BBC One in 2022 and has since become an international phenomenon, spawning multiple editions worldwide including in Australia, Canada and Italy.Kalpna Patel-Knight, head of entertainment at the BBC, said the show had \"truly captivated the nation, becoming a bona fide highlight of the year\".She added: \"In 2026 the doors of the castle will be opened again to welcome celebrity players to the game to see who can charm, who can scheme and ultimately who can survive in series two which promises to be just as unmissable as the first.\"A fourth season of Traitors UK will also air in 2026. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Traitors to return for a second series in 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b8ba/live/2ceed120-be38-11f0-9e99-d1007b558636.png"
      ],
      "datePublished": "2025-11-10T14:06:42.000Z",
      "dateModified": "2025-11-10T14:06:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince William opens up about sharing Catherine's cancer diagnosis with their children",
    "url": "https://www.bbc.com/news/articles/cx2n1wj7g8vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8d78/live/9ba2f770-be5d-11f0-939f-634dba83d3c9.jpg",
    "tag": "Trending",
    "date": "2025-11-10T18:30:20.000Z",
    "description": "The Prince of Wales has described how he and the Princess of Wales approached telling their children about difficult moments they have faced over the ",
    "body": "The Prince of Wales has described how he and the Princess of Wales approached telling their children about difficult moments they have faced over the past two years, such as Catherine and King Charles' cancer diagnoses. \"We choose to communicate a lot more with our children... most of the time, hiding stuff from them doesn't work\", Prince William said during an interview in Brazil.\"Every family has its own difficulties and its own challenges. It's very individual and sort of moment-dependent as to how you deal with those problems,\" he added.The prince visited the Latin American country for the first time last week to mark the fifth Earthshot Prize, of which he is the founder and president.The prize celebrates people who've come up with ideas to help tackle issues affecting the planet. The winners of each category win £1m to further develop their ideas.Speaking to Brazilian TV host Luciano Huck in Rio de Janeiro ahead of the awards ceremony, which took place on 5 November, Prince William was asked how he and Catherine navigated the difficult things they have faced over the past two years.\"Sometimes you feel you're oversharing with the children\", said Prince William, who is father to Prince George, 12, Princess Charlotte, 10, and Prince Louis, seven. \"But most of the time, hiding stuff from them doesn't work, and so explaining how they feel, why that's happening, giving them other viewpoints as to why they might be feeling like they are sometimes helps give them a bigger picture, and they can relax more into it rather than being really anxious about 'what are you hiding from me'?\".\"There's a lot more questions when there's no answers.\"\"But it's always a balancing act\", he added, \"How much do I say? What do I say? When do I say it? There's no manual for being a parent, you've just got to go with it\".The Princess of Wales revealed she was in remission from cancer in January. King Charles continues to undergo treatment.In the interview, which covered a range of subjects, Prince William also said they do not allow their children to have phones.\"It's really hard. Our children don't have phones, I think when George moves onto secondary school then maybe he might have a phone that has limited access,\" he said.\"It's getting to the point where it's becoming a little bit of a tense issue but I think [Prince George] understands why, we communicate why we don't think it's right, and again I think it's the internet access we have a problem with. \"I think children can access too much stuff they don't need to see online,\" he said.He added that either he or Catherine do the school run most days and jokingly referred to himself as a taxi driver when conversing with Huck.Speaking about the Earthshot Prize, being held in Brazil for the first time this year, Prince William said: \"We're halfway through the ten years that we've identified as the decade of change, where if we want to leave a lasting legacy and really change the way we protect and restore and live on the planet we have to do it in this decade of change. \"So am I pleased with the progress the Earthshot has made and where the world is headed in environmental and climate leadership? Yes, I think we've made progress. Is there a lot more to do? Yes.\" Winners of this year's prize included a project to restore tropical forests and a global ocean treaty initiative.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince William opens up about sharing Catherine's cancer diagnosis with their children",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8d78/live/9ba2f770-be5d-11f0-939f-634dba83d3c9.jpg"
      ],
      "datePublished": "2025-11-10T18:30:20.000Z",
      "dateModified": "2025-11-10T18:30:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Post Office Horizon IT contract extended for another year",
    "url": "https://www.bbc.com/news/articles/cz6n2v7ywgeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/85a4/live/20203b20-be36-11f0-991b-61406f5bba70.jpg",
    "tag": "Trending",
    "date": "2025-11-10T14:17:52.000Z",
    "description": "6 hours agoEmma SimpsonBusiness correspondentThe Post Office has agreed to extend its deal to use the controversial Horizon IT system for another year",
    "body": "6 hours agoEmma SimpsonBusiness correspondentThe Post Office has agreed to extend its deal to use the controversial Horizon IT system for another year.It is paying a further £41m to the Japanese-owned company Fujitsu to use Horizon until March 2027.The accounting system has been at the centre of the Post Office scandal in which more than 900 sub-postmasters were wrongly prosecuted after faulty Horizon software made it look like money was missing from their branch accounts.A Post Office spokesperson said it was \"committed to moving away from Fujitsu and off the Horizon system as soon as possible\".\"We are bringing in a different supplier to take over Horizon whilst a new system is developed, and this process is well under way,\" they added. \"We expect to award a contract for a new supplier to manage Horizon by July 2026, according to current timelines.\"Sources have told the BBC the contract could be extended until 2028 while the new supplier takes over the running of Horizon, which is used by sub-postmasters at branches across the UK.But the replacement of Horizon is still a long way off.The Post Office had been working on a project called NBIT to build a new in-house alternative, but there were growing concerns about its soaring costs and complexity.NBIT was ditched shortly after new Post Office chair Nigel Railton launched his turnaround plan for the business in November 2024.Post Office bosses have shifted to buying software from external suppliers and a procurement process for this has begun.A government spokesperson said: \"We are working as quickly as possible to ensure the Post Office has the technology it needs, including replacing Horizon, as a vital part of the company's wider transformation.\"The fact they still use the Horizon system indicates past under-investment, which can't be rectified overnight, so we need to ensure postmasters have the tools they need to continue serving their customers in the interim.\"Fujitsu executives have apologised for the company's role in the scandal, admitting that Horizon had bugs errors and defects from the start.The boss of its European arm, Paul Patterson, has acknowledged that Fujitsu had a \"moral obligation\" to contribute financially but no timeline or figure has so far been set.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Post Office Horizon IT contract extended for another year",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/85a4/live/20203b20-be36-11f0-991b-61406f5bba70.jpg"
      ],
      "datePublished": "2025-11-10T14:17:52.000Z",
      "dateModified": "2025-11-10T14:17:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman stabbed in Birmingham near Bullring shopping centre dies",
    "url": "https://www.bbc.com/news/articles/c3rj33dg22vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c7f2/live/2244dcf0-be43-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-10T19:17:16.000Z",
    "description": "Woman stabbed in Birmingham bus stop attack dies58 minutes agoChloe Hughes, Shannen Headley, Bridie Adams,West Midlands and Tania Sangha,at Birmingham",
    "body": "Woman stabbed in Birmingham bus stop attack dies58 minutes agoChloe Hughes, Shannen Headley, Bridie Adams,West Midlands and Tania Sangha,at Birmingham Magistrates' CourtAlamyA woman who was stabbed in the neck in an unprovoked attack at a bus stop in Birmingham has died, police have confirmed.Katie Fox, 34, was targeted in Smallbrook Queensway, just outside the Bullring shopping centre, shortly before 21:00 GMT on Friday.Djeison Rafael, 21, appeared before Birmingham Magistrates' Court on Monday charged over the attack.He was previously accused of attempted murder, but following Ms Fox's death, the charge has been updated to murder. The 21-year-old, of Rosedale Avenue, Smethwick, is also charged with two counts of causing actual bodily harm on 27 October and 7 November, possession of a Stanley blade and assaulting a detention escort officer.Mr Rafael, who appeared before District Judge John Bristow, was told to be quiet as he interrupted the six-minute hearing multiple times.He was told he was not going to be asked to enter any pleas because the offences were too serious to be dealt with by the magistrates' court.The case was sent to Birmingham Crown Court for a hearing on 12 November.The attack happened opposite the main entrance to Birmingham New Street stationThe force said officers would be around the city centre on Monday to offer reassurance. They added that investigators were supporting the victim's family.Detectives are appealing for witnesses who may have seen Mr Rafael, who they described as a black British national, and is believed to have been wearing an all-grey tracksuit, black hat, trainers and rucksack.The stabbing happened outside the Bullring shopping centre, opposite the main entrance to Birmingham New Street station.Police said they were treating it as an \"unprovoked attack\" and Det Insp James Nix said they were working to understand why it had happened.West Midlands police and crime commissioner Simon Foster said: \"This abhorrent and brutal attack is utterly shocking.\"He said tackling knife crime was his \"top priority\" and there had been \"significant reductions\" over the last year.\"However, I emphasise that I am not remotely complacent,\" he said. \"One victim of knife crime is one too many.\"\"We are absolutely committed to constant and unremitting and relentless action.\"It happened just outside the Bullring shopping centre on FridayShalini Doal, who works nearby, told the BBC she had seen the emergency response when she finished her shift at about 22:00 GMT on Friday.She described the scene as \"quite chaotic\" and said she and her colleagues were worried for their safety. Eleni Nazou, who also works in the city, said she had been at the bus stop at about 19:00 GMT that evening when travelling home. She said that when she heard the stabbing had happened just two hours later, she imagined: \"It could have been me.\" \"It did make me feel unsafe and a bit more guarded,\" she said. \"I don't know how I can protect myself.\"Eleni Nazou was at the bus stop on her way back from work just two hours before the attackAshley Birks, from Stoke-on-Trent, said he came to Birmingham fairly regularly to see his girlfriend, who lives in the city, and was concerned about what had happened.\"It makes me worried for my girlfriend,\" he said.\"She doesn't drive and works at all of the big music venues... and to think something completely unprovoked [happened], you know, it's horrible.\"Police said they believed the attack was \"unprovoked\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman stabbed in Birmingham near Bullring shopping centre dies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c7f2/live/2244dcf0-be43-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-10T19:17:16.000Z",
      "dateModified": "2025-11-10T19:17:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Flamingo missing from Cornwall park appears to be in France",
    "url": "https://www.bbc.com/news/articles/c5y0rr0yk11o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5db1/live/b8d46dc0-be61-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-10T13:51:01.000Z",
    "description": "Missing flamingo thought to be living in France6 hours agoLisa YoungCornwallAlice BeddowsParadise Park director Nick Reynolds said he hoped Frankie ca",
    "body": "Missing flamingo thought to be living in France6 hours agoLisa YoungCornwallAlice BeddowsParadise Park director Nick Reynolds said he hoped Frankie can find a colony of greater flamingos in southern France A flamingo that went missing from a wildlife sanctuary in Cornwall over a week ago appears to now be living in northern France.Two photographs show a young flamingo on a beach in Treflez, Finistere, on Sunday morning.Frankie escaped from a walled garden at the park on Sunday 2 November, despite having clipped feathers.Paradise Park director Nick Reynolds said there was a colony of greater flamingos in southern France and \"the best scenario would be that Frankie goes and finds them and lives out her life with them\".Paradise ParkMr Reynold said Frankie \"is still our baby\"Mr Reynolds said: \"We're pretty certain it is Frankie from the photos we've seen. \"You can see the right wing has some feathers missing, which is where we would have cut her wings to keep her here.\"We're just waiting for some more pictures to come through for better confirmation.\"Mr Reynolds added it had been a \"really difficult\" week since the flamingo went missing but seeing the new photographs had been \"lovely\".Alice BeddowsMr Reynolds said the team was \"waiting for some more pictures to come through for better confirmation\"\"She looks fit and well, which is brilliant,\" Mr Reynolds said.He said it was well within a flamingo's capabilities to fly that distance, albeit \"not a small feat\".He said the paperwork and complexities of bird flu regulations would make it challenging to rehome Frankie in the UK and he hoped that she found a flamingo colony in southern France.Frankie was born in July and was the first chick to hatch from her nest and be reared by her parents at the park.Mr Reynolds asked anyone who saw her to send photographs and locations to the team via the Paradise Park Facebook account.\"She's still our baby and we want to know what's happening with her,\" he said.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Flamingo missing from Cornwall park appears to be in France",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5db1/live/b8d46dc0-be61-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T13:51:01.000Z",
      "dateModified": "2025-11-10T13:51:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Second migrant sent to France returns to the UK  ",
    "url": "https://www.bbc.com/news/articles/c5y4ez53x7do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b736/live/3d8c5630-be4a-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-10T16:14:13.000Z",
    "description": "4 hours agoJennifer McKiernanPolitical reporterEPA/ShutterstockA second migrant who had been sent from the UK to France under the government's \"one in",
    "body": "4 hours agoJennifer McKiernanPolitical reporterEPA/ShutterstockA second migrant who had been sent from the UK to France under the government's \"one in, one out\" deal has returned to the UK, the Home Office has confirmed.The man was detained immediately, having been detected by biometrics, and will be sent back to France \"as quickly as possible\", the Home Office has said.The \"one in, one out\" pilot scheme with France is aimed at deterring migrants from coming to the UK in small boats across the English Channel.Last month, an Iranian man re-entered the UK by small boat one month after being removed to France. He was deported again last Wednesday.A Home Office spokesperson said officials would continue to catch and return anyone trying to re-enter the UK.\"Anyone looking to return to the UK after being removed under the UK-France agreement is wasting their time and money,\" the spokesperson said.\"This individual was detected by biometrics and detained immediately. His case will be expedited, and he will be returned to France as quickly as possible.\"The message is clear: if you try to return to the UK you will be sent back. We will do whatever it takes to scale up removals of illegal migrants and secure our borders.\"The first flight carrying a cross-Channel small boat migrant, an Indian national, landed in Paris on 18 September.The UK-France deal for a pilot scheme was struck in September and aims to deter small boat crossings by returning migrants.About 100 men were detained after arriving in the UK on a small boat, sent to  immigration removal centres near Heathrow, and told they may be returned to France. Last week, the Home Office confirmed 94 migrants have been returned to France and 57 people have arrived in the UK under the scheme so far.More than 500 migrants crossed the Channel by small boat on Saturday, 349 on Sunday, and 39,075 have made the journey so far this year.Home Secretary Shabana Mahmood is now considering a major restructure of the UK's immigration rules modelled on Denmark's system. At Labour conference in September, Mahmood promised to \"do whatever it takes\" to regain control of Britain's borders and is said to be impressed that Denmark has driven down its number of successful asylum claims to a 40-year low.Mahmood wants to reduce incentives for people seeking to enter the UK by tightening rules on family reunions, and make it easier to remove those found to have no right to stay.Downing Street insisted that the detection of a second \"one in, one out\" migrant returning to the UK showed the system was working.The prime minister's official spokesman said: \"You've got a person who's arrived at the front door, who's been detected immediately, their journey has been wasted completely.\"They are in line to return to France, just as the previous case was - out of pocket and out of chances - they are destined to go back straight to France and their money spent on this dangerous crossing will have been spent in vain.\"Liberal Democrat home affairs spokesman Max Wilkinson accused the Home Office of \"staggering levels of incompetence\" and called for asylum seekers to be moved out of hotels as well as \"large-scale returns agreements\" with all safe countries. \"Failures like this show just how broken our system is,\" he said. \"Now is the time for Labour to back up their big promises with actions.\"Shadow home secretary Chris Philp nearly 18,000 migrants had arrived in the UK since the deal was struck, with \"only a handful removed...which is why they continue to flood in\". Philp said only the Conservatives had a clear plan to tackle illegal migration, saying the party would leave the ECHR and remove all illegal immigrants within a week of arrival.He added: \"But Keir Starmer doesn't have the backbone to do this, and Reform are a one-man band with no detailed plans.\"Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Second migrant sent to France returns to the UK  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b736/live/3d8c5630-be4a-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-10T16:14:13.000Z",
      "dateModified": "2025-11-10T16:14:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump pardons Giuliani and others accused of plot to overturn 2020 election",
    "url": "https://www.bbc.com/news/articles/c1m321r73g4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/616e/live/75dad600-be37-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-10T15:21:30.000Z",
    "description": "5 hours agoJude SheerinGetty ImagesTrump's former personal lawyer Rudy Giuliani has been pardoned at federal levelUS President Donald Trump has pardon",
    "body": "5 hours agoJude SheerinGetty ImagesTrump's former personal lawyer Rudy Giuliani has been pardoned at federal levelUS President Donald Trump has pardoned his former personal lawyer Rudy Giuliani and dozens of other allies who stood accused of trying to overturn the result of the 2020 election.He also pardoned his former White House chief of staff, Mark Meadows, in a proclamation that vowed to \"end a grave national injustice\".Others who benefited from the clemency were a number of so-called false electors, who were accused of trying to hijack the process to certify Joe Biden, a Democrat, as the winner of the election five years ago.Trump's move is largely symbolic, however, since pardons only apply to federal crimes and all of the recipients were charged by state-level prosecutors only.Ed Martin, a justice department attorney, posted the \"full, complete and unconditional\" pardons on X.The pardons, said the text of the proclamation, would continue \"the process of national reconciliation\".White House press secretary Karoline Leavitt said in a statement to the BBC: \"Getting prosecuted for challenging results is something that happens in communist Venezuela, not the United States of America, and President Trump is putting an end to the Biden Regime's communist tactics once and for all.\"This round of clemency does not apply to Trump himself - who denies any wrongdoing - though the president has long maintained he has the power to pardon himself. But any such proclamation by him would face legal challenges.Giuliani declared bankruptcy two years ago after being found liable for $148m (£112m) for spreading falsehoods about Georgia election workers. He was disbarred as a lawyer in Washington DC and New York.Getty ImagesSidney Powell (centre) and Jenna Ellis (background left) were also pardonedAlso pardoned are former Trump lawyers Sidney Powell, Jenna Ellis, John Eastman and Kenneth Chesebro, who had filed unsuccessful lawsuits challenging the 2020 vote outcome.Powell had said after that election that electronic voting systems switched millions of votes to Biden and that the Democrat won thanks to \"communist money\" – claims that led Mr Trump's team to distance itself from her.On the day he returned to office this year, the Republican president pardoned hundreds of his supporters who were charged with involvement in the US Capitol riot of 2021.Trump himself was prosecuted on charges of plotting to overturn his loss in 2020, but that case brought by Biden's justice department was thrown out after Trump was re-elected.Some of the other election-related cases against Trump allies in Arizona, Georgia, Nevada, Michigan and Wisconsin have stalled or collapsed.Last September, a Michigan judge dismissed forgery and conspiracy charges against 15 Republicans accused of a plot to support Trump's claims he had won the 2020 vote.Electors are part of the 538-member Electoral College that officially elects presidents, based on the state-by-state results of the general election.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump pardons Giuliani and others accused of plot to overturn 2020 election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/616e/live/75dad600-be37-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T15:21:30.000Z",
      "dateModified": "2025-11-10T15:21:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delhi Red Fort explosion: At least eight killed after blast in car",
    "url": "https://www.bbc.com/news/articles/ceq0p8qnnrno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bd0e/live/555f73c0-be52-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-10T17:51:52.000Z",
    "description": "2 hours agoDoug Faulkner and Vikas Pandey,India editor, DelhiWatch: Verified video shows aftermath of car explosion in DelhiAt least eight people have",
    "body": "2 hours agoDoug Faulkner and Vikas Pandey,India editor, DelhiWatch: Verified video shows aftermath of car explosion in DelhiAt least eight people have been killed and more injured after a car exploded near Delhi's historic Red Fort, authorities have said.Delhi City police spokesperson, Sanjay Tyagi confirmed the deaths to the BBC, and said a further 20 people had suffered injuries.Police are investigating the cause of the explosion and \"exploring all possibilities\", Mr Tyagi said.Delhi Police Commissioner Satish Golcha has told reporters that the incident happened at around 18:52 local time (13:52 GMT), when a slow-moving vehicle stopped at a red light before it exploded, damaging nearby vehicles.Mr Tyagi told the BBC the explosion happened in a Hyundai i20 car that was moving and carrying three people at the time.Mumbai, India's financial capital, has been put on high alert, as has the Uttar Pradesh state which borders Delhi.The blast happened near a metro station close to the Red Fort, one of Delhi's most high-profile landmarks.The Mughal fortress, which is visited by thousands of tourists each year, was built in the 17th Century and is where Indian prime ministers give their Independence Day speeches every year. RAJAT GUPTA/EPA/ShutterstockIndia's Prime Minister Narendra Modi has sent his condolences to those who lost loved ones in the blast.Opposition leader Rahul Gandhi said in a statement that the news was \"extremely heartbreaking\".The federal home minister Amit Shah said teams from India's National Security Guard, and National Investigation Agency are investigating the explosion, along with forensic experts.\"We are exploring all possibilities and will conduct a thorough investigation, taking all possibilities into account. All options will be investigated immediately and we will present the results to the public,\" he added.The minister, who visited the site of the explosion and a nearby hospital, said a meeting involving senior officials would be held on Tuesday morning.Security is being stepped up at \"sensitive religious sites, vulnerable districts and border areas\" in the northern state of Uttar Pradesh, according to senior police official Amitabh Yash following the blast in neighbouring Delhi.Uttar Pradesh is home to famous sites such as the Taj Mahal and is a densely populated state.REUTERS/StringerAt least eight people died and 20 more were injured when the Hyundai i20 exploded, authorities saidVeeru Sindhi, a local businessman at the site when the explosion happened, described scenes of devastation, with multiple bodies and vehicles engulfed in flames.\"I am fully shaken by what I have seen,\" he told the BBC. \"We tried to rescue people who were trapped inside the vehicles.\"One eyewitness described the aftermath of the blast as chaotic and confusing.He was just a few hundred metres away from the spot when he heard a loud explosion.\"It felt like everything stopped for a few seconds before everyone started running in all directions,\" he told the BBC.He did not go near the site but could see mangled car parts on fire and locals trying to help the injured.There has been a heavy security presence at the blast site with personnel from the Uttar Pradesh Anti-Terrorist Squad (ATS), the National Security Guard (NSG), and the Central Reserve Police Force (CRPF). Armed officers have been seen moving towards the area as investigations continue.Additional reporting by Charlotte Scarr and Dilnawaz Pasha.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delhi Red Fort explosion: At least eight killed after blast in car",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bd0e/live/555f73c0-be52-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T17:51:52.000Z",
      "dateModified": "2025-11-10T17:51:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sex schedules and other people: How I keep my relationship alive",
    "url": "https://www.bbc.com/news/articles/cj97rd0zvejo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e33b/live/50b0e800-be1f-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-10T01:55:58.000Z",
    "description": "18 hours agoYasmin RufoBBC News Nell FrizzellBetween deadlines, school runs and the constant \"what's for dinner?\" chat, even the best relationships ca",
    "body": "18 hours agoYasmin RufoBBC News Nell FrizzellBetween deadlines, school runs and the constant \"what's for dinner?\" chat, even the best relationships can start running on autopilot.It doesn't mean the spark has gone or that you've stopped loving your partner, but rather that life has got in the way.Writer Nell Frizzell knows this all too well - after 10 years with her partner and two young children, she admits she doesn't have as much time or energy for her husband as she once did.\"I know we're told to focus on quality time, physical touch and gaze into each other's eyes lovingly but actually I am shouting at my husband to turn the eggs off.\" Frizzell says she's at a \"crunch point\" in her life. Her time, body and attention are being pulled in every direction - she's raising children, caring for elderly parents, running the home and working all at the same time.\"And within all of that, where do you have the time to look into someone's eyes and say you're wonderful?\" she asks.Bring other people inBut Frizzell has discovered something that helps keep her relationship connection alive - something she calls a \"third energy\".Not in the bedroom, she laughs, but at the dinner table.\"If we go away, we go with another family and if we go out to dinner, I love having friends there,\" she explains.It's a surprisingly simple idea - but Frizzell says having dinner with another couple, friends or family really does work as the presence of other people naturally changes the dynamic.She says sometimes a so-called date night \"where you're sat across the table with the person you live with and trying to come up with something new to say\" can be intense, so another person can help provide a new conversation starter or a fresh perspective.Frizzell says: \"I find him incredibly attractive when we're with people we don't see all the time as they ask him questions I wouldn't think to ask or tell him things I wouldn't tell him.\"Nell FrizellNell and her husband say a \"third energy\" has really improved their relationship Psychotherapist Susanna Abse says a little space and variety can be vital to a successful relationship.\"Couples can end up moving around each other but avoiding real contact,\" she says.Truly noticing your partner can make a big difference.  \"Instead of coming downstairs in the morning and getting on with millions of chores, see what state your partner is in.\" Abse recommends asking them questions like how they are feeling or what their day looks like as \"curiosity is key\". Clinical psychologist Dr Amani Milligan says spending quality time together is also important.That doesn't mean a grand gesture and Dr Milligan says it can be as simple as taking a random Thursday off work together or setting rules like no phones before bed so you can catch up on each other's days.Relationships can come with endless distractions from emails and notifications on your phone to endless piles of laundry or dishes that need sorting.Abse says electronic devices can make couples more distant.\"Protest if your partner is on their phone all the time and set some rules you can both agree to.\"Schedule sexIt's near impossible to talk about keeping love alive without mentioning physical intimacy and Frizzell swears by scheduling it.\"It might feel administrative to say 'this is when we'll have sex' but with small children, it's absolutely key and it's something to look forward to.\"Abse agrees with that practical approach and says if you're not having sex \"you have to recognise the risk in that\" if you're both not happy with the arrangement as \"affairs often arise from unsatisfied needs\".When we're time poor or have a lot on, sex can be one of the first things to go but Abse says you should try to \"allow yourself to be persuadable\".\"You don't get into bed feeling very sexual but maybe with your partner's attention that might change.\"Focusing more on each other and seeing her partner anew has improved Frizzell's relationship.The final lesson she has learnt is that it's important to keep a little mystery from each other. \"Close the toilet door and have a bit of separation - by all means have a joint project but that shouldn't be going to the loo,\" she laughs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sex schedules and other people: How I keep my relationship alive",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e33b/live/50b0e800-be1f-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-10T01:55:58.000Z",
      "dateModified": "2025-11-10T01:55:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]