[
  {
    "title": "Cheryl Grimmer: Person of interest in British girl's disappearance named in parliament",
    "url": "https://www.bbc.com/news/articles/cx2082pqyl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d6f8/live/bd878270-afa3-11f0-8ae2-b93303373d25.jpg",
    "tag": "Trending",
    "date": "2025-10-23T02:03:15.000Z",
    "description": "2 hours agoKaty WatsonAustralia correspondentThe identity of a key person of interest in the disappearance of a British girl more than 50 years ago ha",
    "body": "2 hours agoKaty WatsonAustralia correspondentThe identity of a key person of interest in the disappearance of a British girl more than 50 years ago has been revealed by an Australian politician.A member of New South Wales Legislative Council used parliamentary privilege to name the man known as Mercury, whose identity is protected by law. The BBC has chosen not to name him.Three-year-old Cheryl Grimmer was abducted from Fairy Meadow beach in Wollongong in 1970. Despite extensive searches, there were no leads.Then in 2017, Mercury was charged with Cheryl's abduction and murder after officers discovered a confession made by a teenager in 1971. But a judge ruled it was inadmissible and the case was dropped. Mercury says he is innocent.In parliament on Thursday, Jeremy Buckingham read out Mercury's real name - suppressed because he was a minor at the time - and his teenage confession, calling for a new investigation into Cheryl's murder.\"The family of Cheryl Grimmer have been through so much anguish over such a long period of time,\" he said.\"[Mercury] is a free man living with his identity suppressed from his neighbours and no one has been punished for Cheryl Grimmer's abduction and murder.\"Cheryl's family - some of whom were in the public gallery on Thursday as Mercury was named - has been pushing for a fresh inquiry since the trial fell over six years ago. Last week they gave Mercury an ultimatum, urging him to explain to the family how he knew information contained in his confession or be publicly identified.\"He has been given the opportunity to declare his innocence or guilt, yet he has chosen to remain silent,\" Linda Grimmer, wife of Cheryl's brother Paul, told reporters after the name was revealed in parliament. She said the family was not \"seeking to harm Mercury or his family\" with this move.\"What we want is now the truth. We hope that by speaking out today, members of the public who may hold information will come forward so that Mercury can be questioned in a court of law and justice for Cheryl can finally be served.\"Cheryl was last seen running into a changing room block on 12 January 1970, after a day at the beach with her family, who had only recently migrated to Australia from Bristol as so-called Ten Pound Poms.Last week, the family released a lengthy document detailing the missteps they say were made by authorities in NSW in the search for Cheryl.The family was recently told that a four-year-long review of the case found there was no new evidence that could lead to a conviction - even though the BBC's Fairy Meadow true crime podcast in 2022 unearthed three new potential witnesses.NSW Police have defended their investigations, reiterating that homicide detectives are still looking into Cheryl's disappearance - and that a A$1m ($649,000, £486,000) reward for information remains on offer.The family, alongside a volunteer team using cadaver detection dogs, has recently been searching an \"area of interest\" they hoped would be a breakthrough in the case. But police said that a subsequent inspection of the area only found animal bones.Earlier this month, the NSW parliament announced an inquiry into long-term missing persons cases in the state - including Cheryl's. It will look into how investigations have been carried out and ways to improve outcomes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheryl Grimmer: Person of interest in British girl's disappearance named in parliament",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d6f8/live/bd878270-afa3-11f0-8ae2-b93303373d25.jpg"
      ],
      "datePublished": "2025-10-23T02:03:15.000Z",
      "dateModified": "2025-10-23T02:03:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British man drowns in Australia after surfboard snaps",
    "url": "https://www.bbc.com/news/articles/cm27xnvz2eyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ee2/live/11966e80-afb8-11f0-bfbe-8378f5515054.jpg",
    "tag": "Trending",
    "date": "2025-10-23T02:40:06.000Z",
    "description": "2 hours agoLana LamSydneyGetty ImagesA British surfer and his friend drowned in wild weather at Frankston Beach near MelbourneA British man has drowne",
    "body": "2 hours agoLana LamSydneyGetty ImagesA British surfer and his friend drowned in wild weather at Frankston Beach near MelbourneA British man has drowned after his surfboard snapped during wild weather in the Australian state of Victoria while the friend who tried to save him also died.Police were called to Frankston Beach, about 45km (28 miles) south-east of Melbourne, on Wednesday afternoon after receiving reports two men were in trouble in the water.A police helicopter arrived within 15 minutes and the two men were winched back to shore but neither could be revived. The officer who retrieved the men was treated in hospital after swallowing water and later released.Neither man has been formally identified as police are yet to notify their families. A report for each man will be prepared for the coroner.Police said they had alerted the public to stay out of the water on Wednesday due to high winds, with the state experiencing wind gusts of up to 130km.Detective Inspector Melissa Nixon said the surfer, 36, had \"minimal experience\" and \"it appears he may have only been learning to surf\".\"The weather conditions yesterday were obviously not appropriate to be in the water surfing, whether you're experienced or not,\" she said.The other man, aged 43, saw his friend was in distress and struggling in the water after his surfboard broke.\"They've actually jumped into the water to help and conditions were that bad, he's obviously succumbed to the conditions of the waves and the water,\" Nixon said.She described the scenes of the two men being retrieved from the water as confronting and said the two deaths had been preventable.She urged the public to not go surfing or swimming under treacherous conditions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British man drowns in Australia after surfboard snaps",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9ee2/live/11966e80-afb8-11f0-bfbe-8378f5515054.jpg"
      ],
      "datePublished": "2025-10-23T02:40:06.000Z",
      "dateModified": "2025-10-23T02:40:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Agatha Christie meets Mr Men in new children's books",
    "url": "https://www.bbc.com/news/articles/cdx42rv2wgqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db96/live/e80f1a80-ae86-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-22T23:37:04.000Z",
    "description": "5 hours agoEmma SaundersCulture reporterTHOIP (a SANRIO company)/Agatha Christie LtdMiss Marple and Mr Poirot have been given the Little Miss and Mr M",
    "body": "5 hours agoEmma SaundersCulture reporterTHOIP (a SANRIO company)/Agatha Christie LtdMiss Marple and Mr Poirot have been given the Little Miss and Mr Men treatmentIn a first for Agatha Christie, four of the crime novelist's famous mysteries are being adapted for children – with the help of the Mr Men and Little Misses.The illustrated books, aimed at pre-school and primary age children, will feature Christie detectives Hercule Poirot and Miss Marple working alongside Roger Hargreaves's much-loved children's characters.Two of the books will be published on Thursday - Little Miss Marple: Muddle at the Vicarage and Mr Poirot: Mischief on the Nile – with two more to follow in February.James Prichard, Agatha Christie's great grandson, said it was a \"dream collaboration.\"Prichard, who is also the chair and CEO of Agatha Christie's estate, added: \"These clever and very funny re-imaginings of my great grandmother's stories, which include some of my favourite characters (in rather suspicious circumstances!), are bound to delight fans of both authors.\"Little Miss Marple: Muddle at the Vicarage will see the super-sleuth get involved when Reverend Muddle suspects there's been a theft at the vicarage. The amateur detective is determined to uncover the truth with the help of Inspector Nonsense and Constable Silly.In Mr. Poirot: Mischief on the Nile, the Belgian investigator meets Colonel Rush while cruising on the Nile. The pair soon find themselves uncovering a mischievous mystery with the help of Mr Tickle and his extraordinarily long arms.The two stories are loosely inspired by Christie's Death on the Nile and Murder at the Vicarage, but with a charming and humorous twist for younger mystery fans (and thankfully, not a murder in sight).Adam Hargreaves, whose father created the Mr Men in 1971, and who has written and illustrated for the series himself since 1998, said: \"It has been a real pleasure and an intriguing challenge to bring together the timeless mysteries of Agatha Christie with the playful world of the Mr Men and Little Miss. \"Agatha Christie's iconic stories now have a new twist that neither she nor my father might have imagined!\"The partnership will form part of Agatha Christie Limited's anniversary programme next year, which will mark 50 years since the celebrated author's death, 100 years since the publication of Poirot novel, The Murder of Roger Ackroyd, and 50 years since the release of Sleeping Murder. Although not the last book she wrote, the latter was the final novel to be published by Christie, posthumously in 1976, and featured Miss Marple.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Agatha Christie meets Mr Men in new children's books",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/db96/live/e80f1a80-ae86-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-22T23:37:04.000Z",
      "dateModified": "2025-10-22T23:37:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'One in, one out and back in again' and 'teen killer unmasked'",
    "url": "https://www.bbc.com/news/articles/cp8ylgz198no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1441/live/06484f10-af97-11f0-b2a1-6f537f66f9aa.png",
    "tag": "Trending",
    "date": "2025-10-22T23:05:52.000Z",
    "description": "5 hours ago\"It's one in, one out and back in again!\" for the Daily Express as it says a migrant sent to France - under the prime minister's immigratio",
    "body": "5 hours ago\"It's one in, one out and back in again!\" for the Daily Express as it says a migrant sent to France - under the prime minister's immigration scheme - has returned to the UK \"on a small boat\". Tories have branded the news a \"farce\" says the Express, adding the return is \"making a mockery of Sir Keir Starmer's 'one in, one out' deal with France.The Daily Telegraph also goes with \"one in, one out then back in again\" for its top line calling it a \"major embarrassment to Sir Keir Starmer\". In other front page news, Jim Gamble, a former police chief \"lined up to lead\" the national inquiry into grooming gangs has withdrawn his candidacy.Metro carries the same headline as the Express and Telegraph, calling it a \"bizarre twist in Starmer's migrant plan\". The face of \"schoolboy Harvey's killer\" is also seen on the front page, as 15-year-old Mohammed Umar Khan has been sentenced to life for the murder of Harvey Willgoose.The Daily Mail dubs the migrant scheme \"le farce\" as it reports a man who has returned to the UK made his second Channel crossing \"just 29 days after he was kicked out of the country\".For The Sun, it says \"come again?\" as it reports on the migrants who have returned. A shot of a dinghy filled with people attempting to cross the Channel takes up much of its front page. The paper quotes Reform UK leader Nigel Farage who says \"illegals are laughing at us\". The Daily Mirror goes with \"unmasked\" for its main headline. The front page is dominated by the newly-released photos of the 15-year-old who fatally stabbed teenager Harvey Willgoose in February.The Guardian leads with the latest on the grooming gang inquiry calling Jim Gamble's exit \"fresh turmoil\". He was the only remaining candidate to chair the inquiry, it writes. A photo of three men in hard hats each carrying a toddler is the paper's lead image - taken in Ukraine, the paper says, after a Kharkiv nursery was hit in a \"wave of Russian airstrikes\".The Times also tops with the grooming inquiry, as it reports \"victims say minister should quit\". Four survivors who quit the inquiry panel said they would only return if Safeguarding Minister Jess Phillips steps down. The paper reports survivors have sent a letter to the home secretary saying Phillips is \"unfit\" to oversee the process. Phillips has denied claims the government is seeking to dilute the focus of the inquiry, insisting its scope will be \"laser-focused\".Chancellor Rachel Reeves has been \"urged\" to raise income tax \"as Labour Budget splits emerge\" according to The i Paper. A \"bold move\" is what senior Labour figures argue will \"help fix the UK public finances - and raise £22bn next month\".The Financial Times also headlines on the chancellor, as \"lawyers and accountants rail against Reeves' plans for tax raid on partners\". The paper says they argue the \"raid would hit a cornerstone of the economy\".There's a \"traitor at the Beeb\" writes the Star, as \"celeb circles are awash\" with spoilers for the Traitors finale. It claims TV chiefs are \"battling to keep result under wraps\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'One in, one out and back in again' and 'teen killer unmasked'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1441/live/06484f10-af97-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-10-22T23:05:52.000Z",
      "dateModified": "2025-10-22T23:05:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pressure mounts on No 10 over grooming inquiry as survivors list demands",
    "url": "https://www.bbc.com/news/articles/cly285e5ljyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9e5/live/9578b340-afa7-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-23T03:37:51.000Z",
    "description": "37 minutes agoHarry Farley,Political correspondent and Chris GrahamPA MediaSafeguarding Minister Jess Phillips was accused of \"betrayal\" by four groom",
    "body": "37 minutes agoHarry Farley,Political correspondent and Chris GrahamPA MediaSafeguarding Minister Jess Phillips was accused of \"betrayal\" by four grooming gang survivorsThe government is under increasing pressure to gain control of the grooming gangs inquiry after abuse survivors who quit their roles in the process listed conditions for their return.Top of the demands - published in a joint letter to the home secretary - was the resignation of Safeguarding Minister Jess Phillips, who the four women accuse of \"betrayal\", citing her response to their concerns about the inquiry's scope.They said Phillips had lost survivors' trust, and that she and candidates to chair the inquiry were unfit for their roles. Her exit would mean the government was \"serious about accountability\", they added.Home Office sources insist Phillips has the home secretary's full support.The letter came hours after former senior police officer Jim Gamble ruled himself out of chairing the inquiry, saying focus on political \"point-scoring\" had created a \"highly charged and toxic environment\". He was the last significant candidate after Annie Hudson, who has a background in social work, withdrew earlier in the week.On Wednesday, Jess, which is not her real name, joined Fiona Goddard, Ellie Reynolds and Elizabeth, also not her real name, in standing down from the survivors' panel.They raised concerns that those being lined up to lead the inquiry had backgrounds in either policing or social work, citing the failures of those services to bring their abusers to justice.They also said the inquiry was being widened \"in ways that downplay the racial and religious motivations behind our abuse\".Phillips has said it is \"untrue\" the government is seeking to dilute the focus of the inquiry, insisting its scope will be \"laser-focused\".In a joint letter to Home Secretary Shabana Mahmood, posted on X by Ms Reynolds, they criticise Phillips for rejecting their accounts of concerns about the inquiry's direction. \"Being publicly contradicted and dismissed by a government minister when you are a survivor telling the truth takes you right back to that feeling of not being believed all over again. It is a betrayal that has destroyed what little trust remained,\" they said.Their letter lists five demands before they would consider returning to the panel.Among them is keeping the probe focused on grooming gangs and group child exploitation, as Baroness Louise Casey - whose report recommended a statutory inquiry - advised. They also want a senior or former judge to chair the inquiry, and to have a say in their selection.Watch: PM says grooming gangs inquiry will examine \"ethnicity and religion of offenders\"Prime Minister Sir Keir Starmer announced in June there would be a national inquiry into grooming gangs covering England and Wales, with a panel of survivors set up to oversee the process. However, a chairperson has yet to be appointed.Not all the survivors on the oversight panel agree with the four women; many continue to support the government's approach. The BBC spoke to two of those women.Samantha Walker-Roberts, from Oldham, wants the scope of the inquiry to include victims of other types of sexual abuse, so they are not \"silenced\".She was the victim of a grooming gang when she was 12 - but she was also raped and abused by a man who groomed her online, and as a younger child she was raped and abused by older men who she met through friends.Ms Walker-Roberts said: \"This is a one-of-a-kind type of inquiry where survivors are in control and it's wrong that certain survivors get special treatment to be part of this.\"She added she had no problem with a chair who had a background in policing or social work, as this had been \"proven\" to work with previous reviews.Another supporter of the inquiry is Carly, from Huddersfield, who said she believes \"the most effective way to drive meaningful change is from within\" and remains \"hopeful\" the concerns raised by others \"will lead to constructive improvements\".Watch: Abuse survivor Ellie Reynolds says a judge should lead grooming gangs inquiryMaggie Oliver, a police whistleblower and child protection campaigner, echoed survivors' criticism of Phillips on Wednesday night, but also criticised the government's handling of the inquiry.She told BBC Newsnight that the prime minister was \"dragged kicking and screaming\" into announcing the inquiry.\"We shouldn't be fighting a battle with the government,\" she said. \"The inquiry is being led, or has been led, by a government that really doesn't want it to work.\"Ms Oliver also raised concerns about transparency and survivor involvement: \"We want a judge-led inquiry... I want it to be open and to involve all survivors and victims who want to be involved, not just a cherry-picked selection of a few.\"On Wednesday night, the Home Office reiterated its commitment to \"a full, statutory, national inquiry to uncover the truth\".Conservative leader Kemi Badenoch joined calls for Phillips to be sacked, saying the inquiry is about \"Labour failure\".She said: \"Labour never wanted this inquiry, we demanded it... It is Labour ministers attacking the victims. We're standing up for them.\"Speaking at PMQs on Wednesday, the prime minister defended Phillips, saying she \"has probably more experience than any other person in this House in dealing with violence against women and girls\".He said \"survivors have been ignored for many years\" by the state and he wanted the inquiry to change that, adding \"injustice will have no place to hide.\"He invited those that have quit the inquiry to re-join, but added that whether they did or not \"we owe it to them\" to answer their concerns.\"The inquiry is not and will never be watered down. Its scope will not change. It will examine the ethnicity and religion of the offenders and we will find the right person to chair the inquiry,\" he told MPs.The prime minister also announced Baroness Casey was being drafted in to support the work of the inquiry.Baroness Casey previously led a \"national audit\" of group-based child sexual exploitation that found the ethnicity of people involved in grooming gangs had been \"shied away from\" by authorities.Her findings, published in June 2025, prompted Sir Keir to order the creation of the national inquiry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pressure mounts on No 10 over grooming inquiry as survivors list demands",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9e5/live/9578b340-afa7-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-23T03:37:51.000Z",
      "dateModified": "2025-10-23T03:37:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shabana Mahmood says Home Office 'not yet fit for purpose'",
    "url": "https://www.bbc.com/news/articles/clyl20gw4y2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/297e/live/9fdf2c40-af90-11f0-b913-f3ce4c5c6c56.jpg",
    "tag": "Trending",
    "date": "2025-10-23T01:02:11.000Z",
    "description": "3 hours agoSam FrancisPolitical reporter PA MediaHome Secretary Shabana Mahmood has said her department is \"not yet fit for purpose\" after an internal",
    "body": "3 hours agoSam FrancisPolitical reporter PA MediaHome Secretary Shabana Mahmood has said her department is \"not yet fit for purpose\" after an internal report labelled it dysfunctional and detached from its core functions.Mahmood, who took office last month, said the Home Office had been \"set up to fail\" but said she was working to rebuild it so it \"delivers for this country\".Her comments come after a \"damning\" report uncovered by The Times newspaper found a \"culture of defeatism\" on immigration and failures making it harder to tackle crime and small boats crossings. The report, by the former Home Office special adviser Nick Timothy - who is now a Conservative MP - was commissioned in 2022 by the then home secretary Suella Braverman.Timothy was given access to the department and officials to carry out a two-month review of its effectiveness.He found \"too much time is wasted\" on identity politics and social issues at the Home Office, including \"listening circles\" in working hours in which civil servants meet to discuss their feelings about social and political issues.He warned that the department's performance was \"uneven\" with fragmented structures and no single official responsible for the immigration system as a whole.Among the most serious criticisms was the handling of asylum and immigration. The report described the system as \"lethargic\", with a backlog of 166,000 asylum cases and interviews often delayed for up to two years. Timothy found many civil servants refuse to work in immigration because they were either \"ethically\" opposed to controlling borders or fear the blame when things go wrong.It said the asylum process took an overly \"defensive approach\", with \"assessments of likely legal challenge, and even the possibility of defeat\" used \"as a reason not to do something\".He also highlighted chronic problems with data and technology, warning that the department relied on outdated systems that made it \"impossible to answer straightforward questions quickly\". Timothy dismissed calls to split up the department, calling it a \"distraction from the delivery of core business\".Instead he called for urgent investment in modern, interoperable systems to improve decision-making.\"This report, written under the last Government, is damning. To those who have encountered the Home Office in recent years, the revelations are all too familiar.\"The Home Office is not yet fit for purpose, and has been set up for failure. As this report shows, the last Conservative government knew this, but failed to do anything about it.\"Things are now changing. I will work, with the new permanent secretary, to transform the Home Office so that it delivers for this country.\"Mahmood's words echo those of former Labour Home Secretary John Reid, whose warning two decades ago sparked one of Whitehall's biggest shake-ups.In May 2006, Reid told MPs the immigration system was \"not fit for purpose\" following revelations foreign prisoners had been released without being considered for deportation. Reid's warning triggered major reforms that created the Ministry of Justice to run prisons and probation.A senior source told the BBC that Permanent Secretary Antonia Romeo aims to make the Home Office \"the 'blue-chip' department of Whitehall, and the destination department for top talent\".\"Antonia will be relentless in transforming the Home Office to get it match fit,\" the source said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shabana Mahmood says Home Office 'not yet fit for purpose'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/297e/live/9fdf2c40-af90-11f0-b913-f3ce4c5c6c56.jpg"
      ],
      "datePublished": "2025-10-23T01:02:11.000Z",
      "dateModified": "2025-10-23T01:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US axes website for reporting human rights abuses by US-armed foreign forces",
    "url": "https://www.bbc.com/news/articles/cqx30vnwd4do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a8a5/live/589812e0-af93-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-23T00:59:06.000Z",
    "description": "3 hours agoTom BatemanState Department correspondentGetty ImagesAllegations of excessive use of force during anti-government protests in Colombia in 2",
    "body": "3 hours agoTom BatemanState Department correspondentGetty ImagesAllegations of excessive use of force during anti-government protests in Colombia in 2021 were reported on the tip lineThe US State Department has removed an online portal for reporting alleged human rights violations by foreign military units supplied with American weapons.The Human Rights Reporting Gateway (HRG) acted as a formal \"tip line\" to the US government.It was the only publicly accessible channel of its kind for organisations or individuals to inform it directly of potentially serious abuses by US-armed foreign forces.Its deletion has been condemned by human rights campaigners and by a senior congressional aide who drafted the law requiring it. The State Department insisted it was still abiding by the law.The portal was established in 2022 following pressure on successive administrations to abide by updated provisions of the Leahy Law, named after former US Senator Patrick Leahy. These require the government to \"facilitate receipt\" of information on alleged gross violations of human rights by military units supplied by Washington.Among the cases submitted via the HRG was the alleged excessive use of force by security forces during anti-government protests in Colombia, while several cases were due to be submitted relating to US-armed units of the Israel Defense Forces (IDF) in the occupied West Bank, according to Amnesty International.BBC NewsThe State Department portal where violations could be reported - before it was taken downTim Rieser, former senior aide to Senator Leahy who wrote the 2011 amendment mandating information gathering, told the BBC the gateway's removal meant the State Department was \"clearly ignoring the law\".He added it was a further sign that \"the entire human rights architecture\" within the department was being \"rendered largely ineffective\".\"The United States will find itself supporting foreign security forces that commit heinous crimes even though nothing is done about it,\" said Mr Rieser. \"As a result there will be less incentive for foreign governments to bring people who commit such crimes to justice.\"In response, the US State Department insisted it was continuing to receive reports regarding gross violations of human rights and was engaging with \"credible organisations\" on a full spectrum of human rights concerns.  It said: \"The Department abides by its legal requirements\".Secretary of State Marco Rubio has overseen a sweeping reorganisation of the State Department involving widespread layoffs and eliminating some offices focused on human rights monitoring. The department this year released a slimmed-down annual human rights report which critics said omitted alleged crimes by US allies but included those by foreign leaders the Trump administration opposes.The department has previously said its restructure made it leaner and more efficient and followed President Trump's \"America First\" foreign policy which sees some human rights promotion as ideologically driven.Charles Blaha, former Director of the Office of Security and Human Rights at the State Department, said people in the field would now have \"no established channel\" for reporting gross violations of human rights by foreign security forces.The government's ability to deter abuses was \"severely weakened\", said Mr Blaha who is now an adviser to the Washington-based think tank Democracy for the Arab World Now (DAWN).The BBC learned during the summer that the HRG site was earmarked for deletion. Its removal was highlighted by DAWN in August but has not previously been acknowledged by the State Department. The BBC confirmed this week that officials phased out the reporting channel during the department's restructure.Screengrabs of the portal taken by the BBC before its deletion show it asked for information on US-armed foreign military units involved in alleged abuses including extrajudicial killings, forced disappearances, torture and rape. It required extensive details to ensure credible reporting including unit names, identities of alleged perpetrators, specific locations and dates.Blaha had already voiced frustration that despite the HRG passing its pilot phase, the Biden administration had not done enough to publicise it, meaning the provision to \"facilitate receipt\" of information was still not being fully honoured before the Trump administration deleted the channel entirely.The US is the world's biggest contributor of military aid to foreign countries, supplying funding, equipment, training and arms to more than 150 nations. Its vetting procedures to prevent arms going to units involved in breaches of international law have evolved over the years, with the 1997 legislation named after Senator Leahy being one its major pillars.At the heart of the law is Congress sending a message to the administration that taxpayer funding cannot support human rights abuses abroad, says Amanda Klasing, who oversees government relations at Amnesty International USA.\"If I'm a member of Congress, my perspective is: 'I want to protect my constituents and their taxpayer funding from going to torturers or people that kill their own citizens for protesting,\" she told the BBC.Klasing oversaw the compilation and submission of several reports to the Human Rights Reporting Gateway.These included allegations that American arms were used by Colombian security forces during mass anti-government protests in 2021, in which at least 47 people were killed and many wounded according to the group. Amnesty says among the arms were US-supplied high-capacity launchers for stun and smoke grenades.Klasing says she had also gathered evidence relating to the killing of 20 Palestinians during IDF raids in occupied East Jerusalem and the West Bank in October and November 2023. Amnesty was preparing to submit its report on these incidents to the HRG before its deletion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US axes website for reporting human rights abuses by US-armed foreign forces",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a8a5/live/589812e0-af93-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-23T00:59:06.000Z",
      "dateModified": "2025-10-23T00:59:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US sanctions Russian oil companies after failed Putin talks",
    "url": "https://www.bbc.com/news/articles/cd6758pn6ylo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1c70/live/3b154940-af84-11f0-8cf5-47a716327516.jpg",
    "tag": "Trending",
    "date": "2025-10-23T03:39:06.000Z",
    "description": "Trump says Putin talks 'don't go anywhere' as he imposes new sanctions 36 minutes agoBernd Debusmann Jr,at the White House and Max Matza'It was time',",
    "body": "Trump says Putin talks 'don't go anywhere' as he imposes new sanctions 36 minutes agoBernd Debusmann Jr,at the White House and Max Matza'It was time', says Trump on increase in Russia sanctionsThe US has announced new sanctions targeting Russia's two largest oil companies - Rosneft and Lukoil - in an effort to pressure Moscow to negotiate a peace deal in Ukraine.\"Every time I speak to Vladimir, I have good conversations and then they don't go anywhere. They just don't go anywhere,\" President Donald Trump said, after a meeting with Nato Secretary-General Mark Rutte to discuss peace negotiations. The sanctions announcement came one day after Trump said a meeting planned with Russian President Vladimir Putin in Budapest would be shelved indefinitely.Earlier Wednesday, Russia unleashed an intense bombardment on Ukraine that killed at least seven people, including children. US Treasury Secretary Scott Bessent said the new sanctions were needed due to \"Putin's refusal to end this senseless war\". He said these oil companies fund the Kremlin's \"war machine\". \"Now is the time to stop the killing and for an immediate ceasefire,\" Bessent said in a statement.Speaking alongside Rutte in the Oval Office on Wednesday, Trump criticised Putin for not being serious about making peace and said he hoped that the sanctions would help force a breakthrough.\"I just felt it was time. We waited a long time,\" Trump said.He called the sanctions package \"tremendous\", and added that he hoped they could be swiftly withdrawn if Russia agrees to stop the war. Rutte also praised the move, saying it was \"putting more pressure\" on Putin.\"You have to put pressure, and that is just what he did today,\" Rutte said.Getty ImagesTrump and Putin met in Alaska in August in hopes of ending the war in Ukraine. A second meeting has now been shelved. The move comes as key differences between US and Russian proposals for peace became increasingly clear this week. Trump has indicated that a key sticking point has been Moscow's refusal to cease fighting along the current front line. US Secretary of State Marco Rubio said the US still wanted to meet Russia.Last week, the UK slapped a similar sanctions package on Rosneft and Lukoil.\"There is no place for Russian oil on global markets,\" UK Chancellor Rachel Reeves said while announcing the move.Responding to the UK, Russia's embassy in London said targeting its country's major energy companies would disrupt global fuel supplies and drive up costs worldwide.It also said the sanctions would have \"a detrimental impact on the energy security\" of developing and underdeveloped countries, adding \"pressure only complicates peaceful dialogue and leads to further escalation\".The two Russian oil firms export 3.1 million barrels of oil per day. Rosneft is responsible for nearly half of all Russian oil production, which makes up 6% of the global output, according to estimates from the UK government.Oil and gas are Russia's biggest exports, and Moscow's biggest customers include China, India and Turkey. Trump has also urged these countries to halt purchases of Russian oil in a bid to put economic pressure on the Kremlin.Trump's move was praised by UK Foreign Secretary Yvette Cooper, who said the US sanctions are \"strongly welcome\". Children among victims in Russian strikes, hours after Trump-Putin talks shelvedWhy Trump made breakthrough in Gaza but can't with Putin over UkraineEU Commission President Ursula Von der Leyen posted on X that she spoke by phone to Bessent on Wednesday about \"Russia's lack of commitment to the peace process\". She also praised a new sanctions package approved by the European Union on Wednesday, which includes a ban on Russian liquefied natural gas imports.\"With the imminent adoption of the EU's 19th package, this is a clear signal from both sides of the Atlantic that we will keep up collective pressure on the aggressor,\" she wrote.Earlier this year, the UK and US also sanctioned major Russian energy companies Gazprom Neft and Surgutneftegas.At the White House, Rutte was expected to discuss a 12-point plan formulated by European NATO allies and Kyiv, which would see the current front lines frozen, a return of deported children as well as a prisoner exchange between the two warring countries. The plan also includes a war recovery fund for Ukraine, as well as security pathways and a clear pathway for Ukraine to join the EU, as well as increased military aid to Kyiv and economic pressure on Moscow. Earlier this week, Trump said he did not want a \"wasted meeting\" with Putin in Budapest, and suggested a main point of contention is Moscow's refusal to cease fighting along the current front lines of the war. He last met with Putin in Alaska for a summit the White House hoped would lead to the end of the conflict. Instead, the fighting has continued. A preparatory meeting between US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov was also shelved. The meeting this week was no longer \"necessary\" after a \"productive\" call, the White House said. Trump has repeatedly endorsed proposals to freeze the fighting along current frontlines. \"Let it be cut the way it is,\" he said on Monday. \"I said: cut and stop at the battle line. Go home. Stop fighting, stop killing people.\"Europe's leaders back Trump call for frontline freeze but Russia says noRussia has pushed back against that idea, with Kremlin spokesperson Dmitry Peskov saying that \"the consistency of Russia's position doesn't change\" -  a reference to its desire for Ukrainian troops to leave the Donbas region in Ukraine's east. On Wednesday, Trump also pushed back against reporting in the Wall Street Journal that the US had approved Ukrainian long-range missile strikes into Russia, calling it \"fake news\". Ukrainian President Volodomyr Zelensky has expressed a desire for the US to supply long-range US Tomahawk missiles to his forces and suggested that the threat of their introduction to the war theatre may bring Russia to the negotiating table. Pritti Mistry and Danielle Kaye contributed to this report",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US sanctions Russian oil companies after failed Putin talks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1c70/live/3b154940-af84-11f0-8cf5-47a716327516.jpg"
      ],
      "datePublished": "2025-10-23T03:39:06.000Z",
      "dateModified": "2025-10-23T03:39:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stable inflation gives chancellor space to break the doom loop",
    "url": "https://www.bbc.com/news/articles/cjekv555xxdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19ca/live/3712e3c0-af98-11f0-b291-4fd3b4cc4b1d.jpg",
    "tag": "Trending",
    "date": "2025-10-22T22:53:53.000Z",
    "description": "5 hours agoFaisal IslamEconomics editorIt might be the peak, or perhaps the mini-summit for the current bump in inflation.Economists across the city s",
    "body": "5 hours agoFaisal IslamEconomics editorIt might be the peak, or perhaps the mini-summit for the current bump in inflation.Economists across the city suggest its downhill from here, after the inflation rate for September remained static at 3.8%, failing to breach the expected 4% mark.In absolute terms inflation remains too high, higher than other similar countries, and too visible in the everyday items seen in the shops. Just under double the official target of 2% set for the Bank of England.But the direction of travel matters significantly. Even if it should stay around this level for the rest of the year, some significant falls are on the way in the spring, as various regulated price rises last year drop out of the calculation. It would be a much happier place if it were 2.5% in April. However, it is worth remembering that even as the International Monetary Fund (IMF) pointed to the highest inflation in the G7 this year and next, it also said inflation would fall back to the 2% target by the end of next year.Crucially retail industry experts now assert food price inflation has also peaked, though prices remain at painful levels for many.This lowers - though does not eliminate - the chances of self-fulfilling expectations of inflation in the way wages and prices are set. This is the critical factor for the setting of interest rates.My immediate thought was the \"Santa\" rate cut from Andrew Bailey may be back on the table for December. But then I looked again at the information underlying some of last week's numbers from the IMF. Buried in the forecast is the suggestion of four rate cuts over the next year to take interest rates down to 3%. The only reason a cut is not expected next month, according to the IMF, is because it is too close to the Budget.A more benign inflation outlook suddenly makes that look less fanciful. The US Federal Reserve rate cuts are also in the background.The markets seem to be reassessing their view here and around the world. The effective interest rates on UK government debt fell sharply, regardless of whether those loans were for two or for 30 years. Ten-year rates fell to the lowest level this year, while two-year rates dropped to the lowest since last August.This could save a few billion from the gap in the Budget calculations, at just the right time for the chancellor.Even more important, it shows the UK is not being treated as an outlier by the markets. The chancellor went to some effort in her off-the-cuff UK sales pitch to worldwide investors in the US last week. Britain was, she said, the best place to invest and trade globally, that she was going to sort out Brexit-related economic problems and the UK had the fastest declining deficit in the G20.The Budget is going to be a challenge, but catastrophic suggestions about British bankruptcy and bailouts seem quite spectacularly off the mark, assuming that is, that the government does have nearly 400 MPs for its agenda. No one wants to be caught on the wrong side of the very real chance of a tech market crash, or unpredictable spike in the US-China trade war, or perhaps any unexpected innovations in the appointment of the new chair of the Federal Reserve in the US.The inflation number and gilt rate falls offer the chance of some respite, for a break in the circle of doom. The question is whether the tax measures Reeves needs to close even a smaller Budget gap, risk bringing it back through another door.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stable inflation gives chancellor space to break the doom loop",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/19ca/live/3712e3c0-af98-11f0-b291-4fd3b4cc4b1d.jpg"
      ],
      "datePublished": "2025-10-22T22:53:53.000Z",
      "dateModified": "2025-10-22T22:53:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHS health checks to include questions about the menopause",
    "url": "https://www.bbc.com/news/articles/cq50z185d78o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5f26/live/b5dfd6c0-af77-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-23T00:19:26.000Z",
    "description": "Menopause screening to be included in NHS health checks from next year4 hours agoNick TriggleHealth correspondentGetty ImagesHealth checks would inclu",
    "body": "Menopause screening to be included in NHS health checks from next year4 hours agoNick TriggleHealth correspondentGetty ImagesHealth checks would include asking women about menopause symptoms, though exact questions have yet to be decidedMenopause screening is to be officially incorporated into NHS health checks in England for the first time.Women getting the checks - offered to adults aged 40 to 74 every five years - will be asked about the menopause and possible symptoms from next year.The aim is to identify women who may benefit from advice and support, including treatment, such as hormone replacement therapy (HRT), drugs to combat hot-flushes, and counselling.The government said the measure will bring menopause into the mainstream, but campaigners warned uptake of health checks was worryingly low in some communities so not enough women may benefit.Health checks are primarily aimed at identifying people at risk of conditions such as cardiovascular disease, stroke, kidney disease, diabetes and dementia.They include blood pressure and cholesterol checks as well as measuring a person's BMI (body mass index) and are normally carried out in pharmacies and GP surgeries.But under these changes, from 2026 women will also be asked about the menopause. The exact questions have yet to be decided, but Health Secretary Wes Streeting said he hoped the move would improve the support offered.\"Women have been suffering in silence for far too long and haven't been encouraged to open up about the symptoms they're experiencing,\" he said.\"This often means they're left to navigate menopause alone with very little support. No-one should have to grit their teeth and just get on with what can be debilitating symptoms or be told that it's simply part of life.\"Reduce stigmaMenopause affects all women differently with most experiencing the transition between ages 45 and 55, though symptoms can begin earlier during perimenopause.Three-quarters of women experience symptoms – from physical changes like joint pain, weight gain and hot flushes to cognitive effects such as memory issues and brain fog.These symptoms can last an average of seven years and significantly affect daily life, yet research shows fewer than one in 10 feel they have enough information to deal with it.Women's Health Ambassador Dame Lesley Regan welcomed the move to ask women about the menopause.She said: \"Some 400,000 women in the UK will become menopausal this year, but the vast majority of them will have very little knowledge of what underlies the many and varied symptoms.\"Prof Ranee Thakar, of the Royal College of Obstetricians and Gynaecologists, said it would help \"break down barriers and reduce stigma\". But she said staff carrying out the health checks would need training for the change to have the maximum positive impact.And she added more needed to be done to help women from ethnic communities and the poorest areas access NHS health checks.Janet Lindsay, from Wellbeing of Women, said she hoped the move would help more women understand their symptoms and seek help.But she too is concerned about uptake of health checks.\"Women and people from marginalised communities are less likely to know about or attend these appointments and progress on menopause support cannot leave them behind,\" she said.Latests figures show fewer than half of people invited for a health check actually attend.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHS health checks to include questions about the menopause",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5f26/live/b5dfd6c0-af77-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-23T00:19:26.000Z",
      "dateModified": "2025-10-23T00:19:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Traitors: Pressure to find Traitors reaches fever pitch - but are they turning on each other?",
    "url": "https://www.bbc.com/news/articles/c87415422zdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2da3/live/46e18640-af8d-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-22T21:53:55.000Z",
    "description": "6 hours agoNoor NanjiCulture reporterBBCSpoiler warning: This article reveals details from the fifth episode of The Celebrity Traitors\"We've utterly f",
    "body": "6 hours agoNoor NanjiCulture reporterBBCSpoiler warning: This article reveals details from the fifth episode of The Celebrity Traitors\"We've utterly failed,\" said David Olusoga, as the fifth episode of the Celebrity Traitors neared its end.And he wasn't the only celebrity who seemed mired in self doubt.\"So far, I've been so useless it's breath-taking,\" said Kate Garraway.Celia Imrie admitted being \"befuddled\", Sir Stephen Fry complained it's \"so dashed difficult\".And the whole nation shouted at their screens, wondering why the celebrities are quite so rubbish at catching a traitor.The episode started with another faithful - singer Charlotte Church - hitting the dust, as she became the Traitors' latest victim.Presenter Claudia Winkleman echoed all of our frustration, as she ticked off the celebs at breakfast.\"The voice of an angel and now she is among them,\" Winkleman said, solemnly, about Church's murder.\"You've lost seven faithfuls. Think about that while you enjoy your cheese,\" she said, before storming out.\"She doesn't like us does she,\" noted comedian Lucy Beaumont.But cracks quickly started to emerge in the treacherous trio of Traitors - Alan Carr, Jonathan Ross and Cat Burns.Celebs stumped as they try and decipher Traitors' identityEarly on in the episode, Burns started turning on Ross. \"This game is making me evil, but I've got to think for myself here,\" she said to the cameras.She also raised his name in an incredibly tense roundtable later in the show.Imrie and Sir Stephen also shared their suspicions that Ross could be a traitor during Wednesday's episode.And social media certainly wants him out. \"Get Jonathan Ross OUT!\" wrote India Willoughby, while Freddie Fraser from this year's civilian traitors said the same on TikTok. But the episode ended in a dramatic tied vote at the roundtable, with two faithfuls - Scottish actor Mark Bonnar and historian David Olusoga - receiving an equal amount of votes.That means the banishment will be left “to the hands of fate,” Winkleman said.\"Jonathan Ross could put a giant 'It's Me' sticker on his head and still not get voted off,\" lamented one X user.“As Alan Carr says, the faithful have got to up the nerve at the banishment table and behave less like pussycats and more like rottweilers,” said TV reporter Siobhan Synnot.Social media users were left wondering who has been dressing Jonathan RossElsewhere, the giggling, sweating, nervously-scratching-his-head Alan Carr remains a thing of the past.Now a cold-hearted killer, Carr seemed to take great pleasure in watching the faithfuls try and work out who had been murdered.“To be sitting there outwitting Steven Fry, I mean, it's like beating Albert Einstein in chess or Cluedo or something,\" Carr said.\"I just started stuffing cheese in my mouth cos I can't stop grinning. Isn't it funny? I was so nervous when Claudia squeezed my shoulder blade, and now I just love being a traitor.\"Other talking points from Wednesday's show include Ross's outfits... again. And not only because he insists on walking around in sunglasses (surely this looks like a man who has something to hide?).“Once again Jonathan Ross proves he has one of the strangest choice of clothes ever seen on Traitors,” wrote one X user.Cat Burns - one of the younger celebs - revealing she doesn’t know who Helen Mirren is was another joyful moment. “She’s a national treasure,” her fellow players told her.Elsewhere, Celia Imrie continues to surprise us all - as she revealed she has a crush on Ross when she voted for him.And people on social media seemed pleasantly surprised at Mark Bonnar's singing during the challenge.\"Mark singing from the trap is such a vibe,\" wrote one X user.\"Not Mark singing Loch Lomond in the bear trap, I love it,\" said entertainment reporter Jodie McCallum. \"This is the Scottish representation we need.\"The Celebrity Traitors is on BBC One on Wednesdays and Thursdays at 21:00 BST and on BBC iPlayer. There will be nine episodes.More on The Celebrity Traitors",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Traitors: Pressure to find Traitors reaches fever pitch - but are they turning on each other?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2da3/live/46e18640-af8d-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-22T21:53:55.000Z",
      "dateModified": "2025-10-22T21:53:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Metlen boss says London Stock Exchange is bouncing back",
    "url": "https://www.bbc.com/news/articles/cq50z91z6q4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4934/live/f5884780-af7c-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-22T23:07:35.000Z",
    "description": "London Stock Exchange bouncing back, says metals magnate5 hours agoSimon JackBusiness editorAFP via Getty ImagesThe Metlen founder's comments come ami",
    "body": "London Stock Exchange bouncing back, says metals magnate5 hours agoSimon JackBusiness editorAFP via Getty ImagesThe Metlen founder's comments come amid uncertainty as some British companies list elsewhere (file photo)The UK was the most attractive place to list shares of the global energy and metals company Metlen, according to its founder and CEO.Evangelos Mytilineos told the BBC that \"the tide was turning\" after a rocky period after Brexit when the London Stock Exchange looked unattractive.His comments are in contrast to recent widespread concern about the steady outflow of some big name companies from UK markets, particularly to the US.However, Mr Mytilineos said high energy costs were an obstacle to European and UK customers and he believed politicians had failed to be honest about the costs of the energy transition.Metlen employs nearly 10,000 people in 40 countries and moved its primary listing from Athens to London in August this year. With a total value of over £5 billion, it was the fastest company to be admitted to the FTSE 100 list of the UK's most valuable listed firms.The move comes after some big UK companies quit the London Stock Exchange to sell their shares on foreign markets. Tech giant ARM Holdings is now listed in New York. Paddy Power's parent company Flutter is betting on the US, and mining giant BHP headed down under to Australia. Rumours also remain over the future of London stalwarts Shell, and UK's most valuable company, Astra Zeneca.Mr Mytilineos said that while he had been attracted to the potentially higher valuations offered by US markets, he felt that London was a better cultural and business fit.\"First of all, most of our executives have started in England,\" he said. \"They all feel at home in the UK. We have a substantial part of our business in the UK, and most of the rest of the business is in Europe. Not much to do with the US.\"He said US stock exchanges were \"overcrowded\" adding \"I don't think we would get people to take the same interest in the company [in the US].\"Mr Mytilineos said the London Stock Exchange had appeared \"neglected\" in the years after Brexit but that other financial centres had failed to capitalise.\"Frankfurt, Paris, Milan or Amsterdam have not managed to overtake London and having withstood a difficult period, I think is on course to get back to the top,\" he said.Uk energy prices 'not affordable'Metlen CEO Evangelos Mytilineos felt the UK was the best fit for the business, which quickly made the FTSE 100The Metlen CEO was less flattering about UK and European energy policy which is crucial to his business - \"a bit of metal is essentially energy in solid form,\" he said.Mr Mytilineos is also the president of Eurometaux, Europe's association for the non-ferrous metals and said that higher energy costs compared to the US had ravaged the membership.\"The situation with energy costs in the UK and in Europe for the industry is not viable,\" he said. \"We have hundreds of members. A large number of the most electro-intensive have gone out of business in the last three years. All of them because of the price of energy. They just cannot be competitive. It's as simple as that.\"He said that while he was \"in favour of the green transition\", politicians had not been honest about the costs of the enormous investments needed in the energy infrastructure to bring it about.He said the majority of firms had been eager when asked by politicians 'do you want us to go ahead, full speed on the Green Revolution?'\"But the question should have been, are you prepared accepting the fact that 30% of your salary for the next 30 years would have to be spent in the green transition, and then maybe the answer would have been very different,\" he said.Political messagingHe said the experience of watching investment push bills up in the UK and Europe was making messaging coming out of the US more politically attractive to some.He pointed to US President Donald Trump's speech to the United Nations last month in which he denied climate change, calling it the \"greatest con job ever perpetrated on the world\", and refuted the use of renewable energy.\"I mean, it influences a lot of people in the world,\" said Mr Evangelos. \"So you may start to see, like we're seeing in Europe, especially, right wing parties to start blocking more and more measures for the energy transition.\"The answer, he argues, is having a more honest debate.\"We have to measure the needs of the societies and the means of achieving our goal, what we have, and how do we get there?\" he said.He said a debate on energy transition had never happened on a grand scale.\"Let's sit down. How much money we have, how much of that can we spend on infrastructure?\" he said. \"And let's go out and explain to the people, unless we do that, we are not going to have them on board, and there will be more and more resistance.\"He seemed confident that the UK and EU could come to a deal over steel tariffs.To protect EU steel makers, the bloc is proposing a 50% tariff from June next year on all imports from the rest of the world - including the UK.He said co-operation in areas like defence had sweetened the relationship.\"My take from Brussels is the climate towards the UK is much friendlier than it was three, four or five years ago. The fact that the UK is very willing to support Europe on the defence side - I think the climate is much warmer now to make a deal on these issues\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Metlen boss says London Stock Exchange is bouncing back",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4934/live/f5884780-af7c-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-22T23:07:35.000Z",
      "dateModified": "2025-10-22T23:07:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I thought my insides were falling out – what I didn't expect after childbirth",
    "url": "https://www.bbc.com/news/articles/ckgk0y18mrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6dc0/live/9f5e02e0-af23-11f0-b9f9-e5c1839c872f.jpg",
    "tag": "Trending",
    "date": "2025-10-22T23:43:23.000Z",
    "description": "5 hours agoYasmin RufoBBC NewsHelen LedwickWhen Helen Ledwick typed \"why do my insides feel like they're falling out\" into Google a decade ago, she ha",
    "body": "5 hours agoYasmin RufoBBC NewsHelen LedwickWhen Helen Ledwick typed \"why do my insides feel like they're falling out\" into Google a decade ago, she had no idea that search would mark the beginning of a life-changing journey.The former BBC 5 Live journalist and podcaster was experiencing pelvic organ prolapse - a condition that affects around one in twelve women, but which many have never even heard of.Prolapse happens when one or more of the organs in the pelvis, such as the bladder, bowel or uterus, slip from their usual position and bulge into the vagina. It's not life-threatening, but it can have a profound impact on daily life, relationships and mental health.For Helen, the shock came just two weeks after a difficult birth with her second child.\"I stood up from the sofa and suddenly felt things shift,\" she recalls. \"It felt like when a tampon isn't sitting properly, you can feel something's not right.\"Confused and frightened, she grabbed a mirror and her phone to see what was happening.\"I'd never even heard the term prolapse before,\" she says, and since talking openly about it she's realised it's often a \"taboo\" subject despite being very common.Helen believes the shame and stigma surrounding it has led to a lack of awareness among women and health professionals - something she's now fighting to change.Helen LedwickHelen says her diagnosis, confirmed by a doctor, brought confusion and fear as she was \"hoping for an explanation, fix or some sense of urgency, instead I got a shrug of the shoulders.\"The initial advice she was given was to not do anything that could make it worse such as running, jumping or lifting.\"It kind of felt like the advice was don't live your life,\" she says.Perhaps more debilitating than the physical symptoms was the isolation Helen felt.\"You live with it in embarrassment, silence, shame and isolation,\" she explains. \"Because you don't talk about it, you think you're the only person in the world it's happened to.\"Helen initially ventured onto Instagram to seek support. Finding other people on the social platform who were similarly anxious and confused and in some cases too embarrassed to seek help prompted her to eventually launch a podcast and write a book, Why mums don't jump.Her goal was to create a platform for women to share stories and break the silence around pelvic health.\"I was angry because no-one ever talked about it. So I decided I would.\"I wanted to give women the knowledge that I'd found so hard to come by, and comfort in knowing they were not on their own.\"Dr Nighat Arif, a women's health specialist, says Helen's experience is far from unique and issues can arise as symptoms aren't always obvious.\"Sometimes physically there isn't a lump to see, there's just a feeling of pressure and it might be in the lower back, at the front or slightly higher up near your belly button,\" she explains. \"The symptoms can also be more pronounced during sex which is again massively taboo.\"Prolapse can happen for a variety of reasons including childbirth, heavy lifting, being overweight or even after a hysterectomy. And in rare cases, it can affect men too.Pelvic floor exercises and lifestyle changes can help to improve symptoms, but sometimes medical treatment is needed such as vaginal pessaries or surgery.Gynaecologist Dr Christine Ekechi says women with prolapse may notice a swelling or a lump within their vagina \"as essentially what has happened is that we have weakening of the ligaments within the pelvic floor that can move for example the bladder\".Helen LedwickHelen says what began as a lonely Google search 15 years ago, has now become something far more powerful, helping women to recognise when there is a problem and seek help.In her case, recovery has been slow, but transformative.\"For me it's been a long process of building up slowly, doing postpartum [immediately after pregnancy] exercises, building up some strength work.\"Eventually she saw a physio who helped her to start running again. Helen says this was \"a massive moment because I really thought that was something I would never do again.\"Now, Helen is doing more than she ever thought possible and has signed up for a 10k run.\"I feel good and I've learned how to manage my symptoms. I've still got prolapse, but it doesn't rule my life in the way that it once was.\"I feel like I'm kind of winning the battle.\"Find out more about the symptoms of pelvic floor prolapse on the NHS website ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I thought my insides were falling out – what I didn't expect after childbirth",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6dc0/live/9f5e02e0-af23-11f0-b9f9-e5c1839c872f.jpg"
      ],
      "datePublished": "2025-10-22T23:43:23.000Z",
      "dateModified": "2025-10-22T23:43:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why this month's inflation figure matters for you",
    "url": "https://www.bbc.com/news/articles/cm2ly7m07x8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8cf5/live/d3f46340-af3d-11f0-a743-017a38be2260.jpg",
    "tag": "Trending",
    "date": "2025-10-22T14:00:45.000Z",
    "description": "Which benefits are going up and by how much?14 hours agoLucy HookerBusiness ReporterGetty ImagesThe cost of living is always important to our finances",
    "body": "Which benefits are going up and by how much?14 hours agoLucy HookerBusiness ReporterGetty ImagesThe cost of living is always important to our finances, but this month what is happening to prices will have a particular extra impact for millions of people.The September inflation figure reflects what has been happening to prices over the past year, and will affect how far your money goes and how much benefits will go up next year as well as influencing the Bank of England's interest rate decisions.It also comes just over a month before the Budget, with the chancellor confirming she has been looking at further measures on tax and spending.Here are some of the ways in which the latest inflation figure will directly affect you and your money. Universal credit and other benefitsTypically, September's Consumer Prices Index (CPI) measure of inflation, which this time is 3.8%, is the benchmark for raising benefits the following April.Some benefits, including all the main disability benefits, such as personal independence payment, attendance allowance and disability living allowance, as well as carer’s allowance, will rise by at least as much as prices have been rising. That is a legal requirement.Universal credit (UC) - which is the most common benefit, claimed by seven and a half million people - is expected to rise by more than inflation next year. But ministers have the final say.Currently UC is expected to rise by about 6.2%, reflecting the 3.8% September inflation figure, plus an additional 2.3% uplift already outlined in government legislation.That would mean the standard UC allowance would rise from £92 to £98 per week for single claimants, and from £145 to £154 per week for couples, the Joseph Rowntree Foundation calculates.Bigger increase for the state pensionThe state pension rise is set using different criteria: what is known as the triple lock.Under that arrangement, the state pension goes up each year by either 2.5%, or by inflation, or by earnings growth - whichever is the highest figure. This time around, we now know, that average earnings growth is the highest of these, at 4.8%.This means:The full, new flat-rate state pension (for those who reached state pension age after April 2016) is expected to increase from its current £230.30 a week to £241.30 a week. That will take it to £12,547 a year.The full, old basic state pension (for those who reached state pension age before April 2016) is expected to go up from £176.45 a week to £184.90. That will take it to £9,615 a year.Not all pensioners receive the full state pension, and some rely on other benefit income.Wages and pricesStubbornly rising prices in the UK over the past year mean that everyone's incomes are stretched further.Rising wages can help counter that, putting more money in peoples' pockets so that even if prices are higher, their spending power doesn't fall.However, the poverty-focused think tank the Resolution Foundation says real pay growth, once inflation has been taken into account, has been weakening. It calculates that weekly wages have grown \"by no more than the price of a Gregg's sausage roll\", or £1.50, over the past 11 months.Workers on the government-set minimum wage have fared better following inflation-busting rises in April.Interest and mortgage rate cuts more likelyGetty ImagesInflation remains well above the Bank of England's 2% target. But September's 3.8% figure was lower than the 4% the Bank of England and other economists had forecast. So speculation is growing that another interest rate cut could be on the cards.Usually the Bank of England keeps interest rates higher if inflation is causing concern, to discourage borrowing and spending that can make the problem worse.If inflation seems to be easing, there could be a rate cut as soon as November or December, some economists suggest, which would make it cheaper to borrow, including for mortgages.An easing of mortgage costs would be welcomed not only by homeowners but also by renters. Lower costs for landlords might help put a stop to persistent rises in rents.On the other hand, lower Bank of England interest rates can mean lower rates for savers, too.Implications for the BudgetAll eyes are now on the chancellor who is busy finalising her Budget set for 26 November.Rachel Reeves said she wasn't satisfied with a slightly smaller than expected rise in prices in September and planned to take action to bring inflation down further. There have been hints that might come through lower household energy bills.But the prospect of easing inflation could also throw her a lifeline as she battles to make the numbers add up without breaking manifesto promises on borrowing and taxation.It will mean welfare spending, and other government costs, are lower than they might have been. And borrowing costs for the government itself are already edging downwards, all of which would give her more room for manoeuvre.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why this month's inflation figure matters for you",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8cf5/live/d3f46340-af3d-11f0-a743-017a38be2260.jpg"
      ],
      "datePublished": "2025-10-22T14:00:45.000Z",
      "dateModified": "2025-10-22T14:00:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says 'existing structure' of White House East Wing to be torn down",
    "url": "https://www.bbc.com/news/articles/czxn7lwzx5po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7a33/live/bc219bc0-afa1-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-22T22:11:46.000Z",
    "description": "6 hours agoAoife WalshWashingtonWatch as parts of White House East Wing torn downUS President Donald Trump has said the \"existing structure\" of the Wh",
    "body": "6 hours agoAoife WalshWashingtonWatch as parts of White House East Wing torn downUS President Donald Trump has said the \"existing structure\" of the White House East Wing must be torn down in order to construct a new $250m (£186m) ballroom.  Crews began demolishing parts of the structure on Monday, and two administration officials earlier told the BBC's US partner CBS that it will be completely torn down by the weekend.It marks a significant expansion of the construction project announced over the summer. Trump previously said his ballroom addition would not \"interfere with the current building\". He rejected accusations he had not been transparent over the extent of the works, telling reporters on Wednesday: \"I think we've been more transparent than anyone's ever been.\" The White House has served as the historic home of the US president for two centuries. The East Wing was constructed in 1902 and was last modified in 1942.It is a section of the White House that holds offices for the first lady and other staff, as well as meetings and special events. Trump said the building had gone through several changes over the years and was \"very, very much changed from what it was originally\". He added that was \"never thought of as being much\" and that the changes have been wanted \"for at least 150 years\". The construction was being fully funded by Trump and \"some friends of mine - donors\". The military is also involved, he added.Getty ImagesConstruction work began on MondayGetty ImagesThe US president announced construction had begun in a social media post on Monday, saying \"ground has been broken\" on the \"much-needed\" ballroom space.He said that the East Wing was \"completely separate\" from the White House, although it is attached to the main structure.The Trump administration officials told CBS it was always the case that the East Wing would have to be modernised to enhance security and technology, but that during the planning process, it became apparent that the best option would be to demolish the entirety of the East Wing.Trump says White House renovation is 'music to my ears' as criticism mountsWho is paying for Trump's White House ballroom?His comments came after the National Trust for Historic Preservation, a Washington non-profit organisation that protects historic US sites, wrote a letter to White House officials saying it was \"deeply concerned\" by the project.The trust asked Trump to pause demolition work, arguing that the White House was a national historic landmark and that officials needed to hold a public review process of the plan for the ballroom.Some Democrats have been critical of the renovation, including Hilary Clinton, who ran against Trump for the US presidency in 2016.In a post on X, she wrote that the White House was not Trump's house, and \"he's destroying it\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'existing structure' of White House East Wing to be torn down",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7a33/live/bc219bc0-afa1-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-22T22:11:46.000Z",
      "dateModified": "2025-10-22T22:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]