[
  {
    "title": "British Army officer dies after incident during live fire training",
    "url": "https://www.bbc.com/news/articles/cly9p153kv9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b16d/live/3558a6a0-fbb5-11f0-ab9d-51dbb3242e9b.jpg",
    "tag": "Trending",
    "date": "2026-01-27T20:03:09.000Z",
    "description": "9 hours agoMaia DaviesandMallory MoenchA 25-year-old British Army officer has died following an incident during live fire training, the Ministry of De",
    "body": "9 hours agoMaia DaviesandMallory MoenchA 25-year-old British Army officer has died following an incident during live fire training, the Ministry of Defence (MoD) has confirmed.Capt Philip Gilbert Muldowney died on Sunday after the incident at an army training site in Northumberland.He served as a fire support team commander in the 4th Regiment Royal Artillery.The MoD said its thoughts were with Muldowney's loved ones as it confirmed his death on Tuesday.An Army spokesperson said: \"The circumstances surrounding Capt Muldowney's death are being investigated, and it would be inappropriate to comment any further at this time.\"Muldowney, who attended the Royal Military Academy Sandhurst, joined the Army in January 2020 and was commissioned into the Royal Artillery in December of that year.He served in multiple roles and was deployed in November 2021 to Estonia for six months.He had been seriously injured on a commando course in January 2025 and ordered to pause and rehabilitate, but returned to duty after his recovery.Tributes were made by military personnel who had served with him, describing him as a \"true friend\" and a \"truly kind person\".Known as Gilbert, he was \"an immensely enthusiastic officer who embraced life with a vigour that inspired everyone around him\", Commanding Officer of the 4th Regiment Royal Artillery, Lieutenant Colonel Henry Waller, said.\"Always full of ideas and never without a bright smile, Gilbert approached every challenge wholeheartedly, whether in camp or out in the field.\"Waller described Muldowney as an \"outstanding officer who consistently put his soldiers first\", calling him \"a rising star\" in the Army and the regiment.He will be remembered \"for his easy-going nature, boundless energy, and infectious sense of humour\".Captain Duncan Morrison, who met Muldowney in 2021, said his friend \"lived life to the fullest and made lasting connections with everyone he met\".Captain Helen Brackenbury said Muldowney served all those under his command authentically, adding \"everyday he displayed a level of spirit I continue to be in awe of\".Major Martin Simms called Muldowney \"an absolute credit to his family and his friends\", saying \"we are devastated by the loss\".\"Gilbert's loss is felt deeply by his unit, his peers and all who had the privilege of serving and spending time with him,\" Captain Ross Beeby also said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British Army officer dies after incident during live fire training",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b16d/live/3558a6a0-fbb5-11f0-ab9d-51dbb3242e9b.jpg"
      ],
      "datePublished": "2026-01-27T20:03:09.000Z",
      "dateModified": "2026-01-27T20:03:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former French senator found guilty of drugging MP",
    "url": "https://www.bbc.com/news/articles/cy8p1mn3j29o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3f8f/live/fb2a9ef0-fba7-11f0-b852-153f64f31c74.jpg",
    "tag": "Trending",
    "date": "2026-01-27T22:04:40.000Z",
    "description": "7 hours agoLaura GozziGetty ImagesA former French senator has been found guilty of spiking an MP's drink with ecstasy in order to sexually assault her",
    "body": "7 hours agoLaura GozziGetty ImagesA former French senator has been found guilty of spiking an MP's drink with ecstasy in order to sexually assault her.Joel Guerriau received a four-year prison sentence - 18 months of which are to be served behind bars - and, according to local media, was ordered to pay Sandrine Josso €5,000 (£4,348) in damages for emotional distress. Guerriau, now 68, had invited Josso, 50, to his Paris flat in November 2023. He later admitted serving her a drink spiked with MDMA, but maintained it was an accident and denied having any intention of assaulting her.Shortly after the verdict on Tuesday, Josso said it was a \"huge relief\", AFP reports. Meanwhile, Guerriau's lawyers said he would appeal.According to court documents quoted by French media, Josso said she had gone to Guerrieau's home three years ago to celebrate his re-election when she started feeling unwell after drinking from a champagne glass.\"I had gone to visit a friend and I discovered an aggressor,\" she said on Monday while giving evidence in the trial. \"He looked at me insistently, I'd never seen him that way. I didn't want to show him my weakness, because I was worried that if I told him I wasn't feeling well, he would've forced me to lie down.\"Josso recalled managing to leave the flat and, with the help of a colleague, went to hospital where a toxicology report confirmed her blood had three times the recreational dose of MDMA.Guerriau told the court he had been going through a period of depression, and had meant to take the drug himself the night before. He did not end up doing so and accidentally offered the glass containing MDMA to Josso the following evening, he said.\"I feel sorry for Sandrine,\" Guerriau told the court in Paris. \"I am disgusted with myself, with my recklessness and my stupidity.\"He added: \"We don't talk about the effects of these drugs enough... All I want is to speak out on the dangers of these products.\"Getty ImagesSandrine Josso remains an MP for the centre-right MoDem partyAsked about the several internet searches he made around ecstasy and the drug GHB, he said he had no recollection.\"I was on the train, thoughts and ideas just come to you,\" he told the court, adding government members needed to show an interest in \"all current events\".Guerriau, a centre-right senator from the Horizons party, was suspended when the charges against him came to light. He resigned as a senator last October.Josso, who is still an MP for the centre-right MoDem, has become a staunch campaigner against so-called chemical submission - drug-facilitated sexual assault.\"What I went through is still very painful,\" Josso said, speaking to French media ahead of the trial beginning. \"Psychological trauma feels like being frozen in time... I jump at the slightest thing. I've become very vulnerable.\"Josso has gone on to join an association against chemical submission, set up by Caroline Darian - the daughter of Dominique Pelicot, who in 2024 was found guilty of drugging his wife Gisele and inviting men to rape her in their home for over a decade.Josso was often in court during the Pelicot trial. This week, Darian and her brother David attended the proceedings in the Guerriau case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former French senator found guilty of drugging MP",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3f8f/live/fb2a9ef0-fba7-11f0-b852-153f64f31c74.jpg"
      ],
      "datePublished": "2026-01-27T22:04:40.000Z",
      "dateModified": "2026-01-27T22:04:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Half measures' and 'Fake jobs for sale'",
    "url": "https://www.bbc.com/news/articles/c1lz2rg0923o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f7a/live/91291be0-fbdd-11f0-a422-4ba8a094a8fa.png",
    "tag": "Trending",
    "date": "2026-01-28T02:21:24.000Z",
    "description": "2 hours agoChancellor Rachel Reeves has revealed a support package for British pubs, which the Mirror describes as \"long-awaited\". \"Half measures\" dec",
    "body": "2 hours agoChancellor Rachel Reeves has revealed a support package for British pubs, which the Mirror describes as \"long-awaited\". \"Half measures\" declares the paper, reporting that publicans have not been impressed by the 15% discount on business rates she announced. The discount will come into effect in April.The Wednesday edition of the i Paper calls the move a \"pubs u-turn to save Britain's locals from extinction\". The chancellor has risked a backlash from other hospitality venues, the paper says, who have not been included in the temporary extra support. It adds that diners and travellers can expect to face price increases for food, drink and hotel rooms this spring, as a result of higher property taxes.The business rates \"u-turn\" has been branded \"too little, too late\" by the Mail, which warns of a \"high street meltdown\". It says the exclusion of small shops, restaurants and hotels from the discounted tax rates is a \"betrayal\", and accused the chancellor of trying to dodge \"humiliation\" by asking Treasury Minister Dan Tomlinson to make the announcement.The Times reports that fake jobs are being sold to migrants for up to £20,000, as part of a fraudulent scheme to secure work visas and stay in the UK unlawfully. After the paper alerted the Home Office to its findings, the government said it would launch an \"urgent investigation\" into the scheme.The Express provides an update on the \"one in, one out\" migrant scheme in its main story, alleging that the policy has been called a \"total farce\". The paper says 350 asylum seekers have arrived in the UK over the past six months under the scheme, while just 281 migrants were returned to France.\"Starmer led 'witch-hunt' against Iraq veterans\" says the Telegraph, which says Prime Minister Sir Keir Starmer worked as the lead barrister on a 2007 human rights claim that \"reshaped the law governing troops in war zones\". According to the paper, the landmark case prompted years of criminal investigation into soldiers it says were wrongly accused - all at \"enormous cost\" to taxpayers. A spokesperson for Downing Street told the Telegraph that Sir Keir had not advocated for \"either side\" in the case, and his role had been to \"assist the court on points of law\". They added that the prime minister would \"never forget\" the sacrifices made by British servicemen and women.Tributes left outside the Iranian embassy in London feature prominently on the front page of the Guardian, which has focused in on \"Iran's hidden death toll\". After speaking to medics based in Iran, the paper says that deaths in the Middle Eastern country have exceeded 30,000, after a \"surge in regime brutality\".The Financial Times leads with discussions between the US and Ukraine on making a peace deal with Russia to end the war. It reports that US officials have indicated any security guarantees for Ukraine would be contingent on territorial concessions, and would probably see the nation forced to cede the contested Donbas region to the Kremlin. The paper says Ukrainian President Volodymyr Zelensky hoped to sign documents on US security guarantees as early as this month.\"Run for the hills, Katie\" warns the Sun, focusing on model Katie Price's recent marriage to Lee Andrews in Dubai.\"Away at the races\" declares the Sun, leading on a Cheltenham-themed \"betting and beers\" package holiday in Benidorm.The Metro leads on a woman with a brain tumour who is suing the NHS, after she alleged she was treated with chemotherapy for more than six years despite only needing six months of the treatment.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Half measures' and 'Fake jobs for sale'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f7a/live/91291be0-fbdd-11f0-a422-4ba8a094a8fa.png"
      ],
      "datePublished": "2026-01-28T02:21:24.000Z",
      "dateModified": "2026-01-28T02:21:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Neil Young offers Greenland free access to his catalogue ",
    "url": "https://www.bbc.com/news/articles/crmlpl0w2z2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/11c5/live/efd0e750-fbf5-11f0-a47f-d352a7d9988a.jpg",
    "tag": "Trending",
    "date": "2026-01-28T03:34:43.000Z",
    "description": "Canadian-American rock star Neil Young is offering Greenlanders a year's free access to his archives in what he hopes will \"ease some of the unwarrant",
    "body": "Canadian-American rock star Neil Young is offering Greenlanders a year's free access to his archives in what he hopes will \"ease some of the unwarranted stress and threats\" they are receiving from the Trump administration. President Donald Trump has threatened to annex the Danish territory for what he says are national security reasons, though recently walked back comments, saying he was seeking \"immediate negotiations\" and insisting he \"won't use force\". Young is known for his political protests, and has long been a vocal critic of Trump. He announced the offer \"of peace and love\" on his website, where he added that he hoped \"other organisations will follow in the spirit of our example.\" In his statement, signed \"love earth\", Young refers to the Trump administration as \"our unpopular and hopefully temporary government\".Access to Young's digital archive usually starts at around $25 (£18), depending on the subscription package. To secure free access, a Greenland registered mobile phone number will be required for verification.In 2020 Young took legal action to try to stop the president from using his music at campaign rallies.Earlier this month, Young wrote on his website: \"Wake up people! Today the USA is a disaster. Donald Trump is destroying America bit by bit with his staff of wannabes... He has divided us.\" Young has also called on people to boycott Amazon over owner Jeff Bezos's donations to the Trump campaign and support for the administration. In 2024, Young ended a two-year boycott of streaming giant Spotify, which he had started in opposition to the platform streaming Joe Rogan's podcast.In 2022, he told Spotify to remove hits like Harvest Moon and Heart of Gold, complaining that Rogan was spreading vaccine misinformation on the streaming service. Other artists, including Joni Mitchell and India Arie, also removed their songs in solidarity.The singer said at the time that his return did not reflect a reversal of his stance, but that the decision came after Rogan signed a $250m (£181m) deal to make his podcast available on multiple platforms, rather than remaining a Spotify exclusive.Neil Young was born in Canada but later moved to the US and holds dual citizenship. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Neil Young offers Greenland free access to his catalogue ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/11c5/live/efd0e750-fbf5-11f0-a47f-d352a7d9988a.jpg"
      ],
      "datePublished": "2026-01-28T03:34:43.000Z",
      "dateModified": "2026-01-28T03:34:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says government will 'de-escalate a little bit' in Minnesota after Pretti shooting",
    "url": "https://www.bbc.com/news/articles/c0q425vg4qzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2254/live/8dc47bd0-fbd7-11f0-8102-f9e135ba58e0.jpg",
    "tag": "Trending",
    "date": "2026-01-28T01:33:26.000Z",
    "description": "President Donald Trump said his administration was \"going to de-escalate a little bit\" in Minnesota, after the second fatal shooting of a US citizen b",
    "body": "President Donald Trump said his administration was \"going to de-escalate a little bit\" in Minnesota, after the second fatal shooting of a US citizen by federal immigration officers there.\"Bottom line, it was terrible. Both of them were terrible,\" he said in a Fox News interview on Tuesday.In early January Renee Good was fatally shot by an immigration officer, followed by Alex Pretti, who was killed after being stopped by border agents this past weekend. Pretti's death reignited local protests and public outcry across the country, and led to criticism from lawmakers in both parties. Trump's remarks are the latest sign his administration is taking a step back on its operations in Minnesota.On Monday, the Department of Homeland Security (DHS) pulled the Minnesota mission's leader and figurehead, Border Patrol official Gregory Bovino, from the state. DHS said it was deploying the White House's border tsar, Tom Homan, to take over there and Homan was set to meet with local officials this week. On Tuesday, Homan posted on social media that he had met with Minnesota Governor Tim Walz, Minneapolis Mayor Jacob Frey, and local law enforcement officials.Speaking to other reporters ahead of a rally in Iowa Tuesday night, Trump said he viewed the killing of Pretti, an intensive care nurse at a veterans' hospital, as \"a very unfortunate incident\".Asked by reporters about whether he agreed with characterisations of Pretti as a \"domestic terrorist,\" Trump said: \"I haven't heard that.\"Trump then added: \"He shouldn't have been carrying a gun.\" Homeland Security Secretary Kristi Noem said Pretti was shot because he was \"brandishing\" a gun during a confrontation, but local authorities said the gun was legally registered and that Pretti was shot after the firearm was removed.DHS has also said the agents fired in self-defence, after Pretti resisted attempts to disarm him. Eyewitnesses and local officials, though, have challenged that account, saying he had a phone in his hand, not a weapon.\"He wasn't there to peacefully protest, he was there to perpetuate violence,\" Noem said in the immediate aftermath of the shooting, accusing Pretti of \"domestic terrorism\".Pretti's death, coming two weeks after the fatal shooting of 37-year-old Renee Good, enraged local residents and sparked fresh calls from state and city officials for the Trump administration to withdraw its 3,000 immigration agents and officers from the region.In the interview with Fox News, Trump appeared to defend the Minnesota operation, saying \"we took thousands of hardened criminals\" out of the state, \"so they have good crime numbers.\"\"That's all working out, we have Tom Homan there now,\" he said, before adding the administration would \"de-escalate\".Stephen Miller, a top White House aide working on the administration's deportation initiative, told CNN that the White House \"provided clear guidance to DHS that the extra personnel that had been sent to Minnesota for force protection should be used for conducting fugitive operations to create a physical barrier between the arrest teams and the disruptors\".\"We are evaluating why the [US Customs and Border Patrol] team may not have been following that protocol,\" Miller said in his statement to CNN.Some Republican leaders and lawmakers have called for an investigation into Pretti's death, including Vermont Governor Phil Scott and US Senator Pete Ricketts of Nebraska.\"The nation witnessed a horrifying situation this weekend,\" Ricketts wrote on X. While he reaffirmed his \"support for funding ICE remains the same,\" Ricketts said he expected \"a prioritized, transparent investigation into this incident\".A federal judge has blocked DHS from destroying or altering evidence.In his speech at the Iowa rally on Tuesday night, which was dedicated to his economic policies, Trump did not discuss the current situation in Minnesota in-depth, but talked about his immigration crackdown more broadly, citing a Harvard Harris poll from December that suggested 80% of Americans support his administration's efforts to deport illegal immigrants who have committed crimes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says government will 'de-escalate a little bit' in Minnesota after Pretti shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2254/live/8dc47bd0-fbd7-11f0-8102-f9e135ba58e0.jpg"
      ],
      "datePublished": "2026-01-28T01:33:26.000Z",
      "dateModified": "2026-01-28T01:33:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five IPP prisoners to be referred to Court of Appeal",
    "url": "https://www.bbc.com/news/articles/c89q3keee79o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4076/live/052a81c0-fbf0-11f0-87b3-73f1ffad89c1.jpg",
    "tag": "Trending",
    "date": "2026-01-28T04:36:37.000Z",
    "description": "Just nowTabby WilsonBBC NewsnightBBC Newsnight spoke to Matthew Booth, 34, about the IPP sentence he received 16 years agoThe Criminal Cases Review Co",
    "body": "Just nowTabby WilsonBBC NewsnightBBC Newsnight spoke to Matthew Booth, 34, about the IPP sentence he received 16 years agoThe Criminal Cases Review Commission (CCRC) has referred five prisoners serving indefinite sentences to the Court of Appeal, BBC Newsnight has been told.Indeterminate Imprisonment for Public Protection (IPP) sentences account for some 2,800 people despite being abolished in 2012.Open-ended sentences were issued to people deemed dangerous but whose offence did not merit a life sentence.A Ministry of Justice spokesperson said: \"It is right that IPP sentences were abolished and we have already taken action to support these offenders to move on.\"Interim Chair of the CCRC Dame Vera Baird also revealed it had referred its first \"grooming gang victim... to try and get her conviction quashed\".A change in legislation has also been made to ensure those serving IPP sentences in the community could be more swiftly considered for licence termination, according to the spokesperson.Dame Vera told Newsnight that the five IPP prisoners were all men who remained in custody after originally being sentenced between 2002 and 2010 when they were in their late teens.\"They've let three lads out on similar appeals at similar ages, and we think that these five men might be able to fit into those chinks, and they might broaden them,\" she said.She added that the Court of Appeal had shown \"a bit of a change\" in its attitude, and had recognised that \"young men like these were when they were sentenced are very different from mature men\".The BBC also spoke to Matthew Booth, 34, who received an IPP sentence when he was 15 years old, following his conviction for wounding with intent and unlawful wounding.Booth originally served more than six years in prison for those convictions, but was recalled four times for breaches in his IPP license conditions. One such breach included being in a relationship that he did not declare.\"I don't think any child should get IPP because what you go through,\" he said, speaking for the first time since his release from prison last week.He continued: \"You're just feeling like there's no help. There's no hope. It just takes a toll on you. It changes you. That's what's building up inside of you, in your character.Dame Vera echoed his words, noting that IPP sentences assessed people for what they might do, rather than what they had actually done.\"These are sentences which just bring people into hopelessness,\" she said. The government announced back in November that it would automatically pardon grooming gang survivors, where people were convicted or cautioned as children for loitering and soliciting for prostitution offences. However, the definition has been too narrow to help in some cases.Dame Vera appealed for people to \"come forward\", adding: \"A lot of people who've been groomed do get convictions exactly in this way. They haven't the willpower to resist getting them and they're not doing it off their own back.\"Dame Vera explained the CCRC was \"working with charities that help post-grooming people to get over their trauma and they are going to find out for us if they've got a conviction because we need people to come forward\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five IPP prisoners to be referred to Court of Appeal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4076/live/052a81c0-fbf0-11f0-87b3-73f1ffad89c1.jpg"
      ],
      "datePublished": "2026-01-28T04:36:37.000Z",
      "dateModified": "2026-01-28T04:36:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EasyJet ad banned for claiming bags available for £5.99",
    "url": "https://www.bbc.com/news/articles/cddgp9jgjz1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3b5f/live/c34a9e90-fb9d-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-28T00:07:18.000Z",
    "description": "EasyJet warned over 'misleading' £5.99 cabin bag fee4 hours agoEmer MoreauBusiness reporterGetty ImagesEasyJet said it could not provide evidence to t",
    "body": "EasyJet warned over 'misleading' £5.99 cabin bag fee4 hours agoEmer MoreauBusiness reporterGetty ImagesEasyJet said it could not provide evidence to the ASA of £5.99 cabin bagsEasyJet has been told to stop claiming that carry-on baggage fees are available \"from £5.99\", after it failed to provide evidence to the advertising watchdog that passengers can stow luggage in a cabin at that price.The Advertising Standards Authority (ASA) said customers would assume from EasyJet's wording they could take their bags on flights for £5.99.The claim on EasyJet's website was flagged to the ASA by consumer group Which?, which said airlines often advertise low fares but have additional fees.EasyJet said: \"We always aim to provide clear information to our customers on pricing and the purpose of this page was to display factual information on fees and charges to customers.\"We always have some large cabin bags available for the lowest price. In light of the ASA's feedback we have made some changes to the page to ensure the information is as clear as possible for consumers.It said the wording on the website was meant to inform customers that £5.99 was the starting point for adding carry-on bags and it was an accurate price on several routes.The airline said the fact there were no bags available for less than that price meant the claim was not misleading.Responding to the complaint from Which?, the ASA said it expected to see evidence that large cabin bags could be booked for £5.99 but EasyJet did not provide this.It said consumers would take the \"from £5.99\" claim to mean that large cabin bags would be available for that price \"across a significant proportion of flight routes and dates\".As a result, the watchdog ruled the claim was misleading and told EasyJet not to use that wording in future.EasyJet informed the ASA that the section of its website where this claim appeared was intended for information purposes, not marketing or promotion.The airline's website now states: \"Fees vary with demand, route, flight date and time of booking. You'll see exact price at time of purchase.\"The airline said it was \"not able to provide specific figures\" because cabin bag prices depend on a number of factors including availability and demand.It said that customers would clearly see the actual price of a cabin bag when they were booking a flight.'Unattainable prices' Which? said its own research showed that typical cabin bag prices for EasyJet were five times as high as the £5.99 claim.Rory Boland, editor of Which? Travel said that there is a \"culture\" of airlines using \"low headline fares, then charging exorbitant prices on top to take a standard cabin bag\".\"It's frankly astonishing that airlines think they can ignore the rules and mislead customers with unattainable prices, so it's absolutely right that the ASA has made this ruling,\" he said.\"When booking a trip, customers should consider choosing an airline without cabin bag add-ons as it may work out cheaper.\"Jayne Hawkes, a consumer rights expert, said the issue was not unique to EasyJet.\"It only serves to reduce customer confidence [if airlines] increase confusion about baggage,\" she told the BBC.Last year, European Union lawmakers voted to force airlines to let passengers bring a carry-on bag of up to 7kgs on board for free.The law has not yet been implemented as it has to be approved by member states.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EasyJet ad banned for claiming bags available for £5.99",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3b5f/live/c34a9e90-fb9d-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-28T00:07:18.000Z",
      "dateModified": "2026-01-28T00:07:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Growing number of adults avoid booze, NHS survey suggests",
    "url": "https://www.bbc.com/news/articles/c1dk2xp137zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15f5/live/e1801430-fb9d-11f0-a1ee-f9a3598885a9.jpg",
    "tag": "Trending",
    "date": "2026-01-27T17:29:56.000Z",
    "description": "11 hours agoDominic HughesHealth correspondentAlmost a quarter of adults in England do not drink alcohol, according to new figures from a government-b",
    "body": "11 hours agoDominic HughesHealth correspondentAlmost a quarter of adults in England do not drink alcohol, according to new figures from a government-backed NHS health survey. The data suggests that young people, and increasing numbers of men in particular, are shunning booze.The latest data from the Health Survey for England for 2024 suggests 24% of adults said they haven't drunk alcohol in the previous year.But far fewer older people abstain from alcohol and those who do drink, are likely to do so at more dangerous levels.Between 2011 and 2022, the number of adults who claimed not to drink alcohol had been fairly stable, at around 19% – almost one in five. But these figures suggest that figure has risen, with almost a quarter of adults saying they haven't drunk alcohol in the past year. Age and sex are playing a significant part in attitudes towards booze. Some 39% of young men say they had abstained from alcohol. This compares to around 16% of men aged 65 and older, who say they don't drink. Among women, 31% - almost a third of those aged 16 to 24 - are non drinkers. But for older women aged 55 to 64, just 17% - fewer than one in five - don't drink. And of those who do consume alcohol – both men and women – older people aged 65 to 74 are almost twice as likely to do so at risky levels compared to younger people aged 25 to 34.Income also plays a role, with people living in more deprived areas tending to drink less than their more affluent neighbours.The NHS recommends not drinking more than 14 units of alcohol a week and spreading intake over three or more days.One unit of alcohol is 10ml of pure alcohol, which is equivalent to half a pint of normal-strength lager or a single measure (25ml) of spirits.A small glass of wine contains about 1.5 units, a standard glass is 2.1 and a bottle of wine contains 10 units.Meanwhile, a can of lager, beer or cider is two units. A pint is two or three units, depending on whether it is lower or higher strength.Campaigners say that while it is encouraging that fewer people are undertaking risky drinking, millions are still consuming alcohol at levels that could threaten their health.Jem Roberts, head of external affairs at the Institute of Alcohol Studies, says this latest survey shouldn't distract from the scale of alcohol harm in England.\"Millions of people are still drinking at levels that significantly increase their risk of serious harm, from alcohol-related cancers to life-changing injuries and long-term illness, and we have seen record high alcohol deaths in recent years,\" he said.The most effective way to reduce the record number of alcohol deaths is through measures such as minimum unit pricing, clear health warnings on alcohol labels, restrictions on alcohol availability, and comprehensive bans on alcohol marketing, he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Growing number of adults avoid booze, NHS survey suggests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/15f5/live/e1801430-fb9d-11f0-a1ee-f9a3598885a9.jpg"
      ],
      "datePublished": "2026-01-27T17:29:56.000Z",
      "dateModified": "2026-01-27T17:29:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Nigeria oil minister in bribery trial spent £2m at Harrods, court hears",
    "url": "https://www.bbc.com/news/articles/ckglpd167n9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d9d4/live/b26627a0-fb9a-11f0-bb99-e9cf31cf2a39.jpg",
    "tag": "Trending",
    "date": "2026-01-27T22:25:56.000Z",
    "description": "6 hours agoSteve SwannSouthwark Crown Court Getty ImagesDiezani Alison-Madueke was Nigeria's minister of petroleum resources from 2010 to 2015More tha",
    "body": "6 hours agoSteve SwannSouthwark Crown Court Getty ImagesDiezani Alison-Madueke was Nigeria's minister of petroleum resources from 2010 to 2015More than £2m was spent at Harrods on behalf of a then-Nigerian oil minister accused of accepting bribes from industry figures interested in government contracts, a court in London has heard.Diezani Alison-Madueke, 65, is alleged to have been provided with \"a life of luxury in the United Kingdom\", including the use of multimillion-pound properties, a chauffeur driven car, travel by private jet, and £100,000 in cash.Other benefits she allegedly received included £4.6m spent on refurbishing properties in London and Buckinghamshire, the trial at Southwark Crown Court was told.She denies five counts of accepting bribes and a charge of conspiracy to commit bribery.Alison-Madueke was minister of petroleum resources between 2010 and 2015 under then-President Goodluck Jonathan.Jurors were told that over £2m was spent on behalf of Alison-Madueke at Harrods  using the payment cards of Nigerian businessman Kolawole Aluko and the debit card of his company Tenka Limited. The defendant had her own personal shopper at the store, only available to Harrods Rewards Black Tier members who must spend over £10,000 a year, the court heard.Jurors were also told she lived some of the time in the UK where she was provided with a housekeeper, nanny, gardener and window cleaner.The salaries and other running costs were paid for by the owners of energy companies who had lucrative contracts with the state-owned Nigerian National Petroleum Corporation, the court was told.\"This case is about bribery in relation to the oil and gas industry in Nigeria during the period 2011 to 2015,\" said Alexandra Healy KC, prosecuting.\"During that time those who were interested in the award and retention of lucrative oil and gas contracts with the state-owned Nigerian National Petroleum Corporation or its subsidiaries the Nigerian Petroleum Development Company and the Pipelines Product Marketing Company, provided significant financial or other advantages to Alison-Madueke.\"Healy added: \"It might seem strange to be dealing here in the UK with a case that concerns bribery in relation to the Nigerian oil and gas industry.\"We live in a global society.  Bribery and corruption undermine the proper functioning of the global market. \"There is an important public interest in ensuring that conduct in our country does not further corruption in another country.\"PA MediaThe court heard Alison-Madueke had her own personal shopper at HarrodsJurors were also shown photographs inside a property called The Falls in Gerrard's Cross, Buckinghamshire, which was bought in 2010 by Nigerian businessman Olajide Omokore, owner of a company called Atlantic Energy.From late 2011 Alison-Madueke allegedly had exclusive use of the house which has a cinema room. The court heard she stayed there three or four times over two years, and spent six weeks at the property writing a book about the president of Nigeria.She was assisted by a chef and the driver of car whose role included dropping off shopping for Alison-Madueke, whom he knew as \"HM\" - short for honourable minister.It was said that this, along with £300,000 worth of refurbishment, was paid for by Tenka Limited. The court was told Aluko also had contracts with state-owned entities that were in the process of securing new oil contracts.The court heard that between May 2011 and January 2014, £500,000 was also paid in rent for two flats in a block in central London where Alison-Madueke and her mother lived. Records seized at the Tenka offices in Nigeria show the company settled the bill, it was claimed.Alison-Madueke sat in the dock besides oil industry executive Olatimbo Ayinde, 54, who is charged with one count of bribery relating to Alison-Madueke and a separate count of bribery of a foreign public official.Alison-Madueke's brother, former archbishop Doye Agama, 69, is charged with conspiracy to commit bribery and joined the trial by video link for medical reasons.Ayinde and Agama also deny the charges against them.The trial – expected to last about 12 weeks - continues.Oil plays a significant role in Nigeria's economy, but the population at large has not seen the benefits.It is one of the 13 members of the Organisation of Petroleum Exporting Countries (Opec), set up to deal with the worldwide supply of oil and its price.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Nigeria oil minister in bribery trial spent £2m at Harrods, court hears",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d9d4/live/b26627a0-fb9a-11f0-bb99-e9cf31cf2a39.jpg"
      ],
      "datePublished": "2026-01-27T22:25:56.000Z",
      "dateModified": "2026-01-27T22:25:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vulnerable people missing out on benefits due to online tool, charity claims",
    "url": "https://www.bbc.com/news/articles/c33827k6elxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1c88/live/3f7645b0-fb70-11f0-b7fd-f5e7f9ed0815.jpg",
    "tag": "Trending",
    "date": "2026-01-28T00:06:29.000Z",
    "description": "4 hours agoKevin PeacheyCost of living correspondentVulnerable people are missing out on benefits because they are being directed to online calculator",
    "body": "4 hours agoKevin PeacheyCost of living correspondentVulnerable people are missing out on benefits because they are being directed to online calculators they cannot use, a charity has said.Many are entitled to financial support but rarely have access to face-to-face advisers to help them claim, according to the Money and Mental Health Policy Institute, leaving an estimated £24m in support unclaimed each year.One woman has told the BBC how her life and home were saved because someone sat down with her and her paperwork for hours.But Helen Fisher, who now runs advice services herself, said she feared people were now being sent to online services that left them confused and missing out when their finances were already severely stretched.\"It means they will get into further debt and more and more brown envelopes will come through the door,\" she said.Helen, now aged 69, had to give up work to look after her husband, Ken, who had suffered a stroke.The family soon found they were falling behind on payments and were under threat of having their home repossessed.\"I was at the end of the road as I could not afford to feed Ken and [daughter] Jemma and to heat our home,\" she said.\"We had bailiffs wanting council tax. The energy was about to be disconnected. I could not afford petrol for the car to take Ken to medical appointments.\"Helen was contemplating suicide, but it was only when an adviser came to her home  to do a comprehensive benefits check that their life was turned around. The family were entitled to a host of benefits, grants and charitable assistance. Their home was saved, and an award of pension credit - in particular - provided a gateway to other support. That continued even after Ken died in 2010, at the age of 62.Now Helen helps others in Liverpool who \"are too busy caring for someone to juggle all these things\".But she has noticed that many people with mental health difficulties face a lack of personalised, face-to-face advice despite needing \"hand-holding and guiding\" as they fill in forms and look at their finances.\"Generally, I put them on the right track. Their anxiety is alleviated and gradually they gain the confidence to manage these matters by themselves,\" she said.In its report published on Wednesday, the Money and Mental Health Policy Institute - a charity set up by Money Saving Expert founder Martin Lewis - said that an estimated £24m of financial support went unclaimed every year.It suggested:Many vulnerable people were unaware support was availableOnline benefits calculators were difficult for many people with mental health conditions to use, owing to symptoms including difficulty concentrating and trouble processing complex informationLimited funding meant debt advice services were often overstretched and varied in different parts of the countryThe charity has called for a more coordinated strategy, for personalised advice to be stepped up and banks and providers of other essential services to refer customers for support more often.Helen Undy, chief executive of the institute, said: \"It is alarming that in the midst of a cost of living crisis, so many people with serious financial and mental health problems are missing out on this vital support to boost their income.\"People tell us that this support has been lifesaving when they have been dealing with really severe financial and mental health problems. It is unacceptable that the way these services are funded means that many people miss out because the support they need isn't available in their areas.\"The Money and Pensions Service, which is government-sponsored and funds services through a levy on the financial services industry, said debt advice it had funded identified £84m to go to people in 2024-25. \"We are investing significantly into debt advice services in England, and we will continue to work with debt advice providers to ensure that people in debt can achieve a better financial future,\" said Christy McAleese, head of debt policy at the service.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vulnerable people missing out on benefits due to online tool, charity claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1c88/live/3f7645b0-fb70-11f0-b7fd-f5e7f9ed0815.jpg"
      ],
      "datePublished": "2026-01-28T00:06:29.000Z",
      "dateModified": "2026-01-28T00:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon accidentally sends email confirming layoffs ",
    "url": "https://www.bbc.com/news/articles/cx2ywzxlxnlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ceca/live/1b3c5410-faf7-11f0-8d99-4d63080b9583.jpg",
    "tag": "Trending",
    "date": "2026-01-28T03:19:23.000Z",
    "description": "US technology giant Amazon has informed employees of a new round of global layoffs in an email apparently sent in error.A draft email written by Colle",
    "body": "US technology giant Amazon has informed employees of a new round of global layoffs in an email apparently sent in error.A draft email written by Colleen Aubrey, a senior vice president at Amazon Web Services (AWS), was included as part of a calendar invitation sent by an executive assistant to a number of Amazon workers late on Tuesday.In the email, Aubrey refers to a swathe of employees in the US, Canada and Costa Rica having been laid off as part of an effort to \"strengthen the company.\"The message, which has been seen by the BBC, was apparently shared by mistake, as it was quickly cancelled. An Amazon spokesman declined to comment.The title of the invitation was \"Send project Dawn email,\" an apparent reference to Amazon's code name for the job cuts.While the email made clear that layoffs were happening at Amazon, employees had not yet been officially informed.\"This is a continuation of the work we've been doing for more than a year to strengthen the company by reducing layers, increasing ownership, and removing bureaucracy, so that we can move faster for customers,\" the email said.\"Changes like this are hard on everyone. These decisions are difficult and made thoughtfully as we position our organization and AWS for future success,\" it added.Amazon announced 14,000 job cuts in late October.This second round of layoffs had been expected by Amazon employees for weeks, according to a former employee who asked not be identified.The broad understanding among employees had been that bosses intended to cut a total of around 30,000 roles, added the former employee, who left the company as part of the cuts in October.The firm was expected to reach that number of job cuts with another major round of layoffs this month, followed by further redundancies until the end of May.While laid-off workers were invited to reapply for open positions at Amazon, the number of such roles was limited. People who did not move to another role received severance pay based on how long they had worked at the company.Since 2022, major tech companies like Amazon, Meta, Google, Microsoft and others have slashed their workforces by laying off tens of thousands of people each year.Across the entire tech industry, an estimated 700,000 people have been laid off over the last four years, according to Layoffs.fyi, which tracks job cuts.So far this year, Facebook owner Meta has cut more roles, impacting several hundred employees. As has Pinterest, which this week cut around 700 jobs.Since Amazon founder Jeff Bezos stood down as its chief executive four years ago, his successor Andy Jassy has led the company through several rounds of layoffs in 2023, 2024 and 2025.Jassy has also attempted to bring a more strict work culture to the firm.In-office work is now mandatory five-days a week, making Amazon one of the only major tech companies to require its employees to be in the office full-time.Amazon is also focused on reducing costs, even monitoring corporate mobile phone use by AWS employees, according to a report in Business Insider, in an effort to limit a long-standing $50 per month reimbursement. In an email Jassy sent to employees before the Thanksgiving holiday viewed by the BBC, the CEO said he was thankful for the \"challenges at opportunities at work\" as \"the world is changing at a very rapid rate.\" Jassy called this era at Amazon \"a time to rethink everything we've ever done.\"Earlier on Tuesday, the company announced the closure of its roughly 70 remaining Amazon-branded grocery stores, Amazon Fresh and Amazon Go, and expand its Whole Foods Market business.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon accidentally sends email confirming layoffs ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ceca/live/1b3c5410-faf7-11f0-8d99-4d63080b9583.jpg"
      ],
      "datePublished": "2026-01-28T03:19:23.000Z",
      "dateModified": "2026-01-28T03:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minnesota congresswoman Ilhan Omar attacked with 'unknown liquid' during town hall",
    "url": "https://www.bbc.com/news/articles/cn9zpee3llxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7026/live/fef50610-fbf7-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-28T03:25:28.000Z",
    "description": "1 hour agoHelen SullivanandAna Faguy,MinneapolisMinnesota Representative Ilhan Omar was attacked with an unknown substance at a town hall she was host",
    "body": "1 hour agoHelen SullivanandAna Faguy,MinneapolisMinnesota Representative Ilhan Omar was attacked with an unknown substance at a town hall she was hosting on Tuesday, when an audience member used a syringe to spray liquid at her, Minneapolis police said.Omar was uninjured and continued to speak. The man was immediately arrested and forensics were being conducted at the scene, police added.\"I thought it was one of her aides going up to hand her a note or something,\" Jacquelynn Goessling said of the man that attacked Omar with liquid, the acrid smell of which consumed the front of the room.In a statement on X, Omar said: \"I'm ok. I'm a survivor so this small agitator isn't going to intimidate me from doing my work. I don't let bullies win.\"After the incident, Omar told the room that \"we will continue... we are Minnesota strong\".Another attendee, Alfred Flowers Jr, told the BBC that he \"respected her courage and strength to still stay and finish the town hall for the people\". Video from the scene shows the team shouting \"make a hole\" as they wrestled the man out of the room.As he was pushed out of the room, he said that Omar was \"pitting us against each other\". It was not immediately clear who the man was referring to.The liquid he sprayed on Omar had a sour smell that was similar to a chemical product, according to a BBC journalist in the room.In a post on social media, Minneapolis Mayor Jacob Frey said: \"Violence and intimidation have no place in Minneapolis. We can disagree without putting people at risk... This kind of behavior will not be tolerated in our city.\" In 2019, Omar became the first Somali-American, first African-born American, and one of the first two Muslim American women to serve in the US Congress.The event was one of the regular town halls hosted by Omar, and about 100 people were in attendance in the north Minneapolis basement, expecting to hear about the presence of federal immigration officials in their town and ask questions after the second fatal shooting of an American citizen by immigration officials this month. In January, an immigration officer fatally shot US citizen Renee Good. Last week, US citizen Alex Pretti was fatally shot after being stopped by border agents, reigniting local protests and public outcry. At the town hall, Omar called for Immigration and Customs Enforcement (ICE) to be \"abolished\" and said Department of Homeland Secretary Kristi Noem should \"resign or face impeachment\". It was after these comments that the man attacked.Officials pleaded with the Congresswoman to end the town hall but she insisted on continuing.  Speaking again at the podium Omar said: \"We're gonna keep talking. Just give me ten minutes. Please don't let them have the show. Please don't let them have the show.\"Many in the area see the increased immigration enforcement action as a response to President Donald Trump's dislike of Omar who he has called a \"radical left lunatic\".On Tuesday, responding to the second fatal shooting, Trump said his administration was \"going to de-escalate a little bit\" in Minnesota. Additional reporting by Kristina Volk.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota congresswoman Ilhan Omar attacked with 'unknown liquid' during town hall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7026/live/fef50610-fbf7-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-28T03:25:28.000Z",
      "dateModified": "2026-01-28T03:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Keon Hee: Who is South Korea's former first lady?",
    "url": "https://www.bbc.com/news/articles/cj3vpe8zme8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca91/live/f0b0c370-fb5a-11f0-80ad-435009e66207.jpg",
    "tag": "Trending",
    "date": "2026-01-27T23:11:38.000Z",
    "description": "A string of scandals and luxury handbags: Who is South Korea's former first lady?5 hours agoGavin ButlerandHyojung Kim,BBC World ServiceGetty ImagesTh",
    "body": "A string of scandals and luxury handbags: Who is South Korea's former first lady?5 hours agoGavin ButlerandHyojung Kim,BBC World ServiceGetty ImagesThe scandals Kim Keon Hee faces predate her husband Yoon's ill-fated political careerTwo Chanel handbags, a BMW dealership and a controversial church will all be at the centre of a trial faced by South Korea's former first lady this week.Kim Keon Hee, the wife of disgraced former president Yoon Suk Yeol, was arrested in August over a raft of charges including bribery, stock manipulation, and political interference - all of which she denies.On Wednesday, less than a fortnight after her husband was sentenced to five years' in jail for abusing power and obstructing justice in relation to his failed martial law bid, Kim will receive the verdict in the first of three cases against her.Prosecutors say Kim, 52, made more than 800 million won ($552,570; £404,050) by participating in a price-rigging scheme involving the stocks of Deutsch Motors, a BMW dealer in South Korea, between October 2010 and December 2012.She is also accused of accepting luxury bags, a diamond necklace and other gifts worth up to 80m won as bribes from the controversial Unification Church in exchange for business favours, and receiving 58 free opinion polls, worth 270 million Korean won, from political broker Myung Tae-kyun before the 2022 presidential election.Wednesday's trial, which will be broadcast live from the court, marks the first time in history that a presidential spouse has been indicted while detained.But it is far from the first time Kim herself has been embroiled in controversy.Questionable credentialsBefore she was South Korea's first lady, Kim Keon Hee – born Kim Myeong-sin – was a businesswoman and art lover.She graduated with an art education degree from Sookmyung Women's University in 1999, but would later face repeated allegations of plagiarism over her time as a student there – leading the university to annul her degree in 2025 after its research ethics panel found her thesis was compromised.She has never commented on these allegations publicly. In 2009, she founded art exhibition company Covana Contents, for which she is still CEO and president – but in 2019 South Korean media reported that she had allegedly evaded paying taxes and received kickbacks for hosting art exhibitions. Kim, who has stood down from her role, was cleared of these charges in 2023, but the special counsel is currently re-examining the case.Then, ahead of the 2022 presidential election which her husband ultimately won, allegations emerged that Kim had submitted applications to universities and companies containing false qualifications and awards, sparking a scandal over potentially fabricated credentials.In response to these allegations, which some opposition members had sought to use as a political cudgel against Yoon, Kim issued a public apology for what she described as \"exaggerations\" on her resume.She further pledged that if her husband became president she would \"focus solely on my role as his wife\".It is her conduct while in that role, however, that has drawn some of the fiercest backlash.The handbag scandalIn late-2023, spy camera footage surfaced showing Kim receiving a luxury handbag from an individual in a Seoul office in September 2022.The footage was reported to have been secretly filmed by the pastor Choi Jae-young using a camera embedded in his watch – and its publication intensified public scrutiny on both Kim and Yoon.It appeared to show Mr Choi walking to a store to purchase the greyish-blue calfskin bag, with a receipt putting its cost at 3m won ($2,200; £1,800). Mr Choi then visits Covana Contents, a company in Seoul owned by the first lady, where Ms Kim then asks the pastor: \"Why do you keep bringing me these things?\"South Korean law makes it illegal for public officials and their spouses to receive gifts worth more than 1m won in one go, or a total of 3m won within a fiscal year.And while the video did not explicitly show Ms Kim accepting the gift, the Korea Herald reported at the time that the presidential office confirmed receipt of the bag and said that it was \"being managed and stored as a property of the government\".Getty ImagesYoon Suk Yeol and Kim Keon Hee mark the first time both a former president and former first lady have been jailedThe presidential office did not immediately respond to the coverage, further fuelling the controversy, as civic groups filed complaints with the prosecution citing potential violations of the Anti-Graft Act.This incident is one of 16 allegations looked into by the special counsel team, 12 of which were passed to police for further investigation.Wednesday's verdict, however, will focus on Kim allegedly accepting other bribes from the Unification Church, as well as her alleged involvement in Deutsch Motors stock manipulation and alleged election meddling.Kim has denied the charges - although she did admit to receiving Chanel bags, which she says she later returned without using.Prosecutors last month called for a 15-year prison term and a fine of 2 billion won, saying she had \"stood above the law\" and colluded with the Unification Church to undermine the \"constitutionally mandated separation of religion and state\".DisgraceWhile Kim's string of scandals cast a shadow over her husband's presidential career, it was Yoon himself who ultimately sealed his own fate as one of South Korea's most disgraced former leaders.On 16 January, Yoon was found guilty of abuse of power, falsifying documents and obstructing justice when he tried and failed to impose martial law in the country in 2024. He has also been sentenced to five years in jail.It was the first of the verdicts in four trials linked to Yoon's shock martial law decree. Although short-lived, the move triggered nationwide turmoil, sparking protests as MPs rushed to the national assembly to overturn Yoon's decision.Yoon's actions \"plunged the country into political crisis\", a judge said while delivering the verdict, noting that Yoon had \"consistently shown no remorse\".It was during a year-long probe into Yoon's failed martial law attempt that special prosecutors started investigating many of the allegations against Kim.Together, the once-powerful-couple make a historic pair: while South Korea has a history of former presidents being indicted and imprisoned, Yoon and Kim mark the first time both a former president and former first lady have been jailed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Keon Hee: Who is South Korea's former first lady?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ca91/live/f0b0c370-fb5a-11f0-80ad-435009e66207.jpg"
      ],
      "datePublished": "2026-01-27T23:11:38.000Z",
      "dateModified": "2026-01-27T23:11:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intrusive thoughts: 'What if I just started shouting right now?'",
    "url": "https://www.bbc.com/news/articles/czejjr7wz6ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/583566a0-fad8-11f0-a21a-e9b091602ead.jpg",
    "tag": "Trending",
    "date": "2026-01-28T01:18:01.000Z",
    "description": "'What if I just started shouting?' - when to worry about intrusive thoughts3 hours agoYasmin RufoBBC NewsGetty ImagesResearch suggests most of us will",
    "body": "'What if I just started shouting?' - when to worry about intrusive thoughts3 hours agoYasmin RufoBBC NewsGetty ImagesResearch suggests most of us will have unsettling scenarios flash into our mind from time to timeHave you ever sat in a boring meeting and wondered: \"What if I just started shouting?\" Or you're driving along and you think: \"What if I crash?\"These unsettling scenarios are known as \"intrusive thoughts\" which the majority of us will experience from time to time and feel able to shrug off.But for some they can become overwhelming obsessions which lead to compulsive behaviours.When Dr Nina Higson-Sweeney was a child, she was convinced that unless she only had \"good\" thoughts the whole way home from school, her family would be harmed. \"If I had an intrusive thought, I'd restart the walk from the bus stop,\" she says. \"I was genuinely terrified that if I didn't redo it and something happened, it would be my fault\".Nina was diagnosed with obsessive compulsive disorder (OCD) aged 10 and now works as a psychology researcher at the University of Oxford where she specialises in child and adolescent mental health.Dr Nina Higson-SweeneyNina still lives with OCD but has learned how to manage it better\"Obsessions are intrusive and unwanted thoughts, feelings and sensations while compulsions are repeated, ritualised acts that are done to neutralise or alleviate the anxiety caused by the obsessions,\" Nina tells the BBC's Complex podcast.Around 1- 4% of the population is thought to live with OCD but the number of 16-24 year olds in England reporting symptoms of it has more than tripled in a decade. The condition is now the second-most widespread mental health disorder for young adults, a major NHS England survey suggests.Intrusive thoughts can be extremely distressing and often focus on topics that feel completely at odds with a person's values or identity.\"You might have thoughts about harm coming to loved ones,\" says Nina.\"It could be questioning one's sexual attraction, thinking are you homosexual? Are you heterosexual? It can even be as extreme as worrying are you a paedophile? \"A really common one is intrusive thoughts about contamination and worries about getting ill or spreading sickness,\" she says.OCD most commonly begins in puberty or early adolescence, but some people are diagnosed later in life as they can \"go years masking or covering up the distress,\" she says.Research suggests there may be a genetic component to developing OCD as well as links to early life stress such as bullying, bereavement or family breakdown, she says.Chartered psychologist Kimberley Wilson says almost everyone experiences intrusive thoughts at some point.\"Research suggests around 80% of us have these thoughts,\" she explains.For most people, those thoughts pass quickly. \"We can look at them, think they're weird, and put them aside,\" she says.If you're unable to dismiss the thoughts, that's when you may need to seek help, she suggests.\"OCD-related thoughts don't pass on, they take up residence and they're never positive thoughts - they're aggressive, hostile and not easy to deal with. That's when it becomes all-consuming and leads to compulsions.\"Signs of compulsions can be mental, like counting to a certain number, or visible, such as repeatedly checking car tyres even when you know they're fine.How to manage OCDIn these cases \"a professional or specialist can work out what's best for you,\" says Nina.Alongside professional help, Nina says there are techniques people can use day-to-day to reduce distress. One is learning to label thoughts. \"Recognising 'I'm having an intrusive thought' creates distance and remind me that it's not me,\" she explains.Some people also find it helpful to visualise OCD as something separate. \"Drawing what OCD looks like can help - there's me and there's OCD, and those are two different things.\"Self-care also matters. \"Eating well, resting and physical activity can help as my  OCD is always worse when I'm stressed and not looking after myself,\" she says.Today, Nina still lives with OCD but has learned how to manage it.\"I've never got over OCD, but I can function with it. I now have mild intrusive thoughts and a lot of insight into how I manage it. When I'm stressed though they're harder to dismiss and can still lead to compulsions.\"If you've been affected by issues in this story, details of organisations offering advice and support for people in the UK are available from BBC Action Line",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intrusive thoughts: 'What if I just started shouting right now?'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/583566a0-fad8-11f0-a21a-e9b091602ead.jpg"
      ],
      "datePublished": "2026-01-28T01:18:01.000Z",
      "dateModified": "2026-01-28T01:18:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok settles just before social media addiction trial to begin",
    "url": "https://www.bbc.com/news/articles/c24g8v6qr1mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5753/live/bfdc78e0-fba8-11f0-b852-153f64f31c74.jpg",
    "tag": "Trending",
    "date": "2026-01-27T17:31:54.000Z",
    "description": "11 hours agoLily JamaliNorth America Technology correspondent, San FranciscoTikTok has reached a settlement to avoid it being involved in a landmark s",
    "body": "11 hours agoLily JamaliNorth America Technology correspondent, San FranciscoTikTok has reached a settlement to avoid it being involved in a landmark social media addiction trial - a matter of hours before jury selection was due to begin in California.The plaintiff, a 20-year-old woman identified by the initials KGM, alleges the design of platforms' algorithms left her addicted to social media and negatively affected her mental health.\"The parties are pleased to have reached an amicable resolution of this dispute,\" the Social Media Victims Law Center said of the TikTok settlement, adding the terms were confidential.The defendants now include Meta - which owns Instagram and Facebook and YouTube parent Google. Snapchat settled with the plaintiff last week. The named social media companies have said the plaintiff's evidence falls short of proving they are responsible for alleged harms such as depression and eating disorders.The case going to trial marks a distinct shift in how the US legal system treats tech firms, which face mounting claims that their products lead to addictive behaviours.The companies have long argued that Section 230 of the Communications Decency Act, passed by Congress in 1996, exempts platforms from liability for what third parties post.But at issue in this case are design choices about algorithms, notifications and other features that affect how people use their apps.KGM's attorney, Matthew Bergman, told the BBC the case will be the first time a social media company has been held to account by a jury at trial.\"Unfortunately, there are all too many kids in the United States, the UK, and around the world who are suffering as KGM does because of the dangerous and addictive algorithms that the social media platforms foist on unsuspecting kids,\" he said.\"These companies are going to have to explain to a jury why their profits were more important than the lives of our young people.\"Eric Goldman, a law professor at Santa Clara University, told the BBC that losing these cases in court could pose an existential threat to the social media companies.But he said it may be difficult for plaintiffs to prove physical harms can be blamed on content publishers.\"The fact that the plaintiffs have been able to sell that idea has opened the door to a whole bunch of new legal questions that the law wasn't really designed to answer,\" he said.At trial, jurors are expected to see an array of evidence, including excerpts from internal company documents.\"A lot of what these companies have been trying to shield from the public is likely going to be aired in court,\" said Mary Graw Leary, a law professor at Catholic University of America.Meta says it has introduced dozens of tools to support a safer environment for teens online.\"We strongly disagree with these allegations and are confident the evidence will show our longstanding commitment to supporting young people,\" it said in a statement.Researchers have previously questioned the effectiveness of Meta's safety interventions - Meta argued the researchers had not properly understood how the tools it had introduced worked.The companies are expected to argue any asserted harms are caused by third-party users.One highly-anticipated witness the jury will hear from is Meta boss Mark Zuckerberg, who is due to testify early in the trial.In 2024, he told US senators \"the existing body of scientific work has not shown any causal link between social media and young people having worse mental health outcomes\".During that same hearing, at the prodding of one senator, Zuckerberg apologised to victims and their loved ones who had crowded into the chamber.Tech executives \"are often not good under pressure\" said Mary Anne Franks, a law professor at George Washington University. She said the firms were \"very much much hoping\" they could avoid having top bosses testify.The trial comes as the companies face growing scrutiny from families, school districts, and prosecutors worldwide.Last year, dozens of US states sued Meta, alleging the company misled the public over risks of social media use and had contributed to a youth mental health crisis.Australia has enacted a social media ban on under-16s, and the UK signalled in January it may follow.\"There is a tipping point when it comes to the harms of social media,\" Franks said. \"The tech industry has been given deferential treatment - I think we're seeing that start to change.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok settles just before social media addiction trial to begin",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5753/live/bfdc78e0-fba8-11f0-b852-153f64f31c74.jpg"
      ],
      "datePublished": "2026-01-27T17:31:54.000Z",
      "dateModified": "2026-01-27T17:31:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]