[
  {
    "title": "Mr Burton",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002m3tl/mr-burton?at_mid=FCqiGdjR3M&at_campaign=Mr_Burton&at_medium=display_ad&at_campaign_type=owned&at_nation=WLS&at_audience_id=SS&at_product=iplayer&at_brand=m002m3tl&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Mr_Burton&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg",
    "tag": "Trending",
    "date": "2025-11-10T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeMr BurtonMr BurtonFilm biopic about the power of an inspirational teacher and how talent can sometimes transcend the circumstances in which it is found. Duration1h 59mFirst shown2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Life and Death of Peter SellersNever judge a man by his cover. The comedic genius who could play anyone - except himself1h 54mThe Tommy Steele StoryThe sensational success story of Britain's first rock 'n' roll teen idol1h 18mHattieWhat a carry on. How actress Hattie Jacques' home life was shattered by a secret affair1h 25mSelmaOne dream can change the world. Oscar-winning biopic of Martin Luther King's 1965 march1h 59mHero: The Extraordinary Life of Mr Ulric CrossThe rise of a hero. Biopic inspired by the world-changing Trinidadian freedom fighter1h 46mBlinded by the LightFor anyone with dreams. A feel-good true story with words and music of Bruce Springsteen1h 49mEverestThe real-life story of an awe-inspiring expedition that became an epic fight for survival1h 51mBurton and TaylorHollywood's glamorous, fiery stars - the celebrity 'it' couple, together one last time1h 22mOdetteAnna Neagle stars in a stirring spy drama based on a wartime heroine's true story1h 52mA Song for JennyLove, tragedy and grief. A mother's story of losing her daughter in a terrorist attack1h 17mBabsFrom cockney kid to queen of soap, the inspiring, heartwarming story of Barbara Windsor1h 28mEric and ErnieThe heartwarming true story of how the pair went from child stars to national treasures1h 29m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mr Burton",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg"
      ],
      "datePublished": "2025-11-10T06:00:00.000Z",
      "dateModified": "2025-11-10T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three things you can do if your child's friends annoy you",
    "url": "https://www.bbc.com/news/articles/c709y0v8gkwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6eaf/live/33efc930-c15c-11f0-9c9a-1124134b6598.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:30:55.000Z",
    "description": "33 minutes agoYasmin RufoGetty ImagesYou are not going to like all your children's friends and sooner or later, your child will bring home a friend yo",
    "body": "33 minutes agoYasmin RufoGetty ImagesYou are not going to like all your children's friends and sooner or later, your child will bring home a friend you just don't warm to. Maybe they're rude, overconfident or have a habit of helping themselves to snacks without asking. Or maybe it's deeper than that and you feel they bring out the worst in your child.It's easy to just tell your child they can't hang out with a friend, but that often won't solve the problem.Parenting coach Sue Atkins and mum-of-four and comedian Ria Lina share three ways you can navigate this without driving your own kid away.1. Consider why you don't like themIs it something serious like disrespect, bullying or risky behaviour, or is it just that the child rubs you up the wrong way?Atkins says it's worth doing a little self-audit before reacting as it's important to separate what's annoying from what's harmful.If it's a genuine risk like dangerous behaviour or bullying then it's time to step in more firmly, but if the issue is something like manners, you can model the behaviour you want to see.This is something Lina, whose comedy is often about the trials and tribulations of raising four children, often does. \"When a child is under my care, they follow my standards,\" she explains. \"I tell my children off for putting their feet on bus seats and if other kids under my care are doing that, then I'll tell them to take their feet off too.\"Lina says that the reason you may not like your children's friends is often because of a \"clash of values\" with other parents.\"I've had moments where I thought, this kid makes my kid worse but often it's not really that child's fault.\"For example, I don't allow gun play at home at all, no finger guns or playing with toy guns, but lots of boys do that and that's caused tension when I've told my kids they couldn't join in.\"Sometimes talking to the child's parents can help find a middle ground that both parents are happy with, she says.2. Talk, don't banGetty ImagesIdentify the behaviour you don't like in your child's friend and talk to them about it directlyThe worst thing you can do is just ban your child from seeing a friend as \"you're not helping them engage in better friendships nor are you explaining to them why they can't spend time with that child,\" says Atkins.Being too heavy-handed can \"backfire and your child will probably hang out with that friend more just to spite you.\"You should ask your child why they like that friend - what do they have in common? What do they enjoy doing together?Listening to them share this doesn't mean you approve of their friendship but it helps build trust between you.\"When you talk, choose your moment carefully,\" says Atkins. \"Watch your tone and body language because if you go in aggressive or judgemental, they'll shut down.\"You want to build bridges, not walls.\"Lina says that it's important to tell your child \"you don't approve of a particular behaviour and you don't want to see them copying it,\" she adds. \"That way you're not stopping the friendship or forbidding the interaction but you're drawing a line about what shouldn't be repeated or endorsed.\"3. Widen the circleGetty ImagesJoining a sports group can be a good way for children to meet new people If your child seems stuck in a friendship you're uneasy about, subtly expand their social world.\"Introduce other friends into the mix,\" suggests Atkins. \"Invite cousins over, make them join a sports club or try after-school activities - anything that helps them meet new people.\"It's also important to remember that not every friendship is forever and kids often move through phases, so it's best to see how the friendship changes over a few weeks or months before intervening.\"Sometimes it's just a friend for the summer holidays or it's a teenage kid trying to spite you,\" says Atkins.The best thing you can do is model the kind of friendships you hope your child will form.Talking to them about your own relationships can show your child what respect, kindness and healthy boundaries look like and in turn, they are more likely to mimic that.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three things you can do if your child's friends annoy you",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6eaf/live/33efc930-c15c-11f0-9c9a-1124134b6598.jpg"
      ],
      "datePublished": "2025-11-17T00:30:55.000Z",
      "dateModified": "2025-11-17T00:30:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premature birth can be incredibly lonely, says Princess Beatrice",
    "url": "https://www.bbc.com/news/articles/cq50njy3wwyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7911/live/fed4e610-c32f-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:00:15.000Z",
    "description": "Princess Beatrice has said premature birth can be \"incredibly lonely\", as she reflected on her own experience for a podcast ahead of World Prematurity",
    "body": "Princess Beatrice has said premature birth can be \"incredibly lonely\", as she reflected on her own experience for a podcast ahead of World Prematurity Day.Her words are part of a campaign for premature birth research charity Borne, of which she became a patron months after her daughter was born several weeks early.\"I think so often, especially as mums, we spend our lives, you know, feeling we have to be perfect to do this,\" Beatrice told the podcast.\"And sometimes, when you are faced with that moment of learning that your baby's going to come a bit early, it can be incredibly lonely.\"News of the princess's second pregnancy was announced by Buckingham Palace in October last year, and she gave birth to her second daughter Athena Elizabeth Rose in January.Beatrice, 37, the eldest daughter of Andrew Mountbatten-Windsor, the former Duke of York and the King's brother, was due to give birth to her daughter in early spring, when, in December, she received medical advice not to travel long distances.After changing her travel plans from spending the festive period overseas, she joined the royal family at church in Sandringham on Christmas Day with doctors said to have warned her that a premature arrival was a possibility.\"Nothing quite prepares you for the moment when you realise your baby is going to arrive early,\" she wrote in British Vogue in March, adding, \"there's so little control.\"At the time of her patronage, the princess said she was \"looking forward to supporting Borne and its programme of ground-breaking research\".Last week, Beatrice, visited the charity's research laboratories at Chelsea and Westminster Hospital in London as part of the Every Week Counts campaign.According to Borne, 15 million babies arrive too soon each year, with 60,000  - or 1 in 13 - born prematurely in the UK every year.The charity says complications from prematurity remain the leading cause of neonatal death and lifelong disability.The princess said there was a \"sense of life changing relief\" knowing Borne was supporting research and asking important questions.She added that she hoped her support of the campaign would \"bring as many people that have had their own stories, to come and share them\".\"Then maybe we can learn from each other.\"World Prematurity Day is organised but the World Health Organization every year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premature birth can be incredibly lonely, says Princess Beatrice",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7911/live/fed4e610-c32f-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-17T00:00:15.000Z",
      "dateModified": "2025-11-17T00:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Parents arrested for WhatsApps say police have paid £20k damages",
    "url": "https://www.bbc.com/news/articles/c4gz1qy30v5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b5f4/live/bd294af0-c32d-11f0-8669-5560f5c90fbe.png",
    "tag": "Trending",
    "date": "2025-11-16T21:24:27.000Z",
    "description": "4 hours agoCallum MayThe couple said six police officers turned up at the home in JanuaryA couple who were arrested after making complaints about thei",
    "body": "4 hours agoCallum MayThe couple said six police officers turned up at the home in JanuaryA couple who were arrested after making complaints about their daughter's primary school, which included comments made on WhatsApp, say police have paid them £20,000 in damages.Rosalind Levine and Maxie Allen told the Times in March they were held for 11 hours on suspicion of harassment, malicious communications and causing a nuisance on school property.Hertfordshire Police previously said the arrests \"were necessary to fully investigate the allegations\".Ms Levine, from Borehamwood, told the BBC police had accepted liability for unlawful arrest and paid damages of £20,000, plus costs. BBC News has asked Hertfordshire Police to comment.Ms Levine added she was \"very pleased\" with the outcome.\"We can now begin to put this whole episode behind us,\" she said.SuppliedThe couple were arrested in January but, two months later, the force said no further action would be takenAccording to the Times, the couple said they were banned from entering Cowley Hill Primary School in Borehamwood after questioning the recruitment process for a head teacher and criticising the leadership in a parents' WhatsApp group.The parents said they emailed the school \"regularly\" following the ban to address issues relating to the needs of their daughter, who has epilepsy, is neurodivergent, and is registered disabled.The school said it sought advice from police after a \"high volume of direct correspondence and public social media posts\" that it said was upsetting for staff, parents and governors.An officer issued a warning to the family in December, telling them to take their daughter out of school, which they did the next month.But a week after that, on 29 January, Mr Allen said six police officers turned up at his home.Mr Allen, who is a Times Radio producer, denied using abusive or threatening language, \"even in private\".The force revealed it was reviewing the investigation, and Police and Crime Commissioner for Hertfordshire Jonathan Ash-Edwards said: \"There has clearly been a fundamental breakdown in relationships between a school and parents that shouldn't have become a police matter.\"GoogleCowley Hill Primary School contacted police after claiming the parents' private and public communications had caused upsetMs Levine said earlier that she still had concerns about \"how and why our arrests were signed off by an inspector\".\"That decision severely impacted both our children. Our three-year-old had to witness her parents being taken away by a swarm of police officers, and my 80-year-old mother became physically ill over it later that day,\" she said.\"I hope that our case will highlight failings within the constabulary and the chief constable will ensure that this never happens again.\"More on this story Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Parents arrested for WhatsApps say police have paid £20k damages",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b5f4/live/bd294af0-c32d-11f0-8669-5560f5c90fbe.png"
      ],
      "datePublished": "2025-11-16T21:24:27.000Z",
      "dateModified": "2025-11-16T21:24:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leader of Ecuador's Los Lobos drugs gang captured in Spain",
    "url": "https://www.bbc.com/news/articles/c93dz9zly83o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/76ee/live/2df053e0-c320-11f0-b6aa-5154cec25b8c.jpg",
    "tag": "Trending",
    "date": "2025-11-16T21:37:51.000Z",
    "description": "3 hours agoIone WellsSouth America correspondentJohnReimberg/XEcuador's interior minister shared this picture following news of Chavarria's captureThe",
    "body": "3 hours agoIone WellsSouth America correspondentJohnReimberg/XEcuador's interior minister shared this picture following news of Chavarria's captureThe leader of one of Ecuador's biggest drug-trafficking gangs has been captured in an operation involving Spanish police, Ecuador's president Daniel Noboa has said. Wilmer \"Pipo\" Chavarria, the head of Los Lobos, was detained in the city of Malaga, according to Spain's National Police. President Noboa said Chavarria had faked his own death, changed his identity and hidden in Europe while continuing to control criminal operations in Ecuador, including illegal mining and ordering murders.His family had claimed in 2021 that he had died from a heart attack due to Covid.Both Ecuador and the US have designated Los Lobos (The Wolves) as a terrorist organisation.In a post on X, Ecuador's interior minister John Reimberg, who said he was in Spain with police, said the capture of Chavarria was a \"historic day\" for his country.Los Lobos is estimated to have 8,000 members and is one of the most powerful criminal organisations in Ecuador.In June 2024, the US Treasury sanctioned the gang and described it as a group with \"thousands of members\" that had significantly contributed to the increase in violence in Ecuador.Violence and murders have soared in Ecuador in recent years as it has become a major cocaine trafficking hub and rival gangs compete for control. It does not produce the drug, but sits next to major drug-producing countries such as Peru and Colombia.President Noboa has defined his presidency through a tough military crackdown on criminal gangs.The high-profile arrest coincides with a referendum in Ecuador on whether to change the constitution to allow foreign military bases in the country again. The US held one on Ecuador's Pacific coast until 2009, when the left-wing president at the time Rafael Correa did not renew it and banned them constitutionally.US Homeland Security Secretary Kristi Noem has recently toured military facilities in Ecuador.President Noboa told the BBC earlier this year that he wanted US and European armies to join his \"war\" against what he called \"narco-terrorists.\"The US is expanding military operations in the Caribbean and Eastern Pacific. It has deployed troops and a naval strike force centred around the USS Gerald Ford aircraft carrier to the region.Additionally, it has carried out at least 20 strikes on alleged narco-trafficking vessels in the Eastern Pacific and Caribbean, killing at least 80 people.It has not yet provided evidence about those on board and some lawyers have argued the strikes could breach international law.Many Los Lobos members are in jail and the gang is thought to have instigated some of Ecuador's bloodiest prison riots. The gang is thought to have links to the powerful Jalisco New Generation cartel in Mexico.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leader of Ecuador's Los Lobos drugs gang captured in Spain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/76ee/live/2df053e0-c320-11f0-b6aa-5154cec25b8c.jpg"
      ],
      "datePublished": "2025-11-16T21:37:51.000Z",
      "dateModified": "2025-11-16T21:37:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Sweeping reforms to asylum rules' and 'New humiliation for Andrew'",
    "url": "https://www.bbc.com/news/articles/cwy5d5kzg2qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/95b9/live/69c6c350-c34c-11f0-8669-5560f5c90fbe.png",
    "tag": "Trending",
    "date": "2025-11-17T01:00:48.000Z",
    "description": "Just nowThe home secretary will announce a raft of changes to the UK's asylum policy later, which leads the majority of the day's papers. \"Most sweepi",
    "body": "Just nowThe home secretary will announce a raft of changes to the UK's asylum policy later, which leads the majority of the day's papers. \"Most sweeping reforms to asylum rules in a generation\" declares the Guardian, and points to Shabana Mahmood's earlier warning that anger over illegal immigration could \"turn on second-generation immigrants\" and rupture community relations.\"First states face visa ban in migrant returns push\" reads the Times, reporting that Mahmood is set to announce that the UK will stop granting visas to people from three African countries if their governments do not improve co-operation on removals of illegal migrants. According to the paper, the first countries subject to the ban will be Angola, Namibia and the Democratic Republic of Congo. The Daily Telegraph leads with a similar story, and notes that the visa bans mirror measures introduced by US President Donald Trump during his first term. The paper says that countries with a history of refusing to accept returned asylum seekers could be the focus of future crackdowns; it lists Somalia, Bangladesh, Iran and Egypt as the worst offenders.\"Cruel to be kind?\" asks the Metro, reporting that the reforms are based on tough laws brought in by the centre-left government in Denmark. It writes that the changes have been mocked by shadow home secretary Chris Philp, who called them a \"gimmick\" from a government that is \"incapable of getting real change past their left-wing backbenchers\". The paper predicts Monday's announcement from the home secretary will \"spark yet more civil war\" in the Labour party, which it says is \"already riven by talk of leadership challenges\". People granted asylum in the UK will need to wait 20 years before they can apply to settle permanently, according to the Metro. Amid the upcoming reforms, the paper notes that fresh protests have been held over plans to house 600 asylum seekers at a former military site in East Sussex.\"Lawyers and Labour MPs to torpedo Mahmood's asylum plan\" reports the Daily Mail, reporting that the home secretary has been warned that asylum seekers will be able to avoid deportation \"as long as Britain remained signed up to human rights laws\". The paper says the proposed reforms have resulted in significant backlash for Mahmood from various Labour MPs and charities. The Mirror says Andrew Mountbatten-Windsor is facing a \"fresh humiliation\", and report that Falklands' authorities have removed \"every plaque\" that bears his name. The former prince has previously received a warm welcome in the archipelago, after he served as a helicopter pilot during the Falklands War. A source told the paper that the Falklands were Andrew's \"last remaining source of pride\".\"Trump trade negotiator lashes out at Europe over delays in reducing tariffs\" reads the headline of the Financial Times. US trade representative Jamieson Greer told the paper that the negotiations remain a \"flashpoint\" with Washington, despite the deal struck between Trump and European Commission president Ursula von der Leyen earlier this year. Officials say the delays are in danger of \"squandering a period of better relations\" between the US and Europe. The front page of the Sun features a photograph of what it claims is the woodland \"lair\" of Christian Brückner, who was released from prison earlier this year. The German national has been named by prosecutors as a prime suspect in the disappearance of Madeleine McCann. Brückner has never been charged with any crime in relation to the case and denies any involvement.Government moves to ease prison overcrowding is a \"betrayal\" of victims and their families, says the Daily Express. The paper reports that Labour is \"ramming through sentencing reforms\" that would see \"killers and abusers\" released early. The early release scheme kicked off in September 2024, and has been criticised in recent weeks following several high-profile mistaken releases. I'm A Celebrity cast member Kelly Brook is front and centre of the Daily Star, which has made a public bid to crown the model this year's \"Queen of the Jungle\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Sweeping reforms to asylum rules' and 'New humiliation for Andrew'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/95b9/live/69c6c350-c34c-11f0-8669-5560f5c90fbe.png"
      ],
      "datePublished": "2025-11-17T01:00:48.000Z",
      "dateModified": "2025-11-17T01:00:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fast-track deportations to be announced as part of asylum reforms",
    "url": "https://www.bbc.com/news/articles/cn97ryvelz0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab61/live/077b5d90-c32f-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-16T22:37:34.000Z",
    "description": "2 hours agoJennifer McKiernanPolitical reporterPA MediaThe government has said it wants to reduce the number of migrants coming to the UK on small boa",
    "body": "2 hours agoJennifer McKiernanPolitical reporterPA MediaThe government has said it wants to reduce the number of migrants coming to the UK on small boatsPlans to fast-track the deportations of illegal migrants as part of a sweeping reforms of the UK's asylum policy are to be announced by Home Secretary Shabana Mahmood.In a statement to MPs on Monday she will outline plans to end multiple appeals against removal and for an overhaul of legislation on human rights law. For those granted asylum they will only be given it on a temporary basis and will be returned home if their country is at any time deemed safe. They will have to wait 20 years to apply to settle permanently.Mahmood is also to say the UK will stop granting visas to people from three African countries if their governments do not improve co-operation on removals of illegal migrants.Mahmood told the BBC on Sunday: \"This is a moral mission for me, because I can see illegal migration is tearing our country apart, it is dividing communities.\"Conservative shadow home secretary Chris Philp said he would go further and deport failed asylum seekers \"within a week\".The plans have prompted criticism from some Labour MPs, including Rachael Maskell, who said the government was going in \"completely the wrong direction\" on immigration.The government wants to reduce the number of people arriving to the UK on small boats and the reforms aim to speed up deportations of failed asylum seekers and foreign criminals as well as make it more difficult for successful asylum seekers to remain.Under the plans people will be restricted to arguing their grounds for appeal within a single appeal and if a case fails, they will be deported.The government will follow the Danish model of creating an independent body to fast-track the deportation of foreign criminals and cases with little prospect of success through the appeals system.As part of the reforms, Mahmood wants to overhaul how human rights legislation, including Article 8 of the European Convention on Human Rights (ECHR) which covers the right to family life, is applied in migration court cases. Only those with immediate family in the UK, such as a parent or child, will be able to use Article 8 as grounds to stay.The UK will join other countries in reforming Article 3 of the ECHR, which is designed to give people protection against inhuman or degrading treatment.The government believes this has been used to support unreasonable claims, including serious criminals having their deportation blocked because their  healthcare needs cannot be met. Similarly, the Home Office said the Modern Slavery Act will be tightened up to prevent last-minute claims to block removal.Illegal migration is 'dividing our country' says MahmoodPrime Minister Keir Starmer said the reforms would stop \"endless appeals\" to increase the removals of \"those with no right to be here\".Mahmood said the reforms recognised the \"pace and scale\" of immigration had destabilised and divided communities and  would allow the government to ramp up the removal of those with no right to be in Britain.She continued: \"To maintain the generosity that allows us to provide sanctuary, we must restore order and control.\"Earlier the home secretary told the BBC she would create new safe and legal routes for refugees through work and study routes.Under the new measures there will be tighter restrictions placed on successful asylum seekers, who will have their case reviewed every two and a half years and if their home country is considered safe they will be returned.A refugee will have to have been resident in the UK for 20 years, up from the current five years, in order to apply for permanent residence or indefinite leave to remain.They will not be able to bring family members to join them unless they are immediate relatives, including parents and children, while housing and weekly allowances will also no longer be guaranteed for asylum seekers.'Years of limbo'Asylum claims in Britain are at a record high, with around 111,000 applications in the year to June 2025, according to official figures.The appeals system currently has a backlog of more than 50,000 and a waiting time of at least a year.There has also been criticism of the proposed reforms from within Labour, with Maskell saying lots of her fellow MPs were \"really concerned\".She said it was important to have a robust human rights framework and described \"reordering our relationship with the ECHR\" as a \"step too far\".Reform leader Nigel Farage said the home secretary \"sounds like a Reform supporter\". \"It's a shame that the Human Rights Act, ECHR and her own backbenchers mean that this will never happen,\" he added.Liberal Democrats home affairs spokesperson Max Wilkinson said the government should \"focus on processing claims quickly, getting them right first time, and swiftly deporting people with no right to be here\".Enver Solomon, chief executive at the Refugee Council, said rather than deter migrants, the 20-year time frame would \"leave people in limbo and in tense anxiety for many, many years\".As first reported in the Times, the threat of the visa ban for Angola, Namibia and the Democratic Republic of Congo comes after thousands of illegal migrants and criminals from the three nations were said to be in the UK.A Home Office source said the countries were being targeted \"for their unacceptably low cooperation and obstructive returns processes\".Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fast-track deportations to be announced as part of asylum reforms",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab61/live/077b5d90-c32f-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-16T22:37:34.000Z",
      "dateModified": "2025-11-16T22:37:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene doubles down on calls to release Epstein files",
    "url": "https://www.bbc.com/news/articles/cdeg8z0j2j2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1fb1/live/0a716ae0-c315-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-16T21:32:28.000Z",
    "description": "Republican congresswoman Marjorie Taylor Greene is reiterating her calls for the release of all Epstein files, after US President Donald Trump called ",
    "body": "Republican congresswoman Marjorie Taylor Greene is reiterating her calls for the release of all Epstein files, after US President Donald Trump called her a \"traitor\" and said he no longer supports her. Speaking to CNN's State of the Union on Sunday, Greene told host Dana Bash that while she still supports the president, she does not agree with his efforts to keep the Epstein files under wraps.She said Trump's attacks on her are not just perpetuating toxic in-fighting in politics, but also putting her safety at risk.\"He called me a traitor, and that is so extremely wrong, and those are the types of words used that can radicalize people against me and put my life in danger,\" said Greene. Greene and Trump's relationship has grown increasingly rocky in the past few weeks  after Greene pushed for the Department of Justice to release all files it has on the late financier and convicted sex offender Jeffrey Epstein. The tension escalated on Friday when Trump condemned Greene on Truth Social calling her a \"traitor\", \"wacky\", and a \"ranting Lunatic\". All she does is \"COMPLAIN, COMPLAIN, COMPLAIN\", Trump wrote. While Trump's post does not mention the Epstein files, Greene told CNN that her fallout with the president has \"all come down to the Epstein files\". The House is expected to hold a vote this week on legislation that would force the Justice Department to release the files to the public. The vote could happen as soon as Tuesday, sources told CBS, the BBC's US partner. Republican Rep. Thomas Massie, a co-sponsor of the bill, said in an interview with ABC News on Sunday that as many as 100 GOP members could vote in favour.  Known as the Epstein Files Transparency Act, the aim of the bill is to make the justice department release all unclassified records, documents, communications, and investigative materials linked to Jeffrey Epstein.Trump and Epstein were friends in the early 2000s. The US president has said a falling out ended the relationship before Epstein's legal troubles began and he has consistently denied any wrongdoing in relation to Epstein.Still, he has faced bipartisan criticism over his handling of the case records.\"I believe the country deserves transparency in these files, and I don't believe that rich, powerful people should be protected if they have done anything wrong,\" Greene told Bash. Greene questioned why Trump is pushing so hard to keep the files from public view, but added that she believes Epstein's victims who she says have told her that Trump did nothing illegal. She said she's also focused on ending hate and division in politics, which she said is splitting apart American families, friends and neighbours. \"I think America needs to come together and end all the toxic, dangerous rhetoric and divide, and I'm leading the way with my own example, and I hope that President Trump can do the same,\" she told Bash. It's a stark messaging shift for Greene, who has previously been accused of stoking political divisions by promoting antisemitic conspiracy theories and elevating controversial posts on social media. She liked a post that called for the executions of former Democratic House Speaker Nancy Pelosi and former President Barack Obama, and posted a photo of herself holding a gun beside images of three progressive Democratic congresswomen. When Bash brought up some of these examples, Greene reiterated her past apologies and said a core part of her Christian faith is forgiveness.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene doubles down on calls to release Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1fb1/live/0a716ae0-c315-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-16T21:32:28.000Z",
      "dateModified": "2025-11-16T21:32:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cold snap brings chance of snow for some as flood clear-up continues",
    "url": "https://www.bbc.com/news/articles/cj0el2g5448o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/204b/live/4099e680-c33b-11f0-9456-cf2ede84f216.jpg",
    "tag": "Trending",
    "date": "2025-11-16T22:21:55.000Z",
    "description": "3 hours agoJake Lapham and Sarah Keith-Lucas,Lead Weather Presenter Eddie T/BBC Weather WatchersCold Arctic air is set to sweep across the UK next wee",
    "body": "3 hours agoJake Lapham and Sarah Keith-Lucas,Lead Weather Presenter Eddie T/BBC Weather WatchersCold Arctic air is set to sweep across the UK next week as communities in Wales recover from severe flooding that inundated properties and disrupted transport at the weekend.Temperatures are now set to drop, with yellow cold health alerts in place from Monday to Friday in northern and central parts of England. Snow is possible on higher ground in Scotland and northern England by Tuesday.The cold snap comes as Storm Claudia moved away on Sunday after delivering more than a month's worth of rain in parts of England and Wales. People have rallied together to help residents and business owners recover from unprecedented flooding in Monmouth, Wales.A major incident which had been declared in the area was rescinded on Sunday afternoon. Four severe flood warnings - which warned of a \"danger to life\" - also ended.The River Monnow reached record levels after the storm, exceeding those recorded during Storm Dennis in 2020 and Storm Bert in 2024. While that low pressure system has been replaced by mostly calm and dry weather, Monday could bring a few wintry showers on exposed eastern coasts. Highs of 5–10°C are expected across much of the UK in the coming days.By Tuesday, low pressure brings rain and sleet, with snow possible in the northern half of the UK, particularly in the mountains.England's yellow cold health alerts, issued by the UK Health Security Agency, warn of the potential for \"significant impacts\" across health and social care services. They are in place from 08:00 on Monday to 08:00 on Friday.Cold Arctic air is sweeping across the UK this week, bringing lower temperatures and the risk of snow in some areasMidweek stays cold with brisk northerly winds, and sleet and snow showers are likely, mainly along northern and eastern coasts, as well as Northern Ireland, west Wales, and possibly the moors of south-west England.The significant drop in temperature is due to a change in wind direction.Since the start of this month, there has generally been a southerly wind bringing a very mild, but cloudy, tropical maritime airmass all the way from the Canary Islands.This pattern will change. After being on the warmer side of the jet stream, the UK will be on the colder side of it.Monmouth town centre in Wales flooded after Storm ClaudiaMajor flooding in Monmouth saw people rescued from their homes, with some evacuated to a library and a leisure centre. Hundreds of homes were left without power. As the waters receded, many buildings were left covered in a thick layer of sludge.\"It's dreadful,\" county councillor Martin Newell told the BBC. He said he had spoken to a resident who had \"lost everything, all of his possessions\", and that businesses would not recover before Christmas.Monmouthshire MP Catherine Fookes said it was a \"really worrying time\" and that flood defences would need to be reviewed while the clear-up was under way. She praised the \"incredibly resilient and kind\" community, which has been donating clothes and hot meals for evacuees at a church.Flooding has been less severe in England, but an ongoing risk remains, with 27 flood warnings still in place.The weather also triggered major disruption on rail networks over the weekend. Most lines have since returned to normal, but disruption is expected to continue into Monday on some Great Western Railway and Transport for Wales services.National Rail has warned passengers to check before they travel and the AA told drivers to avoid travelling in \"hazardous weather\".Additional reporting by Nicholas Bourne",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cold snap brings chance of snow for some as flood clear-up continues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/204b/live/4099e680-c33b-11f0-9456-cf2ede84f216.jpg"
      ],
      "datePublished": "2025-11-16T22:21:55.000Z",
      "dateModified": "2025-11-16T22:21:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gujarat: Hackers steal maternity ward CCTV videos in India cybercrime racket",
    "url": "https://www.bbc.com/news/articles/cqjw2x10njeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3507/live/2195e130-c115-11f0-840c-4d1509c70a43.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:00:03.000Z",
    "description": "1 hour agoCherylann Mollan,BBC News and Gopal Kateshiya and Roxy Gagdekar Chhara,BBC GujaratiGetty ImagesPolice say that they uncovered a massive cybe",
    "body": "1 hour agoCherylann Mollan,BBC News and Gopal Kateshiya and Roxy Gagdekar Chhara,BBC GujaratiGetty ImagesPolice say that they uncovered a massive cybercrime racket Hacked CCTV videos from a maternity hospital in India have been sold on Telegram, police say, raising serious questions about privacy and security in a country where such cameras have become commonplace.Earlier this year, police in Gujarat state were alerted by the media to videos on YouTube - some showed pregnant women undergoing medical exams and receiving injections in their buttocks - in a maternity hospital in a city. The videos had a link directing viewers to Telegram channels to buy longer videos. The director of the hospital told the BBC that the cameras had been installed for the safety of doctors. The BBC is not naming the city or hospital to protect the identity of the women in the videos. None of them have filed a police complaint.Police say their investigation uncovered a massive cybercrime racket where sensitive footage from at least 50,000 CCTVs from across the country was stolen by hackers and sold on the internet.CCTVs have become ubiquitous in India, especially in urban areas. They are installed in malls, offices, hospitals, schools, private apartment complexes and even inside people's homes.Experts warn that while CCTV boosts security, poorly installed or managed systems can threaten privacy. In India, cameras are often handled by staff without cybersecurity training, and some domestically manufactured models are reportedly easily exploitable.In 2018, a tech worker in Bengaluru city said that his webcam was hacked, and that the hacker demanded payment in exchange for not sharing his private videos. In 2023, a YouTuber reportedly found out that his home CCTV had been hacked after private videos went viral.Last year, the federal government asked states to not procure CCTVs from suppliers with a history of security and data breaches and also introduced new rules to improve cyber security of CCTV cameras. But hacking incidents like these are still reported.Getty ImagesCCTV cameras are ubiquitous in IndiaIn Gujarat, police say they ended up discovering a \"network of individuals spread across the country\".\"[They] were hacking into the video surveillance systems - or CCTV systems - of hospitals, schools, colleges, corporate offices and even the bedrooms of private individuals in multiple states,\" Lavina Sinha, who heads the Ahmedabad cyber crime department investigating the case, told reporters.Hardik Makadiya, Gujarat's top cybercrime official, says videos were sold for 800–2,000 rupees  ($9-22; £7-17, with Telegram channels offering live CCTV feeds via subscription.Police have registered a case under various sections of the law, including violating a female patient's privacy, publishing obscene material, voyeurism and cyber terrorism - which is a non-bailable offence. They say that they reached out to Telegram and YouTube, and the videos have been taken down.Since February, police have arrested eight people in the case - four from Maharashtra and others from Uttar Pradesh, Gujarat, Delhi, and Uttarakhand. They remain in judicial custody as the case proceeds in court.CCTV: Why do so many Indians love surveillance?Yash Koshti, lawyer for three of the accused, denied the allegations, saying they were not hackers or cyber criminals and that someone else carried out the breach.Cybercrime investigator Ritesh Bhatia warns that weakly protected CCTV and home networks are easy targets and must be properly secured.\"Wireless CCTV systems help you access the footage remotely, like on your smartphone or laptop. But once a system is connected to the web, it's easy for hackers to decode its IP address and default password. And once they get into the system, they can see or record live footage, download it or even shut down the system,\" Mr Bhatia says.He says that one way to secure surveillance systems is to change IP addresses and the default password.Mr Bhatia advises using a robust password that mixes letters, numbers, and symbols and cannot be found in a dictionary, and recommends periodic audits by a cybersecurity professional.He adds that CCTV manufacturers also bear responsibility, and their packaging should clearly warn users to replace default passwords with strong ones - similar to cigarette packet health warnings.Getty ImagesA CCTV surveillance sign in Tamil Nadu; such signs are common across IndiaMr Makadiya told the BBC that many of the hacked CCTVs used default passwords - like Admin123 - or weak ones.\"The hackers used brute force (the use of certain programmes to generate thousands of letter-number password combinations) to break into these systems and access videos,\" he said.Audrey Dmello of Majlis, a legal centre for women's and children's rights, highlights the ubiquity of CCTVs in India, often installed without consent. She urges organisations, especially in sensitive spaces, to ensure their systems are properly secured.\"Organisations and institutions that set up surveillance systems, especially in sensitive spaces, must see to it that their systems are adequately secured. It's an absolute must,\" she says.The director of one of the affected hospitals told the BBC the CCTVs in exam and injection rooms were meant to protect doctors from false allegations. He added that the cameras have since been removed from sensitive areas.Police in Gujarat told the BBC that neither the hospital nor any patient had come forward to file a formal complaint. The complaint was finally lodged by a police officer.\"Female patients fear that their identity will be revealed. Therefore, they are not willing to lodge a complaint,\" said an officer.Ms Dmello says that the shame women face around such incidents only adds to its horrific nature.\"When there is a sexual angle involved, the victim is re-victimised because of the patriarchal nature of Indian society. If we want women to assert their rights and we want criminals to be brought to justice, we, as a society, should first stop shaming and blaming women for the crime,\" she says.Follow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gujarat: Hackers steal maternity ward CCTV videos in India cybercrime racket",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3507/live/2195e130-c115-11f0-840c-4d1509c70a43.jpg"
      ],
      "datePublished": "2025-11-17T00:00:03.000Z",
      "dateModified": "2025-11-17T00:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Haditha: Two US marines implicated in killing family in notorious Iraq war shooting, expert tells BBC",
    "url": "https://www.bbc.com/news/articles/c2emyz0zpxko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7a12/live/5905fee0-b8b2-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:16:13.000Z",
    "description": "47 minutes agoLara ElgebalyBBC Eye InvestigationsBBCSafa Younes is now 33 - she was the only person in her family to survive the shootings in Haditha\"",
    "body": "47 minutes agoLara ElgebalyBBC Eye InvestigationsBBCSafa Younes is now 33 - she was the only person in her family to survive the shootings in Haditha\"This is the room where my whole family was killed,\" says Safa Younes.Bullet holes pepper the front door to the house in the Iraqi town of Haditha, where she grew up. Inside the back bedroom, a colourful bedspread covers the bed where her family was shot.This is where she hid with her five siblings, mum and aunt when US marines stormed into their home and opened fire, killing everyone apart from Safa, on 19 November 2005. Her dad was also shot dead when he opened the front door.Now, 20 years on, a BBC Eye investigation has uncovered evidence that implicates two marines, who were never brought to trial, in the killing of Safa's family, according to a forensic expert. The evidence - mainly statements and testimony given in the aftermath of the killings - raises doubts about the American investigation into what happened that day, and poses significant questions over how US armed forces are held to account.The killing of Safa's family was part of what became known as the Haditha massacre, when US marines killed 24 Iraqi civilians, including four women and six children. They entered three homes killing nearly everyone inside, as well as a driver and four students in a car, who were on their way to college.The incident triggered the longest US war crimes investigation of the Iraq war, but no-one was convicted of the killings.The house in Haditha where Safa's family was killed in 2005The marines said they were responding to gunfire after a roadside bomb went off, killing one of their squad members, and injuring two others.But Safa, who was 13 at the time, tells the World Service: \"We hadn't been accused of anything. We didn't even have any weapons in the house.\"She survived by pretending to be dead among the small bodies of her sisters and brother - the youngest was three years old. \"I was the only survivor out of my entire family,\" she says.Four marines were initially charged with murder, but they gave conflicting accounts of the events, and over time US military prosecutors dropped charges against three of them, granting them immunity from further legal action.That left squad leader Staff Sergeant Frank Wuterich as the only one to face trial in 2012.Michael EpsteinIn this image, taken from footage which has not been broadcast before, Humberto Mendoza (kneeling) demonstrates what happenedIn a video recording of a pre-trial hearing, which has never been broadcast before, the most junior member of the squad, Lance Corporal Humberto Mendoza is questioned and re-enacts events at Safa's house.Mendoza - who was a private at the time and was never charged - admits to killing Safa's father when he opened the front door to the marines.\"Did you see his hands?\" a lawyer asks him. \"Yes sir,\" Mendoza responds, and goes on to confirm that Safa's father was not armed. \"But you shot him anyways?\" the lawyer asks. \"Yes sir,\" Mendoza says.In his official statements, Mendoza had initially claimed that after entering the house, he opened the door to the bedroom where Safa and her family were, but when he saw there were only women and children inside he did not go in, and instead shut the door.However, in a newly discovered audio recording from Wuterich's trial, Mendoza gives a different account. He says that he walked about 8ft (2.4m) into the bedroom.This is hugely significant, according to forensic expert Michael Maloney. The Naval Criminal Investigative Service sent him to Haditha in 2006 to investigate the killings and he examined the bedroom where Safa's family was shot.Safa inside the bedroom where her family was killed, explaining where she lay pretending to be deadUsing the crime scene photos taken by the Marine Corps at the time of the killings, he concluded that two marines had entered the room and shot the women and children.When we played him the recording of Mendoza saying he had walked into the room, Maloney said: \"This is just amazing to me, what we're listening to, and I've never heard this before today.\"He said it showed Mendoza was placing himself in the position where Maloney concluded the first shooter stood, at the foot of the bed.\"If you were to ask me: 'Is this a confession of sorts?' What I'd say is: 'Mendoza confessed to everything except for pulling the trigger.'\"Safa had given a video deposition to military prosecutors in 2006 but it was never shown in court. In it, she described how the marine who opened the bedroom door threw in a grenade, which failed to explode, and then the same man came into the room and shot her family. Mendoza is the only marine who ever said he opened the door.US Marine CorpsSafa was 14 when she was filmed giving her testimony Another marine, Lance Corporal Stephen Tatum did not deny he took part in the shootings, but said he had followed the squad leader, Wuterich, into the bedroom and initially claimed he did not know there were women and children there because of poor visibility.But in three later statements obtained by the BBC, Tatum gave a different account.\"I saw that children were in the room kneeling down. I don't remember the exact number but only that it was a lot. I am trained to shoot two shots to the chest and two shots to the head and I followed my training,\" Tatum told the Naval Criminal Investigative Service in April 2006.A month later, he said he \"was able to positively identify the people in the room as women and children before shooting them\".And then a week after that, he said: \"This is where I saw the kid I shot. Knowing it was a kid, I still shot him.\" He described the child as wearing a white T-shirt, standing on the bed, and having short hair.Tatum's defence lawyers claimed these later statements had been obtained under duress. Charges against Tatum were dropped in March 2008, and the statements were disregarded at Wuterich's trial.Forensics expert Michael Maloney said the statements by Mendoza and Tatum point to them being the two marines who shot Safa's family. He believes Mendoza went into the bedroom first and Tatum followed \"firing across the head of the bed\".We put the allegations to Mendoza and Tatum. Mendoza did not respond. He has previously admitted to shooting Safa's father, but said he was following orders. He was never charged with a criminal offence.Through his lawyer, Tatum said he wants to put Haditha behind him. He has never withdrawn his testimony that he was one of the shooters in Safa's house.Michael EpsteinSquad leader, Frank Wuterich, was the only marine to stand trial for the deaths, but his charges were eventually dismissed in a plea dealMaloney told the BBC that the prosecution \"wanted Wuterich to be that primary shooter\". But before Maloney was able to testify, Wuterich's trial ended in a plea deal. Wuterich maintained he could not remember what had happened in Safa's house, and agreed to plead guilty to one count of negligent dereliction of duty - a charge unrelated to any direct involvement in the killings.Wuterich's military lawyer, Haytham Faraj, a former marine himself, said the punishment was \"tantamount to a slap on the wrist… like a speeding ticket\".Neal Puckett, the lead defence lawyer for Wuterich, said the whole investigation and prosecution against his client was \"botched\".\"The prosecution, in granting immunity to all their witnesses and dismissing all their charges… essentially rendered themselves incapable of achieving justice in this case,\" he said.Haytham Faraj agreed the process was deeply flawed.\"The government paid people to come in and lie, and the payment was immunity, and that's how they misused the legal process,\" he told the BBC.\"The trial of Haditha was never meant to give voice to the victims,\" he added.He said that survivors' \"impressions of a show trial with no real outcome, with no-one being punished, was right\".Safa still lives in Haditha and now has a daughter and two sonsThe US Marine Corps told us it is committed to fair and open proceedings under the Uniform Code of Military Justice, ensuring due process of law. It added that it would not reopen the investigation unless a wealth of new, unexamined, and admissible evidence was introduced.The lead prosecutor in the case did not respond to the BBC's request for comment.Now aged 33, Safa still lives in Haditha and has three children of her own. She says she can't understand how no marine was punished for her family's deaths.When we show her the video of Mendoza, she says he \"should have been imprisoned from the moment the incident happened, it should have been impossible for him to see the light of day\".\"It's as if it happened last year. I still think about it,\" she says of the day her family was killed.\"I want those who did this to be held accountable and to be punished by the law. It's been almost 20 years without them being tried. That's the real crime.\"Additional reporting by Namak Khoshnaw and Michael Epstein",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Haditha: Two US marines implicated in killing family in notorious Iraq war shooting, expert tells BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7a12/live/5905fee0-b8b2-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-17T00:16:13.000Z",
      "dateModified": "2025-11-17T00:16:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Formula 1 tech used to improve train Wi-Fi on GWR",
    "url": "https://www.bbc.com/news/articles/cqjwkdez71ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/8084c720-c182-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-17T00:00:21.000Z",
    "description": "Formula 1 tech used to rev-up train wi-fi speeds in new pilot1 hour agoLaura CressTechnology reporterGWRSome of the Great Western Railway fleet will u",
    "body": "Formula 1 tech used to rev-up train wi-fi speeds in new pilot1 hour agoLaura CressTechnology reporterGWRSome of the Great Western Railway fleet will use a hybrid system including low earth orbit satellites in space to create a more-reliable wi-fi connectionA new UK-first pilot scheme is aiming to create fast and more reliable train wi-fi, using technology originally developed for Formula 1 cars.It will see a train in the Great Western Railway fleet use a hybrid system of both signals from mobile phone masts on the ground and low earth orbit (LEO) satellites in space to create a more reliable connection.The scheme has been developed by British tech company Motion Applied, in partnership with the transport body for Cornwall, Devon, Plymouth, Somerset and Torbay, Peninsula Transport.The pilot will last for 60 days onboard GWR's Intercity Express Train which runs in the South West region, having started in mid-November.In a recent study by networking testing firm Ookla, the UK ranked 16th out of 18 major European and Asian countries for train wi-fi speed, with average download speeds at just 1.09 megabits per second, compared to Sweden's 64.58.Nick Fry, chairman of Motion Applied, formerly part of McLaren Group, said the issues faced in connecting to the internet from a fast moving train had \"many parallels with motorsport\".He added that by using technology originally developed for F1 cars, trains should be able to switch between ground and space-based networks such as LEO satellites to \"reliably connect\" without drop outs.In the 2025 spending review, the Department of Transport secured £41m to introduce low earth orbit satellite connectivity on all mainline trains by 2030.'A step in the right direction'Councillor Dan Rogerson, from the Peninsula Transport board, called the pilot a \"major milestone\" in its plans to modernise transport infrastructure across the South West and South Wales.\"It's not just about passenger wi-fi,\" he said. \"This is about a whole new digital backbone for our transport networks\".Bruce Williamson from the campaign group Railfuture told the BBC the scheme appeared to be \"really good news\".\"We're all increasingly connected these days, and wi-fi has become more and more of an essential service for travellers. I'm not going to hold my breath, but this is a step in the right direction.\"In May, South Western Railway launched its own, separate, \"superfast\" wi-fi rollout for its trains between Earlsfield and Basingstoke, using trackside poles and antennas to create a bespoke 5G rail network.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Formula 1 tech used to improve train Wi-Fi on GWR",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/8084c720-c182-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-17T00:00:21.000Z",
      "dateModified": "2025-11-17T00:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thomas Tuchel: The key questions facing England boss in countdown to World Cup",
    "url": "https://www.bbc.com/sport/football/articles/c5ypn840gego?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d39b/live/95a428b0-c332-11f0-92e2-bf560514884a.jpg",
    "tag": "Trending",
    "date": "2025-11-16T22:47:08.000Z",
    "description": "Image source, Getty ImagesImage caption, Thomas Tuchel has won nine of his first 10 games in charge of England - the only other England manager to pic",
    "body": "Image source, Getty ImagesImage caption, Thomas Tuchel has won nine of his first 10 games in charge of England - the only other England manager to pick up as many wins in his first 10 matches is Glenn Hoddle in 1996-97 (also W9 L1)ByChief football writerEngland completed a flawless World Cup qualifying campaign with victory in Albania, giving head coach Thomas Tuchel an outstanding record of eight wins from eight with 22 goals scored and none conceded.It concludes phase one of the job Tuchel was brought in to do by the Football Association after succeeding Sir Gareth Southgate. Namely win the World Cup.Tuchel's planning now moves to the next stage - so what are the major issues he must ponder before he names his World Cup squad as he looks to end a 60-year wait for a major men's trophy?Bellingham or Rogers?Image source, Getty ImagesImage caption, England's win over Albania saw Jude Bellingham start his first international since JuneThe rivalry between childhood friends Jude Bellingham and Morgan Rogers for England's number 10 jersey provides an intriguing sub-plot to Tuchel's World Cup build-up.Tuchel stresses the battle can remain friendly, although it has almost been stoked and encouraged by the German, so keen is he to create edge and competition in his squad.Along with Declan Rice, Rogers is the only other England player to feature in all 10 games under Tuchel.Rogers took his chance impressively when Bellingham was absent after shoulder surgery, then Tuchel kept faith with Aston Villa's 23-year old after he decided against giving one of the global superstars in England's squad an instant recall.After a 25-minute cameo as a substitute against Serbia at Wembley, Bellingham started in Tirana, delivering a bit of everything that makes him such a passionate point of discussion.Bellingham showed his range of passing, made trademark driving runs, almost scored in the second half – but also demonstrated petulance when he was shown a yellow card for a foul committed after he lost possession, then looked unhappy at being substituted, which Tuchel said he will review.The accomplished manner in which Rogers has taken to the England stage has given Tuchel a wonderful conundrum, while the searing heat at next summer's World Cup means he is likely to deploy \"starters\" and \"finishers\", Bellingham and Rogers can do both.Rogers has an avid admirer in Tuchel. He has made 10 appearances under him, starting six games and playing for a total of 531 minutes. Bellingham has started four, playing 374 minutes in total.Tuchel will not duck big decisions. He will not indulge in star systems or simply pack his team with the biggest names.So who will start?For all Rogers' impressive work, Bellingham has proved he can deliver game-changing moments at the highest level, his status also confirmed when Albania's Kristjan Asllani asked him to swap shirts at half-time rather than risk leaving it until the end.Phil Foden will be in Tuchel's thinking, with the German saying he does not see the Manchester City forward as a winger, and instead \"as a mix between a nine and a 10\".Chelsea's Cole Palmer also has the ability and class to force his way into the squad if he can recover from his groin injury.In reality, however, it looks like a choice between Bellingham and Rogers.Bellingham's greater experience of the rarefied air of major competitions will surely just give him the edge when Tuchel names his team for England's first World Cup game.Kane indispensable – but who are the alternatives?Harry Kane maintained his magnificent England record with the double in Albania that ensured they finished World Cup qualifying with a win.Kane may be 32 but looks at his peak, a master marksman as well as the complete player, willing to drop deep to do dirty work but still always arriving at the sharp end with perfect timing when goals are required.Former England defender Conor Coady told BBC Radio 5 Live: \"I don't want to think of an England without Harry Kane. What he brings to this team is unbelievable.\"The way he keeps on producing these numbers is unbelievable and it is credit to him. He is the first on and last off the training pitch. He is our biggest hope going into next year.\"Kane is indispensable, England's record scorer with 78 goals in 112 internationals.If he is not playing the drop off is deep. Kane's potential deputies are all perfectly capable, but they are not Harry Kane.An injury to his captain will be Tuchel's biggest fear, particularly as ready-made replacements are hardly forming an orderly queue.Image source, EPAImage caption, Harry Kane has now scored 78 goals in 112 games for EnglandBrighton's 34-year-old veteran Danny Welbeck has been touted. It is testimony to the enduring skill of the striker, who last played for England seven years ago, but also suggests the cupboard is worryingly bare.Tuchel said Welbeck was \"very close\" to a call-up for England's latest camp, but added: \"I felt even without knowing him I know what he can give us. Do I really need to see this in November?\"Aston Villa's Ollie Watkins has been used, although Ivan Toney has disappeared from view after bizarrely being summoned from Saudi Arabia to play two minutes in the friendly against Senegal last June.Marcus Rashford can play as a striker, while Newcastle United's Anthony Gordon has played there for his club, but is not a natural fit.Foden has been mentioned as part of a tactical tweak if England are in need of a main striker, but the bottom line is they still have no-one who comes close to Kane's class.As Coady stated, England without Harry Kane at the World Cup is unthinkable.Tuchel ponders defensive questionsImage source, Getty ImagesImage caption, John Stones brings class, experience and versatility to England's defence - so will he start at the World Cup?John Stones showed his class and versatility in a hybrid role in Tirana, ostensibly in his usual central defensive position but stepping into midfield when England were in possession. It is a ploy he can carry out with comfort, potentially giving Tuchel's strategy an extra dimension.Former England defender Stephen Warnock told BBC Radio 5 Live: \"This game against Albania is cementing why John Stones is so vital to this England squad. He is conducting the play from a centre-back position and a centre midfield position. Really impressive.\"It is likely to be a more orthodox back four at the World Cup, so it looks down to two from Stones, Aston Villa's Ezri Konsa and Crystal Palace captain Marc Guehi in central defence.Stones may have the edge with his vast experience, while Konsa and Guehi, who both missed the win in Albania through injury, have grown as internationals.Coady said: \"I think it's really close. Konsa has been outstanding. For me, it's Stones and Guehi's to lose. To keep Stones fit for the World Cup is absolutely huge.\"Bayer Leverkusen's Jarell Quansah made his long-awaited senior debut against Albania and impressed as he started centrally before moving out wide.Tuchel must also decide on his left-back with an exciting trio of youngsters leading the race.Arsenal's Myles Lewis-Skelly, Tottenham's Djed Spence and Manchester City's Nico O'Reilly have all been handed senior debuts by Tuchel, but it is O'Reilly who started and impressed in the final two qualifiers.Newcastle United's Tino Livramento, currently out injured, may be in the lead for that place, with Lewis-Skelly left out by Tuchel because of lack of game time this season. O'Reilly may have edged ahead of Spence after this camp.It is still a position up for grabs.Will Rashford start on the left?Image source, Getty ImagesImage caption, Marcus Rashford assisted Harry Kane seven minutes after coming on against AlbaniaBukayo Saka has nailed down the right wing slot, so who will play on the opposite side?Marcus Rashford left Tuchel with something to remember him by from England's World Cup qualifier with a superb cross for Kane's second goal in Tirana.Rashford has made his case, but Gordon has also impressed, while Tuchel is a big fan of Arsenal's Noni Madueke, currently out injured.Jack Grealish has done well on loan at Everton, but he simply has too much competition to fight his way past and has not featured for the Three Lions since October 2024.Eberechi Eze started against Albania and can play on the left or as a number 10, though he is not at the forefront of the conversations to compete with Bellingham and Rogers in that role.If Rashford wanted to give Tuchel food for thought, his superb cross for Kane to complete his double gave the head coach plenty to digest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thomas Tuchel: The key questions facing England boss in countdown to World Cup",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d39b/live/95a428b0-c332-11f0-92e2-bf560514884a.jpg"
      ],
      "datePublished": "2025-11-16T22:47:08.000Z",
      "dateModified": "2025-11-16T22:47:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTuber Jack Doherty arrested in Miami on drug possession charges",
    "url": "https://www.bbc.com/news/articles/c620yzjpxlvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6848/live/411d3900-c2c7-11f0-a94f-9d723e4e4e44.jpg",
    "tag": "Trending",
    "date": "2025-11-16T10:48:32.000Z",
    "description": "YouTuber Jack Doherty was arrested on drug possession and other charges in the Miami area in the early hours of Saturday morning, police said.The infl",
    "body": "YouTuber Jack Doherty was arrested on drug possession and other charges in the Miami area in the early hours of Saturday morning, police said.The influencer was filming video content while attempting to engage with police officers in the middle of the road, blocking traffic in the process, according to arrest documents published by US media. He was then apprehended, before a police search found \"half of an orange oval-shaped pill with 3 imprinted on it, consistent with a Schedule II amphetamine\", and three \"suspected cannabis cigarettes\".The 22-year-old is known for filming provocative videos involving pranks, with titles like \"I got kicked off a cruise\" and \"I crashed into a cop car\".He is also known for videos in which he provokes strangers on the street, before hiding behind his bodyguard.He has more than 15 million subscribers on YouTube, over 10 million followers on TikTok and more than 2.8 million followers on Instagram.It is unclear if Mr Doherty has a lawyer. A representative listed on his social media did not immediately respond to a request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTuber Jack Doherty arrested in Miami on drug possession charges",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6848/live/411d3900-c2c7-11f0-a94f-9d723e4e4e44.jpg"
      ],
      "datePublished": "2025-11-16T10:48:32.000Z",
      "dateModified": "2025-11-16T10:48:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]