[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Immigration Reform, Burnham And The Budget - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhzlr1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Nov 2025,·28 minsThe Week: Immigration Reform, Burnham And The BudgetNewscastAvailable for over a yearToday, the home secretary makes second big change to migration policy in a week. \nShabana Mahmood has announced the qualifying period for indefinite leave to remain will be extended from five to 10 years, and will apply to the estimated 2.6 million who arrived since 2021. The changes will not apply to people who had already obtained settlement. Adam, Joe, Faisal and Sarah Montague, presenter of the World at One, discuss this plus more Labour leadership questions and preview the budget.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producers were Joe Wilkinson and Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Immigration Reform, Burnham And The Budget - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Marjorie Taylor Greene v Donald Trump - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byr?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-21T16:15:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Nov 2025,·36 minsMarjorie Taylor Greene v Donald TrumpAmericastAvailable for over a yearThe Georgia Republican congresswoman Marjorie Taylor Greene is being celebrated by Democrats for being one of the few Republicans to stand up to Donald Trump in recent weeks.  From the Epstein Files to the cost of living, Greene has been vocal in her criticism of the current administration.  It’s notable because MTG has been one of Trump’s most loyal allies and a powerful leader of the MAGA movement, and also because her interventions have been influential. \nSarah, Anthony and Marianna look back at Marjorie Taylor Greene’s rise and why she has been such an influential figure within Donald Trump’s MAGA base. \nAnd, Anthony’s in Tennessee for a special election where a House seat is being contested. We assess the Democratic party’s chances of winning this traditional Republican seat.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Marjorie Taylor Greene v Donald Trump - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-21T16:15:00.000Z",
      "dateModified": "2025-11-21T16:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC board member resigns and criticises 'governance issues' at top of corporation",
    "url": "https://www.bbc.com/news/articles/cly5n8x1vedo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/50a7/live/7000a820-c6ef-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T18:09:18.000Z",
    "description": "10 hours agoKatie Razzall,Culture and Media Editor and George Bowden,Culture reporterA member of the BBC's board has resigned over what he says are \"g",
    "body": "10 hours agoKatie Razzall,Culture and Media Editor and George Bowden,Culture reporterA member of the BBC's board has resigned over what he says are \"governance issues\" at the top of the corporation.Shumeet Banerji also said in a letter that he was \"not consulted\" about the events leading up to the departures of the director general, Tim Davie, and BBC News chief executive, Deborah Turness.Banerji confirmed his resignation on Friday, the BBC said in a statement.BBC News has approached Banerji for comment.The BBC's two top executives resigned earlier in November as a result of the fallout over a Panorama episode that edited together parts of a 2021 speech by US President Donald Trump.Since then, concerns have been raised in some quarters about how the BBC board operates. The board is responsible for oversight and strategy of the corporation.In blaming governance issues, Banerji appears to have made a direct criticism of chairman Samir Shah and other members of the board.Banerji's resignation comes at a difficult time for the BBC, with Shah and board members Sir Robbie Gibb and Caroline Thomson due to give evidence to the Culture Media and Sport Committee of MPs on Monday afternoon.Questions have already been raised in Parliament about political appointees on the BBC board (there are five including Shah and Gibb).They will likely be asked about claims, first made in a leaked document, that the BBC has \"systemic issues\" relating to coverage around, for example, the Israel-Gaza conflict and coverage of sex and gender. That was rejected by Turness and Davie.Written by Michael Prescott, who was previously an independent external advisor to the BBC's Editorial Standards Committee, the document was published by the Telegraph newspaper and also flagged the Panorama edit.The corporation has since acknowledged the edit gave \"the mistaken impression that President Trump had made a direct call for violent action\" on the day of the riot at the US Capitol building on 6 January 2021.In his speech on 6 January 2021, Trump said: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, Trump said: \"And we fight. We fight like hell.\"In the Panorama programme, Trump: A Second Chance?, the edited clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Trump has threatened to sue over the programme, saying it defamed him. While the BBC has apologised, it has refused the president's demand for financial compensation.In his role on the board, Banerji was \"responsible for upholding and protecting the independence of the BBC by acting in the public interest and exercising independent judgement\", according to the corporation's website.Banerji, a non-executive board member since 2022, is the founder of an advisory and investment firm that specialises in technology companies. He previously led Booz & Company, a management consultancy firm.The 12-member board of the BBC is responsible for ensuring it delivers on its public service mission and it sets the strategic direction of the corporation, which is largely funded by licence-fee payers.Non-executive members hold the BBC's executive management to account. The board is chaired by Shah, a former documentary maker.A BBC spokesperson said: \"Shumeet Banerji today notified the BBC Board of his resignation. Mr Banerji's term on the Board as a non-executive director was due to end at the end of December and we thank him for his service.\"The search for a replacement is already well under way and we will update further in due course.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC board member resigns and criticises 'governance issues' at top of corporation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/50a7/live/7000a820-c6ef-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T18:09:18.000Z",
      "dateModified": "2025-11-21T18:09:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scotland fans shook the earth in win over Denmark",
    "url": "https://www.bbc.com/news/articles/ckgd2nywde4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/50c9/live/81bf6cc0-c6e2-11f0-8d86-c55506b8d0f2.jpg",
    "tag": "Trending",
    "date": "2025-11-21T22:48:22.000Z",
    "description": "5 hours agoSNSScotland fans shook the earth after Kenny McLean scored the fourth goal against DenmarkThe Tartan Army shook the earth as they celebrate",
    "body": "5 hours agoSNSScotland fans shook the earth after Kenny McLean scored the fourth goal against DenmarkThe Tartan Army shook the earth as they celebrated Scotland's men qualifying for a first World Cup in 28 years.The British Geological Survey (BGS) recorded the equivalent to an \"extremely small earthquake\" after Kenny McLean lobbed Denmark goalkeeper Kasper Schmeichel to secure a 4-2 win.A second significant amount of seismic activity came moments later when the final whistle sounded on Wednesday night.Readings were recorded at the BGS station at Glasgow Geothermal Observatory in Dalmarnock – about 2km (1.2 miles) from Hampden Park.A small surge was also detected around the time Kieran Tierney curled in Scotland's third, three minutes into injury time.However, the BGS said the main peak of activity came between 21:48 and 21:50 – right as McLean scored from the halfway line.British Geological SurveyThe BGS recorded surges of seismic activity after the fourth goal and again after the final whistleAn official attendance of 49,587 was recorded at the game.The BGS said the activity registered between magnitude -1 and zero on the Richter Scale and produced the equivalent of 200kW of power, enough to power between 25 and 40 car batteries.It is also the same as blasting a football at about 900 m/s (2,013 mph).That is about 15 times faster than the fastest a ball has ever been struck, thought to be about 131.2 mph (58 m/s) by the Brazilian defender Ronny Heberson in Sporting Club de Portugal's win over Naval in 2007.SNSScotland players celebrate with Kenny McLean after the final goal of the 4-2 winTaylor Swift fans were also recorded as making the earth move during last summer's trio of concerts at Murrayfield Stadium in Edinburgh.But the BGS said it was unable to directly compare the two events due to \"different site conditions\".The BGS said about 300 naturally occurring earthquakes happen in the UK every year, but only about 30 are of significant power to be felt by people.A 3.3 magnitude earthquake was felt in homes across Perthshire last month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scotland fans shook the earth in win over Denmark",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/50c9/live/81bf6cc0-c6e2-11f0-8d86-c55506b8d0f2.jpg"
      ],
      "datePublished": "2025-11-21T22:48:22.000Z",
      "dateModified": "2025-11-21T22:48:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Trump turns the screw' and 'Farage's pal betrays Britain'",
    "url": "https://www.bbc.com/news/articles/c98n5d4nyv6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/d9c12a20-c733-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-22T00:12:37.000Z",
    "description": "4 hours agoSeveral of Saturday's papers lead with Ukrainian President Volodymyr Zelensky's \"agonising choice\", as the Daily Mail writes, over whether ",
    "body": "4 hours agoSeveral of Saturday's papers lead with Ukrainian President Volodymyr Zelensky's \"agonising choice\", as the Daily Mail writes, over whether to accept a US-backed peace deal with Russia. \"Trump turns the screw\" is the Mail's headline, which reports that Ukraine has been told it has until Thursday to accept the \"humiliating peace deal\". Zelensky warns his country is facing a choice between \"losing US support or forfeiting its dignity\" over the peace deal, according to the Financial Times. European allies are caught \"off-guard\" by the plan, which was drafted by aides of the US and Russian presidents, and say it amounts to \"capitulation\" to Moscow's demands. Zelensky says he will not reject the initiative \"out of hand\", but will \"offer alternatives\" in dialogue with Washington.In an address to the country, the Ukrainian president says his country faces its \"most difficult moment in history\", the Independent leads. Elsewhere, the paper reports on a \"remarkable\" 19-wicket first day of the Ashes in Perth, in which captain Ben Stokes led a \"ferocious fightback against Australia\". Trump confirms the Thursday deadline for Ukraine to respond to the peace plan, but the White House denies reports that the US could \"cut off\" intelligence sharing if Zelensky rejects it, the Times reports. European leaders, alongside the UK, are working to \"strengthen\" the deal, \"amid concern that Ukraine would be at risk of further attacks if it weakened its armed forces\". The Daily Mirror leads on the jailing for 10-and-a half years of an \"ally\" of Reform UK leader Nigel Farage, for accepting pro-Russia bribes. Former Reform UK in Wales leader Nathan Gill, whom the paper describes as a \"former party bigwig\", took up to £40,000 from tycoon Oleg Voloshyn for \"making pro-Russian speeches\". Prime Minister Sir Keir Starmer is urging Farage to \"root out links between Reform UK and Russia\" following the conviction of Gill, the Guardian reports. The paper says the government believes Reform UK is \"vulnerable\" to criticism that Farage and his allies have been \"too pro-Russia\". Police have said there was no link to Farage in their investigation into Gill.The Conservative Party would retain just 14 seats if an election was called now, according to internal party polling leaked to the Telegraph. An insider tells the paper that the party faces an \"existential threat\" from Reform UK, which the poll forecasts would win a 46-seat majority. Another source says the Tories are at risk of being \"consigned to the history books\". Challenges facing the Labour Party are the focus for the i Weekend, which reports that the PM is \"losing control\" of his party's MPs ahead of the Budget. Some Labour MPs have become \"a bit feral\" over uncertainty about Sir Keir's leadership, according to ex-advisers to Downing Street. Backbenchers and ministers are urging more help for \"hard-up people\" amid the \"cost of living crunch\". Sarah Ferguson is \"considering offers\" for a \"tell-all TV interview\", the first since her ex-husband Andrew Mountbatten Windsor relinquished his titles over links with convicted sex offender Jeffrey Epstein, the Sun reports. Some US networks are \"willing to pay six-figure sums to secure the chat\" with the former Duchess of York. MPs are considering whether to establish an \"injury-in-service medal\" for police officers who are forced to quit after sustaining injuries during active duty, the Daily Express reports. Finally, the Daily Star leads on a boss who has mandated his staff to take time off to see their children's Christmas events - including pantos. \"Oh, yes he did,\" the paper writes. Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Trump turns the screw' and 'Farage's pal betrays Britain'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/d9c12a20-c733-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T00:12:37.000Z",
      "dateModified": "2025-11-22T00:12:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge me at next election, Keir Starmer tells doubters",
    "url": "https://www.bbc.com/news/articles/cwyp4gvn1v4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fc4e/live/dbbdfea0-c6fe-11f0-99c3-7dce999e48af.jpg",
    "tag": "Trending",
    "date": "2025-11-21T18:00:21.000Z",
    "description": "10 hours agoBecky MortonPolitical reporterSir Keir Starmer has said it will take time to turn the country around, telling voters to judge him at the n",
    "body": "10 hours agoBecky MortonPolitical reporterSir Keir Starmer has said it will take time to turn the country around, telling voters to judge him at the next general election.The prime minister told the BBC his government had made \"good steps\", particularly on the cost-of-living, but \"we need to do more\".It comes after a dismal few weeks for the PM, who has faced growing criticism and speculation he could face a leadership challenge.The government is also facing a difficult Budget next week, when the chancellor is widely expected to increase taxes.In an interview with the BBC's Chris Mason in Johannesburg, South Africa, where the PM is attending the G20 summit of world leaders, Sir Keir was challenged over why some opinion polls suggest he is the most unpopular prime minister since modern polling began.\"We won an election last year on the manifesto that said we would change the country after 14 years of failure,\" he said.\"I always said that would take time because you can't turn around 14 years of failure in just 12 months or 16 months. \"I'm very conscious that we have to deliver on three things above all else. The first is making sure people feel better off, and that's bearing down on the cost-of-living, making sure the public services are better, in particular the NHS, which is why we put record investment in the NHS, and making sure people feel more safe and secure. \"And I have no doubt that I will rightly be judged against that at the next election.\"Sir Keir has insisted he will lead Labour into the next general election, which is not due until 2029, although he could choose to call one earlier.Last week, allies of the prime minister told journalists that he would fight any attempts by Labour MPs to remove him, with Health Secretary Wes Streeting among those named as plotting a leadership challenge.However, the attempt to strengthen Sir Keir's position appeared to backfire as it brought talk of threats to his leadership into the open and sparked further criticism of the PM.Streeting denied he was planning to challenge Sir Keir and hit out at a \"toxic\" culture within No 10, although he said he did not think the PM was behind the briefings.Sir Keir has insisted the attacks against Streeting had not come from Downing Street.Meanwhile, the PM has faced claims from the the Conservatives his government's Budget is already unravelling, after the chancellor backed away from raising income tax rates - a move which would break an election pledge. Asked if he was frustrated the achievements of his government were being \"drowned out\", Sir Keir told the BBC: \"Every minute that is spent talking about anything other than cost-of-living is a wasted minute in my book.\"The next major test for Sir Keir will come in May, when Labour are braced for major losses in Scottish, Welsh and English local elections.However, with the prospect of a tricky Budget next week, there has been speculation a leadership challenge could come sooner.Anyone mounting a leadership bid would need the backing of at least 80 Labour MPs.Only a small number of Labour MPs have publicly called for Sir Keir to be replaced but many more have raised concerns about his leadership privately.On Friday, Nottingham East MP Nadia Whittome, who is on the left of the party, joined Labour backbencher Clive Lewis in calling for a new leader.\"Even if Keir Starmer had a radical change of direction, I don't think people would believe him. And I don't think people around him would allow that to happen,\" she said in an interview with former Labour candidate Ali Milani.\"So I think there has to be a change in leadership, a change in personnel, of the people in Number 10, and a completely different direction for the party.\"Earlier this week Rachael Maskell, who was recently readmitted to Labour's parliamentary party after a four-month suspension for leading a rebellion over proposed welfare cuts, suggested the PM should consider his position if next week's Budget does not deliver.\"Ultimately, the prime minister needs to look in the mirror and say 'Do I have the skills at this particular time in our history to lead the Labour Party?',\" the Labour MP for York Central told LBC.Challenged over her comments and whether he was the right man to lead the country, Sir Keir said he had proven his doubters wrong in the past by changing the Labour Party and winning a landslide election victory last year.\"Now people will say to me, 'It's not possible to change the country for the better.' I say it is,\" he told the BBC.\"I'm optimistic about the future of our country and I know that we can turn it around after 14 years of failure under the Conservatives.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge me at next election, Keir Starmer tells doubters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fc4e/live/dbbdfea0-c6fe-11f0-99c3-7dce999e48af.jpg"
      ],
      "datePublished": "2025-11-21T18:00:21.000Z",
      "dateModified": "2025-11-21T18:00:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
    "url": "https://www.bbc.com/news/articles/cz68x1n5qd6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-21T21:05:30.000Z",
    "description": "A grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two critically.The incident happened on Thursday a",
    "body": "A grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two critically.The incident happened on Thursday afternoon on a walking trail in the town of Bella Coola, in the province of British Columbia (BC). Residents have been warned to remain indoors while armed officers try to track down the animal. Four of the injured remain in hospital as of Friday afternoon, BC's Health Services Authority has said.A male teacher \"got the whole brunt of it\" and some children were hit with bear spray as the adults tried to fend off the animal, Veronica Schooner, a parent, told the Canadian Press.Ms Schooner said her 10-year-old son was part of the school group, though he was not attacked. \"He said that bear ran so close to him, but it was going after somebody else,\" she said, adding that \"he even felt its fur\".In a statement to the BBC, British Columbia Emergency Health Services said two people were critically injured, two more were seriously hurt, and seven others were treated at the scene.Patients had to be transported to a nearby airport so they could be airlifted to the closest hospital, officials said. The group were from Acwsalcta School, which is run by the indigenous Nuxalk Nation, in the town located 700km (435 miles) north-west of Vancouver. \"Officers are armed\" the Nation wrote on Facebook. \"Remain indoors and off the highway.\" \"It's hard to know what to say during this very difficult time. We are so grateful for our team and our students.\" The Nation's officials have temporarily shut the school, offering counselling services.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T21:05:30.000Z",
      "dateModified": "2025-11-21T21:05:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cold plunges and kombucha: Do winter wellness trends work?",
    "url": "https://www.bbc.com/news/articles/c5y4yk4nv5yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2fe7/live/24239ce0-c637-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-22T02:13:52.000Z",
    "description": "2 hours agoYasmin RufoBBC NewsGetty ImagesEvery winter, the search for the secret to staying well seems to intensify. Supermarket shelves fill with \"i",
    "body": "2 hours agoYasmin RufoBBC NewsGetty ImagesEvery winter, the search for the secret to staying well seems to intensify. Supermarket shelves fill with \"immune-boosting\" shots, cold water swimming groups grow and social media becomes crowded with tips on how to fend off seasonal bugs. But with so many remedies promising to keep colds and flu at bay, how much of it actually works and is it even possible to boost your immune system in the first place?Cold water swimming: A buzz, not a boostGetty ImagesCold water swimming has surged in popularity, with some enthusiasts convinced it keeps winter illnesses at bay.Immunologist professor Eleanor Riley tells BBC Radio 4's Inside Health podcast that the post-swim \"high\" is real, but it's driven by adrenaline and endorphins.\"If you take a blood sample before and after a cold swim, white blood cell levels do rise,\" she explains. \"But that's because the body thinks an infection might be coming, so cells move into the bloodstream. \"Within hours the levels go back to normal so your body hasn't created any more white blood cells.\" Professor Riley adds that part of the benefit of cold water swimming comes from building a social connection. Feeling \"brighter, more alert and more connected\" has real physiological effects.Professor John Tregoning, a vaccine immunologist, says the benefits are mostly indirect and much of what makes people feel healthier in winter may come down to stress.\"It reduces stress because you're outdoors with nice people in nice places. But you could get the same from dancing, singing or going for a run.\"Being in nature can lower your blood pressure and stress hormones that can dampen immune responses. GP Dr Margaret McCartney explains that moderate exercise does show evidence of reducing viral infections, but that could be any form of exercise, not just cold water swimming. Kombucha: Interesting but little evidenceGetty ImagesMany people turn to fermented drinks like kombucha which promises to boost the microbiome and, by extension, the immune system.But Dr McCartney remains cautious. \"There are lots of theories about why a diverse microbiome is good, but we don't have strong enough real-world evidence to recommend kombucha to patients.\"Professor Tregoning adds that while it's true that the microbiome changes during infections, it usually returns to its previous state afterwards.Dr McCartney says while drinks like kombucha present \"interesting ideas about the role of the microbiome\", there isn't a clear link with how it can help boost your immune system. Supplements: Just expensive urineGetty ImagesVitamin C has long been sold as a winter essential, but according to Dr McCartney, the evidence simply isn't strong enough to recommend it when it comes to fighting off colds. She says the same goes for multi-vitamins which do very little beyond giving you \"expensive urine\". However, Vitamin D is slightly different as \"there's theoretical evidence of a small decrease in respiratory infections\". But, she explains that not everyone will see a benefit if they take it and it's only people \"with low vitamin D and pre-existing respiratory diseases\" who will likely benefit. Many people in the UK remain deficient in Vitamin D and Professor Tregoning suggests that winter sunlight and getting outdoors can help. Vaccinations: The only boost that worksGetty ImagesThe likes of turmeric shots, ginger drinks and fancy nasal sprays do nothing to boost your immune system, according to Dr McCartney.Professor Tregoning says that a nasal spray can help with a blocked nose but all you need is a simple saline spray which is just salt and water. \"The solution can dilute the blocked nose, stimulate turnover of mucus and relieve inflammation.\" All three experts agree that ultimately only one intervention can strengthen the immune system and that's vaccination.Professor Riley recommends the flu jab which takes from seven to 10 days after the jab to take effect.While you can't boost your immune system in the dramatic way winter wellness trends often promise, the experts advise supporting it by avoiding smoking, maintaining a healthy weight, finding a regular sleep routine and doing any activity that helps reduce stress. Dr McCartney says you can also reduce your risk of colds by being in well ventilated spaces and washing your hands regularly and properly.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cold plunges and kombucha: Do winter wellness trends work?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2fe7/live/24239ce0-c637-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T02:13:52.000Z",
      "dateModified": "2025-11-22T02:13:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scientists reveal what triggered Santorini 'earthquake swarm'",
    "url": "https://www.bbc.com/news/articles/cz7p783g2j5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/94dd/live/926786e0-c6f9-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T01:52:15.000Z",
    "description": "1 day agoVictoria GillScience correspondentgettyThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this year w",
    "body": "1 day agoVictoria GillScience correspondentgettyThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this year was triggered by molten rock pumping through an underground channel over three months, scientists have discovered.They used physics and artificial intelligence to work out exactly what caused the more than 25,000 earthquakes, which travelled about 20km (12 miles) horizontally through the Earth's crust. They used each of the tremors as virtual sensors, then used artificial intelligence to analyse patterns associated with them.One of the lead researchers, Dr Stephen Hicks from UCL, said combining physics and machine learning in this way could help forecast volcanic eruptions.What happened in Santorini?The seismic activity started to stir beneath the Greek islands of Santorini, Amorgos, and Anafi in January 2025. The islands experienced tens of thousands of earthquakes - many of which were over magnitude 5.0 and could be felt.Many tourists fled, and locals feared that the nearby underwater volcano, Kolumbo, might be about to erupt -  or that this was a seismic prelude to a larger earthquake, like the devastating, magnitude 7.7 quake that struck the same region in 1956.The scientists, who published their findings in the journal Science, created a 3D map of the Earth around Santorini. They then mapped the evolving patterns of seismic activity of each tremor and the movement and stress in the crust. This resulted in a detailed model of exactly what drove this months-long seismic swarm.The team found that the event was driven by the horizontal movement of magma - from beneath Santorini and the Kolumbo volcano - through a 30km channel that is more than 10km beneath the seafloor.The researchers estimated that the volume of magma that moved through the crust could have filled 200,000 Olympic-sized swimming pools. These \"magma intrusions\", as they are known, smashed through layers of rock, triggering thousands of tremors. Lead author on the study, Anthony Lomax, a research geophysicist who develops scientific software to analyse seismic activity, explained: \"The tremors act as if we had instruments deep in the Earth, and they're telling us something.\"[When we analyse] the pattern those earthquakes make in our 3D model of the Earth, it matches very, very well what we expect for magma moving horizontally.\"Does this mean the Santorini unrest is over?For now, the researchers say, it appears to be over.\"The magma remained quite deep - more than 8km depth - in the crust,\" explained Dr Hicks. \"We know that magma can ascend and erupt at the surface in a matter of hours to days, but because the activity has now died down, we can be almost certain that the melt eventually got stuck and cooled down deep in the crust.\"Volcanoes, though, can enter prolonged phases of unrest and unpredictability that can last many years. Recent volcanic activity in south-west Iceland has demonstrated that.And these researchers say using AI, in combination with the fundamental physics of how the Earth's crust moves and responds to stress, could transform the ability to monitor, understand and even forecast volcanic activity. This could help keep people in seismically active parts of the world safe.\"Ultimately, this could be used as a forecasting tool,\" explained Dr Hicks. Whenever we see a cluster of earthquakes, \"that is data that can be used to work out the most likely cause\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scientists reveal what triggered Santorini 'earthquake swarm'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/94dd/live/926786e0-c6f9-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T01:52:15.000Z",
      "dateModified": "2025-11-21T01:52:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Serbian president denies involvement in alleged Bosnia 'sniper tourism'",
    "url": "https://www.bbc.com/news/articles/c246pv2n25zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/136d/live/8529b8b0-c715-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-21T22:03:13.000Z",
    "description": "6 hours agoGuy DelauneyBalkans correspondentSerbia's president, Aleksandar Vucic, has described an allegation that he was involved in \"sniper tourism\"",
    "body": "6 hours agoGuy DelauneyBalkans correspondentSerbia's president, Aleksandar Vucic, has described an allegation that he was involved in \"sniper tourism\" during the siege of Sarajevo as a \"lie\".It follows a complaint submitted to Italian prosecutors by a Croatian journalist, who claimed that video from the 1990s and subsequent testimony by Bosnian officials showed that Vucic was a \"war volunteer\" with Bosnian-Serb forces at positions overlooking Sarajevo.Speaking at a UK-Western Balkans business conference in Belgrade, Vucic said he had \"never killed anyone, wounded anyone, or done anything similar\". He added that he had \"never held a sniper rifle in my life\".Pictures purporting to show him with such a weapon actually show him carrying a \"camera tripod\", he said.He said the Croatian journalist was trying to \"present me as a monster, as an inhuman, as someone who not only has no emotions, but is a cold-blooded murderer\".More than 11,000 people died during the brutal four-year siege of Sarejevo. Yugoslavia was torn apart by war and the city was surrounded by Serb forces and subjected to constant shelling and sniper fire.Italian prosecutors opened an investigation earlier this month into allegations that wealthy foreigners had paid to shoot at civilians during the siege of Sarajevo. That followed a complaint by an Italian writer who had seen the 2022 Slovenian documentary film, Sarajevo Safari, which was the source of the allegations.Italians and others are alleged by writer Ezio Gavazzeni to have paid large sums to go on \"sniper safaris\" and shoot at civilians in the besieged city of Sarajevo during the war in the early 1990s.The claims by Croatian journalist Domagoj Margetic that Vucic had volunteered for a Bosnian Serb militia at a location above Sarajevo had earlier also been strongly denied by  Vucic's spokesperson Suzana Vasiljevic.She said in comments carried by the Times newspaper that the allegations were \"a textbook case of malicious disinformation, purpose-built to erode the institutional credibility of the Republic of Serbia and its president. This narrative is devoid of factual grounding and is operationally crafted to generate reputational damage.\"At the time Vucic had been working as a journalist and translator in nearby Pale \"without any contact with military structures or operational activities\", she said.She added: \"President Vucic did not participate in combat activities, did not use weapons, and had no role in any wartime operations.\"Similar allegations about \"human hunters\" from abroad have been made several times over the years. However, the chief prosecutor at the International Residual Mechanism for Criminal Tribunals in The Hague has told the BBC that his organisation has no information about the allegations. Bosnia's war crimes prosecutor received a complaint in 2022, but has not issued any indictment. UK special forces troops who served in Sarajevo during the siege have told the BBC the allegations are an \"urban myth\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Serbian president denies involvement in alleged Bosnia 'sniper tourism'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/136d/live/8529b8b0-c715-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-21T22:03:13.000Z",
      "dateModified": "2025-11-21T22:03:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
    "url": "https://www.bbc.com/news/articles/c5y9k0mrm2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg",
    "tag": "Trending",
    "date": "2025-11-21T18:21:53.000Z",
    "description": "10 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Z",
    "body": "10 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zelensky about a draft plan to end the war in Ukraine.The same day, on Russian state TV, President Putin was in military fatigues. He was talking to his army chiefs about fighting on.\"We have our tasks, our goals,\" the Kremlin leader declared. \"The chief one is the unconditional achievement of the aims of the special military operation.\"The Izvestia newspaper called President Putin's visit to a command post \"a signal to America that he's prepared to negotiate on Ukraine, on Russia's terms\".Which brings us back to the peace plan.On Friday night, President Putin said he had seen the US settlement plan for Ukraine.Addressing a meeting of the Russian security council in Moscow, he described the American proposals as a \"modernised\" version of the plan discussed with Trump at the Alaska summit between the leaders in August.President Putin said he thought the plans could form the basis of final peace settlement.The 28-point proposal, which has been widely leaked and reported on, appeared after a visit to America by President Putin's envoy Kirill Dmitriev. He took part in three days of discussions in Miami with President Trump's special envoy Steve Witkoff.According to drafts of the peace proposal, Ukraine would cede to Russia parts of the Donbass still under Kyiv's control; the Ukrainian armed forces would be reduced in size and Ukraine would vow not to join Nato.\"The Russian military's effective work should convince Zelensky and his regime that it's better to strike a deal and do it now,\" President Putin's spokesman Dmitry Peskov previously told journalists on a Kremlin conference call.A peace proposal does not automatically mean peace. What if there's no agreement?Pro-Kremlin commentators insist that, deal or no deal, Russia will prevail.\"Everyone thought that the idea of a peace deal had sunk in a swamp,\" wrote Russian news outlet Moskovsky Komsomolets. \"But suddenly, a rocket has shot out of this bog with a new, or rather an 'old new' peace plan, with something of the Alaska summit about it. It shot out like a jack in the box.\"How long and how far will this missile fly? Will it crash, sabotaged by Europe and Kyiv? Even if the launch is a false start, it's unlikely to change the general trend. The balance of power is shifting in Russia's favour.\"But after nearly four years of war Russia is under pressure, too. Since its full-scale invasion of Ukraine, not only has Russian's army suffered huge losses on the battlefield, but back home the economy is faltering. Russia's budget deficit is growing, revenues from oil and gas falling.\"Russia's industry is somewhere between stagnation and decline,\" declared the broadsheet Nezavisimaya Gazeta this week.It's unclear, though, whether economic pressures will change President Putin's calculations and convince him that now is the moment to end his so-called special operation: even on terms that many believe benefit Moscow.Many. But not everyone.Some elements of the peace plan haven't gone down well in Russia. Some reports suggest that Ukraine could be offered security guarantees modelled on Nato's Article 5. That might commit Western allies to treat any future Russian attack on Ukraine as an attack on the transatlantic community as a whole and trigger a combined military response.\"This is, in effect, Ukraine in Nato,\" wrote Moskovsky Komsomolets, \"only without the deployment of bases and weapons on its territory.\"The full details of the peace plan have yet to be confirmed. We may be entering another period of intense diplomacy.For now, though, Russia's war on Ukraine continues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T18:21:53.000Z",
      "dateModified": "2025-11-21T18:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New puberty blockers clinical trial to begin after UK ban",
    "url": "https://www.bbc.com/news/articles/c2k4jg0wkj4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fbb7/live/f8ea21f0-c6fb-11f0-a863-434ee92aa5e3.jpg",
    "tag": "Trending",
    "date": "2025-11-22T00:05:41.000Z",
    "description": "4 hours agoPhilippa Roxby,Health reporter and Alison Holt,Social affairs editorGetty ImagesDetails of a new UK clinical trial to assess the risks and ",
    "body": "4 hours agoPhilippa Roxby,Health reporter and Alison Holt,Social affairs editorGetty ImagesDetails of a new UK clinical trial to assess the risks and benefits of puberty-blocking drugs in children and young people questioning their gender have been announced.It follows the banning of the drugs for gender treatment last year after a major review raised concerns about the lack of clinical evidence over their safety for under-18s.Researchers from King's College London say the trial will involve around 220 children under the age of 16 who are going through puberty, and will examine the impact of the drugs on their physical, social and emotional wellbeing.Some clinicians and campaigners question whether the trial is ethical.Prof Emily Simonoff, study leader and professor of child and adolescent psychiatry at King's College London (KCL), said: \"We know there are ongoing societal discussions about gender transition, but this research is focused solely on informing and improving healthcare by better understanding how to support the physical and mental health of young people with gender incongruence.\"Puberty blockers, also known as puberty suppressing hormones (PSH), are drugs used to delay or prevent puberty happening.They were used to treat some young people with gender incongruence - when someone's gender doesn't match the sex they were registered at birth - or with gender dysphoria, when it causes significant distress.As a result of the uncertainty over the safety of the drugs, highlighted by the Cass review into gender care, led by paediatrician Dr Hilary Cass, doctors can now only offer the treatment to under-18s as part of a research study.Last year, the government brought in a UK-wide indefinite ban on the drugs being prescribed privately or by the NHS to children and young people questioning their gender identity.The new clinical trial, called Pathway, will involve children who are currently accessing gender services and have a diagnosis of gender incongruence.They will all have reached puberty, but will be younger than 16 - and will have to meet strict criteria, undergo intensive medical and psychological screening before they are allowed to start taking puberty blockers.A team of specialist NHS doctors must have a full picture of the young person's wellbeing before deciding if they think they are suitable for the treatment.The young person will also have to show they have a good enough understanding of the potential impact of taking puberty blockers to give their consent, and their parent or legal guardian will need to agree. They will be provided with ongoing psychological support.To explore the impact of the drugs, the researchers plan to start one group on the treatment straight away and another group 12 months later. The children in these groups will be chosen randomly.The KCL researchers said there would be no minimum age for taking the drugs, but puberty normally starts around the age of 11 for girls and 12 for boys.The trial will look at issues such as bone density, brain development and mental health and wellbeing over time.The research team said the trial had been given ethical approval and was expected to start in January, with five to six children recruited every month. The first results should be available in around four years.Alongside this, a larger observational study involving 3,000 children will research different types of support and how effective they are.The puberty blockers trial has already proved controversial, with campaigners threatening legal action.Keira Bell, who took the Tavistock gender clinic to court in 2020 after she was given puberty blockers and cross-sex hormones as a teenager, said the trial should be halted immediately. If it is not, she says she and another campaigner will start judicial review proceedings at the High Court.She said it was \"disgusting\" that children were being put on the drugs when they had already been banned because they were \"unsafe\".In her case, the High Court ruled that under-16s were \"unlikely to be able to give informed consent\" to puberty blockers, but this was later overturned by the Court of Appeal which ruled that doctors can judge whether young people can give consent to the treatment.Some clinicians from the Clinical Advisory Network on Sex and Gender, which campaigns for rigorous science and improved treatment options for gender-questioning people, have also questioned whether the trial can be carried out ethically. A spokesperson for charity Stonewall, which campaigns for the rights of LGBTQ+ people, said all young people should have access to the very best medical care, guided by evidence.\"We urge the government and policymakers to invest in delivering excellent healthcare for trans young people and to make sure the voices of trans young people and their families are at its core.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New puberty blockers clinical trial to begin after UK ban",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fbb7/live/f8ea21f0-c6fb-11f0-a863-434ee92aa5e3.jpg"
      ],
      "datePublished": "2025-11-22T00:05:41.000Z",
      "dateModified": "2025-11-22T00:05:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radiohead deliver a spell-binding, hit-packed set in London",
    "url": "https://www.bbc.com/news/articles/clyz32pz81vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3370/live/5a52d6c0-c743-11f0-83ee-e9a45b762958.jpg",
    "tag": "Trending",
    "date": "2025-11-22T01:58:29.000Z",
    "description": "2 hours agoMark SavageMusic correspondentAlex Lake / @twoshortdays\"We are Radiohead. Pleased to meet you,\" said Thom Yorke in one of his few addresses",
    "body": "2 hours agoMark SavageMusic correspondentAlex Lake / @twoshortdays\"We are Radiohead. Pleased to meet you,\" said Thom Yorke in one of his few addresses to the audience\"Whenever you're ready,\" says Thom Yorke, adopting the tone of a schoolteacher waiting for an unruly class to settle down, as Radiohead get ready to play their encore at London's O2 Arena.It's a rare flash of humour from the frontman, whose onstage utterings are mostly limited to mumbled \"thank yous\". But it's also an acknowledgment of how long fans have been waiting for this show.It is now 10 years since Radiohead last released new material, and 99 months since their last UK gig.Anticipation for their return has been building ever since they announced a limited run of concerts in September. Setlists from early shows in Spain and Italy have generated news stories (\"Radiohead play Nice Dream for the first time since 2009\"), as fans pore over the song choices. According to one source, they've rehearsed 65 different numbers.At the O2, the band sift through their entire discography - from the arena rock anthems of 1994's The Bends to the celestial ballads of A Moon Shaped Pool, via the layered electronics of Kid A, currently celebrating its 25th anniversary.There are some signs that Radiohead are a bit rusty. A few timing and tuning issues crop up, which could easily be the result of a first night in a new venue, but which feel odd for a band of such technical proficiency.But when it comes together, it's a rapturous, spell-binding sight.Band members switched instruments several times within songsThey begin with the spacey, hypnotic Planet Telex, and follow it up with a crunchy version of  2+2=5, written in 2003 as a reaction to George W Bush's \"War on Terror\", and taking on new urgency in a world where political norms have seemingly been turned upside down.By the third song, Sit Down, Stand Up, they're flexing their musical muscles, with an extended outro of percussive lunacy, aided by US session musician Chris Vatalaro.His addition to the line-up is a giveaway. Radiohead's secret sauce has always been their rhythm section - who manage to locate sinewy, danceable grooves even when presented with their bandmate's most challenging material.The prowling bassline of National Anthem and the slamming drum loops of Idioteque, in particular, give the audience ample opportunity to jump up and down.That said, it's amusing to watch bassist Colin Greenwood try (and fail) to get the crowd clapping in time to the glitchy and unconventional rhythms of 15 Step. Instead, most of them simply bob their heads up and down in unified appreciation of the music. At times, it looks like a convention of nodding dogs.Cushioned between the more experimental songs, however, were the real crowd-pleasers: An elegiac version of Lucky, a beautifully twisted No Surprises and a genuinely sublime version of Weird Fishes/Arpeggi.I have a theory, however, that the band's notorious dislike of \"the old stuff\" is an elaborate ruse. They've never really stopped playing songs from The Bends and OK Computer - but the suggestion they won't makes it all the more exciting when they break into something anthemic like Fake Plastic Trees.That song opened Friday night's encore, which dwelt largely on their 90s material, including Let Down - a deep cut that's had a new lease of life on TikTok - and the epic Paranoid Android.Alex Lake / @twoshortdaysThe tour continues until 12 DecemberIntroducing a muscular version of Just, Yorke explains that it was written \"on a freezing cold farm in 1994\", in a period where they thought they'd only be remembered for one song: Their 1992 breakout Creep.We all know the story ended differently, but the reunion does find Radiohead in a strange position. This tour comes with no new material, and the last seven years have been so fertile with side projects, most notably Thom Yorke and guitarist Jonny Greenwood's three albums as The Smile, that it seemed Radiohead's members might have permanently moved on.Several factors got in the way - grief, parenthood, mental health and rumours of intra-band tension over Israel.As recently as August, Yorke said a reunion was \"not on the cards from where I'm sitting\".All of which makes the decision to play in the round, packed like sardines in a crushed tin can, all the more significant.The group are symbolically returning to the rehearsal room, playing off each other as much as they are playing to the audience.Yorke glides across the stage, doing that dance he does, moving from acoustic guitar to electric piano and back again. During Idioteque, guitarist Ed O'Brien catches him mid-transit, and they holler the lyrics directly to one another. At the start of Jigsaw Falling Into Place, Yorke and Greenwood face each other and play duelling guitars.It suggests the tour has been an act of healing, even if the band have been assigned separate dressing rooms for the first time in their career.Whether that leads to anything more is still up for debate. \"We haven't thought past the tour,\" Yorke recently told the Times. \"I'm just stunned we got this far.\"The delighted fans who queued for the Tube home singing Karma Police will be hoping everything is in its right place for a fully-fledged comeback.Full setlistPlanet Telex2 + 2 = 5Sit Down, Stand UpLuckyBloom15 StepThe GloamingKid ANo SurprisesVideotapeWeird Fishes/ArpeggiIdiotequeEverything in Its Right PlaceThe National AnthemDaydreamingJigsaw Falling Into PlaceBodysnatchersThere ThereEncore:Fake Plastic TreesLet DownParanoid AndroidYou and Whose Army?A Wolf at the DoorJustKarma Police",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radiohead deliver a spell-binding, hit-packed set in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3370/live/5a52d6c0-c743-11f0-83ee-e9a45b762958.jpg"
      ],
      "datePublished": "2025-11-22T01:58:29.000Z",
      "dateModified": "2025-11-22T01:58:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene to quit Congress after Trump feud",
    "url": "https://www.bbc.com/news/articles/cj4qx1lenvjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0bdc/live/a8717a60-c747-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-22T04:12:35.000Z",
    "description": "High-profile Republican Marjorie Taylor Greene to quit Congress after Trump feudJust nowKwasi Gyamfi Asiedu,Washington and Anthony Zurcher,North Ameri",
    "body": "High-profile Republican Marjorie Taylor Greene to quit Congress after Trump feudJust nowKwasi Gyamfi Asiedu,Washington and Anthony Zurcher,North America correspondent, WashingtonKey moments from Trump and Greene's public falloutGeorgia congresswoman Marjorie Taylor Greene has announced she will resign from office, an unexpected turn for the high-profile Republican days after a public feud with President Donald Trump.Greene, who was one of Trump's Maga superstars in US politics, posted a video statement on social media announcing she would leave Congress on 5 January 2026.The Republican was one of Trump's staunchest defenders in Congress, but her relentless calls for releasing files related to late paedophile Jeffrey Epstein led to a bitter public falling out with the president, who has since labelled her a \"traitor\".\"I refuse to be a 'battered wife' hoping it all goes away and gets better,\" she said in the video.Trump, who had threatened to support a Republican challenger to unseat Greene, responded to her resignation by calling it \"great news for the country\" in an interview with ABC News.Greene said in the announcement that she did \"not want my sweet district to have to endure a hurtful and hateful primary against me by the president we all fought for, only to fight and win my election while Republicans will likely lose the midterms.\" She had been one of the loudest demanding the release of documents related to Epstein, an issue that once united Trump and his base but has become divisive.Trump had spent months arguing that the issue was a distraction concocted by his political detractors to divert attention from his administration's achievements.\"Standing up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and threatened by the President of the United States, whom I fought for,\" Greene said in her resignation letter. Watch: Marjorie Taylor Greene announces resignation in video messageOver the last few months, she has gone on a number of high-profile news shows and was critical of Trump and fellow Republicans. She took issue with the president not doing enough to bring down costs for voters and criticised his tariff policies. But above all, she criticised his administration for not releasing documents related to Epstein.Trump responded last week in a series of social media posts, calling Greene a \"traitor\" and \"wacky\". He said she should be unseated and vowed to back a challenger for her place in Congress.Days after their feud boiled over, Trump reversed course and said he would support the release of files related to Epstein. He signed off on a bill this week that forces the US Justice Department to release the documents within 30 days. Greene was elected to Congress in 2020 amid a backdrop of headlines over her support and promotion of QAnon conspiracies, including claiming school shootings and the 9/11 terror attacks were staged. She has since apologised and sought to distance herself from those comments.In the video announcing her resignation, Greene ticked off a list of political achievements. She noted in her resignation letter that the comments from Trump were \"hurtful\". AFP via Getty ImagesGreene and Trump on the campaign trail in 2024While she announced her departure from the House of Representatives, reports in US media have indicated Greene has shown an interest in running for state office - either as Georgia governor or for a Senate seat. The president has commented publicly about those ambitions, writing on Truth Social during their public feud that he had previously told her that she shouldn't run for either of those offices due to poor public polling. Greene has since said she did not plan to run for either of those offices. Before their public falling out, Trump and Greene had been close allies in championing the \"America First\" agenda. She joined him on the campaign trail and was one of the Republicans most vocal about Trump's false claims that he'd won the 2020 presidential election against Joe Biden. Her departure will further close the gap in the Republican-led House of Representatives, who only hold a handful of seats more than Democrats. Control of the chamber will be up for grabs in the 2026 midterm elections next November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene to quit Congress after Trump feud",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0bdc/live/a8717a60-c747-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-22T04:12:35.000Z",
      "dateModified": "2025-11-22T04:12:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]