[
  {
    "title": "Secret BBC filming exposes hidden culture of racism and misogyny inside Met Police",
    "url": "https://www.bbc.com/news/articles/cvgq06d44jyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9468/live/a737deb0-9ed3-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-01T17:02:23.000Z",
    "description": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Adrian Polglase</span><span>BBC Panorama</span><span> and</span></p><p><span>Joseph Lee</sp",
    "body": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Adrian Polglase</span><span>BBC Panorama</span><span> and</span></p><p><span>Joseph Lee</span><span></span></p></span></p></div><p></p><figcaption>Sgt Joe McIlvenny was filmed dismissing an alleged rape victim's testimony</figcaption><p></p><div><p>Serving Metropolitan Police officers called for immigrants to be shot, revelled in the use of force and were dismissive of rape claims in footage captured by a Panorama undercover reporter.</p><p>The evidence of misogyny and racism challenges the Met's promise to have tackled what it calls \"toxic behaviours\" after the murder of Sarah Everard by a serving police officer.</p><p>Panorama's secret filming shows officers making sexualised comments to colleagues and sharing racist views about immigrants and Muslims.</p><p>This evidence reveals that, far from being driven out of the Met, racist and misogynistic attitudes have been driven underground. \"Someone new joins, boom, mask on. You've got to figure them out,\" one officer said.</p><p>After the BBC sent a detailed list of allegations to the Met, it suspended eight officers and one staff member, and took two more officers off front-line duties. Commissioner Sir Mark Rowley said the behaviour outlined by Panorama was, \"disgraceful, totally unacceptable and contrary to the values and standards\" of the force.</p><p><i><b>Warning: This story contains repeated use of highly offensive and discriminatory language</b></i></p><p>Among the officers filmed by our undercover reporter were:</p></div><div><ul><li>Sgt Joe McIlvenny, an officer with nearly 20 years' service in the Met, who was dismissive about a pregnant woman's allegations of rape and domestic violence, after a colleague raised concerns about the decision to release the accused man on bail. He replied: \"That's what she says.\"</li><li>PC Martin Borg, who enthusiastically described how he saw another officer, Sgt Steve Stamp, stomp on a suspect's leg. PC Borg laughed when he described how he had offered to make a statement saying the suspect had tried to kick the sergeant first. It was unclear from CCTV footage if the claim was true.</li><li>PC Phil Neilson, who told our reporter in the pub that a detainee who had overstayed his visa should have \"a bullet through his head\" and \"ones that shag, rape women, you'd do the cock and let them bleed out\".</li></ul></div><p>BBC Panorama's undercover reporter, Rory Bibb, spent seven months up to January this year as a designated detention officer (DDO) in the custody suite of Charing Cross police station in central London. It is a civilian role which involves working closely with sergeants and constables, but not taking part in arrests.</p><p>Charing Cross has one of the Met's 22 custody suites where people are held after arrest and before they are charged or released. It is often a volatile environment where officers deal with violent people and vulnerable individuals, including young people and those with mental health issues.</p><p></p><figcaption>Off-duty, PC Phil Neilson called immigrants \"scum\"</figcaption><p></p><div><p>The station had been the focus of <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/uk-england-london-60215575\">an investigation by the police watchdog, the Independent Office for Police Conduct (IOPC)</a>, into bullying and discrimination nearly four years ago. It found that some officers had discussed hitting their girlfriends, shared offensive and discriminatory comments and joked about rape in private group chats.</p><p>Whistleblowers told Panorama that officers with racist and misogynistic attitudes still worked at the station despite the Met's promise to root out \"rogue officers\" and \"cultural failings\".</p></div><p></p><h2>'Terrifying' misogyny</h2><p></p><div><p>Sergeants are in charge of the custody suite day-to-day and are responsible for upholding the Met's values and ethical standards.</p><p>One of them at Charing Cross was Sgt McIlvenny, who was repeatedly filmed while on duty displaying misogynistic attitudes.</p><p>He talked to colleagues in graphic terms about his sex life, telling the undercover reporter and a female colleague about a woman he said he met online: \"She fucking fills the door, almost like monstrous.\" He added that she was \"so fat she had two pussies. There's the real one and then the fat one round it.\"</p><p>He talked about how he got sexual pleasure from having his nipples played with, despite the objections of some female colleagues in earshot.</p><p>Discussing having his nipples pierced, he said: \"My pain tolerance goes up massively if I'm aroused at the same time. So, I'm going to ask them if I can have a wank...\"</p><p>As custody sergeant, Sgt McIlvenny is responsible for making decisions about whether a suspect is remanded in custody or given bail after being charged.</p></div><p></p><figcaption>Sgt McIlvenny described sexual encounters to colleagues</figcaption><p></p><div><p>When a female DDO questioned a decision to release on bail a man alleged to have raped his girlfriend, she pointed out he had also been accused of kicking the pregnant woman in the stomach. Sgt McIlvenny responded: \"That's what she says.\" Panorama does not have the full details of the case.</p><p>The female DDO later told the undercover reporter about her anger at the sergeant's response. \"The way he went, 'Yeah, it's what she says.' He fucking stamped on her stomach when she was pregnant,\" she said.</p><p>\"I'd like to turn round and go, 'You wanker. You're a wanker.' But, unfortunately, I can't. He's got stripes on his shoulders.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b53a/live/1ea34310-9e00-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Rory Bibb, seen working at his desk while wearing the uniform of a designated detention officer, a navy jumper with epaulettes in royal blue. He is talking on the phone in front of a computer, making a note on a yellow Post-It note. Behind him is a colleague whose face is blurred\" /></p></div><p></p><figcaption>BBC Panorama reporter Rory Bibb, who spent seven months working alongside police officers at Charing Cross police station</figcaption><p></p></figure><div><p>Sue Fish, who was temporary chief constable of Nottinghamshire Police and previously ran misconduct hearings, reviewed Panorama's footage and said the sergeant's sexualised comments were \"completely inappropriate, very misogynistic\".</p><p>Discussing his comment about the rape and domestic violence allegations, she said: \"As a woman as well as a former police officer, individuals like him have the power to make these sorts of decisions about my safety or other women's safety and that is terrifying.\"</p><p>Ms Fish has previously spoken about her experience of twice being sexually assaulted by colleagues, once as a junior officer and on another occasion when holding a senior role. Under her leadership, in 2016 Nottinghamshire Police became the first force to record misogyny as a hate crime.</p></div><div><p>In January this year, while the BBC's undercover reporter was working in the station, Sgt McIlvenny was told he was being investigated for inappropriate comments he had allegedly made to a woman in custody.</p><p>Custody staff told our undercover reporter that the woman was Asian and that Sgt McIlvenny had said to her that she should be in the \"massage business\". British Transport Police officers had reported him, the custody staff said.</p><p>But last month, before Panorama informed the Met of its findings, the sergeant told the BBC's reporter that he was back working in the custody suite.</p></div><p></p><h2>'Red mist'</h2><p></p><div><p>The BBC's undercover reporter repeatedly filmed officers revelling in the use of force, revealing a culture of confidence and trust that colleagues would not blow the whistle on them.</p><p>Police officers can use force, but only when it is \"proportionate and reasonable in all the circumstances\", according to their Standards of Professional Behaviour.</p><p>Over a few drinks in a nearby pub while off duty, PC Martin Borg described how a man arrested for impersonating a police officer and attempted kidnap, and who was judged to be a suicide risk, had been restrained.</p><p>PC Borg said the man had spat at officers and urinated on the door of the cell, so officers pinned him down on the floor. While he was \"kicking out\", Sgt Steve Stamp, nicknamed \"Stampy\", brought his boot down on the man's leg, the constable said.</p><p>The undercover reporter was able to examine footage from CCTV cameras in the custody suite, which showed the sergeant stamping down twice.</p></div><p></p><figcaption>PC Martin Borg described seeing a colleague stamp on a detainee</figcaption><p></p><div><p>\"This guy's fucking screamed,\" said PC Borg. \"He had a lump on his foot that looked like a fucking tumour mate, afterwards.\" Recalling that the detainee had protested that the sergeant stamped on his leg, he remembered saying: \"Yeah he fucking did, you cunt.\"</p><p>PC Borg said the sergeant had told him afterwards that the suspect had tried to kick him. \"Absolutely Sarge,\" he recalled saying. \"I'll put that in the MG11 if you like Sarge?\"</p><p>An MG11 is a witness statement. Ms Fish, the former chief constable, said if PC Borg  had put fabricated information in it, which could be shown to be false, that would be \"perverting the course of justice or conspiracy to pervert the course of justice\".</p><p>It is not clear in the CCTV footage if the man had tried to kick Sgt Stamp. The man had bare feet and four officers were restraining him at the time.</p><p>One officer described how, if suspects refuse to have their fingerprints taken, he could pull two of their fingers hard to snap the tendons. \"I love taking fingerprints by force,\" he said.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4388/live/bc0908f0-9e01-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"A hidden camera shot, taken slightly from below and at an angle, of an officer in police uniform, a white man with brown hair in a side-parting and a with a cleft chin, standing in front of a police van in the courtyard of Charing Cross police station, with windows of the station all around. He is pulling with his right hand on the fingers of his left as he discusses taking fingerprints by force\" /></p></div><p></p><figcaption>One officer boasted about how he loved taking fingerprints by force and talked about how he could snap the tendons of suspects' fingers</figcaption><p></p></figure><div><p>Another constable, meeting the undercover reporter in the canteen for the first time, described how a suspect had elbowed him in the face, so he had \"whacked the shit out of the back of his legs\" as he stood up in the van, wearing leg restraints.</p><p>\"Just fucking just like five or six strikes,\" he said. \"It wasn't a good look. There's definitely a little bit of red mist there. But nothing came of it.\"</p></div><p></p><h2>'They're just scum'</h2><p></p><div><p>Over drinks in the pub, officers expressed racist, anti-immigrant or anti-Muslim views.</p><p>On one occasion, PC Borg was in the pub talking about suspects in custody who were from ethnic minorities. When asked which group caused the most grief, he answered \"Muslims\".</p><p>\"Hate us. They fucking hate us. Proper hate us,\" he said. \"Islam is a problem. A serious problem, I think.\"</p><p>Police standards say officers' behaviour must not \"discredit the police service or undermine public confidence, whether on or off duty\".</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6b1a/live/ae249950-9e03-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"A hidden camera shot taken at chest height looking slightly upwards at PC Martin Borg, a white man with dark hair and a short, dark beard, standing in what appears to be an alleyway outside a pub, wearing a dark T-shirt and a black leather jacket\" /></p></div><p></p><figcaption>PC Martin Borg said Muslims \"hate us\" and called Islam a \"serious problem\"</figcaption><p></p></figure><div><p>PC Phil Neilson, a constable with the West End team, was initially wary of sharing his views with the undercover reporter. Only half joking, PC Neilson asked the reporter if he was a member of the Met's Directorate of Professional Standards.</p><p>Two weeks later, PC Neilson and Rory met again at the pub, where the constable described how he did not mind Ukrainian people fleeing to the UK from the war. But he had an entirely different view of people arriving from the Middle East. \"They're just scum,\" he said, on his second pint, claiming that it was \"an invasion\".</p><p>\"God, we'd so lose our jobs right now,\" PC Neilson added.</p><p>Over the course of the evening and as PC Neilson drank more, his views remained consistent, but he expressed them in more extreme ways - and even violent ones.</p><p>He said Algerians were \"scum\" and \"cunts\", Somalis were \"scum\" and \"fucking ugly\", adding: \"I think any foreign person is the worst to deal with.\"</p><p>A couple of drinks later, PC Neilson shared his views on Islam. \"I've seen too many Islamics committing crimes. Their way of life is not the correct way of life,\" he said.</p><p>\"You do find that the ones that are causing the most crime are Muslim.\"</p><p>Police standards also require officers not to discriminate unlawfully or unfairly. The  Home Office and police do not publish statistics on general arrest rates by religious communities.</p></div><p></p><figcaption>Met officers laughed about Muslims being served non-Halal food</figcaption><p></p><div><p>PC Neilson said of a detainee he was dealing with who had overstayed his visa, \"Fucking either put a bullet through his head or deport him.\"</p><p>He added: \"A revolver. A revolver would be so nice... And the ones that shag, rape women, you'd do the cock and let them bleed out.\"</p><p>Former chief constable Ms Fish said that she was \"appalled and disgusted\" and that the constable was a \"violent racist.\"</p><p>\"I have absolutely no confidence in him as a police officer whatsoever. To be frank, not much as a human being,\" she said.</p></div><p></p><h2>'The real you comes out'</h2><p></p><div><p>Despite several officers sharing discriminatory and unprofessional views, some made it clear they were aware of the need to conceal their real opinions.</p><p>On one occasion, Sgt McIlvenny warned the undercover reporter not to make reference to the use of force against suspects in ways that might be captured by CCTV and microphones within the police station.</p><p>The sergeant had punched a man in the leg who was being forcibly searched, and the undercover reporter said afterwards: \"I saw your little dig in the back of the leg.\"</p><p>A few minutes later, Sgt McIlvenny took the reporter into a corridor away from the cameras and microphones in custody. \"Be careful debriefing use of force in the suite,\" he said. \"It doesn't sound great if it's played back later on down the line.\"</p><p>\"Don't fucking talk us all into a fucking big complaint,\" the sergeant added.</p><p>In the pub, one of the longest-serving officers Rory meets, PC Brian Sharkey, was drinking with colleagues who were joking about disciplinary complaints and making sexual innuendos.</p><p>\"If you go down for a sexual assault, you might as well go down for rape,\" PC Sharkey interjected, before checking himself and saying it was a joke. \"That was a bit wrong. I challenge myself on that.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/59da/live/422f3320-9e05-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"A hidden camera shot of PC Brian Sharkey, a white man wearing a light grey hooded top, sitting at a pub table with multiple glasses and menus in front of him and other colleagues just visible out of shot\" /></p></div><p></p><figcaption>Off duty, PC Brian Sharkey questioned whether he could trust the \"new boy\", undercover reporter Rory Bibb</figcaption><p></p></figure><div><p>The constable later addressed the undercover reporter: \"Now who can I fucking trust here? You're the fucking new boy,\" before shutting down discussion of another incident.</p><p>Another officer told the undercover reporter he was cautious when talking to a new colleague. \"You have to put the mask of speaking factual, and then when you get on with them, it comes off and then the real you, comes out,\" he said.</p><p>The BBC wrote to the Metropolitan Police detailing the evidence gathered during the seven-month investigation.</p><p>Met Police Commissioner Sir Mark Rowley said his force had taken \"immediate and unprecedented action to investigate these allegations\". It referred the allegations to the IOPC, whose director Amanda Rowe said: \"We are treating this matter extremely seriously.\"</p><p>Sir Mark said the Met has \"dismantled the custody team at Charing Cross\", adding that more than 1,400 officers and staff have left or been dismissed since 2022 for failing to meet the Met's standards, \"the biggest clear-out in the force's history\".</p><p>\"Much more needs to be done to tackle the individuals and cliques whose appalling behaviour continues to let down their colleagues and Londoners,\" he said. \"Our resolve to identify, confront and get rid of them is absolute.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/48be/live/daf54ea0-9e05-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"A view from a helicopter of Charing Cross police station, a white, late-Georgian stucco-fronted building forming a triangular shape, with the outline of the courtyard visible in the middle\" /></p></div><p></p><figcaption>Charing Cross police station was investigated nearly four years ago, but whistleblowers told Panorama problems still remained</figcaption><p></p></figure><div><p>Panorama also wrote to the individual officers identified in this article. They have not responded.</p><p>After Sarah Everard was <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/uk-england-london-58747614\">kidnapped, raped and murdered by a serving police officer</a> in 2021, a review of the Met by Baroness Louise Casey concluded it was <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/uk-65015479\">institutionally racist, homophobic and misogynistic</a>.</p><p>Sir Mark Rowley accepted the review's recommendations, but at the time did not accept that the problems were \"institutional\".</p><p>In 2022, the force was <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/uk-england-london-61970399\">put into special measures by the police inspectorate</a>, a form of enhanced scrutiny which ended in January this year. At the time, Sir Mark said the force was making \"massive progress\".</p><p>Former Attorney General Dominic Grieve, who also reviewed Panorama's footage, said he was struck how high standards, values and discipline \"didn't seem to be present or being inculcated by the people who were in authority\", referring to the sergeants.</p><p>He said the behaviour of these officers undermined policing by consent and made the job harder in the long run.</p><p>The former chief constable, Ms Fish, said: \"I've seen enough to say there is a highly toxic culture there of hyper-sexualised male behaviour, misogyny, racism, and gratuitous, unlawful violence.\"</p><p>She said the Met leadership had never grasped \"the significance, the scale and impact\" of this culture. \"It's always been a rotten apple, not a rotten barrel,\" she said.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/108c/live/bc80e3a0-9f57-11f0-928c-71dbb8619e94.png.webp\" alt=\"A thin, grey banner promoting the News Daily newsletter. On the right, there is a graphic of an orange sphere with two concentric crescent shapes around it in a red-orange gradient, like a sound wave. The banner reads: \"The latest news in your inbox first thing.”\n\" /></p></div></figure><p>Get our flagship newsletter with all the headlines you need to start the day. <a target=\"_blank\" href=\"https://www.bbc.co.uk/newsletters/zhp28xs\">Sign up here.</a></p></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Secret BBC filming exposes hidden culture of racism and misogyny inside Met Police",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9468/live/a737deb0-9ed3-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-01T17:02:23.000Z",
      "dateModified": "2025-10-01T17:02:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainecast - Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m6cp4t?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg",
    "tag": "Trending",
    "date": "2025-10-02T16:00:00.000Z",
    "description": "<div>  <div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <svg width=\"112\" height=\"32\">  </svg> <span>Homepage</span> </a> </div> <div> <h2",
    "body": "<div>  <div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <svg width=\"112\" height=\"32\">  </svg> <span>Homepage</span> </a> </div> <div> <h2>Accessibility links</h2> <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6cp4t?at_medium=RSS&at_campaign=rss#main\"><span>Skip to content</span></a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/accessibility/\"><span>Accessibility Help</span></a> </li> </ul> </div> <div> <div><div></div><div><a target=\"_blank\" href=\"https://account.bbc.com/account\"><span>BBC Account</span></a></div></div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/notifications\"> <svg width=\"23\" height=\"24\">  </svg> <span>Notifications</span> </a> </div> </div>  <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/news\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sport\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/weather\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Weather</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>iPlayer</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sounds</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/bitesize\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Bitesize</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbeebies\"> <span>CBeebies</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbbc\"> <span>CBBC</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/food\"> <span>Food</span> </a> </li> </ul>   <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.com/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/news\"> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/sport\"> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/business\"> <span>Business</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/innovation\"> <span>Innovation</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/culture\"> <span>Culture</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/travel\"> <span>Travel</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/future-planet\"> <span>Earth</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/video\"> <span>Video</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/live\"> <span>Live</span> </a> </li> </ul>  <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6cp4t?at_medium=RSS&at_campaign=rss#orbit-more-drawer\"> <svg width=\"20\" height=\"4\">    </svg> <svg width=\"24\" height=\"22\">  </svg> <span>More menu</span> </a> <div>   <a target=\"_blank\" href=\"https://search.bbc.co.uk/search?scope=sounds&destination=sounds\" title=\"Search Sounds\"> <span> <svg width=\"28\" height=\"29\">  </svg> <svg width=\"15\" height=\"16\">  </svg> <span>Search Sounds</span> </span> </a>   </div> </div> </div>   <div> <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/news\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sport\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/weather\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Weather</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>iPlayer</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sounds</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/bitesize\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Bitesize</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbeebies\"> <span>CBeebies</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbbc\"> <span>CBBC</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/food\"> <span>Food</span> </a> </li> </ul>  <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.com/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/news\"> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/sport\"> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/business\"> <span>Business</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/innovation\"> <span>Innovation</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/culture\"> <span>Culture</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/travel\"> <span>Travel</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/future-planet\"> <span>Earth</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/video\"> <span>Video</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/live\"> <span>Live</span> </a> </li> </ul>  <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6cp4t?at_medium=RSS&at_campaign=rss#\"> <svg width=\"32\" height=\"32\">  </svg> <span>Close menu</span> </a> </div> </div>   \n<div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"><span>Sounds home page</span><svg></svg></a><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"><svg width=\"100%\" height=\"100%\"></svg><span>Home</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/music\"><svg width=\"100%\" height=\"100%\"></svg><span>Music</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/podcasts\"><svg width=\"100%\" height=\"100%\"></svg><span>Podcasts</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/my\"><svg width=\"100%\" height=\"100%\"></svg><span>My Sounds</span></a></li><li></li></ul></div><div><h2>Ukrainecast - Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan - BBC Sounds</h2><div><section><div><div><picture><source type=\"image/webp\" srcset=\"https://ichef.bbci.co.uk/images/ic/320x320/p0kwvwyl.jpg.webp 320w\"></source><source type=\"image/jpg\" srcset=\"https://ichef.bbci.co.uk/images/ic/320x320/p0kwvwyl.jpg 320w\"></source><img src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0kwvwyl.jpg\" alt=\"\" /></picture></div><div><h2>Ukrainecast - Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan - BBC Sounds</h2><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/p0bqztzm\">Ukrainecast</a></div><hr /><div><span>Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan</span><span>Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan</span></div></div></div></section></div><div><div><div><span>Released On:</span> 02 Oct 2025</div><div>Available for over a year</div></div><div><p>Your questions answered on UN peacekeepers and Russian defence treaties </p></div><div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/brand/p0bqztzm\"><div><span>More episodes</span><svg width=\"14px\" height=\"14px\"></svg></div></a></div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/p0m6cp4t\"><div><span>Programme Website</span><svg width=\"12px\" height=\"12px\"></svg></div></a></div></div></div><section><h2 id=\"sc-id-coming-up-next\">Coming Up Next</h2><div><div><ul><li> </li><li><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6cp4t\"><div><div><picture><source type=\"image/webp\" srcset=\"https://ichef.bbci.co.uk/images/ic/160x160/p0kwvwyl.jpg.webp 160w, https://ichef.bbci.co.uk/images/ic/192x192/p0kwvwyl.jpg.webp 192w, https://ichef.bbci.co.uk/images/ic/224x224/p0kwvwyl.jpg.webp 224w, https://ichef.bbci.co.uk/images/ic/288x288/p0kwvwyl.jpg.webp 288w, https://ichef.bbci.co.uk/images/ic/576x576/p0kwvwyl.jpg.webp 576w\" sizes=\"(max-width: 400px) 34vw,(max-width: 600px) 25vw,17vw\"></source><source type=\"image/jpg\" srcset=\"https://ichef.bbci.co.uk/images/ic/160x160/p0kwvwyl.jpg 160w, https://ichef.bbci.co.uk/images/ic/192x192/p0kwvwyl.jpg 192w, https://ichef.bbci.co.uk/images/ic/224x224/p0kwvwyl.jpg 224w, https://ichef.bbci.co.uk/images/ic/288x288/p0kwvwyl.jpg 288w, https://ichef.bbci.co.uk/images/ic/576x576/p0kwvwyl.jpg 576w\" sizes=\"(max-width: 400px) 34vw,(max-width: 600px) 25vw,17vw\"></source><img alt=\"\" src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0kwvwyl.jpg\" /></picture><div><svg width=\"32px\" height=\"32px\"></svg></div></div><div><span></span><span></span><span></span><span></span></div></div><p>now playing</p><div><span>Ukrainecast</span><p>Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan</p><p>Your questions answered on UN peacekeepers and Russian defence treaties</p><ul><li>29 mins</li></ul></div></a></div></li><li> </li></ul></div></div></section><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/cy\"><span>Cymraeg</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/ga\"><span>Gaeilge</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/gd\"><span>Gàidhlig</span></a></li></ul><ul><li><a target=\"_blank\" href=\"https://bbc.co.uk/sounds/help\"><span>BBC Sounds Help</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/articles/0c6dcea5-420b-4caf-b3b9-e97b605a50fd\"><span>Contacts, Privacy and Information</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/usingthebbc/account/\"><span>Help with Signing In</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/newsletters/email/zbdmwty\"><span>Newsletter</span></a></li></ul></div></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainecast - Q&A: Russia's veto power, Nato's Article 5, and Putin's succession plan - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg"
      ],
      "datePublished": "2025-10-02T16:00:00.000Z",
      "dateModified": "2025-10-02T16:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "<div><article><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/AA1B/production/_130074534_bbcnewsfaq",
    "body": "<div><article><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"BBC News app\" src=\"https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/AA1B/production/_130074534_bbcnewsfaqs.jpg 976w\" /></picture></span></p><figcaption><span>Image caption, </span><p>The BBC News app is available for Android and iOS devices</p></figcaption></figure></div><div><p><b>With the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.</b></p></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"presentational grey line\" src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 976w\" /></picture></span></p></figure></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"presentational grey line\" src=\"https://ichef.bbci.co.uk/ace/standard/1376/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/FB9C/production/_90021446_grey_line_new.jpg 976w\" /></picture></span></p></figure></div><div><p>Features include: </p></div><div><ul><li><p>News, features and analysis</p></li><li><p>Read top stories and breaking news</p></li><li><p>Watch live and developing news coverage</p></li><li><p>Get news and weather local to you</p></li><li><p>Follow news that's important to you</p></li><li><p>Get alerts for top stories</p></li></ul></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 624w\" type=\"image/webp\"></source><img alt=\"Presentational white space\" src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 624w\" /></picture></span></p></figure></div><div><p>We would like to know what you think of the new app - <a target=\"_blank\" href=\"https://www.bbc.co.uk/send/u88080479\">click here</a> to give us your feedback.</p></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png.webp 624w\" type=\"image/webp\"></source><img alt=\"Presentational white space\" src=\"https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/604B/production/_97415642_007_in_numbers_624.png 624w\" /></picture></span></p></figure></div><div><p><i>Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.</i></p><p><i>If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.</i></p><p><i>The BBC does not charge you to access mobile content.</i></p></div></article></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Manchester Synagogue Attack: What We Know So Far - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m6dq4y?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-02T18:05:00.000Z",
    "description": "<div>  <div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <svg width=\"112\" height=\"32\">  </svg> <span>Homepage</span> </a> </div> <div> <h2",
    "body": "<div>  <div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <svg width=\"112\" height=\"32\">  </svg> <span>Homepage</span> </a> </div> <div> <h2>Accessibility links</h2> <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6dq4y?at_medium=RSS&at_campaign=rss#main\"><span>Skip to content</span></a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/accessibility/\"><span>Accessibility Help</span></a> </li> </ul> </div> <div> <div><div></div><div><a target=\"_blank\" href=\"https://account.bbc.com/account\"><span>BBC Account</span></a></div></div> <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/notifications\"> <svg width=\"23\" height=\"24\">  </svg> <span>Notifications</span> </a> </div> </div>  <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/news\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sport\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/weather\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Weather</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>iPlayer</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sounds</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/bitesize\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Bitesize</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbeebies\"> <span>CBeebies</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbbc\"> <span>CBBC</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/food\"> <span>Food</span> </a> </li> </ul>   <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.com/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/news\"> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/sport\"> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/business\"> <span>Business</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/innovation\"> <span>Innovation</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/culture\"> <span>Culture</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/travel\"> <span>Travel</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/future-planet\"> <span>Earth</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/video\"> <span>Video</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/live\"> <span>Live</span> </a> </li> </ul>  <div> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6dq4y?at_medium=RSS&at_campaign=rss#orbit-more-drawer\"> <svg width=\"20\" height=\"4\">    </svg> <svg width=\"24\" height=\"22\">  </svg> <span>More menu</span> </a> <div>   <a target=\"_blank\" href=\"https://search.bbc.co.uk/search?scope=sounds&destination=sounds\" title=\"Search Sounds\"> <span> <svg width=\"28\" height=\"29\">  </svg> <svg width=\"15\" height=\"16\">  </svg> <span>Search Sounds</span> </span> </a>   </div> </div> </div>   <div> <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/news\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sport\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/weather\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Weather</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/iplayer\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>iPlayer</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Sounds</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/bitesize\"> <svg width=\"1.75em\" height=\"1.75em\">      </svg> <span>Bitesize</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbeebies\"> <span>CBeebies</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/cbbc\"> <span>CBBC</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.co.uk/food\"> <span>Food</span> </a> </li> </ul>  <ul> <li> <a target=\"_blank\" href=\"https://www.bbc.com/\"> <span>Home</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/news\"> <span>News</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/sport\"> <span>Sport</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/business\"> <span>Business</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/innovation\"> <span>Innovation</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/culture\"> <span>Culture</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/travel\"> <span>Travel</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/future-planet\"> <span>Earth</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/video\"> <span>Video</span> </a> </li> <li> <a target=\"_blank\" href=\"https://www.bbc.com/live\"> <span>Live</span> </a> </li> </ul>  <a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6dq4y?at_medium=RSS&at_campaign=rss#\"> <svg width=\"32\" height=\"32\">  </svg> <span>Close menu</span> </a> </div> </div>   \n<div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"><span>Sounds home page</span><svg></svg></a><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds\"><svg width=\"100%\" height=\"100%\"></svg><span>Home</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/music\"><svg width=\"100%\" height=\"100%\"></svg><span>Music</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/podcasts\"><svg width=\"100%\" height=\"100%\"></svg><span>Podcasts</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/my\"><svg width=\"100%\" height=\"100%\"></svg><span>My Sounds</span></a></li><li></li></ul></div><div><h2>Newscast - Manchester Synagogue Attack: What We Know So Far - BBC Sounds</h2><div><section><div><div><picture><source type=\"image/webp\" srcset=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg.webp 320w\"></source><source type=\"image/jpg\" srcset=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg 320w\"></source><img src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg\" alt=\"\" /></picture></div><div><h2>Newscast - Manchester Synagogue Attack: What We Know So Far - BBC Sounds</h2><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/p05299nl\">Newscast</a></div><hr /><div><span>Manchester Synagogue Attack: What We Know So Far</span><span>Manchester Synagogue Attack: What We Know So Far</span></div></div></div></section></div><div><div><div><span>Released On:</span> 02 Oct 2025</div><div>Available for over a year</div></div><div><p>Keir Starmer says Britain must defeat rising antisemitic hatred. </p></div><div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/series/p05299nl\"><div><span>More episodes</span><svg width=\"14px\" height=\"14px\"></svg></div></a></div><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/p0m6dq4y\"><div><span>Programme Website</span><svg width=\"12px\" height=\"12px\"></svg></div></a></div></div></div><section><h2 id=\"sc-id-coming-up-next\">Coming Up Next</h2><div><div><ul><li> </li><li><div><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/play/p0m6dq4y\"><div><div><picture><source type=\"image/webp\" srcset=\"https://ichef.bbci.co.uk/images/ic/160x160/p0l7jnbt.jpg.webp 160w, https://ichef.bbci.co.uk/images/ic/192x192/p0l7jnbt.jpg.webp 192w, https://ichef.bbci.co.uk/images/ic/224x224/p0l7jnbt.jpg.webp 224w, https://ichef.bbci.co.uk/images/ic/288x288/p0l7jnbt.jpg.webp 288w, https://ichef.bbci.co.uk/images/ic/576x576/p0l7jnbt.jpg.webp 576w\" sizes=\"(max-width: 400px) 34vw,(max-width: 600px) 25vw,17vw\"></source><source type=\"image/jpg\" srcset=\"https://ichef.bbci.co.uk/images/ic/160x160/p0l7jnbt.jpg 160w, https://ichef.bbci.co.uk/images/ic/192x192/p0l7jnbt.jpg 192w, https://ichef.bbci.co.uk/images/ic/224x224/p0l7jnbt.jpg 224w, https://ichef.bbci.co.uk/images/ic/288x288/p0l7jnbt.jpg 288w, https://ichef.bbci.co.uk/images/ic/576x576/p0l7jnbt.jpg 576w\" sizes=\"(max-width: 400px) 34vw,(max-width: 600px) 25vw,17vw\"></source><img alt=\"\" src=\"https://ichef.bbci.co.uk/images/ic/320x320/p0l7jnbt.jpg\" /></picture><div><svg width=\"32px\" height=\"32px\"></svg></div></div><div><span></span><span></span><span></span><span></span></div></div><p>now playing</p><div><span>Newscast</span><p>Manchester Synagogue Attack: What We Know So Far</p><p>Keir Starmer says Britain must defeat rising antisemitic hatred.</p><ul><li>38 mins</li></ul></div></a></div></li><li> </li></ul></div></div></section><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/cy\"><span>Cymraeg</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/ga\"><span>Gaeilge</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/sounds/language/gd\"><span>Gàidhlig</span></a></li></ul><ul><li><a target=\"_blank\" href=\"https://bbc.co.uk/sounds/help\"><span>BBC Sounds Help</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/programmes/articles/0c6dcea5-420b-4caf-b3b9-e97b605a50fd\"><span>Contacts, Privacy and Information</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/usingthebbc/account/\"><span>Help with Signing In</span></a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/newsletters/email/zbdmwty\"><span>Newsletter</span></a></li></ul></div></div></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Manchester Synagogue Attack: What We Know So Far - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-02T18:05:00.000Z",
      "dateModified": "2025-10-02T18:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-02T05:15:05.000Z",
    "description": "<div><article><div><p><span><span>Updated 2 October 2025 06:15 BST</span></span></p></div><div><p><b>Britain's true national sport is complaining abou",
    "body": "<div><article><div><p><span><span>Updated 2 October 2025 06:15 BST</span></span></p></div><div><p><b>Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?</b></p><p>Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.</p><p>You can find the latest forecast on <a target=\"_blank\" href=\"https://www.bbc.com/weather\">the BBC Weather website</a>.</p><p>Want to know how Cooler Than Me? works? <a target=\"_blank\" href=\"https://www.bbc.com/weather/articles/c3dpnpkv3m4o\">Read the FAQ</a>.</p></div></article></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-02T05:15:05.000Z",
      "dateModified": "2025-10-02T05:15:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nirvana's Nevermind: Spencer Elden loses legal case over baby photo on album cover",
    "url": "https://www.bbc.com/news/articles/cq8eplxd7yzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/938f/live/d201acf0-9f84-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-02T10:35:23.000Z",
    "description": "<div><div><p>11 hours ago</p></div><p><span><p><span>Ian Youngs</span><span>Culture reporter</span></p></span></p></div><div><p><b>The man who was pho",
    "body": "<div><div><p>11 hours ago</p></div><p><span><p><span>Ian Youngs</span><span>Culture reporter</span></p></span></p></div><div><p><b>The man who was photographed as a baby on the cover of Nirvana's classic album Nevermind has failed in his attempts to sue the band for distributing child pornography.</b></p><p>A four-month-old Spencer Elden was pictured swimming naked underwater on the 1991 LP's famous cover.</p><p>He sued the rock band and photographer Kirk Weddle, but a judge has ruled that \"neither the pose, focal point, setting, nor overall context suggest the album cover features sexually explicit conduct\".</p><p>A lawyer for Nirvana said: \"We are delighted the court has ended this meritless case and freed our creative clients of the stigma of false allegations.\"</p></div><div><p>Mr Elden originally filed a lawsuit in 2021, arguing that his identity and name were \"forever tied to the commercial sexual exploitation he experienced as a minor which has been distributed and sold worldwide\".</p><p>US District Judge Fernando Olguin dismissed it in 2022 because Mr Elden submitted it after the 10-year limit for filing a civil case.</p><p>An appeals court overturned that decision, allowing Mr Elden to refile the case.</p><p>However, Judge Olguin has now ruled that, beyond the fact Mr Elden was naked, nothing came \"close to bringing the image within the ambit of the child pornography statute\".</p><p>He likened the image to a family photo of a child bathing, and said it is \"plainly insufficient to support a finding\" of child pornography.</p><p>\"Nudity must be coupled with other circumstances that make the visual depiction lascivious or sexually provocative,\" Judge Olguin wrote, quoting from an earlier ruling.</p><p>The judge also cited factors including the presence of Mr Elden's parents at the photo shoot, the fact the photographer was a friend, and the fact he had previously \"embraced and financially benefitted from being featured on the album cover\".</p><p>Mr Elden's legal team <a target=\"_blank\" href=\"https://www.rollingstone.com/music/music-news/nirvana-win-never-mind-child-pornography-lawsuit-1235439110/\">told Rolling Stone</a> they \"respectfully disagree\" with the decision and plan to appeal.</p><p>\"As long as the entertainment industry prioritizes profits over childhood privacy, consent, and dignity, we will continue our pursuit for awareness and accountability,\" said James R Marsh of the Marsh Law Firm.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nirvana's Nevermind: Spencer Elden loses legal case over baby photo on album cover",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/938f/live/d201acf0-9f84-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-02T10:35:23.000Z",
      "dateModified": "2025-10-02T10:35:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peaky Blinders to return to TV",
    "url": "https://www.bbc.com/news/articles/ce84kdyxj87o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3d5f/live/ff970fd0-9f9c-11f0-8e4d-7723b0da5e04.jpg",
    "tag": "Trending",
    "date": "2025-10-02T14:58:48.000Z",
    "description": "<div><div><p>6 hours ago</p></div><p><span><p><span>Ian Youngs</span><span>Culture reporter</span></p></span></p></div><div><p>Peaky Blinders is to re",
    "body": "<div><div><p>6 hours ago</p></div><p><span><p><span>Ian Youngs</span><span>Culture reporter</span></p></span></p></div><div><p>Peaky Blinders is to return to TV to follow the exploits of a new generation of the Shelby family after World War Two.</p><p>The sixth series, which was broadcast in 2022, was billed at the time as the \"the end of an epic story\", although producers did say the story would \"continue in another form\".</p><p>A forthcoming Peaky Blinders film, set at the start of the war, will see Cillian Murphy reprise his role as gang leader Tommy Shelby.</p><p>That will now be followed by two new TV seasons, which \"will be rooted in Birmingham and will tell the story of a city rising from the ashes of the Birmingham blitz\", creator Steven Knight said. \"The new generation of Shelbys have taken the wheel and it will be a hell of a ride.\"</p></div><div><p>The show will pick up in 1953, when \"the race to own Birmingham's massive reconstruction project becomes a brutal contest of mythical dimension\", the BBC said.</p><p>\"This is a city of unprecedented opportunity and danger: with the Shelby family right at its blood-soaked heart.\"</p><p>The show will be screened on the BBC in the UK and on Netflix around the world.</p><p>Murphy will be among the executive procucers, although the BBC declined to say whether any characters from the previous era would return on screen.</p><p>Peaky Blinders started in 2013, and has so far followed the street gang through the 1920s and 30s. It won best drama at the TV Bafta Awards in 2018.</p><p>The story will jump to the 40s for the film, titled The Immortal Man, which will star Murphy alongside Oscar nominee Barry Keoghan, Adolescence actor Stephen Graham and Dune's Rebecca Ferguson.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peaky Blinders to return to TV",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3d5f/live/ff970fd0-9f9c-11f0-8e4d-7723b0da5e04.jpg"
      ],
      "datePublished": "2025-10-02T14:58:48.000Z",
      "dateModified": "2025-10-02T14:58:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Only Fools and Horses actor Patrick Murray dies aged 68",
    "url": "https://www.bbc.com/news/articles/cly18vlj7gjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg",
    "tag": "Trending",
    "date": "2025-10-02T18:02:23.000Z",
    "description": "<div><section><ul><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li></ul></section><article>",
    "body": "<div><section><ul><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li></ul></section><article><div><div><p>3 hours ago</p></div><p><span><p><span>Jacob Panons</span><span>South East</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg.webp\" alt=\"Getty Images Patrick Murray wearing a black suit and fedora. He has wavy hair and a moustache. \" /><span>Getty Images</span></p></div><p></p><figcaption>Patrick Murray also featured in Quadrophenia and The Bill</figcaption><p></p></figure><div><p>Only Fools And Horses star Patrick Murray has died at the age of 68.</p><p>Murray played Mickey Pearce, a friend to Sir David Jason's Del Boy and Nicholas Lyndhurst's Rodney Trotter, across 20 episodes between 1983 and 2003 on the BBC comedy series.</p><p>He also had roles in 1979 films Quadrophenia and Scum, 1990s TV sitcom The Upper Hand, as well as The Bill, ITV Playhouse and Bergerac.</p><p>Only Fools And Horses co-star Sue Holderness, who played Marlene in the sitcom, paid tribute to Murray on X, saying: \"R.I.P. darling Patrick. Much love. You will be greatly missed.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/f1b0/live/2d58c7f0-9fb7-11f0-8410-854cfa733f11.jpg.webp\" alt=\"Getty Images A black and white image of David Jason, Nicholas Lyndhurst and Patrick Murray on Only Fools and Horses.\" /><span>Getty Images</span></p></div><p></p><figcaption>Murray (right) featured in 20 episodes of Only Fools and Horses</figcaption><p></p></figure><div><p>Murray revealed he was diagnosed with cancer in July 2021 and had an operation to remove a lung tumour in its early stages, followed by chemotherapy, in January 2022.</p><p>Subsequent scans found another tumour in his liver that was unconnected to his lung cancer and also treatable.</p><p>In a health update in May 2022, Murray said his oncologist told him his \"lung cancer was cured and that the tumour in my liver was shrinking\", however by April 2023 he revealed his lung cancer had returned.</p><p>A BBC spokesperson said: \"We are very sad to hear of the passing of Patrick Murray, much loved for his role as Mickey in Only Fools And Horses, our thoughts are with his friends and family.\"</p><p>The BBC understands Murray, who lived in Kent, died in Rochester.</p></div><p><i>Additional reporting from PA Media.</i></p><div><p><span>More on this story</span></p></div><div><p><span>Related internet links</span></p></div></article><hr /></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Only Fools and Horses actor Patrick Murray dies aged 68",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05f5/live/08796390-9fb7-11f0-8410-854cfa733f11.jpg"
      ],
      "datePublished": "2025-10-02T18:02:23.000Z",
      "dateModified": "2025-10-02T18:02:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mum's anti-chemotherapy views influenced Paloma Shemirani's death",
    "url": "https://www.bbc.com/news/articles/c77dmp3jjepo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-02T14:59:54.000Z",
    "description": "<article><p></p><h2>Mum's anti-chemo views influenced daughter's death</h2><p></p><div><div><p>6 hours ago</p></div><p><span><p><span>Sara Smith</span",
    "body": "<article><p></p><h2>Mum's anti-chemo views influenced daughter's death</h2><p></p><div><div><p>6 hours ago</p></div><p><span><p><span>Sara Smith</span><span>in Maidstone</span><span>,</span></p><p><span>Zac Sherratt</span><span>South East</span><span> and</span></p><p><span>Marianna Spring</span><span> Social Media Investigations Correspondent </span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"PA Media A young woman with blonde hair tied back. She is smiling at the camera and is stood in front of a brown brick wall\" /><span>PA Media</span></p></div><p></p><figcaption>Paloma Shemirani, 23, died after refusing chemotherapy following a diagnosis of non-Hodgkin lymphoma</figcaption><p></p></figure><div><p>A high-profile conspiracy theorist influenced her daughter to reject chemotherapy in favour of alternative treatments, which ultimately led to her death, a coroner has ruled.</p><p>Paloma Shemirani, from Uckfield in East Sussex, died in July last year - seven months after she was diagnosed with non-Hodgkin lymphoma.</p><p>Ms Shemirani, 23, had declined chemotherapy in favour of juices and coffee enemas advocated for by her mother, Kate Shemirani, a former nurse who was struck off for her anti-vaccination views.</p><p>Coroner Catherine Wood said at Kent and Medway Coroners Court on Thursday: \"The influence that was brought to bear on Paloma... did contribute more than minimally to her death.\"</p></div><div><p>After her diagnosis in December 2023, Ms Shemirani went to live with her mother and began having five coffee enemas a day, according to her brothers.</p><p>In July 2024, she collapsed at home and was taken to the Royal Sussex County Hospital in Brighton, where she died five days later.</p><p>An osteopath who saw Ms Shemirani on the morning she collapsed told the inquest he had \"never seen\" a lymphoid mass like hers in 43 years of practice.</p><p>Ms Wood said Ms Shemirani died from the progression of a disease which was curable but not treated.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/bcb8/live/fbd466b0-9f95-11f0-b9ae-cbef91e6ae73.jpg.webp\" alt=\"Getty Images A woman with long blonde hair and a pink top\" /><span>Getty Images</span></p></div><p></p><figcaption>Kate Shemirani blamed medical staff for her daughter's death</figcaption><p></p></figure><div><p>She added that treatment would have given Ms Shemirani an 80% chance of a complete cure.</p><p>The Cambridge graduate had initially consented to treatment, the coroner said, adding that \"doubts about consent only surfaced after Mrs Shemirani became involved\".</p><p>The coroner said Ms Shemirani was being influenced by her own beliefs, her mother's, her father's and by those of a family friend - all who advocated the alternative treatment she used.</p><p>\"I found Mrs Shemirani's care of her daughter incomprehensible but not unlawful killing,\" Ms Wood said.</p><p>\"It seems that if Paloma had been supported and encouraged to accept her diagnosis and considered chemotherapy with an open mind she probably would have followed that course.\"</p><p>Ms Shemirani's mother tried to blame medical staff for her daughter's death and has previously labelled chemotherapy as \"mustard gas\".</p><p>Staff at Maidstone Hospital, where Ms Shemirani was diagnosed, the Royal Sussex County Hospital and paramedics all acted appropriately, the inquest found.</p><p>Neither her mother or her father - non-medical doctor Faramarz Shemirani - attended the conclusion of the inquest.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/f86f/live/0fc189c0-9f99-11f0-b9ae-cbef91e6ae73.jpg.webp\" alt=\"PA Media Two young men stood outside in front of some trees. On the left, a man wearing a blue suit jacket and white shirt. he has short brown hair. On the right, a man in a grey suit jacket and white shirt with long curly brown hair\" /><span>PA Media</span></p></div><p></p><figcaption>Gabriel (left) and Sebastian Shemirani speaking to the media outside the court after the conclusion of the inquest into their sister's death</figcaption><p></p></figure><div><p>Her brothers, Gabriel and Sebastian Shemirani, did attend and said the state had \"failed\" by not classing their sister's death as an unlawful killing, despite recognising a breach in their mother's duty of care.</p><p>Gabriel told the inquest: \"I blame my mother entirely for my sister's death\", adding she had been \"obstructing\" his sister from receiving treatment.</p><p>The coroner noted the \"striking\" family dysfunction, which she said had been \"on display very publicly\" during the inquest.</p><p>\"The dynamics within the immediate family were complicated and dysfunctional at the time of Paloma's death,\" she said.</p></div><div><p><span>More on this story</span></p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mum's anti-chemotherapy views influenced Paloma Shemirani's death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b6c2/live/a9de5340-9fa7-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-02T14:59:54.000Z",
      "dateModified": "2025-10-02T14:59:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hamas military leader in Gaza objects to ceasefire plan, BBC understands",
    "url": "https://www.bbc.com/news/articles/c708v2q5r09o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1793/live/e66c1350-9fa8-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-02T10:54:37.000Z",
    "description": "<div><div><p>10 hours ago</p></div><p><span><p><span>Rushdi Abualouf</span><span>Gaza correspondent, Istanbul</span></p></span></p></div><div><p>Media",
    "body": "<div><div><p>10 hours ago</p></div><p><span><p><span>Rushdi Abualouf</span><span>Gaza correspondent, Istanbul</span></p></span></p></div><div><p>Mediators have made contact with the head of Hamas's military wing in Gaza, who has indicated he does not agree to the new US ceasefire plan, the BBC understands.</p><p>Izz al-Din al-Haddad is thought to believe the plan was designed to finish Hamas, whether the group accepts it or not, and so is determined to fight on.</p><p>US President Donald Trump's 20-point framework to end the war - which has already been accepted by Israel - stipulates that Hamas disarm and have no future role in governing Gaza.</p><p>It is thought that some of Hamas's political leadership in Qatar are open to accepting it with adjustments - but have found their influence limited as they do not have control of the hostages held by the group.</p></div><div><p>There are believed to be 48 hostages still being held in the Palestinian territory by the armed group, only 20 of whom are thought to be alive.</p><p>Another stumbling block for some in Hamas is that the plan requires them to hand over all of the hostages over the first 72 hours of the ceasefire - giving away their only bargaining chip.</p><p>Even with Trump's guarantee that Israel would abide by the terms, there is a lack of trust within the group that Israel would not resume its military operations once it had received the hostages - particularly after it <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cq5jl77ygv4o\">attempted to assassinate the Hamas leadership in Doha</a> in an air strike last month, in defiance of the US.</p></div><div><p>Some Hamas leaders are also thought to object to the deployment by the US and Arab states of what the plan describes as \"a temporary International Stabilisation Force\" to Gaza, which they view as a new form of occupation.</p><p>Additionally, a map of the proposed phased Israeli troop withdrawals from Gaza shared by the Trump administration shows what it refers to as a \"security buffer zone\" along Gaza's borders with Egypt and Israel.</p><p>It is unclear how this would be administered, but if Israel is involved it is also likely to be a point of contention.</p><p>Further, since agreeing to the plan on Monday evening, Israeli Prime Minister Benjamin Netanyahu has appeared to push back on several of the terms.</p><p>In a video shared on X, he insisted that the Israeli military would be able to remain in parts of Gaza and that Israel said it would \"forcibly resist\" a Palestinian state.</p><p>This goes against the terms of the US framework, which stipulates that Israeli forces would withdraw completely \"save for a security perimeter presence that will remain until Gaza is properly secure from any resurgent terror threat\".</p><p>It also says that once the plan is complete there may be a \"credible pathway to Palestinian self-determination and statehood\".</p><p>Hamas has previously said it would not disarm until a sovereign Palestinian state is established.</p><p>The Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.</p><p>At least 66,225 people have been killed in Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hamas military leader in Gaza objects to ceasefire plan, BBC understands",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1793/live/e66c1350-9fa8-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-02T10:54:37.000Z",
      "dateModified": "2025-10-02T10:54:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hackers say they have deleted children's pictures and data after nursery attack backlash",
    "url": "https://www.bbc.com/news/articles/c8rv83mrlyyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b0d0/live/7387ec40-9ef1-11f0-966a-39edada3cd47.jpg",
    "tag": "Trending",
    "date": "2025-10-01T23:01:12.000Z",
    "description": "<div><div><p>22 hours ago</p></div><p><span><p><span>Joe Tidy</span><span>Cyber Correspondent, BBC World Service</span></p></span></p></div><div><p>Ha",
    "body": "<div><div><p>22 hours ago</p></div><p><span><p><span>Joe Tidy</span><span>Cyber Correspondent, BBC World Service</span></p></span></p></div><div><p>Hackers who attempted to extort a nursery chain by posting stolen images and data about children on the darknet have removed the posts and claim to have deleted the information.</p><p>The criminals <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c62ldyvpwv9o\">began posting profiles</a> of the children to their website last Thursday, adding another 10 children days later and <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c07vxv8v89lo\">vowing to continue </a>until Kido Schools paid a ransom in Bitcoin.</p><p>The criminals also contacted parents directly with threatening phone calls whilst trying to get their ransom paid.</p><p>But public revulsion at their attack appears to have forced the criminals to backtrack.</p></div><div><p>First they blurred the images but kept the data up - now they have taken all the information offline, and apologised for their actions.</p><p>Their apparent change of heart has been met with scepticism by experts, who had previously condemned the targeting of nurseries as a \"new low\" for cyber-criminals.</p><p>\"This is more about pragmatism than morality,\" said cyber-security expert Jen Ellis.</p><p>\"These criminals are clearly shocked and worried by the attention their hack has caused and they are trying to protect themselves or their brand.\"</p></div><div><p>The hackers claim to have deleted everything they took - which included the private details and pictures of around 8,000 children as well as contact information for parents and carers.</p><p>\"All child data is now being deleted. No more remains and this can comfort parents,\" one of the cyber-criminals involved told the BBC.</p><p>It's understood Kido have not paid the hackers a ransom which was thought to be around £600,000.</p><p>Past cases have shown that hackers often say they have deleted stolen data and been found to have kept it or sold it on.</p><p>When the UK's National Crime Agency <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/technology-68344987\">took down the cyber crime gang LockBit</a> they discovered troves of data still on the criminal's servers that victims had paid to be deleted.</p><p>The nursery hackers, calling themselves Radiant, appear to be concerned that their hack has crossed an undefined moral line since the public outcry began against them.</p><p>\"We are sorry for hurting kids,\" the cyber-criminals told BBC News.</p><p>It's not known who the hackers or hacker are but they appear to be a new and possibly inexperienced group. </p><p>Their darknet site is newly created but they claim to have carried out other hacks in the past.</p><p>This isn't the first time that cyber-criminals have backtracked on an attack.</p><p>In 2020 a gang using Dopplepaymer ransomware gifted their encryption key to a German hospital after the <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/technology-54204356\">chaos contributed to the death</a> of an emergency care patient.</p><p>When <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/world-europe-57184977\">Conti hackers attacked the Irish Health Service</a> in 2021 they too gave their antidote away for free claiming not to have deliberately targeted hospitals.</p><p>Months before, criminals from the Darkside group took the strange decision to post proof that they had <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/technology-54591761\">donated some of their ill-gotten bitcoin</a> to charities.</p><p>The nursery hackers claimed they broke into the nursery's systems by buying access to one of Kido's staff computers which was compromised by a separate hacker.</p><p>In a common process, the \"initial access broker\" sold the Kido access to Radiant, which went on to further infiltrate Kido's systems and steal the data.</p><p>The majority of the downloaded material including the pictures of children was taken from Kido's account with Famly - a popular early years education platform . </p><p>Famly has rejected Kido's message to parents that the breach happened as a result of Famly being compromised.</p><p>It has stressed to the BBC that neither the security or infrastructure of the platform has been compromised at any point.</p><p>Kido did not respond to a request for comment about the way the hackers stole the data. </p><p>A spokesperson said only that: \"We recently identified and responded to a cyber incident. We are working with external specialists to investigate and determine what happened in more detail. </p><p>\"We swiftly informed both our families and the relevant authorities and continue to liaise closely with them.\"</p><p>Radiant says it paid the initial access broker money for access to Kido's system. </p><p>So with Kido refusing to pay and the hackers giving up their extortion attempt the criminals appear to have actually lost money in this cyber-attack.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hackers say they have deleted children's pictures and data after nursery attack backlash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b0d0/live/7387ec40-9ef1-11f0-966a-39edada3cd47.jpg"
      ],
      "datePublished": "2025-10-01T23:01:12.000Z",
      "dateModified": "2025-10-01T23:01:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " UK weather: Storm Amy amber warning issued by Met Office for rain, wind",
    "url": "https://www.bbc.com/weather/articles/cy042drenj8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg",
    "tag": "Trending",
    "date": "2025-10-02T10:27:26.000Z",
    "description": "<article><h2 id=\"main-heading\"><span>Amber warning issued for Storm Amy with 95mph winds </span></h2><div><figure><p><span><picture><source srcset=\"ht",
    "body": "<article><h2 id=\"main-heading\"><span>Amber warning issued for Storm Amy with 95mph winds </span></h2><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"Man walking along beach with dog in wind. Rough looking sea behind.\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg 976w\" /></picture></span><span><span>Image source, </span>Getty Images</span></p></figure></div><div><p><span>By</span><span><span>Simon King </span><span>Lead Weather Presenter</span></span><span><span> and </span><span>Elizabeth Rizzini</span><span>Lead Weather Presenter </span></span></p></div><div><p><span><span>Updated 9 hours ago</span></span></p></div><div><p><b>The Met Office has issued an </b><a target=\"_blank\" href=\"https://weather.metoffice.gov.uk/warnings-and-advice/uk-warnings#?date=2025-10-03&id=f789497e-02a0-461f-ac8a-11e47341d0c0\"><b>amber severe weather warning</b><span>, external</span></a><b> for Storm Amy - the first named storm of the season - which will hit the UK on Friday and Saturday.</b></p><p>The amber warning is in place for strong winds across western and northern Scotland from Friday evening until Saturday morning.</p><p><a target=\"_blank\" href=\"https://www.bbc.com/weather/warnings/weather\">Yellow severe weather warnings</a> for wind and rain are also in place between midday on Friday to midnight on Saturday.</p><p>Amy will move to the north-west of the United Kingdom bringing gusts up to 95mph (153 km/h). Gales are expected widely with heavy rain.</p><p>There is the possibility of damage and transport disruption into the weekend.</p></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png.webp 800w\" type=\"image/webp\"></source><img alt=\"Meteorological pressure chart of the North Atlantic and Europe showing a deep area of low pressure - named Storm Amy - to the west of Scotland on Friday\" src=\"https://ichef.bbci.co.uk/ace/standard/942/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/9570/live/baacc550-9ea6-11f0-9d1f-e7d83132d3ab.png 800w\" /></picture></span></p><figcaption><span>Image caption, </span><p>Storm Amy moves in to the UK on Friday</p></figcaption></figure></div><div><p>Thursday will bring a spell of wet and windy weather across Northern Ireland, Scotland and western parts of England and Wales.</p><p>Rain spreads in from the west, turning particularly heavy in western Scotland  and Northern Ireland where there are yellow Met Office warnings in force until midnight and 22:00 respectively.</p><p>Rainfall totals in western Scotland will be building with 30-50mm (1-2in) widely but up to 80mm (3in) in the north-west and over high ground. Northern Ireland will see 20-30mm (0.8 - 1in) of rain widely with as much as 40mm (1.6in) for higher ground.</p><p>Flooding and landslides are possible.</p><p>Gusts of 50mph (80 km/h) are expected around Irish Sea coasts.</p><p>It is Friday when things will get stormier.</p><p>During Friday afternoon Storm Amy will move close to Scotland with heavy rain and strong winds building across the UK leading to significant impacts for some.</p></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"An amber warning for strong winds covers northern and western Scotland is valid from 1700 on Friday till 0900 on Saturday\" src=\"https://ichef.bbci.co.uk/ace/standard/1920/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/b6d3/live/3a2b0d70-9f77-11f0-928c-71dbb8619e94.jpg 976w\" /></picture></span></p><figcaption><span>Image caption, </span><p>The amber warning for strong winds, which is the second highest level of alert comes into force at 1700 on Friday. It covers western and northern Scotland including the city of Inverness but not Aberdeen or the central belt.</p></figcaption></figure></div><p></p><h2 id=\"Damaging-winds\"><span>Damaging winds</span></h2><p></p><div><p>Within the amber warning area there could be gusts of wind of 60-70mph (97-113km/h) with exposed areas seeing gusts of perhaps 95mph (153 km/h).</p><p>Additionally across Scotland, parts of north-west England and North Wales a yellow severe weather warning for wind will come into force from 18:00 BST on Friday until 23:59 on Saturday.</p><p>A Met Office yellow severe weather warning for wind will come into force in Northern Ireland from 16:00 BST Friday to 06:00 Saturday.</p><p>Widespread gusts of 50-60mph (80 - 96 km/h) will be likely within the warning area but may reach up to 70mph (113 km/h) in some places for a time.</p><p>Exposed coasts and hills in northern and western Scotland could experience gusts as high as 80mph (129 km/h).</p><p>These will be damaging winds which could blow trees over.  As many trees are still in full leaf, they are more likely to be toppled with branches broken off than during the winter when the wind can whistle through them unimpeded.</p><p>Power cuts are possible.</p><p>There will also be transport disruption, particularly across Scotland with the possibility of cancelled ferries and restrictions on the road and rail network.</p><p>Flights from Scottish airports may also be delayed or cancelled.</p><p>The most destructive winds will ease during Saturday morning but it will remain very windy through the day.</p><p>Across the UK, gusts will widely be up to 40-55mph (64 - 89 km/h).</p><p>Even these lower wind speeds have the potential to bring further disruption during Saturday.</p></div><p></p><h2 id=\"Flooding-risk\"><span>Flooding risk</span></h2><p></p><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"Flooded road with a highway maintenance lorry and worker in hi vis outfit trying to clear drains for flood water to drain away.\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/b2be/live/d52120d0-9e91-11f0-9f70-63cdd409bfce.jpg 976w\" /></picture></span><span><span>Image source, </span>Getty</span></p><figcaption><span>Image caption, </span><p>Heavy rain will also sweep across the UK during Friday and lead to some localised flooding in parts</p></figcaption></figure></div><div><p>As well as strong winds, Amy will also bring some heavy rain on Friday.</p><p>In addition to the warnings for wind, there is a yellow Met Office warning for rain across much of Scotland from 12:00 BST to 23:59 Friday.</p><p>20-30mm (0.8-1in) of rain is expected widely with up to 50mm (2in) over some hilly areas in the south-west and Southern Highlands.</p><p>With rainfall totals building after spells of heavy rain through this week, there is the risk of further localised flooding.</p><p>The main area of rain will eventually move away to the south-east of the UK in the early hours of Saturday morning. </p><p>But though Saturday will still be very windy, there will be a mixture of sunny spells and showers. </p><p>Most of these showers will come in across northern and western parts of the UK.</p><p>By Sunday, Storm Amy will have moved further out into the North Sea so it will be drier with lighter winds for the second half of the weekend.</p><p>The next storm name will be Bram. A new list of names is issued every year by the Met Office before the season starts in September with both male and female names chosen by the public.</p><p>Storms can be named by either the Met Office, Met Éireann or the Netherlands weather service KNMI when impacts are forecast to be \"medium\" to \"high\". </p></div><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png.webp 976w\" type=\"image/webp\"></source><img alt=\"Thin, blue banner promoting the Cooler Than Me? weather game with text saying: \"Play: Cooler Than Me? The new guessing game from BBC Weather\"\" src=\"https://ichef.bbci.co.uk/ace/standard/1600/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/7785/live/bbd1cc70-9526-11f0-84c8-99de564f0440.png 976w\" /></picture></span></p></figure></div><div><p>Click <a target=\"_blank\" href=\"https://www.bbc.com/weather/articles/cwy5r7xwq8xo\">here</a> to play 'Cooler than me?'</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " UK weather: Storm Amy amber warning issued by Met Office for rain, wind",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7cda/live/0d2c2d20-9f7e-11f0-9ccd-4dc2d8fa5ad2.jpg"
      ],
      "datePublished": "2025-10-02T10:27:26.000Z",
      "dateModified": "2025-10-02T10:27:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ryder Cup: Rory McIlroy abuse \"crossed the line\" - PGA of America CEO Derek Sprague",
    "url": "https://www.bbc.com/sport/golf/articles/czrpxglden7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg",
    "tag": "Trending",
    "date": "2025-10-02T13:12:58.000Z",
    "description": "<div><article><h2 id=\"main-heading\"><span>PGA chief to apologise to McIlroy family over Ryder Cup abuse</span></h2><div><figure><p><span><picture><sou",
    "body": "<div><article><h2 id=\"main-heading\"><span>PGA chief to apologise to McIlroy family over Ryder Cup abuse</span></h2><div><figure><p><span><picture><source srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg.webp 976w\" type=\"image/webp\"></source><img alt=\"Rory McIlroy\" src=\"https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg\" srcset=\"https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 240w, https://ichef.bbci.co.uk/ace/standard/320/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 320w, https://ichef.bbci.co.uk/ace/standard/480/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 480w, https://ichef.bbci.co.uk/ace/standard/624/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 624w, https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 800w, https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg 976w\" /></picture></span><span><span>Image source, </span>Getty Images</span></p><figcaption><span>Image caption, </span><p>Rory McIlroy is ranked second in the world </p></figcaption></figure></div><div><p><span>By</span><span>Sean Kearns</span></p><p><span>BBC Sport</span></p></div><div><p><b>The abuse directed at Rory McIlroy and the rest of the European team at the Ryder Cup \"crossed the line\", says PGA of America chief executive Derek Sprague.</b></p><p>McIlroy was the main target of abuse at Bethpage as <a target=\"_blank\" href=\"https://www.bbc.com/sport/golf/live/cm28rg2z3j5t\">Europe held off a late comeback from the United States</a> to seal a 15-13 victory.</p><p>The abuse increased on day two of the tournament as Europe opened up a seven-point lead.</p><p>While McIlroy was subjected to verbal abuse, his <a target=\"_blank\" href=\"https://www.bbc.com/sport/golf/articles/c1jzkjkd283o\">wife Erica was hit by a drink thrown by an American fan on the 17th tee.</a></p><p>\"It's unfortunate that people crossed the line last week,\" Sprague told the <a target=\"_blank\" href=\"https://www.nbcsports.com/golf/news/q-a-with-pga-ceo-derek-sprague-on-ryder-cup-fans-bethpages-future\">Golf Channel.<span>, external</span></a></p><p>\"There's no place for that at the Ryder Cup, no place for it in the game of golf and we are not happy with what happened last week.\"</p></div><div><p>McIlroy described the abuse as \"unacceptable\" and said it should be \"off-limits\". </p><p>Sprague says he plans on apologising to McIlroy and his family.</p><p>\"I haven't spoken to Rory or Erica [McIlroy] but I do plan on sending them an email with my heartfelt apologies because of what occurred,\" he said. </p><p>McIlroy suffered lengthy abuse before eventually snapping by swearing at a spectator that called out while he was addressing the ball. </p><p>\"I chirped back because it got to me a few times, but we tried to handle everything that came our way with class and poise, and for the most part, I felt like we did that,\" said McIlroy. </p><p>\"It was a rough week for all of us. But at the same time, we shut them up by our performance.\"</p><p>On Monday, Europe captain <a target=\"_blank\" href=\"https://www.bbc.com/sport/golf/articles/cx2x4v79yv1o\">Luke Donald told BBC Sport</a> that many Americans had told him \"how embarrassed they were for some of their fans\", and that this issue \"needs to be addressed\".</p></div></article></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ryder Cup: Rory McIlroy abuse \"crossed the line\" - PGA of America CEO Derek Sprague",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a072/live/5e67bca0-9f8c-11f0-a934-075243299099.jpg"
      ],
      "datePublished": "2025-10-02T13:12:58.000Z",
      "dateModified": "2025-10-02T13:12:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer vows to protect Jewish communities after Manchester synagogue attack",
    "url": "https://www.bbc.com/news/articles/czrpxgk6x68o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/47c8/live/d37a6010-9fcd-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-02T20:26:24.000Z",
    "description": "<article><div><div><p>50 minutes ago</p></div><p><span><p><span>Ewan Somerville</span><span></span></p></span></p></div><p></p><figcaption>Watch: Brit",
    "body": "<article><div><div><p>50 minutes ago</p></div><p><span><p><span>Ewan Somerville</span><span></span></p></span></p></div><p></p><figcaption>Watch: Britain must defeat 'rising hatred' PM says</figcaption><p></p><div><p>Sir Keir Starmer has promised to do \"everything\" in his power to protect Jewish people as he said Britain must defeat antisemitic hate.</p><p>The prime minister was speaking after two people were killed in a car and stabbing attack at the Heaton Park Synagogue in Crumpsall, north Manchester, on Thursday.</p><p>Condemning the \"vile individual\" who carried out the \"horrific\" attack, on the holiest Jewish day of Yom Kippur, Sir Keir offered his condolences to the victims and their families and thanked the first responders.</p><p>Greater Manchester Police said four other people remain in hospital. </p><p>The attacker, who has been named as 35-year-old Jihad Al-Shamie, was shot dead by police at the scene.</p></div><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/live/cx2703lnww4t\">Follow live updates on this story</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cd63p1djgd7o\">What we know about Manchester synagogue attack</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/videos/cy4jegwzedxo\">BBC Verify: What online footage tells us</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cn0rp05ykx7o\">Eyewitnesses describe 'horrendous' scene</a></li></ul></div><div><p>Police say three suspects are currently in custody and have been arrested on suspicion of commission, preparation and instigation of acts of terrorism. They are two men in their 30s and a woman in her 60s.</p><p>In a recorded message to Jewish people, Sir Keir said: \"I know how much fear you will be holding inside of you. I really do... Nobody should have to do that. Nobody.</p><p>\"And so I promise you that I will do everything in my power to guarantee you the security that you deserve, starting with a more visible police presence, protecting your community.</p><p>\"I promise you that over the coming days, you will see the other Britain, the Britain of compassion, of decency, of love.\"</p><p>He added that hatred against Jews \"is rising once again, and Britain must defeat it once again\", as he reflected on the history of Jews seeking refuge in the UK.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e56a/live/e3c69f60-9fb4-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"Getty Images Members of the Jewish community embrace each other as they stand next to police officers outside Heaton Park Synagogue in Manchester following the attack.\" /><span>Getty Images</span></p></div><p></p><figcaption>Members of the public and congregants were solemn outside the Heaton Park Synagogue on Thursday afternoon</figcaption><p></p></figure><div><p>The prime minister flew back to the UK early from the European Political Community summit in Denmark on Thursday to <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/crrqkv802xzo\">chair a meeting of the government's emergency Cobra committee</a> and respond to the attack.</p><p>Many national figures and community leaders have issued statements as the <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/live/cx2703lnww4t\">gravity of what happened becomes clear</a>.</p><p>King Charles III said in a statement that he and Queen Camilla were \"deeply shocked and saddened\" to hear about the attack, \"especially on such a significant day for the Jewish community\".</p><p>\"Our thoughts and prayers are with all those affected by this appalling incident and we greatly appreciate the swift actions of the emergency services,\" the statement added.</p><p>Israeli Prime Minister Benjamin Netanyahu condemned the \"barbaric terror attack\".</p><p>\"Our hearts are with the families of the murdered, and we pray for the swift recovery of the wounded.</p><p>\"As I warned at the UN: weakness in the face of terrorism only brings more terrorism. Only strength and unity can defeat it.\"</p></div><div><p>The Israeli embassy in the UK said it was \"in close contact\" with the Manchester Jewish community, the authorities and Jewish charity the Community Security Trust (CST) to \"ensure that the necessary support is provided\".</p><p>Thanking the police and synagogue security for their response, the CST said it was an \"appalling attack on the holiest day of the Jewish year\" and it was working with the police and local Jewish community.</p><p>Yom Kippur is a day of fasting and atonement and is believed to be the day God seals the fate of each person for the coming years. It is a day set aside for prayer and reflection, when work is forbidden and many attend synagogue services even if they do not do so regularly.</p><p>The Board of Deputies of British Jews and the Jewish Leadership Council said: \"We are devastated at the loss of two members of our Jewish community, and our thoughts are with their families, those who are injured and receiving treatment, and all those who have been affected by this act of antisemitic terror.\"</p><p>It was a sentiment echoed by Imam Qari Asim, co-chairman of the British Muslim Network, who said the scenes in Manchester had \"no place in our society\" and \"antisemitism in all its forms is totally unacceptable\".</p><p>\"The bloodshed and violence in the Middle East - which is excruciatingly painful to witness for all of us - must not be allowed to poison our streets in Britain,\" he said. </p><p>And Allama Qamaruzzaman AzmI, chief imam of Anwaar ul Haramain Jamé Masjid in north Manchester, said \"we stand in solidarity with our Jewish neighbours and community\" and he was \"committed\" to strengthening the bond between them.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/37cd/live/d9b66b40-9fa0-11f0-8e4d-7723b0da5e04.jpg.webp\" alt=\"Reuters A man stands with his arm round another person, in a crowd of people standing next to police tape. A lot of their faces cannot be seen\" /><span>Reuters</span></p></div><p></p><figcaption>People had gathered at the scene</figcaption><p></p></figure><div><p>Meanwhile, the Church of England's leader, Archbishop of York Stephen Cottrell, said he was praying that \"all may live alongside each other in harmony and respect\".</p><p>The Bishop of Manchester, the Rt Rev Dr David Walker, said he feared an increase in divisive rhetoric recently in the UK and elsewhere in the world which should not be allowed \"to get ahead of our humanity\".</p><p>He said \"short-term political gain is no excuse for long-term damage to the fabric of our communities\".</p></div><p></p><h2>'It was a matter of when, not if'</h2><p></p><div><p>Figures from across the political spectrum have condemned the attack.</p><p>Mayor of Greater Manchester Andy Burnham said on X: \"We condemn whoever is responsible and will do everything within our power to keep people safe. We stand with GM's Jewish community at this time and will work through the day to support them.\"</p><p>Alex Hearn, co-director of Labour Against Antisemitism, told BBC News: \"Many Jews understood it was never 'if' an attack like this was going to happen, it was 'when', because attacks against Jews have spiralled out of control and some mass attacks have already been foiled by the security services.\"</p><p>But he said there was \"a lot of anger\" about what he said was \"very little action\" over anti-Jewish hate being allowed to \"flourish\" and \"take root in institutions\". He said synagogues and Jewish schools, including primary schools, have needed security \"for a long time\".</p><p>Asked about the synagogue attack in Manchester, Tory leader Kemi Badenoch told the BBC it looks like \"an outrageous attack on the Jewish community on their holiest day\" - calling it \"vile and disgusting\".</p><p>Liberal Democrat leader Sir Ed Davey said he was \"horrified and appalled\" and that his \"thoughts are with the victims\".</p><p>Reform UK leader Nigel Farage said he was \"horrified\" and thinking of the Jewish community \"who will be suffering at this time\".</p><p>Green Party leader Zack Polanski said \"so many of us are feeling the horrific scenes today that all come at a time of rising antisemitism\", having himself \"grew up and attended a synagogue in north Manchester\".</p></div><div><p><span>More on this story</span></p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer vows to protect Jewish communities after Manchester synagogue attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/47c8/live/d37a6010-9fcd-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-02T20:26:24.000Z",
      "dateModified": "2025-10-02T20:26:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How much time could Diddy spend in prison? ",
    "url": "https://www.bbc.com/news/articles/c80g93ryklno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/33e8/live/807f3950-9f8a-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-02T12:29:08.000Z",
    "description": "<div><p>A year after federal prosecutors unveiled a sweeping criminal case against Sean \"Diddy\" Combs and months after a trial that revealed shocking ",
    "body": "<div><p>A year after federal prosecutors unveiled a sweeping criminal case against Sean \"Diddy\" Combs and months after a trial that revealed shocking details of violence and his private life, the convicted music mogul will learn his sentence. </p><p>He could face up to two decades behind bars, but his attorneys are battling for a more lenient sentence that could see Combs freed in a matter of weeks – or acquitted. </p><p>In July, a jury acquitted him of the most severe charges: racketeering and sex trafficking. But he was found guilty of two counts of transportation to engage in prostitution. Each count carries a maximum sentence of 10 years in prison.</p><p>Prosecutors have asked for a minimum of 11 years, but Combs' lawyers have argued that such a sentence would be a dramatic overreach. </p><p>\"In plain terms, prosecutors want to see Diddy defined by the worst-case math, while the defence wants the judge to cut through it and impose something far lighter,\" said Todd Spodek, a New York attorney who once represented fake heiress Anna Sorokin.</p></div><div><p>Federal judges ultimately decide on a final punishment and they have flexibility within guidelines - so the defence and prosecution will spend much of Friday arguing in court over Combs' sentence.</p><p>\"It's like bargaining for anything,\" Mr Spodek said. \"There's the benchmark, there's the number in the middle, and it goes up and goes down.\"</p><p>A probation office, which oversees offenders during and after incarceration,  separately recommended five to seven years in prison, according to Combs' court filings. </p><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/cd9yv4vzy7lo\">Cassie Ventura says she fears for her safety ahead of Diddy sentencing</a></li><li><a target=\"_blank\" href=\"https://www.bbc.com/news/videos/c9wykxlk2zpo\">Could Sean 'Diddy' Combs stage a comeback?</a></li></ul><p>But \"ultimately, the judge decides,\" Mr Spodek said. </p><p>A major question looming over the sentencing is how much Combs' conduct towards the victims will factor into New York federal judge Arun Subramanian's thinking.</p><p>While Combs will be sentenced on two prostitution charges, prosecutors have reminded the judge of his past behavior, which came out during testimony and included violence, domestic abuse, and illegal drug use.</p><p>Combs, they argue, is \"unrepentant.\"</p><p>\"The defendant tries to recast decades of abuse as simply the function of mutually toxic relationships,\" prosecutors wrote in a 29 September filing. \"But there is nothing mutual about a relationship where one person holds all the power and the other ends up bloodied and bruised.\"</p><p>His most high-profile victim, Cassandra Ventura, submitted a letter to the judge ahead of sentencing asking for justice and accountability. She said she moved her family away from New York City fearing retaliation.</p><p>\"As much progress as I have made in recovering from his abuse, I remain very much afraid of what he is capable of and the malice he undoubtedly harbours towards me for having the bravery to tell the truth,\" Ms Ventura wrote.</p><p>Combs' team, however, has portrayed him as a reformed man who should receive a sentence of no more than 14 months in prison. His time in jail while the case played out would count towards that total, meaning if the judge agrees, Combs would soon walk free.</p><p>A longer sentence, Combs' lawyers argue, would unfairly keep him from his seven children and elderly mother, and prevent him from receiving mental health care. In court filings, lawyers described Combs' incarceration as \"life changing, productive, and a testament to his desire to return to his family and community and lead the best life possible.\"</p><p>Judges can consider history, character, contributions to society, and previous criminal record during sentencing. </p><p>Combs' lawyers cited examples of his business and the music success as evidence of his contributions. His team also submitted testimonials from family members, and other detainees at the jail where Combs is held. </p><p>In the event that Combs receives an unfavourable sentence, his legal team could appeal the judge's decision to a higher court.</p></div><div><p>Combs' lawyers are making an additional bid to free him at the sentencing hearing: challenging the use of the anti-prostitution law that forms the basis for the charges and conviction.</p><p>Last week, Combs' lawyers asked the judge to consider an acquittal or new trial, citing objections over the Mann Act.</p><p>The 1910 law has a controversial history. It originally was an anti-interstate sex law that included a sweeping immorality clause; in practice, it could be applied broadly, covering interracial marriage and affairs. In the 1980s, Congress modernised it, and the law now forms a foundation for federal prostitution and sex trafficking cases. Most recently, prosecutors used it in cases against singer R Kelly, and Jeffrey Epstein's associate Ghislaine Maxwell.</p><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c5yllvjgpk6o\">After Diddy: Why hip-hop is still struggling to have its own 'MeToo' moment</a></li><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c0qz32wzeego\">What has Sean 'Diddy' Combs been convicted of?</a></li></ul><p>Combs' lawyers argue Mann Act-related charges \"should never have been brought\" because the sexual encounters Combs engaged in were consensual, and they believe his conduct did not amount to \"prostitution.\"</p><p>A Mann Act charge is \"an easier case to make in a court of law than perhaps a trafficking conviction, which requires more elements,\" said Jessica Pliley, a historian at the University of Texas and Mann Act expert. </p><p>Prosecutors, like the ones handling the Combs case, often pair them. \"It's not an uncommon law,\" Professor Pliley said.</p><p>But prosecutors have reminded the judge of accounts from Ms Ventura and a woman referred to as Jane Doe. In filings, they recalled the women's testimony about participating in lengthy \"freak-off\" sessions with Combs and male escorts he requested, even when they felt coerced and suffered physically from the lengthy encounters.</p><p>\"Defendants who perpetrate violations of the Mann Act involving such violence and fear regularly face significant penalties,\" prosecutors wrote in a sentencing memo. </p><p>\"The defendant should be no exception—particularly when his history and characteristics demonstrate years of abuse and violence.\"</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How much time could Diddy spend in prison? ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/33e8/live/807f3950-9f8a-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-02T12:29:08.000Z",
      "dateModified": "2025-10-02T12:29:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]