[
  {
    "title": "The Taliban rift at the top of the leadership in Afghanistan",
    "url": "https://www.bbc.com/news/articles/cg7vdpy1l2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e7c/live/3442e220-f1f7-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-15T06:05:57.000Z",
    "description": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown10 hours agoBBC AfghanAFP via Getty ImagesIt was a piece of audio obtai",
    "body": "Rift at top of the Taliban: BBC reveals clash of wills behind internet shutdown10 hours agoBBC AfghanAFP via Getty ImagesIt was a piece of audio obtained by the BBC that revealed what worries the Taliban's leader most.Not an external danger, but one from within Afghanistan, which the Taliban seized control of as the previous government collapsed and the US withdrew in 2021.He warned of \"insiders in the government\" pitted against each other in the Islamic Emirate the Taliban set up to govern the country.In the leaked clip, the supreme leader Hibatullah Akhundzada can be heard giving a speech saying that internal disagreements could eventually bring them all down.\"As a result of these divisions, the emirate will collapse and end,\" he warned.Javid Ashna / Middle East Images / AFP via Getty ImagesSupreme leader Hibatullah Akhundzada (centre) has \"absolute power\", his spokesman said - but ministers including Sirajuddin Haqqani (left) and Mohammad Yaqoob (right) have questioned decisionsThe speech, made to Taliban members at a madrassa in the southern city of Kandahar in January 2025, was more fuel to the fire of rumours which had been circulating for months - rumours of differences at the very top of the Taliban.It is a split the Taliban leadership has always denied - including when asked directly by the BBC.But the rumours prompted the BBC's Afghan service to begin a year-long investigation into the highly secretive group - conducting more than 100 interviews with current and former members of the Taliban, as well as local sources, experts and former diplomats.Because of the sensitivity over reporting this story, the BBC has agreed not to identify them for their safety.Now, for the first time, we have been able to map two distinct groups at the very top of the Taliban - each presenting competing visions for Afghanistan.One entirely loyal to Akhundzada, who, from his base in Kandahar, is driving the country towards his vision of a strict Islamic Emirate - isolated from the modern world, where religious figures loyal to him control every aspect of society.And a second, made up of powerful Taliban members largely based in the capital Kabul, advocating for an Afghanistan which - while still following a strict interpretation of Islam - engages with the outside, builds the country's economy, and even allows girls and women access to an education they are currently denied beyond primary school.One insider described it as \"the Kandahar house versus Kabul\".But the question was always whether the Kabul group, made up of Taliban cabinet ministers, powerful militants and influential religious scholars commanding the support of thousands of Taliban loyalists, would ever challenge the increasingly authoritarian Akhundzada in any meaningful way, as his speech suggested.After all, according to the Taliban, Akhundzada is the group's absolute ruler - a man only accountable to Allah, and not someone to be challenged.Then came a decision which would see the delicate tug of war between the most powerful men in the country escalate into a clash of wills.Listen: Audio obtained by the BBC of Taliban supreme leaderIn late September, Akhundzada ordered the internet and phones to be shut off, severing Afghanistan from the rest of the world.Three days later the internet was back, with no explanation of why.But what had happened behind the scenes was seismic, say insiders. The Kabul group had acted against Akhundzada's order and switched the internet back on.\"The Taliban, unlike every other Afghan party or faction, is remarkable for its coherence – there have been no splits, not even much dissent,\" explains an expert on Afghanistan, who has been studying the Taliban since they were established.\"Bound into the movement's DNA is the principle of obedience to one's superiors, and ultimately to the Amir [Akhundzada]. That's what made the act of turning the internet back on, against his explicit orders, so unexpected, and so notable,\" the expert said.As one Taliban insider put it: this was nothing short of a rebellion.A man of faithOnly two confirmed pictures of Akhundzada exist; this one, showing the supreme leader on the left, has been verified by BBC AfghanHibatullah Akhundzada did not begin his leadership like this.Indeed, sources say he was chosen as the Taliban's supreme leader in 2016 in part because of his approach of building consensus.Lacking battlefield experience himself, he found a deputy in Sirajuddin Haqqani - the feared militant commander, then one of the US's most wanted men with a $10m (£7.4m) bounty on his head.A second deputy was found in Yaqoob Mujahid, Taliban founder Mullah Omar's son – young, but bringing with him his Taliban bloodline, and its potential to unify the movement.The arrangement continued throughout negotiations with Washington in Doha to end the 20-year war between Taliban fighters and US-led forces. The eventual agreement, in 2020, resulted in the sudden and dramatic recapturing of the country by the Taliban, and the chaotic withdrawal of US troops in August 2021.Los Angeles Times via Getty ImagesThe unexpected fall of Kabul in August 2021 saw thousands rush to the airport in the hope of being evacuated with US and other troops as they withdrewTo the outside world, they were a united front.But both deputies would find themselves quietly demoted to ministers as soon as the Taliban returned to power in August 2021, with Akhundzada now a lone power centre, insiders told the BBC.Even Abdul Ghani Baradar - the powerful and influential co-founder of the Taliban who had led negotiations with the US - found himself in the role of deputy prime minister instead of prime minister as many had expected.Instead, Akhundzada - having shunned the capital where the government sits in favour of remaining in Kandahar, a base of power for the Taliban - began surrounding himself with trusted ideologues and hardliners.Other loyalists were given control of the country's security forces, religious policies and parts of the economy.\"[Akhundzada], from the outset, sought to form his own strong faction,\" a former Taliban member - who later served in Afghanistan's US-backed government - told the BBC.\"Although he lacked the opportunity at first, once he gained power, he began doing so skilfully, expanding his circle using his authority and position.\"Akhundzada has filled his cabinet with loyalists in line with his vision, but those considered the \"Kabul group\" maintain their positions. Here, arguably the most influential members of each group are shownEdicts began to be announced without consultation with Kabul-based Taliban ministers, and with little regard for public promises made before they took power, on issues like allowing girls access to education. The ban on education, along with women working, remains one of the \"main sources of tension\" between the two groups, a letter from a UN monitoring body to the Security Council noted in December.Meanwhile, another insider told the BBC that Akhundzada, who had started out as a judge in the Taliban's Sharia courts of the 1990s, was becoming \"even more rigid\" in his religious beliefs.Akhundzada's ideology was already such that he not only knew but approved of his son's choice to become a suicide bomber, according to two Taliban officials after his death in 2017.And he is convinced that making the wrong decision could have implications beyond his lifetime, the BBC has been told.\"Every decision he makes he says: I'm accountable to Allah, on judgement day, I will be questioned why I didn't take an action,\" one current Taliban government official explained.Two people who have been in meetings with Akhundzada described to the BBC how they were faced with a man who barely spoke, choosing to communicate mainly through gestures, interpreted through a team of elderly clerics in the room.In more public settings, other eyewitnesses said he obscures his face - covering his eyes with a scarf draped over his turban, and often standing at an angle when addressing an audience. Photographing or filming Akhundzada is forbidden. Only two photos of him are known to exist.Getting a meeting has also become increasingly difficult. Another Taliban member told the BBC how Akhundzada used to hold \"regular consultations\", but now \"most Taliban ministers wait for days or weeks\". Another source told the BBC the Kabul-based ministers have been told to \"travel to Kandahar only if they receive an official invitation\".At the same time, Akhundzada was moving key departments to Kandahar - including distribution of weapons, which had previously come under the control of his former deputies Haqqani and Yaqoob.In its December letter, the UN monitoring team noted Akhundzada's \"consolidation of power has also involved a continued build-up of security forces under the direct control of Kandahar\".Reports suggest Akhundzada issues direct orders all the way down to local police units - bypassing ministers in Kabul.One analyst argues the result is that \"real authority has been transferred to Kandahar\" - something Taliban spokesman Zabihullah Mujahid denied to the BBC.\"All the ministers have their power in their ministerial framework, undertaking daily works and making decisions - all the powers are delegated to them and they carry out their duties,\" he said.However, \"from a Sharia perspective, he [Akhundzada] has the absolute power\", Mujahid added - saying \"to avoid God-forbidden division, his decisions are final\".Men 'who have seen the world'APKabul (pictured) is the capital, and the seat of government for AfghanistanAmong the Kabul group, unhappiness was growing and alliances were strengthening.\"They [the Kabul group] are people who have seen the world,\" one analyst told the BBC. \"Therefore, they believe that their government, in its current form, cannot last.\"The Kabul group want to see an Afghanistan which moves towards the model of a Gulf state.They are concerned about the concentration of power in Kandahar, the nature and enforcement of virtue laws, how the Taliban should engage with the international community and women's education and employment.But despite advocating for Afghan women to have more rights, the Kabul group is not described as moderate.Instead, insiders see them as \"pragmatic\", unofficially led by Baradar - the Taliban founding member who still commands great loyalty. He is also thought to be the \"Abdul\" referred to by Donald Trump as the \"head of the Taliban\" during a 2024 US presidential election campaign debate. In fact, he was the group's chief negotiator with the US.The Kabul group's shifting positions have not gone unnoticed.\"We remember that they [the Taliban leaders based in Kabul] used to destroy television sets, but now they appear on TV themselves,\" one analyst said.They also understand the power of social media.Former deputy Yaqoob - whose father led the Taliban during its first rule, when music and television were banned - finds himself increasingly popular with young Taliban members and some ordinary Afghans, evident in gushing TikTok videos and merchandise adorned with his face.But no one has been more effective in rebranding themselves than his fellow former deputy, Sirajuddin Haqqani. His ability to evade capture as his network orchestrated some of the most lethal and sophisticated attacks in the Afghan war against US-led forces - including a 2017 truck bombing in Kabul which killed more than 90 civilians near the German embassy - elevated him to near-mythical status among supporters.During this time, only one known photograph of him existed - taken by a BBC Afghan journalist.FBIThe bounty on Sirajuddin Haqqani - pictured in his wanted FBI poster, before the Taliban returned to power - was dropped last yearBut then, six months after the US withdrawal, Haqqani marched out in front of the world's cameras at a graduation ceremony of police officers in Kabul, his face uncovered.It was the first step towards a new image: no longer a militant, but a statesman - one with whom the New York Times would sit down in 2024 and ask: is he Afghanistan's best hope for change?Just a few months later, the FBI would quietly drop the $10m bounty on his head.Yet analysts and insiders repeatedly told the BBC that openly moving against supreme leader Akhundzada was unlikely.Arguably the most visible opposition to his edicts had been minor and limited - for example not enforcing regulations like the ban on shaving beards in regions controlled by Kabul group-aligned officials. But larger acts of rebellion have always been considered unthinkable.One former Taliban member emphasised to the BBC that \"obedience to [Akhundzada] is considered mandatory\".Haqqani himself, in his interview with the New York Times, played down any chance of an open split. \"Unity is important for Afghanistan currently so we can have a peaceful country,\" he said.Instead, one analyst said, the Kabul group is choosing to send \"a message to both the international community and Afghans\", one which says: \"We are aware of your complaints and concerns, but what can we do?\"At least, that was the case before the order came to shut down the internet.A breaking pointAFP via Getty ImagesThe internet switch-off began in carefully selected provinces and then expanded to the whole country in late SeptemberThe Taliban's supreme leader is a man with a deep distrust of the internet; he believes its content to be against Islamic teachings, and is so dedicated to his belief that an aide reads out the latest news or social media posts to him each morning instead, his spokesman once explained to the BBC.The Kabul group believe that a modern country cannot survive without it.The supreme leader's internet shutdown order began in provinces controlled by Akhundzada's allies, before it was expanded to the whole country.Sources close to the Kabul group and within the Taliban government described what happened next - an almost unprecedented moment in the Taliban's history.\"It surprised many members of the movement,\" one source said.In short, the Kabul group's most powerful ministers came together and convinced  Kabul-based Prime Minister Mullah Hassan Akhund to order it switched back on.In fact, the group had already made its unhappiness with the edict known before the internet was cut across the country: the group's de-facto leader, Baradar,  travelled to Kandahar to warn one of Akhundzada's most loyal governors that they needed to \"wake him up\" - adding they had to stop being the supreme leader's \"yes\" men.\"You don't tell him the truth openly; whatever he says, you just implement,\" he was reported as saying by a Kandahar insider.His words, the source said, were dismissed. On Monday, 29 September, an order came into the telecommunications ministry directly from the supreme leader to shut everything down. \"No excuses\" would be accepted, a source in the ministry told the BBC.On Wednesday morning, a group of Kabul group ministers - including Baradar, Haqqani and Yaqoob - gathered at the prime minister's office, joined by the telecommunications minister. Here, they urged the Kandahar-aligned prime minister to take charge and reverse the order. According to one source, they told him the full responsibility lay with them.It worked. The internet returned.But perhaps more importantly, within those few days, it was as if what Akhundzada had hinted at in that speech months earlier had come to pass: insiders were threatening Taliban unity.AFP via Getty ImagesThe decision to reverse the order took many by surprise - including Kabul group supportersBut why this order? One expert points out Taliban members have been happy to follow Akhundzada despite disagreeing with edicts like the ones on girls' education.Meanwhile, many of those who had challenged him openly before had paid a price.In February 2025, the then-deputy foreign minister had to flee the country after warning publicly the leadership was straying from \"the path of God\" in \"committing injustice against 20 million people\" - a reference to the female education ban.UN monitors point to at least two others who have been arrested after questioning Akhundzada's decrees on girls' education, in July and September 2025.But there is also evidence of Akhundzada and his allies moving to keep figures like Haqqani close - despite the latter's public criticisms of the supreme leader's consolidation of power.Even so, tipping over from words into actions and so decisively disregarding an order was arguably another step all together.As one expert points out, this time it may have been worth the risk.Their positions come with power and an \"ability to make money\", the expert says. But both depended on the internet, now crucial to both governing and commerce.\"Turning off the internet threatened their privileges in a way that keeping older girls out of education never did,\" the expert points out.\"Maybe that's why they were 'brave' that one time.\"APBeyond primary school, girls and women are denied an education under the TalibanAfter the internet was turned back on, speculation was rife about what would happen next.A source close to the Kabul group suggested the ministers will be slowly removed or demoted.However, the Kandahar insider suggested it might be the supreme leader who backed down \"because he fears such opposition\".As the year drew to an end, it appeared publicly that nothing had changed.The letter to the UN Security Council noted some UN member states \"have downplayed the division between leaders in Kandahar and Kabul as akin to a family dispute that would not alter the status quo; all senior leaders are invested in the success of the Taliban enterprise\".Zabiullah Mujahid, the senior Taliban government spokesman, has categorically denied any split.\"We will never allow ourselves to be divided,\" he told the BBC in early January 2026. \"All officials and leadership know that a split can be harmful for all, for Afghanistan, religiously prohibited and forbidden by Allah.\"However, he did also acknowledge that differences in \"opinion\" exist among Taliban members, but equated it to \"a difference of opinion in a family\".Half way through December, those \"differences\" had appeared to surface once more.Haqqani was filmed addressing a crowd in his home province of Khost during Friday prayers, warning that anyone who \"gets to power through the nation's trust, love and faith and then abandons or forgets the same nation... is not a government\".The same day, Akhundzada loyalist Neda Mohammad Nadem - the higher education minister - made his own speech to graduating students at a madrassa in a neighbouring province.\"Only one person leads and the rest follow orders, this is a true Islamic government,\" he said. \"If there are too many leaders then problems will emerge and this government that we have achieved will be ruined.\"After the dispute over the internet, these recent comments are set against a very different backdrop to those made by Akhundzada in the leaked audio at the start of 2025.Yet whether 2026 will be the year that the Kabul group move to make meaningful change for the women and men of Afghanistan is very much still up for debate.\"As ever… the question remains after apparent disagreement within the Emirate's top tier – will words ever lead to action?\" says one expert.\"They haven't yet.\"Edited and produced by Zia Shahreyar, Flora Drury and the BBC Afghan Forensics team. Top image shows two members of the Taliban looking out over Kabul in January 2022. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Taliban rift at the top of the leadership in Afghanistan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e7c/live/3442e220-f1f7-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-15T06:05:57.000Z",
      "dateModified": "2026-01-15T06:05:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Badenoch sacks Jenrick! - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mv4h6s?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-15T14:56:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·15 Jan 2026,·33 minsAvailable for over a yearKemi Badenoch has sensationally sacked shadow minister Robert Jenrick claiming he was secretly plotting to defect from the party in a way that was “as damaging as possible”. \nReform has refused to confirm if Jenrick was planning to defect, although party leader Nigel Farage has said he ‘might’ buy him a sympathy pint. While Labour and the Lib Dems have been quick off the mark to take advantage of the political unrest by creating memes. \nAdam and Laura are joined from Westminster by Henry Zeffman and Alex Forsyth to break down what we know. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producers were Joe Wilkinson and Gabriel Purcell-Davis. The technical producers were Ben Andrews and Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Badenoch sacks Jenrick! - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-15T14:56:00.000Z",
      "dateModified": "2026-01-15T14:56:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Trump v China: How Oil Is Defining Great Power Politics (Professor Helen Thompson) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002pqpq?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2026-01-15T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·15 Jan 2026,·60 minsAvailable for over a yearThe capture of Venezuela’s Nicolás Maduro by the United States feels like confirmation that we are in a new era of global politics, but what has caused this shift and where does it leave Europe?  \nAmol speaks to Professor Helen Thompson, an expert on the history of globalisation and author of Disorder: Hard Times in the 21st Century, about how oil is fuelling competition between the US and China. \nThey explore how it’s reshaping global power politics, whether it's possible for Europe to decouple from the US and why high levels of national debt threaten to undermine Western economies. \nAnd Helen, who is Professor of Political Economy at the University of Cambridge, explains why she thinks there is a case for potentially reversing the independence of central banks like the US Federal Reserve and the Bank of England to give politicians more control. \n(00:05:11) What is the Western Hemisphere?\n(00:07:45) The importance of Venezuela\n(00:11:05) How and why Washington is putting pressure on China\n(00:19:30) Why Trump is inspired by the US in the late 19th century\n(00:25:08) The rules based international order\n(00:29:00) Where does Europe fit into this new world?\n(00:30:52) Can Europe break away from the US?\n(00:33:30) Oil and the Western Economic Crisis\n(00:37:40) How is oil effecting power politics today?\n(00:40:40) What about renewable energy?\n(00:43:58) The coming debt emergency\n(00:46:30) Helen's RADICAL ideas\n(00:56:02) Amol's reflections\nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Jonny Hall. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Trump v China: How Oil Is Defining Great Power Politics (Professor Helen Thompson) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2026-01-15T06:00:00.000Z",
      "dateModified": "2026-01-15T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New rules make it easier to call up reservists for war",
    "url": "https://www.bbc.com/news/articles/c4grjxl4w06o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2e26/live/a319e240-f1e6-11f0-b373-d7bde4e9f067.png",
    "tag": "Trending",
    "date": "2026-01-15T12:42:48.000Z",
    "description": "4 hours agoHenry Zeffman,Chief Political CorrespondentandJennifer McKiernan,Political reporterPA MediaThe government is to announce new powers making ",
    "body": "4 hours agoHenry Zeffman,Chief Political CorrespondentandJennifer McKiernan,Political reporterPA MediaThe government is to announce new powers making it easier to mobilise tens of thousands of former armed forces personnel to prepare for war.New rules will mean reservists remain on call for an extra decade, and lower the threshold for them being called into service.Russia's invasion of Ukraine and the election of US President Donald Trump have put pressure on the government to ramp up defence spending and readiness for action.Labour has pledged to increase defence spending, but the government has not denied reports that the Chief of the Defence Staff Sir Richard warned the prime minister and chancellor about a £28bn shortfall forecast for spending plans just before Christmas.Legislation on the armed forces containing the changes will be published in parliament later, with some parts seen by ministers as a crucial part of the conversation about Britain's readiness for conflict.The measures affect the segments of the armed forces reserve who are former service personnel rather than volunteers - known as the strategic reserve.Currently, the age limit for the strategic reserve is 55. This will change to 65.The threshold for members of the strategic reserve to be mobilised will change too. Under existing rules they are called upon in the scenario of \"national danger, great emergency or attack in the UK\". That threshold will be lowered to \"warlike preparations\", which is already the threshold for reservists who have left active service in the past few years.The changes, which include technical measures the government has to renew at regular intervals, will come into force next year, if passed by parliament.Last year the Strategic Defence Review called on the government to \"reinvigorate the relationship with the strategic reserves\", estimated to have about 95,000 members.At the same time, Cabinet Office minister Pat McFadden told parliament that the UK must \"actively prepare for the possibility of the UK coming under direct threat, potentially in a wartime scenario\" as he published a national security strategy. McFadden told MPs the nation was \"in an era in which we face confrontation with those who are threatening security\" and pointed to Russia's war against Ukraine as \"the most obvious and pressing example of this\".The document also referred to \"Iranian hostile activity on British soil\" and \"adversaries\" planning how to disrupt energy or supply chains.Labour set out plans to increase overall defence spending from 2.3% to 2.5% of national income by 2027, costing an additional £6bn a year. It has also said spending will rise to 3.5% by 2035.A threat from Trump threat to withdraw US protection from NATO countries also led Prime Minister Sir Keir Starmer to pledge to meet a new Nato target to spend 5% of the UK's GDP on national security by 2035. Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New rules make it easier to call up reservists for war",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2e26/live/a319e240-f1e6-11f0-b373-d7bde4e9f067.png"
      ],
      "datePublished": "2026-01-15T12:42:48.000Z",
      "dateModified": "2026-01-15T12:42:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tehran morgue videos show the brutality of Iran's crackdown on protesters",
    "url": "https://www.bbc.com/news/articles/cly3xpyvxzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7291/live/35478510-f1f0-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-14T16:58:31.000Z",
    "description": "23 hours agoShayan Sardarizadeh,Merlyn Thomas,BBC VerifyandGhoncheh Habibiazad,BBC PersianBBCWarning: this story contains content which some readers m",
    "body": "23 hours agoShayan Sardarizadeh,Merlyn Thomas,BBC VerifyandGhoncheh Habibiazad,BBC PersianBBCWarning: this story contains content which some readers might find distressingDistressing new videos have emerged from a mortuary in Tehran showing rows of bodies, blood soaked floors and crowds of people searching for loved ones following a deadly government crackdown on protesters in Iran.The videos analysed by BBC Verify and BBC Persian, which are too graphic to show, contain some of the most shocking examples so far of how brutal the government's retaliation has been since the unrest began on 28 December.Forensic examination of the footage reveals nearly 200 bodies laid throughout the mortuary complex, many with visible wounds and one victim identified as young as 16. Anti-government demonstrations have spread to more than 68 towns and cities, verified videos show, though the true figure is likely to be much higher. The near total internet blackout imposed by the government since last week has left more than 90 million Iranians almost completely cut off from the outside world.The number of people who have been killed in the protests is not fully known. US-based Human Rights Activists News Agency (HRANA) places the estimate at more than 2,500. An Iranian official previously told Reuters 2,000 people have been killed but claimed \"terrorists\" were to blame.A black body bag shows the date of birth of a 16-year-old victimBBC Verify and BBC Persian have previously reported on images emerging from this mortuary but we are not showing these new videos because the images are too graphic.The footage was posted on Tuesday by Vahid, a US-based Iranian social media influencer and activist, who said they were filmed on 10 January inside the Kahrizak Forensic Medical Centre in south Tehran.Vahid said the videos were filmed by a man who had travelled nearly 1,000km to find internet access. The man told BBC Persian he used mobile networks from neighbouring countries to upload the footage. Vahid has been posting dozens of videos documenting events inside the country for the outside world to see. Two of the videos show rows of body bags on the floor as the man walks up and down a road that runs through the northern section of the vast mortuary complex. He later moves through a courtyard and inside a large warehouse, and walks in and out of adjacent rooms filled with more body bags. At one point he is heard describing the scene as \"the apocalypse\".The man filming is heard saying, \"Today is Saturday, a day after the call\". He is referring to the call made by Reza Pahlavi, the exiled son of the late Shah, for nationwide protests that took place last Thursday and Friday night.Two more clips contain a collection of photos taken from the mortuary showing several bodies wrapped in the zip-up bags, including one which appears burnt.BBC Verify and BBC Persian have counted at least 186 bodies in the five-minute video and at least 178 bodies in the 16-minute clip. The two videos likely show some of the same bodies so we cannot be definitive, but the true figure is likely to be much higher.The videos contain at least nine separate clips edited together. The positions of shadows in the footage indicate these sections were likely filmed at different times throughout the day. We have matched identifiable features from the complex, including separate buildings, the red roof of a warehouse and fences with satellite images on Google.The man films as he moves around inside the centre, where more bodies are kept on stretchers as well as the floor. The footage shows some body bags fully zipped up while others are either half or entirely unzipped, revealing victims' faces and injuries. Some are completely uncovered. We can see blood-soaked towels and sheets scattered around the complex with streaks of blood on the floor.Body bags laid outside in the courtyard of the mortuary complexA number of the bodies have visible wounds. Two bodies appear to be soaked in blood, and another is seen with a deep stomach wound.Some body bags have papers attached to them or details written on the body bags in a white marker such as a name, national ID number, date of birth and death, and in some cases their father's name. At least two men are described as unidentified on a sheet of paper attached to their bag, and at least one woman and one teenager are among the victims.The date of death on three of the male victims' body bags states 9 January. Another body bag shows a date of birth using the Iranian calendar. It says 1/1/1388, which corresponds to 21/3/2009, indicating that it belongs to a 16-year-old.During one moment in the 16-minute clip the man points his phone at a building to his right and a voice can be heard saying: \"There are many [bodies] inside. It's not possible to go inside… this is the women's area\". Iranian mortuaries separate the bodies of men and women for religious reasons.At a different point we can see a body bag at the back of a hearse and a man nearby is heard telling a female official that it is his sister.  Verifying Iran protest footage as internet blackout passes 100 hoursSeveral ambulances, hearses and vans are filmed around the grounds. Officials are seen inspecting the rows of bodies, taking swabs from the victims, and talking to potential loved ones.It is not clear why the bodies of those killed in anti-government protests may have been transferred to the centre, but eyewitness accounts provided to BBC Persian suggest hospitals have been overwhelmed with the number of casualties in the protests.HRANA, which has been tracking the death toll since the unrest began, has reported that 2,403 protesters, 147 people affiliated with the government, nine civilians and 12 children have been killed so far.Crowds of people, many who appear to be family members and friends, are seen walking in and out of the complex as they try to identify the bodies. Cries and wails are repeatedly heard throughout the videos as people mourn the loss of their loves ones.\"Some of our best people have been killed,\" the man filming is heard saying.Iranian state TV has since reported that a \"substantial\" number of bodies had been taken to the mortuary. It claimed the majority of the victims were members of Iran's security forces or passers-by who had nothing to do with the demonstrations.Most international news organisation, including the BBC, are restricted from operating inside the country so we have to rely on verifying footage on social media.Additional reporting by Roja Assadi, Richard Irvine-Brown and Kumar Malhotra",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tehran morgue videos show the brutality of Iran's crackdown on protesters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7291/live/35478510-f1f0-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-14T16:58:31.000Z",
      "dateModified": "2026-01-14T16:58:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British soldiers face dismissal over failed drugs tests",
    "url": "https://www.bbc.com/news/articles/cvgjn9mygvjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/47d9/live/cf0b1160-f206-11f0-af44-156539fce2f7.png",
    "tag": "Trending",
    "date": "2026-01-15T13:15:36.000Z",
    "description": "3 hours agoSarah Campbell,Correspondent andThomas MackintoshAFP via Getty ImagesMore than 20 soldiers from the British Army could be sacked after test",
    "body": "3 hours agoSarah Campbell,Correspondent andThomas MackintoshAFP via Getty ImagesMore than 20 soldiers from the British Army could be sacked after testing positive for drugs.According to the Sun, which first reported the story, 23 personnel from 32 Engineer Regiment based in Catterick, North Yorkshire, were reportedly caught in a sting just before Christmas. The newspaper described it as the \"biggest drugs bust\" to hit the Army.The British Army said the soldiers may be discharged once investigations have concluded.\"Substance abuse is unacceptable in the Army,\" it said in a statement to the BBC.\"We robustly enforce a zero-tolerance policy to drug use by all those who serve and provide an education programme to inform all personnel of the dangers and consequences of substance misuse.\"A number of soldiers from 32 Engineer Regiment recently failed a compulsory drugs test. \"As the matter is the subject of an ongoing internal investigation it would be inappropriate to comment further.\"The regiment provides close support combat engineering to 7th Light Mechanised Brigade, known as the \"Desert Rats\", which is part of Nato's \"Very High Readiness\" task force.According to the Sun, around 250 troops from the regiment were ordered to provide urine samples at Marne Barracks on 20 December.Almost one in 10 of those ordered to do so tested positive for cocaine, the Sun said.On its website the British Army says that any soldiers or personnel who fail a drugs test can expect to be discharged from the service.The Army has a three-tiered approach for substance misuse which includes educating soldiers, deterring through testing and taking disciplinary action when \"any service person is found to have used illegal substances\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British soldiers face dismissal over failed drugs tests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/47d9/live/cf0b1160-f206-11f0-af44-156539fce2f7.png"
      ],
      "datePublished": "2026-01-15T13:15:36.000Z",
      "dateModified": "2026-01-15T13:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Igor Thiago: Brentford striker's route to top from humble start in Brazil",
    "url": "https://www.bbc.com/sport/football/articles/c07xpzyv1yno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95ff/live/831069c0-f203-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-15T15:33:08.000Z",
    "description": "Image source, Getty ImagesByMarcus AlvesBBC SportA young Igor Thiago could not have known he would one day break the record for the most goals by a Br",
    "body": "Image source, Getty ImagesByMarcus AlvesBBC SportA young Igor Thiago could not have known he would one day break the record for the most goals by a Brazilian player in a Premier League season.But the Brentford forward has always had one thing clear in his mind - nothing would stop him from becoming a professional footballer. That is the promise he made to his mother Maria Diva when he was growing up in Cidade Ocidental, a small town in central Brazil.He has never forgotten the day they went to a family meal where everyone was supposed to bring a dish.Raising four children on her own and working as a refuse collector on a minimum wage, Diva did not have it easy and arrived empty-handed. It was then that Thiago heard a close relative say she would only take her children out to eat at other people's expense. Diva felt humiliated and left in tears.\"From today on, no-one in this life is going to humiliate you any more,\" Thiago told her on the way home.\"I'm going to become a footballer, you'll see. Everyone will know me one day.\"His mother may have thought he did not really know what he was talking about. But he knew.However, his path to success has not been straightforward.He had to wait until he was 17 to sign for a club, having faced several rejections at trials around Brazil.\"Thiago would call me late at night in tears to say that football wasn't for him,\" Sergio Goncalves, his mentor from his early years at Gremio Ocidental, a local community football initiative, tells BBC Sport. \"But he was born to score goals.\"The 24-year-old has found the back of the net 16 times in the Premier League this season.He is on target to reach the 20-goal mark once again in his career - having done so in three of his four seasons in Europe, the only exception being his debut campaign with Brentford, which was disrupted by a serious injury.Thiago's next stop is Saturday's west London derby against Chelsea.Image source, Sergio GoncalvesImage caption, Igor Thiago started his career at Gremio Ocidental in Brazil'I don't want to know about football any more'Having lost his father prematurely, Thiago found a paternal figure in Goncalves, who mentored him between the ages of eight and 16 - before the striker joined Vere in 2018 then moved to Brazilian giants Cruzeiro a year later.\"People look at him, see how big he is, and think he's that kind of static centre-forward. But he has a lot to his game because of the time he spent in futsal,\" Goncalves says.\"Thiago was born in futsal. It gives you so much dynamism, such quick thinking. A lot of scouts who came through here now call me to say 'Sergio, I missed out on Thiago'.\"Thiago did not take long to make an impact for Cruzeiro, going on to score in his senior debut in Belo Horizonte. But that was it.He probably could not have had a more challenging first-team experience.That side is remembered as the worst Cruzeiro team ever - they finished their Serie B campaigns in 11th and 14th place in 2020 and 2021.\"The pressure was everywhere - it affected all the players and the coaching staff. It was a very difficult period for the club - delays in paying wages, problems with transfer ban,\" former Brazil international Mozart Santos, who had a brief spell as head coach, says.\"Younger players tend to feel it more. So one of the reasons Thiago maybe didn't perform better in Brazil was this turbulence.\"Such was the situation that Thiago fell into depression, questioning himself and even whether he should continue as a professional footballer.\"There are things no-one knows that I went through. I went through a period of depression,\" he said in an interview with Futebol no Mundo podcast from ESPN.\"There were nights when I thought about giving up. Even though I was already a professional at Cruzeiro, I didn't want to know about football any more.\"I just wanted to walk away from all of it and live back in the countryside. What really gave me strength was my mum and my children.\"'The sky's the limit'At the start of 2022, Thiago told his agents it was time to move elsewhere.Bulgarian champions Ludogorets, who had tried to sign him the season before, returned with another offer and secured a deal.\"In football, a lot of people try to define paths and limits for others. You often see a player going through a difficult period and being labelled as a certain type of player and that label becomes a kind of ceiling. I fight strongly against that,\" former Ludogorets assistant coach Rafael Ferreira, currently at Atromitos in Greece, said.\"I believe everyone has room to grow as long as they're in an environment that allows it. And Igor Thiago fits into a very interesting profile because he has a very strong mentality.\"In his early period, he didn't get many minutes. And what does he do? He asks to play for the second team. He wants to play. That shows you his mentality - not sulking because he isn't playing but looking for alternatives. When you work with that type of player, we usually say the sky's the limit.\"Thiago's mentality also stands out with his team-mates.\"What I really liked about him was that when he arrived, he was always asking the older players what they thought he could improve. That's what I found different about him, special even,\" says Cauly, a former Ludogorets midfielder who now plays for Bahia in Brazil.\"He already had that worker's mentality, that desire to keep improving. And a player with his physical attributes... we already knew that, one way or another, it had to work out for him as a striker.\"It was no surprise that, following only one full season and 20 goals later, he was on his way to Club Brugge in Belgium.\"Sometimes he'd get, I don't know, five or 10 minutes in a game, come on and score. It was like he had something about him... as if his energy attracted good things,\" Ferreira added.Image source, Sergio GoncalvesImage caption, Sergio Goncalves (left) was Thiago's early mentor in his boyhood days in Brazil'His dream was to play in the Premier League'Thiago scored 29 goals in his first and only season with Club Brugge.Brentford then anticipated competition for his signing and paid a club record £30m for him. The forward arrived as a replacement for Ivan Toney, who was sold to Saudi club Al-Ahli.\"I remember he always said his dream was to play in the Premier League. He was always speaking very highly of Erling Haaland. And now, today, he's competing with him for the Premier League's top scorer,\" Cauly says.\"That makes me really happy to see. I'm proud of him. He's someone who truly deserves it - a genuinely good person, with a big heart, and he deserves to be where he is.\"With Brazil desperately looking for a number nine before the summer's World Cup, there is a growing expectation head coach Carlo Ancelotti will include him in his March squad.\"For me, in this next list - which is the last one before the tournament - he has to be in. If he isn't, then it won't be justice,\" Goncalves says.\"Brazil is missing a proper striker, and I believe this is his moment. And when he gets there, I think he'll make the difference. \"I've already been dreaming about it - the World Cup final, him scoring the winning goal. I'm dreaming.\"Insight: In-depth stories from the world of sportBrazilBrentfordPremier LeagueFootball",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Igor Thiago: Brentford striker's route to top from humble start in Brazil",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95ff/live/831069c0-f203-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-15T15:33:08.000Z",
      "dateModified": "2026-01-15T15:33:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Erfan Soltani: Iran denies plan to execute detained protester",
    "url": "https://www.bbc.com/news/articles/cp80zjx091yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f6dd/live/311a0500-f211-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-15T15:29:48.000Z",
    "description": "Iran's judiciary has denied it scheduled the execution of a man arrested in connection with the country's recent protests.Norway-based Kurdish human r",
    "body": "Iran's judiciary has denied it scheduled the execution of a man arrested in connection with the country's recent protests.Norway-based Kurdish human rights organisation Hengaw said earlier this week that the family of Erfan Soltani, 26, had been told he faced execution on Wednesday, only days after he was detained.On Wednesday, Hengaw cited them as saying Soltani's execution had been \"postponed\" but warned that \"serious and ongoing concerns\" regarding his life remained.\"This is good news. Hopefully, it will continue!\" said US President Donald Trump, who had warned Iran not to execute protesters.The judiciary said he faced charges of \"colluding against national security\" and \"propaganda activities against the establishment\", which are not punishable by the death penalty, state broadcaster IRIB reported.They said reports by foreign media organisations that Soltani faced execution was a \"blatant act of news fabrication\".Iranian Foreign Minister Abbas Araghchi also said there was \"no plan\" to hang people.It came after President Trump threatened to take \"very strong action\" if executions were carried out, amid mounting speculation of possible US military strikes.On Wednesday, he told reporters that \"very important sources on the other side\" had informed him \"the killing in Iran is stopping, and there's no plan for executions\". Hengaw told the BBC that Soltani had been denied access to a lawyer and that his family were unaware of any official charges brought against him. Soltani, a clothes shop owner, was arrested at his home last Thursday  in connection with the protests in the northern city of Fardis, west of Tehran, according to the group and his family. However, the judiciary said he was arrested during \"riots\" on Saturday and was being held in a prison in the neighbouring city of Karaj.Iran's chief justice, Gholam-Hossein Mohseni-Ejei, has advocated for the swift trial and punishment of arrested \"rioters\".\"Those elements who beheaded people in the streets or burned people alive must be tried and punished as quickly as possible,\" he said in a video on Wednesday. \"If we don't do it fast, it won't have the same impact.\" The current wave of protests began after shopkeepers in Tehran went on strike over the rising cost of living and the depreciating value of the currency.They quickly spread across the country and turned against Iran's clerical establishment, particularly the Supreme Leader, Ayatollah Ali Khamenei. The slogans chanted by demonstrators have included \"Death to the dictator\" and \"Seyyed Ali [Khamenei] will be toppled this year\".The protests escalated significantly last Thursday and were met with deadly force by authorities, masked by a near total shutdown of the internet and communication services.According to the US-based Human Rights Activists News Agency (HRANA), at least 2,435 protesters have been killed since the unrest began, as well as 13 children and 153 people affiliated with the security forces or government.It reports that another 18,470 protesters have been arrested.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Erfan Soltani: Iran denies plan to execute detained protester",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f6dd/live/311a0500-f211-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-15T15:29:48.000Z",
      "dateModified": "2026-01-15T15:29:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eurovision Song Contest announces live tour to celebrate 70th birthday",
    "url": "https://www.bbc.com/news/articles/cp829ylpp04o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f279/live/44183300-f1fa-11f0-a2ce-b77b236ada53.jpg",
    "tag": "Trending",
    "date": "2026-01-15T11:27:45.000Z",
    "description": "5 hours agoSteven McIntoshEntertainment reporterThe Eurovision Song Contest has announced a live tour to celebrate its 70th birthday, which will begin",
    "body": "5 hours agoSteven McIntoshEntertainment reporterThe Eurovision Song Contest has announced a live tour to celebrate its 70th birthday, which will begin after this year's grand final. The new show will feature some of the most memorable performers from the seven decades of the competition, the European Broadcasting Union (EBU) said.It has not yet been confirmed which artists will be taking part, but the organisation confirmed the tour would also feature performances from 10 of this year's entrants.The tour begins at London's O2 arena on 15 June, and will go on to play nine other cities around Europe.The announcement comes during ongoing turmoil surrounding the contest, following a row about Israel's participation while the war in Gaza continues. Ireland, Spain, the Netherlands, Slovenia, and Iceland have all said they will not take part this year, after a majority of members voted in December for a series of reforms which would also allow Israel to remain.Earlier this week, Thomas Neuwirth, who won the contest in 2014 as his stage persona Conchita Wurst, stepped back from his association with Eurovision, saying he planned \"to focus more on other professional projects and to let new things evolve\".Meanwhile, Polish artist Karolina Czarnecka, alongside her band Brutto Szkła, announced this week she was withdrawing from the competition to find Poland's 2026 entrant because she cannot \"consent to the suffering of another human being\".Artists participating in the new tour will perform their own Eurovision entries, plus cover versions of their favourite songs from the contest's 70-year history, organisers said.The contest's director Martin Green said organisers \"wanted to do something truly unique and special\" to mark the anniversary. He said the format of the tour would \"capture the evolution of the contest\" and \"celebrate our fantastic past whilst looking to the future\".\"For the very first time we are bringing the magic of the Eurovision Song Contest live experience directly to fans and their friends and families all over Europe,\" he added.The line-up of 2026 artists taking part in the tour will not be announced until after this year's contest has taken place, suggesting only the artists that do well in the contest or deliver a particularly memorable performance will be selected. The EBU said the live tour gives fans who were not able to secure tickets to the contest itself \"the chance to attend a show that would deliver the \"scale, spectacle and spirit\" of the contest.The tour will play shows in Hamburg, Milan, Zürich, Antwerp, Cologne, Copenhagen, Amsterdam, Paris and Stockholm.The Eurovision Song Contest began in May 1956 in Switzerland, and has evolved to become one of the biggest events in the musical calendar - last year's contest was watched by 175 million people worldwide.This year's contest takes place in Vienna on 16 May, following Austria's win in 2025.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eurovision Song Contest announces live tour to celebrate 70th birthday",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f279/live/44183300-f1fa-11f0-a2ce-b77b236ada53.jpg"
      ],
      "datePublished": "2026-01-15T11:27:45.000Z",
      "dateModified": "2026-01-15T11:27:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Henry Zeffman: Jenrick sacking is huge moment for future of British right",
    "url": "https://www.bbc.com/news/articles/cql4e6pkzdqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/578c/live/a52a92a0-f20e-11f0-9024-9b4621e849d3.jpg",
    "tag": "Trending",
    "date": "2026-01-15T12:47:35.000Z",
    "description": "4 hours agoHenry ZeffmanChief political correspondentThis is not merely a big moment for Kemi Badenoch and for Robert Jenrick – though it is, of cours",
    "body": "4 hours agoHenry ZeffmanChief political correspondentThis is not merely a big moment for Kemi Badenoch and for Robert Jenrick – though it is, of course, both of those things.This is a massive moment for the future of the British right.When Badenoch became leader of the Conservative Party just over a year ago the party was still polling higher than Reform, which is often forgotten.A lot changed in 2025.The Conservative Party is often called the most successful political party in the democratic world, and yet its MPs genuinely fear being usurped by Reform UK.That is why the question of Jenrick's future matters. Jenrick finished second in the leadership election in 2024 and his creative use of social videos has only given him greater prominence since.On one level, then, this is pretty simple. If Jenrick was – or is – planning to defect to Reform, as Badenoch alleges, then that would be by far the most senior defection so far and a pretty crushing blow to the Conservative Party.There are other layers to this though.Jenrick and Reform UK have had some fairly salty exchanges in the past. Given they have, at least until now, been political opponents, that's perhaps not a surprise.Yet it is still a significant hiccup they would have to explain if he were to defect.For example in August, Nigel Farage posted on X: \"Jenrick is a fraud.\"And when it comes to Zia Yusuf, Reform's head of policy and former chairman, it is hard to choose the best example of him attacking Jenrick and his record.It is also worth reflecting on what a political journey Jenrick has been on for his defection even to be plausible.He was first elected in a by-election in 2014 where his main rival was Farage's then-party, Ukip. Once in the Commons, he was part of the Conservative mainstream, voting Remain in the EU referendum and backing first Michael Gove then Theresa May in the leadership election that followed.When he joined forces with Rishi Sunak and Oliver Dowden to endorse Boris Johnson's 2019 leadership campaign it was a massive moment because it signalled that that was where the momentum of mainstream Conservative rising stars was flowing.Jenrick got by far the biggest job of the trio – housing secretary – in Johnson's first cabinet but before long was left far behind by his closest political friends.When Sunak became prime minister, it was striking that Jenrick was not even a full cabinet minister as immigration minister.It was his experience in this job which, friends say, transformed him as he saw up close what he saw as a dysfunctional immigration system. His internal critics claimed that this was political opportunism from somebody anticipating a post-general election leadership contest.Ultimately, he quit Sunak's government because he believed his policies on illegal immigration did not go far enough. And he moved to the right on other issues too.Fast forward to today, and it was Badenoch's belief that Jenrick was about to make the ultimate leap to the right which has plunged the Conservative Party into turmoil.Conservative MPs are reeling at Jenrick's sacking. One MP just told me there is an eerie quiet in the party's WhatsApp groups.Many MPs will already have left Parliament, and London, for the weekend.One MP I've just spoken to, who was generally aligned with Jenrick, was adamant that the former shadow justice secretary had merely been keeping his options open when it came to Reform.They said his preferred option was to wait for the elections in May, and then see if there was a possibility of him becoming Conservative leader first.We will have to see what evidence Badenoch has, and what Jenrick says, to assess whether that MP is simply being naïve.A senior Conservative MP said to me in the immediate aftermath of Badenoch's announcement that this was \"a massive mess\" for their party.That feels inarguable.But it will take time to work out whether Badenoch triggering this mess was preferable to the alternative.Listen to Henry discuss Jenrick's sacking on BBC Newscast",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Henry Zeffman: Jenrick sacking is huge moment for future of British right",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/578c/live/a52a92a0-f20e-11f0-9024-9b4621e849d3.jpg"
      ],
      "datePublished": "2026-01-15T12:47:35.000Z",
      "dateModified": "2026-01-15T12:47:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok star HSTikkyTokky will not repay full extradition costs",
    "url": "https://www.bbc.com/news/articles/c3edz4y71ydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1c95/live/a77d0bf0-f1ff-11f0-a2ce-b77b236ada53.jpg",
    "tag": "Trending",
    "date": "2026-01-15T13:26:48.000Z",
    "description": "3 hours agoStuart MaisnerSouth EastGetty ImagesHSTikkyTokky, real name Harrison Sullivan, has a large following on social mediaTikTok influencer HSTik",
    "body": "3 hours agoStuart MaisnerSouth EastGetty ImagesHSTikkyTokky, real name Harrison Sullivan, has a large following on social mediaTikTok influencer HSTikkyTokky will not have to repay the full costs of a private jet police chartered to bring him back to the UK from Spain after he avoided court for almost a year, a judge has ruled.Harrison Sullivan, 24, was handed a suspended prison sentence in November after crashing his McLaren in Virginia Water, Surrey, in March 2024.Sullivan failed to appear in court for 12 months after the crash, travelling to Dubai, Thailand and Spain and continuing to make social media content, the court previously heard.District judge Julie Cooper said she was not prepared to order the social media influencer to repay all of the flight costs because the use of a private jet was \"not necessary or proportionate\".The judge ordered Sullivan to pay £9,270 in prosecution costs, and £8,050.27 in police costs – bringing the total bill to £17,320.27.Surrey Police spent around £15,000 on a chartered flight from Spain to bring him back to the UK, a hearing at Staines Magistrates' Court was told on Thursday.The total costs to both Surrey Police and the Crown Prosecution Service to bring Sullivan back to the UK in August reached £28,350.27, the hearing was told.Prosecution Kane Alexander, however, told the judge there were concerns that Sullivan – a fitness influencer – could be recognised by members of the public on a commercial plane.\"It seems that Mr Sullivan travels around on planes with impunity without too much risk to himself, so I don't really understand,\" Judge Cooper said.\"In my view, it is not just or reasonable for him to pay a chartered flight when I have been given no satisfactory explanation for why that should be.\"Surrey PoliceSullivan was driving a purple McLaren on the A30 when it crashedShe added: \"I can understand that there would be some issues with social media.\"But the problem could have been resolved or reduced had first-class flight been obtained to place the defendant in that area, so he was not in view of members of the public whilst in handcuffs.\"Defence solicitor Shalin Sood told the judge Sullivan was \"surprised by the private jet\" and was \"completely calm and compliant\" while in police custody.Referring to the costs incurred throughout the investigation, which the court heard required partnership with foreign agencies including Interpol, Sood added: \"It's not rocket science trying to locate where Mr Sullivan is, judge – he livestreams every day.\"Sullivan was handed a one-year suspended prison sentence at Staines Magistrates' Court in November last year after pleading guilty to dangerous driving and driving without insurance.The social media star has also been disqualified from driving for two years.He will have an electronic tag for three months and is expected to complete 300 hours of unpaid work and 30 days of rehabilitation.Additional reporting from PA Media. More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok star HSTikkyTokky will not repay full extradition costs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1c95/live/a77d0bf0-f1ff-11f0-a2ce-b77b236ada53.jpg"
      ],
      "datePublished": "2026-01-15T13:26:48.000Z",
      "dateModified": "2026-01-15T13:26:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disability Confident scheme changes don't go far enough, campaigners say",
    "url": "https://www.bbc.com/news/articles/cpdy17zpeg3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2f9/live/327b0320-f1e6-11f0-b373-d7bde4e9f067.jpg",
    "tag": "Trending",
    "date": "2026-01-15T12:51:46.000Z",
    "description": "4 hours agoErica WitheringtonDisability producerBBCCritics say a scheme that accredits employers as \"Disability Confident\" lacks accountability, despi",
    "body": "4 hours agoErica WitheringtonDisability producerBBCCritics say a scheme that accredits employers as \"Disability Confident\" lacks accountability, despite reforms today.Changes to a flagship scheme that encourages firms to employ more disabled people don't go far enough, campaigners say.Disability Confident, a voluntary employer scheme, was launched in 2016 to get more businesses to recruit and retain disabled people.It had faced criticism, including from the current disability minister, that it allowed employers to be accredited without them needing to actually employ disabled people. The government today outlined plans it said would make sure firms who sign up were encouraged to make \"progress\". But charities have told BBC News employers will still be able to certify themselves without employing \"a single disabled person\".Disability Confident is one of the UK government's flagship schemes aimed at getting more disabled people into work and giving them a better experience in the workplace.It is the only scheme focused entirely on employers, whether they are a one-person business or a global company.It is voluntary to join and works like a badge system, accrediting employers based on how supportive they are of workers with disabilities.Employers sign up at Level 1 (\"committed\") by pledging to be inclusive, then move to Level 2 (\"employer\"), by completing a form confirming they have put certain policies in place.At Level 3 (\"leader\"), they submit evidence of their inclusiveness for peer review, and are audited by another Level 3 employer.Critics of the scheme say that with no strict audit, and only self-certification until Level 3, there is no guarantee employers have implemented the practices they claim to have done, or actually employed anyone disabled.Under today's reforms, the government says organisations will no longer be able to sit at Level 1 – \"committed\" – indefinitely.Membership at this level will be capped at two years, with no option to renew, to encourage employers to make progress, the government says.Other changes include tailored support for small businesses, peer-to-peer learning, and guidance \"shaped by the voices of disabled people\".Sir Stephen Timms, Social Security and Disability Minister, said the government was \"determined to see more disabled people in work\" and that overall employment figures would be the \"acid test\".He described the scheme as having \"enormous potential\" but acknowledged that for \"too long, it has not delivered enough support for disabled people, or for employers who want to recruit, retain and develop disabled people\".\"That's why we are improving the scheme, through robust reforms to ensure a better service for all, including through greater support for SMEs and improving access to resources for employers.\"'It's just a badge'However, there have been calls from campaigners and academics for employers at Levels 2 and 3 to be held to hiring targets – a minimum percentage of their workforce who are disabled – to maintain their accreditation.This has not been introduced.Timms had previously pressed for stronger criteria, challenging the then Conservative government in 2024 to deliver meaningful change.As chair of the Work and Pensions Committee, he criticised the scheme for focussing on \"process rather than outcomes\".Pressed by the BBC on whether an employer would lose their accreditation if they did not go on to employ anyone disabled, Timms said: \"No, we're not changing the rules in that way.\"What we want to do is encourage employers to progress up the scheme.\"The disability groups Inclusion London and Scope said the reforms failed to address the core problem. James Taylor, an executive director at Scope, said the scheme \"lacks the teeth, lacks the funding and probably lacks the ambition too\".Jane ConstanceJane Constance says she was asked \"silly questions\" by recruiters who certified themselves, such as: \"How would you use a computer?\"HR professional and disability advocate Jane Constance, 25, says her experience applying to a series of Disability Confident employers felt \"hopeless\".She was astonished to be asked \"silly questions\" by recruiters, such as \"'Oh, so you're blind. So how would you use a computer? How would you read?'\"In one case, a recruiter assumed she needed a sighted guide or a support worker. \"I use a BrailleNote,\" she pointed out. \"This was a hopeless conversation.\"Of the scheme, Jane says: \"It's just a badge – it doesn't mean they'll hire you.\"The scheme 'just doesn't work'Professor Kim Hoque from Kings College London, who co-authored research into the scheme in 2023, says Disability Confident \"just doesn't work.\"His research found \"very little evidence\" Disability Confident employers hire more disabled people or provide better workplace experiences for disabled people than those not in the scheme.Of today's reforms, Hoque said: \"The only bit with teeth is stopping people staying at Level 1 indefinitely.\"The rest looks incredibly fluffy - more of the same failed status quo.\"The Department for Work and Pensions said it would \"continue engaging closely with a variety of stakeholders including organisations representing disabled voices, as we have done throughout our planning for the reforms\".\"We will also be engaging with the recently announced Independent Disability Advisory Panel,\" it said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disability Confident scheme changes don't go far enough, campaigners say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2f9/live/327b0320-f1e6-11f0-b373-d7bde4e9f067.jpg"
      ],
      "datePublished": "2026-01-15T12:51:46.000Z",
      "dateModified": "2026-01-15T12:51:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amol Rajan to leave Radio 4's Today programme to launch his own company",
    "url": "https://www.bbc.com/news/articles/cgqenv21ne1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/851c/live/95057840-f204-11f0-af44-156539fce2f7.jpg",
    "tag": "Trending",
    "date": "2026-01-15T11:48:44.000Z",
    "description": "5 hours agoSteven McIntoshEntertainment reporterBroadcaster Amol Rajan is to leave BBC Radio 4's Today programme, announcing he intends to launch his ",
    "body": "5 hours agoSteven McIntoshEntertainment reporterBroadcaster Amol Rajan is to leave BBC Radio 4's Today programme, announcing he intends to launch his own company.He will continue doing some work for the BBC away from news, including hosting quiz show University Challenge and the Radical podcast. In a statement, Rajan said leaving Today \"might be mad\", but added he was \"extremely excited to jump into the great digital Narnia of the creator economy\".It has not yet been confirmed who will replace him on the BBC's flagship radio news programme, but the corporation said an announcement would be made \"in due course\".The BBC's editorial rules would likely have prevented Rajan from staying on as the presenter of a news programme while also launching his own company.Rajan has presented Today for nearly five years, having joined in March 2021.He effectively replaced John Humphrys, who left 18 months earlier, but the programme had continued with fewer presenters during the gap. Before joining Today, Rajan was the media editor for BBC News, and guest presented several major programmes such as The One Show and filled in for presenters on BBC Radio 2. On Thursday, Rajan said: \"The pips have sounded, and it's time to get my coat.\"He praised the Today team as \"the best of the best\" and \"consistently world class\", adding that he also \"couldn't be prouder\" of his Amol Rajan Interviews series which has run on recent years on BBC Two. However, he continued: \"Twenty years after I first flirted with the idea, I'm extremely excited to jump into the Great Digital Narnia of the Creator Economy, and build my own company. I'll still do Britain's oldest TV quiz and most exciting podcast.\"But Del Boy was my hero growing up, and it's time to unleash my inner entrepreneur.\"He added: \"I am very much not leaving the BBC, Britain's noblest cultural institution, whose Reithian spirit is such a generous gift to a world in flux. It's that world I'm heading for, and I'm excited.\"Today editor Owenna Griffiths described Rajan as an \"exceptional talent with a rare combination of intellectual dexterity, impressive breadth of interest and a brilliant sense of humour\".Radio 4 controller Mohit Bakaya said Rajan had \"brought a distinctive intellectual energy and curiosity to Today that we will be really sad to lose\".In a separate post on Instagram, Rajan paid tribute to his Today colleagues and said he had made sure to tell them of his exit before the official announcement. Rajan is the third presenter in two years to leave Today, following Mishal Husain and Martha Kearney, who were replaced by Anna Foster and Emma Barnett respectively.The programme's other presenters are Justin Webb, who replaced Edward Stourton in 2009, and Nick Robinson, who took over from James Naughtie in 2015.Before joining the BBC, Rajan was the editor of the Independent newspaper, from 2013 to 2016.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amol Rajan to leave Radio 4's Today programme to launch his own company",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/851c/live/95057840-f204-11f0-af44-156539fce2f7.jpg"
      ],
      "datePublished": "2026-01-15T11:48:44.000Z",
      "dateModified": "2026-01-15T11:48:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran protests: BBC hears from families of demonstrators killed in crackdown",
    "url": "https://www.bbc.com/news/articles/c8e54zp5j6no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9267/live/427407e0-f155-11f0-9fdd-27d7df3706fc.jpg",
    "tag": "Trending",
    "date": "2026-01-14T20:35:49.000Z",
    "description": "'I carried my wife's body for an hour and a half' - BBC hears stories of protesters killed in Iran20 hours agoSarah Namjoo and Roja AssadiBBC PersianU",
    "body": "'I carried my wife's body for an hour and a half' - BBC hears stories of protesters killed in Iran20 hours agoSarah Namjoo and Roja AssadiBBC PersianUser generated contentProtesters march through Kashani, Tehran, on 8 JanuaryWarning: This article contains graphic descriptions of death and injuryHeading home after joining a protest in Tehran on 8 January, Reza put his arms around his wife Maryam to protect her. \"Suddenly, I felt my arm go light – there was only her jacket in my hands,\" he told a family member, who later spoke to BBC Persian. Maryam had been fatally shot - and they had no idea where the bullet had come from.Reza carried Maryam's body for an hour and a half. Exhausted, he sat down in an alley. After a short time, the door of a nearby house opened. The people who lived there took them into their garage, brought a white sheet and wrapped Maryam's body in it.Days before Maryam headed out to the protests, she had told her children - aged seven and 14 – about what was happening in their country. \"Sometimes parents go to the protests and don't come back,\" she said. \"My blood, and yours, is no more precious than anyone else's.\"Reza and Maryam's names have been changed for safety reasons.Islamic Republic of Iran Broadcasting via WANA via ReutersIranian state television has shown this burnt-out bus, saying it was filmed in Tehran on 10 JanuaryMaryam is one of thousands of protesters who should have returned home but never did, as the authorities responded to the rapid spread of demonstrations across Iran with a deadly crackdown.The US-based Iranian Human Rights Activists News Agency (HRANA) says it has been able to confirm the killing of at least 2,400 protesters, including 12 children, during the past three weeks.It is extremely difficult to determine the death toll, which is expected to rise in the coming days, because the country remains under a near-total internet blackout imposed by Iranian authorities on Thursday night.  Human-rights groups have no direct access to the country and, along with other international news organisations, the BBC is unable to report on the ground.Iranian authorities have not provided a death toll but local media have reported 100 security personnel have been killed, and protesters - whom they have portrayed as \"rioters and terrorists\" - have set fire to dozens of mosques and banks in various cities.User generated contentKashani, Tehran, on 8 JanuaryDemonstrations began in the capital, Tehran, on 29 December, following a sharp fall in the value of the Iranian currency against the dollar. As the protests reached dozens of other towns and cities, they turned against Iran's clerical rulers.Security forces soon launched a violent crackdown, with at least 34 protesters reported killed by 7 January, the 11th day of the unrest. However, it appears the bloodiest crackdown was last Thursday and Friday, when thousands of people took to the streets across the country and called for an end to the rule of the Supreme Leader, Ayatollah Ali Khamenei.BBC Persian has received dozens of accounts from inside Iran. Defiant despite potential repercussions, the witnesses said they wanted to ensure the rest of the world knew of the violence against the protesters.User generated contentA demonstration outside Hoze Elmiye religious institution, in Najaf Abad, on 8 January\"Our neighbourhood smells of blood - they killed so many,\" one told BBC Persian. Another recalled security forces \"mostly shooting at heads and faces\".The protests have spread across all 31 provinces. And the information trickling in clearly shows the scale of the killings in smaller cities and towns is just as severe as in major cities.In Tonekabon, a town of 50,000 people in the north, Sorena Golgun was killed on Friday. The 18-year-old university student was \"shot in the heart\" running from an ambush by security forces, according to a family member.Family of Sorena GolgunSorena Golgun's family say the 18-year-old university student was shot in his heart running from security forces in TonekabonLike Sorena, many of the other protesters killed were young and full of dreams. Robina Aminian, a 23-year-old fashion-design student who hoped to study in Milan, was shot dead in Tehran on Thursday.Her mother spent about six hours travelling from their home, in the western city of Kermanshah, to collect Robina's body from Tehran. On her way back, she held her beloved daughter in her arms. But when she arrived, the security forces made her bury the body in a remote cemetery outside the city - with no other family or friends present.Not all those killed were protesters. Navid Salehi, a 24-year-old nurse in Kermanshah, was shot multiple times leaving work on Thursday.The bodies of many protesters were sent to the Kahrizak Forensic Medical Centre, in Tehran. The scenes there were so distressing Sahanand, who did not want to give his real name, decided to travel almost 1,000km to a border area so he could send out video footage by using the mobile data networks of neighbouring countries. On Saturday, Sahanand had seen more than 2,000 bodies lying on the ground, he said. Again, the BBC has no means to confirm this. However, in two newly emerged videos from Kahrizak, BBC Verify and BBC Persian have counted at least 186 bodies in one piece of footage and at least 178 bodies in the other. The two videos probably show some of the same bodies, so we cannot be definitive, but the true figure is likely to be much higher.User generated contentKashani, Tehran, on 8 JanuaryOne young woman, speaking to BBC Persian on condition of anonymity, described last week's events as like \"a war\". The protesters remained \"more united than ever before\" but it was too much for her and this week she had fled the country - like many, gripped by fear the authorities will start a new wave of executions and prosecutions.\"I'm really afraid of what might happen to those who are still in Iran,\" she added.Additional reporting by Farzad Seifikaran and Hasan Solhjou",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran protests: BBC hears from families of demonstrators killed in crackdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9267/live/427407e0-f155-11f0-9fdd-27d7df3706fc.jpg"
      ],
      "datePublished": "2026-01-14T20:35:49.000Z",
      "dateModified": "2026-01-14T20:35:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]