[
  {
    "title": "Newscast - Trump accuses UK of \"an act of GREAT STUPIDITY!\" - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mw2lg4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-20T16:17:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Jan 2026,·40 minsTrump accuses UK of \"an act of GREAT STUPIDITY!\"NewscastAvailable for over a yearToday, the UK Government has defended its decision to hand over the Chagos Islands after Donald Trump called the deal “an act of GREAT STUPIDITY!” on Truth Social.\nAdam and Chris put the president’s comments to Darren Jones, Chief Secretary to the Prime Minister, and ask whether Keir Starmer’s relationship with Donald Trump is being tested by his social media posts.\nAnd, we hear Darren Jones’ vision for reforming the civil service, including a digital state and changing following a speech he gave on Tuesday morning at a London tech company. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming and Chris Mason. It was made by Miranda Slade with Chloe Scannapieco. The social producer was Joe Wilkinson. The technical producer was Michael Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump accuses UK of \"an act of GREAT STUPIDITY!\" - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-20T16:17:00.000Z",
      "dateModified": "2026-01-20T16:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - Greenland: Could the US regret alienating its Nato allies? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct71d5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mw01wx.jpg",
    "tag": "Trending",
    "date": "2026-01-20T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·20 Jan 2026,·26 minsAvailable for over a yearPresident Trump says he will, \"100%\" follow through on his threats to impose tariffs if a deal over Greenland is not reached, and responded \"no comment\" on Monday when asked whether he would use force to seize the island. \nEven if Trump’s attempt to control Greenland goes no further, has trust between the United States and its Nato allies been damaged beyond repair? We speak to the BBC’s world news correspondent, Joe Inwood.  \nProducers: Cat Farnsworth and Lucy Pawle \nMix: Travis Evans \nExecutive producer: James Shield \nSenior news editor: China Collins \nCredits: Love Actually (2003) / Dir: Richard Curtis / Universal Pictures \nPhoto: A town in Greenland. BBC.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Greenland: Could the US regret alienating its Nato allies? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mw01wx.jpg"
      ],
      "datePublished": "2026-01-20T10:00:00.000Z",
      "dateModified": "2026-01-20T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Latest twist in Trump diplomacy brings relief for Starmer",
    "url": "https://www.bbc.com/news/articles/c62wwre0jrro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20c9/live/886d0110-f71e-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-21T23:01:41.000Z",
    "description": "2 hours agoChris MasonPolitical editorHurtling into view, noisily and quickly, comes another twist in the rollercoaster that is diplomacy in the era o",
    "body": "2 hours agoChris MasonPolitical editorHurtling into view, noisily and quickly, comes another twist in the rollercoaster that is diplomacy in the era of President Trump.Splenetic social media posts, bold claims in front of the cameras and provocative and to some deeply offensive AI-generated images of an American-owned Greenland.And now, so many of America's allies allow themselves a deep breath and an expression of relief.Just as so many of the furious rows begin on social media under this US president, this latest one has cooled considerably via social media too - with another post on his platform Truth Social.Within the government here in the UK, there is a quiet pride that Britain made its contribution to the welter of diplomacy European neighbours and others have been doing in recent days.I hear that the British diplomatic machine cranked up at every level: involving ministers, officials and embassies.The prime minister insisted on what he saw as the merits of \"calm discussion\" - but had to judge how to calibrate his response, both publicly and privately.At the core of this row, there was a fundamental public disagreement between Downing Street and the White House, something Sir Keir Starmer has sought to avoid where possible.But for him the integrity of a state - with Greenland's future being for Greenlanders and Denmark to decide - was a non-negotiable bottom line.In the 48 hours or so since spelling that out explicitly, in front of the cameras, on Monday morning, risk hung in the air - could the carefully cultivated relationship with President Trump be uprooted before our eyes?By Tuesday morning, it looked like the answer could be yes, with the president sounding off in capital letters about the government's deal to hand the Chagos Islands to Mauritius, an arrangement he had previously endorsed.What might come next? Again Downing Street held its breath, before deciding to notch up its critique in the Commons on Wednesday.The prime minister told MPs he would \"not yield\" over his support for Greenland, despite the threat of tariffs. His team knew this wasn't without risk.Now, almost as quickly as the row accelerated, President Trump has hit the brakes.A deal has been done, the threat of tariffs and reality of tub thumping language has gone.And yes, we have heard this album before.The president makes a provocative and to many outrageous suggestion, reaction around the world scatters in multiple directions, the White House has seized the agenda.The world, or at least the West, splutters, frets, contorts and argues – and a solution is arrived at, but not before so many are brutally reminded of America's brute force, when led by a man happy to be brutish in his approach.And America's friends and foes, catching their breath, ponder what will prompt the next diplomatic grenade from the Oval Office.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Latest twist in Trump diplomacy brings relief for Starmer",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/20c9/live/886d0110-f71e-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-21T23:01:41.000Z",
      "dateModified": "2026-01-21T23:01:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia's Liberal-National coalition splits after row over Bondi shooting reforms",
    "url": "https://www.bbc.com/news/articles/cdexxy0k5w7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0103/live/1f482dc0-f725-11f0-9d23-7f6974c9a69f.jpg",
    "tag": "Trending",
    "date": "2026-01-22T00:49:35.000Z",
    "description": "Australia's Liberal-National Coalition, the country's main opposition, has split after a row over hate speech laws, casting the future of Liberal lead",
    "body": "Australia's Liberal-National Coalition, the country's main opposition, has split after a row over hate speech laws, casting the future of Liberal leader Sussan Ley into doubt.The centre-right Coalition, which has been on rocky ground since a resounding election loss last year, had been divided over how to respond to reforms moved by the government after a terror attack targeting a Jewish festival at Bondi Beach killed 15 people last month.The Nationals ultimately refused to follow the shadow cabinet decision, a breach of longstanding Coalition rules.\"Our party room has made it clear that we cannot be part of a shadow ministry under Sussan Ley,\" leader David Littleproud told reporters.Announcing the split on Thursday - a national day of mourning for those killed in the shooting on 14 December - Littleproud said the Coalition \"was made untenable\".He did not rule out a return to the Coalition, refusing to \"speculate\", but said it was \"probably a good thing\" if Australia's two main conservative parties spent \"some time apart\".It is the second time in less than a year that the Nationals have pulled out of the Coalition, with a brief split - largely over climate and energy policy - in May last year resolved within a week.Ley, whose leadership is under pressure, is yet to comment on the split. She released a statement on Thursday to mark the national day of mourning, saying \"my responsibility as leader of the opposition and leader of the Liberal party is to Australians in mourning\".Though both parties in the Coalition voted against legislation tightening gun controls, the Liberals had sided with the Labor government on Tuesday to pass hate speech reforms introduced after the Bondi Beach attack.But their Nationals colleagues abstained from the vote in the lower house and voted against the measure in the senate, despite a shadow cabinet agreement, citing concerns that the legislation had been rushed and posed a threat to free speech.The laws includes provisions that will ban groups deemed to spread hate and introduce tougher penalties for preachers who advocate violence.On Wednesday three Nationals frontbenchers offered their resignations, which Ley accepted despite a warning from Littleproud that if she accepted them the rest of the Nationals front bench would follow. The rest of the shadow cabinet duly resigned. \"This process was wasn't all Sussan Ley's fault,\" Littleproud said. \"Prime Minister Anthony Albanese put her in this process. But it has been mismanaged by Sussan Ley.\"Ley had already been struggling to assert her authority over the Coalition after being elected the Liberal party's first female leader after last year's bruising election defeat.  Some political analysts and observers had predicted she would be ousted by the end of last year and Thursday's events have reignited those conversations.The Coalition, in its current form, dates back to the 1940s, and before the brief break-up last year, had not parted way since 1987.The Nationals mainly represent regional communities and often lean more conservative than the Liberals.On local radio, senior Nationals member Bridget McKenzie - who was one of the senators who went rogue - was asked: \"Why on earth are you playing leadership games today?\"\"I think the timing's appalling,\" McKenzie told the Australian Broadcasting Corporation (ABC), but said the question was unfair.Former Liberal Prime Minister Malcolm Turnbull, himself no stranger to scuffles with the Nationals, told the ABC both Coalition party leaders had \"mismanaged\" the disagreement and now faced an un-electability crisis.\"It looks like just a smouldering wreckage, doesn't it?\" he said of the Coalition.Another former Liberal leader and one of the nation's longest serving prime ministers, John Howard, told The Australian Ley had had \"no choice\" after the Nationals senators' revolt and had \"behaved absolutely correctly\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia's Liberal-National coalition splits after row over Bondi shooting reforms",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0103/live/1f482dc0-f725-11f0-9d23-7f6974c9a69f.jpg"
      ],
      "datePublished": "2026-01-22T00:49:35.000Z",
      "dateModified": "2026-01-22T00:49:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Trump hails Greenland deal' and 'All I want is a piece of ice'",
    "url": "https://www.bbc.com/news/articles/cly99w1zx4lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3b14/live/5b8e2be0-f725-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-22T00:12:49.000Z",
    "description": "59 minutes agoDonald Trump's announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday's papers. The Times leads ",
    "body": "59 minutes agoDonald Trump's announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday's papers. The Times leads with the US president announcing a \"framework deal\" has been reached after talks with Nato secretary-general Mark Rutte, saying it \"gives us everything we needed to get\".The Financial Times says the US president signalled there would be \"additional discussions\" on Greenland's role in the Golden Dome, a planned missile defence system to protect the US from all missile attacks.In light of the deal, the Guardian says Donald Trump is stepping back from his threat to impose tariffs on European allies who opposed his acquisition of Greenland.As a result of Donald Trump's climbdown from his tariff threat, markets in the US have rallied, with stocks surging back on Wednesday, reports the Daily Mail. Elsewhere, the paper continues to tease more details from the Beckham family row.\"It's a Don deal\" says the Daily Star, as it calls the Greenland saga \"manbaby mayhem\".Despite the easing of tensions, the i Paper quotes a senior Nato official warning that \"if we don't give Greenland to the US they will stop supporting Ukraine\".The Daily Telegraph fills its front page with a picture of a smiling Donald Trump in its coverage. Elsewhere, the paper highlights one of the US president's jibes at the audience during his speech at the World Economic Forum: \"You'd all be speaking German if it wasn't for us.\"The Independent follows with more details of the US president's speech in Davos, where he insisted the US must own Arctic territory in order for its national security. The paper sums up his remarks with the headline: \"All I want is a piece of ice.\" The Daily Mirror describes Donald Trump's Davos speech as a \"delusional rant\" during which he insisted that European leaders \"loved him\" before his Greenland ambitions. The paper also dubs him \"Daddy fool\", a play on the Boney M 1970s hit.Moving to news closer to home, the Daily Express reports that Chancellor Rachel Reeves has been criticised by the Tories for costing the UK jobs after it emerged that pubs will face \"years of huge tax rises\". The party is accusing Reeves of \"shutting up shop\" in the nation's High Streets after the Treasury said tax relief to help landlords cope with increases to business rates will \"slowly unwind\" over the next three years.The Metro carries a report from an ongoing court case in London where a jury heard that a friend of Donald Trump's son Barron said he saved her life during an attack. The paper says the US president's youngest son called police after seeing his friend being assaulted by her former boyfriend during a FaceTime call.Finally, in the wake of Prue Leith stepping down as judge of The Great British Bake Off, the Sun reports that Nigella Lawson is a \"choux-in\" for her replacement.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Trump hails Greenland deal' and 'All I want is a piece of ice'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3b14/live/5b8e2be0-f725-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T00:12:49.000Z",
      "dateModified": "2026-01-22T00:12:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canadian man poses as pilot to score hundreds of free flights, prosecutors say",
    "url": "https://www.bbc.com/news/articles/c5y223170vdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/148d/live/8f5e0390-f721-11f0-99cd-0fa60e41b00f.jpg",
    "tag": "Trending",
    "date": "2026-01-21T23:33:58.000Z",
    "description": "If Leonardo DiCaprio's Catch Me If You Can ever needed a sequel, prosecutors say real life may have already written one.A Canadian man, Dallas Pokorni",
    "body": "If Leonardo DiCaprio's Catch Me If You Can ever needed a sequel, prosecutors say real life may have already written one.A Canadian man, Dallas Pokornik, is accused of masquerading as both a pilot and a flight attendant, allegedly raking in hundreds of free flights over four years, US authorities said. Prosecutors allege the 33-year-old Toronto native created a fake employee identification card to receive free flights on US airlines - and at one point even asked to sit in the cockpit.Pokornik was arrested in Panama and extradited to the United States, where he now faces wire fraud charges.The BBC has contacted Pokornik's lawyer for comment. The scheme, outlined in court documents, bears striking similarities to the 2002  DiCaprio film in which a charming teenager running from the FBI impersonates a pilot to jet around the world.Prosecutors say Pokornik had previously worked legitimately as a flight attendant for a Canadian airline from 2017 to 2019, but was not employed by any airline at the time of the alleged fraud.In the years after Pokornik's employment on that airline, prosecutors allege that Pokornik used a fake badge defrauding three US airlines out of flights reserved for pilots and flight attendants. At one point, Pokornik requested to sit in a \"jump seat\" in a plane's cockpit, a spot reserved for off-duty pilots, despite not being a pilot or having an airman's certificate, prosecutors allege in court documents. But whether Pokornik ever actually did ride with the pilots on a flight is unclear. The US airlines are not named in the indictment but are identified as being headquartered in Honolulu, Chicago and Fort Worth, Texas. Though the indictment currently only covers a period from January through October 2024, prosecutors are aware of Pokornik's alleged misconduct over the course of four years, from January 2020 to October 2024, a justice department spokesperson told the BBC. If convicted, Pokornik faces up to 20 years in prison and a fine of up to $250,000, the Department of Justice said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canadian man poses as pilot to score hundreds of free flights, prosecutors say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/148d/live/8f5e0390-f721-11f0-99cd-0fa60e41b00f.jpg"
      ],
      "datePublished": "2026-01-21T23:33:58.000Z",
      "dateModified": "2026-01-21T23:33:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
    "url": "https://www.bbc.com/news/articles/cx2yd455rd0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6cda/live/381dde20-f6f4-11f0-8278-4b339fa4d49b.jpg",
    "tag": "Trending",
    "date": "2026-01-22T00:43:18.000Z",
    "description": "27 minutes agoAlex TaylorBBC NewsBBCNicky spent 10 years as a hostage negotiator for the Metropolitan PoliceBeing a parent and working as a hostage ne",
    "body": "27 minutes agoAlex TaylorBBC NewsBBCNicky spent 10 years as a hostage negotiator for the Metropolitan PoliceBeing a parent and working as a hostage negotiator don't immediately appear to have a lot in common, but someone who has been both says tricks she learnt in her profession can help you at home.Nicky Perfect spent over 30 years as a Metropolitan Police officer, including 10 years as an international hostage and crisis negotiator, in the elite New Scotland Yard Hostage and Crisis Negotiation Unit.At times, she says, knowing what to do or say as a parent, can feel high-stakes - the difference between keeping the peace and a full-on meltdown or argument.Here are the three techniques from her high-pressure career which will help you stay calm and in control as a parent, she told the BBC's Parenting Download podcast, 1. Give them a 'no choice choice'Getty ImagesKids regularly push boundaries and often want to do the opposite of what you ask them.In situations like these rather than asserting your authority and using the \"because I said so\" phrase, try the \"no choice choice\", trick, says NIcky.This means reframing the situation by continuing to enforce one choice, but doing so in a manner that still gives your child a sense of control and influence. So, asking a child whether they want to put their coat on in the house or when they go outside, for example, can help them feel heard, respected and involved - all while leading to the same outcome.Another example could be giving a child that is refusing to eat vegetables the option between broccoli or sprouts.This may not work every time, but it can help limit immediate resistance.2. Wait 90 seconds before respondingGetty ImagesWhen dealing with sensitive topics, Nicky advises not responding for 90 seconds to  stop you responding emotionally.As an FBI agent once told her: \"your job in life is not to change people… you can't… the only thing you can choose is how to respond.\"It is important to remember this choice exists even when emotions threaten to overwhelm the logical side of our brain.\"The response might just be, 'do you know what? I'm being quite emotional now. I need to go away and think about this',\" says Nicky. \"Or it might be you just don't say anything, and you listen to what they've got to say.\"As a co-parent, she had to put this into practice herself when her stepdaughter admitted she wanted to spend Christmas Day with her dad and siblings after they moved further away.Internally, Nicky desperately wanted her to stay. But, she says, \"somewhere along the line you have to press the pause button... and say this is your Christmas. It's a day in my life. What do you want?\"Accepting this made it easier for her to decide how to spend the day herself - as well as plan a new way of celebrating together with her stepdaughter, either before or after.3. See their perspective Getty ImagesSeeing the world from the other person's point of view, be they big or small, is key, says Nicky.This way you can sell the benefits of your outcome to the other person, while also making them feel heard.\"It's called the 'power of' negotiation, because if you give people reasons why something should or shouldn't happen, they're more likely to accept it,\" says Nicky.\"It's about recognising it and being really honest with people. People are far more receptive to your honesty than you think they're going to be,\" she says.Take the common problem of tantrums over bedtime. Children can often struggle with the loss of autonomy that a sudden bedtime announcement brings.A solution, says Nicky, is to consider how the child feels in that moment, rather than view it as an adult.  If they're enjoying playing and then you suddenly say it's time to go to bed, this can feel abrupt and naturally upset them.Instead, her suggestion is to prepare the child as soon as they get home - weaving the night time routine naturally into the conversation and reinforcing it regularly throughout the evening. Something like \"we'll have dinner, then watch some TV and then it's bedtime\" acts as a good framework.The child then feels more involved and aware of what is coming, even if they don't necessarily like it - meaning hopefully fewer tantrums.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6cda/live/381dde20-f6f4-11f0-8278-4b339fa4d49b.jpg"
      ],
      "datePublished": "2026-01-22T00:43:18.000Z",
      "dateModified": "2026-01-22T00:43:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ghislaine Maxwell to testify before Congress in Epstein probe",
    "url": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fac/live/8ac48f00-f705-11f0-a665-fb6bca5a5e3d.jpg",
    "tag": "Trending",
    "date": "2026-01-21T20:15:36.000Z",
    "description": "Ghislaine Maxwell, the jailed associate of convicted sex offender Jeffrey Epstein, has agreed to testify under oath before the congressional committee",
    "body": "Ghislaine Maxwell, the jailed associate of convicted sex offender Jeffrey Epstein, has agreed to testify under oath before the congressional committee investigating the federal government's handling of the Epstein cases.Committee chairman James Comer, who is leading the investigation, says Maxwell will depose virtually on 9 February. Maxwell's legal team has previously said she would decline to answer questions under her constitutional right to remain silent unless she is granted legal immunity. Comer, previewing the deposition, said, \"her lawyers have been saying she is going to plead the Fifth,\" referring to the US Fifth Amendment right to decline to speak to authorities.The announcement from the House Oversight and Government Reform Committee  comes as the Trump administration continues to come under fierce scrutiny for its handling of the Epstein case.Maxwell is currently serving a 20-year prison sentence for recruiting and trafficking  teenage girls for sexual abuse by Epstein.  In July, the committee declined to offer Maxwell legal immunity in exchange for her testimony.In August, the committee issued legal summons to Maxwell, requiring her to submit evidence under oath. Maxwell's legal team said that requiring her to both testify from jail, and without any legal immunity, were \"non-starters\".The lawyers said she \"cannot risk further criminal exposure in a politically charged environment without formal immunity\" as speaking from prison \"creates real security risks and undermines the integrity of the process\".House lawmakers cannot force Maxwell to waive her Fifth Amendment protections.On Tuesday, Maxwell's legal team said in a letter to the committee that she would continue to refuse to testify.\"Put plainly, proceeding under these circumstances would serve no other purpose than pure political theater and a complete waste of taxpayer monies,\" the attorneys wrote. \"The Committee would obtain no testimony, no answers, and no new facts.\"Maxwell, who was convicted in 2021, had appealed against the conviction to the  Supreme Court last October but the top court declined to hear the former British socialite's appeal.Her only route to leave prison early would be a presidential pardon, unless she is able to persuade a federal judge in New York to vacate or amend her sentence. The White House has denied that Trump is considering granting her clemency, however, Trump has also said he has not ruled it out.Separately, the Department of Justice faced a deadline of 19 December last year to release all remaining Epstein files in their possession. So far only a fraction of them have been made public.The department has faced criticism from lawmakers on both sides of the aisle over the number of redactions in the files, which the law permits only to protect victims' identities and active criminal investigations.Meanwhile, the House committee is also meeting to discuss former President Bill Clinton and his wife Hillary Clinton's refusal to appear before the panel to answer questions related to the investigation into Epstein.The committee has said it is considering filing contempt charges against the two. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ghislaine Maxwell to testify before Congress in Epstein probe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fac/live/8ac48f00-f705-11f0-a665-fb6bca5a5e3d.jpg"
      ],
      "datePublished": "2026-01-21T20:15:36.000Z",
      "dateModified": "2026-01-21T20:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US to transfer Islamic State prisoners from Syria to Iraq",
    "url": "https://www.bbc.com/news/articles/cx20pwqkgp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/75eb/live/cc6be330-f6ed-11f0-9c4a-e59460e06bbd.jpg",
    "tag": "Trending",
    "date": "2026-01-21T20:09:57.000Z",
    "description": "5 hours agoThomas MackintoshandRachel HaganThe US military has begun the transfer up to 7,000 Islamic State (IS) group detainees from prisons in north",
    "body": "5 hours agoThomas MackintoshandRachel HaganThe US military has begun the transfer up to 7,000 Islamic State (IS) group detainees from prisons in north-eastern Syria to Iraq, as Syria's new government takes control of areas long run autonomously by Kurdish-led forces.US Central Command (Centcom) said it had already moved 150 IS fighters from Hassakeh province to a \"secure location\" in Iraq.It said the move aimed to prevent prisoners breaking out and regrouping.The transfer follows a ceasefire agreement that has brought much of Syria's north east under Damascus control, after the Kurdish-led Syrian Democratic Forces (SDF) withdrew from key areas, including detention sites holding thousands of IS suspects and their relatives.CENTCOM said its commander Admiral Brad Cooper discussed the transfers with Syria's new president Ahmed al-Sharaa, stressing the need for Syrian forces to uphold the ceasefire and avoid any action that could interfere with what he described as an \"orderly and secure transfer\" of detainees.Rights group Reprieve warned that detainees transferred to Iraq could face torture and execution and urged the UK government to establish whether any British nationals were among those being moved.The charity said it believed there were no more than 10 British men held in the prisons, though exact numbers were unclear. Around 55 to 60 British nationals, most of them children, remain detained across camps and prisons in the region, it said.Despite the ceasefire there have been fresh clashes, with Syria's defence ministry saying seven soldiers were killed in a drone attack in Hassakeh on Wednesday, describing the incident a violation of the ceasefire.The SDF denied carrying out the strike and accused Damascus of also launching attacks, including near the town of Kobane on the Turkish border.The government and SDF had earlier blamed each other over the escape of suspected IS fighters from an SDF-run prison in Shaddadi, in southern Hassakeh.Syria's interior ministry said on Monday night that its special forces and army soldiers had entered the town following \"the escape of around 120 [IS] terrorists\" from the prison. It said security forces later recaptured 81 of the fugitives.The SDF said it had lost control of the prison following clashes with \"Damascus-affiliated factions\", warning of a \"serious security catastrophe\".SDF spokesman Farhad Shami said around 1,500 IS members may have escaped during the clashes, according to Reuters news agency. The SDF also accused government forces of attacking al-Aqtan prison, north of the city of Raqqa, which is also holding IS members and leaders.The SDF helped US-led forces defeat IS during Syria's 13-year civil war and, backed by the US, went on to jail around 12,000 IS members, including thousands of foreigners, while detaining tens of thousands of relatives in camps across the north east.However US special envoy Tom Barrack has said the US alliance with the SDF had \"largely expired\" and that his country was currently focused on securing IS detention facilities and facilitating talks between the SDF and al-Sharaa's government.\"This moment offers a pathway to full integration into a unified Syrian state with citizenship rights, cultural protections, and political participation - long denied under Bashar al-Assad's regime,\" he wrote on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US to transfer Islamic State prisoners from Syria to Iraq",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/75eb/live/cc6be330-f6ed-11f0-9c4a-e59460e06bbd.jpg"
      ],
      "datePublished": "2026-01-21T20:09:57.000Z",
      "dateModified": "2026-01-21T20:09:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dame Prue Leith leaves The Great British Bake Off",
    "url": "https://www.bbc.com/news/articles/cm2j80g4vy3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/adbe/live/fb5bad20-f6dd-11f0-a4dd-a5af35a571cb.jpg",
    "tag": "Trending",
    "date": "2026-01-21T16:06:13.000Z",
    "description": "9 hours agoSteven McIntoshEntertainment reporterDame Prue Leith is to leave The Great British Bake Off after almost a decade as a judge on the show.Th",
    "body": "9 hours agoSteven McIntoshEntertainment reporterDame Prue Leith is to leave The Great British Bake Off after almost a decade as a judge on the show.The 86-year-old replaced Dame Mary Berry on the series in 2017, appearing alongside fellow judge Paul Hollywood.In a statement posted on Instagram, Dame Prue said \"now feels like the right time to step back\", adding: \"There's so much I'd like to do.\"Broadcaster Channel 4 has not yet been announced who will take over from her on the series.The announcement comes after Dame Prue stepped down from the celebrity version of Bake Off in 2024. She was replaced by Lady Caroline Waldegrave.Alison Hammond and Noel Fielding are the current Bake Off presenters, but Dame Prue has also appeared with previous hosts Sandi Toksvig and Matt Lucas.Paying tribute to his co-star, Hollywood wrote on Instagram: \"You're the best Prue!\"Dame Prue said: \"Bake Off has been a fabulous part of my life for the last nine years, I have genuinely loved it and I'm sure I'll miss working with my fellow judge Paul, Alison and Noel and the teams at Love Productions and Channel 4.\"But now feels like the right time to step back (I'm 86 for goodness sake!), there's so much I'd like to do, not least spend summers enjoying my garden.\"She added: \"Whoever joins the team, I'm sure they'll love it as much as I have. I feel very lucky to have been part of it.\"Dame Prue was hired for Bake Off after the series jumped from the BBC to Channel 4 in 2016.She replaced Dame Mary, who left the show along with presenters Mel Giedroyc and Sue Perkins after the move.Channel 4's chief content officer Ian Katz said Dame Prue had been \"a joyous presence in the tent, pairing absolute culinary authority with great generosity and empathy for the bakers\". \"We are grateful for her passion, her wit, her ineffable style, and all the summers she spent in the tent.\"He added: \"She leaves an indelible mark on the show and all its bakers. We will miss her wry, gentle judgement but look forward to working with her on new projects.\"Former contestants also commented on Instagram to share their tributes to Leith.Jasmine Mitchell, who won Bake Off in 2025, wrote: \"Prue, you're amazing and we will miss you so very much.\"Dr Rahul Mandal, who won in 2018, added: \"We will miss you so much. It was a joy and privilege to be in the tent with you. You are kind, funny passionate and always inspired us.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dame Prue Leith leaves The Great British Bake Off",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/adbe/live/fb5bad20-f6dd-11f0-a4dd-a5af35a571cb.jpg"
      ],
      "datePublished": "2026-01-21T16:06:13.000Z",
      "dateModified": "2026-01-21T16:06:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
    "url": "https://www.bbc.com/news/articles/c70l9531pd1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/932c/live/f15adff0-f695-11f0-a096-99c1f7341c2b.jpg",
    "tag": "Trending",
    "date": "2026-01-21T19:54:14.000Z",
    "description": "5 hours agoKaty WatsonAustralia correspondentReutersA makeshift memorial was created after the 14 December attack at Bondi Beach From the outside, the",
    "body": "5 hours agoKaty WatsonAustralia correspondentReutersA makeshift memorial was created after the 14 December attack at Bondi Beach From the outside, the vacant shop on the corner of a busy avenue in central Sydney looks abandoned. Plastic sheeting is taped across all the windows and there's a large padlock hanging on the door handle.Step inside, though, and you're greeted by cuddly toys, candles, trinkets and messages of hope scribbled on large sheets.All of them come from a makeshift memorial that was created after the 14 December attack at Bondi Beach that killed 15 people.So when the Sydney Jewish Museum and the Australian Jewish Historical Society heard that the memorial would be removed by the local council, they sprang into action to ensure everything contained within it could live on.BBC/Katy WatsonA pair of shoes from Matilda Bee - the youngest victim of the attack - are among the items which will be used in a permanent memorialMany of the items now live in neat squares made out of masking tape on the shop floor. One says \"bees\" - within it are dozens of knitted and cuddly insects - a nod to 10-year-old Matilda Bee, the youngest victim of the attack. Another has a heap of deflated foil balloons – again, mostly bees. There's also a box of stones – Jewish mourners traditionally place a stone on a grave instead of flowers – as well as flags, books, Christmas decorations and even a Barbie cracker. Some families who were unable to go to any of the vigils in Bondi have also paid a visit to the spaces housing the tributes.\"It was too overwhelming to be in Bondi, but in this space it was very quiet. And I think to see everything laid out and the amount, they found it really moving and meaningful,\" said Shannon Biederman, the senior curator at the Sydney Jewish Museum.Families also came to the flower space and were given flower pressing to do, while artists and community members joined in too.For Shannon, memorialising the items is a deeply personal task.Her family were regular attendees of Chanukah by the Sea - the festival targeted by the alleged gunmen. They had bought tickets to go but at the last minute, they changed their mind.They also knew the family of Rabbi Eli Schlanger, one of the 15 victims.\"I do work in a Holocaust museum, so the murder of Jews isn't something that I'm not used to, and I've learned to compartmentalise,\" she says. \"But it's different because I'm used to working with history and this is now, and we are a museum of memory, but we're still very much live in [this].BBC/Katy WatsonShannon Biederman and her family were regular attendees of Chanukah by the SeaAustralian Prime Minister Anthony Albanese was among the first to lay a bouquet in front of the Bondi Pavilion the morning after the attack. Over the course of a week, the tributes spread like a wave across the forecourt.The massacre at Bondi was Australia's worst mass shooting in nearly three decades and left the country reeling. It also saw people pointing the blame at the government for letting something like this happen to a community that had been repeatedly warning authorities about a rise in antisemitism in recent years.But the conversation is now trying to focus on bringing people together - a sentiment the community wants to see continued in a permanent memorial to the dead.On Thursday, landmarks across the country will also be lit up and a minute's silence held in honour of the victims. Australians are also being asked to perform a mitzvah – an everyday act of kindness such as checking in on a neighbour or a donation - a Jewish tradition and a way to bring people together after last month's attack.How the memorial will live on is still unclear – several artists have come forward, keen to work with some of the material but a committee will make the final decisions.'I started with a lot of anger' And while the toys and trinkets were catalogued - there was the greater challenge of dealing with the  flowers that had been left behind. Volunteers helped to preserve the three tonnes of bouquets and wreaths that were loaded into black bags and taken to a separate warehouse in North Sydney.The process was confronting, says Nina Sanadze, a Jewish artist from Melbourne, whose idea it was to save all the flowers and oversaw the operation.\"When they brought them here, they looked like 100 bodies,\" Nina says. \"It was shocking again.\"Once at the warehouse, dozens of volunteers began the slow process of hanging them up on metal fences that had also been sourced in haste.They also had to wear masks to protect themselves from the large amount of pollen circulating. Instagram/@picciesforpotatoWorkers wrapping up floral tributes in massive black sheets of plasticShannon also feared that the sheer quantity of flowers and the gases they were emitting could create a compost fire, so volunteers had to monitor temperatures carefully and brought in fans.\"The smell and the moisture here in the warehouse was overwhelming,\" says Nina. \"It was like being inside a perfume shop.\"Meanwhile the flowers kept on coming.\"After the council made decision to clean up this big collection of flowers, people continued to bring them,\" explains Nina. \"We had volunteers to go at night and collect them otherwise they'd get thrown away.\"BBC/Katy WatsonCardboard boxes full of flower bouquets sit in the warehouse waiting to be sortedThe stalks have been saved for compost – which Nina says she's considering turned into some kind of furniture.Some of the rose buds had also started to rot, but she's dried them out and made a resin artwork scattered with the salvageable petals.\"There's a lot of decay and sadness as well as beauty,\" she says of her improvised creation. \"[It] takes it straight into the storytelling of what happened - it's not a thing of perfect beauty but it's a story, it's a heartbreak and love all together.\"Though a heavy task, for many of the volunteers, helping preserve the mountain of tributes left at the site is a form of therapy. And while the concept for the memorial is still germinating, Nina has already pinned down the title.\"Petal by Petal,\" she says confidently. It speaks to the way volunteers have had to methodically go about preserving the material, and symbolises her own slow processing of the attack.\"I started with a lot of anger coming here,\" Nina admits. \"I feel like I'm leaving in better spirits.\"She hopes the resulting artworks and memorials can help the community do the same.\"It can soften hearts, it can communicate,\" she says. \"And one of the things with flowers is not only they speak of the fragility of humans, but also they have no language, everybody understands flowers.\"BBC/Katy WatsonNina Sanadze and a team of volunteers are memorialising the flowers ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/932c/live/f15adff0-f695-11f0-a096-99c1f7341c2b.jpg"
      ],
      "datePublished": "2026-01-21T19:54:14.000Z",
      "dateModified": "2026-01-21T19:54:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Decision to run Manchester to London 'ghost train' 'uninformed', regulator admits",
    "url": "https://www.bbc.com/news/articles/cx2ydq20drlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f013/live/3c9cba10-f6f5-11f0-bb31-83eb955a217a.jpg",
    "tag": "Trending",
    "date": "2026-01-21T21:42:27.000Z",
    "description": "3 hours agoKaty AustinTransport correspondentGetty ImagesThe rail regulator has admitted it \"did not have all the facts\" when it decided to not allow ",
    "body": "3 hours agoKaty AustinTransport correspondentGetty ImagesThe rail regulator has admitted it \"did not have all the facts\" when it decided to not allow passengers on a peak-time train service between Manchester and London.The Office of Road and Rail (ORR) said it was missing \"critical points\" when it made a decision that would have turned the service into a 'ghost train' running daily for months.ORR chief executive John Larkinson said his organisation did not know the train would be \"fully crewed\", would leave from Manchester Piccadilly rather than a depot, and that it had to get to Euston to become the 09:30 GMT service to Glasgow.\"The information that later became available to us meant that our assumption turned out to be incorrect,\" he said.It comes after the ORR in November faced a backlash over its decision to allow the popular 07:00 train to run, but carrying only staff.The decision, which would have taken effect from mid-December, was quickly reversed after significant criticism.The ORR had justified the decision by saying the service had to run empty so its slot could be used as a firebreak - a planned gap in the timetable in case of delays.But, in a letter to the chair of Parliament's Transport Committee, Ruth Cadbury, Larkinson said the facts which later came to light meant the slot could no longer be considered an effective firebreak.Larkinson said the ORR team assessing the application didn't ask Avanti for further information, which would have made the points clear.He said if the ORR team had contacted Avanti, its decision \"may have been different, but they were stretched and trying to close out multiple interacting decisions\".He added that the ORR was dealing at the time with 82 \"complex and competing\" applications for track access.Even when the train operating company complained in early November, the points they made were not \"escalated appropriately\", his letter said.Larkinson described it as \"an unusual case, but nevertheless one we will learn from\".He added: \"I take full responsibility for what happened and we are strengthening our processes to reflect the lessons we have learned.\"A statement in response from Cadbury, the Labour MP for Brentford and Isleworth, said: \"The public was understandably baffled by the ORR's decision not to allow the 7am fast service from Manchester to London to carry passengers when a fully crewed train was running anyway.\"On the face of it, this was a strange decision - especially when the train was popular and profitable - and one that the Transport Committee had a number of questions about.\"Now we have some answers, a detailed explanation for why this happened and a welcome recognition of responsibility.\"She said the committee will look for ways to avoid similar instances in the future as the government establishes Great British Railways.The ORR said it has \"a good track record\" of striking the right balance. A spokesperson said: \"In this instance we were given new information after our decision was made which we did not properly consider, although we should have done and as a result, we missed the opportunity to re-visit our decision. \"When all the facts were made clear, we moved quickly to maintain the service for passengers.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Decision to run Manchester to London 'ghost train' 'uninformed', regulator admits",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f013/live/3c9cba10-f6f5-11f0-bb31-83eb955a217a.jpg"
      ],
      "datePublished": "2026-01-21T21:42:27.000Z",
      "dateModified": "2026-01-21T21:42:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oldest cave painting could rewrite origins of human creativity",
    "url": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c974/live/49574100-f635-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-21T16:00:07.000Z",
    "description": "Oldest cave painting of red claw hand could rewrite human creativity timeline9 hours agoPallab GhoshScience CorrespondentA stencilled outline of a han",
    "body": "Oldest cave painting of red claw hand could rewrite human creativity timeline9 hours agoPallab GhoshScience CorrespondentA stencilled outline of a hand found on the Indonesian island of Sulawesi is the world's oldest known cave painting, researchers say.It shows a red outline of a hand whose fingers were reworked, researchers say, to create a claw-like motif which indicates an early leap in symbolic imagination.The painting has been dated to at least 67,800 years ago – around 1,100 years before the previous record, a controversial hand stencil in Spain.The find also strengthens the argument that our species, Homo sapiens, had reached the wider Australia–New Guinea landmass, known as Sahul, by around 15,000 years earlier than some researchers argue.Over the past decade, a series of discoveries on Sulawesi has overturned the old idea that art and abstract thinking in our species burst suddenly into life in Ice Age Europe and spread from there.Cave art is seen as a key marker of when humans began to think in truly abstract, symbolic ways – the kind of imagination that underpins language, religion and science.Early paintings and engravings show people not just reacting to the world, but representing it, sharing stories and identities in a way no other species is known to have done.Professor Adam Brumm of Griffiths University in Australia, who co-led the project, told BBC News, that the latest discovery, published in the journal Nature, adds to the emerging view that there was no awakening for humanity in Europe. Instead, creativity was innate to our species, the evidence for which stretches back to Africa, where we evolved.\"When I went to university in the mid to late 90s, that's what we were taught – the creative explosion in humans occurred in a small part of Europe. But now we're seeing traits of modern human behaviour, including narrative art in Indonesia, which makes that Eurocentric argument very hard to sustain\".The oldest Spanish cave art is a red hand stencil in Maltravieso cave in Western Spain, dated to be at least 66,700 years old - though this is controversial and some experts don't think it to be that old. In 2014, hand stencils and animal figures dating back at least 40,000 years were found in Sulawesi, followed by a hunting scene that is at least 44,000 year old, and then a narrative pig and human painting dated to at least 51,200 years ago. Each step pushed sophisticated image making further back in time, according to Professor Maxime Aubert of Griffiths University.\"We started with minimum ages of at least 40,000 years, the same time as in Europe, but by getting closer to the pigment we've pushed the rock art in Sulawesi back by at least another 28,000 years\".The latest discovery is from a limestone cave called Liang Metanduno on Muna, a small island off south eastern Sulawesi. It has been spray-painted: an ancient graffiti artist pressed their hand flat against the cave wall, then blew or spat a mouthful of pigment around it so that, when they pulled the hand away, a negative outline was left behind on the rock.One fragmentary hand stencil there is overlain by thin mineral crusts that, when analysed, was found to have a minimum age of 67,800 years, making it the oldest reliably dated cave art anywhere in the world.Crucially, the artist did more than simply spray pigment around a hand pressed to the wall, the researchers say.Ahdi Agus OktavianaMore recent elongated hand stencils found elsewhere in Suluwesi shows how prevalent the red claw image was among these ancient artists.After the original stencil was made, the outlines of the fingers were carefully altered – narrowed and elongated to make it look more claw-like; a creative transformation that Brumm argues is \"a very us thing to do\".  He notes that there was no evidence of that experimentation in any of the art produced by our sister species, Neanderthals, in their cave paintings in Spain around 64,000 years ago. Even that is hotly contested because some researchers question the dating method.Until this latest discovery on Muna, all the paintings in Sulawesi had come from the Maros Pangkep karst in the island's south west. The fact that this much older stencil turns up on the opposite side of Sulawesi, on a separate satellite island, suggests that making images on cave walls was not a local experiment but deeply embedded in the cultures that spread across the region.Brumm says years of fieldwork by Indonesian colleagues have revealed \"hundreds of new rock art sites\" across remote areas, with some caves used repeatedly over tens of thousands of years. At Liang Metanduno, other, much younger paintings on the same panel – some produced as late as about 20,000 years ago – show that this single cave was a focus for artistic activity stretching over at least 35,000 years.Because Sulawesi lies on the northern sea route between mainland Asia and ancient Sahul, the dates have direct implications for assessing when the ancestors of Aboriginal Australians first arrived.For years, the mainstream view – based largely on DNA studies and most archaeological sites – was that Homo sapiens first reached the ancient Australia–New Guinea landmass, Sahul, about 50,000 years ago. But with firm evidence that Homo sapiens were settled on Sulawesi and making complex symbolic art at least 67,800 years ago, it makes it much more likely that controversial archaeological evidence for humans in northern Australia by about 65,000 years is correct, according to Adhi Agus Oktaviana, of the Indonesia's national research and innovation Agency (BRIN).\"It is very likely that the people who made these paintings in Sulawesi were part of the broader population that would later spread through the region and ultimately reach Australia.\"Many archaeologists once argued for a European \"big bang\" of the mind because cave paintings, carvings, ornaments and new stone tools all seem to appear together in France and Spain about 40,000 years ago, soon after Homo sapiens arrived there. Spectacular Ice Age cave art in places like Altamira and El Castillo encouraged the idea that symbolism and art switched on almost overnight in Ice Age Europe. Since then, engraved ochre, beads and abstract marks from South African sites such as Blombos Cave, some 70,000–100,000 years old, have shown that symbolic behaviour was already established in Africa long before.Along with very old figurative and narrative paintings from Sulawesi, a new consensus is being shaped; that there was a much deeper and more widespread story of creativity, Aubert told BBC News.\"What it suggests is that humans would have had that capacity for a very long time, at least when they left Africa – but probably before that\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oldest cave painting could rewrite origins of human creativity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c974/live/49574100-f635-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-21T16:00:07.000Z",
      "dateModified": "2026-01-21T16:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel postpones demolition of Palestinian children's football pitch in Bethlehem",
    "url": "https://www.bbc.com/news/articles/cly3dm37m7no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d33f/live/cbd6f2f0-f53c-11f0-baa4-a73bb1be8170.jpg",
    "tag": "Trending",
    "date": "2026-01-21T15:34:10.000Z",
    "description": "10 hours agoJohn SudworthJerusalemBBC NewsThe Aida Youth Centre's pitch sits next to the barrier separating the occupied West Bank from IsraelIsrael h",
    "body": "10 hours agoJohn SudworthJerusalemBBC NewsThe Aida Youth Centre's pitch sits next to the barrier separating the occupied West Bank from IsraelIsrael has postponed the demolition of a Palestinian children's football club in the city of Bethlehem, in the occupied West Bank.It said the Aida Youth Centre's pitch was constructed without the necessary permits. It said the demolition was necessary for security reasons. An international campaign to save it, including a petition with more than half a million signatures, appears to have forced the authorities to reconsider. The club, however, said it had not yet received any official notification.It is barely a 10th of the size of a full-scale football field, there are patches of rust on the goalposts and, towering over the length of one of the touchlines, the architecture of conflict looms large in Israel's concrete security barrier.But while it may not rank high up among the world's iconic sporting venues, this children's football club has found itself at the centre of a hard-fought international campaign for its survival.And despite the asymmetrical odds as it took on the Israeli state, that campaign appears - for now at least - to have worked.The club has won a reprieve against the threat of demolition by the Israeli military, which claimed that the pitch was far too close to the barrier.On the very northern edge of Bethlehem, construction of the pitch began in 2020 with the aim of providing a place to practise football for more than 200 young players from the nearby Aida refugee camp.The cramped and crowded streets contain the homes of the descendants of Palestinian families who were forced or who fled from their homes during the 1948 Arab-Israeli war.On 3 November last year, as the children made their short walk from the camp for that day's training, they found a notice pinned to the gate of the football field declaring it to be illegal.The notice was followed by a demolition order, issued at the end of December.\"We don't have anywhere else to play, 10-year-old Naya told me, wearing a Brazil shirt with the name of the footballing legend Neymar emblazoned on the back.\"We are building our dreams here,\" she said. \"If they demolish our field, they will demolish our dreams.\"I asked another young player, Mohammed, what his reaction was when he heard the news that the club was earmarked for destruction.\"I was upset,\" he told me. \"This is a field I really care for.\"The community fought back, posting videos on social media, launching a petition attracting hundreds of thousands of signatures as well as the reported interventions of senior officials from some of football's global and regional governing bodies.In its latest statement, the Israeli military repeated its claim that the football pitch, built so close to the wall, posed a security issue.But the BBC understands that a political decision has been made to postpone the demolition order \"for the time being\".Israel began building its concrete barrier in the early 2000s in the face of a wave of deadly suicide bombings and other attacks carried out by Palestinians which killed hundreds of Israelis.It says it is vital for Israel's protection and that it has dramatically cut the number of attacks.Palestinians, however, say that it has become a tool of collective punishment, separating them from their workplaces, dividing their communities and effectively annexing parts of their land.For them, the fight over the football pitch highlights a wider injustice.While they are being denied the right to keep a small sporting facility on the boundary of one of their cities, Israel is approving vast new settlements across the occupied West Bank and which are considered illegal under international law.The immediate threat may now have been averted for the football pitch.But the club is taking nothing for granted.Mohammad Abu Srour, one of the board members of the Aida Youth Centre, told me that they feared that the threat might come back when the club is out of the spotlight.\"We're going to continue to campaign,\" he told me.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel postpones demolition of Palestinian children's football pitch in Bethlehem",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d33f/live/cbd6f2f0-f53c-11f0-baa4-a73bb1be8170.jpg"
      ],
      "datePublished": "2026-01-21T15:34:10.000Z",
      "dateModified": "2026-01-21T15:34:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]