[
  {
    "title": "Stuffed",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mh8j/stuffed?at_mid=Wu6uMg3nXs&at_campaign=Stuffed&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mh8j&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Stuffed&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mmgb3h.jpg",
    "tag": "Trending",
    "date": "2025-12-13T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeStuffedStuffedThe Farooqis have an unforgettable Christmas when a surprise bonus leads to a Lapland holiday, but things go downhill fast after a disastrous discovery. Duration59 minsFirst shown13 Dec 2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesDaddy IssuesChild on the way – a man-child at home. Pregnant Gemma and her hapless dad Malcolm bondMammothBack from the past, and still baffled by the present. Tony's on a mission to get fitMotherlandThe brave women and men of the school run come face to face with playdate politics.Two Doors DownAll change at Latimer Crescent – Cathy’s gone! Can they cope with a single Colin?Gavin & StaceyThe absolute highs and awkward lows of a long-distance love affair. Plus...Smithy.The War Between the Land and the SeaWe inherited their world - they want it back. When oceans rise, whose side do you choose?Here We GoThe Jessop family try to rescue their 2020 summer holiday by going to Margate in October.29 minsWe Might Regret ThisThree’s a crowd? Artist Freya moves in with Abe – with her chaotic bestie as carerReturn to ParadiseComing home can be tough, but sometimes it's murder. An Aussie twist on Death in ParadiseShetlandEven the most beautiful places have a dark side. Detective Jimmy Perez returns homeMrs Brown's BoysChaos at the Browns with Agnes and her awful offspring.Have I Got News for You9/10 Professor Hannah Fry hosts, as Rev Richard Coles and Finlay Christie join the panel33 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stuffed",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mmgb3h.jpg"
      ],
      "datePublished": "2025-12-13T06:00:00.000Z",
      "dateModified": "2025-12-13T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cunk on Christmas",
    "url": "https://www.bbc.co.uk/iplayer/episode/b086kfhw?at_mid=yGmdmeJtmR&at_campaign=Cunk_on_Christmas&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=b086kfhw&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Cunk_on_Christmas&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p04l3yr7.jpg",
    "tag": "Trending",
    "date": "2022-09-20T05:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeCunk on ChristmasCunk on ChristmasContains very strong language.Mockumentary starring Diane Morgan as Philomena Cunk, who explores the traditions and trappings of Christmas, including pagan festivals, the Nativity and 'Sir Charles Dickings'. Duration30 minsFirst shown29 Dec 2016Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCunk on ShakespeareShorter than Hamlet, funnier than King Lear - Cunk's insightful documentary on the Bard29 minsCunk on LifeWhat’s the point? Philomena ventures right up the universe to really get to the nub of it1h 11mCunk on BritainPhilomena Cunk explores the Big Bang and interviews Robert Peston about British politics.Cunk on...Philomena Cunk’s epic mockumentary on civilisation, from prehistory to the present day.MandyMandy will stop at nothing to get the sofa of her dreams. Comedy with Diane Morgan.MotherlandThe brave women and men of the school run come face to face with playdate politics.StuffedSanta’s not the only one in deep snow. Can Arslan save a holiday he doesn’t believe in?59 minsMammothBack from the past, and still baffled by the present. Tony's on a mission to get fitA Ghost Story for ChristmasWoman of Stone. Mark Gatiss brings Edith Nesbit's chilling tale back to life30 minsHere We GoThe Jessop family try to rescue their 2020 summer holiday by going to Margate in October.29 minsDaddy IssuesChild on the way – a man-child at home. Pregnant Gemma and her hapless dad Malcolm bondGavin & StaceyThe absolute highs and awkward lows of a long-distance love affair. Plus...Smithy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cunk on Christmas",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p04l3yr7.jpg"
      ],
      "datePublished": "2022-09-20T05:00:00.000Z",
      "dateModified": "2022-09-20T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is The Erasmus Student Scheme Worth The Money? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mp71y1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-17T19:39:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·17 Dec 2025,·25 minsIs The Erasmus Student Scheme Worth The Money?NewscastAvailable for over a yearToday, the UK government announced it is set to rejoin the Erasmus study scheme. \nVictoria is joined Joe Pike to discuss - and they speak to Nick Thomas-Symonds, minister for EU relations about whether it’s worth the £570m cost.\nPlus, Andrea Egan becomes the new secretary general of the UK’s biggest union - Unison. We explain what that could mean for the Labour party and Keir Starmer’s leadership.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Victoria Derbyshire and Joe Pike. It was made by Jem Westgate and Laura Cain. The social producer was Beth Pritchard. The technical producer was Philip Bull. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is The Erasmus Student Scheme Worth The Money? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-17T19:39:00.000Z",
      "dateModified": "2025-12-17T19:39:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Has Trump’s chief of staff revealed White House secrets? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-17T22:19:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Dec 2025,·30 minsHas Trump’s chief of staff revealed White House secrets?AmericastAvailable for over a yearSusie Wiles is widely credited as being the mastermind behind Donald Trump’s successful presidential campaign last year. The White House Chief of Staff, referred to by the president as the “most powerful woman in the world”, is the gatekeeper to the Oval Office and a crucial figure in delivering Trump’s national agenda. \nShe also rarely speaks to the media, making her an elusive figure in the president’s top team despite her significant influence. But in a series of interviews for Vanity Fair, she refers to Donald Trump as having an “alcoholic’s personality”, describes JD Vance as a “conspiracy theorist” and Elon Musk as an “odd, odd duck”. The White House has described the articles as a “framed hit piece” and accused Vanity Fair of taking statements out of context.\nIn today’s podcast, Justin and Anthony go through some of the most revealing lines from the interviews, and speak to the journalist who sat down with Susie Wiles - Chris Whipple - to find out why he thinks Wiles wanted to speak with him, and how he responds to White House criticism of the interviews.\nHOSTS:\n• Justin Webb, Radio 4 Presenter\n• Anthony Zurcher, North America Correspondent\nGUEST:\nChris Whipple, Journalist and author of several White House books, including Uncharted: How Trump Beat Biden, Harris, and the Odds in the Wildest Campaign in History \nGET IN TOUCH:\n• Join our online community: https://discord.gg/qSrxqNcmRB\n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast\nThis episode was made by George Dabby with Alix Pickles. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including The Global Story, The Today Podcast, and of course Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsd\nThe Today Podcast: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzmProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Has Trump’s chief of staff revealed White House secrets? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-17T22:19:00.000Z",
      "dateModified": "2025-12-17T22:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK names Christian Turner as US ambassador, replacing Peter Mandelson ",
    "url": "https://www.bbc.com/news/articles/ckgmpnr4ex2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/006d/live/0ba8ee80-dc45-11f0-a1ce-39295e57b193.jpg",
    "tag": "Trending",
    "date": "2025-12-18T19:09:20.000Z",
    "description": "53 minutes agoTom BennettLondonReutersThe UK has named career diplomat Christian Turner as its new ambassador to the US, Downing Street has confirmed.",
    "body": "53 minutes agoTom BennettLondonReutersThe UK has named career diplomat Christian Turner as its new ambassador to the US, Downing Street has confirmed.Turner has spent nearly 30 years working across Whitehall and the Foreign Office.He will now become the man tasked by Prime Minister Sir Keir Starmer with building links to the Trump administration.The previous ambassador Peter Mandelson was sacked by Starmer after evidence, including emails and photos emerged, showing his continued association with the paedophile Jeffery Epstein.Lord Mandelson has repeatedly said he regrets his relationship with Epstein, who died in jail in 2019 while awaiting trial on sex trafficking offences.The Foreign Office said in a statement that King Charles had formally appointed Turner, and the UK would now seek official approval - or Agrément - for his appointment from the US.Turner said he was \"honoured\" to be nominated for the role. \"At a pivotal time for the transatlantic relationship, I look forward to working with President Trump's administration, and leaders in Congress, business and society to strengthen that bond in the years ahead,\" he said. Turner will face a heavy load of diplomatic tasks when he takes up the role.Chiefly among them is working with the US on President Donald Trump's push to end the war in Ukraine, which European nations fear will undercut the long-term interests of the continent in favour of a quick resolution.Earlier this month, the White House published its new national security strategy,  which claimed that Europe faced \"civilisational erasure\" and questioned whether certain European countries can remain reliable allies.The UK is also currently in talks with the US about a wide-ranging tech deal. In a statement released by the Foreign Office, Starmer said: \"The United Kingdom and United States have a very special relationship, and Christian's extensive experience as an outstanding diplomat will support this uniquely close bond and ensure it continues to flourish.\"Turner's previous roles include political director at the Foreign Office, British High Commissioner to Pakistan, and Foreign Office Director for the Middle East and North Africa. He also previously worked in 10 Downing Street as Private Secretary to the Prime Minister. Before entering government, he worked in television documentaries. Foreign Secretary Yvette Cooper said Turner would bring \"exceptional diplomatic experience and deep understanding\" to the role. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK names Christian Turner as US ambassador, replacing Peter Mandelson ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/006d/live/0ba8ee80-dc45-11f0-a1ce-39295e57b193.jpg"
      ],
      "datePublished": "2025-12-18T19:09:20.000Z",
      "dateModified": "2025-12-18T19:09:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "William Rush: Waterloo Road actor and son of Coronation Street's Debbie Rush dies aged 31",
    "url": "https://www.bbc.com/news/articles/cvg10gx4qe7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/167d/live/1f9e5750-dc3a-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-18T14:52:22.000Z",
    "description": "5 hours agoSteven McIntoshEntertainment reporterGetty ImagesWaterloo Road actor William Rush has died aged 31, his family has announced.Rush played sc",
    "body": "5 hours agoSteven McIntoshEntertainment reporterGetty ImagesWaterloo Road actor William Rush has died aged 31, his family has announced.Rush played schoolboy Josh Stevenson in the BBC One drama, appearing in 168 episodes between 2009 and 2013.As a child actor, he also appeared in Grange Hill and Shameless, and later went on to roles in Casualty and Vera.His mother, ex-Coronation Street actress Debbie Rush, announced on Instagram that William had died on Wednesday, adding: \"As a family, our hearts are completely broken.\" His cause of death has not been announced.Rush also auditioned for ITV talent show The X Factor in 2016, and made it as far as the \"six-chair challenge\", the stage between boot camp and judges' houses.Debbie Rush, an actress herself who played Anna Windass in Coronation Street for a decade, described William as \"our beautiful baby boy\", said: \"There are no words that can truly capture the depth of our loss.\"She also paid tribute to her son's decision to become an organ donor before he died.\"Even in our darkest moment, William gave the most precious gift of all,\" she said.\"Through being an organ donor, he has given hope and life to other families, thinking of others right to the very end. His kindness and love will forever be part of his legacy.\"We kindly ask that our privacy be respected as we navigate this unimaginable grief. William will always be loved, always missed, and forever in our hearts.\"Fellow Coronation Street stars left supportive messages on her post, with Sally Dynevor saying she was \"so shocked to hear this news\" and describing William as a \"beautiful boy\".Actor Jack P Shepherd said: \"Terrible to read that Debbie. Devastating news, thinking of you all,\" while Shobna Gulati wrote: \"Sending you all the love, I'm so sorry and my deepest sympathies.\"Chelsee Healey, who also appeared in Waterloo road, posted: \"My heart breaks for you all, I'm so so sorry.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "William Rush: Waterloo Road actor and son of Coronation Street's Debbie Rush dies aged 31",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/167d/live/1f9e5750-dc3a-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-18T14:52:22.000Z",
      "dateModified": "2025-12-18T14:52:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Covid denier jailed for three years after urging armed revolt ",
    "url": "https://www.bbc.com/news/articles/cy072n5w4wdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4790/live/99b79300-dc29-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-18T17:43:44.000Z",
    "description": "A Covid denier from south London has been sentenced to three years and three months in prison after urging people to stage an armed revolt during the ",
    "body": "A Covid denier from south London has been sentenced to three years and three months in prison after urging people to stage an armed revolt during the pandemic. The Old Bailey heard 60-year-old Paul Martin was a prolific poster in a Telegram group called The Resistance UK, and called on people to attack the UK's infrastructure.Martin hoarded weapons in his flat in South Norwood, including crossbows and pistols, although he was cleared of collecting them for the purposes of terrorism. He was found guilty of encouraging terrorism. Martin had denied both charges.He maintained during his trial that his two crossbows were \"purely for sport\" and that two pistols were the kind \"commonly used in fairgrounds\".Prosecutor Julia Faure-Walker told the court that his messages were designed to \"stir up the idea of violent revolt using weapons for his ideological cause\".The 10-member jury was shown messages he had posted on the Telegram online chat group.In December 2020 he wrote: \"It is a war, you better get ready to smash skulls and destroy evil.\"Martin also called for attacks on 5G and CCTV, saying that if groups attacked the UK's infrastructure, then the authorities would \"be running around like flies\".\"If we do lawful reb (rebellion), we need lots of us.\"\"And plenty Alpha men and women... it will be a war, and the police will do everything to stop us.\"Later he told the 8,000 strong group, to which he posted thousands of messages: \"You do know if it kicks off lives will be lost on both sides. That's the reality.\"In one post, Martin wrote: \"The simple fact is there is no pandemic, never has been. The main goal was to genocide all they can and enslave the survivors and make the children sterile with poison.\"\"Vaccine is a poison designed to kill you off over a short period.\"While giving evidence, he was questioned about his beliefs during the pandemic. He claimed he had feared that people would be forced to have the Covid vaccine.\"I thought we would lose our privilege of consent, that we'd be forced to have it,\" he told defence counsel Dominic Thomas.\"That gave me scary thoughts.\"What I see on the news, drag them out of the houses, jab them, all this.\"Martin suggested that he had \"fallen down a rabbit hole\" during the pandemic and denied he had ever intended to commit any violent acts himself.He told the court he was \"just talking twaddle\" and was writing things down as he thought them.Martin pleaded guilty to a charge of possessing a stun gun at the beginning of his trial but had denied the terrorism charges.Mr Thomas told the sentencing hearing that his client was eccentric and claimed there was a \"schoolboy quality\" to his interests.\"Martin had got a job and won the respect of both his manager and customers,\" he said.\"He is trying to let go of those previous obsessions. He is keeping stable hours, not drinking, he has taken himself off the internet entirely.\"But in the sentencing, Judge Richard Marks KC said the case involved \"recklessness on a very high scale and language of a virulent nature\". \"They [the messages] were posted to people who might have been very impressionable and not unsympathetic to the extreme views you were posting,\" he said.Cdr Dom Murphy, head of Counter Terrorism Policing London, said \"anyone who advocates violence in this way can expect to be arrested and prosecuted to the full extent of the law\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Covid denier jailed for three years after urging armed revolt ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4790/live/99b79300-dc29-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-18T17:43:44.000Z",
      "dateModified": "2025-12-18T17:43:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK to ban deepfake AI 'nudification' apps",
    "url": "https://www.bbc.com/news/articles/cq8dp2y0z7wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3266/live/44191530-dc34-11f0-a665-27b3eb61cb96.jpg",
    "tag": "Trending",
    "date": "2025-12-18T17:43:14.000Z",
    "description": "2 hours agoLiv McMahonTechnology reporterGetty ImagesThe UK government says it will ban so-called \"nudification\" apps as part of efforts to tackle mis",
    "body": "2 hours agoLiv McMahonTechnology reporterGetty ImagesThe UK government says it will ban so-called \"nudification\" apps as part of efforts to tackle misogyny online.New laws - announced on Thursday as part of a wider strategy to halve violence against women and girls - will make it illegal to create and supply AI tools letting users edit images to seemingly remove someone's clothing.The new offences would build on existing rules around sexually explicit deepfakes and intimate image abuse, the government said.\"Women and girls deserve to be safe online as well as offline,\" said Technology Secretary Liz Kendall.\"We will not stand by while technology is weaponised to abuse, humiliate and exploit them through the creation of non-consensual sexually explicit deepfakes.\"Creating deepfake explicit images of someone without their consent is already a criminal offence under the Online Safety Act.Ms Kendall said the new offence - which makes it illegal to create or distribute nudifying apps - would mean \"those who profit from them or enable their use will feel the full force of the law\".Nudification or \"de-clothing\" apps use generative AI to realistically make it look like a person has been stripped of their clothing in an image or video.Experts have issued warnings about the rise of such apps and the potential for fake nude imagery to inflict serious harm on victims - particularly when used to create child sexual abuse material (CSAM).In April, the Children's Commissioner for England Dame Rachel de Souza called for a total ban on nudification apps.\"The act of making such an image is rightly illegal – the technology enabling it should also be,\" she said in a report.The government said on Thursday it would \"join forces with tech companies\" to develop methods to combat intimate image abuse.This would include continuing its work with UK safety tech firm SafeToNet, it said.The UK company developed AI software it claimed could identify and block sexual content, as well as block cameras when they detect sexual content is being captured.Such tech builds on existing filters implemented by platforms such as Meta to detect and flag potential nudity in imagery, often with the aim of stopping children taking or sharing intimate images of themselves.'No reason to exist'Plans to ban nudifying apps come after previous calls from child protection charities for the government to crack down on the tech.The Internet Watch Foundation (IWF) - whose Report Remove helpline allows under-18s to confidentially report explicit images of themselves online - said 19% of confirmed reporters had said some or all of their imagery had been manipulated.Its chief executive Kerry Smith welcomed the measures.\"We are also glad to see concrete steps to ban these so-called nudification apps which have no reason to exist as a product,\" she said.\"Apps like this put real children at even greater risk of harm, and we see the imagery produced being harvested in some of the darkest corners of the internet.\"However while children's charity the NSPCC welcomed the news, its director of strategy Dr Maria Neophytou said it was \"disappointed\" to not see similar \"ambition\" to introduce mandatory device-level protections.The charity is among organisations calling on the government to make tech firms find easier ways to identify and prevent spread of CSAM on their services, such as in private messages.The government said on Thursday it would make it \"impossible\" for children to take, share or view a nude image on their phones. It is also seeking to outlaw AI tools designed to create or distribute CSAM.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK to ban deepfake AI 'nudification' apps",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3266/live/44191530-dc34-11f0-a665-27b3eb61cb96.jpg"
      ],
      "datePublished": "2025-12-18T17:43:14.000Z",
      "dateModified": "2025-12-18T17:43:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duke of Marlborough accused of strangling estranged wife",
    "url": "https://www.bbc.com/news/articles/c3v160g7n23o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/91a7/live/64fd4c60-dc0e-11f0-bd2b-d531d865f86a.jpg",
    "tag": "Trending",
    "date": "2025-12-18T12:40:41.000Z",
    "description": "8 hours agoHelena Wilkinson,News correspondent, OxfordandMarcus White,South of EnglandGetty ImagesThe duke married Edla Griffiths, his second wife, in",
    "body": "8 hours agoHelena Wilkinson,News correspondent, OxfordandMarcus White,South of EnglandGetty ImagesThe duke married Edla Griffiths, his second wife, in 2002 but they separated in 2024The Duke of Marlborough has been accused of strangling his estranged wife on three occasions in an 18-month period, court documents show.Charles James Spencer-Churchill, 70, formerly known as Jamie Blandford, has been charged with three counts of non-fatal intentional strangulation against Edla Marlborough.He had been due to appear before Oxford magistrates on Thursday morning but the court heard he was \"unable to attend\" and the case was adjourned ahead of a plea hearing at High Wycombe Magistrates' Court on 5 January.The attacks are alleged to have taken place in Woodstock, Oxfordshire, between November 2022 and May 2024.The twice-married aristocrat, formerly known as the Marquess of Blandford, was arrested on 13 May 2024.He inherited his dukedom in 2014, following the death of his father, the 11th Duke of Marlborough.He is a first cousin, three times removed, of Sir Winston Churchill and a distant relative of the late Princess Diana through the Spencer family.The duke married his second wife, Welsh ceramicist Edla Griffiths, in 2002 but they are thought to have separated in 2024.They are said to have met while she was living in Chelsea and working on her art, and they wed after dating for seven years.Blenheim PalaceFormer Prime Minister Sir Winston Churchill was born at Blenheim PalaceHis ancestral family home is Blenheim Palace in Woodstock – Sir Winston's birthplace - which is owned and managed by Blenheim Palace Heritage Foundation.The foundation said it was \"unable to comment on the charges, which relate to the duke's personal conduct and private life, and which are subject to live, criminal proceedings\".Related storiesRelated link",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duke of Marlborough accused of strangling estranged wife",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/91a7/live/64fd4c60-dc0e-11f0-bd2b-d531d865f86a.jpg"
      ],
      "datePublished": "2025-12-18T12:40:41.000Z",
      "dateModified": "2025-12-18T12:40:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigel Farage avoids police investigation into election spending",
    "url": "https://www.bbc.com/news/articles/cwyx2g9ek08o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d9f5/live/b4bf0110-d12f-11f0-a0cc-673bf7abfc30.jpg",
    "tag": "Trending",
    "date": "2025-12-18T18:55:41.000Z",
    "description": "Nigel Farage will not be investigated over claims Reform UK overspent on his campaign at the 2024 general election.Essex Police said it could not inve",
    "body": "Nigel Farage will not be investigated over claims Reform UK overspent on his campaign at the 2024 general election.Essex Police said it could not investigate the Clacton MP because more than a year had passed since the alleged offence.It followed a former member of Farage's campaign team claiming Reform spent more than the £20,660 spending limit set by law.A police spokeswoman said: \"Any prosecution for such an offence must commence within one year.\"She said an \"allegation around misreported expenditure by a political candidate\" in July 2024 was made on 5 December.\"It has been concluded that this report falls outside of the stated statutory time limit, and no investigation can take place,\" the spokeswoman added.The claims were made by ex-Reform campaigner Richard Everett.He alleged the party failed to declare spending on some leaflets, banners, utility bills and the refurbishment of a bar in the Clacton constituency office.Documents were passed to the Metropolitan Police, which transferred the case to Essex Police.The latter said the one-year time frame for investigating an alleged offence was enshrined in the Representation of the People Act 1983.However, Farage could still face an investigation by the Electoral Commission.He took over as leader of Reform UK in June 2024, about a month before the general election.Farage went on to win the seat of Clacton in Essex from the Conservatives with a majority of more than 8,000.Reform UK has been contacted for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigel Farage avoids police investigation into election spending",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d9f5/live/b4bf0110-d12f-11f0-a0cc-673bf7abfc30.jpg"
      ],
      "datePublished": "2025-12-18T18:55:41.000Z",
      "dateModified": "2025-12-18T18:55:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kennedy Center to be renamed Trump-Kennedy Center, White House says",
    "url": "https://www.bbc.com/news/articles/cp84pxvp87eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f9c/live/57355910-dc4a-11f0-83b4-4b97b1cc3247.jpg",
    "tag": "Trending",
    "date": "2025-12-18T20:03:04.000Z",
    "description": "11 minutes agoKwasi Gyamfi AsieduWashingtonThe board of the Kennedy Center has voted to rename the performing arts centre  the Trump-Kennedy Center, a",
    "body": "11 minutes agoKwasi Gyamfi AsieduWashingtonThe board of the Kennedy Center has voted to rename the performing arts centre  the Trump-Kennedy Center, according to the White House.Press Secretary Karoline Leavitt said on social media that the board voted unanimously to make the change due to \"the unbelievable work President Trump has done over the last year in saving the building\".Leavitt also congratulated President John F. Kennedy and said \"this will be a truly great team long into the future! The building will no doubt attain new levels of success and grandeur\".The change will certainly meet controversy, particularly in Washington DC where the centre has been an iconic landmark since it was constructed and named for Kennedy.Speaking in the Oval Office on Thursday, Trump said he was \"surprised\" and \"honoured\" by the decision. Shortly after taking office, Trump fired all the centre's board members, and replaced them with allies, who then voted to make Trump chairman of the board. His close adviser Richard Grenell became board president.Attorney General Pam Bondi, White House Chief of Staff Susie Wiles and Second Lady Usha Vance, as well as a number of other administration officials. and political allies are also currently on the board. The president also secured about $257 million in congressional funding to pay for major renovations and other costs at the venue, and had it recently host the Fifa World Cup draw.\"We saved it,\" Trump said of the centre on Thursday. \"It was really in bad shape, physically.\" While Leavitt and Trump both claimed that the board had \"unanimously\" voted to rename the centre, at least one board member has disputed that.\"This was not unanimous,\" said Ohio Democratic Representative Joyce Beatty, one of the board's members. \"I was muted on the call and not allowed to speak or voice my opposition to this move.\" Work on a national performing arts centre began in the 1950s and after Kennedy, the 35th president, was assassinated in 1963, Congress decided to turn it into a living memorial to him.Some US lawmakers and legal scholars have been quick to note that because the centre was named in a 1964 law, Congress must vote to make the name change official. A measure to officially call the centre's opera venue the First Lady Melania Trump Opera House, for example, was introduced as part of a spending bill this summer.  The bill has not yet come up for a vote.That, however, does not necessarily prevent the centre from changing its name on its website or tickets, and potentially on the exterior of the building itself.A similar name change took place at the Department of Defense - now known as the Department of War - without Congressional approval in September. Trump's involvement in the centre has been criticised by some political opponents as unnecessary political interference in the arts by the White House. Lin Manuel Miranda and his producing partner canceled a run of Hamilton at the centre and other visiting artists scrapped their planned appearances in recent months.At the same time, locals appear to have stayed away, with the Washington Post and other local news outlets reporting that ticket sales and subscriptions have fallen since Trump took over.Earlier this year, the president said he was \"98% involved\" in the selection of this year's Kennedy Center honourees, which included action star Sylvester Stallone and members of the rock band KISS. At the time, Trump said he had rejected \"wokesters\" from being considered for the honour. In June, during Trump's first appearance at the Kennedy Center since returning to the White House, audience members both booed and cheered him and First Lady Melania Trump as they entered the presidential box. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kennedy Center to be renamed Trump-Kennedy Center, White House says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f9c/live/57355910-dc4a-11f0-83b4-4b97b1cc3247.jpg"
      ],
      "datePublished": "2025-12-18T20:03:04.000Z",
      "dateModified": "2025-12-18T20:03:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elections face further delays over councils shake-up",
    "url": "https://www.bbc.com/news/articles/cdd5p7y1999o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bb43/live/229abd80-dc31-11f0-854f-613aec88e40b.jpg",
    "tag": "Trending",
    "date": "2025-12-18T17:57:53.000Z",
    "description": "2 hours agoPaul SeddonPolitical reporterGetty ImagesLocal elections in East Sussex have already been delayed onceElections in some local councils are ",
    "body": "2 hours agoPaul SeddonPolitical reporterGetty ImagesLocal elections in East Sussex have already been delayed onceElections in some local councils are facing further delays, amid an escalating blame game over Labour's planned overhaul of local government in England.Ministers have indicated they will agree to postpone elections due next May until 2027, if authorities request it by mid-January.Polls in nine such areas have already been postponed once, having originally been scheduled for May 2025.It has sparked a huge row, with Reform UK leader Nigel Farage accusing Labour and the Conservatives of working together to stop his party making further gains.Reform is hoping for big wins in the local elections in England in May, as it seeks to translate its lead in national opinion polls into control of town halls.The government plans to get rid of the two-tier system of district and county councils, creating a swathe of new authorities that will be responsible for delivering all local services in their areas from 2028.Ministers have now asked all 63 councils affected by the reorganisation that are due to hold elections in May to say whether they require a delay.In a statement, Local Government Minister Alison McGovern said \"multiple\" authorities had asked for a postponement, after expressing concerns about their ability to run \"resource-intensive\" elections alongside the transition.Others had questioned the cost to taxpayers of holding elections for councils that are due to be abolished, she added.Speaking in the Commons, she added that those seeking a suspension were only a \"minority\" of affected councils, without offering further details. 'Deeply flawed'The announcement of further potential delays, made on the last day before Parliament's Christmas break, comes just two days after Local Government Secretary Steve Reed told MPs scheduled elections \"will go ahead\".Conservative shadow local government minister Paul Holmes said local leaders should not be blamed for further delays, adding that Labour's reorganisation had been \"rushed and deeply flawed\".He accused Labour of \"pausing the democratic process to serve their own political interests\".Whilst there is a precedent for cancelling elections to councils that are about to be replaced, the slow progress of the reorganisation has seen Labour face accusations it is acting undemocratically.Local polls in nine areas, including Suffolk, East and West Sussex, and Essex, have already been put back once, having originally been scheduled for May 2025.If elections are delayed again in any of these areas, it will mean some councillors will have sat for seven years without facing local voters.Elections for new mayors in Greater Essex, Norfolk & Suffolk, Hampshire & the Solent, and Sussex & Brighton have also ready been delayed two years until until May 2028, it was confirmed earlier this month.'Banana republic'Labour has a majority in 18 of the 63 councils that have been asked about a potential delay, with the Conservatives holding a majority in nine and the Liberal Democrats in seven.However the Conservatives are defending the largest number of seats, at 1,415  - more than a quarter of those currently due for re-election in May.In a social media post, Farage said: \"Turkeys don't vote for Christmas. \"Tory county councils look set to collude with Labour to keep their control until 2027.\"Only a banana republic bans elections, that's what we have under Starmer,\" he wrote, adding that Tory leader Kemi Badenoch should \"instruct her council leaders\" not to delay further.Asked whether Tory-run councils could request suspensions, Badenoch said she was personally against further delays, whilst indicating she would not stand in the way of authorities making a request.\"Conservative leaders run their councils. I'm not a dictator, they know what I want,\" she told the BBC.\"Those people have been elected to serve their local communities. They will give reasons for why they are asking for the elections to be run.\"We need to listen to what they are saying, but in my view we should just have all these elections and be done with it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elections face further delays over councils shake-up",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bb43/live/229abd80-dc31-11f0-854f-613aec88e40b.jpg"
      ],
      "datePublished": "2025-12-18T17:57:53.000Z",
      "dateModified": "2025-12-18T17:57:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wiz Khalifa sentenced to nine months jail in Romania",
    "url": "https://www.bbc.com/news/articles/c93wxp2p05xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54d3/live/810c8c30-dc46-11f0-a1ce-39295e57b193.jpg",
    "tag": "Trending",
    "date": "2025-12-18T20:00:55.000Z",
    "description": "Wiz Khalifa sentenced to nine months jail in Romania for smoking cannabis on stage10 minutes agoMircea Barbu,BucharestandAndré Rhoden-PaulGetty Images",
    "body": "Wiz Khalifa sentenced to nine months jail in Romania for smoking cannabis on stage10 minutes agoMircea Barbu,BucharestandAndré Rhoden-PaulGetty ImagesA Romanian court has sentenced Wiz Khalifa to nine months in prison for smoking cannabis on stage.The American rapper, real name Thomaz Cameron Jibril, admitted to smoking a joint during his performance at the Beach, Please! festival last year in Costinesti.A Romanian appeals court overturned an earlier fine of 3,600 Romanian leu (£619; $829) for drug possession and ruled the rapper must serve the sentence in custody. However he was sentenced in abstentia, and it is unclear if Jibril is even in Romania - he was last seen on Tuesday, performing with Gunna in California.The BBC has approached the ten-time Grammy-nominated artist for comment. Police briefly held and questioned Jibril after the concert on 13 July 2024, and prosecutors later charged him with possession of \"risk drugs\" for personal use.  Romanian investigators said he was in possession of more than 18 grams of cannabis and consumed an additional amount on stage. In a written decision, the Constanța Court of Appeal judges said they overturned the original fine because the artist had sent \"a message of normalisation of illegal conduct\" and thereby encouraged \"drug use among young people\".Calling it an \"ostentatious act\", the judges said the rapper was \"a music performer, on the stage of a music festival well known among young people\" who \"possessed and consumed, in front of a large audience predominantly made up of very young people, an artisanal cigarette\".Jabril said in a post on X a day after the incident that he did not mean to offend the country. \"They [the authorities] were very respectful and let me go. I'll be back soon. But without a big ass joint next time.\" Romanian criminologist Vlad Zaha told BBC News that there was little-to-no chance of the US extraditing Jibril, and described the sentence as \"unusually harsh\". \"Given the defendant's wealth and connections, Romania's lack of real negotiating power on extradition, and the legal and political status of cannabis in the US, it is highly unlikely that Wiz Khalifa will be sent to serve a prison sentence in Constanța, even though a formal judicial request will be submitted to the United States,\" Mr Zaha said. The  artist, known for songs like Black and Yellow, See You Again and Young, Wild & Free, is often pictured smoking on his social media and founded his own marijuana brand in 2016. Cannabis is legal recreational and medical use in some US states, but remains illegal under federal law.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wiz Khalifa sentenced to nine months jail in Romania",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54d3/live/810c8c30-dc46-11f0-a1ce-39295e57b193.jpg"
      ],
      "datePublished": "2025-12-18T20:00:55.000Z",
      "dateModified": "2025-12-18T20:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King Charles pours 'perfect pint' at new brewery",
    "url": "https://www.bbc.com/news/articles/c2k431v7klko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02f9/live/d8bbf300-dc17-11f0-babc-21f9e89ffedf.jpg",
    "tag": "Trending",
    "date": "2025-12-18T15:42:47.000Z",
    "description": "4 hours agoSean CoughlanRoyal correspondentKing Charles successfully poured a \"perfect\" pint of Guinness on a Christmas visit to a new brewery in Lond",
    "body": "4 hours agoSean CoughlanRoyal correspondentKing Charles successfully poured a \"perfect\" pint of Guinness on a Christmas visit to a new brewery in London's Covent Garden, where he tasted his pint-pulling efforts.This was his first public visit since the King's video message revealing \"good news\" about the positive progress of his cancer treatment - and he seemed to be really enjoying the moment.The King surprised some shoppers outside the event, wishing them a \"Merry Christmas\" and shaking hands in an impromptu walkabout in the rain.The King, who seemed in festive form, joked with carol singers that they must be \"moonlighting from the Royal Opera House\" and teased reporters that they were not getting to test the drinks on display.The King was opening the Guinness Open Gate Brewery, a £73m investment which will be a new London visitor attraction as well as producing a range of beers.There was a lesson in how to pour a pint, with the King shown how to tilt the glass to 45 degrees, and then to leave it to settle for between 60 to 70 seconds, which he was told allowed 300 million bubbles to rise inside the glass.It was not clear who had ever counted them, but the King was ready to raise a glass to Christmas and perhaps, he might have been thinking about \"good health\" in a more personal way.His pint-pulling trainer, Leo Ravina, said he had poured a \"perfect pint\". \"If you say so,\" replied the King, who wiped away a foamy Guinness moustache.The King seemed less convinced by another piece of hi-tech boozing, where he was shown how an image could be printed, using beetroot or carrot juice, on to the beer's surface.Although as monarch, he had to avoid sharing his point (or in this case pint) of view.There was also no mention of the social media fad of \"splitting the G\", where drinkers try to reach a certain point on a pint glass.But the King seemed to enjoy some of the less usual beers on offer, including one with an apricot flavour.This tasting session was in the 232 Bar, named after the temperature at which the barley is roasted to get the distinctive flavour.Guinness also gave the King a tour of the inner workings of the beer-making process.Despite the rain, the King seemed determined to go outside, where crowds appeared taken aback to see this unexpected visitor and held up their phones in the drizzle. He chatted to a couple about keeping their baby warm in the downpour.There was also a tour of a Christmas-themed food market.And among the guests was movie director Gurinder Chadha, who made Bend It Like Beckham and has now launched a modern version of A Christmas Carol, called Christmas Karma.It has a message about compassion and multicultural communities, and Ms Chadha said the King had asked for a copy of the film to watch at Christmas in Sandringham.The King was also introduced to young people who were being trained for the hospitality industry.Nik Jhangiani of Guinness's parent company Diageo welcomed the seasonal royal visit: \"Pubs and restaurants are the heartbeat of the hospitality sector and this is a wonderful show of support for the industry.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King Charles pours 'perfect pint' at new brewery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/02f9/live/d8bbf300-dc17-11f0-babc-21f9e89ffedf.jpg"
      ],
      "datePublished": "2025-12-18T15:42:47.000Z",
      "dateModified": "2025-12-18T15:42:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]