[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Why Does Keir Starmer's Visit Matter to China? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxxrky?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-29T15:39:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·29 Jan 2026,·34 minsWhy Does Keir Starmer's Visit Matter to China?NewscastAvailable for over a yearToday, Sir Keir Starmer has been meeting with President Xi Jinping in Beijing, the first time a sitting British PM has visited China in eight years. Although a host of trade deals were announced, including visa free entry for UK travellers, there have been fewer agreements than expected from the trip.\nAdam is joined in studio by deputy economics editor, Darshini David to chat about what we know so far and China correspondent, Laura Bicker who explains how the visit has been received in China. \nChris also phones in to share his experience of being on the road with the PM and how the visit has gone down with MPs back home.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Chloe Scannapieco and Shiler Mahmoudi. The social producers were Sophie Millward and Beth Pritchard. The technical producers were James Piper and Jack Graysmark. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Why Does Keir Starmer's Visit Matter to China? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-29T15:39:00.000Z",
      "dateModified": "2026-01-29T15:39:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Will Trump “de-escalate” Minneapolis tensions after Alex Pretti killing? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0my1zv9?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-28T03:11:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·28 Jan 2026,·33 minsWill Trump “de-escalate” Minneapolis tensions after Alex Pretti killing?AmericastAvailable for over a yearWhat does Donald Trump actually mean when he says his administration plans to “de-escalate a little” in Minneapolis? On Tuesday Democratic Rep Ihan Omar was attacked at a local event in the city and protests are continuing following Saturday’s shooting of US citizen Alex Pretti by federal immigration agents. Video evidence contradicts claims by Trump administration officials immediately after Pretti’s killing that he was a “domestic terrorist”, planning a “massacre” and “brandishing” a weapon. \nIn this episode, Sarah, Anthony and Marianna discuss the president’s controversial response to the attack on Democrat Ihan Omar, and whether Trump can actually de-escalate tensions when thousands of ICE agents remain in Minnesota.\nHOSTS:\n- Sarah Smith, North America Editor\n- Anthony Zurcher, North America Correspondent\n- Marianna Spring, Social Media Investigations Senior Correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Purvee Pattni, Kris Jalowiecki and Grace Reeve. The technical producer was Dafydd Evans. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Will Trump “de-escalate” Minneapolis tensions after Alex Pretti killing? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-28T03:11:00.000Z",
      "dateModified": "2026-01-28T03:11:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein sent £10,000 to Mandelson's partner, file releases reveal",
    "url": "https://www.bbc.com/news/articles/c2lgqd2n9w2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a0de/live/144676b0-fe01-11f0-bb32-2b2b28af4780.jpg",
    "tag": "Trending",
    "date": "2026-01-30T20:06:20.000Z",
    "description": "Epstein sent £10,000 to Mandelson's partner, released emails show11 minutes agoKate WhannelPolitical reporterJeff Overs/BBCLord Mandelson has been inv",
    "body": "Epstein sent £10,000 to Mandelson's partner, released emails show11 minutes agoKate WhannelPolitical reporterJeff Overs/BBCLord Mandelson has been involved in British politics since the 1980s and served as a minister in Labour governments between 1997 and 2010Convicted sex offender Jeffery Epstein sent £10,000 to Peter Mandelson's partner Reinaldo Avila da Silva in 2009, according to documents released by the US Department of Justice.In an email to Epstein, da Silva sets out the costs of an osteopathy course, provides his bank details and thanks the financier for \"anything you can help me with\". Epstein replies a few hours later saying: \"I will wire your loan amount immediately\" and the following day da Silva writes: \"Just a brief note to thank you for the money which arrived in my account this morning.\"Asked for a response, Lord Mandelson said he had been \"very clear\" about his relationship with Epstein in interviews with the BBC.\"I have nothing more to add,\" said the Labour peer.On 11 January, Mandelson told Laura Kuennsberg his friendship with Epstein had been a \"most terrible mistake\".The exchanges between da Silva and Epstein appear as part of a huge document release from the US justice department running to three million pages relating to Epstein. At the time Lord Mandelson was serving as business secretary and de-facto deputy prime minister for Gordon Brown.Mandelson told the BBC: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\"I was never culpable or complicit in his crimes. Like everyone else I learned the actual truth about him after his death.\"But his victims did know what he was doing, their voices were not heard and I am sorry I was amongst those who believed him over them.\"There is no suggestion Da Silva, who married Lord Mandelson in 2023, was involved in any wrongdoing.In December 2024, Lord Mandelson was appointed as the UK's ambassador to the US but was sacked less than a year later, when it emerged he had sent supportive messages to Epstein following the conviction. No 10 had known about Lord Mandelson's friendship with Epstein when the ambassadorial appointment was made but said new information revealed the \"depth and extent\" of the relationship leading to his dismissal. The files further document the close ties between the British politician and Epstein including an email from June 2009 in which Lord Mandelson asks Epstein if he can \"stay at yours Friday-Sunday this weekend\".Epstein asks \"press issues?\" before saying: \"Your call I'm thrilled to host and sad I'm not there.\"Mandelson replies that it should be OK adding: \"Better 'facilities' at yours.\"At this point, Epstein replied to someone else and copied Mandelson in, asking them to \"implement\" the arrangements.A previously released report by the JP Morgan bank suggested that Mandelson had stayed at Epstein's apartment in New York in 2009.In 2019, Epstein died in a New York prison cell while awaiting trial on sex trafficking charges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein sent £10,000 to Mandelson's partner, file releases reveal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a0de/live/144676b0-fe01-11f0-bb32-2b2b28af4780.jpg"
      ],
      "datePublished": "2026-01-30T20:06:20.000Z",
      "dateModified": "2026-01-30T20:06:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty if convicted, judge rules",
    "url": "https://www.bbc.com/news/articles/c78egdg3r0po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3791/live/fa232790-fdf8-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-30T17:02:16.000Z",
    "description": "3 hours agoBrandon DrenonReutersLuigi Mangione will not face the death penalty if convicted of killing UnitedHealthcare chief executive Brian Thompson",
    "body": "3 hours agoBrandon DrenonReutersLuigi Mangione will not face the death penalty if convicted of killing UnitedHealthcare chief executive Brian Thompson, a federal court has ruled.US District Judge Margaret Garnett dismissed the federal firearms charges against the 27-year-old that carried the possibility of the death penalty. But she left in place stalking charges against him that can bring a maximum punishment of life in prison.Mangione was arrested days after he allegedly shot Thompson as he was walking into a New York City hotel on 4 December 2024. He has pleaded not guilty to all federal and state charges. Jury selection in the federal trial is scheduled to begin on 8 September with opening statements due to start on 13 October. But state prosecutors are seeking to try Mangione as soon as July.In her ruling, Judge Garnett, a Biden appointee, said two of the four federal charges did not \"meet the federal statutory definition of a 'crime of violence' as matter of law\". She noted that her decision was \"solely to foreclose the death penalty as an available punishment to be considered by the jury\".Garnett's ruling was a setback for the justice department, which had called Thompson's murder a \"premeditated, cold-blooded assassination\".The judge has given the government 30 days to challenge her decision ruling out the death penalty in the Mangione case.In a win for prosecutors, Garnett said they could present evidence to the jury from Mangione's backpack that he had at the time of his arrest at a McDonald's in Altoona, Pennsylvania.Among the items in the bag were a gun, fake IDs and a notebook with writings that allegedly detailed Mangione's grievances against the US healthcare system. Defence attorneys had sought to dismiss that evidence from trial, arguing that authorities obtained it illegally without a warrant. Mangione, an Ivy League graduate from a wealthy Maryland family, is also facing nine charges in a separate case brought by New York state prosecutors, including second-degree murder.Father-of-two Thompson, 50, was shot from behind by a masked gunman as he walked to a Manhattan hotel for an annual investor conference. This week a Minnesota man allegedly impersonated an FBI agent in an attempt to free Mangione from the Brooklyn jail where he is being held. The suspect - Mark Anderson - was carrying a barbecue fork and pizza cutter, say prosecutors. He is now being held at the same facility as Mangione.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luigi Mangione will not face death penalty if convicted, judge rules",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3791/live/fa232790-fdf8-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-30T17:02:16.000Z",
      "dateModified": "2026-01-30T17:02:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snow Moon 2025: How and when to see the February full Moon",
    "url": "https://www.bbc.com/weather/articles/cvgm4m2wn9po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/1414/live/49986360-dc9b-11ef-a37f-eba91255dc3d.jpg",
    "tag": "Trending",
    "date": "2026-01-30T17:25:46.000Z",
    "description": "Image source, EPA-EFE/REX/ShutterstockByShireen JordanBBC WeatherUpdated 2 hours agoStargazers may be able to catch the last full Moon of meteorologic",
    "body": "Image source, EPA-EFE/REX/ShutterstockByShireen JordanBBC WeatherUpdated 2 hours agoStargazers may be able to catch the last full Moon of meteorological winter on Sunday. If you're tempted to pop outside to catch a glimpse, it will rise at 16:13 GMT in London and should be visible - clouds permitting - until it sets at 08:06 GMT on 2 February. These timings vary slightly depending on where in the UK you are.A full Moon happens when the Sun and Moon are on opposite sides of Earth - in alignment, known as 'syzygy' - so the whole side that is facing us is illuminated. It also appears to look full in the days before and after the peak, so there will be other opportunities to see it, if you don't catch it on Sunday. Image source, BBC Weather Watcher/ Dave's PatchImage caption, Last year the Snow Moon was visible in the night sky on Valentine's DayWhy is it called a Snow Moon?Full Moons were historically named as a way of keeping track of the change of seasons and often influenced the timing of activities like hunting, harvesting and planting, where the bright moonlight could come in handy. Each full Moon in a year has a name - a practice that dates back to ancient traditions centuries before the Gregorian calendar existed.February's full Moon is known as the Snow Moon, after the heavy snowfall often associated with this time of year in the northern hemisphere, but is also sometimes called the Storm Moon or Hungry Moon.Image source, BBC Weather Watcher/ AstroMalImage caption, January's Wolf Moon captured by BBC Weather Watcher 'AstroMal' over Crystal Palace, London Will I be able to see the full Moon?Image source, BBC Weather Watchers / YorkshireTedImage caption, A bright orange supermoon shines over Yorkshire There is quite a lot of cloud in the forecast for Saturday and Sunday night, with the best of any clear spells likely to be across Northern Ireland.The Moon will be at its peak illumination at 10:09 GMT in the UK when it is below the horizon, however it will still appear 'full' when it rises at night and for the following few days. Sunday will see a largely cloudy day with patchy rain in places, mainly the north and east and just a few brighter breaks between these.If you manage to spot the Moon and want to take a picture make sure you turn off the flash on your phone, activate night mode and use ambient light. Oh, and check the BBC Weather forecast.The lunar monthImage source, Matt Cardy/Getty ImagesImage caption, The Snow Moon in February 2023 was the smallest one of the year making it a Micromoon - the opposite of a supermoon This year there will be an extra full Moon on 31 May, known as a Blue Moon. This is the name given to the second full Moon in a calendar month. May's Blue Moon will also be one of three Micromoons this year. Micromoons appear to look smaller in the sky and are the opposite of a supermoon.We usually get 12 full Moons a year, but as this doesn't quite match up with the lunar cycle we get an additional one roughly every two and half years. As it only happens every few years it is where the expression 'once in a blue moon' comes from.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snow Moon 2025: How and when to see the February full Moon",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/1414/live/49986360-dc9b-11ef-a37f-eba91255dc3d.jpg"
      ],
      "datePublished": "2026-01-30T17:25:46.000Z",
      "dateModified": "2026-01-30T17:25:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alan Carr accidentally revealed Traitors victory hours after filming",
    "url": "https://www.bbc.com/news/articles/c368dn9lwdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ca7/live/dd90b260-fdde-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "Trending",
    "date": "2026-01-30T13:11:47.000Z",
    "description": "7 hours agoSteven McIntoshEntertainment reporterBBCAlan Carr was selected to be a traitor on the BBC series, along with Cat Burns (pictured) and Jonat",
    "body": "7 hours agoSteven McIntoshEntertainment reporterBBCAlan Carr was selected to be a traitor on the BBC series, along with Cat Burns (pictured) and Jonathan RossComedian Alan Carr has revealed he accidentally gave away that he had won the Celebrity Traitors, just 12 hours after filming the final episode. The 49-year-old won the first celebrity series after convincing fellow finalists Nick Mohammed and David Olusoga that he was a faithful in a nail-biting final.But, he told BBC Radio 2's Scott Mills, the secret slipped out when he was filming Channel 4 gameshow Secret Genius the following day. Carr explained: \"The cameraman goes 'congratulations', and I go 'how did you know I won?' He said 'I didn't.\"\"So I told them within 12 hours that I had won The Traitors.\"After Carr inadvertently revealed he had won, the camera operator explained he had been \"just joking, just teasing\".The comedian then tried to retract his comment about winning, and said: \"I went, 'haha, got you!' - I had to backtrack, because you can't tell anything.\"But I did well, and I didn't want to spoil it.\"Carr told Radio 2's Scott Mills on Friday that he \"felt so stupid\" after inadvertently revealing he had wonBoth the regular and celebrity series of The Traitors are filmed months before they are broadcast - with the cast and crew required to follow strict confidentiality rules. The celebrity version of the show saw Carr appear alongside Sir Stephen Fry, Kate Garraway and Celia Imrie, as well as his fellow traitors Cat Burns and Jonathan Ross. Speaking about accidentally revealing the ending, Carr told Radio 2: \"I felt so stupid. When I did The Traitors, I looked at my work diary and my agent had actually put in work after the first week, and I said 'oh no, I'm doing The Traitors'.\"He said, 'Alan, you'll be out first week with your motor mouth, you aren't going to last'. Then it kept going on and on.\"He added: \"I thought I would be gone on day two.\"However, the comedian remained largely under the radar during his time on the show, and was eventually crowned the winner.'Who are you going to murder today?'Carr also said that, since appearing on Celebrity Traitors, he has been recognised more in public.The comedian recently went on holiday to Mexico, explaining: \"I'm never spotted over there.\"I was on the way to the pool and I heard this woman from the balcony, 'I see you, traitor. Don't you hide your face from me. Who are you going to murder today?\"'He joked the comments made him look like a real murderer, and said: \"People who don't know I was in The Traitors must think I'm a serial killer.\"Hosted by Claudia Winkleman, The Traitors follows a group of contestants - the majority of whom are known as the faithful - as they try to seek out the murderous traitors among them who kill off players every night in an attempt to win a cash prize.Set in the Scottish Highlands, the contestants complete a number of challenges to win money for the prize pot and must try to root out and banish the traitors at a roundtable discussion each night.The first series of the show's celebrity spin-off was a huge ratings success for the BBC, reaching more than 15 million viewers (including catch-up viewing) when it concluded last November.Carr presents his new series, Secret Genius, alongisde Susie Dent. The show begins on Sunday and Channel 4 says it is intended to \"spotlight the country's undiscovered brainboxes\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alan Carr accidentally revealed Traitors victory hours after filming",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ca7/live/dd90b260-fdde-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-30T13:11:47.000Z",
      "dateModified": "2026-01-30T13:11:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Firm behind Prince George's baby shoes warns of closure risk",
    "url": "https://www.bbc.com/news/articles/c78eyv1zdl3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/56b4/live/f8809e60-fd38-11f0-85f9-892da4472ee9.jpg",
    "tag": "Trending",
    "date": "2026-01-30T14:14:36.000Z",
    "description": "'We hope it's not the end': Firm behind Prince George's baby shoes warns it may close6 hours agoJemma CrewBusiness reporterGetty ImagesPrince George p",
    "body": "'We hope it's not the end': Firm behind Prince George's baby shoes warns it may close6 hours agoJemma CrewBusiness reporterGetty ImagesPrince George pictured wearing the Early Days leather baby shoes in New Zealand in 2014The firm behind baby shoes worn by Prince George, Princess Charlotte and Prince Louis is at risk of shutting down, its owner has warned. Paul Bolton said his Leicester factory producing Early Days and Baypod shoes is likely to close, with the company having been hit \"from all angles\" with a slump in customer demand and a sharp rise in business costs. Despite its royal customers causing an explosion in sales, he said the 73-year-old business is on the brink of collapse. Bolton, who runs the family business with his brother, has said they can no longer afford it and are hoping to find a buyer. Announcing the decision on LinkedIn, Bolton said: \"The decision to wind down the company comes in response to ongoing increases in overheads and the challenging state of both the UK and overseas economies over the past three years.\"We are exploring interest from various parties and welcome all enquiries.\"Early Days was started more than 70 years ago by Bolton's father and uncle out of their parents' home. Bolton and his brother have tried to keep the firm in business, but he said he can no longer afford to pump in money to keep it afloat. Speaking on BBC Radio 5's Wake Up To Money show, he recalled the company's \"marvellous\" trading period after Prince George was photographed wearing the shoes during a tour of Australasia. Bolton was forced to suspend online sales for a few days due to stock selling out, describing it as \"a remarkable time\". \"The factory was on overtime, and it opened a lot of new accounts. People hadn't heard of us before, so they wanted to stock Early Days shoes.\"The publicity translated into the company's usual annual turnover doubling, he said.But, following its best year in 2022, Early Days saw a slowing down in orders from shoe shops, with former customers citing the increasingly tough conditions on the high street.  Bolton also said the firm was hit by rising energy and materials costs, as well as increases in the minimum wage and employer National Insurance Contributions. It is the latest firm to complain about the increasing tax burden and wage bill since Labour came to power in 2024. \"It's just been hitting us from all angles, so we've had prices going up, but demand going down because of the consumer spending [which is] down,\" Bolton said. Paul BoltonPrincess Charlotte has been photographed wearing the 'Emma' shoe in pinkThe firm was forced to hike the price of some of its shoes, he said. Their budget shoes currently start from £12.99, while the premium leather range - worn by the royal siblings - are priced at £32 a pair.The company, which once employed over 100 people and produced more than 10,000 pairs of shoes a week, is down to just 10 employees.Bolton and his brother have been propping the firm up with their own money, but he said they \"just can't do it anymore\".He continued: \"We hope it's not the end, but I'd say it's 80% likely it is.\"But we have got a lot of inquiries. Some are going to be, we hope, to perhaps invest, keep the company going over here. \"But we think some of the other inquiries, we think it's probably to move it overseas, which we've never wanted to do.\"A government spokesperson said: \"The Budget doubled down on our work to grow the economy and create good jobs, and we are delivering stability, cutting borrowing and getting inflation down.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Firm behind Prince George's baby shoes warns of closure risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/56b4/live/f8809e60-fd38-11f0-85f9-892da4472ee9.jpg"
      ],
      "datePublished": "2026-01-30T14:14:36.000Z",
      "dateModified": "2026-01-30T14:14:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN risks 'imminent financial collapse', secretary general warns",
    "url": "https://www.bbc.com/news/articles/cr579mdv4m7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5e13/live/061dddb0-fdf9-11f0-a402-95e95a98d0ec.jpg",
    "tag": "Trending",
    "date": "2026-01-30T16:24:18.000Z",
    "description": "4 hours agoMaia DaviesandImogen Foulkes,Geneva correspondentGetty ImagesAntónio Guterres said the organisation's money could run out by JulyThe United",
    "body": "4 hours agoMaia DaviesandImogen Foulkes,Geneva correspondentGetty ImagesAntónio Guterres said the organisation's money could run out by JulyThe United Nations is at risk of \"imminent financial collapse\" due to member states not paying their fees, the body's head has warned.António Guterres said the UN faced a financial crisis which was \"deepening, threatening programme delivery\", and that money could run out by July.He wrote in a letter to all 193 member states that they had to honour their mandatory payments or overhaul the organisation's financial rules to avoid collapse.It comes after the UN's largest contributor, the US, refused to contribute to its regular and peacekeeping budgets, and withdrew from several agencies it called a \"waste of taxpayer dollars\". Several other members are in arrears or are simply refusing to pay.Though the UN General Assembly did approve a partial change to its financial system in late 2025, the organisation still faces a massive cash crisis compounded by a rule that means it is refunding money it never received.At its headquarters in Geneva, signs warning of the situation have been put up everywhere. In an almost desperate attempt to save cash, the escalators are regularly turned off and the heating turned down.Guterres wrote in his letter that the UN had faced financial crises in the past but that the current situation was \"categorically different\".\"Decisions not to honour assessed contributions that finance a significant share of the approved regular budget have now been formally announced,\" the secretary general said, without naming specific members.He said the \"integrity of the entire system\" depended on states adhering to their obligation under the UN charter to pay their \"assessed contributions\" - adding that 77% of the total owed had been paid in 2025, leaving a record amount unpaid.Guterres said a rule that the UN must return unspent money on particular programmes to members if it could not implement a budget created a \"double blow\" in which it was \"expected to give back cash that does not exist\".\"I cannot overstate the urgency of the situation we now face. We cannot execute budgets with uncollected funds, nor return funds we never received.\"As a result, the UN is now returning millions of dollars it never actually had. The letter reads: \"Just this month, as part of the 2026 assessment, we were compelled to return $227m [£165m]  – funds we have not collected.\"\"The bottom line is clear,\" Guterres wrote. \"Either all member states honour their obligations to pay in full and on time – or member states must fundamentally overhaul our financial rules to prevent an imminent financial collapse.\"UN agencies rarely get all the money they ask for to tackle humanitarian crises, but the past 12 months have been particularly difficult. The US is the UN's largest contributor, but President Donald Trump has said it was not fulfilling its \"great potential\" and has criticised it for failing to support US-led peace efforts.The US did not pay its contribution to the UN's regular budget in 2025 and offered only 30% of its expected funding to UN peacekeeping operations.Other countries, such as the UK and Germany, have also announced significant reductions in foreign aid, which will inevitably impact the UN's work.Guterres had warned earlier that same month that the UN faced its most fragile financial position in years - again citing unpaid fees - having said in October that it faced a \"race to bankruptcy\".Trump has separately been accused by critics of seeking to replace some functions of the UN with his Board of Peace to oversee regeneration efforts in Gaza.The US president has said its work would happen \"in conjunction with the United Nations\" - but when previously asked by a Fox TV journalist whether the board would take the UN's place, he replied: \"Well, it might.\"The US officially left the UN's World Health Organization last week. It had refused to pay its 2024 and 2025 dues despite, WHO lawyers say, being legally obliged to do so.Other agencies are also making huge cuts. The UN's human rights office has warned that serious violations will now go undocumented because it lacks the funds to deploy investigators. In the past, their evidence has led to prosecutions for war crimes and crimes against humanity.In Afghanistan, which has one of the highest rates of maternal mortality in the world, UN Women has had to close mother and baby clinics. Meanwhile, the World Food Programme has had to cut rations to refugees fleeing the conflict in Sudan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN risks 'imminent financial collapse', secretary general warns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5e13/live/061dddb0-fdf9-11f0-a402-95e95a98d0ec.jpg"
      ],
      "datePublished": "2026-01-30T16:24:18.000Z",
      "dateModified": "2026-01-30T16:24:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Don Lemon: Ex-CNN host arrested after anti-ICE protest at Minnesota church ",
    "url": "https://www.bbc.com/news/articles/c24gm3dz36po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2674/live/10e42090-fdfb-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-01-30T17:44:59.000Z",
    "description": "3 hours agoBrandon DrenonGetty ImagesFormer CNN host Don Lemon has been arrested after he entered a Minnesota church and filmed anti-immigration enfor",
    "body": "3 hours agoBrandon DrenonGetty ImagesFormer CNN host Don Lemon has been arrested after he entered a Minnesota church and filmed anti-immigration enforcement protesters as they disrupted a service.Lemon, now an independent journalist, was taken into custody by federal agents on Thursday night while in Los Angeles covering the Grammy Awards, according to his lawyer Abbe Lowell.\"Don will fight these charges vigorously and thoroughly in court,\" Lowell said. Lemon, 59, is due to appear in federal court in LA on Friday.He went into the Cities Church in St Paul on 18 January with a group of protesters who said one of the pastors was an Immigration and Customs Enforcement (ICE) official. US Department of Justice questioned over arrest of Don Lemon\"Don has been a journalist for 30 years, and his constitutionally protected work in Minneapolis was no different than what he has always done,\" Lowell said in a statement that his client posted on his Instagram account on Friday.The lawyer added: \"This unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration will not stand.\"In his own defence, Lemon said in a recent video: \"Once the protest started in the church, we did an act of journalism, which was report on it.\"US Attorney General Pam Bondi said three others had been arrested: local independent journalist Georgia Fort, along with activists Trahem Jeen Crews and Jamael Lydell Lundy.America's top law enforcement official accused them of participating in a \"coordinated attack\" on the church. The exact charges are unclear. The BBC has contacted the Department of Justice for comment. FBI Director Kash Patel said investigators from his agency and the Department of Homeland Security had arrested Lemon and the other three.Fort posted a livestream of federal agents arriving at her home to arrest her. \"Agents are at my door right now,\" she said in the clip. \"My children are here, they're impacted by this.\" President Donald Trump's administration initially sought to charge eight people involved in the Minnesota church protest with conspiring to deprive rights and interfering with someone's religious freedom in a house of worship.But a magistrate judge who reviewed the evidence approved charges for only three of those involved, excluding Lemon.The government challenged that decision, but an appeals court suggested prosecutors take the case to a federal grand jury - a panel of citizens that evaluates if there is enough evidence to charge someone in a case.A longstanding Trump critic, Lemon was fired from CNN in April 2023 after 17 years with the company. The morning show host had apologised for on-air comments that Republican presidential candidate Nikki Haley, then 51, was past her prime. In the Minnesota church protest, he live-streamed with anti-ICE protesters on YouTube. The broadcast began with Lemon standing with the group in a car park where he says: \"This is an operation that is secret.\"I can't tell you what is going to happen, but you're going to watch it live unfold here on 'The Don Lemon Show.'\"He followed the group - whom he called \"resistance protesters\" - into the church, initially without his camera operator. His microphone picked up audio of a woman shouting \"excuse me pastor\". Protesters chant \"Justice for Renee Good\", referring to the US citizen who was fatally shot in her vehicle on 7 January during a confrontation with an ICE officer in Minneapolis.Footage showed a chaotic scene unfolding inside the church, which belongs to the Southern Baptist Convention, as protesters and members of the congregation shout at each other. Lemon repeatedly says he is there as a journalist and is unaffiliated with demonstrators.\"We're not part of the activists, but we're here just reporting on them,\" he says.The pastor says: \"This is unacceptable, it's shameful. It's shameful to interrupt a public gathering of Christians in worship.\" Harmeet Dhillon, of the Department of Justice's Civil Rights Division, said during an interview with podcaster Megyn Kelly on Friday: \"We're going to pursue this to the ends of the Earth.\"The White House appeared to celebrate the arrest, posting a photo of Lemon on its official X account with the caption \"when life gives you lemons\", next to an emoji of chain links.Los Angeles Mayor Karen Bass called the detention of Lemon \"shocking\" and \"alarming.\"CNN said it raised \"profoundly concerning questions about press freedom and the First Amendment\". The network said it would follow Lemon's case closely.This is the second high-profile incident this month of the Trump administration investigating a journalist, raising the alarm of free speech advocates. On 14 January, the FBI showed up unannounced to the home of a Washington Post reporter with a search warrant and seized her devices over the alleged leak of classified information, although she herself was not charged with any crime.Protests are continuing in Minnesota, where an operation by federal immigration agents has sparked confrontations that have left two US citizens dead: Renee Good, a mother-of-three, and Alex Pretti, a nurse.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Don Lemon: Ex-CNN host arrested after anti-ICE protest at Minnesota church ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2674/live/10e42090-fdfb-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-01-30T17:44:59.000Z",
      "dateModified": "2026-01-30T17:44:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asylum seeker jailed for 29 years for Rhiannon Whyte murder",
    "url": "https://www.bbc.com/news/articles/c5yvwdgjpj3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba45/live/85874200-a9c9-11f0-ba75-093eca1ac29b.png",
    "tag": "Trending",
    "date": "2026-01-30T17:57:13.000Z",
    "description": "2 hours agoEleanor LawsonWest MidlandsFamily / British Transport PoliceRhiannon Whyte was stabbed 23 times with a screwdriverAn asylum seeker has been",
    "body": "2 hours agoEleanor LawsonWest MidlandsFamily / British Transport PoliceRhiannon Whyte was stabbed 23 times with a screwdriverAn asylum seeker has been jailed for life for the murder of a woman who worked at the hotel at which he was staying.Deng Majek stabbed Rhiannon Whyte 23 times with a screwdriver in a frenzied 90-second attack in 2024 after following the 27-year-old to Bescot Stadium railway station in Walsall. He was later caught on CCTV dancing and laughing. As Majek was handed a minimum term of 29 years at Coventry Crown Court on Friday, his victim's mother wiped away tears.Siobhan Whyte read out a statement at the hearing, her hands shaking as she looked directly at Majek - a Sudanese national - to say: \"I hope you never see the outside world again. Let me see you dancing now.\"She told the court it was \"impossible to fully explain the pain I'm feeling\", adding her late daughter had also been her best friend.\"Because of Majek's inexplicable, cruel and brutal actions, we must face life without her,\" she said.\"To some extent my life also ended that day. She had no chance, no say in how her life would be decided. You took that from all of us.\"PA MediaMajek was recorded on CCTV dancing and laughing after murdering Rhiannon Whyte Rhiannon Whyte had just finished her shift at the Park Inn Hotel at 23:00 BST on 20 October 2024 and was on the phone to a friend as she walked to the railway station.She was on the platform when Majek launched his attack, stabbing her 19 times in the head, with 11 injuries to her skull, and one wound so deep it pierced her brain stem. She died in hospital three days later. No motive has been established for why Majek attacked her.Majek had arrived in the UK on a small boat about three months before the attack and made a legal claim for asylum. He was living at the hotel, which was being used to temporarily house asylum seekers at the time.Rhiannon Whyte's mother Siobhan Whyte said her family had also received a life sentenceOutside court, Siobhan Whyte said she was \"pleased\" with the sentence but added that her family had \"a life sentence too\" because of Majek's actions.\"I will hate him till the day I take my last breath,\" she said, before adding that love for her daughter was stronger.Referencing Majek's immigration status, she urged the government to take tougher action.\"It's always the undocumented illegal immigrants that are doing this, and it's not fair, they're taking over our country,\" she said.\"The government needs to stand up and start doing something about it. To stop this pain.\"Rhiannon Whyte's sister Alex Whyte also spoke on Friday. She told the sentencing hearing in a victim impact statement how she was now raising her late sister's son, saying it was \"unimaginably difficult\" to explain to him his mother had died.\"It is no exaggeration to say that his screams will haunt me forever,\" she said.She added that her nephew wanted to be a \"brain doctor\" so he could save people with injuries like those of his mother.She had previously described Majek as a \"sick, twisted and cowardly human\".Outside court there were anti-immigration protesters, including far-right activist Tommy Robinson, who left shortly after the sentence was delivered, having addressed some of the crowd.Video shown to the trial jury showed Deng Majek dancing after Rhiannon Whyte's deathThe judge Mr Justice Soole said Whyte had tried to defend herself \"with the greatest courage\" against Majek's \"frenzied and sustained brutality\".She was found on a deserted platform minutes after the attack by a member of railway staff from the train on which Whyte had intended to travel home.The court heard how Majek took Whyte's phone and turned it off, before walking calmly away and throwing the device into a river. He then took a long walk around Walsall and bought beer, with CCTV footage showing him dancing and laughing in the car park of the hotel.During sentencing, the judge told Majek that there had been \"chilling composure in every aspect of your behaviour\".Alex Whyte (centre) is raising her bereaved nephew - she is pictured here after Majek's conviction in OctoberBefore the hearing, the judge had ordered an age assessment report to be drawn up due to uncertainties over how old Majek was.Majek himself had claimed to be 19, despite documents - filled in during a failed asylum claim in Germany - suggesting he was 27.Sentencing guidelines are different for children under 18, but the guidance to judges reads \"many of the principles will also be relevant to sentencing young adults (aged 18-25)\".  The assessment report later concluded Majek was over the age of 21, with the judge saying he believed the defendant to be between the ages of 25 and 28.The trial had heard how Whyte's blood was found on clothes, shoes and a ring worn by Majek.When he was asked during those proceedings why he had her DNA under his right fingernail, he replied: \"I never touched her, and there is no DNA.\"The jury did not believe his evidence. More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asylum seeker jailed for 29 years for Rhiannon Whyte murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba45/live/85874200-a9c9-11f0-ba75-093eca1ac29b.png"
      ],
      "datePublished": "2026-01-30T17:57:13.000Z",
      "dateModified": "2026-01-30T17:57:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joanna Lumley and Queen Camilla among guests at memorial for Jilly Cooper",
    "url": "https://www.bbc.com/news/articles/cgezveezjw4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/410d/live/944de050-fdf2-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-30T16:04:52.000Z",
    "description": "4 hours agoSofia Ferreira SantosPADame Joanna Lumley, Queen Camilla, and David Tennant attended the service to pay their tributesQueen Camilla, Dame J",
    "body": "4 hours agoSofia Ferreira SantosPADame Joanna Lumley, Queen Camilla, and David Tennant attended the service to pay their tributesQueen Camilla, Dame Joanna Lumley and David Tennant were among the guests attending a memorial service for the late novelist Dame Jilly Cooper, at London's Southwark Cathedral.Dame Jilly, known for her best-selling romps including Rivals and Riders, died unexpectedly aged 88 in October 2025 after sustaining injuries from a fall.Dame Joanna praised her as \"an extraordinary woman\" and said of Friday's service: \"It was very touching, sometimes very funny, just sometimes very moving and very beautiful.\"Others attending included Dame Jilly's agent Felicity Blunt and her husband, actor Stanley Tucci, as well as Rupert Everett, Clare Balding, ex-footballer Tony Adams and comedian Rory Bremner.The Queen was welcomed by the Dean of Southwark, the Very Rev Mark Oakley outside the cathedral and stopped to look at a picture of the author, who loved animals, with a dog displayed on an easel by the door.At the service, the dean said: \"Dame Jilly Cooper was a person with a champagne soul, of good vintage and sparkling for all its worth.\"\"Full of light, she lit up places and people, a collage of rare humane qualities, and a friend who brought comfort, compassion, and excitement,\" he added.Rivals stars in attendance included Victoria Smurfit, Alex Hassell, Aidan Turner, Danny Dyer and Katherine Parkinson.Afterwards, Dyer described the service as \"wonderful\".PA MediaQueen Camilla spoke with Dean of Southwark, the Very Reverend Mark Oakley, ahead of the serviceDame Jilly's most successful works were The Rutshire Chronicles, beginning with Riders in 1985, which portrayed the scandals, sex lives and social circles of the wealthy horse-loving country set.Follow-up Rivals was published in 1988 and reached a new generation of fans in 2024 when it was adapted into a hit Disney+ TV series. Camilla visited the cast and crew last month during filming for the show's second season.According to the order of service, Rivals stars Alex Hassell and Bella Maclean read an extract from the novel, while Dame Joanna read an extract from diary anthology the Common Years.Dame Jilly sold more than 11 million books in the UK alone.Blunt, who previously described the author as \"emotionally intelligent, fantastically generous, sharply observant and utter fun\", carried a tote bag with \"I love Jilly Cooper\" on it.PA Media/Getty Images(From left to right) Rivals stars Danny Dyer, Bella Maclean and David Tennant also paid their respects at the serviceBroadcaster Gyles Brandreth also paid tribute to the \"fabulous\" and \"amazing\" Dame Jilly, summing her up in one word: \"fun, fun, fun, fun\".\"Champagne is being popped in heaven today and I'm honoured and delighted to be here amongst so many celebrating an amazing writer,\" he added.Smurfit said she was \"extremely grateful and unbelievably lucky\" to have known Dame Jilly for nearly 40 years.\"We will keep her memory and stories alive for as long as we can,\" she added.Actor Sir Derek Jacobi said Dame Jilly was a \"glorious lady\" and that it meant a \"great deal to be here, just to say a final 'hello'\".PA MediaActor Stanley Tucci and Dame Jilly's literary agent Felicity Blunt spoke warmly of Dame Jilly at the eventOther guests at the service include Queen Camilla's former husband Andrew Parker Bowles and their children, Tom Parker Bowles and Laura Lopes, broadcaster Clare Balding and presenter Richard Madeley.Dame Jilly was made a CBE for services to literature and charity in 2018, and made a dame in 2024, later describing receiving the honour from the King as \"orgasmic\".She is survived by her two children, Felix and Emily, who previously described her \"the shining light in all of our lives\".\"We are so proud of everything she achieved in her life and can't begin to imagine life without her infectious smile and laughter all around us,\" they said in a statement in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joanna Lumley and Queen Camilla among guests at memorial for Jilly Cooper",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/410d/live/944de050-fdf2-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-30T16:04:52.000Z",
      "dateModified": "2026-01-30T16:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump picks Kevin Warsh to lead the US Federal Reserve",
    "url": "https://www.bbc.com/news/articles/c2d7yddrl2xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dff6/live/88600830-fe02-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-30T16:22:59.000Z",
    "description": "4 hours agoDanielle KayeandNick Edser,Business reportersReutersUS President Donald Trump has picked Kevin Warsh to lead the US Federal Reserve when cu",
    "body": "4 hours agoDanielle KayeandNick Edser,Business reportersReutersUS President Donald Trump has picked Kevin Warsh to lead the US Federal Reserve when current chairman Jerome Powell's four-year term ends in May.Warsh is a former Fed governor and was considered for chair during Trump's first term. He has been an outspoken Fed critic and is expected to support lower interest rates in the near term.The appointment comes amid mounting worries about the Fed's independence, following Trump's increasing attacks on Powell in recent months.Powell has angered Trump by not cutting interest rates quickly enough, and federal prosecutors recently opened a criminal investigation over testimony he gave to the Senate about renovations to Fed buildings.The Department of Justice (DoJ) probe prompted a forceful condemnation from Powell and messages of support from former Fed chairs and central bank heads.Warsh, who served as a Fed governor from 2006 to 2011, had re-emerged in recent weeks as a potential choice for the top job as speculation grew over who would replace the under-fire incumbent.Announcing the nomination on Truth Social, Trump said Warsh \"will go down as one of the GREAT Fed Chairmen, maybe the best\".Warsh's appointment still needs to be approved by the Senate, meaning it could face lengthy delays.If confirmed for the role, he will take the helm of the Fed at an unusually tense time, as economists and Wall Street investors monitor threats to the central bank's autonomy.Who is Kevin Warsh? Warsh, a 55-year-old economist, is a fellow at the right-leaning Hoover Institution and serves on the board of courier UPS. He has been an outspoken Fed critic, lambasting everything from the central bank's heavy reliance on data to its use of assets on its balance sheet.Warsh has escalated his rhetoric since emerging as a contender for the top Fed job, going as far as calling for \"regime change\".He had a relatively \"hawkish\" reputation as a Fed governor, meaning he tended to favour higher interest rates and took more seriously concerns about inflation.But he is now seen as a voice that would support lower rates in the near term. He has argued the Fed should shrink its balance sheet in order to bring down short-term interest rates, though some have questioned his logic.The Fed this week voted to hold interest rates steady, despite the White House pushing for a cut. Policymakers are continuing to monitor the effect on the economy of last year's trio of interest rate cuts.There are signs the US employment market is stabilising - job creation is sluggish but the unemployment rate has ticked lower. Inflation remains above the Fed's 2% target.\"Warsh will have to convince his colleagues that rate cuts are appropriate this year, an argument that is unlikely to win unless the labour market shows renewed signs of weakening or inflationary pressures ease materially later this year,\" economists at Deutsche Bank wrote in a research note on Friday.Warsh also has close family connections to Trump's orbit. He is married to Jane Lauder, whose family is known for the Estee Lauder cosmetics group. His father-in-law, billionaire businessman Ronald Lauder, is a long-time Trump donor and ally.Republican Senator Thom Tillis, a member of the Senate Banking Committee, has said he will oppose Trump's nominees until the potential legal case against Powell is resolved.Trump has also taken aim at Fed governor Lisa Cook, whom he wants to remove. He has accused her of engaging in mortgage fraud, which she has denied. The Supreme Court is now assessing the case.Warsh had been seen of one of four leading candidates for the Fed job. The other frontrunners were White House economic adviser Kevin Hassett, Fed governor Christopher Waller and Wall Street bond guru Rick Rieder.When Warsh takes up his role, financial markets will keep a close eye on how independently he acts of President Trump.Stephen Brown, deputy chief North America economist at Capital Economics, said Warsh \"seems like a relatively safe choice\".\"Warsh's long-running hawkish views should help to counteract concerns that he might morph into a full-blown Trump stooge,\" he added.As news of Warsh's impending nomination started to leak out, the dollar strengthened slightly while the price of gold sank by 6%.Stuart Clark, portfolio manager at wealth management business Quilter, said investors would be \"breathing somewhat of a sigh of relief\" at Warsh's nomination.\"Warsh was in contention for the job back in 2017 and as such comes to the role with a level of authority that is respected across the market,\" he added.\"Concerns around Fed independence and an erosion on this should now be tempered, although Warsh's words and actions will be scrutinised by market participants intensely.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump picks Kevin Warsh to lead the US Federal Reserve",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dff6/live/88600830-fe02-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-30T16:22:59.000Z",
      "dateModified": "2026-01-30T16:22:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Manchester Pride confirms go-ahead after previous operator went bust",
    "url": "https://www.bbc.com/news/articles/c5yvw85jjq2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/535f/live/c7fe0af0-fe02-11f0-bde4-63ecc0f8738f.jpg",
    "tag": "Trending",
    "date": "2026-01-30T16:48:53.000Z",
    "description": "3 hours agoJosh ParryLGBT & Identity ReporterGetty ImagesManchester Pride will go ahead this year under new management, after the company previously r",
    "body": "3 hours agoJosh ParryLGBT & Identity ReporterGetty ImagesManchester Pride will go ahead this year under new management, after the company previously running the event went bust.The future of the celebration had looked uncertain after Manchester Pride Events LTD collapsed in October, owing more than £1m to suppliers and performers.Manchester City Council have announced that a new not-for-profit community interest company (CIC), Manchester Village Pride, will take over running the four-day event.The company, which will be run by volunteer directors, says the core elements of Pride will return, including the parade, village party and the annual vigil to those lost to HIV. Venues in the area have loaned the new organisation £120,000 to support the planning and delivery of the event.A spokesperson for Manchester Village Pride said it aims to \"give back as much as possible to the community that Pride exists to serve – with every pound of profit supporting LGBTQ+ charities, grassroots organisations and community services.\"As well as the main Manchester Pride event, there are plans to host a Pride Fringe  featuring LGBTQ+ arts, culture and nightlife events.The group are planning to introduce a Community Advisory Board made up of people from the LGBTQ+ community to ensure a range of perspectives are reflected in the planning of the event.Manchester City Council will also hold engagement sessions with LGBTQ+ organisations and representatives in order to gather a range of views.The council's deputy leader Cllr Garry Bridges said the council had \"always been clear\" that Pride should go ahead this year.He said: \"Pride is vital for Manchester, as a symbol of our welcoming and inclusive city, a chance to celebrate our LGBTQ+ communities and to highlight injustices which still exist.\"Carl Austin-Behan, one of the founders of Manchester Village Pride CIC, said the move was \"a chance to start again\". He added: \"Bringing Pride home to the Village is about more than location. \"It is a commitment to responsibility: paying artists properly, funding community groups, supporting charities, protecting LGBTQ+ heritage, and building a sustainable future for Pride in Manchester.\"The event will be the first in the UK to sign a union agreement with the performing arts and entertainment union Equity, after the collapse of the previous organisation left many performers unpaid.Karen Lockney, an official at Equity, said it would \"guarantee fair pay and professional industry standards for all performers\".She added: \"We have consistently called for unionised terms and conditions for Pride, and this positive development will restore the trust of our members in the event. \"They can be confident they will be paid and treated fairly in future.\"In 2021 more than 1,000 people attended a protest against what they saw as the over-commercialisation of Manchester PrideThere had been uncertainty about the future of Manchester Pride, after the previous organisers collapsed in October, owing £1.3m to artists, venues and suppliers.Over the past decade, Manchester Pride's previous organisers had attracted growing criticism from the community for raising ticket prices and for moving the main stage away from the city's Gay Village.In 2021, trustees launched a review looking at whether the organisation was meeting its purposes and aims after it cut funding for various LGBTQ+ charities.In the same year, it awarded its chief executive a £20,000 pay rise, leading to protests from members of the community.In 2025, the event drew criticism from performers and ticket holders who said its relaunched entertainment programme, hosted mainly in a venue outside of the Gay Village, failed to attract the usual large crowds.A statement from the former board of trustees said rising costs, declining ticket sales and its \"ambitious refresh of the format\" meant the organisation was no longer financially viable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Manchester Pride confirms go-ahead after previous operator went bust",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/535f/live/c7fe0af0-fe02-11f0-bde4-63ecc0f8738f.jpg"
      ],
      "datePublished": "2026-01-30T16:48:53.000Z",
      "dateModified": "2026-01-30T16:48:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harry Brook: England one-day skipper admits other players were present during nightclub bouncer altercation ",
    "url": "https://www.bbc.com/sport/cricket/articles/c62rq6dy54xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5387/live/9470a460-fe0f-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "Trending",
    "date": "2026-01-30T19:39:34.000Z",
    "description": "Harry Brook has admitted other England players were present when he was \"clocked\" by a nightclub bouncer in New Zealand.The England white-ball skipper",
    "body": "Harry Brook has admitted other England players were present when he was \"clocked\" by a nightclub bouncer in New Zealand.The England white-ball skipper had initially said he was out on his own in Wellington on 1 November, the evening before a one-day international.But in a statement released on Friday, the Yorkshireman conceded others were with him and he lied to protect them \"from being drawn into a situation\".The statement came after the Daily Telegraph reported, external that Brook and two of his team-mates, Jacob Bethell and Josh Tongue, could be subject to an investigation from the cricket regulator.\"I accept responsibility for my actions in Wellington and acknowledge others were present that evening,\" said Brook.\"I regret my previous comments and my intention was to protect my team-mates from being drawn into a situation that arose as a result of my own decisions.\"I have apologised and will continue to reflect on the matter. This has been a challenging period in my career, but one from which I am learning.\"I recognise I have more to learn regarding the off-field responsibilities that come with leadership and captaincy. I remain committed to developing in this area and to improving both personally and professionally.\"Brook was placed in charge of England's white-ball teams last summer and the tour of New Zealand was his first overseas as captain.The 26-year-old was involved in the altercation the night before the third one-day international in Wellington on 1 November – a game England lost.He was fined and given a final warning over his conduct, though the incident and punishment only came to light more than two months later after the final Test against Australia in Sydney, at the end of a dismal series England lost 4-1.In an interview with BBC Sport last week, Brook said he didn't want to \"go into any details\" of the Wellington incident, but said it began with some players \"going out for food\".\"There was no intention of going out, no intention of putting ourselves in a tricky situation,\" he said.\"I took it upon myself to go out for a few more and I was on my own there. I shouldn't have been there.\"I was trying to get into a club and the bouncer just clocked me, unfortunately. I wouldn't say I was absolutely leathered. I'd had one too many drinks.\"England men's director of cricket Rob Key told BBC Sport the ECB had investigated the night out in Wellington when it happened, with Brook saying he reported it to his employers the day after it took place.The Telegraph story says the cricket regulator is preparing a report after receiving paperwork on Brook, Bethell and Tongue from the England and Wales Cricket Board last week.The body, set-up in 2023 and headed-up by Chris Haward, a former chief constable of Lincolnshire police, has freedom to operate as it sees fit. It is able to fine or suspend players for disciplinary offences.Brook's statement is the latest act in a series of incidents involving drinking that dogged the England team through the New Zealand tour, the Ashes series that followed and its aftermath.The drinking that took place on a mid-tour holiday in Noosa was particularly scrutinised, and Brook was one of the players pictured in the Queensland resort's bars.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harry Brook: England one-day skipper admits other players were present during nightclub bouncer altercation ",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5387/live/9470a460-fe0f-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-30T19:39:34.000Z",
      "dateModified": "2026-01-30T19:39:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]