[
  {
    "title": "Plans for Trump-Putin meeting shelved days after Budapest talks proposed",
    "url": "https://www.bbc.com/news/articles/c4gjp73gp41o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1ae4/live/43fc4180-ae99-11f0-b305-65f4f8d88da9.jpg",
    "tag": "Trending",
    "date": "2025-10-21T17:33:45.000Z",
    "description": "3 hours agoLaura GozziReutersPutin and Trump last met in August in Alaska and the US president had said further talks would take place in BudapestTher",
    "body": "3 hours agoLaura GozziReutersPutin and Trump last met in August in Alaska and the US president had said further talks would take place in BudapestThere are \"no plans\" for Donald Trump to meet Vladimir Putin \"in the immediate future\", a White House official has stated.The US president said last Thursday that he and his Russian counterpart would hold talks in Budapest within two weeks to discuss the war in Ukraine.A preparatory meeting between US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov was due to be held this week - but the White House said the two had had a \"productive\" call and that a meeting was no longer \"necessary\".The White House did not share any more details on why the talks had been put on hold.But key differences between US proposals and Russia's conditions for peace became increasingly clear this week, and appear to have dashed chances of a summit between the two presidents.Trump had discussed a Budapest summit over the phone with Putin, a day before meeting Ukrainian President Volodymyr Zelensky at the White House.Some reports suggested those talks had been a \"shouting match\", with sources suggesting Trump had pushed Zelensky to give up large areas of territory in the eastern regions of Donetsk and Luhansk, known collectively as the Donbas, as part of a deal with Russia.However, Zelensky has always said Ukraine cannot relinquish the parts of the Donbas it still holds, on the grounds that Russia could later use the area as a springboard for further attacks. On Monday, Trump embraced a ceasefire proposal backed by Kyiv and European leaders to freeze the conflict on the current front line.\"Let it be cut the way it is,\" he said. \"I said: cut and stop at the battle line. Go home. Stop fighting, stop killing people.\"Russia has repeatedly pushed back against freezing the current line of contact.Kremlin spokesperson Dmitry Peskov said the idea had been put to the Russians repeatedly but that \"the consistency of Russia's position doesn't change\" – referring to Moscow's insistence on the complete withdrawal of Ukrainian troops from the embattled eastern regions.Moscow was only interested in \"long-term, sustainable peace\", Sergei Lavrov said on Tuesday, implying that freezing the front line would only amount to a temporary ceasefire.The \"root causes of the conflict\" needed to be addressed, Lavrov said, using Kremlin shorthand for a series of maximalist demands that include the recognition of full Russian sovereignty over the Donbas as well as the demilitarisation of Ukraine – a non-starter for Kyiv and its European partners.Earlier on Tuesday, European leaders put out a statement with Zelensky saying that any talks on ending the war in Ukraine should start with freezing the current front line and accused Russia of not being \"serious\" about peace. Trump and Putin last met in Alaska in August, during a hastily organised summit which yielded no concrete results.The White House decision to shelve plans for a second Trump-Putin meeting may have been an attempt to avoid another similar scenario.\"I guess the Russians wanted too much and it became evident for the Americans that there will be no deal for Trump in Budapest,\" a senior European diplomat told Reuters.Zelensky said discussions about the front line were the \"beginning of diplomacy\",  which Russia was doing everything to avoid.The only topic that could make Moscow \"pay attention\" was the supply of long-range weapons to Ukraine, he added.Putin's unscheduled call with Trump last Thursday came following speculation that the US was preparing to send long-range Tomahawk missiles to Kyiv that could potentially strike deep into Russia.Zelensky said it was the Tomahawks issue that had forced Russia to engage in discussion. Despite coming away from the White House empty-handed, he added that the talk about the missiles had turned out to be a \"strong investment in diplomacy\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Plans for Trump-Putin meeting shelved days after Budapest talks proposed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1ae4/live/43fc4180-ae99-11f0-b305-65f4f8d88da9.jpg"
      ],
      "datePublished": "2025-10-21T17:33:45.000Z",
      "dateModified": "2025-10-21T17:33:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hermès appoint British designer Grace Wales Bonner to lead men's wear",
    "url": "https://www.bbc.com/news/articles/c3rjnqvv5qqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/981f/live/28ba4ab0-ae8b-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-21T15:20:32.000Z",
    "description": "5 hours agoSteven McIntoshEntertainment reporterBritish designer Grace Wales Bonner has been named as the new creative director of menswear for French",
    "body": "5 hours agoSteven McIntoshEntertainment reporterBritish designer Grace Wales Bonner has been named as the new creative director of menswear for French fashion house Hermès.The appointment means Wales Bonner, a 35-year-old Londoner, is now the first black woman to lead design at a major fashion house, according to the New York Times.In a statement, Wales Bonner said she was \"deeply honoured to be entrusted with the role\".She replaces Véronique Nichanian, who has been the company's artistic director of menswear division for 37 years.Her final collection for the brand will be shown in Paris in January, while Wales Bonner's first collection will launch in 2027.In her statement, Wales Bonner said: \"It is a dream realised to embark on this new chapter, following in a lineage of inspired craftspeople and designers.\" She also thanked the company's bosses \"for the opportunity to bring my vision to this magical house\".Reporting the news on Tuesday, Vogue said: \"While industry insiders were betting on a promotion from within, Hermès went for a renowned talent.\"Wales Bonner, who was born in London to an English mother and Jamaican father, founded her own label in 2014, not long after graduating from London's Central Saint Martins College of Art. According to Vogue, Wales Bonner will continue her namesake brand alongside her new Hermès role.She dressed F1 driver Lewis Hamilton, musician FKA Twigs, and actor Jeff Goldblum for this year's Met Gala and has made T-shirts with musician Solange Knowles, younger sister of Beyoncé.Wales Bonner has also curated an exhibition at the Museum of Modern Art in New York and hosted musical performances at London's Serpentine Galleries. She has had a long-standing collaboration with Adidas and was made a MBE in 2022 for services to fashion.Pierre-Alexis Dumas, general artistic director of Hermès, said: \"I am really pleased to welcome Grace to the Hermès artistic director family. \"Her take on contemporary fashion, craft and culture will contribute to shaping Hermès men's style, melding the house's heritage with a confident look on the now. \"Grace's appetite and curiosity for artistic practice strongly resonate with Hermès's creative mindset and approach. We are at the start of an enriching mutual dialogue.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hermès appoint British designer Grace Wales Bonner to lead men's wear",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/981f/live/28ba4ab0-ae8b-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-21T15:20:32.000Z",
      "dateModified": "2025-10-21T15:20:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British grandmother jailed in Indonesia for drug smuggling to return to UK",
    "url": "https://www.bbc.com/news/articles/cly9jln834wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b68/live/0a348f00-ae87-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T14:58:45.000Z",
    "description": "British grandmother on death row to return to UK5 hours agoDawn LimbuWest of EnglandAPGrandmother Lindsay Sandiford will be transferred to the UK afte",
    "body": "British grandmother on death row to return to UK5 hours agoDawn LimbuWest of EnglandAPGrandmother Lindsay Sandiford will be transferred to the UK after 12 years on death row in IndonesiaA British grandmother who has spent more than a decade on death row in Indonesia after being convicted of drug smuggling can return to the UK, the Indonesian government has said.Lindsay Sandiford, 69, was sentenced to death on the island of Bali in 2013 after nearly five kilos of cocaine with a street value of £1.6m were found in her suitcase when she arrived on a flight from Thailand in 2012.She admitted the offences but said she had agreed to carry the cocaine after a drug syndicate threatened to kill her son. An agreement between the Indonesian and British governments, announced on Tuesday, will allow her to return to the UK in about two weeks alongside British national Shahab Shahabadi.A Foreign Office spokesperson said: \"We are supporting two British Nationals detained in Indonesia and are in close contact with the Indonesian authorities to discuss their return to the UK.\"ReutersSandiford was convicted of drug trafficking in 2013Sandiford, from Cheltenham, Gloucestershire, had faced the threat of execution by firing squad during her sentence in Indonesia.Shahabadi, 35, had been serving a life sentence after being convicted of drug smuggling and both British prisoners are said to have been suffering from health problems.The Indonesian minister for law and human rights, Yusril Ihza Mahendra, said he had signed a deal with British foreign secretary Yvette Cooper for the transfer of the pair.\"We agreed to grant the transfers of the prisoners to the UK. The agreement has been signed,\" Mr Yusril told reporters at a press conference in capital Jakarta earlier.They will be handed over after the technical details of the transfer are agreed, which the minister said could take \"around two weeks\" to organise.Speaking at the press conference, Mr Yusril said both prisoners are \"currently facing problems.\"\"The first one, Sandiford, is in poor health and has been examined by our doctors as well as by a doctor from the British consulate in Bali. She is seriously ill.\"The second, Shahab Shahabadi, although still young at 35 and serving a life sentence, is suffering from several serious health issues, particularly mental health disorders.\"Indonesia and the UK do not have a formal prisoner transfer arrangement; normally these require that repatriated prisoners serve out their terms in their home countries.Sandiford was arrested at a time when the Indonesian authorities were imposing tougher penalties on drug smugglers and in 2015 two Australian men were executed after being convicted of smuggling heroin.'Really tough punishment'Jennifer Fleetwood, a criminologist at the University of London, was part of Sandiford's appeal team in the initial case 12 years ago. She said it was good that the grandmother would be returning to the UK.She said: \"To undertake a prison sentence with the threat of execution, I can't fathom how difficult that would be.\"Having spent time doing research in prisons overseas, I know that it's really, really hard for people to serve a sentence abroad.\"They have huge distance from family for their significant language difficulties.\"But on top of that, often we see human rights abuses in prison, lack of access to health care.\"And as someone who is ageing with health needs, that's a really, really tough punishment to serve. 12 years is a long, long time.\"Additional reporting by Jonathan Head in Bangkok",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British grandmother jailed in Indonesia for drug smuggling to return to UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b68/live/0a348f00-ae87-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T14:58:45.000Z",
      "dateModified": "2025-10-21T14:58:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former judge Lord Bracadale resigns as chair of Sheku Bayoh death inquiry",
    "url": "https://www.bbc.com/news/articles/c3vnwpkn977o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a43/live/496fab90-46dc-11f0-9e29-496c47d2add7.jpg",
    "tag": "Trending",
    "date": "2025-10-21T16:20:27.000Z",
    "description": "4 hours agoPaul O'HareBBC ScotlandPA MediaSheku Bayoh died after being restrained by six police officers in FifeLord Bracadale has resigned as chairpe",
    "body": "4 hours agoPaul O'HareBBC ScotlandPA MediaSheku Bayoh died after being restrained by six police officers in FifeLord Bracadale has resigned as chairperson of the Sheku Bayoh inquiry, more than two months after he refused to quit the post.The Scottish Police Federation (SPF), which represents rank and file officers, had previously questioned the former judge's impartiality.The SPF raised concerns about Lord Bracadale's private meetings with the family of Mr Bayoh.The father-of-two was 31 when he died in May 2015 after being restrained by six police officers on a street in the Fife town of Kirkcaldy.The inquiry has been examining what happened before and during the death of Mr Bayou in police custody. It has been looking at how the police dealt with the aftermath, the investigation into Mr Bayoh's death and whether race was a factor.Lord Bracadale confirmed his resignation in a letter to Deputy First Minister Kate Forbes.He said it followed a move by the SPF to raise a judicial review of his decision - which had been due to be heard next month - to continue in his role.PA MediaLord Bracadale had led the inquiry into Mr Bayoh's death since 2020The row dates back to April when the SPF first raised concerns about Lord Bracadale's meetings with the family of Mr Bayoh.In June submissions were heard following a formal application by the federation for the former judge to recuse himself from further involvement in the inquiry.But on 13 August Lord Bracadale announced he would not step down.Following his resignation, the federation said the former judge's position had become \"untenable\" but added the situation was \"unfortunate for all those involved in the inquiry\".The Scottish government thanked Lord Bracadale for his work and said it was \"committed to establishing the facts surrounding the circumstances leading to Mr Bayoh's death\". A spokesperson added: \"We will now urgently consider the best way forward.\"Meanwhile, Mr Bayoh's family said they were \"devastated\" by Lord Bracadale's decision.In his resignation letter, Lord Bracadale wrote: \"As the judicial review process developed it became clear that the concerns about my conduct had not been allayed by my decision and that the criticisms have persisted.\"As a result, it is now clear to me that many of the core participants have lost confidence in my conduct of the Inquiry to such an extent that it cannot be retrieved.\"The former judge said all the evidence had now been led and the next stage in the inquiry would be the hearing of closing submissions.This will then be followed by a preparation of the report by the chair.Lord Bracadale added: \"I am concerned that the majority of core participants would have no confidence in the findings of any report prepared by me.\"I consider that that, in turn, would be likely to have a damaging effect on public confidence in the findings of a report prepared by me and recommendations flowing from it.\"In my view the best interests of the inquiry would be served by the appointment of a new chair to whom the existing evidence, all of which is available on tape and transcript, would be available.\"PA MediaFormer Police Scotland chief constable Sir Iain Livingstone, who retired in 2023, told the inquiry that the force was institutionally racistLord Bracadale said the purpose of his meetings with the families was to \"obtain and retain their confidence in the Inquiry and their engagement with it\".He added its terms of reference included issues directly related to them, including their experience of the subsequent investigations; and \"the overarching issue of the race of Sheku Bayoh\".Lord Bracadale said the families had \"lost confidence\" in Police Scotland, the Police Investigations and Review Commissioner and the Crown Office and Procurator Fiscal Service.He added: \"As the Inquiry progressed it became apparent at various points that they were losing confidence in the Inquiry and were likely to cease engaging with it. \"I consider that if I had not had meetings with members of the Families, it is likely that they would have walked out of the Inquiry.\"\"I very much regret that my conduct in relation to meeting the families for what I considered to be a reasonable purpose of maintaining their engagement with the Inquiry has led to a loss of confidence by other core participants in my position as Chair.\"The former judge also noted that during the course of the inquiry, former Police Scotland chief constable Sir Iain Livingstone said that the force was institutionally racist.Lord Bracadale's letter concluded: \"I very much hope that the Scottish ministers will be able to appoint a new chair in early course in order to restore the confidence of all the core participants in the inquiry and that the families of Sheku Bayoh will continue to engage with and participate in the Inquiry under a new chair.\"Police federation chief David Kennedy described the situation as \"unfortunate\" The SPF said Lord Bracadale's position had become \"untenable\" after it emerged he  met privately with the family of Mr Bayoh on at least five occasions since the start of the inquiry and \"discussed evidence with them\".General secretary David Kennedy said: \"It is unfortunate for all those involved in the inquiry that this situation has occurred. \"The meetings between Lord Bracadale and the family of Sheku Bayoh had created an appearance of bias. \"We look forward to the final stages of the inquiry and bringing this matter to a conclusion.\"The Bayoh family's lawyer Aamer Anwar said the inquiry - which started in November 2020 - had highlighted the \"devastating and deadly force used on an unarmed black man\".Mr Anwar added: \"For the Bayoh family, an unholy trinity of the Police, SPF and Crown Office have tried their very best to shut down this inquiry, but they cannot hide from the truth.\"The Glasgow-based solicitor described the situation as \"unprecedented\".He told BBC Scotland News: \"It has never, ever happened in any public inquiry in the United Kingdom.\"  Members of the public called the police after Mr Bayoh was spotted carrying a knife and behaving erratically in the streets of Kirkcaldy on 3 May 2015.He was not carrying the knife when officers arrived at the scene but a violent confrontation followed, with up to six officers restraining the 31-year-old on the ground.Mr Bayoh lost consciousness and later died in hospital.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former judge Lord Bracadale resigns as chair of Sheku Bayoh death inquiry",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a43/live/496fab90-46dc-11f0-9e29-496c47d2add7.jpg"
      ],
      "datePublished": "2025-10-21T16:20:27.000Z",
      "dateModified": "2025-10-21T16:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AWS outage: Are we relying too much on US big tech?",
    "url": "https://www.bbc.com/news/articles/c0jdgp6n45po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a62/live/309d3c60-ae90-11f0-b0ec-2949909959e5.jpg",
    "tag": "Trending",
    "date": "2025-10-21T19:14:08.000Z",
    "description": "60 minutes agoLiv McMahonTechnology reporterGettyThe Amazon Web Services (AWS) outage on Monday made global headlines after  knocking some of the worl",
    "body": "60 minutes agoLiv McMahonTechnology reporterGettyThe Amazon Web Services (AWS) outage on Monday made global headlines after  knocking some of the world's largest sites offline for hours.For users, the impacts ranged from the serious -  such as not being able to access vital banking, government or work services - to the not-so-serious, such as fears of losing long built-up streaks on Duolingo.But the outage has also reignited the debate around whether countries, including the UK, are over-dependent on a handful of US tech firms.Should we worry that an issue occurring at the heart of Amazon's cloud computing operations in Virginia badly affected UK firms and services such as Lloyds Bank and HMRC - and what, if anything, can we do about it?Market dominanceAmazon has embedded itself within the very fabric of cloud-based computing, the infrastructure that underpins the delivery of the IT systems which are so much a part of all our lives.The company and Microsoft's cloud services, Azure, have each cornered somewhere between 30 and 40% of the market in the UK and Europe, according to the UK markets regulator, the Competition and Markets Authority (CMA).But even that figure doesn't fully capture how significant they are.Because even if a service itself is not hosted by one of these two giants - or the UK's third largest provider, Google - critical things it relies upon still might be.\"A cloud deployment is a complicated piece of infrastructure with many components, some invisible,\" said Prof James Davenport, Hebron and Medlock Professor of Information Technology at the University of Bath.Brent Ellis, principal analyst at market researcher Forrester, said the outage exposed what he called the \"nested dependency\" between popular digital platforms and the array of services providing the web's technical underpinnings.He also said it underscored the risks inherent in that dependency.\"There's great appeal to using tech giants, but assuming they are too big to fail or inherently resilient is a mistake, with the evidence being the current outage and past ones,\" he said.\"It's a feature of a highly concentrated risk where even small service outages can ripple through the global economy.\"Those ripples are what millions of users felt on Monday.Economies of scaleSo, if relying on a small number of US firms has its risks, why do so many companies do it?The answer, experts say, is that inking contracts with household names such as Amazon, Microsoft or Google also has its upsides.It means a company doesn't have to pay hefty costs to run its own servers, and can leverage the power of so-called hyperscalers to handle fluctuations in site traffic - as well as benefit from heightened cyber-security.Vili Lehdonvirta, professor of technology policy at Aalto University in Finland, told the BBC that the sector, at its core, is \"driven by economies of scale.\"Or, put another way, reducing the current dependence on US tech giants and creating a more \"sovereign\" infrastructure would come with a high price tag.With the likes of Amazon and Microsoft already embedded in many different aspects of digital operations, companies looking to migrate elsewhere or diversify may face challenges, said Stephen Kelly of Circata.\"The explosion of enterprise data now stored with a single provider like AWS makes the eventual cost of migrating to different vendors prohibitively high,\" he said.Cybersecurity expert Thomas Hyslip, who currently teaches at University of South Florida,  said that there was another benefit to the dominance of US firms.\"Of all the places for it to be, I think it's best it's in the US because you don't have a lot of government interference,\" he said. Still, that concentration could invite government intervention, he added.\"If god forbid there was ever another war involving the US and some other countries, there could be the opportunity for the government to interject themselves and cause problems for whoever the enemy was at that point,\" he said.'Fair and open competition'Nonetheless there is unease about the status quo.The dominance of a few small companies has come to define much of the tech industry at large - from social media to streamingAnd in the cloud sector, some believe this may mean smaller providers can be overlooked or ignored.Nicky Stewart, senior advisor to the Open Cloud Coalition, has joined lots of other experts in saying Monday's outage showed \"the risks of over-reliance on two dominant cloud providers, an outage most of us will have felt in some way\".The CMA said in July its investigation into competition in the UK cloud services market had found it was \"not working well\".The regulator recommended it use its own recently-acquired powers to investigate whether to designate Amazon and Microsoft as having \"strategic market status\" - which would allow it to demand changes to boost competition.Ms Stewart said events like the AWS outage demonstrate the need for \"a more open, competitive and interoperable cloud market; one where no single provider can bring so much of our digital world to a standstill\".\"Fair and open competition will enable the UK to diversify its cloud workloads, strengthen our national resilience and allow UK challenger cloud providers to bring their talent and innovation to this over-concentrated and unhealthy market,\" she said.Mr Kelly, meanwhile, said the potential \"difficulty\" of diversifying cloud providers should not overshadow the urgent need for IT resilience.Ultimately, he said, the solution was political.\"The UK government should also take the lead in mandating data resilience standards across key industries, including policy frameworks that require the use of two or more distinct cloud providers and promote continuous data replication,\" he said.Lord Leong, speaking on behalf of the government in the House of Lords on Tuesday, said it was in contact with AWS about how it would mitigate outages in future.\"We are working to diversify the UK's cloud ecosystem and encourage greater participation by UK-based and European providers,\" he told peers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AWS outage: Are we relying too much on US big tech?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a62/live/309d3c60-ae90-11f0-b0ec-2949909959e5.jpg"
      ],
      "datePublished": "2025-10-21T19:14:08.000Z",
      "dateModified": "2025-10-21T19:14:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan's first female leader: A historic moment with caveats",
    "url": "https://www.bbc.com/news/articles/cze6dgxlzwxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16b6/live/f5d05a70-ae73-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T12:53:58.000Z",
    "description": "7 hours agoShaimaa KhalilJapan correspondentReutersSanae Takaichi has made it to the top in a male-dominated countryFor many young girls in Japan toda",
    "body": "7 hours agoShaimaa KhalilJapan correspondentReutersSanae Takaichi has made it to the top in a male-dominated countryFor many young girls in Japan today, the image of Sanae Takaichi taking the helm of power as the country's first ever female leader is powerful and formative.It means a patriarchal society and a political system that has long been dominated by men is now led by a woman.But while the optics speak of a progressive moment, some women don't see her as an advocate for change.\"It was quite interesting to see how people outside Japan have reacted to the news.\" Ayda Ogura, 21, says.\"Everyone's like, 'wow, she's the first female prime minister in Japanese history and that would be a great opportunity for women empowerment and gender equality in Japan'.\"I think that's a very naive interpretation.\"Instead, Ms Ogura points to her \"political beliefs and what she stands for\", adding: \"She perpetuates the patriarchal system.\"Ayda Ogura, 21, warns this may not be the moment for gender equality in Japan some thinkA big fan of Margaret Thatcher, Britain's first female prime minister, Sanae Takaichi has always wanted to be the \"Iron Lady\" of her country.And like Thatcher, Takaichi is a staunch conservative.Observers say her leadership is a tactical move from the ruling Liberal Democratic Party (LDP) to appeal to the more conservative base which had recently gravitated towards Japan's parties further to the right.Takaichi opposes same-sex marriage and has long stood against legislation that would allow married couples to have separate surnames, preventing many women from keeping their maiden names.She's also against women being in line for succession in the imperial family.However, she did soften some of her messaging during her campaign - saying she favours giving tax incentives to companies that provide childcare facilities to their employees and spoke of possible tax breaks for families spending on childcare.But she has over the years backed the idea of a more traditional role for women in society and in the family.When it comes to women's issues, Takaichi is consistent with her country's less than impressive record on gender issues.Japanese women are among the best educated and highest qualified in the world and yet they struggle with the expectations of a conservative society that still pushes them in traditional roles.According to the 2025 gender gap index by the World Economic Forum, Japan ranked 118th among 148 countries, with female representation in the field of politics notably low.Leadership positions have traditionally been dominated by men and Japan has struggled to increase the number of female lawmakers and business leaders.The world's fourth largest economy ranks last among the G7 countries when it comes to the share of women in its national parliament.  Specifically, women make up about 15.7% of lawmakers in Japan, the lowest figure among the G7.It is even slow when it comes to women's reproductive health: only this week was it announced that the \"morning after\" pill - a form of emergency contraception available without prescription in more than 90 countries - had finally been approved for over the counter use in Japan.Even so, some see Takaichi's rise to power as a pivotal moment that could change how women view their prospects.\"There is great significance in Ms Takaichi becoming prime minister, with a broader impact on society,\" Naomi Koshi - who became the country's youngest female mayor in 2012 - told Japan's Kyodo news agency.Koshi argued Japan having a female prime minister will \"lower psychological barriers\" for women and girls, helping them feel it is normal to \"stand out\" as leaders in companies and society, even as gender-based stereotypes and expectations still remain.But Audrey Hill-Uekawa, 20, points out that, while it is remarkable Japan has its first female leader, one must remember it took her more than 30 years to get to that position.\"She's also not really going against the grain. She's saying the same thing as the men.\" Audrey Hill-Uekawa, 20, says the new prime minister's views don't differ much from the men who have gone beforeMs Hill-Uekawa adds that she shouldn't be put on a pedestal simply because she is a woman.\"We need to make sure we're talking about her policies. We need to be able to criticise her equally as everyone else.\"It is not just what Takaichi has said which has led people to label her as a defender of the patriarchy.It's also evident by who her champions inside the party have been.She's the protégé of the late former hawkish prime minister Shinzo Abe, and was backed in the leadership election by Taro Aso - a senior figure in the LDP at the head of one of the ruling party's most influential conservative blocs.His faction's support for Sanae Takaichi was pivotal in uniting the party's right wing behind her.\"I do feel that it is difficult for women to sort of relate to her success because it furthers this idea that we must be compliant with the status quo,\" 21-year-old Minori Konishi says.Ms Ogura agrees, saying that with her as a figurehead for women in politics, \"people are going to expect the same from us as well\".\"They're going to expect us to be compliant, not go against the ideals that they have, and it might make our job more difficult.\"Making history, however, was just the first of the challenges Takaichi will face - not least tackling a sluggish economy and inflation and winning back the trust of a frustrated and angry electorate, as well as hosting president Trump within days of taking power.It's safe to say that no-one expects gender equality issues to be high on her priority list.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan's first female leader: A historic moment with caveats",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16b6/live/f5d05a70-ae73-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T12:53:58.000Z",
      "dateModified": "2025-10-21T12:53:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Orionid meteor shower peaks tonight: When and where to see it ",
    "url": "https://www.bbc.com/weather/articles/c70196602g2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/b0ab/live/e93c41f0-ae5c-11f0-bf6e-0db822206ec2.jpg",
    "tag": "Trending",
    "date": "2025-10-21T14:31:48.000Z",
    "description": "Stunning Orionid meteor shower peaks tonight in moonless skyImage source, Getty ImagesByShireen Jordan BBC Weather and Simon King Lead Weather Present",
    "body": "Stunning Orionid meteor shower peaks tonight in moonless skyImage source, Getty ImagesByShireen Jordan BBC Weather and Simon King Lead Weather PresenterUpdated 5 hours agoWith some clear skies on Tuesday night you might have your best chance of seeing the annual Orionids meteor shower.Taking place 60 miles up in space, it can often be one of the most impressive displays of the celestial calendar and is visible across the globe. The meteors are known for being bright and fast, peaking for about seven days around the 22 October.You may also get a chance to see either the Lemmon or SWAN comets, external as they also pass close to Earth.What are the Orionids?Image source, Chris HornbyImage caption, Meteors are often referred to as shooting starsThe Orionids are fast-moving meteors travelling at a speed of around 41 miles per second.They have long streaks of light and originate from the well- known Halley's Comet as it follows its orbit around the Sun. The comet itself only passes by Earth roughly every 75 years, with the next date expected to be the summer of 2061.As Earth passes through debris left by the comet, tiny particles the size of a grain of sand burn up in our atmosphere and leave a streak of light through the sky.  They can appear faint but they leave a distinctive light trail. Larger meteors will produce bright trails. Sometimes meteors can even appear brighter than the planet Venus – these are called fireballs, external.Skygazers in the Northern Hemisphere might also have the chance to see either comet Lemmon or SWAN.Comet SWAN takes 22,554 years to orbit the Sun and Lemmon 1,350 years but both are at their closest orbit to Earth on Tuesday.How can I watch the Orionids?Image source, CFOTOImage caption, You should be able to see the shower for several days on either side of the peak date, if weather conditions allowThe radiant is the point in the sky from which the meteors appear to originate, and for the Orionids this is the constellation of Orion.Orion rises in the east after midnight, just to the north of its red-tinged star Betelgeuse. To track down Orion, external, look out for a line of three bright stars, close together, known as Orion's Belt.The quality of the display is measured by how many meteors are visible every hour - known as the zenithal hourly rate. There could be around 15 meteors an hour during the peak of the Orionids around the 22 October travelling at speeds of 148,000mph (238,000km/h).For the best viewing conditions, find a dark spot, away from city lights after midnight with an unobstructed wide, open sky. Let your eyes adjust to the dark and look towards the constellation of Orion. You will not need binoculars or a telescope as the shower will be visible to the naked eye.Will UK skies be clear?The weather has turned increasingly unsettled this week, with cloud and rain interspersed with clearer intervals and misty conditions.  However, cloud and showers on Tuesday will clear through the evening and so there should be plenty of clear skies across the UK.The lack of moonlight due to a new Moon will help your chance of spotting some meteors.While meteor activity will then start to decrease, there will still be a good opportunity to catch some shooting stars - meteors - in Scotland on Wednesday night.But otherwise elsewhere across the UK, cloud and rain will spread northward and obstruct any view of the night sky.By the end of the week, clearer and colder conditions are expected to develop, with better night-sky viewing prospects towards the later stages of the Orionids. And, if you miss the peak, the display continues until 7 November. Keep across your local forecast on the BBC Weather website or app.Are the Orionids visible around the world?The Orionids can be viewed in both the Northern and Southern hemispheres during the hours after midnight.How best to view them depends on which hemisphere you are in.Nasa recommends anyone hoping to see the shower lies flat on their back with feet facing southeast if they are in the Northern Hemisphere or northeast if they in the Southern Hemisphere and looks up, external.According to the American Meteor Association, the only obstacles to seeing them are cloud cover and city lights, external.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Orionid meteor shower peaks tonight: When and where to see it ",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/b0ab/live/e93c41f0-ae5c-11f0-bf6e-0db822206ec2.jpg"
      ],
      "datePublished": "2025-10-21T14:31:48.000Z",
      "dateModified": "2025-10-21T14:31:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarkozy enters jail over campaign financing - France's first ex-president behind bars",
    "url": "https://www.bbc.com/news/articles/cvgkm2j0xelo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4336/live/5e31dbc0-ae83-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T11:27:02.000Z",
    "description": "French ex-president Sarkozy begins jail sentence for campaign finance conspiracy9 hours agoPaul KirbyEurope digital editor andHugh Schofieldin ParisWa",
    "body": "French ex-president Sarkozy begins jail sentence for campaign finance conspiracy9 hours agoPaul KirbyEurope digital editor andHugh Schofieldin ParisWatch: Sarkozy was cheered by supporters as he embraced his wife Carla Bruni-Sarkozy outside their Paris homeNicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi.Not since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945 has any French ex-leader gone behind bars.Sarkozy, who was president from 2007-2012, has appealed against his jail term at La Santé prison, where he will occupy a small cell in the its isolation wing.More than 100 people applauded and shouted \"Nicolas!\" as he left his villa in the exclusive 16th district of Paris, holding his wife Carla Bruni-Sarkozy by the hand.His son Louis, 28, had appealed to supporters for a show of support, while another son, Pierre, called for a message of love – \"nothing else, please\".Nicolas Sarkozy, 70, was driven through the entrance of the notoriously overcrowded 19th-Century prison in the Montparnasse district south of the River Seine at 09:40 local time (07:40 GMT), while dozens of police officers cordoned off most of the surrounding streets.He continues to protest his innocence in the highly controversial Libyan money affair and posted a message on X as he was driven to the jail, saying: \"I have no doubt. Truth will prevail. But how crushing the price will have been.\"\"With unwavering strength I tell [the French people] it is not a former president they are locking up this morning - it is an innocent man,\" he wrote. \"Do not feel sorry for me because my wife and my children are by my side... but this morning I feel deep sorrow for a France humiliated by a will for revenge.\"Moments after Sarkozy entered jail, his lawyer Christophe Ingrain said a request for his release had been filed. Nothing justified his imprisonment, said Mr Ingrain, adding: \"He'll be inside for at least three weeks or a month.\"Sarkozy has said he wants no special treatment at La Santé prison, although he has been put in its isolation section for his own safety as other inmates are infamous drugs dealers or have been convicted for terror offences.EPANicolas Sarkozy and his wife, Carla Bruni, greet people on the day he is due to enter prisonSmall cell with TV, and one hour's daily exerciseSarkozy's cell in the prison's isolation wing is believed to be on the top floor and will measure between 9-11 sq m (95-120 sq ft). There had earlier been talk of him serving his term in the another wing for \"vulnerable people\", where other VIPs have been jailed in the past.He will have a toilet, a shower, a desk, a small electric hob and a small TV, for which he will have to pay a monthly €14 (£12) fee, and the right to a small fridge.The former president has the right to receive information from the outside world and family visits as well as written and phone contact. But he is in effect in solitary confinement, allowed just one hour a day for exercise, by himself in the wing's segregated courtyard.\"Conditions of detention in an isolation wing are pretty hard,\" La Santé ex-deputy head Flavie Rault told BFMTV. \"You are alone, all the time. The only contact you have is with prison staff. You never come across another detainee for security reasons and there's a type of social isolation which makes life difficult\".At the end of last week, Sarkozy was received at the Élysée Palace by President Emmanuel Macron, who told reporters on Monday \"it was normal that on a human level I should receive one of my predecessors in that context\".Macron stressed on Tuesday that it was not his role \"to comment on or criticise judicial decisions\", but he said it was normal that for many in France the sight of \"a president jailed by this judicial decision would provoke comment\".In a further measure of official support for the ex-president, Justice Minister Gérald Darmanin said he would go to visit him in prison as part of his role in ensuring Sarkozy's safety and the proper functioning of the jail.\"I cannot be insensitive to a man's distress,\" he added.ReutersNicolas Sarkozy has maintained his innocence and has lodged an appealRead more: Former French president Sarkozy given five-year sentence after Libya caseEver since he left office in 2012, Sarkozy has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.Late next month, France's highest administrative court will give its verdict on Sarkozy's appeal against a six-month jail term in another illegal campaign financing case known as the Bygmalion affair.Ahead of his arrival at La Santé prison, Sarkozy gave a series of media interviews, telling La Tribune: \"I'm not afraid of prison. I'll keep my head held high, including at the prison gates.\"Sarkozy has always denied doing anything wrong in a case involving allegations that his 2007 presidential campaign was funded by millions of euros in Libyan cash.The former centre-right leader was cleared of personally receiving the money but convicted of criminal association with two close aides, Brice Hortefeux and Claude Guéant, for their role in secret campaign financing from the Libyans.The two men both had talks with Gaddafi's intelligence chief and brother-in-law in 2005, a meeting arranged by a Franco-Lebanese intermediary called Ziad Tiakeddine, who died in Lebanon shortly before Sarkozy's conviction.As he lodged an appeal, Sarkozy is still considered innocent but he has been told he must go to jail in view of the \"exceptional seriousness of the facts\".Sarkozy said he would take two books with him into prison, a life of Jesus by Jean-Christian Petitfils and the Count of Monte Cristo, Alexandre Dumas's classic story of a man wrongly imprisoned who escapes to wreak vengeance on his prosecutors.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarkozy enters jail over campaign financing - France's first ex-president behind bars",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4336/live/5e31dbc0-ae83-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T11:27:02.000Z",
      "dateModified": "2025-10-21T11:27:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza ceasefire deal going better than expected, Vance says",
    "url": "https://www.bbc.com/news/articles/cd9k2dj37wqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/71a7/live/cd62c9a0-ae9c-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-21T17:09:21.000Z",
    "description": "3 hours agoDavid Gritten andJaroslav LukivEPA/ShutterstockThe implementation of a Gaza ceasefire agreement is \"going better than expected\" and the tru",
    "body": "3 hours agoDavid Gritten andJaroslav LukivEPA/ShutterstockThe implementation of a Gaza ceasefire agreement is \"going better than expected\" and the truce can hold, US Vice-President JD Vance has said during a visit to Israel.Vance also warned that \"if Hamas does not co-operate, it will be obliterated\", while refusing to give a deadline for when the Palestinian group must disarm - a part of US proposals yet to be agreed.US President Donald Trump, who brokered the ceasefire deal earlier this month, said America's \"great allies\" in the Middle East would be ready to \"go into Gaza with a heavy force and 'straighten out Hamas' if Hamas continues to act badly\".Vance's visits come after a flare-up of violence on Sunday that threatened to derail the 12-day-old truce.Israel said a Hamas attack killed two soldiers, triggering Israeli air strikes which killed dozens of Palestinians.Trump wrote on social media that \"there is still hope that Hamas will do what is right\", adding: \"If they do not, an end to Hamas will be FAST, FURIOUS, & BRUTAL!\"Vance is expected to push Israeli Prime Minister Benjamin Netanyahu to start negotiations on long-term issues for a permanent end to the war with Hamas during his visit.The vice-president praised Israel for being \"remarkably helpful\" in moving towards the deal's main goals, but said that a lot of hard work remained ahead to secure further steps.The two special US envoys who helped negotiate the ceasefire deal, Steve Witkoff and Jared Kushner, appeared alongside Vance at a news briefing in southern Israel. Witkoff and Kushner held talks with Netanyahu after arriving in Israel on Monday.Trump is said to have dispatched his deputy and envoys to Israel to keep up the momentum and push for the start of talks on the second critical phase of his 20-point Gaza peace plan.It would involve setting up an interim government in the Palestinian territory, deploying an international stabilisation force, the withdrawal of Israeli troops, and the disarmament of Hamas.Israel has previously said it would not join such talks until Hamas has returned all the deceased hostages it has been holding.Vance, Witkoff and Kushner are also attempting to ensure the ceasefire deal, which is based on the first phase of the peace plan, does not collapse first.The New York Times cited US officials as saying they were concerned that Israel's prime minister might \"vacate\" the deal and resume an all-out assault against Hamas.Netanyahu told the Israeli parliament on Monday that he would discuss \"security challenges\" and \"political opportunities\" with Vance during his visit.He also said Israeli forces had dropped 153 tonnes of bombs on Gaza in response to what he called a \"blatant\" breach of the ceasefire by Hamas on Sunday.\"One of our hands holds a weapon, the other hand is stretched out for peace,\" he said. \"You make peace with the strong, not the weak. Today Israel is stronger than ever before.\"The Israeli military blamed Hamas for an anti-tank missile attack on Sunday that killed two Israeli soldiers in southern Gaza and then carried out dozens of strikes across the territory which hospitals said killed at least 45 Palestinians.Afterwards, the Israeli military said it was resuming enforcement of the ceasefire, while Hamas said it remained committed to the agreement.However, four Palestinians were reportedly killed by Israeli fire east of Gaza City on Monday. The Israeli military said its troops fired towards \" terrorists\" who crossed the so-called \"Yellow Line\", which demarcates the area still occupied by Israeli forces.EPAThere have been repeated flare-ups in violence since the Gaza truce came into force on 10 OctoberHamas's chief negotiator Khalil al-Hayya, who is in Cairo, meanwhile insisted that his group and other Palestinian factions were committed to the ceasefire deal and \"determined to fully implement it until the end\".\"What we heard from the mediators and the US president reassures us that the war in Gaza is over,\" he told Egypt's Al-Qahera News TV .Hayya also said Hamas was serious about handing over the bodies of all the deceased hostages still in Gaza despite facing what he described as \"extreme difficulty\" in its efforts to recover them under rubble because of a lack of specialist equipment.Overnight, Israeli authorities confirmed that Hamas had handed over the body of another deceased Israeli hostage to the Red Cross in Gaza.The remains were identified as those of Tal Haimi, 41, who the Israeli military said was killed in Kibbutz Nir Yitzhak during the Hamas-led attack on southern Israel on 7 October, which triggered the war.That means 13 of the 28 hostages' bodies held in Gaza when the ceasefire took effect on 10 October have so far been returned.Twenty living Israeli hostages were also released last week in exchange for almost 2,000 Palestinian prisoners and detainees in Israeli jails.There has been anger in Israel that Hamas has not yet returned all the dead hostages, with the Israeli prime minister's office saying that the group \"was required to uphold its commitments\".Anadolu via Getty ImagesExcavators are reportedly being used to search for the bodies of dead hostages in the Hamad City neighbourhood of Khan YounisMeanwhile, the UN's World Food Programme stressed that sustaining the ceasefire was \"vital\" to delivering life-saving humanitarian aid to the territory.Since the ceasefire took effect, 530 WFP lorries have crossed into Gaza with more than 6,700 tonnes of food. This was enough to feed almost 500,000 people for two weeks, spokeswoman Abeer Atefa told a briefing in Geneva.However, she said the agency could not reach its daily target of 2,000 tonnes of supplies because not all the crossings into the territory were open.Only two crossings - Kerem Shalom and Kissufim - were functional with neither of them located in the north, where the food situation remained \"extremely dire\", she added.Some specialised nutritional supplements for children and pregnant women have been distributed in the north via the south, but no large-scale deliveries have been possible.Ms Atefa said that in the south of the territory, where people were now able to access food safely and with dignity, there had been no looting of WFP supplies.But she added that many people were often eating just a small portion of their supplies and rationing the rest because they were highly anxious about the future and feared that deliveries could be blocked again.Israel, which controls the entry of aid into Gaza, temporarily halted deliveries in response to Sunday's violence. Deliveries resumed on Monday following heavy international pressure.Israel launched a military campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people and took 251 others as hostages.At least 68,216 have been killed in Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza ceasefire deal going better than expected, Vance says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/71a7/live/cd62c9a0-ae9c-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-21T17:09:21.000Z",
      "dateModified": "2025-10-21T17:09:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is paying for  Donald Trump's new White House ballroom? ",
    "url": "https://www.bbc.com/news/articles/c891yxgj44ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d362/live/2c0f1a00-ae96-11f0-91f4-67b578c53508.jpg",
    "tag": "Trending",
    "date": "2025-10-21T17:39:18.000Z",
    "description": "3 hours agoBernd Debusmann Jrat the White HouseAs construction begins on President Donald Trump's new, $250m (£187m) White House ballroom, mystery con",
    "body": "3 hours agoBernd Debusmann Jrat the White HouseAs construction begins on President Donald Trump's new, $250m (£187m) White House ballroom, mystery continues to swirl around the identities of the wealthy donors and corporations paying for it. Groundbreaking for the ornate 90,000 sq ft (8,360 sq m) project began on Monday, with excavators and construction workers tearing out portions of the East Wing. The US president has said that he personally will pay for significant portions of its construction, and suggested that some still anonymous donors would be willing to spend more than $20m to complete the project.The funding model has sparked concern among some legal experts, who say it may amount to paying for access to the administration. \"I view this enormous ballroom as an ethics nightmare,\" Richard Painter, a former chief ethics lawyer in the Bush White House between 2005 and 2007, told the BBC. \"It's using access to the White House to raise money. I don't like it,\" he added. \"These corporations all want something from the government.\" A dinner for potential donors held at the White House on 15 October included senior executives from prominent American companies including Blackstone, OpenAI, Microsoft, Coinbase, Palantir, Lockheed Martin, Microsoft, Amazon and Google. Also present was Woody Johnson, the owner of the New York Jets NFL team, and Shari and Edward Glazer, who, together with their siblings, own both the Tampa Bay Buccaneers and Manchester United.A pledge form reviewed by CBS News, the BBC's US partner, suggested that donors could be eligible for \"recognition\" for their contributions. While plans are still being finalised, that recognition could potentially take the form of names etched into the structure. The White House had originally said that the gigantic structure would have a seated capacity of 650 people. This week, Trump said that it will be able to hold 999. Only one contributor has so far been revealed. Court documents show that YouTube will pay $22m towards the project as part of a settlement with Trump regarding a lawsuit over the suspension of his account following the 6 January 2021 riot at the US Capitol. It is unclear, however, how many of the rest of those in attendance have pledged to donate, or how much. An official list has yet to be published, although White House officials say they plan to reveal the one.Documents obtained by CBS indicate that the donations will be handled by the Trust for the National Mall, a non-profit that works with the National Park Service and fundraises for projects on the Mall and at the White House. At the event for potential donors, Trump said many of the attendees had been \"really, really generous\" and said some had asked whether $25m was an appropriate donation. \"I said: I will take it,\" Trump remarked. The White House has insisted there is nothing inappropriate in soliciting donations and that the ballroom will be used by future administrations. The renovation will not cost US taxpayers a cent, according to the administration.  But Mr Painter suggested it could be considered a \"pay-to-play scheme\", which has dogged previous White House administrations of both political parties.In the 1990s, for example, then-President Bill Clinton came under scrutiny for allegedly selling overnight stays in the Lincoln Bedroom in exchange for campaign contributions.More recently, Trump sought corporate sponsors for the annual White House Easter Egg Roll in April, which some said could amount to companies vying for the president's attention. Trump and administration officials have said that the new ballroom is a necessary renovation given the lack of large existing facilities to hold state dinners and other events. The White House often uses a tent on the South Lawn to fete foreign leaders and a larger guest list for a state dinner. But the scale of the new ballroom, Mr Painter added, poses an \"enormous temptation\" to use the facility for political fundraising that was not the case before, even if presidents from both parties have invited supporters to events. \"The limited space [now] means that not everyone gets a White House invitation,\" he said. \"In my view, that's a good thing....the [current] size limits the 'pay to play' game, at least on White House premises.\" Proving any wrongdoing, however, is unlikely. \"You can't prove a quid pro quo,\" Mr Painter said. \"But I think the Trump administration is pushing the envelope here.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is paying for  Donald Trump's new White House ballroom? ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d362/live/2c0f1a00-ae96-11f0-91f4-67b578c53508.jpg"
      ],
      "datePublished": "2025-10-21T17:39:18.000Z",
      "dateModified": "2025-10-21T17:39:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boris Johnson left Covid Inquiry in a hurry - he won't want to come back",
    "url": "https://www.bbc.com/news/articles/cj6nennz0nyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3acb/live/15386a90-ae9e-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T16:49:01.000Z",
    "description": "Boris Johnson left the Covid Inquiry in a hurry - he'll be pleased not to come back3 hours agoVanessa ClarkeEducation reporterClosing schools in Covid",
    "body": "Boris Johnson left the Covid Inquiry in a hurry - he'll be pleased not to come back3 hours agoVanessa ClarkeEducation reporterClosing schools in Covid 'a nightmare idea', former PM Boris Johnson saysPapers in hand, Boris Johnson arrived at the Covid Inquiry before the sun came up.He was there to answer questions on decisions he made during the pandemic that directly impacted children.And what an impact they had.School attendance, behaviour, screen time, speech and language - we now know the pandemic had an enduring effect on all of these issues for children.Demand for speech and language support increased markedly after the pandemic. The amount of children who are persistently absent from school is still stubbornly high. And school suspensions and exclusions have hit record levels.Each of these issues can be traced back to a part of the pandemic which has been central to this session of the inquiry: the closure of schools. The decision to shut schools was one described by Boris Johnson on Tuesday as a \"personal horror\" for him, a \"nightmare idea\", but one which he also said seemed like the only option at the time. We know that, in March 2020, the government was still maintaining an almost total focus on efforts to keep schools open.But last week the former education secretary Gavin Williamson told the inquiry ministers should have \"bitten the bullet\" and done more to prepare for school closures.We heard in earlier evidence given to the inquiry that there wasn't even a plan for the closure of schools until the day before it was announced on 18 March 2020.This was described as an \"extraordinary dereliction of duty\" in the evidence of Sir Jon Coles, chief executive of the United Learning trust.But on Tuesday, the former PM pushed back on that claim. Getty ImagesThe former PM also suggested he regretted not doing separate media briefings just for children\"If you look at the sequence from February onwards, it's clear that Sage (Scientific Advisory Group for Emergencies) is talking about the possibility, the Cabinet is discussing it in March. Certainly I remember the subject coming up repeatedly,\" he said.It is right to say Sage had referenced the prospect of \"mass school closures\" in February 2020. But the top civil servant at the Department for Education (DfE) at the time, Jonathan Slater, wrote in his evidence submitted to the inquiry that \"DfE's contingency plans were premised on the assumption that schools (and other education settings) would remain open\".And Williamson told the inquiry last week that his ability to plan for closures was impeded by Downing Street.It all points to the chaos of the decision-making processes at the heart of government at the time - something explicitly referenced in earlier evidence by the former children's commissioner Anne Longfield.It wasn't clear who had responsibility for planning for children at the time, she said.What is now clear is that there was no love lost between Johnson and Williamson, the people with the highest responsibility for children's welfare at the time of the pandemic.Last week, we saw the expletive-laden rant Williamson texted to his former boss in which he lamented the \"abuse\" he had received for the government's decision to shut schools the day after reopening them in January 2021.And on Tuesday, Johnson was confronted with his own leaked messages to his advisers, in which he suggested he wanted to fire those in the DfE after the exam results fiasco of August 2020.He now says the DfE did a \"heroic\" job of trying to cope with the pandemic. This was described as an \"insult\" by the Liberal Democrats \"to the true heroes of the Covid pandemic: the teachers and doctors, nurses and key workers who put their lives on the line to keep crucial public services going\".Johnson now concedes that the lockdowns and social-distancing rules \"probably went too far\" - and there could have been a way to make children exempt.These are all points that Baroness Heather Hallett, chairman of the inquiry, will be paying particular attention to when it comes to her final report, and the question of what could be done differently if it were ever to happen again.In the inquiry room itself, no technology is allowed, no mobile phones or laptops, and so many of the journalists were in the press room upstairs watching the live feed.Tuesday was busier than it has been over the last few weeks, and downstairs the public gallery was full. There was a reminder before proceedings began that hecklers were not allowed - a nod to the previous time Boris Johnson appeared, when protesters had to be escorted out of the building.Campaigners from various groups, including Long Covid Kids and Clinically Vulnerable Families have been a noticeable presence outside the front door - trying to get their voices heard with placards and banners.Boris Johnson is used to speaking to large crowds and at formal events like this, but at the end of the inquiry, when Baroness Hallett turned to thank him for his evidence, he was already trying to get out of his seat - clearly keen to finish up for the day.He will likely be pleased not to be coming back.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boris Johnson left Covid Inquiry in a hurry - he won't want to come back",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3acb/live/15386a90-ae9e-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T16:49:01.000Z",
      "dateModified": "2025-10-21T16:49:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cerys Lupton-Jones: Hospital neglect contributed to vulnerable woman's death, coroner says",
    "url": "https://www.bbc.com/news/articles/cz91e1e23wzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32c4/live/7b6b5340-ae85-11f0-9f03-7d57b11fd2eb.jpg",
    "tag": "Trending",
    "date": "2025-10-21T18:41:17.000Z",
    "description": "Staff skipped checks and said a vulnerable young woman was safe. Days later, she was dead2 hours agoAlison HoltSocial affairs editor andJames MelleySe",
    "body": "Staff skipped checks and said a vulnerable young woman was safe. Days later, she was dead2 hours agoAlison HoltSocial affairs editor andJames MelleySenior social affairs producerFamily handoutCerys Lupton-Jones died in May 2022Warning: The following article contains details about suicide which some may find distressingCerys Lupton-Jones pauses between two doorways.One door leads into a side room in the Manchester mental health unit where she's a patient. The other leads into a toilet.The 22-year-old had tried to end her life just 20 minutes earlier - but no staff are seen on the CCTV footage from inside the unit.She hesitates for about 30 seconds, walking backwards and forwards. Then she enters the toilet and shuts the door.The next time she is seen on the footage, doctors and nurses are fighting to resuscitate her.Cerys dies five days later, on 18 May 2022.A coroner has concluded that some of the care Cerys was given at Park House, which was run by the Greater Manchester Mental Health NHS Foundation Trust, was a \"shambles\".Staff were meant to be checking on her every 15 minutes.But the last recorded observation - at 15:00 - had been falsified, saying she had been seen in a corridor. CCTV shows at that point, Cerys was already in the toilet where she would fatally harm herself.A staff member who was supposed to be looking after her has now admitted to falsifying these records.Zak Golombeck, coroner for Manchester, said that if someone had stayed with her after the earlier attempt to take her life, what followed may never have happened. He said neglect was likely to have contributed to her death.Campaigners are calling for an inquiry into the number of deaths at the mental health trust and believe the services are in crisis.Greater Manchester Mental Health Trust said it \"failed her that day, and we are so very sorry that we did not do more\".Family handoutCerys was a patient at Park House, which was run by the Greater Manchester Mental Health NHS Foundation TrustCerys's parents, Rebecca Lupton and Dave Jones, describe their daughter as a loving young woman who would do anything for her friends. She was studying to be a nurse and was months away from completing her degree, with a job lined up.She was autistic and had also struggled with her mental health since her teens.Her family, who lived miles away in Sussex, say the pandemic and the reduction in community mental health support exacerbated Cerys's problems.The inquest was told Cerys had tried to take her life in the days running up to her death, spending time in A&E.She was then readmitted to Park House and put on one-to-one observations for a short time. Later, she was supposed to be checked by staff every 15 minutes.The inquest heard how, at about 14:35 on 13 May 2022, Cerys was found in a toilet by Mohammed Rafiq, a health support worker who had been assigned to check on her. Cerys had tried to hang herself.Rebecca Lupton and Dave Jones describe Cerys as a loving young womanMr Rafiq and the duty nurse, Thaiba Talib, intervened.However, the inquest heard the 15-minute observations were not then increased and staff had no proper conversation with her.The nurse told the inquest she did not believe Cerys meant to seriously harm herself.She told the coroner she chose not to increase observations on Cerys because she did not want her to feel punished, as she did not like being under observation.When asked by the coroner if she should have gone with Cerys to her room after the incident and check she was safe, Ms Talib answered: \"In hindsight, yes.\"Damning CCTV from inside the unit was described minute by minute in court.It showed Cerys going into the ward garden at 14:42. The observation record, which says at 14:45 she was in her bedspace, was described by the coroner as \"not accurate\".At 14:54, Cerys walked into another toilet on the ward and closed the door.Yet Mr Rafiq told the coroner he remembered seeing Cerys at 14:57. He wrote in the observation notes that he had seen her at 15:00 \"along the corridor, looking flat-faced\". He then went on a break. In reality, Cerys was still in the toilet.The coroner told Mr Rafiq that his recollections were wrong, and that he had \"falsified\" the observation records. Mr Rafiq responded: \"I'm afraid so\".Mr Rafiq said other staff had shown him how to record observations every 15 minutes, even if he hadn't done them at that time. \"That's how they did it and that's how I did it\", he told the court.A new support worker took over the observations at 15:00. There was no verbal handover and, according to Mr Rafiq's notes, Cerys had just been seen.The CCTV shows the new support worker checking on other patients. At 15:15 she looked for Cerys.She could be seen becoming increasingly desperate as she searched the communal areas and ran along the corridor.At 15:19, she tried the door to the toilet, using a master key to unlock it. She found Cerys inside and immediately raised the alarm.By that point, 25 minutes had passed since Cerys went into the toilet. She died in hospital on 18 May, five days later.The coroner said there was a gross failure by Ms Talib to provide \"basic medical attention to a person in a dependent position\".He also found there was a culture of falsifying records on the ward.The coroner said it was not clear what Cerys's intention had been. In a narrative conclusion, he recorded that neglect had contributed to her death.\"Cerys was a wonderful, wonderful young person\", her mother Rebecca Lupton said\"I knew it was bad,\" Cerys's mother Rebecca told the BBC, \"but listening to the evidence highlighted quite how poor the care was.\"Her father, Dave, says when Cerys was sectioned and taken to the hospital at the start of 2022, they believed it would keep her safe and help her get better. \"In fact, it just made everything worse,\" he says. \"It was the wrong environment.\"\"Cerys was a wonderful, wonderful young person. We feel that she would be here today if she'd been given better care by Manchester Mental Health Trust,\" Rebecca said outside court, after the coroner gave his conclusion.Dave described the disbelief and anger as difficult to put into words. \"We need more funding for mental health services, more staff, better training and much better oversight.\"Immy Swithern was a patient at the same time as Cerys. They became close friends. She says they tried to make the best out of a bad situation and would talk all day.She also claims some staff regularly failed to carry out 15-minute safety checks, so they tried to look out for each other.\"I was there to get better, and I was there to have help with that,\" she says. \"Instead, I was constantly checking on people. On that ward, I think that is the most scared I've ever felt in my life.\"Park House mental health unit has since closed. It was replaced by a new £105.9m hospital in November 2024.The NHS trust said it had \"significantly improved\" its provision of care and it was grateful to the coroner for \"acknowledging the work that has been done to prevent something of this nature from happening again\".But campaigners claim mental health services in Manchester are in crisis.Responding to Tuesday's inquest verdict, the Communities for Holistic, Accessible and Rights-based Mental Health (CHARM) group, says: \"It is devastating to hear of yet another young person losing their life as a result of neglect and poor care.\"The group says it is due to meet Mayor of Greater Manchester Andy Burnham this week to call for a statutory inquiry into the deaths and the financial crisis in the city's mental health services.In October 2022, five months after Cerys death, an undercover BBC panorama programme exposed bullying and the mistreatment of patients at the medium secure Edenfield centre, which was also run by GMMH.As a result, an independent review was commissioned by the NHS and published in 2024.It found a \"closed culture\" at GMMH. It also raised concerns about the number of deaths by ligature.In 2022, 19 people took their own lives by hanging on mental health units in the UK, five were GMMH patients, the trust itself said that meant it had 26% of all such deaths in the whole country.If you are suffering distress or despair, details of help and support in the UK are available at BBC Action Line.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cerys Lupton-Jones: Hospital neglect contributed to vulnerable woman's death, coroner says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32c4/live/7b6b5340-ae85-11f0-9f03-7d57b11fd2eb.jpg"
      ],
      "datePublished": "2025-10-21T18:41:17.000Z",
      "dateModified": "2025-10-21T18:41:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "University fees rise and new V-levels: Your questions answered",
    "url": "https://www.bbc.com/news/articles/crred9ljqz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eaa3/live/d80a9160-ae85-11f0-b0ec-2949909959e5.jpg",
    "tag": "Trending",
    "date": "2025-10-21T17:00:26.000Z",
    "description": "Will my uni fees rise next year? What is a V-level? Your questions answered3 hours agoHayley ClarkeEducation reporterGetty ImagesWhat questions do you",
    "body": "Will my uni fees rise next year? What is a V-level? Your questions answered3 hours agoHayley ClarkeEducation reporterGetty ImagesWhat questions do you have about university tuition fees and V-levels? The government has published its new white paper, and there's big news in it for students going to university or college.We now know both tuition fees and maintenance loans for university students will increase with inflation every year from 2026.And for students finishing their GCSEs, new courses called V-levels will be introduced alongside A-levels and T-levels.Lots of you have sent in questions about how it's all going to work. We answer them below.I start uni next year - will my fees rise?We had this question via Your Voice Your BBC News.The answer is yes. Tuition fees will rise from 2026 onwards, so we expect that those starting university in 2026 will have higher fees.The exact amount students will be charged is unknown at the moment - as it depends on what the rate of inflation is.The inflation measure used - the Retail Price Index minus mortgage payments, or RPIx - is likely to be the one used for next year's and future increases.If it was done at the current rate, fees would rise by approximately £400 a year, to over £9,900.Will this mean pay rises for university staff?This is unclear and the situation is different for each university - though lots of them have experienced financial difficulties of some kind in recent years.A professor from Coventry University who spoke to BBC News on Monday said it was a \"good thing\" that tuition fees were rising, but that \"under no circumstances will it solve the problem\" around university finances.And the University and College Union has a lot to say on this too. General secretary Jo Grady accuses Labour of having \"doubled down on the disastrous tuition-fees funding model, which created the crisis the sector is currently facing\".She says the union wants to see \"proper public funding\" for higher education, and a resolution to the current dispute over \"low pay, vicious job cuts and poor working conditions, and the impact this has on students' learning experience\".But Universities UK, which represents 141 universities, says it offers \"a much-needed reset for our university system\".Chief executive Vivienne Stern says raising fees in line with inflation will \"help to halt the long-term erosion of universities' financial sustainability, following a decade of fee freezes\".Uni students on tuition fee rises - 'Oh, no, no, no, no!'What about students from lower income backgrounds, or those who are the first in their family to go to university?This is another question that came in through Your Voice Your BBC News.You do not have to start repaying your loan until you earn a certain amount of money after graduation. You generally repay 9% of the amount you earn above this threshold.Maintenance loans will also rise with inflation.One student told the BBC News social team: \"As someone who gets the maximum maintenance loan, it just means that as someone who comes from a poorer background, I will have more debt to pay off than someone who comes from a middle-class background who has more parental support.\"The government recently announced that maintenance grants will return for some students from lower-income households by 2029.The grants will apply to \"tens of thousands\" of students, targeted at those \"studying priority courses that support the industrial strategy and the Labour government's wider mission to renew Britain,\" Education Secretary Bridget Phillipson said.The government said the new grants would be funded by a tax on international student fees, which will only apply to higher education providers in England.The longer-term impact on how higher fees will impact those from lower-income families will be something education experts will be keeping a close eye on.The government says it wants two-thirds of young people to go to university or study a technical qualification after leaving school.What about the cap on fees for underperforming universities?Bridget Phillipson said on Monday that \"charging full fees will be conditional on high quality teaching\".Those universities who do not do so will not be able to charge maximum fees.She added that it is a \"challenge to our universities\" to \"drive out low quality provision\".One person asked Your Voice Your BBC News if this could result in students from working class backgrounds attending these institutions in an attempt to save money, creating a \"two-tier system based on who can afford the higher fees\".There is still a lot of uncertainty around exactly how the performance of universities will be assessed, and how much those who underperform will be able to charge.What the impact on students will be is yet to be seen.What about V-levels? Why are they being introduced?Getty ImagesV-levels will replace qualifications like BTecs and will sit alongside T-Levels and A-Levels When will V-levels arrive?Another question from socials now.We're not completely sure when the rollout will be, but the government says that V-levels will be introduced from 2027. There will be a consultation on what the courses should look like with experts and stakeholders before rolling them out, the government says.What does this mean for BTecs and their credibility?We've had this question on our TikTok, from a student worried about hers.Qualifications you already have, or are currently studying will still be worth the same - even once the new V-levels come in. So try not to worry about that.When announcing the changes, Bridget Phillipson said vocational education was the \"backbone\" of the country's economy, and central to breaking the link between background and success, helping hundreds of thousands of young people get the skills they need to get good jobs.\"But for too long it has been an afterthought,\" she said.She thinks the new V-levels will help to change that.What if I'm currently doing a BTec?Lots of current BTec students have asked us this on TikTok too.V-levels won't be introduced until 2027, the government says, and we currently don't know what subjects they will be in.Pearson - the exam board that delivers BTecs - says it will continue to deliver all its current vocational qualifications, while it joins the consultation with the Department for Education and Ofqual as part of the creation of the new courses.Subjects will be linked to the world of work and may include sectors like engineering, agriculture, digital and creative sectors, the government says.The Sixth Form Colleges Association has warned that V-levels may not fill the gap left by BTecs, and has said that the government's priority should be to make sure that schools and colleges can still enroll students on BTecs until the new V-levels are up and running.And it's worth remembering that V-levels will be Level 3 courses - the same as A-levels or T-levels - so they shouldn't impact Level 2 BTecs, which are taken with GCSEs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "University fees rise and new V-levels: Your questions answered",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eaa3/live/d80a9160-ae85-11f0-b0ec-2949909959e5.jpg"
      ],
      "datePublished": "2025-10-21T17:00:26.000Z",
      "dateModified": "2025-10-21T17:00:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aston Villa warn fans over political messaging at Maccabi Tel Aviv match",
    "url": "https://www.bbc.com/sport/football/articles/ce86vy4dvdmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e51/live/6489e580-ae79-11f0-98ab-6747e2555fbd.jpg",
    "tag": "Trending",
    "date": "2025-10-21T14:11:45.000Z",
    "description": "Aston Villa have warned fans against breaking Uefa rules relating to \"the displaying of political symbols, messages or flags\" during next month's Euro",
    "body": "Aston Villa have warned fans against breaking Uefa rules relating to \"the displaying of political symbols, messages or flags\" during next month's Europa League match against Maccabi Tel Aviv.In ticketing guidance announced on Tuesday, the Premier League club said doing so was \"strictly prohibited and will result in immediate ejection and the issuing of a stadium ban\".It comes after Maccabi said they would decline any ticket allocation from Villa over safety concerns, despite the UK government saying it was working to have a controversial ban on the Israeli club's fans reversed.The Israeli embassy in the UK said it is \"deeply concerned by the hostility and incitement\" that led to Maccabi withdrawing their away ticket allocation.It added: \"It is regrettable that extremists have turned football, a sport meant to unite, into a platform for intimidation, driving Jewish and Israeli fans away from UK stadiums.\"Last week, Birmingham's safety advisory group (SAG) - the body responsible for issuing safety certificates for matches - informed Villa no travelling fans would be permitted at the match on 6 November after local police deemed the fixture \"high risk\".The decision was widely condemned, with the government saying it would fund any necessary policing operation to allow Maccabi's fans to attend.The Israeli embassy said it \"condemns all attempts to exclude Israeli teams or Jewish fans and expects UK authorities to ensure their safety and full participation in public life\".Villa have now announced their ticketing policy for the match, insisting that only supporters with a purchase history prior to this season will be able to access a ticket.The club also said they will not be selling tickets in what will be a vacant away end, and warned against supporters reselling their tickets.Last week it emerged Villa previously told their matchday stewards they did not have to work at the fixture, saying they understood that some \"may have concerns\".In September, pro-Palestinian protests took place at a stadium in Thessaloniki, Greece, when Maccabi played a Europa League match against PAOK, with heavy security accompanying the Israeli team's travelling support.On Thursday, West Midlands Police said it had classified the fixture as \"high risk\" based on intelligence and previous incidents, including \"violent clashes and hate crime offences that occurred during the 2024 Europa League match between Ajax and Maccabi Tel Aviv in Amsterdam\".Prime Minister Sir Keir Starmer was one of many politicians who condemned the move, and called for the ban to be overturned.However, the UK Football Policing Unit said it was \"important that we respect and support the structures in place for making these decisions\", while the Fare Network, which reports on discrimination for Uefa, told the Press Association it was \"reluctant to question\" the police risk assessment.On Monday, Culture Secretary Lisa Nandy said the ban was \"wrong\" and had come \"against the backdrop of rising antisemitism here and across the world\", adding that the SAG would review the decision if West Midlands Police changed its risk assessment.But a few hours later Maccabi said they would decline any ticket allocation, claiming \"a toxic atmosphere has been created which makes the safety of our fans wishing to attend very much in doubt\".The club also insisted that the abandonment of the derby against Hapoel Tel Aviv on Sunday, over what the police called \"public disorder and violent riots\", was not down to their supporters.\"We have also been working tirelessly to stamp out racism within the more extreme elements of our fanbase,\" added a Maccabi statement.\"Unfortunately, those issues are not restricted to Israeli football and are problems the sport has been grappling worldwide, including in the UK. \"It is clear, that various entrenched groups seek to malign the Maccabi Tel Aviv fanbase...and are exploiting isolated incidents for their own social and political ends.\"A UK government spokesperson said it was \"deeply saddened\", adding it was \"completely unacceptable\" that the match has been \"weaponised to stoke violence and fear by those who seek to divide us\".Independent MP Ayoub Khan, whose Birmingham Perry Barr constituency is home to Villa Park, has said Maccabi fans should be excluded for hooliganism - adding on social media that Sir Keir owed an apology to West Midlands Police.He added that by declining tickets, the Israeli club \"have been more responsible than those that have sought to conflate this matter\".Aston Villa's warning is proof that even with Maccabi declining any tickets, the stakes remain high before one of the most highly politicised matches English football will have seen.There will still be intense scrutiny on the local authorities' handling of the club's visit to Villa Park, in a year where protests have regularly accompanied sports events involving Israeli teams.Over recent days, local safety officials in Birmingham had come under mounting pressure to reverse their hugely controversial decision to ban the away fans.Maccabi's surprise move has taken the decision out of their hands, removing the need for any U-turn later this week and avoiding the potential for an escalating dispute with the government. But there will now be questions over what intelligence the ban of Maccabi's fans was based on, and whether the controversy could have been avoided.For those reluctant to question West Midlands Police's original assessment that the fixture was \"high risk\", this development may well come as a major relief.But others will see it as highly regrettable, and embarrassing to the UK, that Maccabi do not feel it is safe enough for their fans to attend the match, and that it sets a worrying precedent.And there may also be questions over Birmingham's hosting of future international sports events, including the 2026 European Athletics Championships and Euro 2028.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aston Villa warn fans over political messaging at Maccabi Tel Aviv match",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e51/live/6489e580-ae79-11f0-98ab-6747e2555fbd.jpg"
      ],
      "datePublished": "2025-10-21T14:11:45.000Z",
      "dateModified": "2025-10-21T14:11:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - The Louvre daytime heist that shocked the world - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct71cl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0m9t91w.jpg",
    "tag": "Trending",
    "date": "2025-10-21T09:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·21 Oct 2025,·26 minsAvailable for over a yearThe Louvre Museum in Paris was closed for 2 days as the police investigated a brazen heist which resulted in the theft of France's “priceless” crown jewels. Thieves wielding power tools broke into the world's most visited museum in broad daylight, before escaping on scooters with eight items of jewelry of great historical significance.\nErin Thompson, Professor of Art Crime at The City University of New York, tells us about the crime that has stunned France - and the rest of the world. \nProducers: Viv Jones, Aron Keller, Valerio Esposito and Cat Farnsworth \nExecutive producer: Annie Brown\nMix: Travis Evans\nSenior news editor: China Collins\nImage: A security employee near the glass Pyramid of the Louvre Museum, Paris. Benoît Tessier/ReutersProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - The Louvre daytime heist that shocked the world - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0m9t91w.jpg"
      ],
      "datePublished": "2025-10-21T09:00:00.000Z",
      "dateModified": "2025-10-21T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]