[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt27hj?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:05:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search Sounds              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu   BBC SoundsSounds home pageHomeMusicPodcastsMy SoundsUse BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·09 Jan 2026,·24 minsThe President’s Path: After Venezuela, what next for Trump?The ExplanationAvailable for over a yearTrump's actions in Venezuela and the removal of Nicolás Maduro sparks talk of further US operations in the region. In this episode Caitríona Perry, Sumi Somaskanda and Bernd Debusmann look at the US operation that seized the President of Venezuela.\nEvery weekend, The President’s Path explores the state of US politics in Washington and beyond. We dig into the key issues shaping America and uncover what is on the minds of those closest to power. You can contact us at: path@bbc.co.uk\nSenior Producer: Oksana Kundirenko \nExecutive Producer: Anna HolfordProgramme WebsiteMore episodesCymraegGaeilgeGàidhligBBC Sounds HelpContacts, Privacy and InformationHelp with Signing InNewsletter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg"
      ],
      "datePublished": "2026-01-09T13:05:00.000Z",
      "dateModified": "2026-01-09T13:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt4qyc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-09T16:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Jan 2026,·37 minsThe Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran?NewscastAvailable for over a yearToday marks the thirteenth consecutive day of widespread anti-government protests in Iran.\nIran's top security body has warned that the Iranian judiciary and security forces will show \"no leniency towards saboteurs\", amid internet blackouts.\nAdam is joined in the Newscast studio by BBC chief international correspondent, Lyse Doucet, to discuss the context and history of the unrest in Iran, plus President Trump’s warnings to Ayatollah Ali Khamenei and his response. \nAlso in the studio is New Statesman political editor Ailbhe Rea and The House Mag deputy editor Sienna Rodgers, to wrap up the first calendar week of UK Politics.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Chloe Scannapieco and Jem Westgate. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-09T16:41:00.000Z",
      "dateModified": "2026-01-09T16:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Storm Goretti: Snow, rain and wind warnings still in place across UK",
    "url": "https://www.bbc.com/news/articles/c5yvp0zg1deo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6834/live/21c492d0-ee3a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-10T21:08:14.000Z",
    "description": "Warnings for snow, ice, rain and wind are in place across parts of the UK for the remainder of the weekend following Storm Goretti. The Met Office war",
    "body": "Warnings for snow, ice, rain and wind are in place across parts of the UK for the remainder of the weekend following Storm Goretti. The Met Office warnings for Northern Ireland, Scotland, the north and Midlands of England come as forecasters say the challenging conditions are expected to ease by the start of next week with milder weather.A yellow warning for snow and ice in Scotland has been upgraded to amber. It starts at 03:00 on Sunday and lasts until 14:00 on Monday, affecting those in central and north-eastern parts of the country. Meanwhile, the National Grid said it was working to resolve power outages which have continued to affect more than 20,000 properties in parts of England and Wales. The new amber warning in Scotland warns of the potential impact on both road and rail networks.The Met Office said power cuts were likely and other services, such as mobile phone coverage, could also be affected.Scottish Transport Secretary Fiona Hyslop told people in affected areas to consider delaying journeys and working from home where possible.She added: \"The conditions will inevitably impact the transport network, so it is vital that people and communities continue to plan ahead to ensure they stay safe\". Storm Goretti brought heavy snow, ice and strong winds to most parts of the UK this past week.On Thursday, the day the storm arrived, the Met Office issued a rare red warning for wind in Cornwall and the Isles of Scilly.Wind speeds of up to 99mph (159km/h) were later recorded in the region.Police have since said a man was killed in the Mawgan area of Helston after a tree fell onto his caravan. Cornwall Council said the storm had been \"one of the most severe\" the county had experienced \"in living memory\", with crews working around the clock to clear fallen trees and carry out emergency repairs.Meanwhile, areas across the country have struggled with power outages.On Saturday, the National Grid said more than 20,000 properties were still without electricity - with the south-west of England continuing to face the most outages.Approximately 19,000 premises were still without electricity in the South West, with hundreds more affected in the East Midlands, the West Midlands and Wales. The National Grid said it was working \"tirelessly\" and had restored power to almost 170,000 properties.Hundreds of schools across the UK were also forced to close ahead of the weekend as heavy snow caused travel disruption. The Met Office said the UK \"will be saying goodbye to the really cold weather\" next week, with temperatures of between 9C and 11C expected in the south and about 6-8C elsewhere.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Storm Goretti: Snow, rain and wind warnings still in place across UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6834/live/21c492d0-ee3a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-10T21:08:14.000Z",
      "dateModified": "2026-01-10T21:08:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protester climbs on to balcony of Iranian embassy in London",
    "url": "https://www.bbc.com/news/articles/cy09yvd57x2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/572d/live/5a3ebe10-ee49-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T20:00:17.000Z",
    "description": "5 hours agoFiona NimoniBBCA protester has climbed on to the balcony of the Iranian embassy in west London as hundreds gathered outside the building, w",
    "body": "5 hours agoFiona NimoniBBCA protester has climbed on to the balcony of the Iranian embassy in west London as hundreds gathered outside the building, waving flags and shouting anti-government slogans.The Metropolitan Police said two arrests had been made at the protest and that officers were also seeking another individual for trespass.Anti-government protests erupted in Iran on 28 December, with two human rights groups reporting that at least 50 protesters have been killed.Protesters demonstrating against the Iranian regime have been gathering outside embassies across the world. Earlier on Saturday, the Met said additional officers had been deployed to the protest \"to prevent any disorder\". Confirming the arrest of two individuals on Saturday evening - one for aggravated trespass and assault on an emergency worker and one for aggravated trespass - police said the protest was continuing but being \"safely policed\". \"We saw no serious disorder and officers will remain in the area to ensure the continued security of the Embassy,\" a statement said. Footage on Saturday showed a man standing on the London embassy's balcony and tearing down the Iranian flag. The embassy later posted a picture on its X account of the flag back in place.Others at the protest in Kensington held up pictures of Reza Pahlavi, the exiled son of Iran's last shah (king) Mohammad Reza Shah Pahlavi, who was ousted in 1979 when the revolution swept away Iran's monarchy.Many demonstrators in Iran have been calling for Reza Pahlavi's return.In a joint statement released last week, UK Prime Minister Sir Keir Starmer, along with the leaders of Germany and France, said they were \"deeply concerned about reports of violence by Iranian security forces, and strongly condemn the killing of protesters\".\"The Iranian authorities have the responsibility to protect their own population and must allow for the freedom of expression and peaceful assembly without fear of reprisal,\" French President Emmanuel Macron, German Chancellor Friedrich Merz and Starmer said. The protests, which have now entered their 13th day, erupted over the economy and have grown into the largest in years - leading to calls for an end to the Islamic Republic and some urging the restoration of the monarchy.Iran's Supreme Leader Ayatollah Ali Khamenei has called anti-government protesters \"troublemakers\" and accused them of trying \"to please the president of the US\".An internet blackout is currently in place across the Middle Eastern country. The BBC is unable to report from inside Iran, so social media is often relied upon to verify what is happening on the ground, in addition to speaking to people in Iran.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protester climbs on to balcony of Iranian embassy in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/572d/live/5a3ebe10-ee49-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T20:00:17.000Z",
      "dateModified": "2026-01-10T20:00:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Love Island: All Stars villa evacuated over wildfires",
    "url": "https://www.bbc.com/news/articles/cy09yp2wl5wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/462b/live/f5e71750-ee5c-11f0-be42-69538bed316c.png",
    "tag": "Trending",
    "date": "2026-01-10T21:04:47.000Z",
    "description": "Filming for Love Island: All Stars has been postponed after the villa was evacuated due to wildfires, ITV has said. The third series of the popular da",
    "body": "Filming for Love Island: All Stars has been postponed after the villa was evacuated due to wildfires, ITV has said. The third series of the popular dating programme spin-off - filmed in South Africa - was due to premiere on Monday. But a statement posted on the show's Instagram page said: \"Health and safety is our greatest priority and will always come first, and therefore the transmission of Love Island: All Stars will be delayed until a date to be confirmed.\"ITV has given no further details on when it hopes to resume filming.State broadcaster SABC reported on Saturday that authorities were working with the South African Air Force to control several fire-related incidents in the Western Cape, where the villa is located. Love Island: All Stars follows the same format as the original ITV programme, but with former contestants returning to the villa in a bid to find their match. Hosted by Maya Jama, this year's initial line-up is formed of 12 contestants including two former winners - Jess Harding, 25, and Millie Court, 29. The son of Irish singer Ronan Keating, 26-year-old Jack Keating, is also part of this series' cast.Other contestants expected to appear are Belle Hassan, 27; Charlie Frederick, 31; Ciaran Davies, 23; Helena Ford, 29; Leanne Amaning, 28; Sean Stone, 26; Shaq Muhammad, 27; Tommy Bradley, 22; and Whitney Adebayo, 28.At the height of series 12 of the regular format last summer, which saw 2.6m people tune in to watch the first episode, ITV said streams on subscription service ITVX were up 9% year on year.However, viewers went on to make more than 14,000 complaints alleging bullying, abusive behaviour and misogyny - particularly in relation to a divide between some of the women in the ITV villa.Media watchdog Ofcom said it would not investigate the series because the negative behaviour \"was not shown in a positive light\", and was in line with what viewers have come to expect.In response, ITV said participants get training in advance about \"mutually respectful behaviour in relationships\" and \"behaviour patterns associated with controlling and coercive behaviour\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Love Island: All Stars villa evacuated over wildfires",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/462b/live/f5e71750-ee5c-11f0-be42-69538bed316c.png"
      ],
      "datePublished": "2026-01-10T21:04:47.000Z",
      "dateModified": "2026-01-10T21:04:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military strikes Islamic State group targets in Syria, officials say",
    "url": "https://www.bbc.com/news/articles/cly9597r4qpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7d72/live/396e5270-ee6e-11f0-bf3e-abb5d510e05c.png",
    "tag": "Trending",
    "date": "2026-01-10T22:21:36.000Z",
    "description": "The US and its partner forces have carried out large-scale strikes against Islamic State (IS) group targets in Syria, the US Central Command (Centcom)",
    "body": "The US and its partner forces have carried out large-scale strikes against Islamic State (IS) group targets in Syria, the US Central Command (Centcom) has announced. US President Donald Trump directed the strikes on Saturday, which are part of Operation Hawkeye Strike, in retaliation to the IS group's deadly attack on US forces in Syria on 13 December, Centcom wrote on X.The strikes were conducted in an effort to combat terrorism and protect US and partner forces in the region, according to Centcom. \"Our message remains strong: if you harm our warfighters, we will find you and kill you anywhere in the world, no matter how hard you try to evade justice,\" Centcom said. The US and its partner forces fired more than 90 precision munitions at more than 35 targets in an operation that involved more than 20 aircraft, an official told CBS News, the BBC's US partner.The official added that aircraft including F-15Es, A-10s, AC-130Js, MQ-9s and Jordanian F-16s had taken part in the strikes. The location of the strikes and the extent of any casualties is not yet clear.\"We will never forget, and never relent,\" Defence Secretary Pete Hegseth wrote on X on Saturday in reference to the military action.  The Trump administration first announced Operation Hawkeye Strike in December after an IS gunman killed two US soldiers and a US civilian interpreter in an ambush in Palmyra, located in the centre of Syria.\"This is not the beginning of a war - it is a declaration of vengeance,\" Hegseth said when announcing the operation in December. \"The United States of America, under President Trump's leadership, will never hesitate and never relent to defend our people.\"Prior to the latest strikes on Saturday, US forces killed or captured nearly 25 IS group members in 11 missions between 20 December and 29 December as part of Operation Hawkeye Strike, Centcom said. In the operation's first mission on 19 December, US and Jordanian forces carried out a \"massive strike\" against the IS group, deploying fighter jets, attack helicopters and artillery to strike \"more than 70 targets at multiple locations across central Syria\", according to Centcom. That operation, it said, \"employed more than 100 precision munitions\" targeting known IS infrastructure and weapons sites.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military strikes Islamic State group targets in Syria, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7d72/live/396e5270-ee6e-11f0-bf3e-abb5d510e05c.png"
      ],
      "datePublished": "2026-01-10T22:21:36.000Z",
      "dateModified": "2026-01-10T22:21:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
    "url": "https://www.bbc.com/news/articles/cly95lpwl1ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2680/live/f3173f30-ee40-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T16:06:41.000Z",
    "description": "A rare copy of the 1938 comic that introduced Superman to the world has sold to an anonymous collector for $15m (£11.2m).The private sale of the Actio",
    "body": "A rare copy of the 1938 comic that introduced Superman to the world has sold to an anonymous collector for $15m (£11.2m).The private sale of the Action Comics No 1 copy - once stolen from actor Nicolas Cage's home and returned to him over a decade later - was announced on Friday.The previous record for the sale of a comic book was set in November, when a pristine Superman No 1 fetched $9.12m at auction. Both sales far exceed the original 10-cent price tags - or around $2.25 in today's money.Superman's debut is one of several tales anthologised in Action Comics No 1, which is widely credited with having defined the superhero genre as we now know it. Fewer than 100 copies are thought to exist.Friday's Action Comics sale was negotiated by New York-based Metropolis Collectibles/Comic Connect, which said both the comic book's owner and the buyer wished to remain anonymous.The broker said the copy had been graded nine out of a possible 10 points by the Certified Guaranty Company, which specialises in authenticating collectables - making it the joint-highest scoring copy of the comic to date.The broker said its value was further inflated by its storied association with Hollywood star CageThe Con Air and National Treasure star purchased this particular copy in 1996 for $150,000 - a record at the time.But the comic was stolen during a party at Cage's home in 2000 and only found - inside a storage unit in California - in 2011.\"During that 11-year period, it skyrocketed in value. The thief made Nicolas Cage a lot of money by stealing it,\" said Metropolis/ComicConnect CEO Stephen Fishler.Cage was reunited with the copy and, six months later, sold it at auction for $2.2m.Fishler compared the comic's history to the brazen theft of Leonardo Da Vinci's Mona Lisa from the Louvre museum in Paris in 1911, which transformed the then little-known work to the world's most famous painting.\"The recovery of the painting made the Mona Lisa go from being just a great Da Vinci painting to a world icon - and that's what Action No 1 is. An icon of American pop culture.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2680/live/f3173f30-ee40-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T16:06:41.000Z",
      "dateModified": "2026-01-10T16:06:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arrests as emergency responders are hurt in South Benfleet crash",
    "url": "https://www.bbc.com/news/articles/cj0nz9eldnzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg",
    "tag": "Trending",
    "date": "2026-01-10T17:38:16.000Z",
    "description": "Three men have been arrested after paramedics and off-duty police were struck while attending the scene of a crash in Essex.The emergency services wer",
    "body": "Three men have been arrested after paramedics and off-duty police were struck while attending the scene of a crash in Essex.The emergency services were initially called after a single-vehicle collision involving a white Nissan X-Trail on the A130 in South Benfleet at about 00:15 GMT. While at the scene, five emergency responders were struck in a second crash involving a white Ford Transit van. Two of them - a paramedic and a police officer - remain in a serious condition in hospital.An investigation has been launched, with police appealing for witnesses or anyone with dashcam footage to come forward.Those being questioned by police are:A 23-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle and driving while unfit through drink or drugsA 29-year-old man, from Westcliff, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle, possession of a Class B or Class C drug, and being in charge of a vehicle while unfit through drink or drugsA 39-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving and driving while unfit through drink or drugs.Essex Police said the paramedic and police officer suffered serious injuries.It said the crashes happened on the southbound carriageway of the A130, between the Rayleigh Spur and Sadlers Farm roundabouts.Officers closed the A130 between Sadlers Farm and the A1245 Bonville's Roundabout leading to the A13, while it carried out an investigation. The roads have since been reopened.Ch Supt Morgan Cronin said: \"The thoughts of everyone at Essex Police are with the emergency workers injured while responding to this incident – both they and their families are being provided with support from the force.\"Policing minister Sarah Jones said her thoughts were with the officers, their families, colleagues and witnesses to the incident.\"I hope they make full recoveries and inquiries quickly determine the cause,\" she added in a post on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arrests as emergency responders are hurt in South Benfleet crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg"
      ],
      "datePublished": "2026-01-10T17:38:16.000Z",
      "dateModified": "2026-01-10T17:38:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlotte Church says she would be dead without dad's help ",
    "url": "https://www.bbc.com/news/articles/c0er41yjyyno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg",
    "tag": "Trending",
    "date": "2026-01-06T18:05:59.000Z",
    "description": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Churc",
    "body": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Church has said she \"would be dead\" without the influence of her father, after growing up in the spotlight.The Cardiff-born singer opened up on her close relationship with her father, James Church, in public speaking coach Deborah Thomas's podcast, These Three Things. Church, 39, credited her dad with helping her navigate the \"child star route\", adding: \"It's so arduous and there are so many temptations along the way, and so it would have been so easy for me to have fallen into addiction...\" In the interview, the star said she had a \"lot going on\" and that her father, who has a terminal diagnosis of rare blood disorder amyloidosis, was currently in hospital. During the podcast, which asks guests to share a special person, place and possession which has shaped them, Church said her father was an \"absolutely extraordinary human\" who had been through \"so much\", including battling septicaemia seven times. Describing the start of her career as a child touring with mother Maria, she said: \"We really missed him on the road. My family aren't very traditional in any way at all, and so my father was far more sort of like the nurturing one.\"The singer, who recently appeared on Celebrity Traitors, was just 11 years old when she rose to global fame and earned the moniker the Voice of an Angel.Church said her father joined them on the road after a year and would help take care of her while her mother dealt with the business side of her career, describing him as like \"the hearth\". \"He was sort of worldly and wise enough that he could ground me in a perspective, ground me in the transience of it all, and that it probably wouldn't be forever, and just [try] to say let's enjoy it while it's here.\" Church, who runs a wellness retreat in the Nant Caethon Valley in Powys, said it had been a \"journey\" since her father's terminal diagnosis nearly a decade ago. \"Pretty much every year in those nine years, he's had a near-death experience where it's like something's happened.\"He has really had to tolerate this rollercoaster of health and emotions and everything associated. But it's also a very long time to live with a terminal diagnosis, and so it's massively changed him.\"Speaking about her father's impact on her life, Church added: \"I'm making him a photo album, and I think that'll be very emotional for us to go through. \"But in general, I am able to tell him what he means to me, and how he has massively shaped my life and shaped who I am.\"Without him, I'd be dead.\" More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlotte Church says she would be dead without dad's help ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg"
      ],
      "datePublished": "2026-01-06T18:05:59.000Z",
      "dateModified": "2026-01-06T18:05:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shay Given 'unreservedly' apologises for Holocaust remark on Final Score",
    "url": "https://www.bbc.com/sport/football/articles/c0r459gv2l1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3443/live/213e81d0-ee59-11f0-a367-9dccbe902db1.jpg",
    "tag": "Trending",
    "date": "2026-01-10T19:34:41.000Z",
    "description": "Former Premier League goalkeeper Shay Given has \"unreservedly\" apologised for describing Wilfried Nancy's short time as Celtic manager as an \"absolute",
    "body": "Former Premier League goalkeeper Shay Given has \"unreservedly\" apologised for describing Wilfried Nancy's short time as Celtic manager as an \"absolute Holocaust\" live on BBC show Final Score.Given, 49, was asked to give his thoughts on Nancy's sacking after just 33 days and eight games in charge of the Scottish champions. The ex-Republic of Ireland international said the tenure \"was terrible from start to finish\", before using insensitive language to describe 48-year-old Nancy's first week in the role.Posting on X,, external Given said he used a word he \"didn't fully understand the meaning of, and certainly won't ever use again\".He added: \"We all have areas of ignorance in our knowledge, and I hope to use this as an opportunity to become better educated going forward. \"I am genuinely mortified and apologise unreservedly to everyone offended, and will be donating my fee from today's show to the Holocaust Educational Trust.\" Final Score presenter Jason Mohammad apologised later in the show for the \"inappropriate language\" used.Frenchman Nancy was sacked last week following Celtic's 3-1 defeat by Rangers - his sixth loss as manager in just eight games. His 33-day stint as Celtic boss was the shortest reign in the club's history.The Holocaust, carried out by Nazi Germany during World War Two, claimed the lives of an estimated six million Jews.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shay Given 'unreservedly' apologises for Holocaust remark on Final Score",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3443/live/213e81d0-ee59-11f0-a367-9dccbe902db1.jpg"
      ],
      "datePublished": "2026-01-10T19:34:41.000Z",
      "dateModified": "2026-01-10T19:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lewes influencer Faye Greenwood talks about heart transplant at 24",
    "url": "https://www.bbc.com/news/articles/cgjn0gwz8zeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c4e3/live/b5ee3c50-dc32-11f0-9509-6dc8fe227516.jpg",
    "tag": "Trending",
    "date": "2026-01-05T14:47:59.000Z",
    "description": "'I couldn't believe I had a heart attack at 24'5 days agoJacob Panonsin LewesFaye GreenwoodFaye Greenwood had the heart attack while on holiday in Par",
    "body": "'I couldn't believe I had a heart attack at 24'5 days agoJacob Panonsin LewesFaye GreenwoodFaye Greenwood had the heart attack while on holiday in ParisAn influencer who had a heart transplant aged 24 said she \"couldn't believe\" she had a heart attack so young.Faye Greenwood had the heart attack in July while on holiday in Paris with her now-fiance Ailbhe Lower, who is also an influencer known as Mr Bruv.Ms Greenwood said: \"I couldn't believe that something that serious would be happening.\"[You think:] 'That won't happen to me,' and then it did.\"The influencer, who lives in Lewes, said symptoms began when she started to have chest pains and vomited.\"I can't really remember a lot, but I just felt I was in really bad pain, something I've never felt before,\" she explained.\"A feeling of doom, like the world was closing in.\"Mr Lower said due to translation issues and people misunderstanding the symptoms of a heart attack considering his partner's age, it was six and a half hours before Ms Greenwood was admitted to hospital.Faye GreenwoodMr Lower and Ms Greenwood have been together about six yearsMs Greenwood says doctors are still unsure what caused the heart attack and that her previously diagnosed dilated cardiomyopathy was potentially not a factor.When back in the UK, Ms Greenwood was then told she may have to wait up to a year for a heart transplant, but was able to find a donor and leave hospital in just over four months.She said: \"It's just something you never really think that you're going to have to deal with.\"Mr Lower said it was a \"nice, crazy feeling\" to know his partner now had a healthy heartThe couple, who have about 1.6 million followers between them on their social media channels, were also hit with a £14,000 medical bill from the hospital in France, and a separate £40,000 bill as Ms Greenwood had to be flown back to the UK in an air ambulance.Ms Greenwood said the cost was \"really scary\" as the couple had saved up to move out of Mr Lower's mother's house six months earlier.She added: \"So we were only just getting on track with our lives and our jobs and everything, and then it just went downhill.\"'Unfair' situationThe influencer, who is known for her fashion and lifestyle content, says she is unsure what the future holds in terms of her career.\"Now it's a lot different because I have a lot of scarring and things and I don't really know how brands all react to that sort of thing,\" she explained.Mr Lower said the situation was \"unfair\".\"I drink loads of pints, eat Greggs every day, sit on my bum, and then she's having her green shakes and doing Pilates every day and she's the one who has the heart attack,\" he added.Ms Greenwood is now urging people to understand and not ignore symptoms of a heart condition, even if they are relatively young.\"If you think anything could be wrong, even a very small thing, just definitely get it checked out or push the doctors to check you out,\" she said.Mr Lower added: \"Don't just think: 'It'll be fine, it won't happen to me', because we thought that.\"More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lewes influencer Faye Greenwood talks about heart transplant at 24",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c4e3/live/b5ee3c50-dc32-11f0-9509-6dc8fe227516.jpg"
      ],
      "datePublished": "2026-01-05T14:47:59.000Z",
      "dateModified": "2026-01-05T14:47:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Family of Chimamanda Ngozi Adichie accuses hospital of negligence over son's death",
    "url": "https://www.bbc.com/news/articles/c0lx09e618yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7d5f/live/a85378d0-ee5c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-10T22:25:57.000Z",
    "description": "The family of Nigerian novelist Chimamanda Ngozi Adichie has accused a hospital of negligence over the death of her 21-month-old son.Nkanu Nnamdi died",
    "body": "The family of Nigerian novelist Chimamanda Ngozi Adichie has accused a hospital of negligence over the death of her 21-month-old son.Nkanu Nnamdi died at a hospital in Nigeria on Wednesday following a short illness, leaving the family of the acclaimed postcolonial feminist writer \"devastated\".Now, the family allege there was a litany of failures at Euracare Hospital in Lagos that led to the toddler's death, including being denied oxygen and being given too much sedation, causing a heart attack.The hospital expressed its \"deepest sympathies\" over the loss of the child but denied improper care, which it said had been in line with international standards.It added that Nkanu had arrived at the hospital \"critically ill\" and that an investigation into the death was now under way.Adichie's sister-in-law, Dr Anthea Nwandu, made a series of allegations about the hospital in an interview with Nigerian broadcaster Arise TV on Saturday.In it, she said the medical director of Euracare had told Adichie her son \"had received too much sedation\", which subsequently caused him to have a heart attack.Dr Nwandu also accused medical staff of leaving the child unattended, denying him oxygen and transporting him in a manner that was \"not according to standard practice\".She alleged Nkanu suffered a brain injury due to lack of oxygen.Similar accusations concerning Nkanu's care were made in a private message from Adichie that was leaked online. Her spokeswoman Omawumi Ogbe told the BBC that the message had originally been shared within \"a close circle of family and friends\", and \"was not for public consumption\".Ms Ogbe continued: \"While we are saddened that such a deeply personal account of grief and trauma was leaked, the details therein highlight the devastating clinical failures the family is now forced to confront.\"We hope that the substance of that message, detailing the gross medical negligence that led to this tragedy remains the central focus even as we look forward to the truth and accountability.\"Nkanu was one of twin boys Adichie shared with her husband, Dr Ivara Esege.Responding to the allegations, Euracare Hospital acknowledged the \"profound and unimaginable loss\" the family was experiencing, but said in a statement on Saturday that \"reports currently being circulated contain inaccuracies\".It said Nkanu, who was critically ill, had been referred to the hospital after receiving treatment from two paediatric centres, and that upon arrival staff \"immediately provided care in line with established clinical protocols and internationally accepted medical standards, including the administration of sedation\".It continued: \"In the course of his care, we worked collaboratively with external medical teams as recommended by his family and ensured that all necessary clinical support was provided.\"However, \"despite these concerted efforts\", the boy died less than 24 hours after arriving at the hospital, it added.A \"detailed investigation\" was under way, Euracare said, adding that it remained \"committed to engaging transparently and responsibly with all clinical and regulatory processes\".Adichie, 48, had her first child, a daughter, in 2016. Her twin boys were born using a surrogate in 2024.The award-winning US-based writer is known for works including Half of a Yellow Sun, Americanah and her 2012 Ted Talk and essay We Should All Be Feminists, which was sampled by Beyoncé on her 2013 song Flawless.Nigeria's president was among those to have expressed their condolences over the death of Nkanu.The African nation's health system has suffered of late from a severe shortage of doctors, leaving healthcare staff working long hours and doctors juggling jobs in both public and private hospitals.Responding to the allegations concerning Nkanu, Lagos state Ministry of Health spokeswoman Dr Kemi Ogunyemi said it \"places the highest value on human life and maintains zero tolerance for medical negligence or unprofessional conduct\".She confirmed the state's health watchdog had commenced a \"thorough, indepedent and transparent\" investigation into the circumstances surrounding the death.\"Any individual or institution found culpable of negligence, professional misconduct, or regulatory violations will face the full wrath of the law,\" Dr Ogunyemi said.She urged members of the public to avoid speculation over the death while the official investigation was ongoing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Family of Chimamanda Ngozi Adichie accuses hospital of negligence over son's death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7d5f/live/a85378d0-ee5c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-10T22:25:57.000Z",
      "dateModified": "2026-01-10T22:25:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bedford teen wins world record title for her Jellycat collection",
    "url": "https://www.bbc.com/news/articles/c3r1q9gjzd5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6caf/live/5b9c0b70-ea28-11f0-bee8-cb37bc70a803.jpg",
    "tag": "Trending",
    "date": "2026-01-06T06:09:20.000Z",
    "description": "5 days agoChloe BlackandLily-May Symonds,BedfordshireGuinness World RecordsA teenager from Bedford has been awarded a Guinness World Records title for",
    "body": "5 days agoChloe BlackandLily-May Symonds,BedfordshireGuinness World RecordsA teenager from Bedford has been awarded a Guinness World Records title for assembling the largest collection of Jellycat toys.Hope Roberts, 19, has 877 items in her collection, including soft toys, stickers, bags and keyrings.Guinness World Records confirmed the title in December after a detailed verification process that took four hours.\"I didn't know the full number until it was announced, so I was just as shocked,\" said Hope.She started her collection two years ago after buying a Jellycat bunny in a charity shop for 20p.\"I kind of knew what they were but had never seen one,\" she said.It led to Hope looking for them at car boot sales and being given the furry toys as gifts.Guinness World RecordsWhen the Guinness team told Hope Roberts how big her collection was, \"I had to get them to repeat it a couple of times – I couldn't believe it\"Her collection has grown further since being awarded the Guinness title, and she said she thought it was now near the 1,000 mark.The value of Jellycat toys varies wildly, from a few pounds to more than £1,000 for rare or limited edition items.The brand began life in 1999 but saw a spike in popularity during the Covid-19 pandemic.Hope documents her collection on social media, and she recently received feedback from socialite Nicky Hilton.\"I had to Google [that] it was definitely her,\" said Hope. \"It's crazy.\"Related storiesRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bedford teen wins world record title for her Jellycat collection",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6caf/live/5b9c0b70-ea28-11f0-bee8-cb37bc70a803.jpg"
      ],
      "datePublished": "2026-01-06T06:09:20.000Z",
      "dateModified": "2026-01-06T06:09:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Photographer over the Moon with ET picture recreation two years in the making",
    "url": "https://www.bbc.com/news/articles/cp3z475kxwpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/213d/live/295d3e70-ee26-11f0-a27d-a1f53bc65a41.jpg",
    "tag": "Trending",
    "date": "2026-01-10T21:55:25.000Z",
    "description": "3 hours agoNicholas BourneBBC WalesMichael Meighan\"We were over the Moon to finally get this one,\" said Michael MeighanA photographer says he is \"over",
    "body": "3 hours agoNicholas BourneBBC WalesMichael Meighan\"We were over the Moon to finally get this one,\" said Michael MeighanA photographer says he is \"over the Moon\" after recreating an iconic scene from the movie ET in a photo that has been almost two years in the making. Michael Meighan and his friend Nathan Edwards have tried repeatedly to recreate the scene from the 1982 hit film, when Elliott's BMX - with ET riding in the basket - flies by the Moon.The planets finally aligned during last weekend's first full Moon of the year, when plasterer Edwards pushed his bike uphill and into position on Eglwysilan Mountain, Rhondda Cynon Taf.Meanwhile, Meighan watched through his viewfinder from 1.4 miles (2.3km) away on a residential street in Treforest, Pontypridd, while the pair kept in contact by phone - attracting the attention of curious householders.\"They came out wondering what was happening when they saw a man with a huge camera lens next to their house,\" recalled Meighan, 39, from Cardiff.The care support worker showed them the scene through his camera with Edwards \"huffing and puffing\" on the other end of the phone while getting into position following a five-minute uphill bike push.Michael MeighanMichael Meighan (right) and his friend Nathan Edwards (left) have spent two years trying to recreate the imageEdwards, 33, from Cwmbran, Torfaen, had fastened into position a plastic wash bowl complete with teddy bear wrapped in a blanket to make it look like ET was sitting on the front of his own bike.He then stood and waited for his friend to get the shot which they first began planning in 2024.Meighan said he and Edwards had scouted other locations and attempted the movie recreation scene before by using a phone app to pinpoint their required positions given the expected location of the Moon.But opportunities for success had been limited with 12 full Moons in a typical year - until they got the perfect weather conditions last Saturday night.Getty Images | Corbis HistoricalElliott and his friends try to help ET evade capture in Steven Speilberg's movie from 1982\"We were over the Moon to finally get this one,\" said Meighan.\"We've attempted to get this shot a few times.\"The weather has messed us about, [also] not being able to get the alignment due to where the Moon is rising, but it finally came to.\"The actual planning is the hard part. Once it's planned, it's very simple to execute.\"They shared a \"huge embrace\" and celebrated in a nearby pub afterwards.Michael MeighanEdwards used duct tape to secure a teddy bear wrapped in a blanket to make it look like ET was sitting on the front of his own bikeMeighan paid tribute to the commitment of his friend, as the plan was first discussed following another full Moon photoshoot two years ago.\"He's a fantastic person, a fantastic friend and without him this would not be possible,\" said Meighan.\"The enthusiasm that he shows and the dedication to grab the bike, drive to a random location and to do that for sake of this image, it's just brilliant.\"More top storiesRelated links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Photographer over the Moon with ET picture recreation two years in the making",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/213d/live/295d3e70-ee26-11f0-a27d-a1f53bc65a41.jpg"
      ],
      "datePublished": "2026-01-10T21:55:25.000Z",
      "dateModified": "2026-01-10T21:55:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]