[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mc3v1g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-10-27T18:35:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·27 Oct 2025,·32 minsAmericanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again?AmericastAvailable for over a yearIt’s just over a year since the 2024 presidential election but attention is already turning to 2028 with both candidates from last year’s race expressing a desire to run again. Kamala Harris told the BBC over the weekend that she “wasn’t done” with public service, while Donald Trump said on Monday morning that he’d “love” to stand again for a third term. We answer your questions on whether Donald Trump plans to override the constitution for a third term in office, and whether he’d have support of the American public.\nMeanwhile, the president is back in construction, this time building a new ballroom at the White House, which has involved demolishing the 103-year-old East Wing in the process. We answer your questions on whether Trump is allowed to demolish parts of the White House and who’s actually paying for the changes. \nAnd, after Kamala Harris’s interview with the BBC, Justin and Anthony take a bit of time off air to chat through some of the issues she spoke about with Laura Kuenssberg and the circumstances surrounding Joe Biden’s eventual decision to withdraw from the election. \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray with Grace Reeve. The technical producers were Jack Graysmark and Stephen Bailey. The series producer is George Dabby. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-10-27T18:35:00.000Z",
      "dateModified": "2025-10-27T18:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - How Was The Migrant Sex Offender Mistakenly Released? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mc4czy?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-27T20:24:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·27 Oct 2025,·37 minsHow Was The Migrant Sex Offender Mistakenly Released?NewscastAvailable for over a yearToday, the government has announced an independent investigation into how a migrant sex offender was released from prison.\nSpeaking in the House of Commons the Justice Secretary David Lammy told mps that the release appears to have been “human error”. The Conservatives have called the mistake a “national embarrassment”. Adam and Chris are joined by HM Inspectorate of Prisons. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Adriana Urbano. The social producer was Joe Wilkinson. The technical producer was Stephen Bailey. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - How Was The Migrant Sex Offender Mistakenly Released? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-27T20:24:00.000Z",
      "dateModified": "2025-10-27T20:24:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-28T06:00:51.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-28T06:00:51.000Z",
      "dateModified": "2025-10-28T06:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "OpenAI shares data on ChatGPT users with suicidal thoughts, psychosis",
    "url": "https://www.bbc.com/news/articles/c5yd90g0q43o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4d38/live/778c7c50-b370-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-27T23:53:41.000Z",
    "description": "13 hours agoLily JamaliNorth America Technology Correspondent, San FranciscoOpenAI has released new estimates of the number of ChatGPT users who exhib",
    "body": "13 hours agoLily JamaliNorth America Technology Correspondent, San FranciscoOpenAI has released new estimates of the number of ChatGPT users who exhibit possible signs of mental health emergencies, including mania, psychosis or suicidal thoughts.The company said that around 0.07% of ChatGPT users active in a given week exhibited such signs, adding that its artificial intelligence (AI) chatbot recognizes and responds to these sensitive conversations.While OpenAI maintains these cases are \"extremely rare,\" critics said even a small percentage may amount to hundreds of thousands of people, as ChatGPT recently reached 800 million weekly active users, per boss Sam Altman.As scrutiny mounts, the company said it built a network of experts around the world to advise it.Those experts include more than 170 psychiatrists, psychologists, and primary care physicians who have practiced in 60 countries, the company said.They have devised a series of responses in ChatGPT to encourage users to seek help in the real world, according to OpenAI.But the glimpse at the company's data raised eyebrows among some mental health professionals.\"Even though 0.07% sounds like a small percentage, at a population level with hundreds of millions of users, that actually can be quite a few people,\" said Dr. Jason Nagata, a professor who studies technology use among young adults at the University of California, San Francisco.\"AI can broaden access to mental health support, and in some ways support mental health, but we have to be aware of the limitations,\" Dr. Nagata added.The company also estimates 0.15% of ChatGPT users have conversations that include \"explicit indicators of potential suicidal planning or intent.\"OpenAI said recent updates to its chatbot are designed to \"respond safely and empathetically to potential signs of delusion or mania\" and note \"indirect signals of potential self-harm or suicide risk.\"ChatGPT has also been trained to reroute sensitive conversations \"originating from other models to safer models\" by opening in a new window.In response to questions by the BBC on criticism about the numbers of people potentially affected, OpenAI said that this small percentage of users amounts to a meaningful amount of people and noted they are taking changes seriously. The changes come as OpenAI faces mounting legal scrutiny over the way ChatGPT interacts with users.In one of the most high-profile lawsuits recently filed against OpenAI, a California couple sued the company over the death of their teenage son alleging that ChatGPT encouraged him to take his own life in April.The lawsuit was filed by the parents of 16-year-old Adam Raine and was the first legal action accusing OpenAI of wrongful death.In a separate case, the suspect in a murder-suicide that took place in August in Greenwich, Connecticut posted hours of his conversations with ChatGPT, which appear to have fuelled the alleged perpetrator's delusions.More users struggle with AI psychosis as \"chatbots create the illusion of reality,\" said Professor Robin Feldman, Director of the AI Law & Innovation Institute at the University of California Law. \"It is a powerful illusion.\"She said OpenAI deserved credit for \"sharing statistics and for efforts to improve the problem\" but added: \"the company can put all kinds of warnings on the screen but a person who is mentally at risk may not be able to heed those warnings.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "OpenAI shares data on ChatGPT users with suicidal thoughts, psychosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4d38/live/778c7c50-b370-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-27T23:53:41.000Z",
      "dateModified": "2025-10-27T23:53:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Swash: Forgotten Young Dads",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002l5hr?at_mid=IS4oPuz1uw&at_campaign=Joe_Swash_Forgotten_Young_Dads&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002l5hr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Joe_Swash_Forgotten_Young_Dads&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m8wnty.jpg",
    "tag": "Trending",
    "date": "2025-10-20T05:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeJoe Swash: Forgotten Young DadsJoe Swash: Forgotten Young DadsToo often dismissed, young dads across the UK are quietly redefining fatherhood. Joe Swash meets four men breaking stigmas and showing what it truly means to show up. Duration59 minsFirst shown8pm 20 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesBehind Bars: Sex, Bribes and MurderInside an illicit prison economy – fuelled by coercion and contrabandBlackmailed: The Sextortion KillersA sinister online underworld, and the devastating impact on its victims and families1hJobfishedCatrin Nye investigates the glamorous company that faked its own existence.43 minsThailand: The Dark Side of ParadiseBeyond the golden beaches and bustling cities, Zara McDermott uncovers a riskier realityMissing in Paradise: Searching for SarmThe disappearance of Sarm Heslop. Was it a terrible accident, or something more sinister?ParanormalHaunting or hoax? Sian Eleri dives into the mystery of what was Wales' most haunted houseDear VivPaying tribute to drag royalty – the vivacious, the vibrant, The Vivienne59 minsFresh CopsOn the front line of crime. The highs and lows of policing are all in a day’s workHunting the Online Sex PredatorsTaking on the tech giants. Are their social media algorithms pushing harmful content?50 minsEastEnders Investigates: The ManosphereBehind the drama, an ugly truth. The devastating effects of misogyny and how to tackle it29 minsLife and Death RowCapital punishment through the eyes of young people whose lives have been shaped by it.Confessions of a Steroid GangThe dark side of self-improvement. Muscle, masculinity and a multi-million pound crime",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Swash: Forgotten Young Dads",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m8wnty.jpg"
      ],
      "datePublished": "2025-10-20T05:00:00.000Z",
      "dateModified": "2025-10-20T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon confirms massive job losses in corporate division",
    "url": "https://www.bbc.com/news/articles/c1m3zm9jnl1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/130f/live/2698a920-b3ef-11f0-be05-3928a0e0f928.jpg",
    "tag": "Trending",
    "date": "2025-10-28T11:29:15.000Z",
    "description": "57 minutes agoLiv McMahon,Technology reporter and Osmond Chia,Business reporterAmazon has confirmed it plans to cut thousands of jobs, saying it needs",
    "body": "57 minutes agoLiv McMahon,Technology reporter and Osmond Chia,Business reporterAmazon has confirmed it plans to cut thousands of jobs, saying it needs to be \"organised more leanly\" to seize the opportunity provided by artificial intelligence (AI).The tech giant said on Tuesday it would reduce its global corporate workforce by \"approximately 14,000 roles\".Earlier reporting had suggested it was planning to lay off as many as 30,000 workers.Beth Galetti, a senior vice president at Amazon, wrote in a note to staff that the move would make the company \"even stronger\" by shifting resources \"to ensure we're investing in our biggest bets and what matters most to our customers' current and future needs\".She acknowledged that some would question the move given the company was performing well.At the end of July, Amazon reported second quarter results which beat Wall Street expectations on several counts, including a 13% year over year increase in sales to $167.7bn (£125bn).But Ms Galetti said the cuts were needed because AI was \"the most transformative technology we've seen since the Internet\" and was \"enabling companies to innovate much faster than ever before.\"\"We're convicted that we need to be organised more leanly, with fewer layers and more ownership, to move as quickly as possible for our customers and business,\" she added.The note, shared with Amazon employees earlier on Tuesday, said the company was \"working hard to support everyone whose role is impacted\" - including by helping those affected find new roles within Amazon.Those who cannot will receive \"transition support\" including severance pay, it said.The BBC has asked if it will affect employees in the UK.The company has more than 1.5 million employees across its warehouses and offices worldwide.This includes around 350,000 corporate workers, which include those in executive, managerial and sales roles, according to figures that Amazon submitted to the US government last year.Like many technology firms, Amazon hired aggressively during the Covid-19 pandemic to meet the surge in demand for online deliveries and digital services.Amazon boss Andy Jassy has since focused on reducing spending as the company invests heavily in AI tools to boost efficiency.Mr Jassy said in June that the increase in AI tools will likely lead to job cuts as machines take over routine tasks.\"We will need fewer people doing some of the jobs that are being done today, and more people doing other types of jobs,\" he said then.The company has carried out several rounds of cuts to its corporate division in recent years.It laid off around 27,000 workers over several months in 2022, as rivals similarly looked to reverse hiring increases made during the pandemic.But analysts said its more subdued profit guidance for the forthcoming quarter had left some sceptical of the value of its enormous AI investments and whether they would pay off.Slower growth for its cloud business, Amazon Web Services (AWS), compared to rivals Microsoft and Google, also sparked concern among some investors.Amazon will report its latest quarterly results on Thursday for the period ending 30 September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon confirms massive job losses in corporate division",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/130f/live/2698a920-b3ef-11f0-be05-3928a0e0f928.jpg"
      ],
      "datePublished": "2025-10-28T11:29:15.000Z",
      "dateModified": "2025-10-28T11:29:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenya plane crashes kills Hungarian and German tourists and local pilot ",
    "url": "https://www.bbc.com/news/articles/c75146k9z4no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb8f/live/29d114a0-b3eb-11f0-9fd1-ab405da544ae.jpg",
    "tag": "Trending",
    "date": "2025-10-28T11:14:05.000Z",
    "description": "A plane crash near Kenya's coast has killed 10 European tourists and a local pilot, officials have said. The aircraft was flying from the popular beac",
    "body": "A plane crash near Kenya's coast has killed 10 European tourists and a local pilot, officials have said. The aircraft was flying from the popular beach resort of Diani to an airstrip in the world-famous Maasai Mara game park when it went down at 05:30 local time (02:30 GMT), the Kenya Civil Aviation Authority (KCAA) said. Mombasa Air Safari said the plane was carrying eight Hungarians, two Germans and a Kenyan pilot, all of whom had been killed in the crash. \"Our primary focus right now is on providing all possible support to the families affected,\" it added in a statement.Local media have published images of the plane in flames, with debris scattered at the site of the crash.Kwale County Commissioner Stephen Orinde told the BBC that the plane crashed about 10km (six miles) from Kwale town after flying out of Diani.It was on its way to Kichwa Tembo, an airstrip in Maasai Mara, popular with holidaymakers because of its wildlife. \"The passengers were all tourists,\" Orinde said.He said that investigations into the cause of the crash were ongoing but suggested it could have been due to bad weather.\"The weather is not very good here at the moment. Since early in the morning, it is raining and it is very misty, but we cannot preempt [the findings],\" Orinde said.In August, a light aircraft belonging to the medical charity Amref crashed on the outskirts of the capital, Nairobi, killing six people and injuring two others.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenya plane crashes kills Hungarian and German tourists and local pilot ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb8f/live/29d114a0-b3eb-11f0-9fd1-ab405da544ae.jpg"
      ],
      "datePublished": "2025-10-28T11:14:05.000Z",
      "dateModified": "2025-10-28T11:14:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Car headlights to be reviewed after drivers complain of being 'blinded' at night",
    "url": "https://www.bbc.com/news/articles/cn971jlpvvro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f980/live/c7cb3340-b394-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-28T10:04:59.000Z",
    "description": "2 hours agoKaty Austin,Transport correspondent  and Lucy Hooker,Business ReporterEPACriticism from drivers over the dazzle from oncoming headlights ha",
    "body": "2 hours agoKaty Austin,Transport correspondent  and Lucy Hooker,Business ReporterEPACriticism from drivers over the dazzle from oncoming headlights has prompted the government to take a closer look at the design of cars and headlamps on UK roads.Drivers say LED headlamps, which are increasingly common in new vehicles, are causing them problems and making it harder to drive at nightResearch into the issue on behalf of the Department for Transport (DfT) has still not been published, but the BBC has learned that the government now plans to launch a new assessment of the causes and remedies.New measures will be included in the government's upcoming Road Safety Strategy, reflecting what is becoming an increasingly fraught issue for road users.Both Ruth Goldsworthy and Sally Burt say bright headlights make it harder for them to get to their weekly SO Sound choir meetings in Totton, in Hampshire.\"Some of the lights are so bright you are blinded by them, for seconds,\" says Ruth.The beam from LED headlights is whiter, more focused and brighter than the more diffuse light from halogen lamps fitted in older cars.\"I'm not sure where to look, I look into the gutter,\" says Sally. They are both relieved if someone else offers to drive.Evening driving becomes a bigger problem as the winter evenings draw in, and especially after the clocks change, which means more people are driving in the dark.Ruth Goldsworthy (L) and Sally Burt (R) both say they are put off night-driving by the glare from brighter headlampsLinda, from Bristol, told BBC 5 Live's Nicky Campbell the intensity of the brightness was \"unnecessary and horrible\".\"It actually hurts my eyes it's so bright. So I tend to avoid driving at night now because it is such a horrible experience for me.\" She described having to raise her hand to block the light while driving because she \"can't see what's in front\" on the road.Mike, a bus driver in Scarborough, also called in to say the bright lights can cause confusion on the roads. \"You can't tell if these cars are flashing you or not,\" he said.The problem is worse for older people, whose eyes take around nine seconds to recover from glare, compared to one second for a 16-year-old, according to road safety consultant, Rob Heard.\"In severe cases, we might need to stop until our sight can recuperate,\" he said.A survey from the RAC motoring organisation found that more than a third of drivers were nervous about getting behind the wheel as the evenings get darker. Three quarters of respondents said driving was getting more difficult due to brighter lights.The RAC's senior policy officer, Rod Dennis, said so far little progress has been made on tackling glare, with regulations governing headlights dating back to 1989.A Dft spokesperson said: \"We know headlight glare is frustrating for many drivers, especially as the evenings get darker.\"What to do in the face of brighter headlamps:Ensure your windscreen is cleanWear glasses and keep them cleanAvoid looking straight ahead, instead focus on the edge of the roadDo not wear night sunglasses sold for night-driving, as they reduce overall light and won't reduce glare.Source: College of OptometristsNew researchThe results of last winter's government commissioned research into the \"causes and impact of glare\" are now expected in the next few weeks, the DfT said.They will inform the upcoming Road Safety Strategy, which is also expected to tighten rules on drink-driving and eye-sight tests for older drivers.The BBC understands the government is commissioning new research into the role of vehicle design in causing glare, and possible solutions, which will feed into international discussion of the issue.Getty ImagesLED lamps give off a blue-white lightOne already well-understood source of glare is drivers retrofitting their vehicles, replacing old halogen bulbs with LEDs.The housing for halogen bulbs is not compatible with LED bulbs, and a retrofitted car will not pass its annual MOT check-up.As part of the government's new approach the Driver and Vehicle Standards Agency has \"stepped up surveillance\" to stop the sale of illegal retrofit headlamp bulbs, the DfT said. Seeing betterCars sold with LED lights can improve road safety by helping drivers to see better, Thomas Broberg, senior adviser for safety at Volvo told the BBC.However, avoiding dazzle was \"equally important\", he said.\"I would say poor aiming of the headlights and also the road shape are the major factors for glare,\" he said.For larger vehicles, such as SUVs, where lights are higher off the ground, the beam must point more sharply downwards, to protect oncoming drivers. But the angle can be affected by how many passengers it is carrying.Some new cars with \"adaptive features\" adjust the lamps automatically if there is a change in load, but cars without that will need manual adjusting, Mr Broberg said.Some new cars also have automatic headlamp dipping, which lowers the lights when an oncoming vehicle is detected.However, Daniel Harriman-McCartney, clinical advisor at the College of Optometrists, said automatic dimming features can be \"slow to kick in\".Getty Images/Stephen Robinson PicturesThree quarters of drivers surveyed by the RAC said bright lights were making night driving harder.Dazzling headlights are cited as a factor in around 250 accidents a year, but there is no evidence that brighter lights are causing more collisions than previously, the RAC concedes.Instead, worried drivers may simply be \"taking the risk off the road\" by not driving at night, with a big social impact, the RAC's Mr Dennis warned.He would like to see action that \"strikes a balance\".\"We don't want to go back to worse headlights. It is about what is bright enough.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Car headlights to be reviewed after drivers complain of being 'blinded' at night",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f980/live/c7cb3340-b394-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-28T10:04:59.000Z",
      "dateModified": "2025-10-28T10:04:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why the 5G symbol on your phone doesn't mean you actually have 5G",
    "url": "https://www.bbc.com/news/articles/crexqyj7n5lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53a3/live/e92037d0-b325-11f0-9c26-756530926d22.jpg",
    "tag": "Trending",
    "date": "2025-10-28T02:01:08.000Z",
    "description": "10 hours agoYasmin RufoBBC NewsGetty ImagesWhen you see the 5G symbol at the top of your phone, you probably assume you're getting faster internet spe",
    "body": "10 hours agoYasmin RufoBBC NewsGetty ImagesWhen you see the 5G symbol at the top of your phone, you probably assume you're getting faster internet speeds - the kind promised when it first arrived five years ago.Mobile networks told us that 5G would provide us with faster downloads, smoother streaming and instant connectivity.It has received lots of investment from mobile operators and the government but has faced several setbacks, particularly as 5G requires a lot of masts because it delivers faster speeds over shorter distances.New research suggests that the 5G symbol you see on your screen might not match what you're actually getting in terms of internet speed.Tests carried out by research group PolicyTracker, and shared with BBC's Morning Live, found that nearly 40% of the time a phone displays the 5G symbol, it is actually using a 4G connection.That means you could be paying for, and seeing, 5G while your phone quietly sticks to slower speeds.The peak theoretical download speed for 5G is up to 20,000 megabits per second which is fast enough to download 18 HD films in under a minute, but for many of us our speed is far lower than that.The research comes as some mobile networks begin rolling out \"standalone 5G\" - a new service that, they say, promises true 5G speeds all the time. In order to benefit from this you will need to purchase a specific phone plan which often comes with a higher price tag.What should I do if I'm not getting 5G?If you have a contract that includes 5G, but you don't think you're getting a regular and reliable 5G signal you should: Check your speed: Use an online speed test to see your real download and upload rates Check your coverage: Ofcom's mobile coverage checker shows which network offers the best 4G or 5G signal in your area. Once you enter a postcode, you'll see whether a 4G/5G signal is available locally and whether the signal is good or variable. It can also show you which provider has the best coverage for the area. Contact your provider: If you're not happy with the coverage and signal strength of your current provider it's worth contacting them to explain the problem and see what advice they can provide you with.Change provider: If you're not locked into a contract it can be simple to swap to another provider that offers better coverage.'Not worth it'PolicyTracker conducted 11,000 tests across central London, the outskirts of Birmingham and a village in North Lincolnshire, using four different phones connected to four different network providers.It found that while phones often display the 5G logo, the data being transmitted is still carried by older 4G infrastructure.The difference isn't always obvious to users, but it can mean slower downloads and buffering in places where they expect the ultra-fast network.The issue comes down to how mobile networks currently define 5G.Martin Sims from PolicyTracker explains that the symbol on your phone shows the \"presence\" of a 5G signal in the area, but doesn't guarantee that your phone is connected to it.He says that even with the \"standalone 5G\" service, your phone can still drop down to 4G if a faster connection is not available. He says that for most people, \"standalone 5G isn't worth it as it's not very good value for money because the contracts are expensive\". He adds that the coverage is still patchy, even in big cities like London although he does say this new service means \"you're more likely to get better service in busy areas like train stations\". Consumer expert, Jasper Griegson from the complaints service Resolver told the BBC that customers are entitled to clarity.You think you're getting one thing but you're not and accuracy is key,\" he said. \"The consumer rights act has very strict rules about how accurate things have to be in other contexts, so why does that differ here?\"In response, Mobile UK, the trade body representing Britain's major mobile operators, confirmed that the 5G icon doesn't necessarily mean a live 5G connection.It said the symbol indicates a user is in a 5G-enabled area, and that networks \"dynamically and seamlessly steer customers to the best connection, whether 4G or 5G, based on real-time factors like signal strength\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why the 5G symbol on your phone doesn't mean you actually have 5G",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53a3/live/e92037d0-b325-11f0-9c26-756530926d22.jpg"
      ],
      "datePublished": "2025-10-28T02:01:08.000Z",
      "dateModified": "2025-10-28T02:01:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fawlty Towers actress Prunella Scales dies aged 93",
    "url": "https://www.bbc.com/news/articles/cjd0yn5gyndo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fadc/live/a98b6320-b3f1-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-28T12:13:10.000Z",
    "description": "13 minutes agoEmma Saunders,Culture reporter and Paul Glynn,Culture reporterBBC ImagesFawlty Towers actress Prunella Scales has died aged 93, her fami",
    "body": "13 minutes agoEmma Saunders,Culture reporter and Paul Glynn,Culture reporterBBC ImagesFawlty Towers actress Prunella Scales has died aged 93, her family have confirmed.Scales was best known for playing hotel manager Sybil Fawlty, the long-suffering and domineering wife of Basil, in the classic British sitcom.The actress died \"peacefully at home in London yesterday\", her sons Samuel and Joseph said.They added that she was watching Fawlty Towers the day before she died. Scales had been diagnosed with vascular dementia in 2013.\"Our darling mother Prunella Scales died peacefully at home in London yesterday. She was 93,\" her sons told the PA News agency. \"Although dementia forced her retirement from a remarkable acting career of nearly 70 years, she continued to live at home.\"Her husband, fellow actor Timothy West, died in November last year.She is survived by two sons and one stepdaughter, seven grandchildren and four great-grandchildren.The statement added: \"We would like to thank all those who gave Pru such wonderful care at the end of her life: her last days were comfortable, contented and surrounded by love.\"Broadcaster Gyles Brandreth remembered her as \"a funny, intelligent, interesting, gifted human being\".Jon Petrie, director of comedy at the BBC, offered: \"She was a national treasure whose brilliance as Sybil Fawlty lit up screens and still makes us laugh today.\"Scales also went on to receive a Bafta nomination for her portrayal of Queen Elizabeth II in Alan Bennett's 1991 televised play, A Question of Attribution. But she will forever be most closely identified with the domineering and long-suffering comedy creation Sybil Fawlty in Fawlty Towers, best defined by one bark of \"Basil\".Getty ImagesTimothy West and Prunella Scales proved a hit in Great Canal Journeys on Channel 4This year marked 50 years since the classic comedy Fawlty Towers first appeared on our screens.In the sitcom, the aspirational and stylish Sybil - with her permed hair and sharp skirt suits - ruled the roost over her bumbling and often hapless husband Basil as they both attempted to run a Torquay hotel.Often, when he was on the verge of a crisis, she would arrive and step in to either clear up his mess or benefit from his misfortune.He referred to her by a number of negative nicknames including \"the dragon\" and \"my little piranha fish\", but only behind her back as he's terrified of her.In one episode, titled The Psychiatrist, Basil finally loses his patience and snaps at his wife, declaring: \"Shut up, I'm fed up.\"\"Oh, you've done it now,\" responds Sybil.Speaking of her character, Scales once said: \"I feel very grateful for Sybil. Fawlty Towers was very hard to make, but it was very stimulating.\"But in an interview with the Independent last year, she said she \"loves it when people don't\" ask her about the show as she found the topic \"boring\".Getty ImagesScales met Queen Camilla during a garden party in Rye in May last yearLater in life, she enjoyed an unlikely hit with Channel 4's Great Canal Journeys, travelling waterways in the UK and elsewhere with her late husband.\"We didn't start out thinking it was going to be an especially exciting performance for people to watch,\" admitted West in an interview with the BBC's Colin Paterson in 2023.But for 10 series, they made canals captivating. \"We were good at it,\" he smiled.West noted how his wife's dementia would not break their 60-year love story.Following the annoncement of her death on Tuesday, Corinne Mills, interim chief executive officer for Alzheimer's Society, praised the actress for raising awareness.She said: \"We are deeply saddened by the news that Prunella Scales - a true British icon - has died.\"Prunella was an inspiration not just for her achievements on screen, but because she spoke so openly about living with dementia, shining an important light on the UK's biggest killer.\"She added: \"We are profoundly grateful for the awareness she helped to raise and send our heartfelt condolences to her loved ones.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fawlty Towers actress Prunella Scales dies aged 93",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fadc/live/a98b6320-b3f1-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-28T12:13:10.000Z",
      "dateModified": "2025-10-28T12:13:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Andrew hosted Epstein, Maxwell and Weinstein at Royal Lodge",
    "url": "https://www.bbc.com/news/articles/c4g7d39n6vgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e47c/live/9e28a840-b3e6-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-27T22:33:17.000Z",
    "description": "14 hours agoJoe PikePolitics investigations correspondentThe Sun/News LicensingWeinstein, Epstein and Maxwell visited Royal Lodge as part of Prince An",
    "body": "14 hours agoJoe PikePolitics investigations correspondentThe Sun/News LicensingWeinstein, Epstein and Maxwell visited Royal Lodge as part of Prince Andrew's daughter Beatrice's 18th birthday celebrationsPrince Andrew hosted Jeffrey Epstein, Ghislaine Maxwell and Harvey Weinstein at Royal Lodge, the prince's private home in the grounds of Windsor Castle. The trio visited the Windsor mansion as part of his daughter Beatrice's masked ball 18th birthday celebrations in 2006, two months after a US arrest warrant had been issued for Epstein for the sexual assault of a minor.It had previously been reported that Epstein, Maxwell and Weinstein visited Windsor Castle for the event, but not that they had been hosted at Andrew's private home.Andrew, who is facing increased scrutiny over his living arrangements in light of his relationship with Epstein, has not responded to a request for comment.It is understood that Epstein, Maxwell and Weinstein visited Royal Lodge ahead of the main party, which took place in the state rooms of Windsor Castle and involved a champagne reception and banquet.Royal Lodge is owned by the Crown Estate, a property business owned by the monarch but run independently with profits going to the Treasury. The BBC has matched the trees and patio wall in a previously published image of the trio to other pictures of Royal Lodge.A witness told the BBC they remembered seeing Weinstein and Epstein at a drinks event in the back garden of Royal Lodge - before guests headed to the main party at the castle.Epstein was arrested by police in Florida eight days after the event.Asked by BBC Newsnight in 2019 why he invited Epstein to his daughter's 18th birthday two months after the US arrest warrant was issued, Andrew said: \"Certainly I wasn't aware when the invitation was issued what was going on in the United States and I wasn't aware until the media picked up on it because he never said anything about it.\"ReutersAndrew relinquished his titles earlier this month amid renewed scrutiny of his links with Epstein following the posthumous publication of Virginia Giuffre's memoir.In the memoir, Ms Giuffre said she was forced to have sex with the prince on three separate occasions, including once with Epstein and \"eight other young girls\".Andrew, who reached a financial settlement with Ms Giuffre in 2022, has repeatedly denied any wrongdoing. In 2019, he told BBC Newsnight he did not remember meeting Ms Giuffre \"at all\" and that they \"never had any sort of sexual contact\".Fresh questions have also been asked about how he is able to fund his lifestyle despite not being a working royal.The revelation that he has only ever paid a token annual rent on his Windsor mansion, Royal Lodge, has intensified the questions over his living arrangements - even though he paid for renovations and rent in advance so there were no monthly payments. Buckingham Palace has not commented on whether Prince Andrew might move out of his home - or where he might go.But BBC News understands that two other properties in the grounds of Windsor Castle, Adelaide Cottage and Frogmore Cottage, were options suggested to both Prince Andrew and his ex-wife Sarah Ferguson some months ago.US Attorney's Office SDNYEpstein and Maxwell pictured at Balmoral in ScotlandEpstein and Ghislaine Maxwell seemed to be regular guests at royal residences in the late 1990s and early 2000s.An image of the pair at Balmoral, the royals' private Highland estate, was released by prosecutors during Maxwell's sex trafficking trial.It is thought to have been taken in 1999, when Andrew reportedly invited the couple to stay at the Scottish castleIn 2000, Epstein was a guest at Windsor Castle and the prince hosted a birthday event for Maxwell at Sandringham, the monarch's private country retreat in Norfolk.He told BBC Newsnight the latter event was \"a straightforward shooting weekend\".The Daily TelegraphGhislaine Maxwell and Kevin Spacey at Buckingham Palace in 2002Ghislaine Maxwell visited Buckingham Palace as part of a private tour in 2002.A photo of her sitting on the monarch's throne next to actor Kevin Spacey was obtained by the Daily Telegraph almost two decades later.It is thought Prince Andrew organised the tour but that Jeffrey Epstein was not part of it.Andrew has confirmed he travelled on Epstein's private jet, stayed at his private island, stayed at his Palm Beach mansion, and visited Ghislaine Maxwell's home at Belgravia in London.Epstein died by suicide in a New York jail cell in August 2019 while awaiting trial on sex trafficking charges.In 2008, he reached a plea deal with prosecutors after the parents of a 14-year-old girl told police in Florida that Epstein had molested their daughter at his Palm Beach home.Maxwell is currently serving a 20-year prison sentence in the US for recruiting and trafficking four teenage girls for sexual abuse by Epstein, her then boyfriend.Weinstein has been convicted of sexual assault by courts in New York and Los Angeles, but has secured a retrial on some of his convictions.Additional reporting by Paul Myers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Andrew hosted Epstein, Maxwell and Weinstein at Royal Lodge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e47c/live/9e28a840-b3e6-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-27T22:33:17.000Z",
      "dateModified": "2025-10-27T22:33:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reeves could face £20bn Budget hole as UK productivity downgraded",
    "url": "https://www.bbc.com/news/articles/c0rpve82jxvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/efdc/live/9d17ca90-b390-11f0-8f14-918a243add68.jpg",
    "tag": "Trending",
    "date": "2025-10-28T09:25:28.000Z",
    "description": "3 hours agoFaisal IslamEconomics editorThe government is facing a bigger-than-expected hole in the public finances as it prepares for next month's Bud",
    "body": "3 hours agoFaisal IslamEconomics editorThe government is facing a bigger-than-expected hole in the public finances as it prepares for next month's Budget.A downgrade to the UK's productivity performance from the government's official forecaster could lead to the chancellor facing a £20bn gap in meeting her tax and spending rules, the BBC understands.Rachel Reeves has confirmed both tax rises and spending cuts are options in next month's Budget.The Treasury declined to comment on \"speculation\" ahead of the Office for Budget Responsibility's (OBR) final forecast, which will be published on 26 November alongside the Budget.The OBR will deliver its final draft forecast, including productivity - a measure of the output of the economy per hour worked - to the Treasury on Friday.The forecaster had previously assumed a partial bounce back in productivity growth, but this has never materialised.This productivity assumption is essential to long-term growth prospects and so, under the current system, even a small change can alter how much money a Budget needs to raise by several billion pounds.The OBR is understood to have downgraded forecast for productivity by 0.3 percentage points - a figure first reported by the Financial Times - bringing its assumption closer to that of the Bank of England.The Institute for Fiscal Studies think-tank has calculated that for every 0.1 percentage point downgrade in the productivity forecast, government borrowing would increase by £7bn in 2029-30 - meaning a 0.3 point cut could add £21bn to the Budget hole.The changes open up an initial gap of some £20bn, rather than the £10-£14bn widely anticipated.Such a hole could be plugged by hiking taxes, reducing public spending or increasing government borrowing.Reeves has set out two main Budget rules, which she has described as \"non-negotiable\". These are: Not to borrow to fund day-to-day public spending by the end of this parliamentTo get government debt falling as a share of national income by the end of this parliamentReeves admitted on Monday to business leaders in Saudi Arabia that the OBR was \"likely to downgrade productivity\" which has been \"very poor since the financial crisis and Brexit\". The OBR is expected to explain the decision in detail, but some ministers have privately pointed out that if it had done this earlier, different choices could have been made at this summer's Spending Review.There are many other moving parts in the Budget which may bring better news for the chancellor, such as the decline in the interest rates paid on government debt.However, with other pressures such as the U-turns on welfare spending and a desire to rebuild a bigger buffer in the public finances, speculation is pointing towards significant tax rises, including some possible breaches of manifesto commitments such as changes to income tax.The Treasury will inform the OBR of its first draft Budget measures next week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reeves could face £20bn Budget hole as UK productivity downgraded",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/efdc/live/9d17ca90-b390-11f0-8f14-918a243add68.jpg"
      ],
      "datePublished": "2025-10-28T09:25:28.000Z",
      "dateModified": "2025-10-28T09:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bella Culley's family pay to reduce Georgia drug smuggling sentence",
    "url": "https://www.bbc.com/news/articles/cwypqwn4epyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8bda/live/d8d8da70-8810-11f0-984a-f96b9f66a4a4.jpg",
    "tag": "Trending",
    "date": "2025-10-28T10:19:01.000Z",
    "description": "2 hours agoRayhan Demytrie,in Tbilisi and Tom Burgess,North East and CumbriaRustavi 2Bella Culley, pictured at a previous hearing, appeared at Tbilisi",
    "body": "2 hours agoRayhan Demytrie,in Tbilisi and Tom Burgess,North East and CumbriaRustavi 2Bella Culley, pictured at a previous hearing, appeared at Tbilisi City Court on drugs chargesThe family of a \"heavily pregnant\" British teenager who is on trial for drug smuggling in Georgia has paid £137,000 to reduce her sentence.Bella Culley, 19, from Billingham, Teesside, had previously been told she could face up to 20 years in jail or life imprisonment if convicted.Her mother Lyanne Kennedy confirmed the family had transferred the funds and it was now up to prosecutors to confirm they had received the money.Miss Culley was stopped at Tbilisi International Airport in May after 12kg (26lbs) of marijuana and 2kg (4.4lbs) of hashish were found in her luggage. She previously claimed she was tortured to bring the drugs.Under the plea bargain agreement, her family paid 500,000 Georgian Lari (£137,000) to significantly reduce her sentence.More than 90% of drug-related crimes in Georgia are resolved through plea bargains.Miss Culley will remain in pre-trial detention until the next hearing on Monday.ReutersLyanne Kennedy, speaking to reporters outside court, said her 19-year-old daughter was \"looking strong\"Miss Culley is currently believed to be 35 weeks pregnant.Speaking outside court, her mother said: \"We've confirmed that the funds have been sent but they need to confirm that they have been received and that is not going to happen until tomorrow.\"She is looking big, pregnant, but she is looking strong.\"Malkhaz Salakaia, representing Miss Culley, said the negotiations \"are nearing completion\".He said: \"Plea bargain conditions are known to the family.\"There is a technical issue to be resolved which will take a few days.\"Mr Salakaia previously said he planned to appeal to the president of Georgia to pardon her after finalising the plea deal.Rayhan Demytrie/BBCBella Culley is being detained at prison number 5Miss Culley initially went missing in Thailand before being arrested at Tbilisi International Airport on 10 May.It is understood she arrived on a flight from Sharjah in the United Arab Emirates and police seized drugs from a travel bag.At a hearing in July, she pleaded not guilty to charges of possession and trafficking illegal drugs and claimed she had been \"forced to do this through torture\".\"I just wanted to travel,\" she said. \"I am a good person. I am a student at university. I am a clean person. I don't do drugs.\"More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bella Culley's family pay to reduce Georgia drug smuggling sentence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8bda/live/d8d8da70-8810-11f0-984a-f96b9f66a4a4.jpg"
      ],
      "datePublished": "2025-10-28T10:19:01.000Z",
      "dateModified": "2025-10-28T10:19:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Martin Freeman and Jack Lowden on incels, addiction and fatherhood",
    "url": "https://www.bbc.com/news/articles/cdegz4k702eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/06f3/live/a83bc1a0-b341-11f0-9ae5-dfa34b074568.jpg",
    "tag": "Trending",
    "date": "2025-10-28T00:05:45.000Z",
    "description": "12 hours agoYasmin RufoBBC NewsGetty Images\"I think I might be an incel.\"It's the first line Jack Lowden speaks in The Fifth Step, a two-hander play t",
    "body": "12 hours agoYasmin RufoBBC NewsGetty Images\"I think I might be an incel.\"It's the first line Jack Lowden speaks in The Fifth Step, a two-hander play that focuses on the relationship between a recovering alcoholic and his sponsor.\"The line is a bomb - a hot button thing that's really funny,\" says Martin Freeman, who stars alongside Lowden.From the opening line, audiences may think they know what kind of show they are about to see, but what follows in the 90-minute play isn't a social lecture, rather a darkly funny conversation between two men – one seeking redemption, the other offering it.\"The incel line doesn't sum the play up at all,\" says Freeman. \"It might touch on that, but it has a lot of other components too.\"Lowden agrees, describing it as a \"current and easy label\" that risks simplifying a piece about shame, honesty and the need to be understood.Written by David Ireland and directed by Finn den Hertog, The Fifth Step sees Lowden play Luka, a newcomer to Alcoholics Anonymous, while Freeman is an older sponsor guiding him through the 12-step recovery programme.The play was met with rave reviews by critics during its West End run earlier this year and it is now being released in cinemas.Johan PerssonThe Fifth Step follows a young man in Alcoholics Anonymous and his older sponsor as they work through the 12-step programme together\"It's actually very TV and camera friendly,\" Lowden explains. \"It's just two actors in an open space and there's no complicated staging.\"\"Really the only thing that was different was that we had mics on,\" adds Freeman. \"The cameras are so well hidden that it's not intrusive at all.\"Both actors were drawn to the project for the writing's precision and nerve.Freeman says he wasn't in the market to do a play when he received the script just before Christmas but it was \"so enjoyable and some things come along that are too good not to do, and this was one of those\".Lowden, best known for Slow Horses and The Gold, has long admired Ireland's work and says it's \"purposefully very shocking and funny\".\"That's what I love to go to the theatre for, I get quite bored unless a show is one of those two things.\"'It's a minefield'We talk about how the play explores the confusion around modern masculinity and fatherhood, something both actors are acutely aware of - Freeman shares a teenage son and daughter with his ex-wife Amanda Abbington, while Lowden has just welcomed his first child with Saoirse Ronan.\"I think about the messages young people are getting all the time,\" Freeman says. \"There's so much that's very positive and hopeful in the world but there's also so much that's trash, awful and frightening.\"It can feel like a minefield sometimes and I'm very alive to those things, but I try not to lose my mind over it.\"Getty ImagesLowden and Saoirse Ronan have been in a relationship since 2018 Given how many topics the play touches upon, it's impossible for the actors to give it one neat label or find one overarching theme.\"I don't think this play is about the male experience of anything - it explores the relationship between an older and a younger man, but if you take 'man' out of that, it's just a generational exploration of shame,\" Lowden says. In fact, the 35-year-old actor says he finds it \"reductive how society pigeonholes a piece of art straight away\", referencing how some people have focused too much on the incel culture aspect of the play rather than \"seeing it as two people talking very openly\".The Fifth Step is Lowden's first play since 2018 and critic reviews from the theatrical run praised his performance - The Times said he was \"staggeringly good as a young loner, Luka, all jitters and tics and swear words, who is trying to pull himself out of an alcoholic spiral\". Similarly, The I's Isobel Lewis said Lowden's greatest triumph is that \"despite Luka's propensity for violence, extreme misogyny and casual homophobia, he's still ultimately empathetic, someone you come to understand as a product of his environment\".A four-star review from The FT summarised the play as \"interweaving serious questions with crisply funny dialogue and combining the absurd with the profound\".Freeman says it's that balance of darkness and humour that makes The Fifth Step so unique.\"It's shocking and violent, and people say things to each other that are horrible and funny in the same beat.\"Ultimately, the Sherlock actor wants \"people to take enjoyment out of it\" and doesn't want an audience to see this as a play that's good for them, but one that's interesting and enlightening.He tells me that every evening during the play's run at @sohoplace, the audiences would \"let out an enjoyable sigh, as if someone had just had a really good meal\". Now, as The Fifth Step makes its way from the stage to cinema screens, Freeman and Lowden are hoping for that same collective sigh after each screening. The Fifth Step will be in cinemas globally from 27 November - with select preview screenings across the UK on 18 November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Martin Freeman and Jack Lowden on incels, addiction and fatherhood",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/06f3/live/a83bc1a0-b341-11f0-9ae5-dfa34b074568.jpg"
      ],
      "datePublished": "2025-10-28T00:05:45.000Z",
      "dateModified": "2025-10-28T00:05:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]