[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msylv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-08T20:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·28 mins,·Everything We Know About The Minneapolis ICE Shooting…So FarNewscastAvailable for over a yearProtests are taking place in Minneapolis after a woman was fatally shot by a US ICE agent.\nAccounts of what exactly happened are conflicting, with the Trump Administration citing self-defence whilst law makers in the city and state of Minnesota are calling it a brazen act of force.\nAdam is joined by BBC North America correspondent, Anthony Zurcher, and BBC North America reporter, Madeline Halpert, who is on the ground and at the scene in Minneapolis.\nIn studio is BBC business editor Simon Jack, who got the scoop on the government’s latest change of heart about business rates for English pubs.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-08T20:12:00.000Z",
      "dateModified": "2026-01-08T20:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpbrwl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg",
    "tag": "Trending",
    "date": "2026-01-05T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·05 Jan 2026,·21 minsAvailable for over a yearHistorian and The Rest Is History co-host Tom Holland answers your questions about whether Britain is currently in a more precarious state than it was in the 1970s, what definition of ‘radical’ best describes him and if he will ever score a century playing cricket.\nHe also explains why American presidents are often compared to Julius Caesar and faces a question he’s never heard before.\nGET IN TOUCH\n* WhatsApp: 0330 123 9480\n* Email: radical@bbc.co.uk\nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent.\nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis and Joe Wilkinson. Technical production was by Mike Regaard. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg"
      ],
      "datePublished": "2026-01-05T06:00:00.000Z",
      "dateModified": "2026-01-05T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two people wounded in shooting involving federal agents in Portland",
    "url": "https://www.bbc.com/news/articles/ckgn1y1zygxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8440/live/f98fdfe0-ecef-11f0-ae08-35e63deb2d74.jpg",
    "tag": "Trending",
    "date": "2026-01-09T00:43:29.000Z",
    "description": "25 minutes agoMax MatzaSeattleGetty ImagesTwo people have been shot and wounded in an incident involving US federal agents in the city of Portland, Or",
    "body": "25 minutes agoMax MatzaSeattleGetty ImagesTwo people have been shot and wounded in an incident involving US federal agents in the city of Portland, Oregon, according to local police.\"Officers have determined the two people were injured in the shooting involving federal agents,\" the Portland Police said in a statement, adding that a man and woman were taken to hospital and their conditions are unknown. The circumstances surrounding the shooting are currently unknown.The incident comes one day after a federal agent shot and killed a woman in Minneapolis, Minnesota, triggering protests around the US against federal law enforcement operations in major US cities.Portland Police said in a statement that their officers were not involved in the incident, and were called after receiving reports that a man had been shot. The two people who were shot have not identified, and police say they were discovered several blocks away from the scene of the shooting.\"Officers applied a tourniquet and summoned emergency medical personnel,\" before they were taken to hospital, the statement says, adding that \"their conditions are unknown\".\"We are still in the early stages of this incident,\" said Portland Police Chief Bob Day.\"We understand the heightened emotion and tension many are feeling in the wake of the shooting in Minneapolis, but I am asking the community to remain calm as we work to learn more.\"Portland Mayor Keith Wilson also released a statement, saying that the shooting comes \"just one day after the horrific violence in Minnesota at the hands of federal agents\".He added that immigration agents should \"end all operations in Portland until a full investigation can be completed\".\"Federal militarization undermines effective, community‑based public safety, and it runs counter to the values that define our region,\" he said.Portland has been the site of large anti-Trump protests in the past. On Wednesday night, Portland police arrested one protester who was charged with menacing after officers found him allegedly threatening another person with a knife.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two people wounded in shooting involving federal agents in Portland",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8440/live/f98fdfe0-ecef-11f0-ae08-35e63deb2d74.jpg"
      ],
      "datePublished": "2026-01-09T00:43:29.000Z",
      "dateModified": "2026-01-09T00:43:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
    "url": "https://www.bbc.com/news/articles/c74w3qx4j5no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:45:01.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live6 hours agoThis week, the US shocked the world by seizing Venezuelan leader Nicolás Maduro in a raid on his home, high street retailer Claire's financial troubles continued, and actress Ashley Tisdale spoke out against \"toxic mom groups\".But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy some more? Test your memory of 2025 with our quiz of the year, try last week's quiz, or have a go at something from the archives.FilmUnited States",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-08T18:45:01.000Z",
      "dateModified": "2026-01-08T18:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Pub tax U-turn' and 'caring Catherine'",
    "url": "https://www.bbc.com/news/articles/cm24dznk16go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d7dd/live/d67942b0-ecf1-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-09T00:40:29.000Z",
    "description": "29 minutes agoBBC\"Cheers!\" to \"another 'too late' U-turn from PM\", declares the Daily Express after the \"watering down\" of pub business rate rises. \"S",
    "body": "29 minutes agoBBC\"Cheers!\" to \"another 'too late' U-turn from PM\", declares the Daily Express after the \"watering down\" of pub business rate rises. \"Sir Keir starts the year by flip-flopping again,\" it adds. Also on its front, \"caring Catherine\" as the Princess of Wales made a surprise visit to Charing Cross Hospital to celebrate \"the worth of NHS heroes\".The Daily Mail echoes the Express with \"pub U-turn's too little too late\", describing that the climbdown on tax hikes for pubs is \"humiliating\" for Labour. The move has been signalled by ministers, the paper says, and comes six weeks after the Chancellor Rachel Reeves unveiled the initial rate rises in her Budget.The Daily Telegraph also headlines on how Reeves is \"to climb down on pub tax\" in the latest in a \"series of about turns\" including changes to the inheritance tax \"raid\" on farmers and on winter fuel payments, it adds. In Iran, the internet has been shut down \"as protests mount\". The Princess of Wales is snapped again at Charing Cross Hospital, where she recalled her experience of chemotherapy and described the \"kindness\" of NHS workers.The Times leads with \"top defence chief warns of need for extra £28bn\". Under pressure to get forces ready for \"possible war with Russia\", the paper says defence chiefs are at the same time \"preparing to make huge cuts to the military\". It also reports that Equalities Minister Bridget Phillipson has delayed guidance on single-sex spaces due to \"cost fears\". \"Send writ like Beckham\" leads the Sun, as the paper reports that the famous family's eldest son Brooklyn has told his parents they can only contact him via lawyers. An \"extraordinary\" letter also instructed ex-Spice Girl Victoria Beckham and her footballer husband David Beckham \"not to 'tag' him on social media\", according to the paper.The Daily Mirror says there is anger in Clacton, constituency of Reform UK leader Nigel Farage. The MP was \"blasted for ignoring his day job after jetting to the Abu Dhabi Grand Prix\" and has been dubbed \"freeloader Farage\" by the paper as it asks \"where's Wally?\"The Guardian reports that 34 school contemporaries of Farage have accused the Reform UK leader of \"racist behaviour\". On Wednesday, the Reform UK leader told Times Radio he acknowledged \"aggressive banter\" but said claims that he had told one fellow pupil to \"go back to Africa\" and made gas hissing noises at a Jewish pupil were \"complete fantasy land\".The i Paper headlines on \"Putin's shadow fleet\", saying there have been at least 50 \"zombie\" tankers sailing in UK waters in the past three days. Now it reports ministers see the North Atlantic as part of the front line against the Russian president's war effort and have pledged to use \"hard power\".A photo of federal agents fighting with protesters in the US is splashed across the Financial Times after the fatal shooting in Saint Paul, Minnesota \"sparks clashes\". Also on its front, the \"push to reset EU ties excludes financial services\". The City of London \"shuns\" the \"closer alignment\", it reports.Metro chastises an Albanian burglar for posing with stolen cash and watches, writing \"wad a wally... he'll do time\". The selfies have led to \"years in jail\" for the group that undertook \"at least 44 raids on mansions in a seven-month spree\".It is \"cloak and daggers\" for the Daily Star as it reports that the traitors are \"at war\". The paper also marks the death of footballer Terry Yorath, leading with BBC Sport presenter Gabby Logan's words that \"to us Terry was just dad\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Pub tax U-turn' and 'caring Catherine'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d7dd/live/d67942b0-ecf1-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-09T00:40:29.000Z",
      "dateModified": "2026-01-09T00:40:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Weight loss jabs affecting Greggs, boss says",
    "url": "https://www.bbc.com/news/articles/c20g11y4dywo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/58ef/live/a912a7e0-eca0-11f0-be98-fd0ce9c3379d.jpg",
    "tag": "Trending",
    "date": "2026-01-08T15:38:19.000Z",
    "description": "9 hours agoFaarea MasudBusiness reporterThe boss of Greggs said there was \"no doubt\" hugely popular appetite suppressing drugs have led to people look",
    "body": "9 hours agoFaarea MasudBusiness reporterThe boss of Greggs said there was \"no doubt\" hugely popular appetite suppressing drugs have led to people looking for \"smaller portions\", affecting the company's bottom line.People are also looking for \"protein and fibre\", and generally healthier options, Roisin Currie said, adding the bakery has been introducing products to tap into that market.Greggs has previously said peoples' dietary changes led it to move away from its usual fare of hearty and high-fat pasties, cakes and pastries.Currie's comments come as the firm reported lacklustre profits and a muted forecast for the coming year.Currie said there was a \"broader health trend\" emerging with people demanding more protein.The bakery chain said in July it would target customers on weight loss drugs by rolling out smaller portions and protein-rich products, after which it launched its egg-pot alongside its popular \"eggs at Greggs\" ad campaign.Currie said the firm had \"to make sure that we've got some of the snack products that customers are looking for if they are on any of the GLP-1 drugs\".Several firms have said customers appetites are changing as a result of weight loss drugs.Tesco said on Thursday a trend towards healthier eating had contributed to growth in its fresh produce sales.Chief executive Ken Murphy said the group was watching customer habits \"very closely\" alongside the rise in weight loss medication and said the supermarket had a range of \"GLP-1 friendly\" products.\"Clearly our strongest source of growth this year has been in fresh food, and that is, by far and away, the best thing people can eat,\" he said. \"We also have a ... range of high protein products across a number of different categories that also work very well in that context. So I think we're well set to respond to any trends in healthier eating.\"Consumer analyst Clive Black, from Shore Capital, said the slight dip in the volume of groceries sold over Christmas compared with the year before was \"perhaps the clearest indication of the impact of glucagon-peptide (GLP) drugs upon the nation's eating habits?\"The effects of \"shrinkflation\" are also to blame for smaller portions, as firms reduce the size of a product but keep the price the same in order to manage the rising cost of ingredients.Recently, a ban came in to force across the UK banning adverts for junk foods before 9pm, which the government said was to help stem rising rates of obesity.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Weight loss jabs affecting Greggs, boss says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/58ef/live/a912a7e0-eca0-11f0-be98-fd0ce9c3379d.jpg"
      ],
      "datePublished": "2026-01-08T15:38:19.000Z",
      "dateModified": "2026-01-08T15:38:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sickness aboard ISS leads Nasa to consider bringing crew home",
    "url": "https://www.bbc.com/news/articles/cx2l9perw68o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80f7/live/1a26ae70-ec8a-11f0-9eec-7d519643d981.jpg",
    "tag": "Trending",
    "date": "2026-01-08T13:09:17.000Z",
    "description": "Nasa considers whether to bring sick crew member back to Earth12 hours agoPallab GhoshScience correspondentNASAFront row, from left: Pilot Mike Fincke",
    "body": "Nasa considers whether to bring sick crew member back to Earth12 hours agoPallab GhoshScience correspondentNASAFront row, from left: Pilot Mike Fincke and Commander Zena Cardman, back from left: Mission Specialists Oleg Platonov and Kimiya Yui of the Japanese space agency JAXANasa is considering an early return of some crew aboard the International Space Station (ISS) because of a medical issue involving one member of a four-strong team.The unnamed crew member is described as stable, but the incident has already led to the last-minute cancellation of a spacewalk.Mission managers are now weighing whether the safest option is to bring the entire Crew 11 team back to Earth a month ahead of schedule. Three members of another crew would remain aboard.\"Safely conducting our missions is our highest priority, and we are actively evaluating all options, including the possibility of an earlier end to Crew 11's mission,\" said a Nasa spokeswoman.On Wednesday, Nasa abruptly cancelled a spacewalk due to take place on Thursday, when two astronauts were set to step outside the ISS and announced that it was because one of the crew was unwell.\"The agency is monitoring a medical concern with a crew member that arose Wednesday afternoon aboard the orbital complex.\"Due to medical privacy, it is not appropriate for Nasa to share more details about the crew member,\" the space agency said.Nasa is likely to be determining whether the astronaut can safely remain in orbit or should come home early with their crewmates.\"Our top priority is the safe execution of our missions, and we are thoroughly assessing all possibilities, including the option of concluding Crew 11's mission ahead of schedule,\" the spokeswoman added.The four person Crew-11 team consists of Nasa astronauts Zena Cardman and Mike Fincke, Japan's Kimiya Yui from the JAXA space agency, and a Russian cosmonaut, Oleg Platonov. They launched to the ISS in August 2025 on a SpaceX Crew Dragon and were expected to remain in orbit for about six months and return around late February 2026, after being replaced by another four person crew a few days earlier. If Crew 11 leave together, the other crew on board would remain: Nasa astronaut Chris Williams and two Russian cosmonauts, Sergey Kud Sverchkov and Sergei Mikayev.NASAThe ISS orbits Earth at an average height of about 400 km (250 miles) above the surfaceIf the mission were to end early, all four astronauts on Crew-11 would be brought home, according to Simeon Barber, a space scientist at the Open University.\"They would all come back together as a team, because you don't want to leave one or more team member behind.\"The ISS has basic medical equipment, supplies and communication systems that let doctors on Earth talk privately to astronauts in space, assess their condition and advise treatment, much like a secure video or phone consultation with a GP.Returning the four-person crew early would delay some experiments and maintenance tasks until the new crew arrive, according to Dr Barber.\"The space station is a big, complex feat of engineering, it's designed to be operated by a certain minimum level of crew,\" he said.\"If Crew-11 were to return early, what the remaining crew would have to do is dial back on some of the more experimental work and focus more just on the housekeeping and keeping the station healthy, waiting for the full complement of crew to be restored.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sickness aboard ISS leads Nasa to consider bringing crew home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/80f7/live/1a26ae70-ec8a-11f0-9eec-7d519643d981.jpg"
      ],
      "datePublished": "2026-01-08T13:09:17.000Z",
      "dateModified": "2026-01-08T13:09:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More businesses call to be included in pub rates backtrack",
    "url": "https://www.bbc.com/news/articles/cp80l2ndz5yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/57e2/live/76aca550-ece4-11f0-bef6-d3a75ab8dbff.jpg",
    "tag": "Trending",
    "date": "2026-01-09T00:16:29.000Z",
    "description": "53 minutes agoEmer MoreauBusiness reporterHigh street shops, pharmacies and music venues have called on Rachel Reeves to axe the looming increases to ",
    "body": "53 minutes agoEmer MoreauBusiness reporterHigh street shops, pharmacies and music venues have called on Rachel Reeves to axe the looming increases to business rates for them as well as pubs.The government is expected to announce a climbdown on the increases to business rates bills faced by pubs in England in the coming days.Landlords and pub owners have been fiercely critical of the impending hikes, with more than 1,000 pubs banning Labour MPs from their premises.But other lobby groups and backbench MPs have urged the government to widen the relief, saying many other kinds of businesses will not be able to pay the higher bills.In her November Budget, the chancellor scaled back business rate discounts that have been in force since the pandemic from 75% to 40%, and announced that there would be no discount at all from April.That, combined with big upward adjustments to rateable values of pub premises, left landlords facing the prospect of much higher bills.The BBC understands the climbdown will apply only to pubs and not the whole hospitality sector.The British Independent Retailers Association (Bira) questioned why its members -– which include high street shops, restaurants and cafes — would not be given the same relief. Its chief executive Andrew Goodacre said independent retailers \"face exactly the same challenges as pubs but have been left out of discussions about additional support\".\"Perhaps independent retailers need to follow the pubs' example and start banning MPs from their premises too,\" he said.The British Retail Consortium (BRC) said the current business rates system \"is not fit for purpose\".Helen Dickinson, the BRC's chief executive, said: \"This latest announcement looks like another sticking plaster on a broken system rather than the more fundamental reform required.\"Jon Collins, chief executive of music venue body LIVE, said: \"If the government is preparing a U-turn on business rates for pubs, it must not leave live events and arenas behind.\"The National Pharmacy Association chief executive Henry Gregg said the sector could face a 140% increase in rates, while the lobby group for gyms, pools and leisure centres said those businesses faced potential rate increases of 60%.\"Failure to provide a business rates support package to gyms, pools and leisure centres will lead to higher prices, reduced services, redundancies and in some cases the loss of gyms from our communities,\" chief executive of ukactive Huw Edwards said.Some of those lobby group concerns were echoed by MPs.\"Venues, clubs and cinemas up and down the country are already struggling for survival,\" Conservative MP Dame Caroline Dinenage wrote to the chancellor on Thursday.She said the planned rates reforms risk \"pushing many over the edge\".\"The Treasury needs to be open about how it decided on the changes, while the sector desperately needs more details on the alternative support promised by the Prime Minister.\"Reeves said earlier this week that the government had reduced the rate of tax on pubs and hospitality, but the Independent Valuation Office increased what they saw as the value of those properties.\"Now we're working with the sector to look at the implications of a range of policies and looking at planning and licensing,\" she said in an interview with Good Morning Britain. \"I want to support our pubs; I want to support our high streets. That's why we made the change to the rates. But I recognise that many paths are still struggling and we're working with them.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More businesses call to be included in pub rates backtrack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/57e2/live/76aca550-ece4-11f0-bef6-d3a75ab8dbff.jpg"
      ],
      "datePublished": "2026-01-09T00:16:29.000Z",
      "dateModified": "2026-01-09T00:16:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hajar Abdelkader: Wildcard serves 20 doubles faults and loses match in 37 minutes",
    "url": "https://www.bbc.com/sport/tennis/articles/cx2gr00ndmyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/775d/live/2589b140-ecb2-11f0-9d80-bdb3e01a6d27.png",
    "tag": "Trending",
    "date": "2026-01-08T16:28:22.000Z",
    "description": "Tournament chiefs admit errors over viral wildcard Image source, ITFImage caption, Hajar Abdelkader's biography on the ITF website says she started pl",
    "body": "Tournament chiefs admit errors over viral wildcard Image source, ITFImage caption, Hajar Abdelkader's biography on the ITF website says she started playing tennis at the age of 14ByStewart MacleanBBC News, in NairobiThe organisers of a professional women's tournament which has gone viral on social media because of a wildcard player's dire performance have acknowledged she should not have been allowed to play.Egyptian Hajar Abdelkader, 21, lost 6-0 6-0 and served 20 double faults during the first-round match in Nairobi on Wednesday, with the footage leaving many viewers wondering if she had ever played tennis before.The amateur player won only three points during her 37-minute debut - two double faults by opponent Lorena Schaedel and an unforced error from the bemused German, ranked 1,026th in the world.The match was part of an International Tennis Federation (ITF) W35 tournament, hosted by Tennis Kenya, the governing body for the sport in Kenya.Tennis Kenya said it had reached out to both Abdelkader and Schaedel to offer its support \"given the extent and nature of coverage of this match\". Tennis Kenya said Abdelkader had applied to enter the tournament as a wildcard and had been given a space at the last minute following the withdrawal of another player.The organisation said she was permitted to enter to maintain a balance of players and nations represented in the tournament, but said that in hindsight she should not have been allowed to play.\"The federation has taken note of this experience and will ensure that such an extremely rare occurrence never happens again,\" the organisation added. \"Tennis Kenya remains committed to fairness, transparency and the integrity of competition, as well as to the continued development of tennis in Kenya, East Africa, and across Africa.\" The Egyptian Tennis Federation confirmed to the BBC Abdelkader has never been registered as an Egyptian player and had not been entered into the tournament on Egypt's behalf.Egyptian Tennis Federation technical director Dia Nabil Loutfy said: \"We would like to clarify that she is not registered with the Egyptian Tennis Federation, nor is she included in any of our official player lists.\"Based on the information available to us, the player was previously residing in Kenya and participated in the ITF tournament in Nairobi through a wildcard granted by the Kenyan Tennis Federation.\"The Egyptian Tennis Federation had no role whatsoever, whether directly or indirectly, in the nomination, approval, or issuance of this wildcard, and we were not involved in the player's entry into the tournament in any capacity.\"The organisation said it had no records relating to Abdelkader, and said she had never been affiliated with the Egyptian Tennis Federation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hajar Abdelkader: Wildcard serves 20 doubles faults and loses match in 37 minutes",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/775d/live/2589b140-ecb2-11f0-9d80-bdb3e01a6d27.png"
      ],
      "datePublished": "2026-01-08T16:28:22.000Z",
      "dateModified": "2026-01-08T16:28:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government to water down business rate rise for pubs",
    "url": "https://www.bbc.com/news/articles/c8e57dexly1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a884/live/66568f80-ec90-11f0-abc2-c92f19f0499a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T19:10:16.000Z",
    "description": "6 hours agoSimon Jack,BBC Business EditorandLucy Hooker,Business reporterGetty ImagesA climbdown on forthcoming increases to the business rates bills ",
    "body": "6 hours agoSimon Jack,BBC Business EditorandLucy Hooker,Business reporterGetty ImagesA climbdown on forthcoming increases to the business rates bills faced by pubs in England is set to be announced by the government in the next few days.The government is expected to say it will make changes to how pubs' business rates are calculated, resulting in smaller rises to bills.Treasury officials say they have recognised the financial difficulties facing many pubs after sharp rises in the rateable value of their premises.The move follows pressure from landlords and industry groups that included more than 1,000 pubs banning Labour MPs from their premises.The BBC understands it will apply only to pubs and not the whole hospitality sector.The Treasury is also thought to be ready to relax licensing rules to allow longer opening and more pavement areas for drinking.In her November Budget, Chancellor Rachel Reeves scaled back business rate discounts that have been in force since the pandemic from 75% to 40% - and announced that there would be no discount at all from April.That, combined with big upward adjustments to rateable values of pub premises, left landlords with the prospect of much higher rates bills.A campaign to dilute the impact of these rises has been gaining traction in recent weeks, with pub owners and industry groups lobbying for more support.Conversations between the government and the hospitality sector were \"ongoing\", DWP minister Dame Diana Johnson said.Speaking to Radio 4's PM programme, she said: \"We as a government want to make business rates fairer but you'll also know we're coming to the end of the transitional relief that was available because of Covid.\"On Wednesday Labour MPs called on the government to rethink its support for the industry.Conservative leader Kemi Badenoch said: \"What has happened is that over Christmas Labour MPs were banned from every single pub they tried to get into... so now they are pushing for a U-turn.\"She said the Conservatives had a \"much better plan\" which was to \"slash business rates for all of the High Street, not just pubs\". She said business rates bills of less than £110,000 would be scrapped completely.Reform also welcomed the climbdown, saying \"pubs have already been lumbered with astronomical energy costs\".The party's deputy leader Richard Tice said: \"Pubs are the backbone of our communities and a huge part of British heritage. Their closures would be a cultural catastrophe as much as an economic one.\"To calculate a pub's business rate bill the rateable value of its premises is multiplied by a set figure: \"the multiplier\".The government had already offered some relief by reducing the multiplier for pubs, and may be about to reduce it further.Alternatively they could boost the £4.3bn \"transitional relief\" fund brought in to ease the impact of withdrawing support following the pandemic.Geoff RobbinsGeoff Robbins, who owns the Wheatsheaf Pub in Faringdon, Oxfordshire with his wife Jo, said it was \"a great relief\" that more help was on the way.His rates are due to rise by around 80% over the next three years. He needs a discount on most of that, he reckons, after factoring in higher gas, electricity and staffing costs.\"Rates are a tax against your business whether you make a profit or loss...  you've got to pay, there's no way round it,\" said Geoff, who got in touch with BBC Your Voice.Industry groups also welcomed news there would be additional help.Emma McClarkin, chief executive of the British Beer and Pub Association, said it was \"potentially a huge win\" for the sector.\"This could save locals, jobs, and means publicans can breathe a huge sigh of relief,\" she said.Kate Nicholls, chair of UK Hospitality, representing the industry, said the support should apply not just to pubs, but to all hospitality businesses affected by rising rates, including cafés and restaurants.\"We need a hospitality-wide solution, which is why the government should implement the maximum possible 20p discount to the multiplier for all hospitality properties,\" she said.Other sectors are calling for the support to be even broader, to include live music venues, theatres, galleries, gyms and retailers.Unpicking the recent Budget would be seen by many as another U-turn following climbdowns on winter fuel payments, disability benefits and inheritance tax on farms and family businesses.Shadow business and trade secretary Andrew Griffith said the change showed Rachel Reeves' Budget was \"falling apart\".\"Labour were wrong to attack pubs and now have been forced into another screeching U-turn,\" he said.Liberal Democrat Treasury spokesperson Daisy Cooper said: \"This is literally the last chance saloon for our treasured pubs and high streets - so the government must U-turn, today.\"These businesses are worried sick, making decisions now, and can't wait a minute longer.\"The calculation of business rates is an issue that is devolved in all four UK nations.The discount on rates during the pandemic only applied to hospitality businesses in England.Scottish businesses are waiting for the Budget there next week to hear how the  Edinburgh government will approach the issue.Pubs there will hope the Scottish government follows the UK government in offering some relief.Additional reporting by Kris Bramwell",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government to water down business rate rise for pubs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a884/live/66568f80-ec90-11f0-abc2-c92f19f0499a.jpg"
      ],
      "datePublished": "2026-01-08T19:10:16.000Z",
      "dateModified": "2026-01-08T19:10:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peers back calls for more time to debate assisted dying bill",
    "url": "https://www.bbc.com/news/articles/c4gr08x0erxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fdbf/live/9a589f50-eccf-11f0-a921-b5325c652f4b.jpg",
    "tag": "Trending",
    "date": "2026-01-08T21:08:10.000Z",
    "description": "4 hours agoBecky MortonPolitical reporterPeers have backed calls for extra time for the House of Lords to debate the assisted dying bill.The proposal ",
    "body": "4 hours agoBecky MortonPolitical reporterPeers have backed calls for extra time for the House of Lords to debate the assisted dying bill.The proposal was put forward by supporters, who are increasingly concerned it could run out of time to pass all its parliamentary stages.However, some opponents argued the bill was unsafe and suggested even more time to debate the legislation could not transform it.It has been approved by MPs but must also pass the Lords before early May, when the current session of Parliament is expected to end, to become law.There will now be private negotiations between peers over when and how much extra time should be granted.Extending debates already scheduled on Fridays is one likely option but sitting later would anger some Jewish peers because the weekly religious Shabbat ceremony begins at sunset.Peers have already been given 10 extra sessions to debate the legislation but with more than 1,000 amendments proposed there is a risk it will not pass all its parliamentary stages in time.Supporters of assisted dying have raised concerns that the number of amendments put forward - which experts believe is a record for a bill proposed by a backbench MP - is a delaying tactic aimed at blocking the bill from becoming law.Opponents insist they are not obstructing the bill but believe significant changes are needed to make it safe and to protect vulnerable people.The legislation proposes allowing terminally ill adults in England and Wales with fewer than six months to live to apply for an assisted death, subject to certain safeguards.Lord Falconer, who is leading the bill's passage through the upper chamber, put forward the proposal for extra time to allow peers to consider the legislation.Speaking during a debate on the motion, which passed without a vote, he warned that if peers failed to reach a conclusion \"it would significantly damage the reputation\" of the House of Lords.Former Lord Justice of Appeal Baroness Butler-Sloss also warned the reputation of the House was \"at stake\"Supporting the proposals for more time, she told peers: \"I don't like the Bill, but we have it, and we have to deal with it.\"However, Conservative peer Lord Shinkwin, who has rare brittle bone disease osteogenesis imperfecta, argued that peers had already \"been generous with our time\".\"We can only ever work with what we have been given, the volume of amendments, and the time taken to consider them, therefore, reflect the quality or lack thereof of the bill that was sent to us,\" he said.\"If any bill is so poorly drafted and so unsafe, surely the question is not so much whether the bill deserves more time as whether yet more time could transform it.\"A source close to peers concerned about the bill said: \"Supporters of assisted dying seem determined to keep complaining about the process in the Lords rather than engaging with significant failings in the bill.\"They added that the motion was not accompanied by \"any acknowledgement of the scale of the problems identified by Lords committees and external experts or of what amendments Lord Falconer is willing to accept to address those problems\".The government's chief whip in the Lords, Lord Kennedy, said he would look to hold \"urgent discussions\" early next week \"to seek to find a way forward to deliver on what the House has just agreed\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peers back calls for more time to debate assisted dying bill",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fdbf/live/9a589f50-eccf-11f0-a921-b5325c652f4b.jpg"
      ],
      "datePublished": "2026-01-08T21:08:10.000Z",
      "dateModified": "2026-01-08T21:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In pictures: Protests in US after Renee Nicole Good shot dead by ICE agent",
    "url": "https://www.bbc.com/news/articles/c3wz1ewg6dlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3348/live/0503f090-ec92-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T14:15:02.000Z",
    "description": "In pictures: Protests held in US cities after woman shot dead by immigration agent11 hours agoKerena CobbinaEPAProtests and a vigil have been held in ",
    "body": "In pictures: Protests held in US cities after woman shot dead by immigration agent11 hours agoKerena CobbinaEPAProtests and a vigil have been held in Minneapolis, Minnesota, where the shooting of Renee Nicole Good occurred on WednesdayProtests have taken place in multiple US cities after a woman was shot dead by a federal immigration officer in Minneapolis.Federal officials said Renee Nicole Good, 37, had tried to run over immigration agents with her car and that the officer had been acting in self defence.The city's mayor, however, said the agent who shot her had acted recklessly, with other local officials saying Good had simply been \"caring for her neighbours\" when she was shot at close range.Hundreds of Immigration and Customs Enforcement (ICE) agents have been deployed to Minneapolis, in the state of Minnesota, as part of the Trump administration's crackdown on illegal immigration. Officers have also been deployed to other cities across the US.Follow updates on this storyBloomberg via Getty ImagesThe Minneapolis vigil was held on Wednesday evening, where hundreds gathered at the site including a group of clergy who sang hymns, the Minneapolis Star-Tribune reportsAFP via Getty ImagesIn Minneapolis, protesters took to the streets in anger over the shootingEPAThe shooting comes after the US government deployed an additional 2,000 federal agents to the Minneapolis area in response to allegations of welfare fraud in the stateEPAProtests against ICE spread to other cities in the US, including New York CityEPAThe mass deployment of immigration officers to several US cities has become a focus of controversy in the USEast Bay Times Via Getty Images People also gathered in Oakland, California following the shooting in MinneapolisEast Bay Times via Getty ImagesUS President Donald Trump and Homeland Security Secretary Kristi Noem have defended the officer's actionsAnadolu via Getty ImagesHundreds turned out in Chicago, where protests against ICE have become a daily occurrenceAnadolu via Getty ImagesTackling undocumented migration, including by increasing deportations, was a key pledge during Trump's re-election campaign",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In pictures: Protests in US after Renee Nicole Good shot dead by ICE agent",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3348/live/0503f090-ec92-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T14:15:02.000Z",
      "dateModified": "2026-01-08T14:15:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abandoned baby Elsa to be adopted and regularly see two siblings, court orders",
    "url": "https://www.bbc.com/news/articles/cd740vpwx4go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/78b5/live/e147bb30-ecac-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T13:19:55.000Z",
    "description": "12 hours agoSanchia BergBBC NewsPA MediaHarry (left) and Roman (right) were abandoned as newborns years before ElsaA girl who was found abandoned as a",
    "body": "12 hours agoSanchia BergBBC NewsPA MediaHarry (left) and Roman (right) were abandoned as newborns years before ElsaA girl who was found abandoned as a newborn in a carrier bag in east London is to be adopted and will have regular contact with her two siblings as she grows up, a family court has heard.\"Elsa\" was left near a footpath in Newham on 18 January 2024, before being discovered by a dog walker. Subsequent DNA tests established she was the sibling of two other babies - a boy and a girl - each found nearby in similar circumstances in 2017 and 2019.Police say all enquiries to find the parents of the abandoned babies have now been \"exhausted\".On Thursday, East London Family Court heard Elsa was thriving, that she was already living with her new family, and has a loving relationship with them.All their adoptive parents have agreed that Elsa who is now nearly two, brother Harry, 8 and sister Roman, 6 should have regular meetings as they grow up. The children will see photos of each other, and have playdates twice a year.Judge Carol Atkinson said Elsa's story was \"extraordinary\" and it was \"fundamental to her existence that she shares that story with two full siblings\". She said she had seen photos of Elsa, who was a \"beautiful little girl\" - \"a raucous bundle of excitement and laughter\".The judge said had been told Elsa \"lights up the space around her\", adding that the three children's shared story was exceptional. Over ten years, between 2008–2018, only eight children were recorded as \"foundlings\" - those abandoned at birth - in England and Wales.She said the siblings shared something \"extraordinary\", adding: \"No-one they will meet in life is likely to understand what it is like to be a foundling. But they each know and understand.\"The three babies were all found near the Greenway in east LondonThe BBC has been following the hearings about baby Elsa for nearly two years.Elsa was left in a Boots shopping bag in January 2024, when she was less than an hour old.She was found on the coldest night of the year, so hospital staff named her after the character in the Disney film Frozen. In June 2024, the BBC revealed she was the third child abandoned by the same mother and father. Her name and those of her siblings have now been changed.After widespread media coverage, police stepped up their enquiries to find her parents.Working with the National Crime Agency, officers identified several hundred houses where they believed babies' parents might have been living. They knocked on more than 100 doors, spoke to local residents and took DNA samples.They also used the babies' DNA to try to identify relatives right across the UK, who they traced and spoke to.But despite these efforts, police have said the parents have still not been found.Det Supt Lewis Basford said enquiries were \"exhausted\" but officers would \"continue to review all information and intelligence made available to us\".He urged anyone who \"may be sitting on information\" to contact the police.PABaby Elsa was found inside a Boots bag on the Greenway, in Newham, east LondonProf Lorraine Sherr, a psychologist who has studied abandoned children, said Thursday's hearing was a \"turning point\" for Elsa. She said she now had a stable and permanent home, and the \"rare\" possibility of early and regular contact with her siblings.Sherr said the case marked a \"true precedent\" - that the courts, families, police and social services came together to support the child's best interests. She added that the \"intense public and media coverage ensured that processes worked smoothly\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abandoned baby Elsa to be adopted and regularly see two siblings, court orders",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/78b5/live/e147bb30-ecac-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T13:19:55.000Z",
      "dateModified": "2026-01-08T13:19:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renee Nicole Good: Who was the woman killed by ICE in Minneapolis?",
    "url": "https://www.bbc.com/news/articles/c1jepdjy256o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9bd7/live/0df09270-ec89-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-08T15:48:37.000Z",
    "description": "9 hours agoTiffany WertheimerRenee Nicole GoodRenee Nicole Good was an award-winning poetThe woman shot dead by a federal immigration agent in Minneap",
    "body": "9 hours agoTiffany WertheimerRenee Nicole GoodRenee Nicole Good was an award-winning poetThe woman shot dead by a federal immigration agent in Minneapolis has been identified as Renee Nicole Good, a 37-year-old mother of three who had just moved to the city.She was a prize-winning poet and a hobby guitarist, who city leaders have said was there as a legal observer of Immigration and Customs Enforcement (ICE) activities.But the Trump administration has called her a \"domestic terrorist\".Good's death has sparked protests across the country, with many people holding signs that read \"Justice for Renee\".Her mother, Donna Ganger, told the Minnesota Star Tribune that her daughter was \"probably terrified\" during the confrontation with officers that saw her fatally shot and that she was \"one of the kindest people I've ever known\".\"She was extremely compassionate,\" Ganger told the daily newspaper. \"She's taken care of people all her life. She was loving, forgiving and affectionate. She was an amazing human being.\"Her father, Tim Ganger, told the Washington Post that \"she had a good life, but a hard life\".A fundraiser for Good's family, which was set up with a target of $50,000 (£37,000), raised more than $500,000 in 15 hours.In what appears to be Good's Instagram account, which has now been made private, Good described herself as a \"poet and writer and wife and mom\", who was \"experiencing Minneapolis\".A US citizen, Good was originally from Colorado Springs and had moved to Minneapolis just last year from Kansas City.The Minnesota Star Tribune reports that she used to host a podcast with her second husband, Tim Macklin, who died in 2023. They had a son together, who is now six years old, Macklin's father told the newspaper. She had two other children with her first husband, who spoke to US media on condition that his name was not used. He said that Good was not an activist and that she was a devoted Christian who went to Northern Ireland on youth missions when she was younger.She had previously worked as a dental assistant and at a credit union, but had mainly been a stay-at-home mum in recent years, according to the Associated Press.Getty ImagesPeople have left flowers, candles and messages at a make-shift memorial for Good in MinneapolisGood studied creative writing at Old Dominion University in Norfolk, Virginia, and in 2020 she won an undergraduate prize from the Academy of American Poets for her piece entitled On Learning to Dissect Fetal Pigs.\"When she is not writing, reading, or talking about writing, she has movie marathons and makes messy art with her daughter and two sons,\" her biography from the prize reads, as quoted in US media. It seems to have now been removed.Good graduated the same year from the university's College of Arts and Letters with a degree in English.Its president said in a statement that her sudden death was \"yet another clear example that fear and violence have sadly become commonplace in our nation\".\"May Renee's life be a reminder of what unites us: freedom, love, and peace,\" Old Dominion University president Brian Hemphill wrote.Several state leaders have said that Good was at the scene of an ICE raid in the south of Minneapolis as a legal observer - a volunteer who monitors police and security forces at protests and operations. Good's mother told the Minnesota Star Tribune that her daughter was \"not part of anything\" that involved challenging ICE agents.But White House officials, including the president, have said Good was not simply observing, but also interfering in the officers' work.US Homeland Security Secretary Kristi Noem said Good had been \"stalking and impeding their work\" all day by \"blocking them in\" with her car and \"shouting at them\".Good \"weaponised her vehicle\", Noem told reporters, and then tried to run over one of the officers \"in an attempt to kill or cause bodily harm to agents, an act of domestic terrorism\".The ICE agent feared for his life, Noem said, and \"fired defensive shots\".This account was backed up by Trump, who wrote on Truth Social that \"the woman driving the car was very disorderly, obstructing and resisting\".He called her a \"professional agitator\" who \"violently, willfully, and viciously\" ran over an ICE officer.But the city's mayor said the agent who shot Good had acted recklessly.\"Having seen the video myself, I want to tell everybody directly: that is bullshit,\" Jacob Frey said. \"This was an agent recklessly using power that resulted in somebody dying, getting killed.\"Good reportedly lived just a few blocks from where she was killed, and the scene is about one mile from where George Floyd was murdered in 2020 by a city police officer, sparking worldwide anti-racism protests.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renee Nicole Good: Who was the woman killed by ICE in Minneapolis?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9bd7/live/0df09270-ec89-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-08T15:48:37.000Z",
      "dateModified": "2026-01-08T15:48:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]