[
  {
    "title": "Today - Jeremy Bowen: Chances of peace in the Middle East - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m8x1q0?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0m8x4y4.jpg",
    "tag": "Trending",
    "date": "2025-10-16T10:01:37.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·10 minsJeremy Bowen: Chances of peace in the Middle EastTodayAvailable for over a yearReports suggest aid trucks are being stalled at Gaza's border due to the failure of Hamas to return the remaining bodies of hostages.\nTom Fletcher, the UN's humanitarian chief, has urged both ISrael and Hamas to work sides to get the border open, saying it is “essential for our work and we’re asking that all the crossings reopen so that we can better scale up and get thousands of trucks into Gaza every week and start to turn this situation around.\"\nThis latest impasse is one in a long line of moments where hope of peace seems incredibly fragile - and the gap between the two sides as great as ever. \nThat long history is something that International Editor Jeremy Bowen has been reflecting on.\nListen to Today on BBC Radio 4 and BBC Sounds: 6-9am on weekdays and 7-9am on Saturdays.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Today - Jeremy Bowen: Chances of peace in the Middle East - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0m8x4y4.jpg"
      ],
      "datePublished": "2025-10-16T10:01:37.000Z",
      "dateModified": "2025-10-16T10:01:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Collapsed China Spy Case - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m8ty1s?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-15T22:36:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·15 Oct 2025,·36 minsAvailable for over a yearToday, the government has  published witness statements related to a collapsed case against two people accused of spying for China. They deny all of the allegations against them.\nEarlier in the day, the Prime Minister was questioned by Kemi Badenoch, who accused the government of “a cover-up”. Starmer pointed to the fact the Conservatives were in power during the period concerning the case. Adam and Chris discuss what’s in the statement, and what this means for the Prime Minister.\nPlus, The Climate Change Committee has sent a letter to the Parliamentary Under-Secretary of State saying the UK should have contingency plans in case the UK sees 2C of global warming by 2050. Adam speaks to Emma Pinchbeck, CEO of the Climate Change Committee.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Rufus Gray with Anna Harris and Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Gareth Jones. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Collapsed China Spy Case - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-15T22:36:00.000Z",
      "dateModified": "2025-10-15T22:36:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-16T05:18:41.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-16T05:18:41.000Z",
      "dateModified": "2025-10-16T05:18:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saltend: Major UK rare earths refinery scrapped in favour of US",
    "url": "https://www.bbc.com/news/articles/czxnv7y03nno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9c79/live/6105cc50-aa9e-11f0-80a3-d7eda8235a25.jpg",
    "tag": "Trending",
    "date": "2025-10-16T15:32:05.000Z",
    "description": "44 minutes agoTheo LeggettBusiness correspondentPlans for a groundbreaking rare earths refinery in East Yorkshire have been abandoned, after the compa",
    "body": "44 minutes agoTheo LeggettBusiness correspondentPlans for a groundbreaking rare earths refinery in East Yorkshire have been abandoned, after the company behind the project decided to seek investment in the United States instead.Pensana has spent the past seven years developing a rare earths mine in Angola. The $268m (£185m) project, one of the largest of its kind in the world, will begin delivering raw materials in 2027.The company had planned to build a refinery at the Saltend Chemicals Plant near Hull, which would have processed the raw materials into metals used to create powerful magnets.These magnets would then be used in high-tech applications such as motors for electric vehicles, wind turbines and robotics.The project would have given the UK a strategic foothold in the rare earths industry, which is currently dominated by China. However, as first reported by Sky News, the plan has now been dropped.Despite what the name implies, rare earths are actually relatively common. The term is used to describe a group of chemically similar minerals which are abundant in the Earth's crust – but which are also comparatively difficult and costly to extract.However, according to Pensana, China has in recent years used its market power to keep prices artificially low in order to stifle potential competition – and this has made refining in the UK uneconomic without significant government support.Speaking to reporters on Thursday at a meeting of the International Monetary Fund, Chancellor Rachel Reeves was asked about growing tension between the US and China over rare earths. The chancellor said she was working with G7 counterparts \"on our own critical minerals strategy, so that we are less reliant\".In 2022, Boris Johnson's announced plans for \"a multi-million pound investment\" in the Saltend project - launched alongside the then Tory government's 'Critical Minerals Strategy'. However, according to Pensana's founder and chairman, Paul Atherley, this contribution – actually £5m - was \"nowhere near enough\", and the Treasury proved unwilling to contribute more.Mr Atherley compares this with a deal between the US government and MP Materials, under which MP will benefit from more than half a billion dollars worth of investment and soft loans to fund a similar facility in California, as well as a 10-year agreement to ensure all the magnets it produces are sold for a minimum price.Earlier this year Pensana announced plans to team up with the US refiner ReElement, to develop a \"sustainable, independent rare earth supply chain\". It is also planning to list its shares on the Nasdaq stock exchange.Mr Atherley insists he remains \"very positive on the UK\". Another company he is involved in, Tees Valley Lithium, is pushing ahead with plans for a lithium refinery in the Northeast.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saltend: Major UK rare earths refinery scrapped in favour of US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9c79/live/6105cc50-aa9e-11f0-80a3-d7eda8235a25.jpg"
      ],
      "datePublished": "2025-10-16T15:32:05.000Z",
      "dateModified": "2025-10-16T15:32:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Decision on China mega embassy site in London delayed again",
    "url": "https://www.bbc.com/news/articles/cr7mn28drz8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0c1c/live/d4030dd0-aa9e-11f0-80a3-d7eda8235a25.png",
    "tag": "Trending",
    "date": "2025-10-16T15:37:06.000Z",
    "description": "39 minutes agoDamian GrammaticasPolitical correspondent andPaul SeddonPolitical reporterGetty ImagesThe proposed new embassy at Royal Mint Court would",
    "body": "39 minutes agoDamian GrammaticasPolitical correspondent andPaul SeddonPolitical reporterGetty ImagesThe proposed new embassy at Royal Mint Court would be the biggest in Europe if it goes aheadA decision on whether to approve China's application for a new super-embassy in London has been delayed again by the government.Housing Secretary Steve Reed had been due to rule on the application by 21 October, but the deadline has been pushed back to 10 December.It is the second time the government has delayed a decision on the controversial site, whose location has sparked concerns it could pose an espionage risk.A ruling had originally been due by 9 September after ministers took control of the process from Tower Hamlets, the local council, last year. The government's first delay was requested by Reed's predecessor Angela Rayner, following a request for additional information from China about the plans.Reed, who took over the housing role following Rayner's resignation last month, has now requested additional time before a final decision needs to be made.In a letter seen by the BBC, the housing department said more time was needed due to the \"detailed nature\" of responses from groups involved in the consultation, including China, the Met police and a local residents' association.China bought the site of the proposed new embassy, at Royal Mint Court, near the Tower of London, for £255m in 2018. At 20,000 square metres, the proposed complex would be the biggest embassy in Europe if it goes ahead.BBC visited the location where China plans to put its mega-embassyThe pending decision on whether to approve the new embassy was already under close scrutiny because of concerns about the security implications of the plan, including the location, size and design of the building.The site is close to fibre optic cables carrying communications to and from financial institutions in the City of London. Concerns have been raised that Chinese operatives could use the site to tap into the cables and eavesdrop.Further questions have been raised in recent weeks about the nature of the threat posed by Beijing, following the collapse of the case against two men accused of spying for China.The Crown Prosecution Service (CPS) unexpectedly dropped charges against Christopher Cash and Christopher Berry last month, prompting criticism from ministers and MPs. Both men deny the allegations. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Decision on China mega embassy site in London delayed again",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0c1c/live/d4030dd0-aa9e-11f0-80a3-d7eda8235a25.png"
      ],
      "datePublished": "2025-10-16T15:37:06.000Z",
      "dateModified": "2025-10-16T15:37:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MI5 chief 'frustrated' over collapse of China spy case",
    "url": "https://www.bbc.com/news/articles/c0ex172rxwzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e5e5/live/61a91ac0-aaaa-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-16T15:24:39.000Z",
    "description": "51 minutes agoBrian WheelerPolitical reporter andJoshua NevettPolitical reporterPA MediaChinese state operatives present a daily national security thr",
    "body": "51 minutes agoBrian WheelerPolitical reporter andJoshua NevettPolitical reporterPA MediaChinese state operatives present a daily national security threat to the UK, the head of MI5 Sir Ken McCallum has said.In a speech, he said MI5 had intervened operationally to disrupt Chinese activity of national security concern in the past week.Addressing a row over the collapse of a case involving alleged spying on behalf of China in the UK, Sir Ken said the alleged activity was disrupted by MI5 and that it was \"frustrating when prosecutions fall through\".The government and the Crown Prosecution Service (CPS) are facing questions over the collapse of the case.The unanswered questions after release of China spy evidenceWhat was alleged against Christopher Cash and Christopher Berry in China spy case?Decision on China mega embassy site delayed againThe controversy over the collapsed China spy case explainedMI5 operating in new era of terror and state threats, says chiefThe CPS dropped the case last month after deciding the evidence did not show China was a threat to national security.But witness statements from the UK's deputy national security adviser Matthew Collins - published late on Wednesday - are clear that the Chinese are carrying out spying operations against the UK, raising questions for the government and the CPS about why the prosecutions did not go ahead.In the documents, he said China was carrying out \"large scale espionage\" against the UK and was \"the biggest state-based threat to the country's economic security\".Sir Ken described Mr Collins as a \"man of high integrity and a professional of considerable quality\".In his speech, Sir Ken said \"Chinese state actors\" presented a threat to UK national security but added that the \"overall balance\" of the UK's relationship with China  was \"a matter for the government\". \"When it comes to China, the UK needs to defend itself resolutely against threats and seize the opportunities that demonstrably serve our nation,\" he said.The Conservatives have accused the government of allowing the spy case to collapse to avoid jeopardising economic relations with China.Downing Street said it would have been \"absurd\" for the PM to step in last month after being told the case was going to collapse, stressing it was a \"criminal matter\" for the CPS to handle independently.In a letter to the prime minister, Conservative leader Kemi Badenoch said the events leave \"a strong impression that your government undermined Britain's national security because you are too weak to do anything other appease China\".In his reply, Sir Keir argued that the prosecution's case relied on the then Conservative government's policy towards China at the time of the alleged offences, between 2021 and 2023.\"In other words, the prosecution's case required demonstrating that the position of the then Conservative government was that China was an enemy of the United Kingdom,\" he said, and it was \"plainly wrong\" to suggest that had been the case.The head of the CPS Stephen Parkinson is also in the firing line, with MPs suggesting there was sufficient evidence to put the case before a jury.He is reported to have told senior MPs on Wednesday that the evidence was \"5%\" short of what would have been required to stand a chance of getting a conviction.The Conservatives have written to the CPS to ask what evidence it had wanted the government to provide. Labour MP Matt Western, who heads the Joint Committee on the National Security Strategy - made up of senior MPs and peers - said he was launching an inquiry into the collapse of the case. PA MediaChristopher Berry (left) and Christopher Cash (right) were both accused of spying for ChinaIn the first witness statement, sent in December 2023, Mr Collins outlines the case against former parliamentary researcher Christopher Cash, 30, and academic Christopher Berry, 33.The pair are accused of collaborating with a Chinese Communist Party leader who was deputy director of the Central National Security Commission, chaired by President Xi Jinping.In one message, Mr Cash is alleged to have told Mr Berry: \"You're in spy territory now.\" Both men deny any wrongdoing.The second witness statement, written by Mr Collins in February 2025, after Labour had taken power, said China's spying threatened \"the UK's economic prosperity and resilience\".A third witness statement published in August this year restated the UK's view of the challenge posed by China.But the two statements submitted under Labour made clear the government was \"committed to pursuing a positive economic relationship with China\".China's foreign ministry spokesperson Lin Jian said: \"China's position is very clear: we firmly oppose peddling China spy narratives and vilifying China.\"In a Commons debate, former Security Minister Tom Tugendhat, for whom Mr Cash was a parliamentary researcher, accused the government of being obsessed with following the correct process, rather than doing everything it could \"to make sure the prosecution works\".\"Who the hell's side are you on?\" he asked the government.In a statement released on Wednesday evening, Mr Cash said he had been placed in an \"impossible situation\" because he had not \"had the daylight of a public trial to show my innocence\".He added: \"The statements that have been made public are completely devoid of the context that would have been given at trial.\"In a separate statement, Mr Berry said: \"I pleaded not guilty to the charge, and I have been acquitted.\"My reports were provided to a Chinese company which I believed had clients wishing to develop trading links with the UK. \"Those reports contained no classified information… and drew on information freely in the public domain, together with political conjecture, much of which proved to be inaccurate.\"I do not accept that, in so doing, I was providing information to the Chinese Intelligence services.\"Tory MP Tom Tugendhat: \"Who the hell's side are you on?\"The third witness statement includes the words \"we will co-operate where we can, compete where we need to, and challenge where we must\".Conservative MP Alicia Kearns, who also previously employed Mr Cash as a parliamentary researcher, noted that the phrase was \"a direct lift\" from Labour's manifesto.\"It's very hard to believe there was no political interference,\" she added.\"In my view, the Crown Prosecution Service should have proceeded with this.\"The case law shows it's for a jury to decide if China is or could be a threat to our country.\"BBC News understands that Mr Collins assumed he had given enough evidence for the prosecution to continue when he submitted his third witness statement in August 2025.A government source pointed to comments made by him where he described \"the increasing Chinese espionage threat posed to the UK\" as an example of why he believed he had said enough to satisfy the CPS's threshold for prosecution.It is also understood that the CPS contacted Mr Collins after his first witness statement to ask for further clarification on the threat posed by China, but that they were not explicitly clear what the official would need to say in subsequent statements, in order to meet the CPS's threshold.The director of public prosecutions has said there was sufficient evidence when charges were originally brought but a precedent set by another spying case earlier this year meant China would need to have been labelled a \"threat to national security\" at the time of the alleged offences.Liberal Democrat foreign affairs spokesperson Calum Miller said the witness statements raised \"yet more unanswered questions\", adding: \"We clearly need a statutory public inquiry to get to the bottom of this whole fiasco.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MI5 chief 'frustrated' over collapse of China spy case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e5e5/live/61a91ac0-aaaa-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T15:24:39.000Z",
      "dateModified": "2025-10-16T15:24:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prominent Palestinian prisoner  Marwan Barghouti attacked by guards, family says",
    "url": "https://www.bbc.com/news/articles/cpwvr2xpkz0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/76cf/live/ad2d8f80-aa82-11f0-9334-19f2cf191969.jpg",
    "tag": "Trending",
    "date": "2025-10-16T12:08:47.000Z",
    "description": "The most prominent Palestinian prisoner, Marwan Barghouti, was beaten unconscious by Israeli prison guards on 14 September, his family has said.The 66",
    "body": "The most prominent Palestinian prisoner, Marwan Barghouti, was beaten unconscious by Israeli prison guards on 14 September, his family has said.The 66-year-old - serving life for planning deadly attacks against Israelis - was allegedly assaulted by eight guards during a transfer between Ganot and Megiddo prisons.The Israel Prison Service told the BBC: \"These are false claims (fake). The Israel Prison Service operates in accordance with the law, while ensuring the safety and health of all inmates\".Barghouti's son, Arab, told the BBC the family had received testimony from five separate detainees who were released this week who heard Barghouti's account of the attack. He said the family was \"horrified\".Barghouti was allegedly handcuffed by the guards, put on the floor, kicked and beaten.\"They focused on the head area, they focused on the chest area and also on the legs,\" he said. \"He stayed unconscious for hours, he was bleeding, and he could hardly walk.\"Arab said he believed the attack took place as his father was transferred between the two prisons, which are in southern and northern Israel, because there were no surveillance cameras to capture it.Barghouti is serving five life sentences plus 40 years after being convicted by an Israeli court in 2004 of planning attacks in which five civilians were killed.The detainees who told the family of the attack had been released as part of Monday's hostage and prisoner exchange between Israel and Hamas, Arab said. Barghouti's name was at the top of a list of seven high-profile prisoners whose release Hamas had sought in return for the 20 living Israeli hostages the group was holding in Gaza - but Israel refused to include him.He is seen by many as the one man who could unite Palestinians - and the various Palestinian political factions - across both Gaza and the occupied West Bank.Opinion polls have consistently indicated that he is the most popular Palestinian leader, and that Palestinians would vote for him in a presidential election ahead of the current Palestinian Authority (PA) President Mahmoud Abbas or Hamas leaders.Barghouti remains a senior figure in the Fatah faction that dominates the PA, which governs parts of the occupied West Bank not under Israeli control. He has been held in solitary confinement since October 2023.Far-right Israeli National Security Minister Itamar Ben Gvir, who is in charge of the prison service, denied Barghouti had been assaulted, but said he was \"proud\" Barghouti's prison conditions had worsened.In August, a video emerged showing Ben Gvir taunting Barghouti in his cell.The 13-second-long video clip was the first time he had been publicly seen in years. He appeared aged and gaunt.In the clip, Ben Gvir tells him: \"You will not win. He who messes with the people of Israel, he who will murder our children, he who will murder our women, we will wipe him out\".As Barghouti tries to interject, Ben Gvir adds: \"You need to know this, throughout history.\"The PA condemned the video. Its Vice-President Hussein al-Sheikh described it as \"the epitome of psychological, moral and physical terrorism.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prominent Palestinian prisoner  Marwan Barghouti attacked by guards, family says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/76cf/live/ad2d8f80-aa82-11f0-9334-19f2cf191969.jpg"
      ],
      "datePublished": "2025-10-16T12:08:47.000Z",
      "dateModified": "2025-10-16T12:08:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ricky Hatton: Inquest into boxer's death opened and adjourned",
    "url": "https://www.bbc.com/sport/boxing/articles/c2lp9ngz1gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c5e9/live/4b78b5b0-aa6b-11f0-bb1a-bf07c7ad3691.jpg",
    "tag": "Trending",
    "date": "2025-10-16T09:20:49.000Z",
    "description": "The inquest into the death of former boxer Ricky Hatton has been opened and adjourned.The 46-year-old, who won world titles at light-welterweight and ",
    "body": "The inquest into the death of former boxer Ricky Hatton has been opened and adjourned.The 46-year-old, who won world titles at light-welterweight and welterweight, was found dead at his home in Hyde on 14 September.South Manchester Coroner's Court, in Stockport, heard that Hatton was found by his manager Paul Speak.The court was told by Alison Catlow, of Greater Manchester Police, that Hatton was last seen by his family on 12 September and appeared well.The following day he did not attend an event as expected.On 14 September Speak, who was in court to represent the family, attended Hatton's home to pick him up for a flight to Dubai.Hatton, who was known as The Hitman, was found unresponsive.Senior coroner Alison Mutch said they are awaiting the final cause of death, but it was indicated as hanging.No family were in attendance.A full inquest has been scheduled for 20 March.Tributes poured in from the sporting world following news of Hatton's death, with Amir Khan remembering him as \"one of Britain's greatest boxers\" and Tyson Fury saying he was a \"legend\".Hatton was one of Britain's most popular fighters, building a loyal following with more than 30,000 supporters travelling to Las Vegas for his title bout with Floyd Mayweather in 2007.Thousands lined the streets for Hatton's funeral procession last week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ricky Hatton: Inquest into boxer's death opened and adjourned",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c5e9/live/4b78b5b0-aa6b-11f0-bb1a-bf07c7ad3691.jpg"
      ],
      "datePublished": "2025-10-16T09:20:49.000Z",
      "dateModified": "2025-10-16T09:20:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rachel Reeves plans 'targeted action' on bills in Budget",
    "url": "https://www.bbc.com/news/articles/c8eykkgdze5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a818/live/0e3e46d0-aaaa-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-16T14:56:06.000Z",
    "description": "1 hour agoFaisal IslamEconomics editorWatch: Government will be taking targeted action on cost of living, says ReevesChancellor Rachel Reeves has said",
    "body": "1 hour agoFaisal IslamEconomics editorWatch: Government will be taking targeted action on cost of living, says ReevesChancellor Rachel Reeves has said she is planning \"targeted action to deal with cost of living challenges\" in next month's Budget.Speaking to the BBC, she said it was the job of both the government and the Bank of England to reduce inflation.The UK's inflation rate is forecast to be the highest among the G7 group of developed nations this year and next.The BBC understands that the government could intervene to bring down energy bills, for example, by cutting the current 5% rate of VAT charged on energy.Another option is to reduce some of the regulatory levies currently added to bills.The government will receive the next draft from the official forecaster, the Office for Budget Responsibility (OBR), on Monday, which will reveal how much space there is for such a measure.The expectation from most analysts is that Reeves will have to announce tax rises or spending cuts in order to meet her self-imposed borrowing rulesEarlier on Thursday, the Institute for Fiscal Studies calculated there was a £22bn gap for the chancellor to fill, which is at the lower end of expectations.\"There's a shared job between the Bank of England and the government to bear down further on some of the causes of inflation,\" Reeves told the BBC in Washington, at the annual meetings of the International Monetary Fund and World Bank.While much of the focus has been on likely tax rises, the chancellor said the latest information from the OBR had not changed her commitment to manifesto promises not to raise rates on income tax, VAT or National Insurance.She blamed an \"uncertain world\" with rising geopolitical and trade concerns for the Budget tax moves, likely to be focused on those \"with the broadest shoulders\".Referring to the concerns about the UK's economic relations with China she said: \"Our national security always come first.\"Last week's announcement by China to tighten export controls on rare earths and other materials that are key for advanced tech manufacturing led US President Donald Trump to threaten an additional 100% tariff on imports from China, raising the prospect of an all-out trade war between the two economic giants.US Treasury Secretary Scott Bessent called China's move \"economic coercion\" and \"a global supply chain power grab\".Asked about accepting the US offer to join it in its battle with China, Reeves said she was \"very concerned\" by China's actions and urged the Chinese government \"not to put up barriers and restrict access\".She said the move was \"bad for the global economy and creates further headwinds\".\"I believe there are areas where we must challenge China, but there are also important opportunities to sell into Chinese markets, including financial services and other areas of the economy. We've got to get that balance right.\"The chancellor also confirmed she was working with G7 counterparts \"on our own critical minerals strategy, so that we are less reliant\".Reeves also acknowledged that the price the NHS pays for medicines could go up as a result of ongoing negotiations with the Trump administration and its drugs companies, in return for lower tariffs and investment.Some of the world's largest drug companies have said recently that they are either pausing or scrapping projects in the UK, with some blaming the low prices they are receiving.Last month, Science Minister Patrick Vallance said the price the NHS pays for medicines would need to rise to stop companies and pharmaceutical investment leaving the UK.Reeves told the BBC: \"We have seen because of the pricing regime, that clinical trials, new drugs have not been offered in the UK in the way that they are in other European countries.\"We want to make sure that people getting treatment from the NHS are able to access the best life-saving drugs in the world. And so we are looking at all of that, and… looking to secure more investment into Britain.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rachel Reeves plans 'targeted action' on bills in Budget",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a818/live/0e3e46d0-aaaa-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-16T14:56:06.000Z",
      "dateModified": "2025-10-16T14:56:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MI5 operating in new era of terror and state threats, says chief",
    "url": "https://www.bbc.com/news/articles/cgr40w2zereo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d1fd/live/165a5240-aaa1-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-16T13:05:12.000Z",
    "description": "3 hours agoFrank GardnerSecurity correspondent, MI5 HQ, Thames HouseMI5 is contending with near-record volumes of terror investigations and fast-risin",
    "body": "3 hours agoFrank GardnerSecurity correspondent, MI5 HQ, Thames HouseMI5 is contending with near-record volumes of terror investigations and fast-rising state threats, the intelligence agency's boss has warned.The security service is operating in a \"new era\", Sir Ken McCallum said in an annual speech, forcing the \"biggest shift in MI5's mission since 9/11\".He said state threats from Russia, China and Iran are escalating, with MI5 seeing a 35% increase in the number of individuals its investigating in the last year.Sir Ken added that Chinese state actors in particular present a daily national security threat to the UK, revealing that MI5 had intervened operationally to disrupt Chinese activity of national security concern in the past week.In the wide-ranging speech, Sir Ken talked about MI5 operating in \"a new era\" with terrorism remaining an \"ever-present threat\".He revealed MI5 and police had disrupted 19 late-stage attack plots and intervened in \"many hundreds of developing threats\" since the start of 2020.The \"aggregate scale of the terrorist threat remains huge\", he said, explaining how his teams were mostly focused on individuals or small groups, rather than larger established networks.One in five of the 232 terrorism arrests last year were of children under 17, he said.He also said al-Qaeda and Islamic State group were \"once again becoming more ambitious\" and \"taking advantage of instability overseas to gain firmer footholds\".Speaking about threats from state actors including China, Russian and Iran, the director-general said as well as methods of espionage, state actors are \"descending into ugly methods MI5 is more used to seeing in our terrorism casework\". State threats include espionage against the UK's Parliament, universities and critical infrastructure.He warned that would-be \"proxy\" actors are viewed by Russia as disposable, saying \"when you're caught, you'll be abandoned\".While on Iran, he also said MI5 had tracked more than 20 potentially lethal Iran-backed plots in the last 12 months.Meanwhile, referring to a court battle with the BBC about false evidence given by the agency to three courts, Sir Ken said MI5 had been \"justly criticised\" by the courts. \"I want to affirm, on record, the importance MI5 attaches to accountability and oversight,\" he said, adding: \"Part of why MI5 exists is to defend our national way of life - a way of life which includes the checks and balances of rigorous independent oversight\".The director-general also spoke about Artificial Intelligence (AI), saying while the technology brings immense benefits, it would be reckless to ignore the potential for it to cause harm.Sir Ken ended the speech by paying tribute to the \"quiet service\" of \"talented, selfless, often courageous MI5 people\" and the work they do behind the scenes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MI5 operating in new era of terror and state threats, says chief",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d1fd/live/165a5240-aaa1-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-16T13:05:12.000Z",
      "dateModified": "2025-10-16T13:05:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Wilde's British Library card reissued 130 years after being revoked over gay conviction",
    "url": "https://www.bbc.com/news/articles/cx2lymkm1jno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d563/live/581c4da0-aa79-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-16T10:30:15.000Z",
    "description": "6 hours agoPaul GlynnCulture reporterBritish Library BoardThe date of Oscar Wilde's death, 30 November 1900, has been used as the new card's expiry da",
    "body": "6 hours agoPaul GlynnCulture reporterBritish Library BoardThe date of Oscar Wilde's death, 30 November 1900, has been used as the new card's expiry dateThe British Library has honoured late Irish writer Oscar Wilde by reissuing a reader's card in his name, 130 years after his original was revoked following his conviction for \"gross indecency\".The celebrated novelist, poet and playwright was excluded from the library's reading room in 1895 over his charge for having had homosexual relationships, which was a criminal offence at the time.The new card, which will be collected by his grandson, author Merlin Holland, on Thursday, is intended to \"acknowledge the injustices and immense suffering\" Wilde faced, the library said.Mr Holland said the new card is a \"lovely gesture of forgiveness and I'm sure his spirit will be touched and delighted\".The British LibraryBritish Library papers from June 1895 noted: \"Mr O. Wilde excluded from the reading room\"The decision to revoke Wilde's pass for the library - then the British Museum reading room - was recorded without comment in the trustees' minutes for 15 June 1895.He had been in prison for three weeks at the time after being handed a two-year prison sentence with hard labour.The author was convicted after he lost a libel trial against Lord Queensberry, who had accused him of being homosexual after discovering that his son, Lord Alfred Douglas, aka Bosie, was Wilde's lover.The library regulations at the time said anyone convicted of a crime should have their card revoked.'Letter from prison meant so much'The British Library holds handwritten drafts of some of Wilde's most famous plays including The Importance of Being Ernest, An Ideal Husband, A Woman of No Importance and Lady Windermere's Fan.Its collection also includes De Profundis, the letter he wrote to Bosie from Reading Gaol.Mr Holland, the only living descendant of Wilde, will collect the new card at a ceremony at the venue on what would have been his grandfather's 171st birthday.Speaking to BBC Radio 4's Today programme on Thursday, Mr Holland said he felt both \"proud\" of his grandfather and slightly burderened by the responsibility of handling his legacy.\"People will so often write in to me and say, 'I cannot tell you how much your grandfather's De Profundis meant to me',\" he explained.\"It has a note of positivity at the end... he's going to come out of prison and do something again.\"And people have written to me saying, 'In a moment of terrible depression about my own life I read De Profundis, and I just wanted you to know that your grandfather's letter from prison meant so much to me'.\"British LibraryTrustees' papers noted Wilde's exclusion from the library at the timeDame Carol Black, chair of the British Library, described Wilde as \"one of the most significant literary figures of the nineteenth century\".She said that by reissuing his library card, \"we hope to not only honour Wilde's memory but also acknowledge the injustices and immense suffering he faced as a result of his conviction\".She added that they were \"delighted\" to welcome his grandson - who is the author of a new book, After Oscar: The Legacy of a Scandal - to receive the library card on his behalf.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Wilde's British Library card reissued 130 years after being revoked over gay conviction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d563/live/581c4da0-aa79-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-16T10:30:15.000Z",
      "dateModified": "2025-10-16T10:30:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gregg Wallace: BBC rejects former MasterChef presenter's 'harassment' claim",
    "url": "https://www.bbc.com/news/articles/ce8z0lx0e71o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2453/live/02728950-a8d0-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-16T12:18:02.000Z",
    "description": "4 hours agoNoor NanjiCulture reporterBBC/Shine TVThe BBC has said Gregg Wallace is not \"entitled to any damages\", in response to a legal claim filed b",
    "body": "4 hours agoNoor NanjiCulture reporterBBC/Shine TVThe BBC has said Gregg Wallace is not \"entitled to any damages\", in response to a legal claim filed by the former MasterChef host last month.Wallace is taking legal action against the BBC and BBC Studios after being sacked from the cooking show in July.The presenter is seeking up to £10,000 in damages for \"distress and harassment\" he says the broadcaster caused by failing to comply with a request for copies of his personal data.In its defence filed at the High Court, the BBC said it denied that he \"has suffered any distress or harassment\" as a result of its responses to his requests.It also argued that Wallace pursued his claim without giving it prior notice, and added that the BBC provided him with a copy of the personal data to which it says he was entitled on 7 October.Gregg Wallace claims BBC caused him 'distress and harassment'New MasterChef hosts revealed after Wallace and Torode axedGregg Wallace 'sorry' after 45 claims against him upheldIn court documents filed by Wallace, he claimed that he requested \"personal data\" from both the BBC and its subsidiary, BBC Studios, under data protection laws in March.Both requests related to his \"work, contractual relations and conduct\" spanning 21 years.Wallace's documents said that as of 5 September, he had still not received any of his personal information from the BBC.They further claimed that BBC Studios told Wallace it was withholding parts of his data on the basis of \"freedom of expression\". Wallace claimed it had \"unlawfully failed to supply\" all of his data, and had \"wrongly redacted\" information.He is seeking damages for \"distress, harassment and loss of amenity not exceeding £10,000\" as well as interest.BBC/ShineTVIn its defence, the BBC has said it gave Wallace earlier this month a copy of his personal data to which he was entitled under UK data protection rules.It said BBC Studios has now also given Wallace the information that was previously withheld, except from where such information amounted to the personal data of third parties.\"That voluntary disclosure demonstrates that the claimant has no basis to claim damages for distress (or otherwise) in respect of the withholding of such information,\" it said.\"It is denied that the claimant is entitled to any damages, interest or other relief,\" it added.Wallace's representatives have been approached for a comment. The BBC declined to comment.BBC News is editorially independent from the wider corporation.ComplaintsWallace hosted MasterChef for 20 years, but stepped away from presenting the show last year after facing a string of misconduct claims.The show's production company Banijay ordered an inquiry, which heard 83 allegations against the TV presenter.Of those, 45 were upheld, including one of unwelcome physical contact and three of being in a state of undress. Most related to inappropriate sexual language and humour, and also culturally insensitive or racist comments.In response, he said he was \"deeply sorry for any distress\" he caused and that he \"never set out to harm or humiliate\", but that \"none of the serious allegations against me were upheld\".A separate claim that his co-host John Torode had used a severely offensive racist term was also substantiated. Torode has said he has \"no recollection\" of the incident.Both presenters were sacked in July.Last month, it was revealed that food critic Grace Dent and chef Anna Haugh are the new hosts of MasterChef.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gregg Wallace: BBC rejects former MasterChef presenter's 'harassment' claim",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2453/live/02728950-a8d0-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-16T12:18:02.000Z",
      "dateModified": "2025-10-16T12:18:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The unanswered questions after release of China spy evidence",
    "url": "https://www.bbc.com/news/articles/cp3x55rqdy5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d265/live/67d562f0-aa87-11f0-978a-a301e44bcdc7.jpg",
    "tag": "Trending",
    "date": "2025-10-16T11:57:37.000Z",
    "description": "4 hours agoHenry ZeffmanChief political correspondentHouse of CommonsThe witness statements published by the government last night are hefty, detailed",
    "body": "4 hours agoHenry ZeffmanChief political correspondentHouse of CommonsThe witness statements published by the government last night are hefty, detailed and shed more light than ever before on what the two men were accused of.The disclosure followed a political row over the sudden collapse of the case against Christopher Cash and Christopher Berry, who were accused of spying for China.The controversy over the collapsed China spy case explainedIt is worth at the outset stressing that Mr Cash and Mr Berry have consistently denied wrongdoing, the claims against them have never been tested in court and the government's witness statements proceed explicitly on the basis that the allegations levelled by counter-terror police are true.The publication of the evidence has raised a series of new questions for the government and Crown Prosecution Service (CPS) to answer about the case, in addition to what might come next.Here's an examination of the key ones:Questions for prosecutorsFirstly, the witness statements provoke more questions for the CPS, which carries out criminal prosecutions on behalf of the state and ultimately took the controversial decision to drop the case.In the first witness statement Matthew Collins, the government's deputy national security adviser, said that there are areas where the Chinese state poses \"a threat to our people, prosperity and security\".In the second, he describes various ways in which the government believes it has been hacked by Chinese state actors.In the third, he talks of the \"active espionage threat\" posed by China to the UK, identifying specific activities they had carried out.Why was that not enough for the CPS to proceed with the case? Did they really believe that on that basis they would be unable to convince a judge to proceed, and a jury of the severity of the threat posed by China?Is the CPS position that the government's witness statement did not quite use the right formulation of words to make its point about the challenge of China? If so, did they specifically ask the government to use a different form of words? Would it even be appropriate to seek to shape a witness's evidence in such a way?These are questions that senior MPs asked the head of the CPS - Director of Public Prosecutions (DPP) Stephen Parkinson - about in a private meeting yesterday. It seems they were unimpressed by his answers.Questions for the governmentThere are questions for the government thrown up by the witness statements too. The first witness statement, which is by far the most extensive, was prepared and submitted when Rishi Sunak was prime minister. But the latter two were filed earlier this year after Labour came to office.Sir Keir Starmer's position over the past few weeks - and remember he used to run the CPS - has been that the only relevant point to this case is what the government's posture towards China was at the time of the alleged offences, which is to say when the Conservatives were in office.Yet, the very final paragraph of the third witness statement, from this August, says: \"It is important to emphasise that the UK government is committed to pursuing a positive relationship with China… we will co-operate where we can, compete where we need to; and challenge where we must.\"That final part is copied and pasted, essentially, from the Labour manifesto of 2024. It is, in other words, the Labour government position on China.If the government was constrained in the way that the prime minister has repeatedly said, then why was that in there?The answer from government sources on that is that Collins was merely offering wider context about the government's approach to China given that the case was set to be heard in open court in 2025 - nothing more than that. They argue that as a matter of law it is still the case that all that mattered to the case was the Conservative government's position at the time of the alleged offences and this paragraph does not change that.Other questionsAs interesting as these witness statements are, it's worth remembering that the core allegation being made by the Conservatives in recent days - furiously denied by the government - is that the latter two witness statements supplied by Collins were influenced by Labour ministers or Labour advisers in such a way as to make the case more likely to collapse.The witness statements do not do anything to substantiate that claim. That said, Kemi Badenoch, the Conservative leader, is arguing today that the inclusion of the Labour policy towards China raises the question of whether this was suggested to Collins by a government minister or adviser. Again, government sources are adamant that the answer to this is no.It is worth remembering again that the first witness statement was filed under the Conservatives. The Conservative position now is, implicitly, that ministers should have tried to make the latter two witness statements as strong as possible because of the seriousness of the allegations. It would be interesting to know what involvement, if any, Conservative ministers or advisers had with the original witness statement.What happens next?It seems inevitable that Mr Parkinson will be called to give evidence to a parliamentary select committee so that MPs can pursue in public view the question of why he decided to drop the case.It also seems likely that somebody from government will have to give public evidence to a select committee about this case, beyond a private evidence session scheduled for late November with Jonathan Powell, the national security adviser.The most significant ramifications of this row may prove to be unrelated to the specifics of this case.It has provoked serious allegations from Dominic Cummings, Boris Johnson's former chief adviser, about Chinese penetration of sensitive British data - which have only been partially denied. It has precipitated the publication of witness statements describing at length serious concerns held by the UK government about China's activities and intentions.Questions about the threat posed by China are now at the heart of British political debate in a way they have not been for some time.All this while Olly Robbins, the head of the diplomatic service, is in China for long-planned meetings, months after Chancellor Rachel Reeves led a trip to the country to seek deeper trade ties, with Starmer still expected to become the first prime minister to visit the country since Theresa May in 2018, and with a decision looming over China's application to build a new embassy in central London.Has this row made the government's intended diplomatic and economic approach to China politically unviable - is a hardening of the UK's stance now inevitable? That may be the most important unanswered question of the lot.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The unanswered questions after release of China spy evidence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d265/live/67d562f0-aa87-11f0-978a-a301e44bcdc7.jpg"
      ],
      "datePublished": "2025-10-16T11:57:37.000Z",
      "dateModified": "2025-10-16T11:57:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What was alleged against Christopher Cash and Christopher Berry in China spy case?",
    "url": "https://www.bbc.com/news/articles/cpd2vxzpgl7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66e3/live/8b3e26b0-aaa4-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-16T15:54:13.000Z",
    "description": "22 minutes agoDaniel SandfordUK correspondentPA MediaChristopher Berry (left) and Christopher Cash (right)Christopher Cash and Christopher Berry were ",
    "body": "22 minutes agoDaniel SandfordUK correspondentPA MediaChristopher Berry (left) and Christopher Cash (right)Christopher Cash and Christopher Berry were accused of collecting insider information about UK politics and government policy, and passing it to a Chinese intelligence agent, who then forwarded it to Cai Qi, one of the most senior politicians in China. Cai is often referred to as President Xi Jinping's right-hand man.Both Mr Cash and Mr Berry completely denied the charge under Section 1 of the Official Secrets Act 1911. The Crown Prosecution Service (CPS) dropped the case against the pair last month after deciding the evidence did not show China was a threat to national security.The two men met while teaching in China. Mr Berry stayed behind, but Mr Cash, whose other love was politics, got a job in the House of Commons - first as a researcher and then as the director of the China Research Group, working closely with MPs like Tom Tugendhat, Alicia Kearns and Neil O'Brien.Christopher BerryChristopher Berry in ChinaChina spy case collapse 'frustrating', MI5 chief saysThe controversy explainedThe remaining unanswered questionsIn a statement released through his solicitor, Mr Cash told the BBC: \"I have, for a long time, been concerned by the influence of the Chinese Communist Party (CCP) in the United Kingdom and, prior to these false allegations, was working to inform Parliamentarians and the public about those risks.\"Mr Cash and Mr Berry would talk and exchange messages between Westminster and China, according to the first of three witness statements by the deputy national security adviser Matt Collins to the CPS - released by the government on Wednesday.For example, according to Mr Collins' statement, Mr Cash told Mr Berry in June 2022 that he thought Jeremy Hunt would pull out of the Tory leadership race. In July 2022, he allegedly sent a voice note saying that Tugendhat would almost certainly get a job in Rishi Sunak's cabinet. Both these pieces of information ended up in reports that Mr Berry submitted to a man called \"Alex\", who the prosecution said was a Chinese intelligence agent.In his statement, Mr Cash said he was aware \"a small amount of the information\" he was sending to Mr Berry was being passed on. But he thought Mr Berry was working for \"a strategic advisory company\" helping clients \"invest in the UK\".Mr Cash said the information he gave Mr Berry was publicly available or \"just political gossip that formed part of the everyday Westminster rumour mill\".In a statement given to BBC News via his lawyer on Thursday, Mr Berry gives a similar account.He said his reports were \"provided to a Chinese company which I believed had clients wishing to develop trading links with the UK\". Those reports \"contained no classified information\", Mr Berry said, and \"concerned economic and commercial issues widely discussed in the UK at the time and drew on information freely in the public domain, together with political conjecture, much of which proved to be inaccurate\".Council on GeostrategyChristopher Cash (far right) in a meeting in the House of Commons with Alicia Kearns MPSome of the information was not for passing on. In the note to Mr Berry about Hunt, Mr Cash wrote: \"v v confidential (defo don't share with your new employer)\". Despite that, it was included in one of Mr Berry's reports, according to one of Mr Collins' statements.Mr Cash and Mr Berry communicated using encrypted messaging apps.Mr Collins' first statement says that, after one exchange in December 2022, Mr Berry told \"Alex\" that the Foreign Secretary James Cleverly did not think sanctions would be effective in blocking imports from Xinjiang, the province where there are human rights abuses of the Uyghur population.There were also a series of exchanges about meetings between Tugendhat, Kearns and Taiwanese defence officials, according to Mr Collins.All of these exchanges ended up in a series of reports that Mr Berry submitted to \"Alex\" with titles like \"Taiwan-perception-within-parliament\" and \"Import_of_Products_of Forced_Labour_from Xinjiang\".Those reports then ended up with Cai Qi, and he seems to have been so pleased about the information that, in July 2022, Mr Berry met Cai. Mr Cash sent him a message saying: \"You're in spy territory now.\"According to Mr Berry, Cai asked \"specific questions about each MP within the Conservative leadership election one-by-one\", Mr Collins said in his statement.ReutersCai Qi, seen waving, is sometimes referred to as President Xi's right-hand manAt times - according to Mr Collins - \"Alex\" \"tasked\" Mr Berry with collecting specific information. On one occasion, the turnaround time was just 13 hours, he said in his first statement.But both men categorically deny knowingly spying for China.\"I routinely spoke [to] and shared information with Christopher Berry about Chinese and British Politics,\" he said in the statement given to BBC News on Wednesday night.\"He was my friend and these were matters we were both passionately interested in. I believed him to be as critical and concerned about the Chinese Communist Party as I was.\"It was inconceivable to me that he would deliberately pass on any information to Chinese intelligence, even if that information was not sensitive.\"Mr Cash said he had been \"placed in an impossible position\" by the release of Mr Collins' statements, which were \"devoid of the context that would have been given at trial\", where they would have been subject to a \"root and branch challenge\". He insisted that the assessments \"would not have withstood the scrutiny of a public trial\".Mr Berry said he had \"consistently denied any wrongdoing\" but had found himself \"subjected to a trial by media\" and caught in the middle of various groups seeking \"to use the case to their political advantage\".He said he did not accept that, by making the reports, he was \"providing information to the Chinese intelligence services, nor is it tenable that the provision of such material could, in any sense, be considered for a purpose prejudicial to the safety or interests of the state\". He added: \"This would have been one of many issues raised with the jury during a trial.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What was alleged against Christopher Cash and Christopher Berry in China spy case?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66e3/live/8b3e26b0-aaa4-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-16T15:54:13.000Z",
      "dateModified": "2025-10-16T15:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]