[
  {
    "title": "Trump's new world order is real and Europe is having to adjust fast",
    "url": "https://www.bbc.com/news/articles/cddn002g6qzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9f8/live/23630490-08e9-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-16T05:39:01.000Z",
    "description": "3 hours agoKatya AdlerEurope editorBBCDowntown Munich is best-known for chic shops and flashy fast cars but right now its streets are bedecked with po",
    "body": "3 hours agoKatya AdlerEurope editorBBCDowntown Munich is best-known for chic shops and flashy fast cars but right now its streets are bedecked with posters advertising next generation drones.\"Europe's security under construction\" boasts the slogan on an eye-catching set of sleek black-and-white photographs, festooned across a scaffolding-clad church on one of this town's best known pedestrian boulevards.Such an unapologetic public display of military muscle would have been unimaginable here just a few years ago, but the world outside Germany is changing fast, and taking this country with it.The southern region of Bavaria has become Germany's leading defence technology hub, focusing on AI, drones and aerospace.Advertisements such as these that say \"Europe's security under construction\" would have been unthinkable in Germany not long agoPeople here, like most other Europeans, say they feel increasingly exposed - squeezed between an expansionist Russia and an economically aggressive China to the east, and an increasingly unpredictable, former best pal, the United States, to the west.According to a recent Eurobarometer poll, more than two-thirds of Europeans (68%) feel their country is under threat.This autumn, Germany's Federal Office of Civil Protection and Disaster Assistance warned for the first time since the Cold War that war is no longer \"unlikely\". While emphasising that this is a safe country, it also recommends that Germans keep food supplies of three to ten days at home. Just in case.Germany is the number one single donor of military and other aid to Ukraine, now that the US has halted any new direct aid. Opinion polls suggest voters here want to feel better protected at home too.AFP via Getty ImagesGermany is now the single biggest giver of aid to UkraineThe question for this country, along with others in Europe is whether traditional alliances with the US, in Nato and the EU can suffice, or whether they should be diversifying into ad-hoc coalitions alongside other like-minded nations such as Australia, South Korea and Japan?Precarious relationsBy 2029, the German defence budget will be higher than the UK and French equivalents combined, Nato's Secretary General Mark Rutte pointed out to me.He described the €150bn they say they will spend on defence as \"a staggering amount\".It's something the United States notices and appreciates, he said. Donald Trump is far from the first US president to insist that Europe do more for its own security, though his tone has been noticeably more threatening than that of his predecessors.The precarious state of transatlantic relations was the main focus of the Munich Security Conference (MSC) this weekend. It's the world's biggest annual defence meeting, bringing leaders, security experts and defence industries together.Mark Rutte (pictured speaking to Katya Adler), described the E150bn Germany will spend on defence \"a staggering amount\"While it's easy to dismiss speech-heavy get-togethers like this as wind-baggy talking shops, in the turbulent times we live in, they can make a difference - especially the informal private huddles between global decision makers, far away from the glare of the cameras.The most eagerly - and for some the most anxiously - anticipated speech at this year's conference was that of the US Secretary of State, Marco Rubio, who represented the Trump administration here.European leaders and top diplomats were seriously on the edge of their seats. But why was a simple 30-minute address given so much importance?It's because Europe-US relations have never been so frayed as they are now, over the last 80 years since World War Two. And this isn't a bust-up between buddies that will easily blow over.Denmark still furiousIn the just over 12 months since Trump returned to the White House, he has at times insulted and undermined European leaders, slapped big tariffs on their exports, and most shockingly of all to his allies in Nato, threatened Danish sovereignty over its territory, Greenland, refusing for a while to rule out taking the island by force.Speaking at the MSC on Saturday, Denmark's still clearly furious prime minister, Mette Frederiksen, said Trump's designs on Greenland remained \"the same\" despite ongoing trilateral talks between representatives of Greenland, the US and Denmark.Trump has ruled out taking Greenland by military force for now, and he's backed away (for the moment, at least) from slapping economic sanctions on allies, including the UK, France and Germany, that were getting in the way of the US acquiring the Arctic island. But transatlantic trust was severely damaged.European powers see in Trump a truly transactional president who thinks nothing of leveraging security or economic relations with his closest allies to get what he wants. Just before being re-elected president, for example, he told Europeans that the US would not protect nations that didn't pay their way on defence.It is true though, that Europe has been coasting on America's security blanket for decades. Critics in the US argue that European nations have been able to run generous welfare states for decades while Washington picked up the tab for security spending.AFP via Getty ImagesThe speech by US Secretary of State, Marco Rubio (left) was the most eagerly anticipated at the conferenceGermany's defence minister, Boris Pistorius, told me on Saturday: \"We got used to the strong support from the US;  we got used to our comfort zone in which we used to live. This time is over, definitely over,\" he said. \"Washington was right.\"But the crisis over Greenland and other actions by the Trump administration - such as when it temporarily paused intelligence-sharing with Ukrainian forces last March, leaving them blind on the battlefield, in order to pressure Kyiv into engaging in peace talks with Moscow - have left deep scars and a troubling sense of transatlantic wariness.Hence the trepidation in Munich before Rubio took the stage.In the end, his words were laced with a sense of historic kinship. \"We want Europe to be strong,\" he said. \"The two great wars of the last century serve for us as a constant reminder that ultimately our destiny is, and will always be, intertwined with yours.\"A loyal speechI found it telling that so many European politicians and politicians in the audience jumped on the warmth of his words, rising to their feet to applaud the US Secretary of State. They were clearly relieved he hadn't threatened or berated Europe as the US Vice President JD Vance famously did at last year's MSC.But for those listening closely, Rubio's speech was loyal to themes close to the heart of the Trump administration and hard for many European leaders to swallow: anti climate action, sceptical of globalisation, multilateralism, migration and pro the building of a new era of Christian western civilisation.Rubio was clear: the US wasn't interested in allies clinging to the old status quo. It wanted to forge a new path, ideally alongside Europe, but only if it shared the same values.This US offer of close partnership was conditional and absent of a sense of compromise.\"A bit like a (psychologically) abusive partner,\" said one European diplomat, speaking candidly on condition of anonymity. \"He reminded Europe how wonderful the (transatlantic) relationship used to be, but he then switched to coercion: If you want things to be good between us in the future, you have to do as I say!\"Another diplomat pointed out that, while talking of shared values, it was telling, he said, that of all the European countries that Rubio could have gone to after making his speech in Germany, he chose to visit Slovakia and Hungary before heading back to the US.They are viewed by Brussels as two of the EU's most problematic members, both with Eurosceptic nationalist prime ministers who oppose sending military aid to Ukraine and who are tough on migration.A fragile new relationshipRubio's softer tone also divided European leaders who had recently spoken as one, in defence of Denmark, at the height of the Greenland crisis last month.The President of the European Commission, Ursula von der Leyen, underlined a now fragile relationship with the US, despite Rubio's gentler rhetoric. \"Some lines have been crossed that cannot be uncrossed anymore,\" she said. \"Europeans have suffered shock therapy.\"But will some countries in Europe grasp what warmness there was in Rubio's speech as an excuse not to rush to boost defence spending as promised? The coffers of most European governments are over stretched already and their voters tend to prioritise cost-of-living concerns over defence budgets.Reuters\"Some lines have been crossed that cannot be uncrossed anymore,\" according to the President of the European Commission, Ursula von der LeyenRachel Ellehuus, Director-General of defence think-tank RUSI told me she sees a rift opening up across the continent.One the one hand, you have the Nordic and Baltic nations that are geographically close to Russia, and also Germany and the Netherlands, which are all big defence spenders, she says, whereas in southern Europe, there's Spain, for example, that is absolutely unapologetic about refusing to increase defence budgets to the levels demanded by Donald Trump.France and Britain are both verbally committed to boosting defence spending, says Ellehuus, but are still looking for a \"political band aid\" to help them explain to voters the trade-offs that will involve - higher taxes, less welfare or more borrowing.\"Europeans need to get to work yesterday and to focus,\" she says. \"They have 5-10 years to stand on their own two feet in terms of conventional defence capabilities.\"Last week, U.S. Undersecretary of Defence Elbridge Colby couldn't have been more stark in his messaging at a meeting of Nato defence ministers he attended in Brussels: Europe was no longer a US priority, the Indo-Pacific was.\"Under President Trump's leadership, we are reprioritising the defence of our homeland and the protection of our interests in our Hemisphere,\" he said.While he emphasised that the US remained committed to Nato's mutual defence clause, where an attack against one member is viewed as an attack against all, Colby insisted the US would be reducing its capabilities in Europe, becoming \"a more limited and focused\" presence.Europe had to become a partner, rather than a dependent, he said, calling for a new \"Nato 3.0\". The old world order with the West at its core, has faded but the MSC this weekend made clear that what comes next for Europe and the US is still very much up in the air.Marco Rubio called for a new century of western civilisation, Elbridge Colby wants a re-vamped Nato, while the UK's prime minister appealed in Munich for the western alliance to be re-made.Starmer's nuanced approachIn stark contrast to Marco Rubio's insistence on greater national sovereignty, Sir Keir Starmer spoke in favour of greater integration between the UK and Europe on defence - to cut re-armament costs, though, he emphasised this did not mean the UK turning its back on the United States.Sophia Gaston, national security expert at Kings College London, told me that in Munich, Starmer was able to better articulate the nuance of Britain's strategic outlook.\"Other allies in Europe may be more willing to speak of divergence from Washington\", she says, \"but for Britain it remains a strategic imperative to triangulate within the Transatlantic relationship. There will also be times when Britain will have to make hard choices, and Starmer appeared more confident in confronting that reality.\"The key is to have a really strong grasp of the national interest and our instruments of power and influence. This requires a much more competitive approach that has not always felt natural to Britain, which has typically pursued much of its diplomacy in elegant, consensus-focused and invisible ways.\"PA MediaKeir Starmer spoke in favour of greater integration between the UK and Europe on defenceIn these fast-moving, unpredictable times, Europe's leaders are increasingly turning to a la carte coalitions, alongside traditional organisations like Nato or the EU, which are larger and therefore often slower to react. These groupings also include non-European nations.Take, for example, the so-called Coalition of the Willing group of countries, led by the UK and France and formed to secure Ukrainian sovereignty in the case of an eventual peace deal with Russia. Turkey has attended coalition meetings, as have New Zealand and Australia.More from InDepthCanada is increasingly working alongside Nordic and Baltic nations that share geopolitical challenges and common values, they say, and want to promote stability and deterrence from the edges of the Baltic Sea, through the Nordic and Baltic states, through the North Atlantic, Greenland and across the Canadian arctic.One European policy-maker who asked not to be named joked to me that Canada was becoming \"more and more European by the day\". Japan and South Korea were increasingly seen as part of the \"like-minded family\" too, he said.Not just defenceThese ad hoc coalitions are not restricted to defence alone. France's President Macron has long called for Europe to increase what he calls its strategic autonomy, in traditional security terms but also energy security, supply chains and new technologies. In Munich he recommended Europe \"de-risk\" from all outside powers.This weekend even saw the president of the European Commission admitting that if the EU failed to move fast enough on improving competitiveness, \"a group of its member states would have to move forward alone\".Attempts by smaller pockets of European powers to work together to advance European strategic independence are by no means always successful. Take the current row between France and Germany over their joint attempt to come up with the next generation of fighter jet with the Future Combat Air System (FCAS).You could also say that for all the talk of building European independence, this weekend's conference was also a reminder of just how dependent Europe remains on US security support - from its nuclear umbrella to intelligence sharing and command and control structures. It was also a reminder of how far Europe trails the US in high tech innovation.But more than short-term mechanisms designed to 'survive' Donald Trump, the changes we are witnessing in Europe, including closer alliances outside the continent, are liable to be longer lasting. The world now seems to dance to the tune of big power politics. And even slow-moving Europe is having to adapt.Top picture credit: AFP / Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's new world order is real and Europe is having to adjust fast",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9f8/live/23630490-08e9-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-16T05:39:01.000Z",
      "dateModified": "2026-02-16T05:39:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026 schedule and day-by-day guide",
    "url": "https://www.bbc.com/sport/articles/c338y36kngzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-15T22:32:47.000Z",
    "description": "Bobsleigh: Women's monobob heats three and four (18:00)The first bobsleigh medal is up for grabs at the Cortina Sliding Centre. Kaillie Humphries won ",
    "body": "Bobsleigh: Women's monobob heats three and four (18:00)The first bobsleigh medal is up for grabs at the Cortina Sliding Centre. Kaillie Humphries won the inaugural monobob title at the 2022 Games, claiming her third Olympic gold – and first since switching allegiance from Canada to the USA. A fourth gold medal here would equal the record in Olympic bobsleigh.Freestyle skiing: Women's big air final (18:30-19:50)Kirsty Muir was the youngest member of Team GB in 2022, coming a brilliant fifth in the final, and the 21-year-old Scot will be hoping to be in the mix again. But it looks like being a high-class field that will include defending champion Eileen Gu, 2026 slopestyle gold medallist Mathilde Gremaud and Canada's Megan Oldham. And all Italian eyes will be on Flora Tabanelli, who won the 2025 world title aged just 17 – the skier from Bologna is the reigning Youth Olympic champion in big air, and now has her eyes on the senior title.Snowboard: Women's slopestyle final (12:00-13:35)British teenager Mia Brookes has already won the world title and is now aiming to become an Olympic champion on snow, something no Briton had achieved prior to these Games. The 19-year-old will be putting her tricks up against some talented rivals, set to include the Japanese contingent and reigning Olympic and world champion Zoi Sadowski-Synnott of New Zealand. The riders have three runs to impress the judges, with their best score counting.Bobsleigh: Two-man heats three and four (18:00)Can anyone stop the Germans and in particular pilot Francesco Friedrich, who is vying for a record fifth bobsleigh gold? The 35-year-old led a German 1-2-3 in this event in 2022 but this season Friedrich's long-time rival Johannes Lochner has had a decisive edge on the World Cup circuit. The British sled, featuring Brad Hall and Taylor Lawrence, will be among those seeking to end Germany's stranglehold.Freestyle skiing: Men's big air final (18:30-19:50)New Zealand's Luca Harrington will be aiming to add the Olympic title to the world title and World Cup title he won last season. But defending champion Birk Ruud of Norway is unlikely to give up his crown without a fight, while the home crowd will be behind Miro Tabanelli, a 21-year-old Italian who claimed X Games gold in 2025.Ski mountaineering: Women's and men's sprint finals (12:55 and 13:15)Bormio is synonymous with downhill skiing but some athletes will also be attempting to go uphill in the only new sport at these Winter Olympics – ski mountaineering, or skimo for short. Skiers race up and down a steep course on skis, 'skins' (strips of fabric attached to the bottom of skis) and on foot, putting on or taking off their equipment in transition areas between sections. Two of the three golds on offer will be decided today in the sprint races, which consist of several knockout contests. France's Emily Harrop, whose parents are British but who was born and bred in the French Alps, is the women's favourite (heats start at 08:50), with the men's heats at 09:30.Figure skating: Women's free skate (18:00-22:10)The women's figure skating is always one of the highlights of any Winter Olympics, but in 2022 it was one of the most upsetting events. It concluded with 15-year-old Kamila Valieva leaving the ice distressed after an error-strewn performance that followed her positive drugs test. The contest for gold in Milan-Cortina promises to be an intriguing battle – reigning world champion Alysa Liu and revitalised team-mate Amber Glenn are aiming to become the first USA winner of this title for 24 years, while Japan's three-time former world champion Kaori Sakamoto is hoping for a first Olympic gold in her farewell season. But could the latest young Russian talent Adeliia Petrosian – who will be competing as a neutral athlete – emerge as a contender?Ice hockey: Women's gold medal game (18:10) Thursday's final will almost certainly be the latest chapter in the increasingly bitter rivalry between the two dominant teams in women's hockey, Canada and the USA. The pair have contested six of the seven gold medal matches at the Olympic and met in 23 of 24 finals at World Championship level. The Canadians usually have the edge when it matters most and claimed their fifth Olympic crown in 2022.Freestyle skiing: Women's halfpipe run one and two (18:30-20:25)Zoe Atkin, one of Britain's biggest medal hopes at these Games, begins her quest to emulate big sister Izzy and win an Olympic medal. The 23-year-old Stanford University student is the reigning world champion and also the joint-winner of the overall World Cup title last season. However, she will face a strong field, including China's defending champion Eileen Gu and Li Fanghui, who was the other major force in the 2024-25 campaign.Freestyle skiing: Women's ski cross (09:00-12:35) The exciting sport of ski cross involves plenty of drama and the last Olympics was no exception, as Switzerland's Fanny Smith well knows. She was demoted from bronze in the aftermath of her race, only for the decision to eventually be overturned – she received her medal more than a year later. Now the reigning world champion, Smith again faces Sweden's Sandra Naeslund and Canada's Marielle Thompson, the gold and silver medallists from Beijing.Ice hockey: Men's semi-finals (15:40 & 20:10)The Milano Santagiulia Ice Hockey Arena is host to a semi-final double header, with the two winners advancing to Sunday's final and the losers playing off for bronze. Canada are nine-time Olympic champions, while the USA last took the title in 1980.Freestyle skiing: Men's halfpipe final (18:30-20:05)Expect a thrilling contest for gold. With New Zealand's 2022 gold medallist Nico Porteous announcing last summer that he was stepping away from the sport, there is a gap to be filled – and the title could stay in Kiwi hands as 19-year-old Finley Melville Ives is the current world champion. Alex Ferreira won silver in 2018 and bronze in 2022, and fellow American Nick Goepper has his sights set on winning a medal at a fourth consecutive Games, having made the slopestyle podium in 2014, 2018 and 2022.Curling: Women's gold medal game (10:05-13:20)This event proved the highlight – and saving grace – of Britain's Winter Olympics four years ago, when Eve Muirhead and her team clinched GB's only gold of the Games on the final day in Beijing. With only one member of that gold-winning quintet competing in Milan-Cortina, a repeat might be unlikely.Ice hockey: Men's gold medal game (13:10)Each of the last three men's ice hockey finals has produced a different winner – so could a new name be added to the roll of honour at the Milano Santagiulia Ice Hockey Arena? Canada have claimed a record nine Olympic golds and the return of NHL players is a boost to their chances. That also applies to the USA, who haven't won the title since 1980's 'Miracle on Ice', while Finland are the reigning champions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule and day-by-day guide",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-15T22:32:47.000Z",
      "dateModified": "2026-02-15T22:32:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Has Jeff Bezos brought down the Washington Post? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n0j22b?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-11T19:53:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·11 Feb 2026,·27 minsHas Jeff Bezos brought down the Washington Post?AmericastAvailable for over a yearThe paper that contributed to the resignation of President Nixon over Watergate and the Vietnam war is now having to rethink its future.  The Washington Post’s owner - Amazon boss Jeff Bezos - has announced mass layoffs at the newspaper, which will fundamentally change how it covers the news.  \nWhen Bezos bought the paper in 2013, he reassured staff about a “new golden era for the Washington Post”, and later adopted a new slogan for the Washington Post “Democracy Dies in Darkness”.  \nJustin and Anthony discuss why the cuts have happened and what the wider impact may be on US media.  With Bezos defending the cuts as “the data tells us what is valuable and where to focus\",  we look at whether the role of money, influence, and closeness to President Trump could also be at play? \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Has Jeff Bezos brought down the Washington Post? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-11T19:53:00.000Z",
      "dateModified": "2026-02-11T19:53:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Naveed Akram: Bondi Beach shooting accused faces court for the first time",
    "url": "https://www.bbc.com/news/articles/c3rzwe7lr4jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4804/live/9b3b1360-0b08-11f1-b8d0-21adbc414b0b.jpg",
    "tag": "Trending",
    "date": "2026-02-16T07:53:10.000Z",
    "description": "43 minutes agoGavin ButlerGetty ImagesNaveed Akram spoke for the first time since his arrest on Monday – saying just one wordAccused Bondi Beach gunma",
    "body": "43 minutes agoGavin ButlerGetty ImagesNaveed Akram spoke for the first time since his arrest on Monday – saying just one wordAccused Bondi Beach gunman Naveed Akram faced court for the first time on Monday, two months after he and his father allegedly carried out Australia's worst mass shooting in almost 30 years.The 24-year-old appeared in a Sydney court for about five minutes via video link from prison. He faces 59 charges relating to the Bondi Beach shooting, including 15 counts of murder and one of committing a terrorist attack.Sajid, 50, was shot dead by police at the scene, while Naveed was critically injured and later transferred from hospital to prison.Monday was the first time Akram had been seen on screen and spoken since his arrest – saying just one word when Deputy Chief Magistrate Sharon Freund asked if he heard a discussion about an extension of suppression orders: \"Yeah\".The court orders cover the identities of those who survived the shooting, but allow the survivors to self-identify if they wish.Outside court, Akram's lawyer, Ben Archbold, said it was too early to say what plea his client would enter, according to the Australian Broadcasting Corporation.He said Akram was doing \"as well as can be expected\" while in custody in Goulburn supermax prison.\"Everyone knows it's supermax … very onerous conditions,\" Archbold told journalists.When asked if Akram had given a police interview, he said \"All we've done is start the process. We're waiting for the brief to be served. There's nothing more I can say.\"One video - taken on one of their mobile phones in October - was described as showing the men sitting in front of an image of an Islamic State group (IS) flag.They could be heard making statements about their motivations for the attack and condemning \"the acts of 'Zionists'\", police said.Police said separate footage from October showed the father and son \"conducting firearms training in a countryside location\", believed to be in New South Wales.They were seen \"firing shotguns and moving in a tactical manner\", officials added.Authorities earlier confirmed that two rabbis, a Holocaust survivor and a 10-year-old girl were among the victims of the Bondi Beach attack.Akram is next due in court in April.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Naveed Akram: Bondi Beach shooting accused faces court for the first time",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4804/live/9b3b1360-0b08-11f1-b8d0-21adbc414b0b.jpg"
      ],
      "datePublished": "2026-02-16T07:53:10.000Z",
      "dateModified": "2026-02-16T07:53:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Female Israeli soldiers rescued after being chased by ultra-Orthodox men",
    "url": "https://www.bbc.com/news/articles/clyzen2lgw9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d42a/live/7139f310-0aa9-11f1-adb1-dfcb996ae067.jpg",
    "tag": "Trending",
    "date": "2026-02-16T07:47:54.000Z",
    "description": "49 minutes agoAlicia CurryProtesters, police and military clashTwo female Israeli soldiers had to be rescued by police after being chased by a crowd o",
    "body": "49 minutes agoAlicia CurryProtesters, police and military clashTwo female Israeli soldiers had to be rescued by police after being chased by a crowd of ultra-Orthodox Jewish men.Footage from the city of Bnei Brak showed the women running through streets strewn with rubbish and overturned bins as police officers formed a protective barrier. More than 20 people were arrested.Reports suggest the Israel Defense Forces (IDF) soldiers were wrongly believed to be trying to deliver army conscription orders. Military service is mandatory for most Jewish Israelis, but ultra‑Orthodox Jews have long been exempt. Moves to reform this have caused outrage among the community.Israeli Prime Minister Benjamin Netanyahu condemned the incident as \"unacceptable\".ReutersPolice used stun grenades to disperse the crowds in the city of Bnei Brak\"This is an extreme minority that does not represent the entire Haredi [ultra-Orthodox] community,\" Netanyahu said in a post on X. \"We will not allow anarchy, and we will not tolerate any harm to IDF servicemen and security forces who carry out their duties with dedication and determination.\"Jewish religious leaders also condemned the actions of those involved in the unrest.Riot police in Bnei Brak, on the edge of Tel Aviv, used stun grenades against the crowd and arrested 23 people, police said in a statement.Three officers were injured and several police vehicles damaged, including a patrol car that was overturned and a police motorcycle that was set on fire, police added.The IDF servicewomen had been on an official home visit to another soldier when the confrontation broke out, Israeli broadcaster Kan reported.ReutersThe ultra-Orthodox population now accounts for 14% of the Israeli populationThe issue of conscription has become increasingly contentious during the war in Gaza, with the Israeli government now debating draft legislation that would require ultra-Orthodox men not in full-time religious study to serve.Since the State of Israel was declared in 1948, students enrolled full-time at a religious school, or yeshiva, have been exempted from conscription. That exemption was ruled unconstitutional by Israel's High Court of Justice more than a decade ago. Temporary arrangements to continue it were formally ended by the court last year, forcing the government to begin conscripting the community.The ultra-Orthodox population has more than doubled its share of Israel's population over the past seven decades, and now accounts for 14%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Female Israeli soldiers rescued after being chased by ultra-Orthodox men",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d42a/live/7139f310-0aa9-11f1-adb1-dfcb996ae067.jpg"
      ],
      "datePublished": "2026-02-16T07:47:54.000Z",
      "dateModified": "2026-02-16T07:47:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ministers want to reform SEND - but they are treading very carefully",
    "url": "https://www.bbc.com/news/articles/c7951dzg9npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5763/live/58adde20-08d2-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-16T01:11:05.000Z",
    "description": "7 hours agoAlex ForsythPolitical correspondentReutersThe government is aware it can't afford to get SEND reforms wrongIn the next few weeks, the gover",
    "body": "7 hours agoAlex ForsythPolitical correspondentReutersThe government is aware it can't afford to get SEND reforms wrongIn the next few weeks, the government is expected to outline its plan to overhaul the crucial yet complex system of support for children with special educational needs and disabilities (SEND) in England - and it could prove contentious.The SEND system is vital to hundreds of thousands of parents and children in England.Almost every MP will tell you it's an issue that regularly tops their inboxes; last month, the prime minister acknowledged SEND was probably raised with him more than any other topic in the House of Commons.Given the strength of feeling, it's perhaps no surprise that some Labour MPs have been nervous about what the government is planning, mindful of previous missteps on issues of public concern like winter fuel payments and welfare.With the prime minister's authority and judgement having been openly questioned by some in his own party in recent days, it's even more crucial for the government that they get this right.And SEND reform is an issue fraught with potential pitfalls.PA MediaStrength of feeling among parents runs high and MPs warn of an erosion of trust in the SEND system\"The problem is there's such a huge trust deficit between parents and government on this issue,\" one Labour backbencher said.\"They know the current system doesn't work, but they worry a new system won't make it better and might make it worse and there's not enough trust in the bank to be able to trade on that.\"Few would dispute the need to reform the SEND system. In recent years demand has spiralled upwards, with a record one in five children in England now requiring support.Many parents find themselves facing a system under strain, with provision patchy and families often locked in lengthy legal battles to get support for their children.Meanwhile, the Office for Budget Responsibility forecasts that spending on special educational needs and disabilities will have more than doubled in real terms by 2028–29 as compared with 2015–16, and councils have been racking up debts as the cost of support outstrips budgets, leading to warnings of a \"total system collapse\".Sources close to Education Secretary Bridget Phillipson say she is prepared to \"grasp the nettle\" and take the difficult but necessary decisions, driven by the belief that reform is essential to provide children with the support they need.But the government has been treading carefully. The schools white paper setting out SEND reforms was delayed last year, with ministers taking time to engage in a series of \"listening exercises\" with parents and professionals in the sector.The thinking within government is clear. Ministers favour inclusive mainstream education for more children with special educational needs, where from the early years they get the support they require within local mainstream schools, with specialist school places for those with complex needs.A series of recent announcements have been described as a \"downpayment\" on the government's approach and commitment to funding; in December, there was £3bn to create places for children with SEND in mainstream schools, followed this year by £200m to train teachers in supporting children with SEND and £1bn to create suitable spaces in mainstream school buildings.The government has also agreed to clear £5bn worth of debts that councils have built up, and take on responsibility for SEND funding from 2028.One backbench Labour MP said they were \"reassured\" by the announcements so far. \"It builds my confidence in the fact they're serious about what needs to be done at the get go on this,\" they said.But they said they were still waiting and watching for the detail of the government's wider plan.A potential flashpoint is what the government decides to do regarding Education Health and Care Plans (EHCPs) – the legal documents that underpin a child's right to support.Official government figures show the number of these plans increased by 166% between January 2015 and January 2025, from 240,000 to 639,000.There is a school of thought – articulated by parliament's education select committee in a report last year – that providing the support children need from the earliest stages in mainstream school settings will mean fewer parents need to go down the often difficult and adversarial route of pursuing an EHCP to access help.But MPs are aware that parents fear any erosion of legal rights, with an active campaign underway called Save Our Children's Rights petitioning the government.\"I think probably the key is if a parent can stand up and demonstrate they and their child have got fewer rights today than they had yesterday, that'll be the killer blow,\" said one Labour backbencher.\"This is where the trust problem comes. I can tell you we're going to put loads of support into mainstream and then it will get better, the trouble is we've lost so much trust and confidence with the public – not just this Labour government but the whole SEND system.\"The government has insisted current support and legal entitlements will not be removed, but has not ruled out future changes to the system.There are Labour MPs who feel encouraged, with one describing \"thoughtful thinking\" that is taking place in government.But even among those who are optimistic there is caution, given the complexity and scale of the issue, with repeated warnings that the government has to \"keep engaging\" with parents and people working in the sector.Some argue the government needs to go further. The County Councils Network has warned the government not to \"duck\" reforms, saying in order to improve outcomes for children, costs have to be \"tackled and curtailed\" and there should be legislative change to focus EHCPs on those most in need.Every party in Westminster has acknowledged the need to reform England's SEND system.The Conservatives and the Green Party have not set out clear policies.The Liberal Democrats have outlined fundamental principles including a \"fair funding system\" that incentivises schools to accept SEND pupils, while Reform UK is developing its own SEND policy after the party's deputy leader, Richard Tice, said some parents were \"abusing the system\" – limiting the support for those \"genuinely in need\".The challenge for the government is delivering reforms bold enough to improve a system under enormous strain without alienating parents or leading to a backlash from its own MPs – all within constrained budgets. It's no wonder they're treading carefully.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ministers want to reform SEND - but they are treading very carefully",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5763/live/58adde20-08d2-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-16T01:11:05.000Z",
      "dateModified": "2026-02-16T01:11:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney kidnapping: Police appeal for return of man, 85, snatched by mistake  ",
    "url": "https://www.bbc.com/news/articles/c0ljzye1zgno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9db6/live/4a163370-0aea-11f1-b38f-dfbde52a66fe.jpg",
    "tag": "Trending",
    "date": "2026-02-16T05:34:34.000Z",
    "description": "3 hours agoHelen LivingstoneSuppliedPolice say Chris Baghsarian, 85, was kidnapped from his home in the Sydney suburb of North Ryde by mistake.Sydney ",
    "body": "3 hours agoHelen LivingstoneSuppliedPolice say Chris Baghsarian, 85, was kidnapped from his home in the Sydney suburb of North Ryde by mistake.Sydney police have appealed for the return of an 85-year-old whom they believe was kidnapped by mistake.Chris Baghsarian, who lived alone, was taken from his house in the suburb of North Ryde by at least three attackers early on Friday morning, and bundled into a dark-coloured SUV. \"They were intending to take somebody, but have taken the wrong person,\" Det Acting Supt Andrew Marks told reporters on Monday, adding that no ransom note had been received.\"The family are in distress. All they want is their father to be returned, their grandfather to be returned,\" he said, appealing for people to report any unusual activity seen around properties known to be empty.The appeal came as the Sydney Morning Herald (SMH) reported that videos and images of a severely injured Baghsarian in an unknown location were circulating in Sydney's underworld.\"It's not ideal that those images are out there,\" Marks said, noting that Baghsarian needed daily medication and that \"every hour is very important\".\"I have seen the videos,\" he add. \"They are distressing to see an 85-year-old man in that condition.\"He said that in a \"normal\" kidnapping case, \"we would be aware of a ransom\". \"But because the family are not involved in this type of crime, and they're not involved in that world, they haven't received a ransom.\" Cases of mistaken identity have become increasingly common in Sydney's underworld, the SMH reported, as large organised crime networks increasingly subcontract crimes.Last year a 23-year-old plumber was shot dead in his driveway in Condell Park in what police believe was also a case of mistaken identity.He was \"a million per cent confident they have the wrong person,\" Marks said but would not elaborate on who police thought the intended target was.\"The fact that these offenders – these kidnappers – have got it so wrong is concerning.\"CCTV footage published by local media showed an SUV driving up outside Baghsarian's home on Friday. Two hooded figures then approach the house before reappearing with someone who is struggling in their arms and then loaded into the SUV.A burnt out vehicle matching the description of the getaway car was found in the nearby suburb of South Turramurra shortly afterwards.Police said Baghsarian was wearing grey pajamas and a red and blue flannelette shirt when he was kidnapped.New South Wales Premier Chris Minns has also pleaded for Baghsarian's safe return.\"Let police know where he's currently located or alternatively drop Mr Baghsarian off at a shopping centre or an emergency department or even a nursing home,\" he appealed to the kidnappers. \"We urge them to do that as soon as possible.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney kidnapping: Police appeal for return of man, 85, snatched by mistake  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9db6/live/4a163370-0aea-11f1-b38f-dfbde52a66fe.jpg"
      ],
      "datePublished": "2026-02-16T05:34:34.000Z",
      "dateModified": "2026-02-16T05:34:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Swift Home': Bedding firm abandons trademark bid after Taylor Swift appeal",
    "url": "https://www.bbc.com/news/articles/crm87109l3wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/50b5/live/98926690-0ad1-11f1-8500-3dc1ee2bb30a.jpg",
    "tag": "Trending",
    "date": "2026-02-16T01:44:55.000Z",
    "description": "7 hours agoOsmond ChiaBusiness reporterPAA firm behind a bid to trademark the brand \"Swift Home\" for a line of bedding products has withdrawn its appl",
    "body": "7 hours agoOsmond ChiaBusiness reporterPAA firm behind a bid to trademark the brand \"Swift Home\" for a line of bedding products has withdrawn its application over the weekend, following an appeal by pop star Taylor Swift to the US patents office.A representative for Cathay Home, a company selling home goods through major retailers, told the BBC that the decision was made since the disputed mark was not \"essential to its business\".Swift's team issued a notice to the US government on 11 February with a request to block the firm's bid.Her team argued that there were similarities between the singer's trademarked designs and the company's mark, and that it could mislead consumers into thinking that Swift had endorsed the products.The BBC has contacted Swift's team for comment.Cathay Home's lawyer, Ting Geng from Geng and Associates said in a statement that the trademark application was dropped after evaluating the circumstances. \"Such decisions are often practical and commercially sensible,\" she said.The lawyer added that the firm had previously reached a \"consent-to-coexist agreement\" with the singer's team regarding another registered \"Swift Home\" mark.Cathay Home, which has offices in North America and China, had applied for a \"Swift Home\" trademark for its bedding items in late 2025.In an appeal to the US Patent and Trademark Office filed last week, Swift's team said that the way Cathay Home has styled the word \"Swift\" in the branding closely resembled the singer's trademarked cursive mark.Veneble LLPTaylor Swift's trademarked logo (left), next to Cathay Home's \"Swift Home\" designThe mark creates a \"false association\" to the singer and was done with the intent of using her \"goodwill and recognition\" for the firm's brand, Swift's team argued.The documents said that Swift owns federal trademarks that protected the use of her name and designs on various goods, including bedding, clothes and music-related products.Swift has filed more than 300 trademarks in the US and other jurisdictions, securing her name, initials, album titles and some lyrics.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Swift Home': Bedding firm abandons trademark bid after Taylor Swift appeal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/50b5/live/98926690-0ad1-11f1-8500-3dc1ee2bb30a.jpg"
      ],
      "datePublished": "2026-02-16T01:44:55.000Z",
      "dateModified": "2026-02-16T01:44:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seedance: ByteDance to curb AI app after Disney legal threat",
    "url": "https://www.bbc.com/news/articles/c93wq6xqgy1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f87/live/150ed810-0aec-11f1-88b9-a5144df8a4fa.jpg",
    "tag": "Trending",
    "date": "2026-02-16T03:47:49.000Z",
    "description": "5 hours agoOsmond ChiaBusiness reporterGetty ImagesDisney owns multiple franchises, including Marvel and its characters like Spider-ManChinese technol",
    "body": "5 hours agoOsmond ChiaBusiness reporterGetty ImagesDisney owns multiple franchises, including Marvel and its characters like Spider-ManChinese technology giant ByteDance has pledged to curb a controversial artificial intelligence (AI) video-making tool, following threats of legal action from Disney and complaints from other entertainment giants.In the last few days, videos made using the latest version of the app Seedance have proliferated online. Many have been lauded for their realism.On Friday, Disney sent a cease-and-desist letter to ByteDance accusing it of supplying Seedance with a \"pirated library\" of the studio's copyrighted characters, including those from Marvel and Star Wars.Disney's lawyers accused ByteDance of committing a \"virtual smash-and-grab\" of their intellectual property, including superheroes from Marvel, Star Wars and various cartoons.On Monday ByteDance told the BBC that the company \"respects intellectual property rights and we have heard the concerns regarding Seedance 2.0.\"\"We are taking steps to strengthen current safeguards as we work to prevent the unauthorised use of intellectual property and likeness by users.\"ByteDance did not respond to questions asking for details on the safeguards it plans to implement.Reddit/AI-generated imageOne clip online said to have been created with Seedance shows a fight between Anakin Skywalker and Rey from Star WarsLike other generative-AI tools, Seedance can create videos based on short text prompts.Many of Seedance's clips are based on real actors and shows and some have gone viral since the launch of its latest 2.0 version on 12 February. The BBC has found clips online said to have been generated by Seedance showing Star Wars characters Anakin Skywalker and Rey battling with their lightsabres, and Spider-Man fighting Captain America on the streets of New York.The company has not disclosed what data it uses to train Seedance.ByteDance had previously said the product had already paused the ability for users to upload images of real people. The company also said it respects intellectual property rights and copyright protections, and takes any potential infringement seriously.Disney's legal threat follows criticism from other organisations in Hollywood over the Seedance platform.The Motion Picture Association, which represents major US studios like Warner Bros Discovery, Paramount and Netflix, has demanded that the tool \"immediately cease its infringing activity\".Actors' union Sag-Aftra has also accused Seedance of \"blatant infringement\".Meanwhile the Japanese government has launched an investigation into the Chinese firm over potential copyright violations, after AI-generated videos of popular Japanese anime characters showed up on online.Other AI image‑generation tools have likewise been hit with legal action.Last year, Disney and NBCUniversal sued AI image generator Midjourney, accusing the platform of generating \"endless unauthorised copies\" of the studios' copyrighted works. The case is ongoing.Disney has also asked Google to restrict the generation of its characters on Google's AI platforms.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seedance: ByteDance to curb AI app after Disney legal threat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f87/live/150ed810-0aec-11f1-88b9-a5144df8a4fa.jpg"
      ],
      "datePublished": "2026-02-16T03:47:49.000Z",
      "dateModified": "2026-02-16T03:47:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "T20 World Cup: Australia add Steve Smith to their squad before crucial Sri Lanka match",
    "url": "https://www.bbc.com/sport/cricket/articles/c5yrvld7925o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a594/live/991741a0-0b0b-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-16T08:05:35.000Z",
    "description": "Batter Steve Smith has been added to Australia's T20 World Cup squad in time for Monday's crucial match against Sri Lanka in Pallekele.Smith, 36, trav",
    "body": "Batter Steve Smith has been added to Australia's T20 World Cup squad in time for Monday's crucial match against Sri Lanka in Pallekele.Smith, 36, travelled to Sri Lanka as cover after captain Mitchell Marsh was hit in the groin area last week and suffered \"testicular bleeding\".Smith was not officially added to the squad, with the management waiting to see how the situation developed, but now comes in as a replacement for bowler Josh Hazlewood.Hazlewood was ruled out on the eve of the tournament and not replaced.Selector Tony Dodemaide said: \"With Steve here, along with some uncertainty around Mitch and Marcus Stoinis, it made sense he is activated and available for selection in time for the match, if required.\"Smith has not played a T20 for Australia since February 2024 but scored a century and two fifties in six matches in the Big Bash after the Ashes in January, leading some to suggest he should have been in Australia's squad regardless.Australia's batters have struggled in the tournament so far, bowled out for 146 all out in a 23-run defeat by Zimbabwe to leave their place in the Super 8s.They beat Ireland by 67 runs in their opening match but also lost 3-0 in Pakistan prior to the World Cup.Australia will be eliminated from the World Cup if they lose to Sri Lanka and Zimbabwe beat Ireland on Tuesday.They may need to win both their remaining games and rely on net run-rate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "T20 World Cup: Australia add Steve Smith to their squad before crucial Sri Lanka match",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a594/live/991741a0-0b0b-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-16T08:05:35.000Z",
      "dateModified": "2026-02-16T08:05:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Truth is antidote to Putin's poison' and 'Europe sabotage campaign'",
    "url": "https://www.bbc.com/news/articles/c5yqvqw12p0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3325/live/999e8af0-0ac7-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-16T05:33:37.000Z",
    "description": "3 hours agoThe aftermath after the UK and its European allies said Russia killed opposition leader Alexei Navalny with a frog toxin continues to lead ",
    "body": "3 hours agoThe aftermath after the UK and its European allies said Russia killed opposition leader Alexei Navalny with a frog toxin continues to lead some papers on Monday. The i says the UK plans to \"slash vital funding to counter Russian operations\" against the country, as well as planning \"new sanctions against Moscow\" following the poisoning announcement. Opposition parties have called the funding changes to security \"deeply irresponsible\", the paper reportsForeign Secretary Yvette Cooper calls for \"tougher new sanctions\" to be placed on Russia following her probe into the death of Navalny, Metro reports. Meanwhile, a \"golden moment of history\" at the Winter Olympics features large at the top of the paper's front page, with snowboarders Charlotte Banks and Huw Nightingale celebrating \"Britain's first ever Winter Olympic gold on snow\"The Financial Times reports that former Russian Wagner Group agents have enlisted for \"Kremlin-organised sabotage attacks in Europe\". The Wagner recruiters are appealing to \"economically vulnerable Europeans to carry out violence on Nato soil\", the paper reports, citing unnamed Western intelligence officialsA photograph of the \"daily life in Kyiv\", depicting people lining up for food in the cold weather, takes up the entire front page of the Independent. \"It's dark, it's cold … it's endless\", is the paper's headline. It says people are \"battling to survive winter as Putin's latest strategy targets power supplies\"More of Team GB's Winter Olympics glory is spotlighted on the front page of the Daily Telegraph, with a picture of skeleton racers Tabitha Stoecker and Matt Weston celebrating their mixed team gold medal win. Elsewhere on the front, the paper says democracy will be \"denied to 15m voters\" if there are further delays to some local elections. Labour says that a \"looming reorganisation of local authorities would make elections expensive, complicated and unnecessary\"The Sun leads with an exclusive on \"£500k phone compo for migrants\", following a ruling by High Court judges that seizing the phones of 70 boat migrants was \"illegal and in breach of European human rights laws\"Campaigners warn \"switching off street lights at night to save money\" puts women and girls at greater risk, the Daily Express reports. The paper is launching a \"Safer Streets crusade\", which is also concerned with overall pedestrian safety during the early hours of the morning\"Under-16s social media ban may happen this year\", the Times reports. Prime Minister Sir Keir Starmer plans to use new powers to push through changes faster, according to the paper, which may include restrictions to infinite scrolling designsThe Daily Mail asks \"what are the police waiting for?\" as it says officers face \"mounting calls to launch a full investigation into Andrew Mountbatten-Windsor's role as the UK's trade envoy\". Files released by the US department of Justice appear to show the former prince forwarded UK government documents and other commercial information to the convicted sex offender Jeffrey Epstein. Mountbatten-Windsor has always consistently and strenuously denied any wrongdoingThe link between suicides and domestic abuse is the focus of the Guardian's front page on Monday. Researchers say domestic violence suicides are a \"national scandal\" and that the exact number of \"women driven to suicide by domestic abusers is severely under-reported\", the paper reports\"The Great British Water Shame\" leads the Daily Mirror. It is about a new Channel 4 drama, which features the story of the young British girl who died from E. Coli in 1999 after playing on the beach in DevonAnd the Daily Star leads with an appeal to \"save Britain's first ever Indian restaurant from closure\", and a call for King Charles \"to rescue the 100-year-old\" eatery that \"sparked our love of curry and beer\"The Times says the prime minister is seeking to \"steady his premiership\" by using \"Henry the Eighth powers\" to force through changes to online safety - including, the paper says, the possible banning of under 16s from social media this year.The paper says pressure is growing internally after more than 60 Labour MPs called for the move last month. Opposition parties have accused the prime minister of using delaying tactics, by starting a consultation when they say a ban could be introduced now.The Daily Mail leads on Andrew Mountbatten-Windsor and what it says are mounting calls for a full police investigation into his role as a UK trade envoy. The Liberal Democrats leader Sir Ed Davey tells the paper the former prince abused his position by allegedly sending sensitive information to Jeffrey Epstein, and that there must be a public inquiry. Mountbatten-Windsor has always denied wrongdoing.The Daily Telegraph reports that a man who set fire to a Quran in London may be accepted by the US as a refugee from Britain, if he loses his blasphemy case this week. The paper says the Crown Prosecution Service will contest the decision to overturn Hamit Coskun's conviction for a religiously aggravated public order offence, at a High Court hearing tomorrow. Officials in Washington say it's one of several cases being considered.The lead story for the Guardian is research that has found the number of women driven to suicide by domestic abusers is under-reported and police are overlooking cases. It cites a study from a suicide prevention programme in Kent which suggests the number of suicides with domestic abuse at their core could be ten times higher than figures from the National Police Chief's Council. Experts are quoted, calling it a \"national scandal\".The Daily Express uses its front page to launch a campaign, calling for street lights to be kept on at night, to protect women and girls, and to prevent road accidents. The government tells the paper it's working with local authorities to increase lighting in key spaces.The Daily Mirror's headline is \"The Great British Water Shame\" as the paper highlights a new TV drama about water firms' sewage spills. The programme, called Dirty Business, features the story of eight-year-old Heather Preen who died of E. coli in 1999, after a family trip to the beach in Devon. The makers of the Channel 4 show tell the Mirror they hope it will do for water pollution what 'Mr Bates vs The Post Office' did for the Horizon IT scandal.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Truth is antidote to Putin's poison' and 'Europe sabotage campaign'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3325/live/999e8af0-0ac7-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-16T05:33:37.000Z",
      "dateModified": "2026-02-16T05:33:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cabinet Secretary front runner Antonia Romeo previously spoken to about management style",
    "url": "https://www.bbc.com/news/articles/cpqwlwndj9yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1df/live/43ef17d0-0abf-11f1-84a4-fd987d46a4b5.jpg",
    "tag": "Trending",
    "date": "2026-02-16T01:07:51.000Z",
    "description": "7 hours agoHarry FarleyPolitical correspondentGetty ImagesDame Antonia Romeo has held senior roles at the Department for International Trade, the Mini",
    "body": "7 hours agoHarry FarleyPolitical correspondentGetty ImagesDame Antonia Romeo has held senior roles at the Department for International Trade, the Ministry of Justice and the Home OfficeThe frontrunner to become the country's most senior civil servant was spoken to about her management and leadership style after an inquiry into a complaint against her.Dame Antonia Romeo, understood to be the government's favoured candidate for cabinet secretary, was investigated over three allegations when she worked in New York in 2017.The outcome of that investigation was \"there is no case to answer\", Dame Antonia was told in a letter seen by BBC News. But a source said she faced \"tough conversations\" about her leadership style.A Cabinet Office spokesperson emphasised that it was a single complaint that was dismissed, and said Dame Antonia has a long \"record of excellent public service\".A source said that \"there were some issues of personal style that grated with people\".\"That was not an easy conversation. She took her medicine,\" they said, but they added there had been a thorough investigation and nothing of substance was upheld.The three allegations came from a single complaint and were related to her use of expenses and accusations of bullying when she was the government's consul-general in New York, the BBC understands.In a letter seen by BBC News outlining the outcome of the investigation Rupert McNeil, then the government chief people officer, told Dame Antonia \"there is no case to answer\".McNeil added in the letter from March 2017: \"I appreciate processes of this type are always distressing, but as discussed, they are rich sources of feedback about management and leadership style.\"I know from our conversation that you are very alert to this, and this process has given you rich insight.\"The letter, marked \"official - sensitive\", was shared with Jeremy Heywood, the then-cabinet secretary, John Manzoni, the then-permanent secretary at the Cabinet Office, Kim Darroch, then-British ambassador to the US, the HR directors at the foreign office and cabinet office, and Simon McDonald, now Lord McDonald, who was then-head of the foreign office.Lord McDonald made a highly unusual intervention this week, saying he had tried to get in touch with No10 about the possibility of Dame Antonia being appointed and warning \"more due diligence\" was needed.\"The due diligence needs to be thorough. If the candidate mentioned in the media is the one, in my view, the due diligence has some way still to go,\" he told Channel 4 News.Others in government defended Dame Antonia vociferously, accusing Lord McDonald of a \"disgusting\" and \"hugely irresponsible\" attack on her.One official who has worked with her recently described her as \"the most inspiring leader in the civil service\".\"There are people right from the very top to the most junior staff who are outraged and completely baffled. Not only that it's an attack on a civil servant who can't defend themselves, but also that it is not remotely true.\"People follow her and want to work with her.\"Another official who spoke to the BBC stressed that in the nine years since the investigation, the civil servant had led three government departments with a combined staff of around 150,000 people and not received a single complaint.Sir Matthew Rycroft, who was UK permanent representative to the UN at the time Romeo was in New York in 2017, said: \"The decision maker was the CEO of the Civil Service. He concluded that there was no case to answer, and he reported this to the Cabinet Secretary who agreed.\"I was the senior FCDO official in New York at the time, and having seen the relevant documentation myself, I can confirm that I too was satisfied there was no case to answer in relation to the single formal complaint that was made.\"Rupert McNeil, the head of HR for the British government at the time, said: \"As the head of the Civil Service Human Resources function at the time, I can confirm the investigation into the one formal complaint against Antonia nine years ago was done thoroughly and independently – and it concluded there was no case to answer.\"The smears being thrown against her are reprehensible and hypocritical. They undermine every investigation that the civil service has run.\"Former officials making these entirely inappropriate remarks were actively part of the governance of civil service processes and so it is astonishing that they feel they can make comments now which they never made to me at the time.\"She is an excellent public servant who has served governments of all stripes with diligence and respect.\"A Cabinet Office spokesperson said: ⁠\"As we have repeatedly made clear, one formal complaint was raised nine years ago and the allegations were dismissed on the basis that there was no case to answer. This letter confirms that is the case.\"Antonia Romeo is an outstanding leader with a 25-year record of excellent public service.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cabinet Secretary front runner Antonia Romeo previously spoken to about management style",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1df/live/43ef17d0-0abf-11f1-84a4-fd987d46a4b5.jpg"
      ],
      "datePublished": "2026-02-16T01:07:51.000Z",
      "dateModified": "2026-02-16T01:07:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What is the dart frog toxin allegedly used to kill Alexei Navalny?",
    "url": "https://www.bbc.com/news/articles/cm289we7jzdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fc2/live/a4c47040-0a98-11f1-9640-7f85e4d0c189.jpg",
    "tag": "Trending",
    "date": "2026-02-16T08:05:27.000Z",
    "description": "31 minutes agoGetty ImagesEpibatidine, which can be secreted by Anthony's poison arrow frog onto its skin, was blamed for Alexei Navalny's death by fi",
    "body": "31 minutes agoGetty ImagesEpibatidine, which can be secreted by Anthony's poison arrow frog onto its skin, was blamed for Alexei Navalny's death by five European nationsRussian opposition leader Alexei Navalny was killed using a deadly toxin found in poison dart frogs in South America, the UK and some of its European allies have said.Traces of epibatidine were found in samples from Navalny's body and highly likely resulted in his death in a Siberian penal colony two years ago, the UK Foreign Office said.The allies said only the Russian state had the \"means, motive and opportunity\" to deploy this lethal toxin.The Kremlin dismissed the finding as \"an information campaign\", according to Tass news agency.What is the toxin?Epibatidine is a natural neurotoxin isolated from the skin of the Ecuadorian poison dart frog, according to toxicology expert Jill Johnson.It was \"200 times more potent\" than morphine, she told BBC Russian.Epibatidine can be found naturally in dart frogs in the wild in South America as well as being manufactured in a laboratory.Dart frogs in captivity do not produce this toxin and it is not found naturally in Russia, the European allies said in their statement.Species known as Anthony's poison arrow frog and the Phantasmal poison frog are among those that secrete the toxin onto their skin.Although epibatidine has been investigated as a painkiller and for relief from painful inflammatory lung conditions, it is not used clinically because of its toxicity.How does dart frog poison work?This powerful chemical compound acts on nicotinic receptors in the nervous system, according to Johnson.Because it overstimulates these nerve receptors, if dosed correctly, it can cause muscle twitching, paralysis, seizures, slow heart rate, respiratory failure and ultimately death, she explained.Alastair Hay, professor of environmental toxicology at the University of Leeds, told PA that its effects can result in breathing being blocked, and that \"any person poisoned dies from suffocation\".The toxin being found in someone's blood \"suggests deliberate administration\", he added.Epibatidine toxicity can even be \"increased by co-administration of certain other drugs and these combinations have been researched\", Hay said.How rare is the toxin?Epibatidine is extremely rare and found in only one geographic region and only in trace amounts, Johnson said.It is understood the dart frog referred to by the UK Foreign Office and others was Anthony's poison arrow frog, a species endemic to Ecuador and Peru.The frogs produce the chemical through eating the right foods to produce alkaloids - a type of organic compound - that make epibatidine and accumulate it in their skin. If the frog's diet changes, its epibatidine reserves will be depleted.\"Finding a wild frog in the right place, eating exactly the food needed to produce the right alkaloids, is almost impossible... almost,\" Johnson said.\"This is an incredibly rare method of human poisoning. The only other cases of epibatidine poisoning I know of were laboratory-based and non-fatal.\"What has Russia said?European laboratories confirmed Navalny died from the obscure poison, the allies said on Saturday.Moscow has previously claimed Navalny died of natural causes, though Navalny's widow Yulia Navalnaya has consistently argued her husband was \"murdered\" by poisoning.The Russian embassy in London denied Moscow was involved in Navalny's death and described the announcement as \"feeble-mindedness of Western fabulists\" and \"necro-propaganda\".Kremlin spokesperson Maria Zakharova was quoted by Russian state-run news agency Tass as saying: \"All the talks and statements are an information campaign aimed at distracting attention from the West's pressing problems.\"Hamish de Bretton-Gordon, a former UK and Nato senior officer, who is also a chemical weapons expert, said people should take anything the Kremlin says, including about Navalny's death, \"with a pinch of salt\".He told BBC Radio 4's Today programme that Nato countries \"have demonstrated that they have the evidence that Navalny was murdered by the state\".At the time of his death, Navalny had been in jail for three years and had latterly been transferred to an Arctic penal colony.According to Russian accounts, the 47-year-old took a short walk, said he felt unwell, then collapsed and never regained consciousness.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What is the dart frog toxin allegedly used to kill Alexei Navalny?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fc2/live/a4c47040-0a98-11f1-9640-7f85e4d0c189.jpg"
      ],
      "datePublished": "2026-02-16T08:05:27.000Z",
      "dateModified": "2026-02-16T08:05:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie pleas for Nancy Guthrie release as FBI analyses glove",
    "url": "https://www.bbc.com/news/articles/c5yrv2g16e2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1cd8/live/d17cfc80-0b04-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-16T04:53:41.000Z",
    "description": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove4 hours agoGrace Eliza GoodwinWatch: 'It is never too lat",
    "body": "'It's never too late': Savannah Guthrie's new plea for mother's release as FBI analyses glove4 hours agoGrace Eliza GoodwinWatch: 'It is never too late to do the right thing' Savannah Guthrie saysSavannah Guthrie has issued a plea for her 84-year-old mother's release two weeks after she disappeared, urging anyone involved that \"it is never too late to do the right thing\".In the US TV anchor's latest video appeal, she addresses \"whoever has her, or knows where she is\", adding that Nancy Guthrie's loved ones \"still have hope\". It comes as investigators analyse DNA found on a glove that they recovered. The glove being studied appears to match one that was worn by a suspect who appeared in doorbell-camera footage taken the night Nancy Guthrie went missing.Authorities believe the suspect in the video kidnapped Guthrie in the early hours of the morning of 1 February.The FBI said on Sunday that investigators recovered the glove from a field near the side of the road about two miles from Guthrie's home in Tucson, Arizona. The agency collected about 16 gloves from various locations near her home, though most turned out to have been discarded by people searching for her.\"The one with the DNA profile recovered is different and appears to match the gloves of the subject in the surveillance video,\" the FBI said. The agency said it has received preliminary DNA test results on the glove and is still waiting for \"quality control and official confirmation\" before entering an \"unknown male profile\" into its database.Earlier this week, investigators released footage from a doorbell camera at Guthrie's front door that shows a masked man wearing gloves and a backpack. In the video, the suspect walks toward the camera and tries to cover it with his gloved hand before grabbing some brush from the front yard to block the camera's view. After conducting a forensic analysis of the video, the FBI announced earlier this week that it believed the man was between 5ft 9in and 5ft 10in (175-177cm) tall with an average build.The FBI also highlighted the backpack the suspect was wearing in the video, identifying it as a 25-litre Ozark Trail Hiker Pack.Watch: New video shows masked person outside Nancy Guthrie's homeThe county sheriff's department has said the suspect description \"remains a key focus\", but added that \"investigators are not ruling out any individuals or possibilities\".Guthrie was last seen on 31 January, when a family member dropped her off at her home following a get-together at her daughter Annie's house. Members of her church noticed her absence the following day and notified her family.In the two weeks since Guthrie's disappearance, the FBI and Pima County Sheriff's Office have conducted a massive search operation involving helicopters, sniffer dogs and hundreds of officers while taking in thousands of call-in tips. Officials have warned that she may be in dire health without her medication. Pima County Sheriff Chris Nanos has said Guthrie was \"not in good physical health\" but had no reported cognitive issues.Local officials have also said investigators found DNA at Guthrie's address that did not belong to her or anyone close to her.The FBI has increased the reward for information about Guthrie's disappearance from $50,000 (£36,700) to $100,000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie pleas for Nancy Guthrie release as FBI analyses glove",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1cd8/live/d17cfc80-0b04-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-16T04:53:41.000Z",
      "dateModified": "2026-02-16T04:53:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]