[
  {
    "title": "Radical with Amol Rajan - Beyond Ultra-Processed Foods: Can Farmers Fix Our Health and the Planet? (James Rebanks) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002mbys?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-11-20T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·20 Nov 2025,·69 minsAvailable for over a yearIs it possible to produce enough healthy food to feed the nation whilst also restoring nature? The farmer and best-selling author James Rebanks thinks it is but says there needs to be a radical change to government policy and our entire food system. \nHe explains why he thinks farming subsidies are flawed, the unintended consequences of cheap food, and the delicate balance between food security and environmental stewardship. \nAnd from the hills of Cumbria to a remote island in Norway, he also reflects on the lessons he learnt about masculinity whilst writing his latest book, ‘The Place of Tides’. \nA government spokesperson said: “Farmers are stewards for our nation's land and for our food security. Farming also plays a central role in our mission to kickstart economic growth.  \n“We understand that when farmers run profitable businesses, it’s good for the whole economy.  \n“That is why we are backing them through new technology, streamlined regulation and our nature-friendly farming schemes are helping farmers produce food for the nation.” \n(00:05:34) James explains his rise to farming fame \n(00:08:49) Why British farming is in crisis \n(00:16:42) Food production vs nature recovery \n(00:24:35) Our cheap food system \n(00:32:27) Supermarkets and food security \n(00:36:29) Restoring the balance between supermarkets and farmers \n(00:39:00) How can consumers help British farmers? \n(00:42:15) What do we do to build a better system? \n(00:46:00) Farming and politics \n(00:49:30) What it's like to be a British farmer and James’ family history \n(00:52:43) From the farm to Oxford University \n(00:57:37) How a visit to a remote island in Norway led to ‘The Place of Tides’ \n(01:05:17) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O’Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Beyond Ultra-Processed Foods: Can Farmers Fix Our Health and the Planet? (James Rebanks) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-11-20T06:00:00.000Z",
      "dateModified": "2025-11-20T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhdbrt?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Nov 2025,·33 minsThe Google Boss And The Massive AI GambleNewscastAvailable for over a yearToday, the CEO of Google gives a rare interview to discuss AI, economic risk, climate change and much more. \nFaisal Islam has been speaking to Sundar Pichai, the head of Google’s parent company Alphabet, about the future of the AI bubble.\nThe tech boss warned that “no company is going to be immune” if the AI bubble bursts after its current period of boom. This comes as some analysts expressed fear that stock markets are heading for a repeat of the dotcom bubble burst of the late 1990s.\nThey also discussed the environmental cost of powering AI, the potential risks to jobs and whether the UK will benefit from the current boom. BBC economics editor Faisal Islam joins Adam in the studio.\nYou can listen to a longer version of the interview with Sundar Pichai here - https://www.bbc.co.uk/sounds/play/p0mh56kj\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi and Anna Harris. The social producer was Beth Pritchard. The technical producer was James Piper. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Why was KPop Demon Hunters banned by a school?",
    "url": "https://www.bbc.com/news/articles/cj414lgjykpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/3f796040-c639-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T19:36:18.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live13 ",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live13 hours agoThis week, Donald Trump ordered the release of the Epstein files, heavy rain and cold weather gripped the UK, and the BBC's annual Children In Need appeal raised more than £45m for charity.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy testing your memory? Try last week's quiz, or have a go at something from the archives.TelevisionK-popFilmSouth KoreaNetflix",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Why was KPop Demon Hunters banned by a school?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/3f796040-c639-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T19:36:18.000Z",
      "dateModified": "2025-11-20T19:36:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer calls Nigel Farage 'spineless' over handling of racism claims",
    "url": "https://www.bbc.com/news/articles/cvgkgyr4515o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/149c/live/0775a310-c662-11f0-ae65-576a66a3c307.jpg",
    "tag": "Trending",
    "date": "2025-11-21T08:07:23.000Z",
    "description": "11 minutes agoChris MasonPolitical editorSir Keir Starmer has labelled Nigel Farage \"spineless\" and accused him of failing to adequately explain repor",
    "body": "11 minutes agoChris MasonPolitical editorSir Keir Starmer has labelled Nigel Farage \"spineless\" and accused him of failing to adequately explain reports of racist and antisemitic comments it is alleged the Reform UK leader made while at school.This week, the Guardian newspaper reported a number of Farage's contemporaries at the private Dulwich College, south London, alleged the young Reform UK leader had joked about gas chambers and put another pupil in detention when he was a prefect, because of the colour of their skin.Reform UK insist the allegations are \"entirely without foundation\".Reacting to Sir Keir's comments, Farage said: \"For the weakest prime minister in living memory to call me spineless is utterly ludicrous.\"Speaking to reporters on his way to the G20 Summit in South Africa, Sir Keir claimed Farage \"needs to explain the comments, or alleged comments that were made, and he needs to do that as soon as possible\".Sir Keir added that the Reform leader \"has not got a good track record in relation to this,\" given one of Reform's MPs remained in the parliamentary party after remarks she made about the ethnicity of people in television adverts.Sarah Pochin, who was elected to parliament in a by-election in May, said last month \"it drives me mad when I see adverts full of black people, full of Asian people, full of people who are basically anything other than white\"Pochin argued \"it does not reflect our society\".She quickly apologised for the remarks, which the prime minister described at the time as \"shocking racism\".Farage said they were \"ugly\" but were not intended to be racist.Asked about Farage, Sir Keir said: \"The man is spineless\". \"If that had been someone in my party, I'd have dealt with it straightaway,\" he said.Farage \"needs to explain the latest allegations and whilst he's at it he needs to explain why he's too spineless to take action in relation to what is obvious racism in the comments of his fellow MP,\" Sir Keir said.\"He's got plenty of things to say about plenty of things, apart from showing some leadership when it comes to racism.\"Responding to the prime minister's comments Farage said: \"For the weakest prime minister in living memory to call me spineless is utterly ludicrous. \"The voters will have their say on both of us at the ballot box next May.\"A Reform source said the prime minister was \"desperate, sinking in the polls and lashing out\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer calls Nigel Farage 'spineless' over handling of racism claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/149c/live/0775a310-c662-11f0-ae65-576a66a3c307.jpg"
      ],
      "datePublished": "2025-11-21T08:07:23.000Z",
      "dateModified": "2025-11-21T08:07:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government borrowing for October higher than expected",
    "url": "https://www.bbc.com/news/articles/c20508068jno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/00af/live/652a1f60-c62e-11f0-a77c-5fa0b63f9ebb.jpg",
    "tag": "Trending",
    "date": "2025-11-21T08:15:57.000Z",
    "description": "10 minutes agoGetty ImagesUK government borrowing was more than £2bn higher than expected last month according to the latest official figures.Borrowin",
    "body": "10 minutes agoGetty ImagesUK government borrowing was more than £2bn higher than expected last month according to the latest official figures.Borrowing - the difference between public spending and tax income - was £17.4bn in October, down from £19.2bn in the same month last year, the Office for National Statistics (ONS) said.Analysts had expected the figure to be £15bn, slightly higher than the Office for Budget Responsibility's (OBR) March forecast of £14.4bn.ONS chief economist Grant Fitzner said while borrowing was down compared with the same month last year, it was \"still the third-highest October figure on record in cash terms\".\"While spending on public services and benefits were both up on October last year, this was more than offset by increased receipts from taxes and National Insurance contributions,\" he said.In the financial year to October, borrowing was £116.8bn, which was £9bn more than the same seven-month period in 2024. It was the second-highest borrowing for April to October since records began in 1993, after 2020.The borrowing figures come less than a week before Chancellor Rachel Reeves unveils her Budget, and she has previously confirmed both tax rises and spending cuts are on the table.Chief Secretary to the Treasury James Murray said at the moment £1 of every £10 in taxpayer money was spent on interest on national debt.\"That money should be going to our schools, hospitals, police and armed forces,\" he said.\"That is why we are set to deliver the largest primary deficit reduction in both the G7 and G20 over the next five years - to get borrowing costs down.\"Shadow chancellor Sir Mel Stride said borrowing so far this financial year had been the highest on record besides the pandemic.\"If Labour had any backbone, they would control spending to avoid tax rises next week,\" he said.James Smith from investment bank ING said the figures would not be welcomed by the chancellor ahead of her Budget, but her fiscal rules were about what happens later this decade, rather than the current picture.\"Today's data is not helpful, it shows that the government is borrowing more than expected, but it doesn't necessarily change the decisions next week,\" he told the BBC's Today programme.Nick Ridpath, research economist at the Institute for Fiscal Studies, noted government borrowing for the year to date had continued to exceed forecasts from the OBR, \"to the tune of around £10bn\".\"What this highlights is that forecasts for the level of borrowing this year are subject to considerable uncertainty, never mind those for borrowing in four or five years' time,\" he said.While the borrowing figures should not be over emphasised, Mr Ridpath said that ahead of the Budget they highlighted the uncertainty around pressures on spending and tax revenues and \"stubbornly high costs of servicing government debt\".The chancellor needs to find more money to meet her self-imposed rules for government finances, whcih she has described as \"non-negotiable\".The two main rules are:Not to borrow to fund day-to-day public spending by the end of this parliamentTo get government debt falling as a share of national income by the end of this parliamentThe BBC understands that newer assessments from the OBR have put the gap in public finances that Reeves needs to fill at £20bn.Mr Ridpath said: \"Operating with minimal fiscal margin for error is risky, and this is one reason why the chancellor might sensibly take steps to increase her so-called 'fiscal headroom' at next week's Budget.\"Separate data from the ONS showed that over the month of October retail sales fell by 1.1% - the first monthly drop since May.\"Supermarkets, clothing stores and online retailers all saw slower sales, with feedback from some retailers that consumers were waiting for November's Black Friday deals,\" Mr Fitzner said.Ruth Gregory, deputy chief UK economist at Capital Economics, said that together the latest government borrowing and retail sales figures painted a \"pretty grim picture\" of the economy.Higher local authority spending had been \"a key source of the overshoot\" in government borrowing for the seven months of the financial year, she said, but slow growth in tax receipts had also contributed.\"This only underscores the generally poor fiscal picture facing the chancellor as she looks set to tighten fiscal policy in the forthcoming Budget,\" Ms Gregory said.However, she noted the monthly fall in retail sales \"isn't quite as bad as it looks\" as it comes off the back of four consecutive months of increases, but also said that consumer confidence had declined, which \"suggests that consumers aren't exactly chipper at the moment\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government borrowing for October higher than expected",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/00af/live/652a1f60-c62e-11f0-a77c-5fa0b63f9ebb.jpg"
      ],
      "datePublished": "2025-11-21T08:15:57.000Z",
      "dateModified": "2025-11-21T08:15:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streaming platform Twitch added to Australia's teen social media ban",
    "url": "https://www.bbc.com/news/articles/cx2n2955g10o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63b5/live/7adb6b90-c67c-11f0-82c9-67e583f6a4cd.jpg",
    "tag": "Trending",
    "date": "2025-11-21T02:33:49.000Z",
    "description": "6 hours agoLana LamSydneyGetty ImagesTwitch is the latest platform to be included in Australia's teen social media banTwitch, a streaming platform pop",
    "body": "6 hours agoLana LamSydneyGetty ImagesTwitch is the latest platform to be included in Australia's teen social media banTwitch, a streaming platform popular with gamers, has been added to Australia's  teen social media ban which starts next month.It joins other platforms such as Facebook, Instagram, Tik Tok and Snapchat that must ensure under-16s cannot open accounts and existing ones are closed from 10 December.Australia's internet regulator overseeing the ban said Twitch - owned by Amazon -has been included as its main purpose was \"online social interaction\" where users were encouraged to chat to each other about posted content.A Twitch spokesperson said Australians under 16 will not be able to open a Twitch account from 10 December, and from 9 January, existing under-16s accounts will be deactivated.On her reasons why Twitch had been included, eSafety Commissioner Julie Inman Grant said it was \"a platform most commonly used for livestreaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted\".No more platforms are expected to be added to the ban before the start date next month, Ms Inman Grant said. The government has previously said the ban is aimed at reducing the \"pressures and risks\" children can be exposed to on social media, including harmful content.Founded in 2007, Twitch is a popular livestreaming platform, where people typically play video games while chatting to viewers.Last year, it launched plans to share more of its revenue with creators as part of a shake-up, allowing streamers to make money through fans subscribing to their channel.The revenue is split equally between Twitch and the creator, after fees are paid.Twitch's policy forbids anyone under 13 to use its platform and users aged between 13 and the legal age of adulthood in their country can join if they have permission from their parent or guardian.Ms Inman Grant also said on Friday that Pinterest, where users compile online notice boards of images, would not be included in the ban because its core purpose was not about online social interaction.Instead, the platform was \"more commonly used by individuals collating images for inspiration and idea curation,\" she said.Australia's world-first under-16s social media ban also includes YouTube, Reddit, Kick, Threads and X.The ban means tech companies must take \"reasonable steps\" to stop under-16s from using their platforms or risk being fined up to $49.5m (US$32m, £25m).Earlier this week, Meta - which owns Facebook, Instagram and Threads - announced it would start closing accounts of teenagers under 16 from 4 December, a week before the official ban. It's not clear how companies will enforce the ban but some possibilities included the use of government IDs, face or voice recognition and age inference. The latter of these uses online information other than a date of birth - such as online behaviour or interactions - to estimate a person's age.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streaming platform Twitch added to Australia's teen social media ban",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63b5/live/7adb6b90-c67c-11f0-82c9-67e583f6a4cd.jpg"
      ],
      "datePublished": "2025-11-21T02:33:49.000Z",
      "dateModified": "2025-11-21T02:33:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Repairs left unfinished as firm behind huge schools PFI contract goes into liquidation",
    "url": "https://www.bbc.com/news/articles/c5y0yrl111qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4694/live/f48c19e0-c649-11f0-af50-5d6972195d70.jpg",
    "tag": "Trending",
    "date": "2025-11-21T05:38:02.000Z",
    "description": "3 hours agoBranwen JeffreysEducation EditorThe company behind the largest schools Private Finance Initiative (PFI) contract in England is going into l",
    "body": "3 hours agoBranwen JeffreysEducation EditorThe company behind the largest schools Private Finance Initiative (PFI) contract in England is going into liquidation, heightening concerns that 88 schools in Stoke-on-Trent could be left with unfinished building work and repairs.Schools in the city have paid Transform Stoke Schools Ltd (TSSL) to keep their buildings in good condition over the course of a 25-year contract that expired on 25 October. In a letter seen by the BBC, the chief executive of Stoke-on-Trent City Council told schools TSSL was going into Creditor Voluntary Liquidation - meaning its directors are taking steps to close it down.The council told the BBC its priority was ensuring children have safe, high-quality buildings.The council made clear as the contract drew to an end in late October that not all repairs would be finished, and said it was working with the main contractor to ensure work continued.Now the letter sent to schools this week says some suppliers may not have been paid and unfinished works not \"fully and satisfactorily completed\".  Warranties for some work that has been done have not yet been obtained.In February, the BBC reported concerns that TSSL would walk away at the end of the contract leaving schools with large repair bills.The investigation revealed almost half the schools have been withholding payments on the contract because of disputes over outstanding work and concerns about the quality of some repairs.Gareth Snell, Labour MP for Stoke-on-Trent Central, told the BBC it was \"extremely disappointing but entirely unsurprising that TSSL is walking away from the commitments they made\".He also said there were \"serious answers needed over the oversight of the contract\" by the city council and schools had questions over \"when work will be finished, how it is being paid for and who will make sure the buildings used to teach our children are in good condition\".The PFI contract - under which a private company is paid to maintain buildings - in Stoke-on-Trent is the first of dozens of similar deals across England which are due to expire in the coming years.Stoke-on-Trent City Council told the BBC it wanted to reassure schools and parents that it had planned for the possibility of TSSL going into liquidation, holding back money and setting aside £3.5 million.The council said it planned to work with schools to get a clear list of outstanding work.\"Our commitment remains to deliver the best possible outcome and ensure that children in Stoke-on-Trent have safe, high-quality school environments,\" it said.In the longer term, the council said a full evaluation of the contract would be needed.The BBC has asked the directors of TSSL for a response to the concerns.What happens in Stoke-on-Trent will have implications for dozens of similar PFI deals, many due to come to an end from 2025 onwards.In 2020 the National Audit Office warned  that without preparation for contract end \"there is a significant risk that vital infrastructure such as schools and hospitals will not be returned to the public sector in the right condition and taxpayers and service users will bear the brunt of additional costs\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Repairs left unfinished as firm behind huge schools PFI contract goes into liquidation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4694/live/f48c19e0-c649-11f0-af50-5d6972195d70.jpg"
      ],
      "datePublished": "2025-11-21T05:38:02.000Z",
      "dateModified": "2025-11-21T05:38:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prostate cancer screening trial to recruit thousands of men",
    "url": "https://www.bbc.com/news/articles/c2kpk80epp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7430/live/1f791d40-c65b-11f0-b709-3340c608d444.jpg",
    "tag": "Trending",
    "date": "2025-11-21T01:45:04.000Z",
    "description": "Biggest prostate cancer screening trial in decades begins in UK7 hours agoFergus WalshMedical EditorGettyA major prostate cancer screening trial aimed",
    "body": "Biggest prostate cancer screening trial in decades begins in UK7 hours agoFergus WalshMedical EditorGettyA major prostate cancer screening trial aimed at finding the best way to detect the disease has been launched in the UK.  The first letters have been sent out from GPs inviting men to join the study, the biggest of its kind in decades.The £42 million Transform trial is funded by Prostate Cancer UK and the National Institute for Health and Care Research.Hashim Ahmed, trial chief investigator, said: \"Transform is truly game-changing… the start of recruitment today marks a pivotal step towards getting the results men urgently need to make prostate cancer diagnosis safe and more effective so that we can unlock the potential of prostate cancer screening in the UK.\"The trial will recruit men aged 50-74, with a lower age limit of 45 for black men, who have twice the risk of developing and dying from prostate cancer compared with white men.It won't be possible to volunteer for the trial, but Prostate Cancer UK is strongly encouraging anyone who receives a letter to take part.The trial will look at how rapid MRI scans of the prostate could be combined with prostate-specific antigen (PSA) blood tests in order to improve the accuracy of cancer diagnosis.Currently, men over 50 can request a PSA test, which looks for abnormally high levels of protein in the blood, but this is unreliable, picking up many prostate cancers that would never need treatment, and missing others that do.The trial will also use spit tests, which extract DNA from saliva, to see if this is more accurate than PSA readings.Matthew Hobbs, director of research at Prostate Cancer UK, said current diagnostics methods don't find enough aggressive cancers, and cause too much harm.\"We hear from men who were diagnosed late, whose lives may have been saved if they'd been screened or tested earlier. We also hear from a lot of men who have suffered incontinence or impotence because of treatments they had,\" said Mr Hobbs. \"Some of those men didn't need to have those treatments, and that's the harm that we need to try to avoid.\"'If we want to stop 12,000 men dying early every year, it's the obvious solution' Danny Burkey, 60, from west Yorkshire, is terminally ill with prostate cancer. By the time his condition was diagnosed four years ago, it had already spread to his bones.The former teacher and father of three told the BBC that if men were offered regular screening from the age of 50, his disease might have been caught when it was still curable.\"I think that a screening programme would be a game changer. If you want men to not be in the position I'm in, and if we want to stop 12,000 men dying early every year, it's the obvious solution.\"Danny BurkeyDanny, 60, with wife Jeanette, was diagnosed with prostate cancer four years ago - but it had already spread to his bones The opening of the trial comes a week before the National Screening Committee (NSC) - an expert body that advises the NHS - is due to announce whether to recommend the introduction of screening for the disease, the most common cancer in men in the UK.Previously, the NSC had concluded that the harms of screening outweighed the benefits.Initial results of the Transform trial are due in around two years, after which it will be expanded by up to 300,000 men across the UK.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prostate cancer screening trial to recruit thousands of men",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7430/live/1f791d40-c65b-11f0-b709-3340c608d444.jpg"
      ],
      "datePublished": "2025-11-21T01:45:04.000Z",
      "dateModified": "2025-11-21T01:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strictly Come Dancing: Star arrested on suspicion of rape",
    "url": "https://www.bbc.com/news/articles/cvgmgyrdlxdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af5d/live/d0206dd0-c668-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-21T00:44:14.000Z",
    "description": "8 hours agoNoor NanjiCulture reporterAn unnamed star from Strictly Come Dancing has been arrested on suspicion of rape.Hertfordshire Police said the m",
    "body": "8 hours agoNoor NanjiCulture reporterAn unnamed star from Strictly Come Dancing has been arrested on suspicion of rape.Hertfordshire Police said the man, who was arrested last month, had been released on bail under investigation.A BBC spokesperson told BBC News: \"It would not be appropriate to comment on an ongoing police investigation.\"According to the Sun, the man is alleged to have raped a woman after a BBC event. The newspaper says the woman was not a contestant or professional dancer on the show, but had met the man due to his participation in the competition.It is understood the development is not related to the current series of Strictly.In a statement, Hertfordshire Police said: \"A man was released on police bail under investigation having been arrested in London on Monday 13 October on suspicion of rape.\"The police force said the allegations related to an incident which happened in Hertfordshire.\"Meanwhile inquiries by officers from Hertfordshire Constabulary's Public Protection team will continue.\"Given the nature of the allegations, it would be inappropriate to make any further comment at this time.\"It comes after another man involved with the hit BBC dance show was also arrested on suspicion of rape in August.The Metropolitan Police said the man was also suspected of \"non-consensual intimate image abuse\".It is not known what role that individual had in the programme.Strictly, which has aired since 2004 and is predominantly filmed at Elstree Studios, has faced multiple controversies over the past few years relating to the behaviour of some of its professionals and celebrity guests.Separately, the BBC launched an investigation earlier this year into alleged drug use by two of the show's stars, who have not been named.In August, the Met said it was investigating allegations of drug use on the hit dance show.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strictly Come Dancing: Star arrested on suspicion of rape",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af5d/live/d0206dd0-c668-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T00:44:14.000Z",
      "dateModified": "2025-11-21T00:44:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer arrives in South Africa as G20 gathers without Trump",
    "url": "https://www.bbc.com/news/articles/ceq0q39812qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/892c/live/61174a40-c6b2-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-21T05:21:15.000Z",
    "description": "3 hours agoChris Mason,Political editor and Raphael Sheridan,Senior political producer, travelling with the prime ministerReutersThe prime minister ha",
    "body": "3 hours agoChris Mason,Political editor and Raphael Sheridan,Senior political producer, travelling with the prime ministerReutersThe prime minister has arrived in Johannesburg in South Africa for a gathering of world leaders at the annual G20 summit.The summit brings together the 20 biggest economies, although Donald Trump has decided not to attend over widely discredited claims that white people are being persecuted in the country.Sir Keir Starmer, whose critics label him \"never here Keir\" because of the frequency of his international trips, will emphasise the benefits of a prime minister acting as an ambassador for UK businesses abroad.Before the summit formally opens, Sir Keir will visit a Johannesburg depot to see trains that were built in Derby and announce a new deal where the UK will \"provide strategic advice and consultancy services\" to South Africa's railways.An organisation called Crossrail International, which is owned by the UK government, will carry out the work.It has also signed a deal with Vietnam to provide similar services there.Downing Street argues that Africa provides what it calls \"unparalleled future opportunities for UK businesses\" given half of Africans are under the age of 20 and more than a quarter of the world's population will live in Africa by 2050.\"I will focus on the deals we can do, the business we can do, with our partner countries and make sure that the work we do internationally is impacting directly at home,\" he told reporters on the flight to South Africa.\"If you want to deal with the cost of living and make people better off with good secure jobs, investment from G20 partners and allies is really important,\" he added.Reuters",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer arrives in South Africa as G20 gathers without Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/892c/live/61174a40-c6b2-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T05:21:15.000Z",
      "dateModified": "2025-11-21T05:21:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Energy price cap to edge up in January as temperatures plunge",
    "url": "https://www.bbc.com/news/articles/c2lplg7d9ewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b436/live/e38ddb60-c630-11f0-9ad1-dbbd54dbf5de.jpg",
    "tag": "Trending",
    "date": "2025-11-21T08:17:49.000Z",
    "description": "16 minutes agoKevin PeacheyCost of living correspondentMillions of households will see a slight rise in gas and electricity prices at the height of wi",
    "body": "16 minutes agoKevin PeacheyCost of living correspondentMillions of households will see a slight rise in gas and electricity prices at the height of winter, after regulator Ofgem outlined its next price cap.The 0.2% increase from the current cap will take effect at the start of January, and affect those on variable tariffs in England, Wales and Scotland.However, prices will be slightly lower than the same period the previous year.Gas and electricity bills remain relatively high, and the sudden drop in temperature has brought the costs to the forefront of people's minds.\"While wholesale energy costs are stabilising, they still make up the largest portion of our bills which leaves us open to volatile prices,\" said Tim Jarvis, from Ofgem.But Dame Clare Moriarty, from Citizens Advice, said: \"With bills still drastically higher than before the energy crisis, and due to rise again from April, it's high time for decisions about the longer term.\"The cap sets the maximum price that can be charged for each unit of gas and electricity, not the total bill - so those who use more energy, pay more.The Ofgem cap is illustrated with a household using a \"typical\" amount of 11,500 kWh of gas and 2,700 kWh of electricity a year with a single bill for gas and electricity, settled by direct debit.This illustrative household would see a £3 rise in its annual bill from £1,755 to £1,758.However, the amount used varies significantly between households, so the best way to calculate the change is to work out the percentage change from your own usual annual bill.Charities say they are seeing people owing increasing levels of unpaid bills and charges to suppliers. The total amount owed has reached a record £4.4bn, prompting plans from Ofgem to ensure energy companies write off some of that debt. Up to £500m could be knocked off the total under plans that the regulator wants to take effect early next year.Dhara Vyas, chief executive of Energy UK, which represents suppliers, said anyone facing difficulties paying should contact their energy provider as soon as possible.\"We know that far too many people are struggling to pay for the energy they need to use,\" she said.But she added that suppliers could help with efficient appliances, tailoring the tariff to customers' needs or ensuring people were on the correct benefits.Energy consultancy Cornwall Insight, which had expected the cap to fall slightly, said Ofgem's announcement marked \"the beginning of a potential trend\" in which the primary driver of higher bills would be government policies as opposed to higher wholesale energy prices.Principal consultant Dr Craig Lowrey said households faced bills rising further in April due to the costs of running the energy network and transitioning to net zero.But he added: \"A low carbon system means more energy security and less exposure to the rollercoaster of fossil fuel prices.\"These upfront costs represent an investment in stability and affordability for the long run, and that's a message we need to keep front and centre, while not ignoring the critical issue of immediate affordability for both households and businesses alike.\"The government has hinted at extra cost-of-living support in the Budget on 26 November.One option said to be under consideration is removing VAT from energy bills, which would cut approximately £80 from annual bills.Dr Lowrey said that any support would be \"zero-sum\" and simply \"make energy bills look lower\". \"These costs will still need to be recovered, whether through bills or through taxes, as the pipes, wires, and networks that keep the lights on still need investment as we move to a cleaner, more secure energy system,\" he added.Energy Minister Martin McCluskey said: \"We know that energy bills remain too high. That is why we are taking immediate action, with millions more families receiving £150 off their bills through the expanded Warm Home Discount scheme this winter.\"But the Conservatives said Labour's net zero policies are \"making energy unaffordable\".Shadow energy secretary Claire Coutinho said: \"Ed Miliband promised to cut everyone's energy bills by £300 but more and more experts are sounding the alarm that his plans will lock us into paying higher bills for decades.\"Despite gas prices falling, independent experts, energy suppliers, and academics say it's the extra costs of Ed's Net Zero targets that are putting upward pressure on bills.\"In the meantime, as the cold weather sets in, various tips are available to keep people warm while controlling costs, including clothing, insulation and heating rooms people are in rather than the whole home.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Energy price cap to edge up in January as temperatures plunge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b436/live/e38ddb60-c630-11f0-9ad1-dbbd54dbf5de.jpg"
      ],
      "datePublished": "2025-11-21T08:17:49.000Z",
      "dateModified": "2025-11-21T08:17:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "PwC graduate roles under threat from AI, accountancy firm boss says",
    "url": "https://www.bbc.com/news/articles/cm272510e6jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/77d1/live/32c99940-c6ad-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-21T02:34:57.000Z",
    "description": "6 hours agoNick MarshBusiness reporter, SingaporeWatch: 'It is a different set of people we are hiring now'The growth of artificial intelligence (AI) ",
    "body": "6 hours agoNick MarshBusiness reporter, SingaporeWatch: 'It is a different set of people we are hiring now'The growth of artificial intelligence (AI) may eventually lead to fewer entry-level graduates being hired, the boss of accountancy giant PwC has told the BBC.However, global chairman Mohamed Kande said AI was not behind recent job cuts at the firm, adding that the company actually needed to hire hundreds of new AI engineers but was struggling to find them.But some observers say the technology itself threatens thousands of junior jobs across the professional services industry.Speaking on the sidelines of a business summit in Singapore, Mr Kande also said big changes in the global economy, such as US President Donald Trump's sweeping tariffs, had been good for the firm's consulting business.He also addressed the company's suspension in China last year over its work on the collapsed property giant Evergrande, promising that the same mistakes \"would not happen again\".Headquartered in London, PwC is one of the Big Four accountancy firms. It provides a range of services, such as financial auditing, consulting and tax advice for business clients around the world.According to Mr Kande, advising them on how to integrate AI into their operations will be at the heart of the firm's future business strategy, even as the rapidly advancing technology affects its own hiring plans.Firms who would have previously hired PwC consultants to sift through data and documents may now use AI models instead, turning weeks of costly work into mere minutes.Every year, the company hires thousands of new graduates in entry-level positions - including 1,300 in the UK and 3,200 in the US last year - but it recently dropped long-term plans to continue increasing its headcount.In 2021, PwC said it wanted to hire 100,000 people over the course of five years - but Mr Kande said this would no longer be possible.\"When we made the plans to hire that many people, the world looked very, very different,\" he said.\"Now we have artificial intelligence. We want to hire, but I don't know if it's going to be the same level of people that we hire - it will be a different set of people.\"Last year, PwC cut more than 5,600 roles across its worldwide operation.The boss of the company's UK business has previously spoken about reducing graduate recruitment, admitting that AI was \"certainly reshaping roles\".At a global level, however, Mr Kande insisted that the AI boom was an \"exciting time\" for creating new jobs.\"We are looking for hundreds and hundreds of engineers today to help us drive our AI agenda, but we just cannot find them,\" he said.Trade turmoil 'good for us'Businesses around the world may be facing challenges adapting to AI, but in the meantime PwC appears to have benefited from the broader uncertainty in the global economy, largely fuelled by President Trump's extensive use of tariffs.\"We are receiving a lot of calls from many companies around the world asking how to navigate the current environment,\" said Mr Kande.\"It's been good for us. We need to remain relevant to our clients and we have to be in these discussions, which we are.\"However, the company took a huge reputational blow last year, when Chinese authorities suspended PwC for six months over its work on the collapsed property giant Evergrande.The firm went bust after amassing debts of more than $300bn (£230bn) and has been at the centre of a ruinous housing crisis that continues to damage lives and livelihoods in China.The country's Securities Regulatory Commission found that PwC, as the auditor, had \"covered up and even condoned\" financial fraud at Evergrande.Mr Kande, whose tenure as global chairman began after Evergrande went bankrupt, said PwC no longer faced any restrictions in China.\"Let me tell you - we changed many of our people, implemented new quality management systems and introduced new governance systems,\" he said.\"My focus has been to make sure nothing like this ever happens again.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "PwC graduate roles under threat from AI, accountancy firm boss says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/77d1/live/32c99940-c6ad-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T02:34:57.000Z",
      "dateModified": "2025-11-21T02:34:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frida Kahlo self-portrait sells for $55m, sets auction record for a female artist",
    "url": "https://www.bbc.com/news/articles/cdege1867lno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/300e/live/b18c50e0-c67d-11f0-b68a-77526b7bca21.jpg",
    "tag": "Trending",
    "date": "2025-11-21T03:23:18.000Z",
    "description": "5 hours agoOsmond ChiaBusiness reporterA surrealist painting from the 1940s by Frida Kahlo has sold for $54.7m (£41.8m) - shattering the auction recor",
    "body": "5 hours agoOsmond ChiaBusiness reporterA surrealist painting from the 1940s by Frida Kahlo has sold for $54.7m (£41.8m) - shattering the auction record for an artwork by a female artist. The painting went for more than 1,000 times its original auction price in 1980, after a tense bidding battle between two collectors, according to the Sotheby's auction house.The auction also broke the previous record for the highest amount paid for a Kahlo portrait, which sold for $34.9 million in 2021.The work - titled El sueño (la cama), which is translated to The dream (The bed)  - depicts Kahlo asleep in a canopy bed beneath a skeleton entwined with dynamite.It marks one of the Mexican artist's most \"psychologically charged\" self portraits, Sotheby's said, and was painted during a turbulent chapter in Kahlo's life - the year her former lover was assassinated and shortly after her divorce and remarriage.Kahlo, who died in 1954, is widely regarded as one of the greatest painters in the past century and became known for her personal portraits.Her work often conveyed her painful relationship with her body, disabled through polio in her childhood and serious injuries following a bus accident.Few could have imagined El sueño (la cama) selling for $55m when it was first went under the hammer at Sotheby's in 1980 for $51,000, the auction house's head of Latin American art, Anna Di Stasi, said. \"This record-breaking result shows just how far we have come, not only in our appreciation of Frida Kahlo's genius, but in the recognition of women artists at the very highest level of the market,\" she added.El sueño (la cama) is one of the few Kahlo paintings in public markets since the Mexican authorities declared her artworks as artistic monuments in the 1980s, preventing them from being exported without authorisation.Kahlo's story was adapted into a biographical film starring Salma Hayek in 2002, telling her story of her rocky relationship with her husband, artist Diego Rivera, and her injuries.The previous highest price at auction for a work by a female artist is Georgia O'Keeffe's Jimson Weed / White Flower No.1, which was sold at Sotheby's in 2014 for $44m. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frida Kahlo self-portrait sells for $55m, sets auction record for a female artist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/300e/live/b18c50e0-c67d-11f0-b68a-77526b7bca21.jpg"
      ],
      "datePublished": "2025-11-21T03:23:18.000Z",
      "dateModified": "2025-11-21T03:23:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Covid inquiry: Lockdown could have been avoided and other key findings",
    "url": "https://www.bbc.com/news/articles/cpq1q49r08go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79d7/live/b7340cf0-c5f0-11f0-9f1e-75cdd6519717.jpg",
    "tag": "Trending",
    "date": "2025-11-20T18:01:47.000Z",
    "description": "14 hours agoNick Triggle, Jim Reed, Dom Hughes and Michelle RobertsGetty ImagesThe long-awaited independent report into how well or badly the governme",
    "body": "14 hours agoNick Triggle, Jim Reed, Dom Hughes and Michelle RobertsGetty ImagesThe long-awaited independent report into how well or badly the government handled the Covid pandemic has been published. Chairwoman of the inquiry, former judge Baroness Hallett, said the UK's response could be summarised as \"too little, too late\".The report looks at whether lockdowns were timely and reasonable, and what impact rule-breaking at the heart of government had on public confidence.Here are some of the main findings. Lockdown could have been avoided completelyThe report says lockdown could have been avoided if steps such as social distancing and isolating those with symptoms along with members of their household had been introduced earlier than mid-March 2020.But by the time ministers took action it was already too late and a lockdown was inevitable, it says.By the end of January 2020 it \"should have been clear that the virus posed a serious and immediate threat\", while February 2020 was \"a lost month\" and the lack of urgency overall in government was \"inexcusable\", the inquiry found.Voluntary measures were brought in on 16 March 2020, followed by the full stay-at home lockdown seven days later.But lockdown a week earlier could have saved thousands of livesBringing in lockdown a week earlier on 16 March would have meant 23,000 fewer deaths in England in the first wave, modelling suggests. This would have equated to 48% fewer deaths in the first wave.But the report does not suggest the overall death toll for the pandemic – 227,000 in the UK by the time it was declared over in 2023 – would have been reduced by an earlier lockdown.That is very difficult to tell, as it depends on a variety of other factors that could have reduced or increased the number of deaths as the pandemic progressed.'Chaotic' UK government with key figures criticisedThe report describes a \"toxic and chaotic\" culture at the heart of the UK government during its response to the pandemic, which it said affected the quality of advice and decision-making.While it says poor behaviour was displayed by a number of senior leaders and advisers, Boris Johnson's chief adviser, Dominic Cummings  is described as having been a \"destabilising influence\".It says his actions contributed \"significantly to a culture of fear, mutual suspicion and distrust that poisoned the atmosphere in 10 Downing Street\".PADominic Cummings was Johnson's chief adviser until he resigned in November 2020The then-PM Johnson is also criticised for excessive optimism in the face of the looming pandemic and \"oscillation\" on key lockdown decisions.The report says Johnson \"should have appreciated sooner that this was an emergency that required prime ministerial leadership to inject urgency into the response\".Instead, he failed to appreciate the urgency of the situation \"due to his optimism it would amount to nothing\", it says.Meanwhile, his health secretary, Matt Hancock, is accused by Baroness Hallett of not being \"candid\" enough about the UK's ability to deal with the virus.Lockdowns left 'lasting scars'While the lockdowns of 2020 and 2021 undoubtedly saved lives, they also \"left lasting scars on society and the economy, brought ordinary childhood to a halt, delayed the diagnosis and treatment of other health issues and exacerbated societal inequalities\", it says.Children were not prioritised enough, with ministers failing to consider properly the consequences of school closures, the report says.It says the vast majority of children were not at risk of serious direct harm from Covid \"but suffered greatly from the closure of schools and requirement to stay at home\".None of the UK's four nations were adequately prepared for the sudden and enormous task of educating most children in their homes, the inquiry adds.Politicians breaking rules undermined public confidencePA MediaJohnson has been criticised in the inquiry's reportThe report says that rule-breaking by politicians and their advisers undermined public confidence in decision-making and significantly increased the risk that people wouldn't stick to the measures being put in place.It lists events such as Cummings' trip to Durham and Barnard Castle in March 2020; two visits to a second home during lockdown by the chief medical officer for Scotland, Dr Catherine Calderwood; and visits to the home of scientific adviser Prof Neil Ferguson by a woman with whom he was in relationship during lockdown.By the time details of parties and social events in Downing Street emerged in November 2021, there was a \"public outcry\", the report says.Johnson and Rishi Sunak subsequently received fixed penalty notices for their actions.Devolved governments relied too much on UKAll four nations were criticised for their planning and decision-making, which the inquiry says was hampered by the lack of trust between Boris Johnson and the first ministersThe inquiry found that at the start of 2020, while all four nations lacked urgency in their response, the devolved administrations were overly reliant on the UK government to lead the response.The four nations then differed in their strategy for exiting the first national lockdown, with Scotland, Wales and Northern Ireland adopting a more cautious approach – but this was undermined by no restrictions on travel from England, where many restrictions had been eased.The report finds that in Autumn 2020, Holyrood was the only government to learn lessons from the first lockdown, and introduced tough, locally-targeted measures which helped avoid the need for a nationwide lockdown.On the other hand, decision-making in Northern Ireland was described as \"chaotic\", while the Welsh government's approach resulted in the highest age-standardised mortality rate of the four nations between August and December 2020.How could the UK have done better?The report gives a long list of recommendations, including:To establish structures to improve communication between the four nations during an emergencyImprove consideration of the impact decisions might have on people - both by the illness and the steps taken to respond to itCreate expert groups to advise on economic and social implications, not just the scienceEnsure decisions - and their implications - are clearly communicated to the publicEnable greater parliamentary scrutiny of emergency powersThe government doesn't have to adopt the inquiry's recommendations, but it must respond to them, which could shape future policies.The inquiry has already reported back on Britain's preparedness for the pandemic, concluding that the UK failed citizens with flawed plans. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Covid inquiry: Lockdown could have been avoided and other key findings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/79d7/live/b7340cf0-c5f0-11f0-9f1e-75cdd6519717.jpg"
      ],
      "datePublished": "2025-11-20T18:01:47.000Z",
      "dateModified": "2025-11-20T18:01:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]