[
  {
    "title": "BBC World Service - The Global Story, Is Canada leading the global resistance against Trump?",
    "url": "https://www.bbc.co.uk/programmes/w3ct719x?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mwtlw4.jpg",
    "tag": "Trending",
    "date": "2026-01-20T10:00:00.000Z",
    "description": "\n        \n    \n                \n        \n        \n                            Canada’s PM Mark Carney says “the old world order is not coming back”.\n ",
    "body": "\n        \n    \n                \n        \n        \n                            Canada’s PM Mark Carney says “the old world order is not coming back”.\n                        \n                Show more\n            \n        \n        \n                            Canadian Prime Minister Mark Carney seemed to challenge Donald Trump in a speech at the World Economic Forum in Davos this week, declaring that “the old world order is not coming back” and urging fellow “middle powers” to come together. \n                            In response, Trump said Canada gets “a lot of freebies” from the United States and “they should be grateful”. \n                            After striking a major trade and tariff deal with China – the US’s rival superpower – is Carney emerging as the leader of a global resistance to Trump? And does he have an alternative vision for the world? We speak to Lyse Doucet, the BBC’s chief international correspondent. \n                            Producers: Aron Keller, Hannah Moore, Sam Chantarasak and Xandra Ellin\n                            Executive producer: James Shield \n                            Sound engineer: Travis Evans \n                            Senior news editor: China Collins\n                            (Photo: Canadian Prime Minister Mark Carney. Credit: Jessica Lee/EPA/Shutterstock)\n                        \n                Show less\n            \n        \n    \n        \n                            \n                                    Available now\n                            \n                    \n                28 minutes\n            \n                    \n    \n                \n    Last on        \n        \n            Yesterday\n            01:32GMT\n        \n        BBC World Service & Live News\n    \n\n\n    \n    \n            \n                                    \n                                                    \n    \n            \n                .\n            \n            \n                                            \n                            \n            \n                                \n                                    \n                                        \n    \n                \n            \n    \n                The Global Story\n    \n                The Global Story: Where the world meets America\n            \n    \n\n                                    \n                                \n                            \n        \n        \n                        \n        ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC World Service - The Global Story, Is Canada leading the global resistance against Trump?",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mwtlw4.jpg"
      ],
      "datePublished": "2026-01-20T10:00:00.000Z",
      "dateModified": "2026-01-20T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - What actually is Trump's 'Board of Peace'? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mwlx55?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-22T19:34:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·22 Jan 2026,·37 minsWhat actually is Trump's 'Board of Peace'?NewscastAvailable for over a yearToday, President Trump has wrapped up his second and final day at the World Economic Forum in Davos. \nThe President held an inauguration for his new “Board of Peace” and met with Ukraine’s President Zelensky - which Zelensky said included agreeing post-war security guarantees for his country. BBC chief North America correspondent Gary O’Donoghue and the Economist’s Shashank Joshi break it all down. \nAnd the former Labour Minister Andrew Gwynne confirmed his plans to retire on medical grounds triggering a by-election that could pave the way for Andy Burnham to run and ultimately launch a leadership challenge against Keir Starmer. Political correspondent Joe Pike joins Adam to explain why polticos have been speculating. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producers were James Piper and Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - What actually is Trump's 'Board of Peace'? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-22T19:34:00.000Z",
      "dateModified": "2026-01-22T19:34:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where Eagles Dare",
    "url": "https://www.bbc.co.uk/iplayer/episode/m0026pqz?at_mid=Wmb0QwHn72&at_campaign=Where_Eagles_Dare&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0026pqz&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Where_Eagles_Dare&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg",
    "tag": "Trending",
    "date": "2026-01-10T17:46:15.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeWhere Eagles DareWhere Eagles DareSeven paratroopers, led by a British intelligence officer, are sent on a seemingly impossible mission - to rescue an American officer from the apparently impregnable Castle of the Eagles. Duration2h 29mFirst shown1968Available for 16 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesKelly's HeroesThey set out to rob a bank - and nearly won a war! Offbeat war caper with Clint Eastwood2h 18mThe Guns of NavaroneGregory Peck leads an all-star cast. Behind enemy lines, guns must fall... or Allies will2h 30mThe Eagle Has LandedStars Donald Sutherland and Michael Caine in the WWII tale of a plot to kidnap Churchill2h 9mThe Heroes of TelemarkCome frozen hell or high adventure. Kirk Douglas in a true story of wartime derring-do2h 5mThe Battle of the River PlateA saga of the sea. True story of the pursuit of a seemingly unstoppable German battleship1h 54mThe Great EscapeCourage unites, freedom awaits. The all-time action classic action starring Steve McQueen2h 45mThe Cockleshell Heroes10 daring men, one impossible mission. WWII drama inspired by a true tale of heroism1h 33mDunkirkJohn Mills and Richard Attenborough star in an epic WWII mission of courage and bravery2h 10mThe SearchersHe had to find her... John Wayne in the great American western1h 54mBen-HurRevenge. Redemption. The race of a lifetime. Charlton Heston stars in the biblical epic3h 23mNorth by NorthwestHitchcock classic with Cary Grant. An adman is in deadly peril as he is framed for murder2h 11mThe Italian JobThe plan was flawless. The getaway? Legendary. Classic crime caper starring Michael Caine1h 35m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where Eagles Dare",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg"
      ],
      "datePublished": "2026-01-10T17:46:15.000Z",
      "dateModified": "2026-01-10T17:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Anger at Nato troop insult' and 'Trump delays Chagos surrender'",
    "url": "https://www.bbc.com/news/articles/cn408md7gdmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/47d3/live/e0443c70-f8b6-11f0-b5f7-49f0357294ff.png",
    "tag": "Trending",
    "date": "2026-01-24T01:04:54.000Z",
    "description": "3 hours agoBBCFor the Guardian and several of today's papers, US President Donald Trump's \"insult\" to Nato troops is in the lead. British Prime Minist",
    "body": "3 hours agoBBCFor the Guardian and several of today's papers, US President Donald Trump's \"insult\" to Nato troops is in the lead. British Prime Minister Sir Keir Starmer has rebuked the president's comments that Nato troops stayed off the front lines in Afghanistan as \"frankly appalling\". But now, his comment \"risks a further diplomatic rupture with the White House\", the paper writes.The Daily Mirror demands an apology from Trump with \"say sorry\" for the headline after his \"insult to fallen Brit heroes\". Both injured veterans and Prince Harry \"slam\" the president, it says.The Independent echoes the Miror with Starmer's call for Trump to apologise for the \"appalling slur on our war dead\". The paper honours the personnel killed in the fighting with photos of some of the 457.The Daily Express calls Donald Trump a \"bloody cheek\" after his Nato comments. \"Donald, there are 457 tragic reasons why you are so wrong\", it says with its front splashed with a convoy of hearses that carried the coffins of British troops killed in Afghanistan.\"Now Trump delays Chagos surrender\" headlines the Daily Mail. The legislation, which was due to be debated in the House of Lords on Monday, would see the archipelago handed to Mauritius, with the UK leasing a military base for £101m a year. But the debate has been pulled \"just days\" after the president \"blasted the UK for 'an act of great stupidity',\" it writes, saying the move raises \"hope of 15th U-turn\".The Daily Telegraph says UK Prime Minister Sir Keir Starmer has been \"forced\" to pull the Chagos Islands bill following \"US backlash over the deal\". Also on its front, \"genetic tests for cancer coming on the NHS\".The Sun has the latest on Brooklyn Beckham and his famous family. In an exclusive, the paper says his wife Nicola Peltz told him \"it's me or her, you can't have both\" after \"feeling upstaged by his mum Victoria at their wedding\".Young people with \"normal\" mental health conditions are being \"written off\", the author of a review into Neets - young people not in education, employment or training -  has said. Former Labour cabinet minister Alan Milburn told the Times the UK is facing a \"lost generation\" of 16-24 year olds as a result.The price of gold has surged after \"Trump's Greenland moves batter dollar\", writes the Financial Times. Closer to home, a \"handful of super-rich patrons\" have been buying Britain's \"struggling\" village pubs - including the Rothschild family.The Daily Star hints at a big reveal for the Traitors season finale with \"Claudia's Traitors secret\". But instead reveals the \"tv host's behind-the-scenes tan trick\". A plot against Starmer and Streeting tops The i Paper, as it says \"key figures\" in the Labour party support Andy Burnham's return to the House of Commons as expectation mounts that he will challenge the PM for leadership. Those on the left of the party \"fear a 'Wes Streeting coronation',\" it writes.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Anger at Nato troop insult' and 'Trump delays Chagos surrender'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/47d3/live/e0443c70-f8b6-11f0-b5f7-49f0357294ff.png"
      ],
      "datePublished": "2026-01-24T01:04:54.000Z",
      "dateModified": "2026-01-24T01:04:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police officers to be told they must get work licence or face dismissal",
    "url": "https://www.bbc.com/news/articles/cn0kelpx734o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/baf8/live/f2da30d0-daa5-11f0-b825-331725716d67.jpg",
    "tag": "Trending",
    "date": "2026-01-23T22:52:28.000Z",
    "description": "Every police officer in England and Wales will be required to hold a licence to be able to continue working, the Home Office has said. They will have ",
    "body": "Every police officer in England and Wales will be required to hold a licence to be able to continue working, the Home Office has said. They will have to prove they have the right skills in issues such as tackling violence against women and girls or face being removed from their job, under the terms of a phased scheme similar to ones for lawyers or doctors. Under separate proposals announced on Friday, ministers will be granted new powers to dismiss chief constables and intervene in forces deemed to be failing. The plans are part of a raft of reforms expected from Home Secretary Shabana Mahmood, who is promising to oversee the biggest shake-up of policing in decades. Officers will have to renew what the Home Office calls a 'licence to practice' throughout their career by keeping up to date with latest methods and guidance. Training will be rolled out in phases. The aim is that the new standardised programme will be clearer to follow across all 43 police forces in England and Wales. \"Every police officer needs to remain match fit to protect their communities. As crime evolves, we expect police to evolve more quickly\", Crime and Policing Minister Sarah Jones said. \"The licence to practise will equip every officer with the skills and capabilities to do the job – whether new to the force or a policing veteran.\" Last week it was announced the home secretary will be given new powers to sack police chiefs. On Friday, additional statutory powers were extended to ministers, who will be able to force the \"retirement, resignation, or suspension\" of police chief constables if they are performing poorly. Currently, only police and crime commissioners hold that power. Ministers will also be able to send in \"specialist teams\" to turn around forces if crime solving rates or police response times are poor.The government said that new targets on policing will also be introduced, and made available to the public. \"It is essential that the people can determine what they expect from their forces,\" Mahmood said in a statement. It comes after Mahmood last week said she had lost confidence in West Midlands Police's chief constable Craig Guildford after Israeli football fans were banned from a match against Aston Villa. He later retired from the force. Sir Andy Cooke, who leads His Majesty's Inspectorate of Constabulary and Fire & Rescue Services (HMICFRS), welcomed the plans. The body independently assesses the effectiveness and efficiency of police forces. \"Where a police force is failing the public, there must be a clear, fair system to make sure concerns are acted upon. The inspectorate is a vital part of that system,\" he said. \"These reforms will help make sure under-performance is more quickly addressed whilst supporting forces to respond to our recommendations more effectively, so that every community gets the policing it deserves.\"On Monday, as part of her reforms plan, the home secretary will pledge to \"significantly\" cut the number of forces from its current level of 43, and tell them to focus on serious and organised crime.However, the Police Federation of England and Wales said: \"Policing's current structure has entrenched a postcode lottery in what the public see but also how officers are led, supported and treated.\"Fewer forces doesn't guarantee more or better policing for communities. Skills, capabilities and equipment need significant investment if the public and officers are going to see reform deliver in the real world.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police officers to be told they must get work licence or face dismissal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/baf8/live/f2da30d0-daa5-11f0-b825-331725716d67.jpg"
      ],
      "datePublished": "2026-01-23T22:52:28.000Z",
      "dateModified": "2026-01-23T22:52:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Post Office and Fujitsu accused of delaying £4m damages claim",
    "url": "https://www.bbc.com/news/articles/cgk82743gz1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/179a/live/3c51ac90-f890-11f0-802d-45770cee28e3.jpg",
    "tag": "Trending",
    "date": "2026-01-23T22:14:21.000Z",
    "description": "6 hours agoEmma SimpsonBusiness correspondentPost Office and Fujitsu have been accused of driving up legal costs and delaying a former sub-postmaster ",
    "body": "6 hours agoEmma SimpsonBusiness correspondentPost Office and Fujitsu have been accused of driving up legal costs and delaying a former sub-postmaster from suing them for £4m in damages over the Horizon IT scandal, the High Court heard.Lee Castleton OBE was pursued by the Post Office to recover £25,000 of cash it alleged was missing from his branch in Bridlington, East Yorkshire, in 2007. His two-year legal fight saw him declared bankrupt following legal costs of £321,000.At the first hearing in his claim on Friday, the court was told that Fujitsu, the company responsible for the faulty software, had already racked up more than £700,000 in legal costs.Mr Castleton is the first individual to take legal action against both organisations.Friday's preliminary hearing was about how the case should proceed.The court heard that \"hurdles\" were being put in front of Mr Castleton to make his claim as \"difficult, time-consuming and expensive as possible\".His legal team allege the Post Office's decision to pursue its 2007 civil claim against him was an \"abuse of process of the court\", and that the eventual judgment was obtained by fraud.They also all claim the state-run institution conspired with Fujitsu to pervert the course of justice by \"deliberately and dishonestly\" withholding evidence.Mr Castleton was one of 555 sub-postmasters who took the Post Office to court in an epic legal battle, led by Sir Alan Bates.They won their case in 2019 and agreed a settlement but they never received proper compensation because the money they received was largely swallowed up by the huge costs to fund their case.Mr Castleton wants that settlement to be set aside, alleging it was fraudulently obtained involving  \"sharp practice\" by the Post Office.Both Post Office and Fujitsu are yet to file a defence to Mr Castleton's claims but called for his case to be split into two trials.They want a court to decide if the settlement agreement bars the former sub-postmaster from proceeding with his own individual claim and if it does, this would \"dispose of the proceedings in their entirety\". Doing it this way, they argued, would save time and money.But in written arguments on behalf of Mr Castleton, the court heard the reverse would be true and that his claim was of the \"utmost simplicity.\"His barrister, Paul Marshall KC, rejected the need for a separate trial.But at the conclusion of the hearing, Mr Justice Trower and Judge Francesca Kaye ordered for the trials to be split in two, saying they would give the reasons for their decision at a later date.The Post Office, which is owned by the government, said it had made every effort to engage with Mr Castleton to overturn his civil judgment and remained more than willing to do so, but it did not accept his current claim was \"a good one and it had a duty to its shareholders to defend it\", the court heard.Mr Castleton wants \"vindication\" that the judgement against him, that had \"blighted\" his and his family's life for 20 years, was obtained dishonestly by the Post Office and for a judge to decide what he is owed.Speaking outside of court, Mr Castleton told the BBC: \"We know what we need to do and we're very happy where we are. \"We'll get a defence and that's what we've been waiting for. The facts aren't going to change. It's just the money.\"Welcoming the court's decision, the Post Office said it believed holding separate trials would resolve legal issues quickly and keep costs down.\"Our priority remains that Mr Castleton and all other affected postmasters get fair resolution and closure, and we remain hopeful that this matter can be resolved via the existing Horizon redress scheme,\" a spokesperson added.Mr Castleton's case is one of the most high profile in the scandal in which hundreds of sub-postmasters were wrongfully convicted after faulty software made it look like money was missing from their branch accounts.While other victims have seen their convictions overturned, Castleton's civil judgement against him still stands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Post Office and Fujitsu accused of delaying £4m damages claim",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/179a/live/3c51ac90-f890-11f0-802d-45770cee28e3.jpg"
      ],
      "datePublished": "2026-01-23T22:14:21.000Z",
      "dateModified": "2026-01-23T22:14:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philip Young pleads guilty to drugging and raping wife",
    "url": "https://www.bbc.com/news/articles/c4grr3368n3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f840/live/a2df9870-f875-11f0-875b-85e16a28ee0c.jpg",
    "tag": "Trending",
    "date": "2026-01-23T18:18:11.000Z",
    "description": "10 hours agoChloe HarcombeWest of EnglandWiltshire PolicePhilip Young admitted a string of sexual offences against his now ex-wifeA former Conservativ",
    "body": "10 hours agoChloe HarcombeWest of EnglandWiltshire PolicePhilip Young admitted a string of sexual offences against his now ex-wifeA former Conservative councillor has pleaded guilty to committing a string of sexual offences, including multiple counts of rape, against his wife over a 13-year period.Philip Young, who is now divorced from Joanne Young, admitted a number of charges, which also include administering a substance with intent to stupefy and voyeurism.The 49-year-old, formerly of Swindon but now of Enfield in London, denied eight counts related to making and possessing indecent images of children and possessing extreme images.Four other men charged with sexual offences against Joanne, 48, who has waived her right to anonymity, also appeared at Winchester Crown Court earlier and pleaded not guilty.A fifth man who has been charged with rape, assault by penetration and sexual assault, will appear in court at a later date.Wiltshire Police/PA MediaJoanne Young has waived her right to anonymity Philip Young served as a Conservative Swindon Borough councillor for Covingham and Nythe between 2007 and 2010. He was arrested in 2024 and the couple divorced the same year.He took 27 minutes to enter his guilty pleas to charges including rape, sexual assault, assault by penetration and voyeurism. The offences took place between 2010 and 2023.Young, of Amberley Road, also admitting publishing more than 500 intimate images and videos of his ex-wife and recorded her doing private acts for his own sexual gratification without her consent.Young denied three charges of making indecent images of children, alleged to have occurred in July 2024.He also pleaded not guilty to possessing a prohibited image and four charges of possessing an extreme pornographic image between January 2019 and January 2024.His ex-wife, Joanne, sat in court to watch the proceedings.Elizabeth Cook/PA WireThe Crown Prosecution Service called the case against Young \"thorough and compelling\"Norman Macksoni, of Wood End Close in Sharnbrook, Bedfordshire, 47, and Richard Wilkins, 61, of Toothill in Swindon, Wiltshire, both pleaded not guilty to one count of  rape.Dean Hamilton, 47, of no fixed abode, is yet to enter a plea to the same charge, as well as two counts of sexual assault and one count of assault by penetration.Wilkins also pleaded not guilty to one charge of assault by penetration.Connor Sanderson Doyle, 31, of Crofton Road, Swindon, pleaded not guilty to sexual assault by penetration and sexual touching.Mohammed Hassan, 37, of Torun Way in Swindon, pleaded not guilty to sexual touching.Det Supt Geoff Smith, from Wiltshire Police, paid tribute to Ms Young's \"incredible bravery\".\"Today's hearing is a significant landmark, which has seen Philip Young admit to dozens of serious sexual offences against Joanne Young,\" he said.The Crown Prosecution Service added that it had built a \"thorough and compelling case\" against Young.More from WiltshireWiltshire PoliceOfficers working on the investigation are hoping to identify this manYoung was remanded into custody, while the other four defendants were released on conditional bail. They are due to stand trial on 5 October.Meanwhile, Wiltshire Police has released images of a man it is hoping to identify in connection with the investigation.He is described as being of large build, hairy, with scarring on the back of his head and a distinctive tattoo on the left side of his chest.Officers have asked anyone with information about the man to contact police.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philip Young pleads guilty to drugging and raping wife",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f840/live/a2df9870-f875-11f0-875b-85e16a28ee0c.jpg"
      ],
      "datePublished": "2026-01-23T18:18:11.000Z",
      "dateModified": "2026-01-23T18:18:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brooklyn Peltz Beckham's wedding DJ Fat Tony speaks about 'awkward' dance",
    "url": "https://www.bbc.com/news/articles/cp8220err46o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/296d/live/16099cd0-f856-11f0-8ab6-81a112385ec5.jpg",
    "tag": "Trending",
    "date": "2026-01-23T13:10:09.000Z",
    "description": "15 hours agoPaul GlynnCulture reporterGetty ImagesSir David Beckham, Lady Victoria Beckham, Brooklyn Peltz Beckham and Nicola Peltz Beckham, pictured ",
    "body": "15 hours agoPaul GlynnCulture reporterGetty ImagesSir David Beckham, Lady Victoria Beckham, Brooklyn Peltz Beckham and Nicola Peltz Beckham, pictured in 2023Brooklyn Peltz Beckham's wedding DJ has given his account of what happened during what he describes as an \"awkward\" dance between the groom and his mother Victoria.On Monday, Brooklyn almost broke the internet by posting a series of claims about his famous parents, Sir David and Lady Beckham, including that his mother hijacked his first dance with actress and hedge fund heiress Nicola Peltz.He claimed his mum, formerly one of the Spice Girls, had \"danced very inappropriately on me in front of everyone\", leaving him feeling \"uncomfortable\" and \"humiliated\".DJ Fat Tony said \"the whole situation was really awkward for everyone in the room\".After rampant speculation over Brooklyn's comment about his mother's dancing, the DJ said: \"There was no slutdropping, there was no black cat PVC catsuits, there was no Spice Girl action.\"Pop star Marc Anthony performed at the wedding reception and called Brooklyn on to the stage, the DJ, whose real name is Tony Marnoch, told ITV's This Morning on Friday.\"The next minute, everyone was expecting it to be Nicola to go up and do the first dance,\" he said.The US singer then called for \"the most beautiful woman in the room\" to join Brooklyn - before saying Victoria's name instead of Nicola's,\" Marnoch claimed.This led to the bride running out of the room in tears, he added.'Crying her eyes out'\"Victoria is by the stage, she goes onto the stage, and of course at that point Brooklyn is suddenly, literally, devastated because he thought he was going to do his first dance with his wife.\"Then Nicola leaves the room crying her eyes out. Brooklyn is stuck there on stage.\"And then they do this dance and Marc Anthony's going, 'Put your hands on your mother's hips'. It was a Latin thing.\"The whole situation was very awkward for everyone in the room.\"However, his account differs from other reports, some of which have said the first dance took place between Brooklyn and Nicola earlier, before Anthony's performance began.British Vogue, who were at the wedding, said Anthony appeared at 11pm and that it was Brooklyn who \"invited his mother on stage for a dance\".BBC News has contacted Anthony, who is a singer-songwriter and friend of the Beckhams, for a comment.Sir David and Lady Beckham have not directly responded to Brooklyn's post or given their side of the story.Getty ImagesDJ Fat Tony, whose real name is Tony Marnoch, is known for his work on the celebrity-packed London club scene in the 1980s and 90sMarnoch has DJ'd at \"an awful lot of Beckham parties in the past\", and they are a \"close-knit family\" who \"love to dance\", he said.Whether that dance was \"inappropriate\" is down to how Brooklyn feels, he said.\"This is all about how Brooklyn feels. If he feels that it was inappropriate and awkward, it was inappropriate and awkward.\"The following day's brunch was \"the most awkward part of it all\" because \"everything that had gone on at the wedding night was discussed amongst the guests the next morning\", the DJ said.He added that the newlyweds left \"devastated\", but said the dance \"is a very small part of a bigger problem\" for the feuding family.It's \"sad\" that many people have focused on that part of Brooklyn's statement, Marnoch said.Mock-ups and memes of Lady Beckham's supposed wedding dance have been flooding the internet all week.\"It's taken a lot for someone to go to social media to post it,\" he added.\"He wanted to change the narrative. For all of his life he's been called a nepo baby, and 'He should be grateful that he's got the family name'.\"That's what he was born into. I think what we're all missing here is the fact that parents have lost their child, and a son's lost his parents and the rest of his family.\"In his explosive Instagram post on Monday, Brooklyn said he did not want to \"reconcile\" with his family, citing further wedding dress drama and an accusation that his parents put \"brand Beckham\" first.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brooklyn Peltz Beckham's wedding DJ Fat Tony speaks about 'awkward' dance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/296d/live/16099cd0-f856-11f0-8ab6-81a112385ec5.jpg"
      ],
      "datePublished": "2026-01-23T13:10:09.000Z",
      "dateModified": "2026-01-23T13:10:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Angela Rayner to back calls for Burnham to be allowed to stand in by-election",
    "url": "https://www.bbc.com/news/articles/c77kexz6k5zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/837b/live/d4b5cec0-f88c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-23T18:33:50.000Z",
    "description": "10 hours agoKate WhannelPolitical reporterFormer deputy prime minister Angela Rayner does not want Andy Burnham to be blocked from standing in the Gor",
    "body": "10 hours agoKate WhannelPolitical reporterFormer deputy prime minister Angela Rayner does not want Andy Burnham to be blocked from standing in the Gorton and Denton by-election, the BBC understands.As first reported in The Times, Rayner is expected to publicly make her announcement at Labour's north west regional conference on Saturday. If Burnham did contest and win the by-election in Greater Manchester, it would enable him to mount a leadership challenge against Sir Keir Starmer. The BBC has been told that some of Sir Keir's supporters on Labour's ruling National Executive Committee (NEC) will seek to block him from standing. The Greater Manchester mayor has until 5pm on Saturday to let the NEC know if he wants to stand or not - and he will find out on Sunday whether he will be allowed to.Under Labour rules, elected mayors must get permission from the NEC before seeking nomination as Labour Parliamentary candidates.The by-election could happen as early as next month after ex-Labour minister Andrew Gwynne formally resigned from the House of Commons, saying he had been advised by his GP not to return to work.Burnham has not said if he will go for the seat, telling reporters on Thursday that he was \"focused\" on his role as Manchester mayor and that people shouldn't \"rush to conclusions\". He has since refused requests for interviews. The tight timetable puts pressure on Burnham to make a quick decision which could make or break his political career.Rayner was forced to resign as deputy prime minister and housing secretary last year after the PM's ethics adviser concluded she had breached the ministerial code. However, she retains strong support among backbench MPs and party members and her backing for Burnham could make it harder for the NEC to block his progress. Several Labour sources have said they expect the committee to object to Burnham's candidacy on the grounds that it would trigger an election for the Greater Manchester mayoralty, which would be seen as a drain on party funds as well as politically risky.The NEC could also insist that there should be an all-women shortlist of possible Labour candidates for a by-election because the majority of the party's MPs are currently men.Opinion among Labour MPs is divided over whether Burnham should come back to the Commons.In a social media post appearing to back Burnham, Jo White, MP and leader of the Red Wall group said: \"A London stitch up will be a disaster for Labour.\"However, Graham Stringer, the MP for Blackley and Middleton South in Greater Manchester, said Burnham was \"entitled to be ambitious but this isn't the right opportunity\".\"I think it's very high-risk. By-elections are a nightmare for any candidates standing on behalf of a sitting government. I don't think Andy should take that risk.\"Labour won the Gorton and Denton seat at the 2024 election with a 13,000 majority. Reform UK came second with 5,000 seats narrowly beating the Greens candidate into third place.The area has traditionally been considered a safe seat, but Labour's drop in popularity since the general election means the party are not guaranteed a win. As the prime minister's popularity has declined, speculation has grown that he could face a leadership challenge after the local elections in May, at which Labour is expected to perform poorly. Alongside Burnham, Rayner and Health Secretary Wes Streeting have also been touted as possible challengers. Speaking to the BBC's Political Thinking, Deputy Prime Minister David Lammy said: \"I don't know if Andy really wants to get back into Westminster politics.\"He may do, and there's much merit to him. \"But I would caution those often around that start to destabilise the ship and say that we can have a new leader. \"No, we can't. Because immediately you'd be forced to have an election.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Angela Rayner to back calls for Burnham to be allowed to stand in by-election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/837b/live/d4b5cec0-f88c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-23T18:33:50.000Z",
      "dateModified": "2026-01-23T18:33:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk's Tesla fined for repeatedly failing to help UK police over driving offences",
    "url": "https://www.bbc.com/news/articles/c0r44zpprg7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c837/live/81b11470-a52e-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2026-01-23T12:45:43.000Z",
    "description": "16 hours agoMaria CassidyandRachel Broome,BBC WalesBloomberg via Getty ImagesSouth Wales Police wrote to Tesla Financial Services in a bid to identify",
    "body": "16 hours agoMaria CassidyandRachel Broome,BBC WalesBloomberg via Getty ImagesSouth Wales Police wrote to Tesla Financial Services in a bid to identify the driver of a Tesla which had been speeding at 80mphTesla has been convicted at least 18 times and ordered to pay more than £20,000 for repeatedly failing to co-operate with UK police forces.The British arm of Elon Musk's electric car giant has faced multiple criminal court proceedings over the past two years linked to alleged road traffic offences.Tesla offers its vehicles on long-term leases, and in such a scenario the leasing company is typically the registered keeper of the car.Drivers of rented or company cars caught speeding have to be named before they can face prosecution and companies which fail to return paperwork to police can be prosecuted instead.Almost 4,000 defendants have been convicted in courts in England and Wales in the last two weeks for failing to identify the driver of a vehicle under police investigation, leading to fines ranging from £1 to £1,000.In one incident, South Wales Police wrote to Tesla Financial Services in a bid to identify the driver of a Tesla which had been speeding at 80mph (128km/h) on the M4 near Llantrisant, Rhondda Cynon Taf, in July 2025.  Court papers show a Tesla company director, Becky Hodgson, pleaded guilty for the firm by email in late November, saying it had tried to enter the plea online but \"encountered a technical issue on the Online Plea Service portal\".Although the company admitted the criminal charge, Hodgson suggested in her email that it had complied with the police request, adding that its internal processes were followed and the nomination was sent via post.A conviction was handed out at Merthyr Tydfil Magistrates' Court on 6 January and ended in Tesla receiving a £1,000 fine, an order for £120 costs and a £400 victim surcharge. Getty ImagesThe British arm of Tesla has faced multiple court proceedings linked to allegations of road traffic offencesAt least 18 convictions recorded against Tesla Financial Services have been identified by the Press Association since the start of 2024, including prosecutions brought by the Metropolitan Police, Hampshire Constabulary and Thames Valley Police.Seventeen cases have already been sentenced, while Tesla Financial Services pleaded guilty last week to failing to identify a driver. That case is set to be sentenced at a later date at Bath Magistrates' Court.In one of the concluded cases, a Tesla driver was caught on a speed camera doing almost 100mph (160km/h) on the A3 in Petersfield in Hampshire.But due to police letters going unanswered, the speeding driver was not identified and the company received a conviction with a fine instead.Another Tesla driver was caught speeding three times, potentially putting them on the cusp of a disqualification - if they had been identified.Letters from police which went unanswered have been addressed to Tesla Financial Services at offices and a service centre in London, as well as an office in Manchester.In the cases identified, fines, costs and court fees totalling £20,686 have been imposed by magistrates sitting in the single justice procedure, which deals with minor offences.Tesla have been asked to comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk's Tesla fined for repeatedly failing to help UK police over driving offences",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c837/live/81b11470-a52e-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2026-01-23T12:45:43.000Z",
      "dateModified": "2026-01-23T12:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rochdale grooming trial collapsed over jurors' WhatsApp group",
    "url": "https://www.bbc.com/news/articles/c0ke14er8djo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/77d1/live/887255c0-b416-11f0-8af8-23f34058d4bc.jpg",
    "tag": "Trending",
    "date": "2026-01-23T15:53:37.000Z",
    "description": "The trial of alleged Rochdale grooming gang members collapsed after a judge was told about a WhatsApp group involving jurors.The case being heard at M",
    "body": "The trial of alleged Rochdale grooming gang members collapsed after a judge was told about a WhatsApp group involving jurors.The case being heard at Manchester Minshull Street Crown Court involved six men accused of rape and other sexual offences against two teenage girls between 2003 and 2006. Proceedings were halted in December after jurors, instructed not to conduct their own research or discuss the case outside of the jury room, were found to have been messaging each other about a broadcast on grooming gangs. Judge Matthew Corbett-Jones agreed with defence barristers that the matter raised \"real concerns\" the jury would not follow legal directions. The court heard that in one chat exchange, a member of the group warned that viewing the broadcast was contrary to the judge's directions, but one responded: \"I'm going to watch it anyway,\" followed by a smiley emoji. Another juror messaged that they too would watch the broadcast.The matter came to light when another juror reported the WhatsApp group to court officials, and an investigation was launched. The two jurors who said they would watch the broadcast were questioned but claimed they had not actually viewed it.Defence barristers suggested the pair may not be telling the truth and the prosecution invited the judge to further question the two jurors.However Judge Corbett-Jones agreed with an application to discharge the jury, telling the court: \"With considerable regret and disappointment, I have reached the conclusion that the multiplicity of problems which have now arisen and the uncertainty as regards these issues means that whatever course of action I take, unanswered questions remain.\"In light of that, no course of action that I can reasonably take can cure the position that now exists because of these multi-layered difficulties.\"Reporting restrictions on the reasons for the discharge of the jury were lifted on Friday following an application from the Manchester Evening News.A re-trial is set to take place in August.Tahir Rashid, 54, and Mohammed Saleem, 46, both from Rochdale; Iftaq Hussain, 45, of Shawforth; and Sucklane Shah, 46, of no fixed abode, all deny rape.Arshad Mohammed, 55, of Rochdale, denies rape and assault by penetration, while Amjad Mahmood, 53, also of Rochdale, denies rape, indecent assault, indecency with a child and assault by penetration.Rashid also pleaded not guilty to the rape of another young girl in the late 1980s.Listen to the best of BBC Radio Manchester on BBC Sounds and follow BBC Manchester on Facebook, X, and Instagram, and watch BBC North West Tonight on BBC iPlayer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rochdale grooming trial collapsed over jurors' WhatsApp group",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/77d1/live/887255c0-b416-11f0-8af8-23f34058d4bc.jpg"
      ],
      "datePublished": "2026-01-23T15:53:37.000Z",
      "dateModified": "2026-01-23T15:53:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chagos Islands debate delayed as Tories call for halt to bill",
    "url": "https://www.bbc.com/news/articles/cp372wz0z2zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f9a7/live/8eaf5ae0-f545-11ef-9e61-71ee71f26eb1.jpg",
    "tag": "Trending",
    "date": "2026-01-23T22:48:04.000Z",
    "description": "6 hours agoThomas MackintoshandLeila Nathoo,Political correspondentGetty ImagesA bill aimed at enshrining in law the government's Chagos deal will not",
    "body": "6 hours agoThomas MackintoshandLeila Nathoo,Political correspondentGetty ImagesA bill aimed at enshrining in law the government's Chagos deal will not be debated in the Lords as previously planned. The legislation, which would see the archipelago in the Indian Ocean handed to Mauritius with the UK leasing back a key military base for £101m a year, was due to be debated in the Lords on Monday. But late on Friday, the Conservatives - who have long opposed the deal - tabled an amendment calling for a pause \"in light of the changing geopolitical circumstances\".The government has now decided not to go ahead with the upcoming debate and said the bill will return to the Lords at an unspecified later date.\"The government remains fully committed to the deal to secure the joint UK-US base on Diego Garcia, which is vital for our national security,\" a government spokesperson said.\"This is irresponsible and reckless behaviour by peers, whose roles is to check legislation, not interfere with our national security priorities.\"Government sources said they are considering how to respond but do believe there are ways to stop a similar tactic being deployed in the future.The Diego Garcia Military Base and British Indian Ocean Territory Bill is currently in the later stages of parliamentary scrutiny known as \"ping pong\", where it bounces back and forth between the House of Commons and House of Lords as they attempt to amend elements of it.The Tories claim passing the bill would put the UK in contravention of a 1966 Treaty agreed with the US over the islands and therefore in breach of international law.Article 1 of the 1966 Treaty says \"the territory shall remain under UK sovereignty\".The Tories have called on ministers to ensure agreement is reached with the US over the 1966 Treaty, before the bill returns to the House of Lords.Under the terms of the proposed new Chagos deal with Mauritius, the UK will lease back Diego Garcia, the largest of the islands and home to a shared UK-US military base.The deal sets a 24-mile buffer around Diego Garcia, where nothing can be built without UK consent.Under the terms of the agreement - which was signed by Sir Keir Starmer last May - Mauritius would gain sovereignty of the islands from the UK, but allow the US and UK to continue operating a military base on one of the islands, Diego Garcia, for an initial period of 99 years.The government said it would pay Mauritius an average of £101m a year for 99 years, which Sir Keir said amounted to a \"net cost\" of £3.4bn after adjusting for factors including inflation.Last May, the prime minister said the UK had to \"act now\" or face Mauritian legal action that could interfere with the Diego Garcia base.He said: \"If we did not agree this deal the legal situation would mean that we would not be able to prevent China or any other nation setting up their own bases on the outer islands or carrying out joint exercises near our base.\"No responsible government could let that happen.\"The delay to the Bill's parliamentary journey comes in the same week US President Donald Trump appeared to have a change of heart over the agreement.On Tuesday, Trump described the agreement as a  \"great act of stupidity\" - despite his administration having previously been content with the terms.Before signing the deal in May last year, the UK offered Trump an effective veto, because of its implications for US security.Allies of the president had criticised the plan, but during a meeting with Starmer in the Oval Office last February, Trump said \"I think we'll be inclined to go along with your country\". After the agreement was signed, US Secretary of State Marco Rubio said Washington \"welcomed\" the deal.Rubio said it secured the \"long-term, stable, and effective operation of the joint US-UK military facility at Diego Garcia\", which he described as a \"critical asset for regional and global security.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chagos Islands debate delayed as Tories call for halt to bill",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f9a7/live/8eaf5ae0-f545-11ef-9e61-71ee71f26eb1.jpg"
      ],
      "datePublished": "2026-01-23T22:48:04.000Z",
      "dateModified": "2026-01-23T22:48:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "url": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/623c/live/324e36c0-f889-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-23T19:02:50.000Z",
    "description": "9 hours agoFrank GardnerBBC Security CorrespondentPA MediaBlast walls, rocket attacks, Forward Operating Bases (FOBs), Improvised Explosive Devices (I",
    "body": "9 hours agoFrank GardnerBBC Security CorrespondentPA MediaBlast walls, rocket attacks, Forward Operating Bases (FOBs), Improvised Explosive Devices (IEDs)... and long queues in the canteen. Anyone who deployed to Afghanistan, in whatever role, between 2001-2021 will have their own vivid memories of that time. It started with the flight in – to Kandahar, Kabul or Camp Bastion. It could be a long, slow descent with the lights out on an RAF jet, or a rapid, corkscrew down in a C-130 transport plane. In both cases the aim was to avoid being blown out of the air by a Taliban surface-to-air missile.Over the course of 20 years thousands of servicemen and women, as well as civilians, from dozens of countries deployed to Afghanistan, answering the US call for assistance. That call came in the form of invoking Nato's Article 5 of its charter – the only time it has ever happened in Nato's 77-year history – which states that an attack on one member shall be deemed an attack on all.America was reeling from the devastating 9/11 attacks when al-Qaeda, which was being sheltered by the Taliban in Afghanistan, murdered nearly 3,000 people by flying packed airliners into New York's Twin Towers and the Pentagon in Washington.The Taliban were swiftly driven from power in a joint effort by the US military, the CIA and Afghanistan's Northern Alliance. Then it was all about trying to hunt down the remnants of al-Qaeda as Britain's Royal Marines, together with UK Special Forces, pursued them over the mountains but many escaped to safety to regroup in Pakistan. It was not until ten years later that the US Navy's Seal Team Six commandos tracked down the al-Qaeda leader, Osama Bin Laden, in a villa in Abbottabad, Pakistan.The first two years of the US-led \"Operation Enduring Freedom\" as it was called, were relatively quiet. By late 2003, as America's attention switched to Iraq, US servicemen we met even started referring to Afghanistan as \"Op Forgotten\". But it was still dangerous. From a rain-soaked Kandahar airbase we watched Romanian troops edge nervously out on patrol in their Soviet-era armoured vehicles, wary of the next ambush. Flying into a remote US-manned firebase in the mountainous Paktika province in a Blackhawk helicopter, my BBC crew and I were told cheerfully: \"You've come to the worst place in the world\". Sure enough, the Taliban launched Chinese-made rockets at the base after dark, planted there, we were told, by farmers who had been either bribed or coerced into doing so.Everything changed after 2006, when the UK deployed in force to Helmand province, a part of Afghanistan that had been relatively peaceful until then. The Taliban made their intentions clear. If you come, they said, then we will fight you. And yet the UK government at the time appeared shocked at the ferocity of the fighting 3 Para now found themselves engaged in, with British paratroopers calling in mortar and artillery fire so close to their positions it was termed \"danger close\", in an effort to stop their bases from being overrun.Over the next eight years, until the end of combat operations in 2014, it was not just Americans who were risking life and limb to serve in Afghanistan. Brits, Canadians, Danes and Estonians were among those who saw the toughest fighting in Kandahar and Helmand provinces. It would also be churlish to ignore the bravery and sacrifice of so many Afghans who fought and died over two decades.I say \"fighting\" but most soldiers' biggest fears stemmed from the hidden IEDs, those expertly concealed Improvised Explosive Devices. The Taliban, who of course knew every inch of their terrain, were often able to guess correctly exactly where troops would need to cross an irrigation ditch or canal and so place the bomb accordingly. In the space of a split second, in a blinding flash and puff of black smoke, a fit, healthy, 20-something individual would have their life either ended or catastrophically changed, facing amputation and a host of other complications. So prevalent were these IEDs that soldiers were going out of the gates of their FOBs - Forward Operating Bases - on patrol praying that if they got hit it would result in a below-the-knee amputation, not one above the knee.The courage and resilience of the people I have met since, who have managed, despite terrible loss and adversity, to turn their shattered lives around, is both humbling and awe-inspiring. These are just some of the people who answered America's call for help after the 9/11 attacks. It is little wonder there has been such nationwide outrage at that country's president's suggestion that they somehow dodged the fighting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/623c/live/324e36c0-f889-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-23T19:02:50.000Z",
      "dateModified": "2026-01-23T19:02:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Mason: Keir Starmer's strongest rebuke yet for Donald Trump",
    "url": "https://www.bbc.com/news/articles/c9dvnlvzjw7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84cc/live/76dd42c0-f88b-11f0-802d-45770cee28e3.jpg",
    "tag": "Trending",
    "date": "2026-01-23T22:04:12.000Z",
    "description": "6 hours agoChris MasonPolitical editorThe prime minister's condemnation of Donald Trump's remarks about the war in Afghanistan are his strongest publi",
    "body": "6 hours agoChris MasonPolitical editorThe prime minister's condemnation of Donald Trump's remarks about the war in Afghanistan are his strongest public criticisms of the president yet.They come in a week where circumstances have led Sir Keir Starmer to conclude three times that it was necessary to publicly rebuke a man he has ploughed so much effort into building a strong relationship with.I am told Sir Keir, on returning to Downing Street on Friday afternoon, saw it as essential to make his views clear in the most direct terms.His tone and body language conveyed his anger, as did his words, in which he said what President Trump had said was \"insulting and frankly appalling\".The president had claimed that the Nato defence alliance, of which the UK is a member, had sent \"some troops\" to Afghanistan, but they \"stayed a little back, a little off the front lines.\"The comments, which are factually inaccurate, have been widely seen as crass and deeply offensive.Four hundred and fifty-seven British service personnel died in the conflict and many more suffered life changing injuries.The prime minister's team tell me Sir Keir sees standing up for and defending the armed forces as a first order duty of his role, as both those serving and those killed in conflict can't speak publicly for themselves.Incidentally, it is not the first time the Prime Minister has felt the need to stand up for the British military after remarks from the Trump administration.In March of last year, Sir Keir pointedly paid tribute to UK troops in the Commons after the US Vice-President JD Vance was accused of disrespecting them.But on that occasion, he made no reference to the vice-president by name.Sir Keir's response to the president is the third time in five days he has had to reach a quick judgement on how to calibrate a public response in defending what he sees as first principles under attack from the White House.The first came on Monday morning, with his case for the sanctity of the sovereignty of Greenland and a plea for \"calm discussion\".Within 24 hours, the president was lobbing around insults about the government's deal over the Chagos Islands.Little wonder, perhaps, that No 10 approached Prime Minister's Questions on Wednesday with a sense that what he planned to say there wasn't without risk.His language and tone on the president's then ambitions for Greenland hardened, as he said the UK \"will not yield\" to pressure from Washington.While the prime minister's interventions on Monday and Wednesday were seen by officials through the prism of diplomacy and the reaction they might provoke, his remarks on Friday were approached with a different mindset. I'm told the judgement was more simple: it was categorically the right thing to do, the prime minister concluded, given the gravity of offence the president had caused.If Sir Keir manages a moment over the weekend to reflect on the last seven days, you have to wonder if he may judge it was a turning point in his relationship with President Trump.It is a relationship he prizes and cherishes. Plenty have praised him for pulling it off, others have criticised him for hugging a deeply controversial President too close.His argument has long been a close relationship is in the national interest.The question now is how typical weeks like the last one might become, if the president's penchant for what many see as outrage, insult and provocation becomes ingrained.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Mason: Keir Starmer's strongest rebuke yet for Donald Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84cc/live/76dd42c0-f88b-11f0-802d-45770cee28e3.jpg"
      ],
      "datePublished": "2026-01-23T22:04:12.000Z",
      "dateModified": "2026-01-23T22:04:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]