[
  {
    "title": "Tottenham 2-2 Manchester United: Big questions as Benjamin Sesko injured",
    "url": "https://www.bbc.com/sport/football/articles/ce9dmpz0vn2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a984/live/362d0b30-bccb-11f0-9615-073c9c63253d.jpg",
    "tag": "Trending",
    "date": "2025-11-08T18:10:46.000Z",
    "description": "A dramatic - or drab - Saturday lunchtime Premier League match with as many questions as answers, and for Manchester United a major injury scare.It is",
    "body": "A dramatic - or drab - Saturday lunchtime Premier League match with as many questions as answers, and for Manchester United a major injury scare.It is difficult to know where to start when it comes to analysing Tottenham's 2-2 draw with Manchester United.First, the scare.United striker Benjamin Sesko was introduced into the game for Noussair Mazraoui after 58 minutes.The Slovenian had already wasted a couple of opportunities when he suffered an injury three minutes from time chasing down a long ball. It was immediately obvious Sesko could not continue, and as United had already used all five substitutes they had to complete the game, which stood at 1-1, with 10 men.Head coach Ruben Amorim confirmed afterwards Sesko had sustained a knee injury, but did not know how serious it was. However, in connection to a question about the January transfer window, Amorim said \"because it's the knee you never know\" - the inference being it might be.That would be a major issue, particularly as United will lose two of their main offensive threats - Bryan Mbeumo and Amad Diallo - to the Africa Cup of Nations in December.\"We have to check, it's something in his knee,\" said Amorim.On the transfer situation: \"We have to check everything. We have to check what has happened with Ben.\"Of course, we are going to have a problem there, but we already knew.\"Losing Sesko would be an unhappy postscript to a very strange game.With 10 minutes remaining, Tottenham looked certain to be heading for a third successive home defeat in the Premier League as they were unable to find a response to Mbeumo's first-half header.But, just as they did at Nottingham Forest a week earlier, United were undone by a cross and after conceding once to Mathys Tel, they gave away another, as Richarlison emotionally celebrated what he thought was a stoppage-time winner.But, just as they did at Nottingham Forest, United equalised, this time leaving it really late, the final minute of six added on as Matthijs de Ligt rescued the 10 men.\"The emotions inside me are high,\" smiled Tottenham boss Thomas Frank as he spoke to the media afterwards.The detail takes a bit of digging for.For his part, Amorim felt, unlike at Nottingham Forest, his side were \"comfortable in the game\". Too comfortable as it turned out.\"We should do better, be more aggressive, feel the environment in the stadium,\" he added.\"The three points were there, the space was there. We felt too comfortable. We need to expect that in one play anything can happen and change the mood in the stadium. Today was that.\"The result extended Manchester United's unbeaten run to five games. But for the second week in succession, they had been second in the 'as it stands' table and blew their lead.\"We have a lot of problems,\" said Amorim. \"We are just in the beginning.\"Sometimes the results show people we are improving but have a lot to do.\"The main problem, Amorim said, came through his side's response to losing the experience of midfielder Casemiro and defender Harry Maguire, both of whom have contracts expiring in the summer.Midfielder Kobbie Mainoo was missing through injury and Manuel Ugarte is not good enough when it comes to Casemiro's available replacements. For Maguire, Leny Yoro has already swapped places a few times this season but, at 19, lacks Maguire's longevity and game intelligence.United have conceded two goals in each of their past three games now. Amorim said on Thursday his side have an issue there.His explanation was a lack of aggressive intent to cut out crosses.We have to take him on his word about that.We also have to take Frank at his word when he said his selection of two direct forward players in Richarlison and Randal Kolo Muani was based around exploiting his opponents' vulnerability.\"We wanted two strikers for the crosses, which we thought was an area where we could potentially hurt United,\" said Frank, pointing to an early chance Richarlison wasted as evidence his selection was the right one.But the former Brentford boss was also mixing his messages.Frank felt Tottenham had done well to limit United to five shots.Yet that, he stressed, was not the same as saying his defence had actually played well.\"I don't think I said they played well,\" he said.\"The two shots they had, maybe even on target, were two situations we probably could have done better in.\"We will, of course, look through that and go through the details.\"The biggest plus from a Tottenham perspective was they did not lose a third Premier League home game in a row, which also means they avoided a 10th home defeat in 2025, which would have been a record for a calendar year.However, they have still only collected 14 points from their past 20 home games. No top-flight side has a worse record than that.Still, on a strange day, when neither side played well but both contributed to a memorable game, taking the positives, for Frank, included not losing.\"We are playing at home and I know we need to win so we don't talk about it [losing at home],\" he said.\"But the way we stayed in the game in the second half and kept doing the right things, I am very happy with that.\"It was a game where both teams tried to cancel each other out a little bit.\"We always want to create a little bit more but you can flip it and say, hey, we scored two goals in a situation where it was difficult to create.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tottenham 2-2 Manchester United: Big questions as Benjamin Sesko injured",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a984/live/362d0b30-bccb-11f0-9615-073c9c63253d.jpg"
      ],
      "datePublished": "2025-11-08T18:10:46.000Z",
      "dateModified": "2025-11-08T18:10:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct7151?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·07 Nov 2025,·26 minsAvailable for over a yearThe man Donald Trump has called a \"great leader\", and who has long provoked admiration in MAGA circles, suddenly finds himself in an unusual position – at odds with the US president on an issue of critical importance. \nViktor Orban, Hungary’s prime minister, is visiting the White House on Friday to try to resolve a dispute over Russian oil and gas. Orban wants to keep buying it, but Trump wants countries to wean themselves off Russian energy and help put the brakes on Russia’s war in Ukraine. Will Trump choose to keep an old friend close, or put pressure on Putin? We speak to Nick Thorpe, the BBC’s correspondent in Budapest, who has covered Orban since the 1980s. \nProducer: Viv Jones \nExecutive producer: James Shield \nSenior news editor: China Collins \nMix: Travis Evans  \nPhoto: U.S. President Donald Trump and Hungarian Prime Minister Viktor Orban. Suzanne Plunkett, Reuters.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg"
      ],
      "datePublished": "2025-11-07T10:00:00.000Z",
      "dateModified": "2025-11-07T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mf970z?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-07T11:38:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·07 Nov 2025,·30 minsThe Week: Mistaken Prisoner Releases and Tax Rises Are Coming?NewscastAvailable for over a yearToday, after another two prisoners were mistakenly released from prison - why is the justice system failing and who is to blame?\nJustice Secretary David Lammy is under increasing pressure after details have emerged that two more prisoners have been wrongly released. Why didn’t Mr Lammy explain the situation when he was speaking during PMQs? And what has gone wrong?\nPlus, after a week where it has become increasingly clear more tax rises are expected at the budget - what is the chancellor’s plan?\nAdam and Chris are joined by the head of the Institute for Fiscal Studies Helen Miller and Luke Tryl from More in Common. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-07T11:38:00.000Z",
      "dateModified": "2025-11-07T11:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-08T06:36:57.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-08T06:36:57.000Z",
      "dateModified": "2025-11-08T06:36:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two prisoners still at large after being freed by mistake in 2024",
    "url": "https://www.bbc.com/news/articles/cr4315ev559o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/37c1/live/7b20d2a0-bcb0-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-08T14:58:44.000Z",
    "description": "5 hours agoSima KotechaSenior UK correspondentPA MediaTwo prisoners are still at large after being mistakenly freed last year, the BBC understands.Ano",
    "body": "5 hours agoSima KotechaSenior UK correspondentPA MediaTwo prisoners are still at large after being mistakenly freed last year, the BBC understands.Another two, who were set free in error in June 2025, also remain missing.Details of the four erroneously released prisoners are emerging as ministers face growing pressure over a number of high-profile mistaken releases.Two other men who were released in error from HMP Wandsworth are now back in custody after high-profile police manhunts this week, after a migrant sex offender was mistakenly set free in late October.Algerian sex offender Brahim Kaddour-Cherif was arrested on Friday, while William Smith handed himself back in at the south London prison on Thursday.Hadush Kebatu, who arrived in the UK on a small boat and was jailed for sexually assaulting a 14-year-old girl and a woman while living in an asylum hotel, was mistakenly released from HMP Chelmsford in Essex. He was subsequently recaptured and deported.Some 262 prisoners in England and Wales were mistakenly freed in the year to March - up from 115 the previous year.The names of the four still missing, as well as why they were imprisoned and the reason for their mistaken release, remain unclear.A Ministry of Justice (MoJ) spokesperson told the BBC: \"The vast majority of offenders released by mistake are quickly brought back to prison, and we will do everything we can to work with the police to capture the few still in the community.\"Earlier, shadow justice secretary Robert Jenrick had said the unaccounted prisoners revealed \"the incompetence of this government\".\"It shouldn't be left to reporters to uncover the facts. [Justice Secretary] David Lammy must finally come clean about how many prisoners have been accidentally released and how many are still at large.\"Liberal Democrats spokeswoman Jess Brown-Fuller said \"every resource\" must go into finding the prisoners, describing the situation as \"a disgrace and an omnishambles\".The revelation that four wrongly released prisoners remain at large comes just hours after Kaddour-Cherif was arrested following his erroneous release from HMP Wandsworth, in south London, on 29 October.The Algerian national was spotted by a member of the public in the Finsbury Park area of north London shortly before 11:30 GMT, and captured by police just a three-minute walk from where Kebatu had been re-arrested less than a week prior.Kaddour-Cherif had been convicted of indecent exposure in November 2024 in relation to an incident in March of that year, given an 18-month community order and placed on the sex offenders' register for five years.He is understood to have overstayed his visitor's visa to the UK after arriving in 2019, and was in the initial stages of the deportation process.He was released the day after being found not guilty of breaching the sex offenders' register's requirements - but was still facing other charges and should have remained in custody. Police said they were not told for several days.Smith handed himself back in on Thursday. He had been let go on Monday, having been sentenced to 45 months for multiple fraud offences at Croydon Crown Court earlier that day.The BBC understands he was released as a result of a clerical error at court level - with a suspended sentence entered into the computer system instead of a custodial sentence. A correction was made, but sent to the wrong person.Since coming to power last year, the government has adopted a policy of releasing some offenders earlier in their sentence to ease overcrowding.But this appears to have affected the number of prisoners let go by mistake.Lammy said on Friday that the government \"inherited a prison system in crisis\" and said he was personally \"appalled at the rate of releases in error this is causing\".He continued: \"I'm determined to grip this problem, but there is a mountain to climb which cannot be done overnight.\"That is why I have ordered new tough release checks, commissioned an independent investigation into systemic failures, and begun overhauling archaic paper-based systems still used in some prisons.\"Correction 8 November 2025: An earlier version of this article said a prisoner had been mistakenly released in March 2024, under the previous Conservative government. Following publication, the BBC was told the release happened at a later, unspecified date in 2024 so these details were removed from the story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two prisoners still at large after being freed by mistake in 2024",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/37c1/live/7b20d2a0-bcb0-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-08T14:58:44.000Z",
      "dateModified": "2025-11-08T14:58:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Davina McCall reveals breast cancer surgery",
    "url": "https://www.bbc.com/news/articles/c74j7v1d9g9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bbcd/live/ebb237b0-bcc5-11f0-a9bc-296ed723b1d8.jpg",
    "tag": "Trending",
    "date": "2025-11-08T13:01:33.000Z",
    "description": "7 hours agoAlex KleidermanGetty ImagesTelevision presenter Davina McCall has revealed she underwent surgery for breast cancer nearly three weeks ago.I",
    "body": "7 hours agoAlex KleidermanGetty ImagesTelevision presenter Davina McCall has revealed she underwent surgery for breast cancer nearly three weeks ago.In a video posted to her Instagram account, the Comic Relief host said she was \"very angry\" by the discovery but feels in a \"much more positive place\".McCall, 58, said she found a lump in her breast after checking herself and got it examined, adding: \"It was very, very small, so I got it very, very early which is incredibly lucky. But I am so relieved to have had it removed and to know that it hasn't spread.\"The former Big Brother presenter thanked medical staff at the Royal Marsden Hospital in London, where she had the lumpectomy, and urged women to get their breasts checked.It comes a year after McCall underwent surgery to remove a rare brain tumour. A colloid cyst was found during a health check-up as part of her menopause advocacy work and McCall later said she was given the all clear after MRI scans. McCall started her Instagram post by telling her 2.1m followers: \"I'm talking about this because I think it might help someone. And this is what I always do.\"'I'm so relieved', says Davina McCall after breast cancer surgeryShe said she found a lump a few weeks ago which \"came and went\" but was encouraged to get it examined after seeing posters telling women to \"check your breasts\" while working on ITV's The Masked Singer and Lorraine show.She said presenter Lorraine Kelly had put signs on the backs of all the doors saying \"check your breasts\" and \"every time I went for a wee I did that\".\"It [the lump] was still there, and then one morning I saw myself in the mirror and thought \"I'm going to get that looked at\". I had a biopsy. I found out it was indeed breast cancer.\" McCall said she was going to have five days of radiotherapy in January \"as kind of an insurance policy\" and then will be on a \"journey to try and stop it ever coming back\".She added: \"I think my message is: get checked if you're worried. Check yourself regularly. If you are due a mammogram, then get it done.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Davina McCall reveals breast cancer surgery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bbcd/live/ebb237b0-bcc5-11f0-a9bc-296ed723b1d8.jpg"
      ],
      "datePublished": "2025-11-08T13:01:33.000Z",
      "dateModified": "2025-11-08T13:01:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quentin Willson: Former Top Gear and Fifth Gear presenter dies aged 68",
    "url": "https://www.bbc.com/news/articles/c2lpww7pw72o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2824/live/fdcd8c80-bcbe-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-08T19:41:37.000Z",
    "description": "29 minutes agoAlex Kleiderman and Theo Leggett,correspondentGetty ImagesFormer Top Gear presenter Quentin Willson has died aged 68 after a short illne",
    "body": "29 minutes agoAlex Kleiderman and Theo Leggett,correspondentGetty ImagesFormer Top Gear presenter Quentin Willson has died aged 68 after a short illness.Willson was a co-host on the BBC motoring show between 1991 and 2001 - working alongside the likes of Jeremy Clarkson - before going on to present Fifth Gear on Channel 5.He later worked as a campaigner, fronting the FairFuel group calling for lower fuel duties, and became an early advocate of electric vehicles (EVs).The Leicester-born father-of-three was described as a \"true national treasure\" and \"true consumer champion\" in a statement from his family, who said he had been diagnosed with lung cancer and died on Saturday.\"Quentin brought the joy of motoring, from combustion to electric, into our living rooms,\" they said.\"The void he has left can never be filled. His knowledge was not just learned but lived; a library of experience now beyond our reach...\"Quentin will be deeply missed by his family, friends, and all who knew him personally and professionally.\"Willson was on Top Gear between 1991 and 2001The family statement highlighted his championing of General Motors' EV1 electric car in the 1990s, saying it proved he was \"always ahead of the curve\".They added: \"More recently he had worked tirelessly to make EVs affordable for all.\"Willson was Top Gear's used car expert, known for his wry delivery and scathing reviews.He also presented The Car's the Star for the BBC, The Classic Car Show on Channel 5, and worked as a motoring journalist for Classic Cars magazine and the Mirror. He was named motoring writer of the year at the British Press Awards in 2004.Presenter Vicki Butler-Henderson, who worked with Willson on both Top Gear and Fifth Gear, said \"he was very much the champion of the consumer and educated people throughout many car deals, saving people hundreds - if not thousands - of pounds\".Speaking on the BBC Radio 4's PM programme, she said: \"I think he made a huge difference, particularly with the campaign to freeze fuel tax. He definitely helped keep money in our pockets for well over a decade\".Willson was partnered with Hazel Newberry on Strictly Come Dancing in 2004Willson was a contestant on Strictly Come Dancing in 2004 where his eight-point total for one routine still stands as the lowest score given by judges on the show.But speaking to the Independent three years later,  the presenter said he was \"very proud\" to have recorded the score. \"Builders ran up to me to shake my hand because I failed so badly. I tried, but I was the dancing equivalent of a JCB,\" he said of his Cha Cha Cha.Presenter James May, who appeared with Willson on Top Gear in the 1990s, paid tribute to his former colleague, calling him a \"great bloke\".He wrote on X that Willson \"gave me proper advice and encouragement during my earliest attempts at TV, back in the late 90s\", adding: \"I've never forgotten it.\"AA president Edmund King said he was \"devastated\" by Willson's death, calling him a \"brilliant TV presenter\" and an \"amazing campaigner\".\"He will be missed by all.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quentin Willson: Former Top Gear and Fifth Gear presenter dies aged 68",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2824/live/fdcd8c80-bcbe-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-08T19:41:37.000Z",
      "dateModified": "2025-11-08T19:41:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Hungary's Viktor Orban did - and didn't - get from Trump",
    "url": "https://www.bbc.com/news/articles/ckg4r193152o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg",
    "tag": "Trending",
    "date": "2025-11-08T16:14:42.000Z",
    "description": "4 hours agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant prais",
    "body": "4 hours agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant praise and an exemption from sanctions on Russian oil, gas and nuclear supplies.And all that just five months out from a difficult election.Look closer, however, and the picture is less clear cut. The US side struck a hard trade deal - and an expensive one for Hungary. And there's no progress on Viktor Orban's biggest headache: ending the war in neighbouring Ukraine, and with it the long shadow the conflict casts over Hungary.Let's look first at Orban's key win - an exemption from US sanctions, which a White House official told the BBC was time-limited to one year, although Péter Szijjártó, Hungary's foreign minister, said would be indefinite.The time span is interesting. Trump clearly wants to help his friend win the election in April. And the exemption even partially dovetails with the European Commission demand to all member states to end the import of Russian oil, gas and nuclear fuel by the end of 2027. What is missing, from an EU perspective, is any political commitment from Orban to meet that demand - a commitment made and fulfilled by the Czech government. And the EU is trying to tighten energy sanctions - to the fury of Hungary and Slovakia.Away from the media spotlight, the Hungarian energy company MOL has been upgrading two of its refineries - Százhalombatta in Hungary and the Slovnaft facility in Bratislava - to process Brent crude instead of the high-sulphur Urals crude which flows through Russian pipelines. On Friday, MOL said 80% of its oil needs could be imported through the Adria pipeline from Croatia, albeit with higher logistical costs and technical risks. So Orban's argument, which so impressed Trump, that Hungary, as a landlocked country, has no alternative to Russian oil may not strictly be true. Overall, Hungary and Slovakia have together paid Russia $13bn (£10bn) for its oil between its full-scale invasion of Ukraine in February 2022 and the end of 2024. The one-year window granted by the US is nevertheless a valuable respite for Hungarian households this winter. Orban told pro-government reporters who travelled with him to Washington that otherwise utility bills \"could have gone up by up to three times in December\". Capping those bills by various means has been a central plank of his popularity in Hungary since 2013. Under the US exemption, Hungary can also continue to buy Russian gas through the Turkstream pipeline, which traverses the Balkans, and pay for it in hard currency ($185m in August alone) using a Bulgarian loophole. Orban has agreed to buy LNG from the US worth $600 million, according to Bloomberg.Another key part of the Washington deal is nuclear. Hungary agreed to buy US nuclear fuel rods for its Paks 1 nuclear power station (at a cost of $114m), in parallel to those bought from Russia's Rosatom and France's Framatome.Russian plans to finance and build the nuclear extension, called Paks 2, have been long delayed by technical and licensing issues. The US agreement to lift all nuclear sanctions on Hungary may help restart that project, but thorny problems remain. Hungary has also agreed to buy US technology to extend the short-term storage of spent nuclear fuel at Paks for between $100m and $200m.Perhaps the biggest part of the deal was a Hungarian commitment to buy up to 10 small modular nuclear reactors from the US, for somewhere between $10bn and $20bn. Hungary needs electricity to power the huge Chinese battery plants being built around the country. Smaller nuclear plants are less plagued by building delays, and are easier to licence.Finally, a currency swap deal - similar to a recent US-Argentina deal to prop up the peso - under which US and Hungarian central banks can exchange currency is being discussed.This would mean that in a future financial crisis in Hungary, the US central bank could feed dollars to Budapest, which boosts financial security in Hungary.So in summary, Hungary struck a deal to buy US gas, nuclear energy and unspecified weapons systems in exchange for a temporary waiver from US sanctions on Russian oil and gas. But it failed to get the re-introduction of the US visa waiver system, abolished in 2022, which harms mutual trade. And it did not get a new date for a potential Trump-Putin summit in Budapest as part of efforts to end the Russia-Ukraine war.Critics say energy dependence on Russia is being replaced by energy dependence on the US. The Orban government argues it is achieving greater diversity of supply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Hungary's Viktor Orban did - and didn't - get from Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg"
      ],
      "datePublished": "2025-11-08T16:14:42.000Z",
      "dateModified": "2025-11-08T16:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bovaer: Methane-cutting cow feed trials on Arla dairy farms end",
    "url": "https://www.bbc.com/news/articles/cvgvkppx4kko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e487/live/eca3b150-bc7d-11f0-83c4-15690b7a59fb.jpg",
    "tag": "Trending",
    "date": "2025-11-08T08:41:53.000Z",
    "description": "11 hours agoMalcolm PriorRural affairs producerA major UK trial of a controversial feed additive designed to reduce emissions of planet-warming methan",
    "body": "11 hours agoMalcolm PriorRural affairs producerA major UK trial of a controversial feed additive designed to reduce emissions of planet-warming methane gas by dairy cows has ended.Arla Foods, owner of the UK's largest dairy co-operative, is now reviewing the results of the tests on 30 farms before any decision on future use is made.The launch of the Bovaer supplement trial last year saw concerns raised over food safety, as well as misinformation and conspiracy theories posted online, with videos on social media showing people flushing milk down the toilet in protest.Bovaer is now the focus of an investigation in Denmark after farmers raised fresh concerns but manufacturer DSM-Firmenich said the additive was \"proven, effective and safe\".The company spokesman added that it had been \"successfully used for over three years by thousands of farmers in over 25 countries.\"But he said: \"We are aware that in recent days, some farmers have raised concerns about cow health.\"We are actively engaging with the relevant organizations to ensure that all these concerns are fully investigated and properly addressed.\"In previously reported cases, Bovaer was not identified as a contributing factor to the health concerns raised.\"Methane is one of the most potent greenhouse gases and, although it does not hang around in the atmosphere as long as carbon dioxide, it is 28 times stronger over a 100-year period.It is claimed Bovaer - a brand name for the additive 3-Nitrooxypropanol - could reduce cow methane emissions by between 30-45%, and help farmers be more environmentally-friendly. It works by suppressing the enzymes in a cow's stomach that create the gas.The supplement, which is added in small quantities to cow feed, has been approved for use by UK regulators and the UK government has said milk from cows given Bovaer is safe to drink.A Food Standards Agency safety assessment in 2023 concluded there were no safety concerns when Bovaer is used at the approved dose.But it is not clear whether the additive will be more widely used in the UK, with a spokeswoman for Arla saying the findings of its trial were \"currently being reviewed\".The National Farmers' Union (NFU) said \"animal welfare must continue to be our highest priority\" with any new product.Paul Tompkins, who oversees the NFU Dairy Board, said: \"Following reports of investigations in Denmark into the use of methane suppresants, we will continue to monitor the situation for any developments to ensure the impact of any product is known.\"In Denmark, it is mandatory to use methane-reducing animal feed as part of the government's plan to reduce the environmental impact from agriculture.About 1,400 out of 2,000 dairy farms in Denmark are currently using Bovaer.Jannik Elmegaard, of the Danish Food and Veterinary Administration, told the BBC they were \"very aware that some herd owners have reported animals showing signs of illness after being fed with Bovaer\" but it was \"unclear how many cows were affected\".He added that they were \"closely monitoring\" the situation and collecting data so that they could determine the cause of the illnesses but emphasised that Bovaer had \"undergone a long and thorough approval process\". Denmark's Aarhus University has conducted several studies on the feed additive as part of its research into reducing methane emissions from cows and gives advice to the Danish authorities.Professor Charlotte Lauridsen, from the university's Department of Animal and Veterinary Sciences, said of the concerns raised: \"The pattern of disease now being described in the media – with fever, diarrhoea and, in some cases, dead cows – has never been observed in our extensive studies.\"But she added that the reports were being taken seriously and researchers were now collecting samples from herds where problems had been reported.A spokesperson for Bovaer manufacturer DSM-firmenich said the company was \"aware that in recent days, some farmers have raised concerns about cow health\". \"We are actively engaging with the relevant organisations to ensure that all these concerns are fully investigated and properly addressed,\" he explained.\"In previously reported cases, Bovaer was not identified as a contributing factor to the health concerns raised.\"He added that animal welfare was the company's \"highest priority\" and that \"Bovaer is a proven, effective and safe solution that has been successfully used for over three years by thousands of farmers in over 25 countries.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bovaer: Methane-cutting cow feed trials on Arla dairy farms end",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e487/live/eca3b150-bc7d-11f0-83c4-15690b7a59fb.jpg"
      ],
      "datePublished": "2025-11-08T08:41:53.000Z",
      "dateModified": "2025-11-08T08:41:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LA Dodgers' Alex Vesia shares death of baby daughter after sitting out World Series",
    "url": "https://www.bbc.com/news/articles/cj3z7pmrg7mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7268/live/40de6450-bcbe-11f0-8d79-97f33dcb026b.jpg",
    "tag": "Trending",
    "date": "2025-11-08T16:55:35.000Z",
    "description": "3 hours agoGrace Eliza GoodwinIMAGN IMAGES/Reuters ConnectDodgers pitcher Alex Vesia at a game on 9 October 2025Los Angeles Dodgers' pitcher Alex Vesi",
    "body": "3 hours agoGrace Eliza GoodwinIMAGN IMAGES/Reuters ConnectDodgers pitcher Alex Vesia at a game on 9 October 2025Los Angeles Dodgers' pitcher Alex Vesia, who sat out the team's World Series run against the Toronto Blue Jays, reported that his infant daughter died.Vesia and his wife shared the news on Instagram on Friday that their newborn daughter died on 26 October - midway through the team's championship-winning series. \"There are no words to describe the pain we're going through but we hold her in our hearts and cherish every second we had with her,\" the couple wrote in a joint post. The day before the World Series - which ran from 24 October to 1 November - began, the Dodgers announced that Vesia would be away while he navigated a \"deeply personal family matter\". Allow Instagram content?This article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read and before accepting. To view this content choose ‘accept and continue’.The Vesias' had been expecting the birth of their first child during the team's postseason run, Major League Baseball shared in a post on its website. The team shared no further updates with the public on Vesia's absence, saying they wanted to give him the space he needed. \"We just didn't want to have any potential for any kind of pressure. This is so much bigger than baseball,\" the president of Dodgers baseball operations Andrew Friedman said before the Series. \"For us, it was doing whatever small part we could to just 100% be supportive.\"By the third game of the series, the pitchers filling in for Vesia honoured him by writing his jersey number, 51, on their caps. In a show of solidarity, the Blue Jays' pitchers began doing the same by the sixth game. Getty Images for NetflixKayla and Alex Vesia attending a Netflix event in May\"For these guys to recognize Alex and what he and Kay have gone through, it's -- heartbreaking is not even a good enough descriptor,\" Dodgers manager Dave Roberts said, referring to Vesia and his wife Kayla. \"But for them to acknowledge that, it just speaks to how much respect and love they have for one another.\"In their Instagram post, the Vesias thanked the Dodgers for understanding and supporting them in their time of grief. They also expressed their gratitude to the Blue Jays and all baseball fans, as well as the medical staff at Los Angeles hospital Cedars Sinai. The couple did not share information about the cause of their daughter's death. \"Our little angel we love you forever & you're with us always,\" the Vesias wrote. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LA Dodgers' Alex Vesia shares death of baby daughter after sitting out World Series",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7268/live/40de6450-bcbe-11f0-8d79-97f33dcb026b.jpg"
      ],
      "datePublished": "2025-11-08T16:55:35.000Z",
      "dateModified": "2025-11-08T16:55:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Traitors: Why Cat Burns, Joe Marler and Nick Mohammed could be the real winners",
    "url": "https://www.bbc.com/news/articles/cwy1w0lj44ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9281/live/44723520-bbdc-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-08T02:01:40.000Z",
    "description": "18 hours agoNoor Nanji & Emma SaundersCulture reportersBBCCat Burns, Joe Marler and Nick Mohammed have had their profiles boosted by the showSpoiler w",
    "body": "18 hours agoNoor Nanji & Emma SaundersCulture reportersBBCCat Burns, Joe Marler and Nick Mohammed have had their profiles boosted by the showSpoiler warning: This article reveals details from The Celebrity TraitorsBy now, you’ll probably know who’s won The Celebrity Traitors.But some of the other contestants could end up being the real winners from the hit TV series.Cat Burns, Joe Marler and Nick Mohammed have been widely tipped by industry experts as the names most likely to see the biggest career boost thanks to their appearance on the show.Compared with the likes of Sir Stephen Fry and Celia Imrie, they were relatively less well known when entering the castle.But all three have been \"magnificently entertaining\", and could find themselves facing a string of lucrative offers, TV reporter Siobhan Synnot tells BBC News.We've been looking at who the breakout stars of the series are - and what might lie ahead for them.Cat BurnsThe singer-songwriter, 25, sailed all the way to the final, her cool-as-a-cucumber persona making her a traitor to be reckoned with.Burns first got everyone talking during an early task involving a general knowledge quiz, in which she confessed she didn't know who Dame Judi Dench or Dame Helen Mirren were (although she later said she would have recognised their faces).Celebrity Traitors fans have enjoyed her quick thinking and acting ability, and she managed to slip under the radar for most of the game.In Thursday night's nail-biting finale, her luck ran out - as she was banished at the roundtable despite making a pinky promise with fellow traitor Alan Carr, who went on to win.But this is far from the last we've seen of Burns.Her second album, How To Be Human, has just entered the charts at number five - our colleague, music correspondent Mark Savage, said it showed a softer side to the Traitors star.She's all over social media (what are we supposed to do without those epic cloaked Cat-Alan videos now the show is over?)And last weekend, she even made a special performance on another prime-time BBC One show, Sunday night's Strictly results show.Culture journalist Natalie Jamieson says she hopes Burns can do \"whatever she wants next\".\"She's a brilliant singer-songwriter already, and no doubt has her own ambitions and career plans - but I'd bet there's still a degree of her being seen by some as 'just' a musician.\"None of us are just one thing, and if her success on Celebrity Traitors broadens the minds of any industry gatekeepers to open doors or create unexpected opportunities, or just ask if she wants to be in the room where something is happening, then Cat can choose if that's what she wants.\"Joe MarlerThe former rugby union star, 35, has won over a whole new audience beyond sport thanks to his bromance with comedian Joe Wilkinson, his super-sleuthing, balletic bridge balancing and all-round wit.Speaking about his faithful nemesis on Traitors Uncloaked, traitor Jonathan Ross said of Marler: \"I think this show will do him a lot of good because people will see just how funny he is and how smart he is and how likeable he is.\"And that was always there, but it was hidden behind that gruff man mountain exterior.\"Along with Wilkinson, Marler was the architect of the epic Big Dog theory involving Ross and Fry.And rather than fly under the radar, Marler took the risk of spouting his theories openly, and was arguably the most bullish at the roundtables, even managing to ruffle Carr's feathers.\"Joe Marler has undoubtedly become a breakout star of the show due to his authentic personality and deadpan humour,\" says entertainment reporter Indigo Stafford.\"He also seems to be one of the only faithfuls this season to actually have had a clue who the traitors might be, yet he cleverly managed to conceal how much of a threat he is to them in order to not get eliminated [until the very end].\"I wouldn't be surprised if we saw a huge career boost for him after he left the show.\"Marler signed up with talent agency M+C Saatchi earlier this year, and there are already rumours that he is set for more mainstream TV opportunities, which Stafford says would \"make sense\".\"Having retired from his impressive England rugby career, he will be looking to move on to the next big thing - the world of showbiz,\" she said.Meanwhile TV reporter Siobhan Synnot thinks Marler could be heading for next year's Strictly. We can see him doing the Viennese Waltz already.Nick MohammedThe comedian and actor has hugely grown his fan base during his appearance on Celebrity Traitors.He'd already starred in hit TV shows like Ted Lasso and Slow Horses, but despite that, not everyone knew who he was before the show.While big personalities like Carr and Ross may have immediately stolen the limelight, Nick has gained a cult following due to his whip-smart - and often, spot on - theories, his cool, calm demeanour, and the way he powered through the tasks like a man possessed.He attracted attention early on when helping Imrie secure the final shield in the first mission, protecting her from murder by digging up her grave.But it was his incredibly speedy puzzle skills in the Trojan Horse challenge that really caught the eye.\"Celebrity Traitors has introduced him to a whole new audience that are obsessed with his sharp observations and intelligent gameplay. Moving forward, I could totally imagine Nick hosting a new game show,\" says Stafford.Synnot agrees: \"Nick and his gift for unravelling puzzles may find himself inundated with quiz host offers.\"And what's in store for the others...Burns, Marler and Mohammed aren't the only ones who will see a huge boost from their time on the show.Since his spectacular win on Thursday, social media has blown up with speculation that Carr could be the next host of Strictly Come Dancing.The BBC has not commented. But just imagine that. Winning Celebrity Traitors, then landing one of the most coveted roles on British television.Synnot, for her part, suspects he could end up going in a more unexpected direction.\"Sweaty Alan Carr is a cert for Sure adverts,\" she says. If you know, you know.And what for Imrie, the beloved veteran actress who stole the show with her nervous fart in episode three?\"Maybe Pepto Bismol can make a deal for her,\" jokes Synnot.You heard it here first.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Traitors: Why Cat Burns, Joe Marler and Nick Mohammed could be the real winners",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9281/live/44723520-bbdc-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-08T02:01:40.000Z",
      "dateModified": "2025-11-08T02:01:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protest held over Crowborough asylum seeker military site plan",
    "url": "https://www.bbc.com/news/articles/c051d80340vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/12eb/live/8dd7c800-bca5-11f0-9886-b3acf9644cc5.jpg",
    "tag": "Trending",
    "date": "2025-11-08T16:07:22.000Z",
    "description": "4 hours agoClaudia Sermbezis,Crowborough, Stuart Maisner,South East and Hsin-Yi Lo,South EastEddie MitchellHundreds of people have attended a protest ",
    "body": "4 hours agoClaudia Sermbezis,Crowborough, Stuart Maisner,South East and Hsin-Yi Lo,South EastEddie MitchellHundreds of people have attended a protest against plans to house asylum seekers at a military site in CrowboroughHundreds of people have attended a protest against plans to house asylum seekers at a military site in East Sussex.The government recently announced that 600 people would be temporarily housed at a training camp on the outskirts of Crowborough.Local resident Keith Brown said: \"If you dump any 600 young men of undocumented, unknown origin in a small town, you're asking for trouble.\"A Home Office spokesperson said \"the right to protest is fundamental to our democracy\".BBC / Claudia SermbezisSome protesters said they are concerned about safety and pressure on local infrastructureThe spokesperson added: \"This government will close every asylum hotel.\"Work is well under way, with more suitable sites being brought forward to ease pressure on communities across the country.\"Resident Ben Grant told the BBC that the plans were \"concerning many residents\".\"Straight after our last council meeting, I had a lot of our vulnerable, elderly and especially women who told me they are really worried about their safety,\" he said.Fellow resident Rachel Nichols added: \"We shouldn't be put in a position where we have to stretch ourselves further to accommodate people who are not offering something back to our community.\"Steve Smith, from refugee charity Care4Calais, told the BBC: \"In terms of people seeking asylum, the government has a duty, under the Refugee Convention, to house those who would be otherwise destitute.\"He said Crowborough was a \"dilapidated old army camp\", adding it would \"cost a lot to set up\" as accommodation for asylum seekers.\"From my point of view, shovelling people into former barracks is not the best use of money and for those seeking asylum,\" said Mr Smith.He said because many had been through traumatic experiences, including war, detention and modern day slavery, housing them in old barracks was \"not the best accommodation for people who had undergone these experiences\".BBC / Claudia SermbezisSussex Police and Crime Commissioner Katy Bourne said she was \"disgusted\" by the plansSussex Police and Crime Commissioner Katy Bourne was at the protest.She said: \"I'm here today because I'm as disgusted as local residents are about this migrant camp that's being opened up.\"Bourne said the plan had been \"dumped on everybody\" and there was \"no consultation\".\"Not even I was warned about this,\" she said.BBC / Claudia SermbezisA petition against housing asylum seekers has attracted 6,000 signaturesEarlier this week, the government said military sites were being considered with the aim of reducing the impact on communities and delivering better outcomes for taxpayers.Wealden District Council has called for the reversal of the plans, claiming it had \"totally failed\" to engage with the community or provide assurances around safeguarding for both asylum seekers and residents.Moving asylum seekers to military sites is part of the government's attempt to end the controversial use of hotels – something it has pledged to do before the next election.The government added that the site would comply with safety and security standards.Eddie MitchellWealden District Council has called for the reversal of the plansAs of June, about 32,000 asylum seekers were being housed in hotels, down from a peak of more than 56,000 in 2023, according to government figures.Wealden District Council raised concerns about \"staffing at the camp, police provision and the additional strain on already overstretched public services\".A petition against the move has been set up, which has attracted about 6,000 signatures.A Sussex Police spokesperson said: \"A planned peaceful protest took place in Crowborough on Saturday morning.\"Officers worked to keep any disruption to the public and businesses in the locality to a minimum.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protest held over Crowborough asylum seeker military site plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/12eb/live/8dd7c800-bca5-11f0-9886-b3acf9644cc5.jpg"
      ],
      "datePublished": "2025-11-08T16:07:22.000Z",
      "dateModified": "2025-11-08T16:07:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Can Primark stay relevant, or is Shein taking over?",
    "url": "https://www.bbc.com/news/articles/c9wvn7d8lq4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ead/live/999782f0-bbdf-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-08T02:08:44.000Z",
    "description": "Shoppers are turning to Shein - but some still can't leave Primark18 hours agoGrace DeanBBCMartha says she'd rather spend more money on better-quality",
    "body": "Shoppers are turning to Shein - but some still can't leave Primark18 hours agoGrace DeanBBCMartha says she'd rather spend more money on better-quality productsPrimark has long been a staple of UK high streets, luring in shoppers with low-priced clothes, accessories and homeware.But in its UK and Ireland stores, like-for-like sales - a key metric in the retail industry - were down 3.1% in the year to September, which it attributed to a \"weak\" consumer environment and fewer people buying winter clothes during last year's mild autumn. As online stores like Shein and Vinted continue to attract young shoppers, does Primark face a fight to remain relevant - or is it just fine?\"While the UK clothing market is seeing subdued growth, Primark has significantly underperformed the overall market,\" says Tamara Sender-Ceron, an associate director at market-research agency Mintel, adding that it faces \"increased competition\".Some shoppers point out that online marketplaces like Shein and Temu have even lower prices, a huge range of products, and - crucially - home delivery, something Primark lacks.At Primark's biggest London store on Oxford Street, which BBC News visited this week, Serena Milius has just popped in with her 12-year-old daughter to look at pyjamas, socks and the new Stranger Things range.Serena used to do most of her shopping at Primark - until Shein took over. \"Shein's our main thing,\" the 34-year-old finance manager from Tooting, south-west London, says.She says her wardrobe is now 90% Shein, and goes to Primark for \"little bits and bobs\" like flipflops, candles, socks and cosmetics dupes.Serena MiliusSerena says she's a Shein convertOthers tell the BBC they'd rather splash out on better-quality products. This includes Martha, a 23-year-old student in Leeds, who only shops at Primark for basics like T-shirts, socks, underwear and cotton buds. For other items, she turns to Weekday, Zara and independent shops.\"I like to buy more expensive items that I'm going to wear over the years,\" she tells the BBC as she browses clothes in a Primark store with her mum. Primark repeatedly faces criticism for its \"fast fashion\" approach with shoppers saying products they buy from there aren't hard-wearing.\"It's not always a lasting item,\" Martha adds.However Primark's product longevity lead, Vicki Swain, said that they have developed a Durability Framework that would help people get more wear from their purchases - no matter how much they can afford to spend.\"We've been investing in making our clothes more durable and also making them with more sustainable materials,\" she told BBC Radio 4's You and Yours programme.The store was busy when the BBC visited on a late Wednesday afternoon, with mainly female shoppers browsing alone or in pairs. Some said they'd gone out of their way to visit, others popping in after finding themselves in the area.Some say they're deterred by Primark's huge, sprawling stores which can sometimes get very busy.\"I do not enjoy shopping in a Primark,\" says Abbi Lily, a 24-year-old content creator from near Bournemouth. She describes the experience as \"very overwhelming\" and \"overstimulating\" and says it can be \"impossible\" to find things.Abbi LilyAbbi in a cardigan she got from PrimarkShe used to buy most of her clothes from Primark, but feels it isn't as cheap as it used to be. \"They just don't have the bargains as much anymore,\" she says, echoing comments some other shoppers made to the BBC.Though Abbi sometimes shops at Shein, she's trying to become more \"intentional\" with her shopping and buy more second-hand items, including through Vinted and Depop.A Primark spokesperson told BBC News that 85% of its products were £10 or under, and said it \"continually benchmarks\" its prices against competitors.Shein uses AI to identify trends and launch \"thousands of new styles daily\", says Ms Sender-Ceron at Mintel.According to a survey by Mintel in May, 46% of UK women aged 16 to 34 had bought fashion items from Shein in the last 12 months.It has held pop-up shops in London and this week opened its first permanent physical shop in a department store in Paris, with long queues of people waiting to get their hands on cut-price garments.\"You can buy anything from Shein,\" said one shopper waiting in the French capital to visit on its opening day. \"It's such a cool thing for people my age who are struggling in this economy.\"Firas Abdullah/Anadolu via Getty ImagesProtesters outside Shein's new store in the French capital earlier this weekBut as shoppers queued to get into the store, protesters screamed \"Shame!\" at them. The critics were calling for a boycott of the brand because of the environmental impact of fast fashion and working conditions in its factories. Just over an hour after the new store opened, the French government also confirmed it was initiating proceedings to suspend Shein's website, after prosecutors said they were investigating the company over childlike sex dolls found on its website.Paris prosecutors are also investigating three other platforms - Temu, AliExpress and Wish. Allegations surrounding the sale of childlike sex dolls on Shein first came to light from France's anti-fraud office. Shein has promised to co-operate fully. In a statement, the retailer said it had already temporarily suspended listings from independent third-party vendors.Should Primark offer delivery?With Shein specialising in delivering clothes to your door, Primark does offer click-and-collect services in its nearly 200 UK stores - but not deliveries.Some high-street retailers have been struggling in the UK, but Primark has largely bucked the trend - it's closing a store in Dartford, Kent, next year, which reports say will be its first store closure in a decade. It also opened dedicated Primark Home stores in Belfast and Manchester.Primark relies on its customers shopping in bulk, Mr Stevenson says. \"You might be going in for one thing, but you end up buying seven things that you hadn't really thought about,\" he says. This doesn't happen as much with online shopping, he says.Would Primark's sales be boosted if it did offer delivery? Mr Stevenson is sceptical, saying \"it doesn't feel like they're losing out by not doing that\", but that it could be an option in future. \"If you wanted to buy a couple of things from Primark for £5 each, are you going to pay 50% of that in delivery charge?\" he asks. \"Because buying £10 of stuff is going to cost me £5 to get it tomorrow.\"Primark's spokesperson said that its online model was a \"deliberate choice to streamline operations and pass the savings directly to customers\".Jason Alden/Bloomberg via Getty ImagesPrimark's total global sales were up 1%Though Primark's like-for-like sales in the UK and Ireland are down, \"I absolutely don't think they're doing badly,\" says Mr Stevenson, the Peel Hunt analyst. Its UK and Ireland market share has grown, according to data from market-research company Kantar.And its total sales globally in the year to September were up 1% compared to the previous year as it opened more stores in Europe and the US.For some shoppers, Primark will always have a hold on them. \"I absolutely love Primark,\" says Khloe Lightholder, a 34-year-old childcare worker from Essex.She says Primark is \"actually quite good quality for the price\" and she visits every few months for a couple of hours, usually spending £200 or more on shoes, bags, perfume and homeware. She sets herself a monthly budget, \"but every time I go to Primark that budget is out of the window\".How much of a threat Shein and other budget retailers pose is an ongoing challenge, but it doesn't feel like Primark's brown shopping bags will disappear from our high streets any time soon.More weekend picks",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Can Primark stay relevant, or is Shein taking over?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ead/live/999782f0-bbdf-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-08T02:08:44.000Z",
      "dateModified": "2025-11-08T02:08:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why we went undercover for the BBC to expose crime in the Kurdish community",
    "url": "https://www.bbc.com/news/articles/cy5qgyx6e5xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd00/live/5ca0aea0-bb1f-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-11-08T02:05:16.000Z",
    "description": "18 hours agoKirstie BrewerBBCTwo Kurdish men agreed to go undercover for the BBC and expose a network behind illegal High Street businesses because th",
    "body": "18 hours agoKirstie BrewerBBCTwo Kurdish men agreed to go undercover for the BBC and expose a network behind illegal High Street businesses because the criminals are causing harm to the reputation of Kurds in the UK, they say.The two, who we are calling Saman and Ali, are Kurdish reporters who have both lived legally in the UK for years.The BBC discovered that a Kurdish crime network was running mini-marts, barbershops and car washes the length of Britain, and wanted to find out more about how it operated and who was involved.Equipped with secret cameras, Saman and Ali posed as Kurdish asylum seekers with no right to work, looking to buy and run a mini-mart from which to sell illegal cigarettes and vapes.They were able to uncover how easy it is for someone in these circumstances to set up and run a business on the High Street in plain sight. Those involved, we discovered, pay Kurds who have UK citizenship to register the businesses in their names, helping fool the authorities.Saman and Ali also managed to secretly film one of those at the centre of the network, who claimed that he could erase government fines of up to £60,000 faced by those employing illegal workers.\"I wanted to play a role in uncovering these illegal activities [...] to say loudly that they don't represent us,\" says Saman, a former asylum seeker himself. Saman entered the country illegally, having fled Kurdistan  - a region that straddles the borders of Iraq, Iran, Turkey and Syria but which is not internationally recognised as a country - because his life was at risk.The reporters acknowledge that tensions over immigration are high in the UK and say they have both been worried that the investigation could inflame hostilities.But Ali says that the illegal working \"damages the whole Kurdish community\" and he feels compelled to \"bring it [the criminal network] out into broad daylight\".Separately, Ali says he was concerned the coverage could be seized upon by the far-right.He says this particularly struck him when he realised that far-right activist Tommy Robinson's Unite the Kingdom march was taking place in London on one of the weekends he was working undercover for the BBC. Placards and flags could be seen at the rally, reading \"we want our country back\".Saman and Ali have both been monitoring social media reaction to the BBC investigation from inside the Kurdish community and say it has sparked intense anger for some. One Facebook comment they spotted said: \"How can we identify and find [the undercover reporters] to kill them like dogs!\"Another called for their families in Kurdistan to be slaughtered.They have also read accusations that they were spies for the British government, and traitors to fellow Kurds. \"We are not spies, and we have no intention of harming the Kurdish community,\" Saman says. \"Our goal is to expose those who have damaged its reputation. We are proud of our Kurdish identity and deeply concerned about the actions of such individuals.\"Watch: BBC's Ed Thomas confronts Surchi of the Top Store mini-mart in CreweAli says he has also come across positive reaction, praising and defending the reporters for exposing wrongdoing and criminality.He says some young Kurdish men come to the UK having heard they can make money by selling illegal cigarettes.Reacting to our investigation, Home Secretary Shabana Mahmood said on Tuesday that these kinds of networks \"create an incentive for people to come here illegally\". An \"urgent investigation\" has now been launched by the Home Office, it confirmed.Ali stresses that a small percentage of Kurds based in the UK are involved: \"Maybe a minority in the community are involved in this illicit business - damaging the whole community.\"It is difficult to establish the exact size of the UK's Kurdish population - official records tend to log nationality rather than ethnicity. The Kurdish Community Centre in Haringey, London, suggests there are a little more than 500,000.Young Kurdish men \"have heard that illegal cigarettes can make you money in the UK\", says AliMost of those seeking asylum are fleeing political persecution, according to Ibrahim Avicil from the Refugee Workers Cultural Association (RWCA), a charity that supports refugees and asylum seekers in the UK.This was the case for our undercover reporter Saman, who, when he first came to the UK, struggled for years. He says he had to live on less than £20 a week while his asylum claim was considered.Asylum seekers now receive about £49 a week - or £9.95 if they are in accommodation which provides meals, according to Home Office guidance.\"Realistically speaking, this isn't enough to maintain a dignified life,\" says Mr Avicil from the RWCA.Because asylum seekers are largely prevented from working, he feels many are open to being exploited and are effectively \"forced to work in the illegal market for as low as £3 per hour\".A spokesperson for the Home Office said: \"We make no apology for not granting asylum seekers the right to work - doing so would create an incentive for people to come to the UK illegally.\"Asylum cases can take years to be resolved with nearly a third taking more than 12 months, according to government figures from the end of March this year.Saman says working illegally in a car wash, barbershop or mini-mart would have been very easy to do, but he told us he would never have done that.However, he says that those he met working in illegal mini-marts during his work with the BBC investigation seemed \"lost\", especially those whose asylum claim has been refused and who were in the appeals process.\"They used all their money to come to the UK, they had their asylum refused and now they've lost everything.\"Saman and Ali say illegal working \"damages the whole Kurdish community\"Ali agrees that these people seemed desperate.\"If [they] say you're not allowed to work - but also [you] don't get paid enough to survive - what are you supposed to do? Most people in this situation would do anything.\"But they also point out that there are people who they exposed in the criminal network that are not in need - they seem to be motivated by greed.Shaxawan - a Kurdish man exposed to be a key fixer in the network - drives a BMW, he points out.\"He just wants to get richer and richer. He is exploiting people put in a vulnerable position.\"Saman describes these people as \"shamelessly and ruthlessly\" exploiting the system, and says that \"many of these people are clever and find loopholes to deceive\" the authorities.But he is at pains to stress that there is nevertheless a sense of \"honour, kindness, and hospitality\" in the Kurdish community. He is worried that \"now the image of Kurds in Britain is changing and becoming negative\".He says: \"I want to show the true image of Kurds and make it clear that we are not involved in these illegal activities.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why we went undercover for the BBC to expose crime in the Kurdish community",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd00/live/5ca0aea0-bb1f-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-08T02:05:16.000Z",
      "dateModified": "2025-11-08T02:05:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]