[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt27hj?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:05:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search Sounds              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu   BBC SoundsSounds home pageHomeMusicPodcastsMy SoundsUse BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·09 Jan 2026,·24 minsThe President’s Path: After Venezuela, what next for Trump?The ExplanationAvailable for over a yearTrump's actions in Venezuela and the removal of Nicolás Maduro sparks talk of further US operations in the region. In this episode Caitríona Perry, Sumi Somaskanda and Bernd Debusmann look at the US operation that seized the President of Venezuela.\nEvery weekend, The President’s Path explores the state of US politics in Washington and beyond. We dig into the key issues shaping America and uncover what is on the minds of those closest to power. You can contact us at: path@bbc.co.uk\nSenior Producer: Oksana Kundirenko \nExecutive Producer: Anna HolfordProgramme WebsiteMore episodesCymraegGaeilgeGàidhligBBC Sounds HelpContacts, Privacy and InformationHelp with Signing InNewsletter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg"
      ],
      "datePublished": "2026-01-09T13:05:00.000Z",
      "dateModified": "2026-01-09T13:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt4qyc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-09T16:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Jan 2026,·37 minsThe Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran?NewscastAvailable for over a yearToday marks the thirteenth consecutive day of widespread anti-government protests in Iran.\nIran's top security body has warned that the Iranian judiciary and security forces will show \"no leniency towards saboteurs\", amid internet blackouts.\nAdam is joined in the Newscast studio by BBC chief international correspondent, Lyse Doucet, to discuss the context and history of the unrest in Iran, plus President Trump’s warnings to Ayatollah Ali Khamenei and his response. \nAlso in the studio is New Statesman political editor Ailbhe Rea and The House Mag deputy editor Sienna Rodgers, to wrap up the first calendar week of UK Politics.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Chloe Scannapieco and Jem Westgate. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-09T16:41:00.000Z",
      "dateModified": "2026-01-09T16:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man dies in Cornwall as tree falls on caravan in Storm Goretti",
    "url": "https://www.bbc.com/news/articles/c20zxxlgdedo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f755/live/db3afd10-ee3c-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T15:20:06.000Z",
    "description": "53 minutes agoZhara Simpson,South WestandArchie Farmer,South WestA man in his 50s has been found dead after a tree fell on to a caravan during Storm G",
    "body": "53 minutes agoZhara Simpson,South WestandArchie Farmer,South WestA man in his 50s has been found dead after a tree fell on to a caravan during Storm Goretti. Devon and Cornwall Police said emergency services were called to the Mawgan area of Helston, Cornwall, at about 19:35 GMT on Thursday after the tree fell during a red weather warning for wind.\"Tragically, a man aged in his 50s was located deceased within the caravan,\" police said, adding his next of kin had been informed and were being supported by officers. Police said work took place at the scene on Friday to safely remove the tree and make further inquiries at the scene. The death was not being treated as suspicious and a file would be prepared for the coroner, they added.The Met Office issued the rare red weather warning on Thursday between 16:00 to 23:00, which caused major damage and disruption across the county.Red warnings say \"exposed places\" are most at risk, bringing the risk of falling debris and a danger to life. The storm saw gusts of up to 100mph (160km/h) in Cornwall and the Isles of Scilly.Cornwall Council said the storm had been \"one of the most severe\" the county had experienced \"in living memory\", with crews working around the clock to clear fallen trees and carry out emergency repairs.The clean-up is continuing into the weekend.A yellow warning for ice, including in parts of east Cornwall, issued from 12:00 GMT on Friday is due to end at midday. More than 34,000 premises are still without electricity in the south-west of England, the National Grid said. Staff were working \"tirelessly\" to fix issues, it added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man dies in Cornwall as tree falls on caravan in Storm Goretti",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f755/live/db3afd10-ee3c-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T15:20:06.000Z",
      "dateModified": "2026-01-10T15:20:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philippines landfill collapse: Rescuers racing to find dozens still missing",
    "url": "https://www.bbc.com/news/articles/cn42jqlqy4xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/21eb/live/88b814c0-ee13-11f0-8692-012f383b8e06.jpg",
    "tag": "Trending",
    "date": "2026-01-10T11:32:44.000Z",
    "description": "5 hours agoAlys DaviesAFP via Getty ImagesMore than 30 people are thought to be missing following the landslide in CebuRescue workers are racing to fi",
    "body": "5 hours agoAlys DaviesAFP via Getty ImagesMore than 30 people are thought to be missing following the landslide in CebuRescue workers are racing to find dozens of people still missing following a landslide at a landfill site in the central Philippines earlier this week, an official has said.Mayor Nestor Archival said on Saturday that signs of life had been detected at the site in Cebu City, two days after the incident.Four people have been confirmed dead so far, Archival said, while 12 others have been taken to hospital. Conditions for emergency services working at the site are challenging, the mayor added, with hazards such as unstable debris and crew waiting for better equipment to arrive. The privately-owned Binaliw landfill collapsed on Thursday while 110 workers were on site, officials said.In a Facebook post on Saturday morning local time, Archival said: \"Authorities confirmed the presence of detected signs of life in specific areas, requiring continued careful excavation and the deployment of a more advanced 50-ton crane.\"Conditions for rescue workers at the site are difficult, with the wreckage still unstable.Relatives of those missing have been waiting anxiously for any news of their whereabouts. More than 30 people, all workers at the landfill, are thought to be missing.\"We are just hoping that we can get someone alive... We are racing against time, that's why our deployment is 24/7,\" Cebu City councillor Dave Tumulak, chairman of the city's disaster council, told AFP news agency.AFP via Getty ImagesRelatives of the missing are waiting anxiously for any news of their loved onesJerahmey Espinoza, whose husband is missing, told Reuters news agency at the site on Saturday: \"They haven't seen him or located him ever since the disaster happened. We're still hopeful that he's alive.\"The cause of the collapse is still unclear, but Cebu City councillor Joel Garganera previously said it was likely the result of poor waste management practices.Operators had been cutting into the mountain, mining the soil, and then piling garbage to form another mountain of waste, Garganera told local newspaper The Freeman on Friday.The Binaliw landfill is about 15 hectares (37 acres).Landfills are common in major Philippine cities like Cebu, which is the trading centre and transportation gateway of the Visayas, the archipelago nation's central islands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philippines landfill collapse: Rescuers racing to find dozens still missing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/21eb/live/88b814c0-ee13-11f0-8692-012f383b8e06.jpg"
      ],
      "datePublished": "2026-01-10T11:32:44.000Z",
      "dateModified": "2026-01-10T11:32:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says US needs to 'own' Greenland to prevent Russia and China from taking it",
    "url": "https://www.bbc.com/news/articles/c78vj5n7jg3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/be27/live/96225880-eda7-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-10T01:35:57.000Z",
    "description": "15 hours agoSarah SmithNorth America editorPresident Donald Trump says the US needs to \"own\" Greenland to prevent Russia and China from doing so. \"Cou",
    "body": "15 hours agoSarah SmithNorth America editorPresident Donald Trump says the US needs to \"own\" Greenland to prevent Russia and China from doing so. \"Countries have to have ownership and you defend ownership, you don't defend leases. And we'll have to defend Greenland,\" Trump told reporters on Friday, in response to a question from the BBC.We will do it \"the easy way\" or \"the hard way\", he added. The White House said recently the administration is considering buying the semi-autonomous territory of fellow Nato member Denmark, but it would not rule out the option of annexing it by force. Denmark and Greenland say the territory is not for sale. Denmark has said military action would spell the end of the trans-Atlantic defence alliance.In a joint statement on Friday night, Greenland's party leaders, including the opposition, reiterated their call for the \"US's disregard for our country to end\".\"We do not want to be Americans, we do not want to be Danes, we want to be Greenlanders,\" they said. \"The future of Greenland must be decided by the Greenlandic people.\"Despite being the most sparsely populated territory, Greenland's location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks, and for monitoring vessels in the region.The US president has repeatedly said that Greenland is vital to US national security, claiming without evidence that it was \"covered with Russian and Chinese ships all over the place\".The US already has more than 100 military personnel permanently stationed at its Pituffik base in Greenland's north-western tip - a facility that has been operated by the US since World War Two.Under existing agreements with Denmark, the US has the power to bring as many troops as it wants to Greenland.But speaking to reporters in Washington, Trump said a lease agreement was not good enough.\"Countries can't make nine-year deals or even 100-year deals,\" he said, adding that they had to have ownership. \"I love the people of China. I love the people of Russia,\" Trump said. \"But I don't want them as a neighbour in Greenland, not going to happen.\"\"And by the way Nato's got to understand that,\" the US president added.Denmark's Nato allies - major European countries as well as Canada - have rallied to its support this week with statements reaffirming that \"only Denmark and Greenland can decide on matters concerning their relations\".Stressing they were as keen as the US on Arctic security, they have said this must be achieved by allies, including the US, \"collectively\".They also called for \"upholding the principles of the UN Charter, including sovereignty, territorial integrity and the inviolability of borders\".Concerns over the future of the territory resurfaced after Trump's use of military force against Venezuela on Saturday to seize its president, Nicolás Maduro. Trump previously made an offer to buy the island in 2019, during his first presidential term, only to be told it was not for sale.US Secretary of State Marco Rubio is to hold talks with Denmark next week.In recent years, there has also been increased interest in Greenland's natural resources - including rare earth minerals, uranium and iron - which are becoming easier to access as its ice melts due to climate change. Scientists think it could also have significant oil and gas reserves.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says US needs to 'own' Greenland to prevent Russia and China from taking it",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/be27/live/96225880-eda7-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-10T01:35:57.000Z",
      "dateModified": "2026-01-10T01:35:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Video filmed by ICE agent who shot Minneapolis woman emerges",
    "url": "https://www.bbc.com/news/articles/cz7yv4524gqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba49/live/3d8a3990-ee3d-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-10T14:42:37.000Z",
    "description": "Video emerges of Minneapolis shooting filmed by ICE agent who opened fire2 hours agoElaine OkyereWatch: Video filmed by ICE agent who shot Minneapolis",
    "body": "Video emerges of Minneapolis shooting filmed by ICE agent who opened fire2 hours agoElaine OkyereWatch: Video filmed by ICE agent who shot Minneapolis woman has emergedA video filmed by the US immigration agent who fatally shot a woman in Minneapolis on Wednesday has emerged, showing the moments before gunfire rang out.The 47-second footage, obtained by conservative news outlet Alpha News, which is based in Minnesota, shows Renee Nicole Good sitting behind the wheel of her car and speaking to the officer. US Vice-President JD Vance shared the clip on social media, commenting that the agent had acted in self-defence. Local officials have insisted the woman posed no danger.Good's wife has paid tribute to the 37-year-old, saying the pair were trying to support their neighbours when she was shot. Her death has sparked protests across the US. President Donald Trump's administration says Good tried to run over the US Immigration and Customs Enforcement (ICE) officer in an act of \"domestic terrorism\" after blocking the road and impeding the agency's work.Democratic Minneapolis Mayor Jacob Frey has described that account as \"garbage\" based on the video footage.The BBC has asked the homeland security department and the White House for comment on the new video that emerged on Friday.The footage starts with the officer getting out of his car and filming Good's vehicle and registration plate while he walks around the Honda SUV. A dog is in the backseat. Good says: \"That's fine dude. I'm not mad at you.\"Her wife, Becca Good, is standing on the street filming the interaction with her mobile phone. She tells the ICE agent: \"That's OK, we don't change our plates every morning just so you know. It will be the same plate when you come talk to us later.\"She adds: \"You want to come at us? You want to come at us? I say go and get yourself some lunch, big boy.\"Another agent approaches Good on the driver's side and uses an expletive as he says: \"Get out of the car.\" The agent filming the clip moves in front of Good's car as she reverses.In a chaotic couple of seconds, she turns the wheel to the right and pulls forwards.The camera jerks up to the sky. \"Woah, woah!\" a voice says, as bangs are heard.In the final part of the video the car is seen veering down the road. The ICE agent swears.Other clips released previously from the scene show the maroon SUV crashed into the side of the road after the woman was shot by the agent.The officer appears to stay on his feet, and is later seen in other videos walking towards Good's crashed car. Federal officials say the agent was injured and treated in hospital. The FBI is investigating the incident.An earlier video shows the incident from another perspectiveThe officer who fired on Good is Jonathan Ross, a veteran ICE agent who was previously injured in the line of duty when he was struck by a car. When asked about the video at the White House on Friday, President Trump said: \"You have agitators and we will always be protecting ICE, and we're always going to be protecting our border patrol and our law enforcement.\"On Friday, Vance reposted the video on X, and defended the agent's actions, saying: \"The reality is that his life was endangered and he fired in self-defence.\"White House spokeswoman Karoline Leavitt also reposted the video, saying the media had smeared an ICE agent who had \"properly defended himself from being run over\". Good's wife told local media the pair had gone to the scene of immigration enforcement activity to support neighbours. \"We had whistles,\" Becca Good said. \"They had guns.\"When speaking about Good - a mother-of-three, including a six-year-old son - she said \"kindness radiated out of her\".\"We were raising our son to believe that no matter where you come from or what you look like, all of us deserve compassion and kindness,\" she added.Demonstrators turned out for a third night of protests on Friday over the killing of Good. The Minneapolis Police Department told BBC News that at least 30 people were detained, cited and released after protests in the downtown area.Photos showed protesters gathered outside a hotel in the city, believed to be where some ICE agents were staying.Minnesota's Department of Public Safety said it assisted police officers with arresting people suspected of unlawful assembly, after responding to an area around the Canopy Hotel in the city and giving dispersal orders.The public safety department said it received \"information that demonstrations were no longer peaceful and reports of damage to property\".Minnesota Governor Tim Walz earlier said he had activated the state's National Guard to help with security of the protests.On Friday, Minnesota officials said they would open an inquiry into the shooting after saying they had been frozen out of the federal investigation.Trump was asked by a reporter at the White House on Friday whether the FBI should share its findings with Minnesota, and said: \"Well normally I would, but they're crooked officials.\"Hennepin County's top prosecutor Mary Moriarty and the state's Democratic attorney general, Keith Ellison, said they were launching their own probe.It came a day after the Minnesota Bureau of Criminal Apprehension said the FBI had initially pledged a joint investigation, then reversed course.One federal agency that is not looking into the shooting is the US justice department's Civil Rights Division, which has in the past investigated alleged excessive use of force by law enforcement.But prosecutors have advised its criminal section that there will be no investigation in this case, sources told the BBC's US partner, CBS News. Governor Walz, a Democrat, has accused the Trump administration of blocking state officials, but Vice-President Vance said it was a federal matter. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video filmed by ICE agent who shot Minneapolis woman emerges",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba49/live/3d8a3990-ee3d-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-10T14:42:37.000Z",
      "dateModified": "2026-01-10T14:42:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why 2016 nostalgia is taking over social media in 2026",
    "url": "https://www.bbc.com/news/articles/cwy1e605dvgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1882/live/92ec72f0-ed88-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-10T02:09:12.000Z",
    "description": "Rose-tinted filter: Why 2016 is taking over social media in 202614 hours agoNaomi de SouzaBBC NewsbeatGetty ImagesZara Larsson's breakthrough 2016 hit",
    "body": "Rose-tinted filter: Why 2016 is taking over social media in 202614 hours agoNaomi de SouzaBBC NewsbeatGetty ImagesZara Larsson's breakthrough 2016 hit Lush Life is back in the chartsWake up - it's 2016.The Chainsmokers are playing wall to wall, you've perfected your Snapchat dog filter pose and Leicester City have just won the Premier League.Justin Bieber and Drake are dominating playlists and everyone is hunting Pikachu on Pokémon Go - if they aren't filming their Mannequin Challenge attempt on their phone.It all feels like it happened yesterday. But that might be thanks to social media, which has welcomed 2026 by looking 10 years into the past.According to TikTok, searches for \"2016\" surged by 452% in the last week, and more than 55 million videos have been created using the app's filter named after the year.The nostalgic wave has got us recalling our favourite trends, tracks and looks. But why now? And is there anything special about the year 2016 specifically?Lauren RedfernRadio 1 DJ Lauren Redfern, pictured in 2016, was a teenager at the timeMusic has been a big driver of the 2016 revival, and some of the most popular tracks of the year have been making a comeback online.Radio 1 Anthems host Lauren Redfern tells BBC Newsbeat it's not hard to see why.\"It's just so so good, that music from that time, and so nostalgic to so many of us,\" she says.\"We had Zayn's debut solo single Pillow Talk, Chainsmokers were really hot at that time.\"Twenty One Pilots, The 1975 - it was all going on.\"Stats from Spotify show a 71% increase in \"2016\" playlists last year compared with 2024, and big-hitting artists have also been making a comeback.Zara Larsson's smash hit Lush Life, which first entered the charts 10 years ago, re-entered the UK top 40 last month and has since climbed back up to number eight.The Swedish pop sensation has also been behind a make-up trend focused on maximal, glam \"Y2K\" looks, and that's something Lauren remembers fondly from 2016.\"It was all the mad colours,\" she says. \"The eye shadow was bright pink. I used to love a big, thick winged eyeliner as well.\"I still like to pull that out every now and then.\"Coldest CreativeJoel Marlinarson, who advises brands on social media strategy, says 2016 evokes a simpler time in the minds of manyJoel Marlinarson, from London, is a TikTok creator and brand strategist whose video explaining why Gen Z is so obsessed with 2016 has been viewed more than a million times.The 22-year-old tells Newsbeat the year has become its own aesthetic on TikTok, thanks largely to the dedicated filter, which he says has helped to accelerate the trend.It gives videos a vintage, pink-hued look that's reminiscent of classic Instagram photo effects \"everyone used\" in 2016, says Joel.\"So without using words, be it somebody in France, be it someone in Germany, seeing that filter you're instantly taken back to a time when we were having so much fun and were so much younger,\" he says.Joel says the rosy hues also evoke a simpler time on social media, which played a big part in young people's lives but was far less complex.\"Looking at Instagram, around 2016, there was no carousel posts,\" says Joel. \"People were posting a picture of their avocado, and it wasn't so performative.\"There weren't short-form reels, so there wasn't that algorithmic kind of fatigue that people have now.\"This is something Lauren, 26, says she can relate to.\"To be honest, 2016 was the year of Snapchat stories,\" she says. \"If I go back through my Snapchat memories, it's pretty much all from 2016.\"Instagram was all about photos, we didn't have to worry about Reels, we didn't have to worry about updating our stories all the time. It was just a simple, chilled life.\"Jenny RoutledgeClay Routledge specialises in the study of nostalgia and says 2016 might not be as magical as it seemsLooking back at 2016 through a literal rose-tinted filter is a source of comfort for many of us, but is it distorting our memory?It was a particularly gloomy year for celebrity deaths, with legends including David Bowie, Prince, George Michael and Alan Rickman all passing away.And 2016 also saw some major world events - such as the UK Brexit referendum and Donald Trump's first US election win - that continue to divide people, whether they celebrated or despaired at the result.Psychologist Clay Routledge has specialised in the study of nostalgia since 2001 and says he's \"hesistant to make too big of a deal of any one given year\".Political events of 2016 may have elevated existing divisions, Clay says, but these significant moments and events hold nostalgic power because they act as \"markers\".\"You can always find these points in time in which people anchor themselves to for some sort of guidance,\" he says.The Boston Globe via Getty ImagesDonald Trump was elected as US president for the first time in 2016Clay suggests two factors that could be driving the obsession with 2016: the start of a new year, and many young people feeling uncertain about the future.\"We tend to be especially nostalgic when the world feels like it's going through some major change,\" says Clay.He points to the impact of artificial intelligence (AI), and people's worries about how it will affect employment.\"When generations are going through this kind of upheaval or this kind of challenge, they tend to look back to their youth for comfort and for inspiration, for guidance,\" he says.And 10 years ago makes sense for a lot of us, he says.\"Young millennials would be in their early 30s, and the older Gen Z would be in their late 20s, and so 10 years ago would be that kind of youthful time,\" he says. \"People are looking back maybe a decade and saying, 'Okay, what was going on then?'\"Lauren, who was in her teens at the time, says 2016 was \"a pivotal time for quite a lot of us\" and a time of firsts, discovering the world - and yourself - as you went along.Many people have been using the trend to remember and reflect on how their lives have changed, and Joel thinks it's reminded many of how carefree things felt 10 years ago.\"You posted something, you didn't think about how many likes there were,\" he recalls. \"Perhaps that's attached to the universal experience of ageing, but it feels now things are so divisive that we can all relate to feeling the world was a little lighter back then.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why 2016 nostalgia is taking over social media in 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1882/live/92ec72f0-ed88-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-10T02:09:12.000Z",
      "dateModified": "2026-01-10T02:09:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arrests as emergency crews hurt in South Benfleet crash",
    "url": "https://www.bbc.com/news/articles/cj0nz9eldnzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg",
    "tag": "Trending",
    "date": "2026-01-10T16:00:46.000Z",
    "description": "Emergency workers struck at scene of earlier crash14 minutes agoAimee DexterStephen Huntley/BBCEssex Police said one paramedic and one police officer ",
    "body": "Emergency workers struck at scene of earlier crash14 minutes agoAimee DexterStephen Huntley/BBCEssex Police said one paramedic and one police officer remained in hospital with serious injuriesThree men have been arrested after paramedics and off-duty police were struck while attending the scene of a crash in Essex.The emergency services were initially called after a single-vehicle collision involving a white Nissan X-Trail on the A130 in South Benfleet at about 00:15 GMT. While at the scene, five emergency responders were struck in a second crash involving a white Ford Transit van. Two of them - a paramedic and a police officer - remain in a serious condition in hospital.An investigation has been launched, with police appealing for witnesses or anyone with dashcam footage to come forward.Those being questioned by police are:A 23-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle and driving while unfit through drink or drugsA 29-year-old man, from Westcliff, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle, possession of a Class B or Class C drug, and being in charge of a vehicle while unfit through drink or drugsA 39-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving and driving while unfit through drink or drugs.Essex Police said the paramedic and police officer suffered serious injuries.It said the crashes happened on the southbound carriageway of the A130, between the Rayleigh Spur and Sadlers Farm roundabouts.Officers closed the A130 between Sadlers Farm and the A1245 Bonville's Roundabout leading to the A13, while it carried out an investigation. The roads have since been reopened.Ch Supt Morgan Cronin said: \"The thoughts of everyone at Essex Police are with the emergency workers injured while responding to this incident – both they and their families are being provided with support from the force.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arrests as emergency crews hurt in South Benfleet crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg"
      ],
      "datePublished": "2026-01-10T16:00:46.000Z",
      "dateModified": "2026-01-10T16:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk says outcry over X's Grok service is 'excuse for censorship'",
    "url": "https://www.bbc.com/news/articles/ce3kqzepp5zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fae4/live/80dd7630-edbb-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-10T11:41:06.000Z",
    "description": "Elon Musk has said critics of his social media site X are looking for \"any excuse for censorship\", after its artificial intelligence (AI) chatbot Grok",
    "body": "Elon Musk has said critics of his social media site X are looking for \"any excuse for censorship\", after its artificial intelligence (AI) chatbot Grok drew criticism over its use to create sexualised images of people without their knowledge or consent.Ofcom says it is conducting an urgent assessment of X in response, with the backing of Technology Secretary Liz Kendall.But the chairwomen of Parliament's technology and media committees have both said they are concerned that \"gaps\" in the Online Safety Act might hinder the media regulator's ability to deal with the matter.X has now limited the use of AI image function to those who pay a monthly fee, a change dubbed by Downing Street as \"insulting\" to victims of sexual violence.The BBC has seen several examples of the free AI tool undressing women and putting them in sexual situations without their consent.Kendall said on Friday that she expects an update from Ofcom within days, and that it would have the government's full support should it decide to block X in the UK.Musk reposted a number of messages on the site overnight criticising the government's reproval of Grok - including one which showed AI-generated images of Prime Minister Sir Keir Starmer in a bikini.\"They just want to suppress free speech,\" Musk wrote.Ashley St Clair, the mother of one of Elon Musk's children, told BBC Newshour on Friday that Grok had generated sexualised photos of her as a child. The conservative influencer said her image had been \"stripped\" to appear \"basically nude, bent over\", despite her telling Grok that she did not consent to the sexualised images.St Clair, who filed a lawsuit against Musk in 2025 seeking sole custody of their child, accused the social media site of \"not taking enough action\" to tackle illegal content, including child sexual abuse imagery. \"This could be stopped with a singular message to an engineer,\" she said.As of Friday morning, Grok was telling users asking it to alter images uploaded to X that \"image generation and editing are currently limited to paying subscribers\", adding users \"can subscribe to unlock these features\".An Ofcom spokesperson said on Friday: \"We urgently made contact [with X] on Monday and set a firm deadline of today to explain themselves, to which we have received a response.\"We're now undertaking an expedited assessment as a matter of urgency and will provide further updates shortly.\"Ofcom's powers under the Online Safety Act include being able to seek a court order to prevent third parties from helping X raise money or be accessed in the UK - should the firm refuse to comply.But Dame Chi Onwurah, chairwoman of the innovation and technology committee, said she was \"concerned and confused\" about how the matter is \"actually being addressed\", and has written to Ofcom and Kendall for clarification.Dame Chi said it was \"unclear\" under the Online Safety Act whether the creation of such images using AI was illegal, as was the responsibility of social media sites for what was shared on their platforms.\"The act should really make something so harmful to so many people clearly illegal, and X's responsibility should be clear,\" she told BBC Radio 4's Today programme.Caroline Dinenage, chairwoman of the culture, media and sport committee, likewise said she had a \"real fear that there is a gap in the regulation\".\"There are doubts as to whether the Online Safety Act actually has the power to regulate functionality - that means generative AI's ability to nudify someone's image,\" she told BBC Breakfast.The use of Grok to generate non-consensual sexualised images has been condemned by politicians on all sides: Prime Minister Sir Keir Starmer called it \"disgraceful\" and \"disgusting\"Reform UK leader Nigel Farage said it was \"horrible in every way\" and that X \"needs to go further\" than the changes it had made to Grok on Friday, but he added that banning the platform would be an attack on free speech The Liberal Democrats called for access to X to be temporarily restricted in the UK while the social media site was investigated.Elsewhere, Australia's Prime Minister Anthony Albanese said he agreed with Starmer that the material was \"completely abhorrent\".\"It, once again, is an example of social media not showing social responsibility,\" Albanese said, adding that Australia's digital safety commissioner was looking at the situation.\"Australians and indeed, global citizens deserve better.\"Meanwhile, Grok was temporarily suspended in Indonesia on Saturday. The country's digital minister said \"non-consensual sexual deepfakes [were] a serious violation of human rights, dignity and the security of citizens in the digital space\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk says outcry over X's Grok service is 'excuse for censorship'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fae4/live/80dd7630-edbb-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-10T11:41:06.000Z",
      "dateModified": "2026-01-10T11:41:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlotte Church says she would be dead without dad's help ",
    "url": "https://www.bbc.com/news/articles/c0er41yjyyno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg",
    "tag": "Trending",
    "date": "2026-01-06T18:05:59.000Z",
    "description": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Churc",
    "body": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Church has said she \"would be dead\" without the influence of her father, after growing up in the spotlight.The Cardiff-born singer opened up on her close relationship with her father, James Church, in public speaking coach Deborah Thomas's podcast, These Three Things. Church, 39, credited her dad with helping her navigate the \"child star route\", adding: \"It's so arduous and there are so many temptations along the way, and so it would have been so easy for me to have fallen into addiction...\" In the interview, the star said she had a \"lot going on\" and that her father, who has a terminal diagnosis of rare blood disorder amyloidosis, was currently in hospital. During the podcast, which asks guests to share a special person, place and possession which has shaped them, Church said her father was an \"absolutely extraordinary human\" who had been through \"so much\", including battling septicaemia seven times. Describing the start of her career as a child touring with mother Maria, she said: \"We really missed him on the road. My family aren't very traditional in any way at all, and so my father was far more sort of like the nurturing one.\"The singer, who recently appeared on Celebrity Traitors, was just 11 years old when she rose to global fame and earned the moniker the Voice of an Angel.Church said her father joined them on the road after a year and would help take care of her while her mother dealt with the business side of her career, describing him as like \"the hearth\". \"He was sort of worldly and wise enough that he could ground me in a perspective, ground me in the transience of it all, and that it probably wouldn't be forever, and just [try] to say let's enjoy it while it's here.\" Church, who runs a wellness retreat in the Nant Caethon Valley in Powys, said it had been a \"journey\" since her father's terminal diagnosis nearly a decade ago. \"Pretty much every year in those nine years, he's had a near-death experience where it's like something's happened.\"He has really had to tolerate this rollercoaster of health and emotions and everything associated. But it's also a very long time to live with a terminal diagnosis, and so it's massively changed him.\"Speaking about her father's impact on her life, Church added: \"I'm making him a photo album, and I think that'll be very emotional for us to go through. \"But in general, I am able to tell him what he means to me, and how he has massively shaped my life and shaped who I am.\"Without him, I'd be dead.\" More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlotte Church says she would be dead without dad's help ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg"
      ],
      "datePublished": "2026-01-06T18:05:59.000Z",
      "dateModified": "2026-01-06T18:05:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Debt charities report January spike in calls as worries mount",
    "url": "https://www.bbc.com/news/articles/c0er4n1zelro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/83c9/live/1ed7a090-eb0f-11f0-992c-75363ad17690.jpg",
    "tag": "Trending",
    "date": "2026-01-10T00:08:52.000Z",
    "description": "'Unprecedented' numbers seeking debt help post-Christmas, say charities16 hours agoKevin PeacheyCost of living correspondentGetty ImagesDebt charities",
    "body": "'Unprecedented' numbers seeking debt help post-Christmas, say charities16 hours agoKevin PeacheyCost of living correspondentGetty ImagesDebt charities say they are receiving an influx of calls as people worry their financial situation has slipped towards becoming unmanageable.The first weeks of January are usually the busiest time of year for helplines following a particularly expensive period.Advice charity StepChange said Monday was busier than any single day last year, and credit counselling service Money Wellness said a fifth of those accessing its services at the turn of the year did so between 22:00 and 03:00.Dave Murphy is working his way out of debt and said demands from creditors could have become overwhelming, but he urged anyone struggling to ensure they asked for help - for their financial and mental wellbeing.Money Wellness, which runs free debt and money advice services, said thousands of people had accessed its services on Christmas Eve and Christmas Day. Expanded assistance online allows people to increasingly find information outside of normal hours - including overnight.Sebrina McCullough, its head of advice, said: \"The numbers we're seeing over Christmas and New Year are unprecedented.\"People often feel pressure to celebrate the holidays, even when money is tight, and our data shows many are turning to us late at night when they feel most anxious.\"Pressure of priority billsStepChange's website had 3,958 visitors on Christmas Day, and 15,401 on New Year's Eve and 1 January combined.Many may have simply been exploring their options, but calls came in thick and fast at the start of the month. While not at the level of the energy crisis of a few years ago, call numbers were notably up on last year.The Money Advice Trust, which runs National Debtline, said the first working days of January had seen more calls than last year.Monday was the busiest single day in its history, when 1,365 calls came in.Concerns are particularly acute for those struggling to pay priority bills such as council tax and rent.The colder weather could also place extra strain on vulnerable households, with £4.4bn already owed to energy suppliers following a period of high prices, although the government's cold weather payments have been triggered in many areas.Charities are urging anyone whose debt has become unmanageable to seek help as soon as possible, rather than making matters worse by ignoring the situation.That is a view shared by Dave, who has managed to work his way out of difficulty. A few years ago, he found his previously manageable credit card debt becoming a problem when he was unexpectedly made redundant at the same time as going through a divorce.Dave has turned his finances around after receiving help from StepChange\"They were two quite dramatic things in six months,\" said Dave, who has previously spoken to the BBC about his debt issues.\"The debt was around £20,000 to £25,000 at its height. It became so overwhelming. You feel that you are letting creditors down because you want to do what they ask of you - but you are scared, you are renting, and at times you struggle to get through each day.\"Once you are in a spiral, it is really hard to get out of it.\"He is now working in insurance, his debts are manageable and being paid off, and he said he wanted to help others \"to show that you can get through these things\".Figures published earlier in the week by the Bank of England fuelled concerns that everyday costs were becoming harder for some households to manage without turning to borrowing.The data showed that credit card borrowing grew at the fastest annual rate in nearly two years in the run-up to Christmas.The annual growth rate for credit card borrowing increased to 12.1% in November, from 10.9% the previous month - the highest figure since January 2024 when it was 12.5%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Debt charities report January spike in calls as worries mount",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/83c9/live/1ed7a090-eb0f-11f0-992c-75363ad17690.jpg"
      ],
      "datePublished": "2026-01-10T00:08:52.000Z",
      "dateModified": "2026-01-10T00:08:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Medics describe overwhelmed hospitals as Iran protests continue",
    "url": "https://www.bbc.com/news/articles/cj9rengvnp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d1e5/live/c59827a0-ee21-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-10T13:12:36.000Z",
    "description": "3 hours agoHelen Sullivan,BBC NewsandSoroush Pakzad & Roja Asadi,BBC News PersianReutersBurning vehicles were pictured in Tehran on Friday nightAs pro",
    "body": "3 hours agoHelen Sullivan,BBC NewsandSoroush Pakzad & Roja Asadi,BBC News PersianReutersBurning vehicles were pictured in Tehran on Friday nightAs protests in Iran continue and Iranian authorities issued coordinated warnings to protesters, a doctor and medic at two hospitals told the BBC their facilities were overwhelmed with injuries.One doctor said a Tehran eye hospital had gone into crisis mode, while the BBC also obtained a message from a medic in another hospital saying it did not have enough surgeons to cope with the influx of patients. On Friday, US President Donald Trump said Iran was in \"big trouble\" and warned \"you better not start shooting because we'll start shooting too\".Iran in a letter to the UN Security Council blamed the US for turning the protests into what it called \"violent subversive acts and widespread vandalism\".Watch: Protesters take to the streets of Tehran on Friday nightAnti-government protests, which continued on Friday, have taken place in dozens of locations, with two human rights groups reporting at least 50 protesters have been killed.The BBC and most other international news organisations are barred from reporting inside Iran, and the country has been under a near-total internet blackout since Thursday evening, making obtaining and verifying information difficult.A doctor from Iran, who contacted the BBC via Starlink satellite internet on Friday night, said Farabi Hospital, Tehran's main eye specialist centre, had gone into crisis mode, with emergency services overwhelmed. Non-urgent admissions and surgeries were said to have been suspended, and staff called in to deal with emergency cases.The BBC also obtained a video and audio message from a medic in a hospital in the south-west city of Shiraz on Thursday. The medic said large numbers of injured people were being brought in, and the hospital did not have enough surgeons to cope with the influx. He claimed many of the wounded had gunshot injuries to the head and eyes.A health worker at another hospital in Tehran also told the BBC that their patients included gunshot wound victims.Watch: Why are there huge protests going on in Iran?Since protests began on 28 December, at least 51 protesters, including seven children, and 21 security personnel have been killed, according to the US-based Human Rights Activist News Agency (HRANA). More than 2,311 individuals have also been arrested, the group reported.The Norway-based Iran Human Rights (IHRNGO) said at least 51 protesters, including nine children, had been killed.BBC Persian has verified the identities of 26 killed protesters, including five children.Iranian police maintained that no one was killed over Friday night in Tehran, though they said 26 buildings were set on fire, with damage to property very extensive.United Nations Secretary General spokesperson Stéphane Dujarric said the UN was very disturbed by the loss of life. \"People anywhere in the world have a right to demonstrate peacefully, and governments have a responsibility to protect that right and to ensure that that right is respected,\" he said.French President Emmanuel Macron, UK Prime Minister Sir Keir Starmer and German Chancellor Friedrich Merz released a joint statement that said: \"The Iranian authorities have the responsibility to protect their own population and must allow for the freedom of expression and peaceful assembly without fear of reprisal.\"Iran's Supreme Leader Ayatollah Ali Khamenei remained defiant in a televised address on Friday, saying: \"The Islamic Republic came to power through the blood of several hundred thousand honourable people and it will not back down in the face of those who deny this.\"Later, in remarks made to a gathering of supporters and broadcast on state television, Khamenei reiterated the message, saying Iran \"will not shirk from dealing with destructive elements\".By contrast, the son of Iran's last shah, Reza Pahlavi, described the protests on Friday as \"magnificent\" and urged Iranians to stage further targeted protests over the weekend.\"Our goal is no longer just to take to the streets. The goal is to prepare to seize and hold city centres,\" Pahlavi said in a video message on social media.Pahlavi, who is based in the US, said he was preparing to return to the country.More on this storyFormer British ambassador to Iran, Sir Simon Gass, told BBC Radio 4's Today programme \"we really shouldn't get too ahead of ourselves\" when discussing regime change. He said the lack of organised opposition within Iran means that people do not have anyone to coalesce around who presents an alternative to the regime as it stands.He added, however, that these protests are different to previous ones, which are bringing in \"a much wider movement of protesters than we've tended to see in the past\", triggered by ordinary people finding it \"almost impossible to make ends meet because of the disaster to the economy\".At the White House on Friday, Trump said his administration was watching the situation in Iran carefully. \"It looks to me that the people are taking over certain cities that nobody thought were really possible just a few weeks ago,\" he said.He echoed earlier warnings to Iran's leadership, saying: \"We will be hitting them very hard where it hurts.\" He added that any US involvement did not mean \"boots on the ground\". On Thursday, Trump said he would \"hit them very hard\" if they \"start killing people\".Later on Friday, the US said Iran's foreign minister was \"delusional\" after he accused Israel and Washington of fuelling the protests.\"This statement reflects a delusional attempt to deflect from the massive challenges the Iranian regime faces at home,\" a US State Department spokesperson said in response to the comments by Foreign Minister Abbas Araghchi.Early on Saturday, US Secretary of State Marco Rubio posted on X: \"The United States supports the brave people of Iran.\" Iranian political activist Taghi Rahmani, who spent 14 years in prison in Iran and whose wife, Nobel Peace Prize winner Narges Mohammadi, was re-arrested in December, told the Today programme he was dubious of American support.\"We believe foreign intervention will make the opposition dependent,\" he said. \"When the opposition is dependent, you have to sacrifice national interests for that government. This will not be acceptable for the Iranian people.\"The Iranian security and judicial authorities had issued a series of coordinated warnings to protesters on Friday, hardening their rhetoric and echoing an earlier message of \"no leniency\" by Iran's top security body, the Supreme National Security Council.Iran's National Security Council said \"decisive and necessary legal action will be taken\" against protesters, which it described as \"armed vandals\".The intelligence arm of Iran's Islamic Revolution Guard Corps (IRGC) said it would not tolerate what it described as \"terrorist acts\", asserting that it would continue its operations \"until the complete defeat of the enemy's plan\".Additional reporting by Soroush Negahdari",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Medics describe overwhelmed hospitals as Iran protests continue",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d1e5/live/c59827a0-ee21-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-10T13:12:36.000Z",
      "dateModified": "2026-01-10T13:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jesy Nelson spoke about SMA this week - I've lived with it for years",
    "url": "https://www.bbc.com/news/articles/czejd4jny74o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/efdf/live/e16c4a60-ed81-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-10T01:49:20.000Z",
    "description": "Doctors said I might not make my second birthday with muscle disease SMA. Now I'm 2514 hours agoBBCFormer Little Mix star Jesy Nelson revealed this we",
    "body": "Doctors said I might not make my second birthday with muscle disease SMA. Now I'm 2514 hours agoBBCFormer Little Mix star Jesy Nelson revealed this week that her twin daughters have been diagnosed with Spinal Muscular Atrophy (SMA) type one, a muscle-weakening disease. BBC journalist Ben Morris has SMA and describes what it is like to live with the condition.Life started with a bit of a bump for my parents when they noticed that I, aged about six months, wasn't developing at the same rate as my peers.Other babies my age were kicking and some had started crawling, but I was quite content sitting in my buggy, watching the world pass me by.Worried something wasn't quite right, my parents took me to the GP. Initially the doctor thought there was nothing wrong. After my parents requested some tests, he sat me on the side of the medical bed in his office and let go.I immediately fell over and did not move my arms to save myself. The doctor caught me and said one word: \"Oh.\"WireImage via Getty ImagesJesy Nelson is calling for babies to get routine screening for SMA at birthAfter further appointments, on 15 October 2001 I was diagnosed with SMA type two. My parents were told I may not live beyond two years old.The neurologist told my parents he would see us again in the New Year for a check-up. SMA severely impacts the respiratory system, meaning colds and chest infections developed in the winter can potentially be life threatening for babies with it.But when we returned in early 2002, the neurologist remarked: \"He's a survivor.\"My family were signposted to a charity now known as Spinal Muscular Atrophy UK, (SMA UK) which helped support me. I've also befriended others who have SMA, sharing our common experiences and helping each other know we're not alone.Despite doctors not expecting me to live beyond a toddler, I'm now 25, working as a BBC journalist and living independently with the help of personal care assistants. I use an electric wheelchair to get around - meaning I never have to stand up on the Tube when commuting which is a win!I have to use a ventilator overnight, when my breathing is more shallow than during the day. That might sound scary to some people, but for me it's completely normal. I take a daily drug called Risdiplam, which keeps my condition stable. It's different to Zolgensma, the gene therapy drug approved by the NHS in 2021 to treat babies - this can only be taken at an early age because of its impact on the kidneys.Spinal Muscular Atrophy (SMA)What is it? The NHS describes SMA as \"a rare genetic condition that can cause muscle weakness\". The NHS lists five types - with type two most people survive into adulthoodHow many people have it? The National Institute for Health and Care Excellence (NICE) says SMA affects about one in 14,000 births worldwide. It is estimated about 47 people were born with SMA in the UK in 2023, 60% with type one. Between 683 and 1,366 people currently have SMA in the UK, according to NICEWhat are the treatments? Gene therapy for babies, through a drug called Zolgensma. According to SMA UK, the drug delivers a healthy copy of the affected gene to the body, but timing is critical because irreversible damage may have already occurred in the nervous systemWhat about testing? Scotland will routinely screen babies for SMA from the spring, and the National Screening Committee is currently reviewing whether to introduce it for babies across the UK via a heel prick blood testIn 2003, my sister Emily was born, three years after me, and my parents had the difficult task of looking after us both. She doesn't have SMA, but may be a carrier of the condition. About one in 40 people carry the altered gene that can cause the disease, according to SMA UK.Emily has never treated me any differently because I have SMA, though an operation I had on my spine for scoliosis which stopped me from growing, means she does take pride in the fact she'll always be taller than me.My dad worked as a project manager, and he used that mindset when dealing with the various support services I needed. He managed to get teams such as wheelchair services, physiotherapy, neurology and children's services all in a room every three months so they were working together, not separately.Ben Morris gained a journalism degree from the University of WinchesterI went to a mainstream primary school, with a teaching assistant who would stay with me all day, just in case I needed help. I did all the same tests as everyone else, got told off when I didn't do my homework, and socialised with my friends like anyone else.This continuous planning has followed me throughout my life, and has allowed me to do some amazing things.I've raced on the track at London Stadium as part of a test event for the 2012 Olympics, given talks to David Cameron's wife Samantha and actor Eddie Redmayne in 10 Downing Street, and got a degree in journalism from the University of Winchester.Nelson's twins may well grow up to be stronger than I am, as treatment for babies has advanced over the years. There have been many success stories of people living with SMA, such as Kim Tserkezie, who played Penny Pocket in the Balamory TV series, Paralympian Sally Kidson and US Youtuber Shane Burcaw, to name a few.It's great Nelson is discussing this, and hopefully as I am showing, it's possible to live a fulfilled and happy life if you have SMA.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jesy Nelson spoke about SMA this week - I've lived with it for years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/efdf/live/e16c4a60-ed81-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-10T01:49:20.000Z",
      "dateModified": "2026-01-10T01:49:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The nine most dramatic moments ever on The Traitors",
    "url": "https://www.bbc.com/news/articles/c79r84y4x29o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3f71/live/b0371fb0-ee12-11f0-8692-012f383b8e06.jpg",
    "tag": "Trending",
    "date": "2026-01-10T09:41:44.000Z",
    "description": "Where does latest Traitors showdown rank in show's most explosive moments?7 hours agoIan Youngs,Culture reporter,Jemma CrewandNoor NanjiBBC/Studio Lam",
    "body": "Where does latest Traitors showdown rank in show's most explosive moments?7 hours agoIan Youngs,Culture reporter,Jemma CrewandNoor NanjiBBC/Studio Lambert/Euan CherryTensions have been ratcheting up in the castle. Contestant Fiona is pictured centreThere have been many tense moments in The Traitors' castle over the years, but the drama in the last two episodes has to go down as some of the most explosive in the show's history.Warning: spoilers below for the latest episodes of The Traitors, and previous series In Thursday's episode, a civil war erupted between two traitors after Rachel revealed to her fellow contestants that banished faithful Amanda had confided in her she was a former detective.Fiona - until recently, the \"secret traitor\" - took umbrage at Rachel's tactics and confronted her in front of the others, accusing her of lying and of being a traitor. Which she is. But the others don't know that.In Friday's episode, the row continued in the turret, with Rachel accusing Fiona of \"throwing a grenade\" into the team of traitors, while Fiona accused her of \"playing a game\" for herself.The third traitor, Stephen, said he was \"absolutely speechless\" at the altercation.Things came to a head in a tense roundtable led by Rachel, which culminated in Fiona receiving the most votes and being banished.Fiona later admitted: \"My cunning plan was not cunning at all!\" She also explained that she didn't vote for Rachel herself, despite the row, \"because she deserves to win\".Is this the most dramatic showdown ever? Have a look at some of the other contenders below from the last four series of the Traitors and the first Celebrity Traitors season, then cast your vote...Traitor Harry beats Mollie to winThree players remained in the series two final's high-drama climax. Mollie first wrote down Harry's name as a traitor but then changed her mind and rubbed it out to write Jaz's name instead, eliminating him.Once it was just her and Harry left, she revealed her identity as a faithful, shooting Harry an affectionate, trusting, reassuring look. He looked awkwardly at his shoes...Moments later, he admitted he was, and always had been, a two-faced traitor - meaning he had won the £95,000 prize. Mollie clasped her cheeks in horror, swore and walked out in tears.'She's my girlfriend!'The series one contestants almost choked on their breakfast croissants when magician Tom stood up to deliver some bombshell news.In a desperate bid to defend fellow faithful Alex, who was under suspicion after being put \"on trial\", he revealed: \"Alex isn't a Traitor, straight up, she's my girlfriend.\"Heads were clutched, hands brought to mouths and expletives uttered. A blindsided Alex sat quietly with her head in her hands.\"I just panicked,\" Tom told viewers afterwards.Calling for time-out as accusations flew and tempers flared, faithful John said: \"Everyone stop talking just for 10 seconds and sit down, we've all gone from zero to 1,000 and it's just gone crazy.\"Alan Carr murders Paloma FaithAlan Carr \"murdered\" Paolma Faith in plain sight by touching her faceWhen celebrity traitor Alan Carr was tasked with murdering in plain sight, he selected singer Paloma Faith, who by his own admission was one of his best friends.The identity of the victim was revealed to the group after a shortlist of three celebrities were chosen to lie in open coffins. \"It might not be you!\" Carr reassured Faith innocently as she settled into hers.He tried to look as shocked as the others when host Claudia Winkleman slammed Faith's coffin lid shut, but couldn't help a guilty grimace. \"It broke my heart,\" he protested later.The drama didn't end there, though. Faith was genuinely unimpressed when she found out the culprit was someone she thought of as a close friend.\"I don't think he should've done that to me, and I'm surprised that he did,\" she told the Uncloaked podcast.The Traitors turn on each otherHarry had a quiet word with Zack during one heated roundtable in series twoWhen a traitor decides to turn on one of their own, it always raises the stakes. And in series two, Paul decided to point the finger at fellow traitor Miles.Miles sent accusations back his way and the pair exchanged friendly fire across the roundtable.As they were doing so, in a masterstroke of cunning gameplay, Harry - the third traitor - sowed further suspicion about both by whispering to Zack: \"Do you reckon there's two Traitors going at each other?\"Zack took the bait and took aim at Paul. Miles was banished first, followed the next night by Paul.A 'parting gift'Series one's Kieran told the faithful he had put fellow traitor Wilf's name on his slate as a \"parting gift\", shortly before being banished at the final roundtable. This, combined with a meaningful glance as he stood up to reveal his own identity, planted fatal seeds of suspicion. \"What did he mean?\" an anguished Hannah asked, removing her face from her hands. \"Why did he do that?\"Cue dramatic shouting and gesturing by Wilf who, all too aware of the danger, repeatedly swore he was not a traitor. \"How do you think I feel?... He set me up,\" he shrieked.\"I can't stop shaking,\" said Aaron. 'Seer' Francesca tries to nail CharlotteFrancesca and Charlotte had very different versions of events at the breakfast table the morning afteir their \"seer\" meetingA new twist in series three made one player the \"seer\", who could force a fellow contestant to tell them whether they were a faithful or a traitor.Francesca chose Charlotte, who revealed she was a traitor (but not that she wasn't really Welsh).The morning after, the pair subjected fellow contestants to the season's most wincingly awkward breakfast.Charlotte claimed she had told Francesca she was a faithful; Francesca insisted, truthfully, that Charlotte had told her she was a traitor.\"You're literally lying,\" Charlotte responded in her Welsh accent.'If you throw me under the bus...'Another traitor-on-traitor moment from series one - this time hidden from faithful eyes in the castle's secret turret.\"Wilfred, can I just tell you something? What is on the flag of Wales?\" asked Swansea-based contestant Amanda. \"A dragon,\" came her fellow Traitor's cautious reply. \"If you throw me under the bus, OK, that's what I'm going to be,\" she retorted. A threat delivered quietly, but no less powerful for it.A mother buried in front of her sonA morbid funeral procession culminated in three contestants lying in coffins, waiting to hear who would be \"buried\". High stakes it certainly was. But little did the faithful know that the fate of retired schoolteacher Diane was already sealed, after she had drunk from the poisoned chalice (a glass of sparkling rosé) the night before. Earlier in series two, Diane had told viewers privately that Paul was not her son, following speculation from other players. \"But Ross is,\" was the delicious, marmalade-dropping aside that followed.This revelation, unheard by the other contestants, just magnified the tension.\"You see how emotional everyone's getting... imagine that but a million-fold because your actual parent might be murdered,\" Ross said to camera, before viewers saw the coffin lid slam shut on his mother. \"Horrendous,\" was Diane's reaction.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The nine most dramatic moments ever on The Traitors",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3f71/live/b0371fb0-ee12-11f0-8692-012f383b8e06.jpg"
      ],
      "datePublished": "2026-01-10T09:41:44.000Z",
      "dateModified": "2026-01-10T09:41:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]