[
  {
    "title": "'Carspreading’ is on the rise - not everyone is happy",
    "url": "https://www.bbc.com/news/articles/cy7vdvl2531o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c28e/live/e45ae640-cf6e-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-03T08:37:07.000Z",
    "description": "8 hours agoTheo LeggettInternational Business CorrespondentBBCListen to this article Critics call it \"carspreading\". In the UK and across Europe, cars",
    "body": "8 hours agoTheo LeggettInternational Business CorrespondentBBCListen to this article Critics call it \"carspreading\". In the UK and across Europe, cars are steadily becoming longer, wider and heavier. Consumers clearly like them – a lot. Big cars are seen as practical, safe and stylish, and sales are growing. So, why are some cities determined to clamp down on them - and are they right to do so?Paris is renowned for many things. Its monuments, such as the Eiffel Tower and Arc de Triomphe. Its broad, leafy avenues and boulevards, its museums and art galleries, its fine cuisine. And its truly appalling traffic.Over the past 20 years, the city authorities have been trying to tackle the problem, by introducing low-traffic and low-emission zones, by promoting public transport and cycling – and most recently by clamping down on big cars.In October 2024 on-street parking charges for visiting \"heavy\" vehicles were trebled following a public vote, taking them from €6 to €18 for a one-hour stay in the centre, and from €75 to €225 for six hours.\"The larger it is, the more it pollutes,\" said the mayor of Paris, Anne Hidalgo, before the vote. The new restrictions, she claimed, would \"accelerate the environmental transition, in which we are tackling air pollution\".A few months later, the town hall claimed the number of very heavy cars parking on the city streets had fallen by two-thirds.Bloomberg via Getty ImagesParis is renowned for many things - including bad traffic in certain areasCities elsewhere are taking note, including in the UK. Cardiff council has already decided to increase the cost of parking permits for cars weighing more than 2,400kg - the equivalent of roughly two Ford Fiestas.The Labour-controlled authority said, \"These heavier vehicles typically produce more emissions, cause greater wear and tear on roads, and critically pose a significantly higher risk in the event of a road traffic collision.\"To begin with, the higher charges will only apply to a small minority of vehicle models, but Cardiff plans to lower the weight threshold over time. Other local authorities are mulling similar steps.AFP via Getty Images'The larger it is, the more it pollutes,' argued Paris mayor, Anne HidalgoBut many owners say they are reliant on big cars.Matt Mansell, a father of three based in Guildford, runs a technology company, as well as a property development business, and says he needs his Land Rover Defender 110 for ferrying around clients and children.\"I need to have enough space to put children in, with all of their kit - also, you can fit a door or a three-metre length of pipe in it,\" he says.\"It's very much a utility vehicle, but it's presentable.\"'Chelsea tractors': Rise of the SUVThere is no question cars in the UK and Europe have been getting bigger over the years. Since 2018, the average width of new models on sale here has risen from 182cm to 187.5cm, according to data from Thatcham Research – an organisation that evaluates new cars on behalf of the insurance industry.The average weight, meanwhile, has increased from 1,365kg to 1,592kg over the same period.This is not just a recent phenomenon. Data compiled by the International Council for Clean Transportation shows the average width of cars on European markets grew by nearly 10cm between 2001 and 2020. Length increased by more than 19cm.Some critics argue this is a worrying trend, because there simply isn't enough room on Britain's crowded, often narrow roads or in town centres.Getty ImagesAre cars getting bigger, or are roads getting narrower?The standard minimum width of an on-street parking space is 1.8m in many places. But figures published by T&E, a green transport campaign group, suggest that by the first half of 2023, more than half of the 100 top-selling cars in the UK were fractionally wider than this.Then there is the rocketing popularity of Sports Utility Vehicles, or SUVs, cars that are at least loosely based on off-road vehicles, although in many cases the resemblance is cosmetic, and they lack genuine off-road features such as four-wheel drive. The vast majority will never stray far from the tarmac, hence their rather derisory nickname: Chelsea tractors.There are plenty of different designs out there, including utility models that you can actually use off road, swanky status symbols and legions of suburban family wagons.What they all they have in common, however, is size. Even the smaller \"crossover\" versions, more closely related to conventional cars, tend to be taller and wider than traditional saloons, hatchbacks or estates.Back in 2011, SUVs made up 13.2% of the market across 27 European countries, according to the automotive research company Dataforce GmbH. By 2025, their market share had grown to 59%.Rachel Burgess, editor of Autocar magazine, believes it is their size that makes them so popular. \"Everyone I've spoken to over the years who has bought an SUV says they like being higher up, they like better visibility, and they feel safer on motorways and bigger roads.\"It's often better for people with kids to get them in and out of the car with that extra height; and also, for people who are less mobile, it's much easier to get in and out of an SUV than a lower hatchback or saloon.\"Lucia Barbato: 'On a Monday morning with three boys, three school bags, three sports kits, and a trumpet thrown in the boot, there isn't even room in the car for the dog!'Lucia Barbato, from West Sussex, says her second-hand Lexus RX450 SUV - a hybrid model - is vital for transporting her large family in an area with limited public transport. She runs a marketing agency from home and drives her three sons to the bus stop each day, so they can go to school.\"On a Monday morning with three boys, three school bags, three sports kits, and a trumpet thrown in the boot there isn't even room in the car for the dog!\"Bigger cars, bigger profit margins?The popularity of SUVs doesn't just apply to mass-market carmakers. Porsche is famous for its sleek sports cars but the Cayenne SUV and the Macan crossover are its bestselling models. Bentley's Bentayga SUV accounted for 44% of its sales last year, while Lamborghini is increasingly reliant on its four-wheel drive Urus.Put bluntly, consumers clearly love SUVs. Carmakers, meanwhile, are only too happy to meet that demand, because building bigger cars can be more profitable, argues David Leggett, editor of industry intelligence website Just Auto.Getty Images and Bloomberg via Getty ImagesPorsche is famous for its sports cars but the Cayenne and the Macan crossover are its bestselling models\"Profit margins are generally much higher on larger cars with higher price points. This is largely due to the laws of economics in manufacturing.\"There are, he points out, fundamental costs involved in building any car - for example operating a factory, design work, and the price of the main components. But he explains that with small cars, these costs can make up a higher proportion of the selling price.Daniele Ministeri, senior consultant at JATO Dynamics, points out that many SUVs are closely related to conventional cars, and use the same basic structures.\"For some models, the main differences are limited to factors such as body style, suspension and seating position, allowing them to command an SUV premium price, without comparable cost increases\", he says.The safety debateEven conventional cars have been getting bigger in some cases.Take the current VW Golf hatchback, which is 18cm wider and 26cm longer than the original version introduced in the 1970s. It is also several hundred kilograms heavier.\"If we look back to the early 2000s… safety programmes like Euro NCAP were just starting to deliver the safety message to consumers, smaller vehicles weren't really able to absorb the energy of a crash very well at all,\" says Alex Thompson, principal safety engineer at Thatcham Research.\"As safety measures have improved, a certain amount of weight had to be added on to vehicles to strengthen up safety compartments because they weren't that strong back then.\"\"Manufacturers have had to do things like improve structural crash protection, and fit more airbags,\" agrees David Leggett. \"At the same time, they want to improve interior cabin space and put more features into vehicles, so the net result is rising pressure for bigger vehicle dimensions.\"More from InDepthYet while bigger cars may be safer for their occupants, critics insist they are considerably less safe for other road users.\"Whether you're in another car [or] a pedestrian, you're more likely to be seriously injured if there's a collision with one of these vehicles,\" argues Tim Dexter, vehicles policy manager at T&E. He is also concerned about the implications for cyclists.Research carried out in 2023 by Belgium's Vias Institute, which aims to improve road safety, suggested that a 10cm increase in the height of a car bonnet could increase the risk of vulnerable road users being killed in a collision by 27%. T&E also highlights concerns that high bonnets can create blind spots.Alex Thompson says that taller, higher cars are more likely to harm pedestrians and cyclists, although he emphasises that vehicle design in recent years has \"really prioritised\" protecting vulnerable road users. Some manufacturers have, for example, fitted external airbags to their vehicles.In Pictures via Getty Images ImagesDavid Leggett believes people could potentially be encouraged to buy smaller vehiclesAs for the environmental impact, the International Energy Agency has said: \"Despite advances in fuel efficiency and electrification, the trend toward heavier and less efficient vehicles such as SUVs, which emit roughly 20% more emissions than an average medium-sized car, has largely nullified the improvements in energy consumption and emissions achieved elsewhere in the world's passenger car fleet in recent decades.\"The move towards electric vehicles should at least mitigate emissions from daily use significantly over time, although if the electricity they use is generated from fossil sources such as gas, bigger cars may well still pollute more per vehicle than smaller ones. And other concerns about size and weight will still apply – in fact, with electric cars generally weighing considerably more than their petrol or diesel equivalents, certain problems could be magnified.The Society of Motor Manufacturers and Traders says that 40% of SUVs are now zero-emission. Its chief executive, Mike Hawes, has previously said that overall the carbon dioxide emissions of new SUVs have more than halved since 2000, \"helping the segment lead the decarbonisation of UK road mobility\".Penalties, taxes and the France modelBut if there is to be a clampdown, one option is what has already been done across the Channel.France already imposes extra registration taxes on cars that weigh in at more than 1,600kg. Currently, this means a €10 (£9) penalty for every extra kilogramme. The penalty increases in bands, reaching €30 per kg above 2,100kg.While it only applies to a relatively small proportion of current models – and electric vehicles are excluded – it can add up to €70,000 to the cost of buying a new car.T&E argues that a similar levy should be introduced in the UK. According to Tim Dexter, \"At the moment the UK is a tax haven for these large vehicles… We know the impact they are having on the road, on communities, potentially on individuals. It's only fair they should be paying a bit more.\"David Leggett believes people could potentially be encouraged to buy smaller vehicles, particularly for use in cities. \"There are opportunities to tweak tax regimes to make smaller cars relatively attractive,\" he says.But ensuring there are enough runabouts to go around may be tricky. \"There will always be a market for highly manoeuvrable and low-cost city cars in urban areas, but making them profitably is a huge challenge,\" Mr Leggett says.Bloomberg via Getty ImagesSeveral relatively low-priced small EVs have recently come on to the market, including BYD's Dolphin SurfHowever, several relatively low-priced small EVs have recently come on to the market, including BYD's Dolphin Surf, Leapmotor International's T03, Hyundai's Inster and the new Renault 5. They will be joined before long by Kia's EV2, and VW's ID Polo.For the moment though, SUVs remain firmly in charge.\"Clearly, people want SUVs, and I'm not sure what the answer to that is,\" says Rachel Burgess. \"But small cars are coming back, as the industry has understood how to make money from small cars in an electric world...\"I do believe everything is cyclical and trends come and go in every part of life, including cars. SUVs won't be around forever.\"Top picture credit: Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Carspreading’ is on the rise - not everyone is happy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c28e/live/e45ae640-cf6e-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-03T08:37:07.000Z",
      "dateModified": "2025-12-03T08:37:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Football abuse: Premier League and WSL stars targeted by death and rape threats",
    "url": "https://www.bbc.com/sport/football/articles/c4g98zkx518o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97fc/live/5b3b6380-cfbe-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-03T06:22:31.000Z",
    "description": "Racism, rape and death threats: One weekend of social media abuse in footballImage source, BBC SportImage caption, Managers are being targeted by abus",
    "body": "Racism, rape and death threats: One weekend of social media abuse in footballImage source, BBC SportImage caption, Managers are being targeted by abuse more often than players in the Premier League and Women's Super LeagueByNatalie Pirks, Melissa Sharman, Sarah Dawkins and Daniel AustinBBC Sport Warning: This article contains screenshots of and references to offensive language.More than 2,000 extremely abusive social media posts - including death and rape threats - were sent about managers and players in the Premier League and Women's Super League in a single weekend, a BBC investigation has found.The analysis - conducted with data science company Signify - focused on posts made during 10 Premier League and six WSL matches on the weekend of 8 and 9 November, and also found messages including racist slurs, homophobia and threats of violence.Managers were targeted more than players, with 82% of abusive posts made on X, formerly known as Twitter.Premier League bosses Ruben Amorim, Arne Slot and Eddie Howe were the most common targets of abuse in the men's top flight, while Chelsea and their manager Sonia Bompastor faced 50% of all abuse in the WSL.A total of 61% of all abusive messages were sent from accounts in the UK and the Republic of Ireland, and the data suggests the overall number is on the rise.Media caption, 'It's not acceptable' - Bompastor on online abuse'People have sense of impunity online'\"Abuse is never a good thing, whether it's about me or other managers,\" Liverpool head coach Slot said.\"We expect to be criticised. That is completely normal. I do not have social media so I don't see it, but I'm not stupid, I know it's there.\"Signify operates an artificial intelligence system called Threat Matrix, which scans posts made on social media for abuse. During the weekend of matches selected for the study, it analysed more than 500,000 posts on X, Instagram, Facebook, and TikTok, and identified 22,389 potentially abusive messages.But those flags can sometimes include examples which aren't abusive. For example, references to Newcastle defender Dan Burn can be flagged as a threat because of his surname.Therefore, a two-stage analysis by humans is conducted, which found that 2,015 of the posts met the threshold for verified extreme abuse - such as threats to life or hate speech - and broke the rules of the platforms they were posted on.What type of messages are being posted?Below we have included screenshots of some of the posts containing offensive language that were found as part of the investigation.We weighed up carefully whether to include them. In the end, we decided that it was important for you to have the option of seeing what was being posted to help our audiences better understand this story.You can view them on the picture gallery below.Image gallerySkip image galleryImage caption, Select to view screenshots of some of the abuse. Warning: contains offensive languageSlide 1 of 8, BBC Sport gallery of screenshots from our investigation, Select to view screenshots of some of the abuse. Warning: contains offensive languageThirty-nine posts - including monkey emojis on black players' accounts and rape threats - were deemed serious enough to warrant further investigation, which in some cases involves reporting to football clubs for potential identification of fans, and possible referral to law enforcement.One post was reported to police, who decided it did not meet their threshold for further action.Only one of the posts flagged to Meta, which owns and operates Facebook and Instagram, was removed. The others remain under investigation.Some of the 37 posts that were flagged to X were removed, while the others had their reach suppressed but were left online.\"If this happened on the street, this would have criminal consequences, potential financially damaging consequences,\" said Professional Footballers' Association chief executive Maheta Molango.\"So why is it that online people have got this sense of impunity? We need to put an end to this.\"Some in the game are resigned to the inevitability of abuse.\"It comes with the territory now,\" Newcastle manager Howe said.\"My advice is always to try and shelter yourself from it and become psychologically strong enough to not need to read it. But, invariably, people will show it to you even if you don't want to see it.\"Meta has implemented systems for helping block and filter abuse, while X has introduced a tool which displays the country or continent in which an account is based.The BBC contacted both X and Meta with questions about abuse on their platforms. Neither provided a comment.'Really horrible, violent content'In an office in central London, Signify's small team quietly sifts through thousands of posts.With every contentious moment during a game, the number of abusive messages rises.Up pop posts containing monkey emoijs and racist slurs, threats of rape to the family members of managers, and even death threats, sparked purely by actions on a football pitch.Every message the AI system deems abusive is checked twice by humans, who only count the messages which break social media platforms' own guidelines as verified abuse.The most significant surge in abusive posts occurred during Tottenham's dramatic 2-2 draw with Manchester United on 8 November, a match that featured two stoppage-time goals, after which both clubs' managers and several players faced concentrated abuse.In messages seen by the BBC, death threats were sent about Amorim, including one saying 'Kill Amorim - someone get that dirty Portuguese'.The Online Safety Act, which came into force in October 2023, puts a statutory duty of care on social media platforms.That means they are legally obliged to proactively identify and remove illegal content such as threats, harassment or hate speech. Ofcom is now the independent regulator responsible for making sure platforms comply.But the social platforms argue that the right to free speech makes them reluctant to censor or remove content. Signify insists that the problem of serious abuse and threats sent online is worsening.\"We've seen around a 25% year-on-year increase in the levels of abuse we're detecting,\" said its chief executive Jonathan Hirshler.\"We understand the platforms' position on free speech but some of the stuff we're talking about is so egregious.\"Really nasty death threats and really horrible, violent content. If the people who are the free speech absolutists out there read some of those messages, they wouldn't question why some of these are being reported and why action needs to be taken.\"Media caption, '25% year-on-year increase' - Can football clubs stop online abuse?Threats and homophobia in WSLControversy during Chelsea's 1-1 draw at Arsenal on 8 November sparked the vast majority of the 97 verified abusive messages posted about WSL matches.More than half targeted Chelsea boss Bompastor, including a threat of violence and a homophobic slur.\"People think they can say anything they want from behind a screen,\" Bompastor said. \"It's scary - I want to raise my voice against that.\"I have a family, including kids. They don't want to see those comments online. They are so young, and people need to realise the effect it can have on them too.\"Threats are a big problem, because the security in the women's game isn't the same as the men's game.\"Abuse can cause real mental problems for players. It can go really far.\"Ex-Chelsea and current England defender Jess Carter was the subject of prominent racist abuse online during Euro 2025, and Bompastor believes the platforms themselves bear plenty of blame.\"The social media companies are not doing their job, not taking the responsibility or accountability,\" Bompastor said.\"If we have to wait for them to act, I think we will be in this situation for too long.\"I'm hoping now that all clubs in the women's and men's games are proactive and protect people as much as possible.\"How are clubs combatting abuse?As frustration with social media companies grows, more clubs are taking matters into their own hands. Arsenal have worked with Signify for the past three years and have seen a 90% drop in the number of affiliated fans sending abuse to their own players, coach and owners. Signify attributes this to the fact that Arsenal have been actively taking action, including implementing education programmes and banning fans from the Emirates who have been identified as senders of abuse.Chelsea women are now also working with the same company.Tottenham, meanwhile, are conducting investigations into season-ticket holders alleged to have posted abusive content.Premier League director of content protection Tim Cooper said: \"We're constantly monitoring around matches where the abuse can happen and looking for trigger instances such as a goal being scored, missed penalties, or even things like yellow and red cards.\"The platforms can do more by changing their algorithms. That would be a step in the right direction.\"The League has a dedicated team that works hard to identify, compile evidence against, and help prosecute perpetrators of such abuse, with more than 4,000 cases of online discriminatory abuse investigated since 2020.\"If you have been affected by any of the issues raised in this story you can visit BBC Action Line.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Football abuse: Premier League and WSL stars targeted by death and rape threats",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97fc/live/5b3b6380-cfbe-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-03T06:22:31.000Z",
      "dateModified": "2025-12-03T06:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Jury’s (Kind Of) Out - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0ml4rh7?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-02T19:52:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·02 Dec 2025,·38 minsAvailable for over a yearToday, David Lammy has confirmed plans to get rid of jury trials for crimes with sentences of less than three years.\nThe reforms to the justice system include creating \"swift courts\" under the government's plan to tackle unprecedented delays in the court system. Serious offences including murder, robbery and rape will still go before a jury. Lammy has said the reforms were “bold” but “necessary”. Adam is joined by home and legal correspondent Dominic Casciani.\nAnd, amidst all the noise around last week’s budget you may have missed the Prime Ministers suggestion that he will accept all the recomendations made in a report that criticised the UK’s nuclear power industry as expensive and “overly complex”. \nThe man who wrote it, John Fingleton tells Adam about what he found and what he thinks it tells us about the UK’s approach to regulation. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Anna Harris and Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Ricardo McCarthy. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Jury’s (Kind Of) Out - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-02T19:52:00.000Z",
      "dateModified": "2025-12-02T19:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mkwyjd?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-01T19:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·01 Dec 2025,·30 minsAmericanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast?AmericastAvailable for over a yearDonald Trump has warned that US efforts to halt Venezuelan drug trafficking \"by land\" would begin \"very soon\". But what’s actually happening off the coast of Venezuela, and why is Trump calling for Venezuela’s airspace to be closed? \nAnd, the president said he would \"permanently pause migration\" to the US from all \"third-world countries\" after an attack on National Guard members last week. Could this heighten immigration tensions in the US? \nPlus, as we return from Thanksgiving break - the busiest travel day in the US calendar - why is Transportation Secretary Sean Duffy launching a campaign to bring ‘civility and manners’ back to plane travel in the US? \nMatt Chorley, Justin, Sarah and Anthony are back to answer your questions on BBC Radio 5 Live…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray with Alix Pickles and Grace Reeve. The technical producer was Dafydd Evans. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers… On 5 Live! Why has the US been accused of war crimes off the Venezuelan coast? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-01T19:12:00.000Z",
      "dateModified": "2025-12-01T19:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nursery worker Vincent Chan admits sexually assaulting children",
    "url": "https://www.bbc.com/news/articles/c2k4qd8q97eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b93e/live/b851e450-d049-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-03T15:53:25.000Z",
    "description": "26 minutes agoDaniel SandfordUK correspondentMetropolitan PoliceVincent Chan first came to attention for filming the children in his careA nursery wor",
    "body": "26 minutes agoDaniel SandfordUK correspondentMetropolitan PoliceVincent Chan first came to attention for filming the children in his careA nursery worker has admitted sexually abusing young children in his care in north London.Vincent Chan, 45, appeared at Wood Green Crown Court where he pleaded guilty to 26 charges including sexual assault by penetration, sexual assault by touching and making indecent images depicting the most severe category of child sex abuse.The investigation into Chan followed a tip-off from a whistleblower and became one of the most \"harrowing and complex\" cases undertaken by the Metropolitan Police, the force said.Chan, of Stanhope Avenue in Finchley, will be sentenced on 23 January.Warning: This article contains distressing detailsJudge David Aaronberg KC told the defendant: \"Mr Chan, you have pleaded guilty to matters which are going to result in a custodial sentence of many years.\"Chan first came to attention for filming children at Bright Horizons nursery,  Finchley Road, West Hampstead. The nursery branch has since closed.When police started to investigate, they found what detectives called \"deeply disturbing material\" on Chan's devices and iPads seized from the nursery.They later found the video evidence of sexual abuse of children at the nursery, some of which had been filmed on nursery iPads.Julia QuenzlerChan was warned by the judge to expect a custodial sentence \"of many years\"Det Supt Lewis Basford, who led the Met Police's investigation, said the offences had caused \"deep shock and distress\".Chan had been advance vetted by the Disclosure and Barring Service, having previously worked as a karate club instructor and in a school.Chan, who was born and raised in the UK and is of Chinese heritage, took on a number of roles at the nursery including art specialist, room leader and nursery nurse. He was entrusted with the care of children aged between two and four.Moment Vincent Chan arrested by Met Police officersFamily members of many of the victims sat in the dock as charges were read out, many of them in tears.Following Chan's guilty pleas, the victims' parents made a joint statement through their solicitor.\"As parents we are still trying to process the sickening discovery that our children were subjected to despicable abuse... We feel that Bright Horizons has failed us, and we want answers.\"How was someone like Vincent Chan employed? And how were such horrific crimes against children able to continue for so long without the staff responsible for safeguarding at Bright Horizons nursery acting?\"We are concerned that failures in management and supervision at Bright Horizons allowed this abuse to go undetected, and we are committed to securing accountability for our children.\"A spokesperson for Bright Horizons said: \"We are shocked and appalled by this individual's horrific crimes. Our thoughts are first and foremost with the children and families affected, and we are committed to offering support to them during this incredibly difficult time.\"Watch: Victims' parents want answers from nursery, says solicitorHelen Reddy, prosecutor for the Crown Prosecution Service, said Chan's actions were \"a heinous breach of trust\" by someone working in a caring profession in what should have been a safe place for children.She added: \"The evidence against him was compelling and the nature and number of offences the CPS charged him with reflects the seriousness of his offending.\"If you have been affected by this story or would like support then you can find organisations which offer help and information at the BBC Action Line Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nursery worker Vincent Chan admits sexually assaulting children",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b93e/live/b851e450-d049-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-03T15:53:25.000Z",
      "dateModified": "2025-12-03T15:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federica Mogherini: Former EU top diplomat accused in fraud investigation",
    "url": "https://www.bbc.com/news/articles/c2lvzrve5lqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3510/live/dc90d820-cf87-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-03T12:00:42.000Z",
    "description": "The EU's former foreign policy chief, Federica Mogherini, has been accused of fraud as part of an EU investigation into the misuse of funds, the Europ",
    "body": "The EU's former foreign policy chief, Federica Mogherini, has been accused of fraud as part of an EU investigation into the misuse of funds, the European Public Prosecutor's Office (EPPO) has said.The EPPO said searches were carried out on Tuesday at the College of Europe in Bruges, Belgium, headed by Ms Mogherini, as well as the European External Action Service (EEAS) in Brussels - the office she ran for five years as the bloc's top diplomat.The investigation relates to EU-funded training for junior diplomats, the EPPO said. As well as Ms Mogherini, a senior College of Europe staff member and a senior official from the European Commission were detained, the prosecutor's office added.According to the EPPO, the three were formally told of the allegations against them: \"the accusations concern procurement fraud and corruption, conflict of interest and violation of professional secrecy.\"They were all subsequently released as they were not considered a flight risk and their homes were also searched.Under Belgian law, a person can be arrested then released without being charged, while remaining a suspect.The EPPO said the investigation focused on a tender that the EEAS awarded to the College of Europe in 2021-2022. It added that there were \"strong suspicions\" of favouritism related to the tender for  a nine-month training course for junior diplomats.The EPPO, which investigates alleged crimes against the financial interests of the EU, has not released the names of the individuals held, but said the immunity of several suspects had been lifted as part of this investigation.The College of Europe is an independent school attended by aspiring EU civil servants. It is closely associated with and partly funded by the EU. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federica Mogherini: Former EU top diplomat accused in fraud investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3510/live/dc90d820-cf87-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-03T12:00:42.000Z",
      "dateModified": "2025-12-03T12:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thailand relaxes afternoon alcohol ban to boost tourism",
    "url": "https://www.bbc.com/news/articles/c0mprzzxn73o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8df/live/a6ed0f10-d020-11f0-a0e2-816fae62ea61.jpg",
    "tag": "Trending",
    "date": "2025-12-03T10:55:44.000Z",
    "description": "Thailand has temporarily lifted a decades-old ban on the sale of alcoholic drinks in the afternoons as it seeks to boost tourism.Liquor stores, restau",
    "body": "Thailand has temporarily lifted a decades-old ban on the sale of alcoholic drinks in the afternoons as it seeks to boost tourism.Liquor stores, restaurants and other accredited establishments can now sell beer, wine and spirits from 14:00 to 17:00 as part of a six-month trial. The ban, which came into force in 1972, was primarily introduced to stop government employees from drinking during work hours. But it has long vexed visitors to the predominantly Buddhist country - which is also known for its vibrant party scene. The move comes just days ahead of Christmas and the New Year holiday, both peak seasons for tourist arrivals.Alcohol sales in the country are now allowed from 11:00 to midnight for the next 180 days while a committee studies its impact. Previously, those who flouted the ban faced a fine of up to 10,000 baht (£235; $313). Thai Prime Minister Anutin Charnvirakul, who took office in September, has promised to win back tourists as part of efforts to jumpstart the economy that has been held back by years of political turmoil.\"In the past, there were concerns that government employees would sneak out to drink, but it's a different time now,\" Deputy Prime Minister Sophon Saram told reporters last month, according to AFP news agency.Thailand has some of the highest alcohol consumption rates in Asia, according to the World Health Organisation and local brews like Chang and Singha are very popular.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thailand relaxes afternoon alcohol ban to boost tourism",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8df/live/a6ed0f10-d020-11f0-a0e2-816fae62ea61.jpg"
      ],
      "datePublished": "2025-12-03T10:55:44.000Z",
      "dateModified": "2025-12-03T10:55:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nike, Superdry and Lacoste ads banned over green claims",
    "url": "https://www.bbc.com/news/articles/ckgm79djr9yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/22e9/live/170df7b0-d039-11f0-85ee-1313d6fdfda6.jpg",
    "tag": "Trending",
    "date": "2025-12-03T11:50:00.000Z",
    "description": "4 hours agoArchie MitchellBusiness reporterReutersAdverts for Nike, Superdry and Lacoste have been banned for making misleading claims about their gre",
    "body": "4 hours agoArchie MitchellBusiness reporterReutersAdverts for Nike, Superdry and Lacoste have been banned for making misleading claims about their green credentials.The UK's advertising watchdog challenged the brands over the use of the word \"sustainable\" in paid-for Google ads which were not backed up by evidence of their sustainability.The Advertising Standards Authority (ASA) identified three adverts from the retailers promising customers \"sustainable materials\", \"sustainable style\" and \"sustainable clothing\".The UK's advertising code states that the basis of claims about environmental sustainability must be clear and \"supported by a high level of substantiation\".In each case, it asked the companies for evidence to back up the claims about the sustainability of the products.Nike said its advert, promoting tennis polo shirts with the tagline \"serve and ace with Nike… sustainable materials\", was framed \"in general terms\" and highlighted the wider sustainability of its products.The trainer giant said its claim about \"sustainable materials\" was intended to highlight that other products available on its site incorporated recycled materials.But the ASA ruled Nike had failed to include qualifying details and had not explained the basis of its claim about the \"sustainability\" of its products.Superdry's advert promoted a \"wardrobe that combines style and sustainability\", which it argued customers would understand to mean its clothes were either stylish, sustainable or both.The retailer argued it did not suggest all Superdry products were sustainable.But the ASA said its green claims were \"ambiguous and unclear\" and would lead customers to believe all Superdry products were sustainable.\"Superdry had not provided evidence to demonstrate that their products had no detrimental effect on the environment,\" its ruling said.Lacoste's advert promoted its kids' range as \"sustainable clothing\" and told the ASA it had worked for years to reduce the carbon footprint of its products.But the watchdog said that while there had been a reduction in the environmental impact of the products in its kids' range, it had not offered evidence that its clothing would have \"no detrimental effect on the environment\".In each case, the adverts were banned and the companies were warned future promotions must contain \"a high level of substantiation\" for any sustainability claims.The three rulings form part of a wider crackdown by the ASA on brands making misleading green claims in adverts. It has been using artificial intelligence (AI) to identify adverts which potentially fall foul of its rules.A Nike spokesperson said: \"We have engaged with the UK Advertising Standards Authority on this matter and have taken the necessary required actions. We remain committed to providing consumers with clear information to help them make the choices that are right for them.\"Superdry and Lacoste were asked to comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nike, Superdry and Lacoste ads banned over green claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/22e9/live/170df7b0-d039-11f0-85ee-1313d6fdfda6.jpg"
      ],
      "datePublished": "2025-12-03T11:50:00.000Z",
      "dateModified": "2025-12-03T11:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What latest Ukraine talks reveal about Putin's state of mind",
    "url": "https://www.bbc.com/news/articles/cpq4e21nr5vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d97a/live/6fee7290-d059-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-03T15:40:06.000Z",
    "description": "40 minutes agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood",
    "body": "40 minutes agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood and intentions?For starters, that he's not ready to sign a peace deal. At least, not right now.And certainly not the deal (or deals) on the table.\"No compromise version has yet been found,\" commented Kremlin foreign policy aide Yuri Ushakov after five hours of talks in Moscow involving Putin, US envoy Steve Witkoff, and Donald Trump's adviser and son-in-law Jared Kushner.No compromise is no real surprise, considering the Kremlin leader's uncompromising comments in recent days. In various statements he has condemned the Ukrainian leadership as a \"thieving junta\", accused European leaders of trying to sabotage peace efforts, and insisted that Russia holds the initiative on the battlefield.On a couple of recent occasions Russian TV showed Putin in military fatigues, studying maps of the front line and trumpeting military gains, many of which Ukraine and international observers have denied.After nearly four years of Russia's full-scale invasion of Ukraine, despite the heavy losses Russia has suffered on the battlefield and the damage to the Russian economy, President Putin seems convinced that he is winning this war and that now is not the moment to stop.At least, that is what he would like the West to believe: that nothing can stop him now from achieving his goals.I've said before that, in many ways, Vladimir Putin reminds me of a car with no brakes, no steering wheel and no reverse gear; a vehicle careering full speed down the motorway.Nearly four years after the full-scale invasion of Ukraine there is still no sign of the \"Putinmobile\" turning off, turning back, or coming to a halt.He certainly wants his opponents to think that nothing or no one can force him to change direction: neither European leaders, nor the Trump administration, nor President Zelensky.But cars need fuel (a constant supply).And, to fight a war, countries need money (a constant supply).For now, despite international sanctions, Russia's government is still able to finance the \"special military operation\" - its war on Ukraine. But economic pressures are building: revenues from oil and gas have been falling, the budget deficit growing.Even Putin admits there are problems, referring to \"imbalances\" in the economy.\"In several sectors, production output not only failed to increase this year but actually decreased,\" Putin said this week. \"Are we satisfied with such trends? No.\"The big unknown: at what point, if at all, will economic concerns start to influence the Kremlin's calculations on the battlefield?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What latest Ukraine talks reveal about Putin's state of mind",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d97a/live/6fee7290-d059-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-03T15:40:06.000Z",
      "dateModified": "2025-12-03T15:40:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "December full Cold Moon: When and where to spot the last supermoon of 2025",
    "url": "https://www.bbc.com/weather/articles/ce8qelngjlro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/3465/live/b7cadf30-d037-11f0-9dde-e37e6f7cdd14.jpg",
    "tag": "Trending",
    "date": "2025-12-03T08:45:41.000Z",
    "description": "How to see Thursday's full Cold Moon, the last supermoon of 2025Image source, PA / James ManningByElizabeth RizziniLead Weather Presenter The full Col",
    "body": "How to see Thursday's full Cold Moon, the last supermoon of 2025Image source, PA / James ManningByElizabeth RizziniLead Weather Presenter The full Cold Moon  will be visible on Thursday 4 December.It is another supermoon, the third of 2025 and the last.Supermoons are not that rare, there are usually three or four a year, but it is unusual to have three of them in a row - four if you count the first full Moon of 2026 too.They occur when the Moon is \"in perigee\". That's to say the full Moon coincides with it being at its closest point to Earth in its orbit, appearing larger and brighter in the night sky. A full Moon happens when the Sun and Moon are on opposite sides of Earth - in alignment, known as 'syzygy' - so the whole side that is facing us is illuminated.When will the Cold Moon rise?The full Moon will rise in the north-eastern skies on the afternoon of the December 4 at 14:52GMT in London, 14:29 in Edinburgh, 14:52 in Belfast and 15:05 in Cardiff. It will then set again between 08:00 and 09:00 the following morning so there will be plenty of hours of darkness to view it. Check the Sunrise and Sunset times where you are.As the Moon rises it will form a triangle  with the Pleiades star cluster and the bright star Aldebaran.Jupiter will appear in the night sky close to the Moon, as well as the winter constellation of Orion the Hunter.Image source, PA / Danny LawsonImage caption, The  super Cold Moon rises above Whitby Abbey in December 2017Will the skies be clear?A band of cloud and rain is expected to move eastwards across the UK on Thursday and this may linger into the evening across northern and eastern Scotland and eastern England. As it moves away, clear skies are set to develop in many areas overnight, however widespread mist and fog could form, reducing visibility in some locations. It will be a fairly cold night with temperatures dropping close to freezing and a touch of frost in places.Check the full forecast for your local area here.Media caption, See a supermoon and a meteor shower - in one nightWhy is it called a Cold Moon?Each full Moon in a year has a name - a practice that dates back to ancient traditions centuries before the Gregorian calendar existed.Full Moons were historically named as a way of keeping track of the change of seasons and often influenced the timing of activities like hunting, harvesting and planting, where the bright moonlight could come in handy.December's full Moon is known as the Cold Moon and marks the start of winter as it occurs near the solstice. It has also been known as the Long Night Moon and the Moon before Yule.The next full Moon, on Saturday 3 January 2026 is the Wolf Moon and this will be  yet another supermoon.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "December full Cold Moon: When and where to spot the last supermoon of 2025",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/3465/live/b7cadf30-d037-11f0-9dde-e37e6f7cdd14.jpg"
      ],
      "datePublished": "2025-12-03T08:45:41.000Z",
      "dateModified": "2025-12-03T08:45:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drunk raccoon found passed out on liquor store floor after breaking in",
    "url": "https://www.bbc.com/news/articles/cy8jnxxm70jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0811/live/fda48f70-d040-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-03T12:24:01.000Z",
    "description": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find the store had been broken into by a very intoxicated raccoon",
    "body": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find the store had been broken into by a very intoxicated raccoon.The \"masked bandit\" was found passed out in the bathroom between the toilet and bin having helped itself to some bottom shelf spirits.Animal control officer Samantha Martin transported the \"suspect\" for questioning at Hanover County Animal Protection and Shelter but not before it had a chance to sober up.After a few hours of sleep and zero signs of injury (other than maybe a hangover), the animal was safely released back into the wild.The Ashland ABC store had been closed for Thanksgiving when it suffered its \"Black Friday break-in\".When staff arrived on Saturday they found smashed bottles and liquor pooling on the floor, including its apparent tipple of choice, scotch. Officer Martin said the animal had fallen through one of the ceiling tiles before going \"on a full-blown rampage, drinking everything\". Only one blurry CCTV image of the boozy break-in exists, so it's unknown just how much alcohol the thirsty creature consumed before passing out in the bathroom.In a social media post, the store thanked Hanover County Animal Protection and Shelter for its professionalism and providing its visitor with a \"sober ride home\".Officer Martin said it was \"just another day in the life of an animal control officer\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drunk raccoon found passed out on liquor store floor after breaking in",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0811/live/fda48f70-d040-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-03T12:24:01.000Z",
      "dateModified": "2025-12-03T12:24:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King Charles welcomes German president on first state visit in 27 years",
    "url": "https://www.bbc.com/news/articles/c9d9jwvqyx8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d889/live/56b18470-d054-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-03T16:06:33.000Z",
    "description": "14 minutes agoSean CoughlanRoyal correspondent, WindsorWatch: Royals welcome German president on first UK state visitKing Charles, Queen Camilla and t",
    "body": "14 minutes agoSean CoughlanRoyal correspondent, WindsorWatch: Royals welcome German president on first UK state visitKing Charles, Queen Camilla and the Prince and Princess of Wales have welcomed the German president to the UK for a state visit.President Frank-Walter Steinmeier and his wife Elke Budenbender were given a ceremonial royal reception in Windsor, with marching bands and a carriage ride to the castle.They might not have been expecting the bright winter sunshine, as the president brought a gift of an umbrella to the King, on what was the first German state visit to the UK in 27 years. Such state visits are about projecting soft power and building relationships, and the three-day visit will see a mix of pageantry, politics and cultural ties.ReutersPresident Steinmeier and King Charles swapped symbolic giftsGerman flags were flying along Windsor High Street for the carriage procession, with the King and President Steinmeier travelling together.Prince William and Catherine were part of the welcoming party, with Catherine wearing earrings that once belonged to Diana, Princess of Wales.There was an exchange of official gifts, with the German visitors, maybe attempting to show that they do have a sense of humour, by giving the King an umbrella.There was also a copy of Bach's Christmas Oratorio, Christmas tree ornaments, a nutcracker and some special cheese from a German eco-village.For President Steinmeier, the King gave a horn-handled walking stick made by craftsman from the Isle of Mull, a decorative plate and a first edition of Virginia Woolf's biography of the Victorian poet Elizabeth Barrett Browning's dog, called Flush.ReutersSteinmeier and Ms Budenbender visited the Royal Collection exhibition in Windsor Castle alongside the King and Queen The German visitors were given a formal welcoming ceremony, watching a military parade on the manicured lawns inside Windsor Castle.Anti-monarchy campaign group Republic said they were prevented by the police from holding a protest and displaying a banner on the route by the procession, saying it was a \"disgraceful attack on free speech\".In response, Thames Valley Police said they had \"facilitated a peaceful protest\" and officers had \"asked them to step back to our designated protest area\" and had stopped them using a loudhailer when horses were nearby.\"Everyone has a right to protest, but if these demonstrations become disruptive or a threat to the public or animals in the procession, we will take appropriate action,\" said the police, who added no arrests had been made.PA MediaWilliam and Catherine also attended the welcome at Windsor CastleState visits are planned by the Foreign Office to cultivate diplomatic relations with important partners.After a morning of royal hospitality, President Steinmeier went to meet Prime Minister Sir Keir Starmer in Downing Street.And this visit is intended to reinforce the Kensington Treaty, signed between the UK and Germany in July, which emphasised military and business co-operation and closer links between the countries, including plans for a direct rail link.The UK government is also hoping for more help from Germany in stopping illegal migration. The National Crime Agency has previously said equipment used to cross the Channel has been stored in Germany.PA MediaThe Household Cavalry pictured in Windsor ahead of the president's arrivalThis evening speeches will be made at the state banquet in St George's Hall, inside Windsor Castle, with guests to include celebrities alongside the royals and politicians.It's likely that some of the King's speech will be delivered in German.When he visited Germany in 2023, King Charles spoke about the need to support Ukraine and there will be attention paid to what he might say about the war, and ongoing negotiations to end it.The previous state visit was US President Trump, who travelled in and out of Windsor by helicopter, increasing his security and avoiding protestors, rather than taking part in a public carriage ride.ReutersCatherine and William had greeted the pair at Heathrow Airport earlier in the dayWith Christmas approaching there have been references to the German roots of some Christmas traditions, including popularising the Christmas tree by Queen Victoria's husband Albert.The visitors were shown items from the Royal Collection include Victoria's diary from 1845 when she recorded a trip to Albert's birthplace, Schloss Rosenau in Coburg.\"I remember going to this years ago,\" said King Charles.There will be symbolic signs of reconciliation, including a visit by the German president to the ruins of Coventry Cathedral, bombed during World War II.This mirrors a visit to Hamburg during the UK state visit to Germany, when King Charles laid a wreath remembering the civilian casualties of wartime Allied bombing raids.Oxford University will award an honorary degree to President Steinmeier, and on a trip to the city he will see medical technology developed by a Germany company, Siemens Healthineers.Ms Budenbender will visit the Judith Kerr Primary School, in south-east London, to mark the connection to its namesake, Judith Kerr, the German-born author of the children's book The Tiger Who Came to Tea.The German president will go to the Queen Elizabeth Olympic Park to meet German footballers who play in the English Premier League.And at the V&A East Storehouse the visitors will see the David Bowie Centre, which contains items related to the pop star, such as stage outfits and musical instruments.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King Charles welcomes German president on first state visit in 27 years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d889/live/56b18470-d054-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-03T16:06:33.000Z",
      "dateModified": "2025-12-03T16:06:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Children hurt as roof of school bus ripped off by Coppull bridge",
    "url": "https://www.bbc.com/news/articles/cp34nyenqpko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0887/live/9ca9c090-d05a-11f0-a144-735ebdbaffa7.jpg",
    "tag": "Trending",
    "date": "2025-12-03T15:32:02.000Z",
    "description": "Several children have been hurt after the roof of a school double-decker bus was ripped off when it hit a low bridge.Among the injured was an eight-ye",
    "body": "Several children have been hurt after the roof of a school double-decker bus was ripped off when it hit a low bridge.Among the injured was an eight-year-old boy who was taken to hospital with a \"non-serious\" head injury following the crash on Spendmore Lane, Coppull, Lancashire, at about 12:30 GMT. The bus was carrying some pupils from Wood Fold Primary School, in Standish, Wigan, the BBC understands. The school declined to comment.Paramedics assessed the children at the scene and all but the eight-year-old boy were discharged from their care, North West Ambulance Service said. Emergency services remain at the scene and a road closure is in place.\"A number of children suffered injuries, which are thankfully thought to be relatively minor at this time,\" Lancashire Police said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Children hurt as roof of school bus ripped off by Coppull bridge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0887/live/9ca9c090-d05a-11f0-a144-735ebdbaffa7.jpg"
      ],
      "datePublished": "2025-12-03T15:32:02.000Z",
      "dateModified": "2025-12-03T15:32:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]