[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Flu Different This Winter? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mn1242?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-11T19:02:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·11 Dec 2025,·39 minsAvailable for over a yearToday, the number of people in hospital with the flu has risen by more than half this week.\nDoctors say an earlier start to the flu season plus an unexpected mutation in this years primary strain has led to a lower rate of immunity amongst the general public for this time of year. \nBBC health editor Hugh Pym and Doctor Jamie Lopez Bernal, consultant epidemiologist from the UK Health Security Agency breakdown the data.\nPlus, US forces have seized an oil tanker off the coast of Venezuela in an escalation of the US government’s pressure campaign against Venezuelan president Nicolás Maduro. \nThe news came as Venezuelan opposition leader María Corina Machado collected her Nobel Peace Prize in Norway, appearing despite a travel ban and a threat from the Venezuelan government that she would be labelled as a fugitive\nBBC News presenter, Lucy Hockings and Latin America editor for BBC Online Vanessa Buschschlüter explain the situation in Venezuela and the story behind Miss Machado’s journey to Oslo. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Adam Chowdhury. The social producers were Sophie Millward and Beth Pritchard. The technical producer was Philip Bull. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Flu Different This Winter? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-11T19:02:00.000Z",
      "dateModified": "2025-12-11T19:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - How far will Trump go in his “war” with Venezuela? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8byv?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-11T20:24:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·12 Dec 2025,·36 minsHow far will Trump go in his “war” with Venezuela?AmericastAvailable for over a yearWhat’s going on between the United States and Venezuela? The Trump administration has been defending its seizure of an oil tanker off the Venezuelan coast.  In a dramatic video shared by the US Attorney General, armed camouflaged soldiers are shown swinging down ropes from low flying helicopters, and running along the vessel’s decks. \nThe US claims the tanker is used to transport sanctioned oil from Venezuela and Iran in an \"illicit oil shipping network supporting foreign terrorist organisations\".  The Venezuela government in response has called the seizure blatant theft, claiming Trump is after the country’s rich oil and energy resources. \nIn this episode, Sarah and Justin unpack how far Donald Trump is willing to go in his ongoing campaign against the Venezuelan leader Nicolas Maduro.   In recent months, the US president has accused Maduro of “forcing” criminals into the US and facilitating drug smuggling, which Maduro denies.  And this week, Defence Secretary Pete Hegseth has defended the killing of over 80 people in US military strikes on alleged drug boats as the “Al Qaeda of our hemisphere”.  \nThe Americast team also look at how this fits in with other South American countries, with Trump recently offering Honduran ex-president Juan Orlando Hernández a ‘full and complete pardon’.   \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by George Dabby with Alix Pickles and Grace Reeve. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - How far will Trump go in his “war” with Venezuela? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-11T20:24:00.000Z",
      "dateModified": "2025-12-11T20:24:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will it be a white Christmas in the UK this year?",
    "url": "https://www.bbc.com/weather/articles/c2eppz0m9dpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/4370/live/0bf4d550-d747-11f0-9553-fb7d4b4955e6.jpg",
    "tag": "Trending",
    "date": "2025-12-12T15:59:21.000Z",
    "description": "Festive forecast: Will we see a white Christmas this year?Image source, Getty ImagesBySarah Keith-LucasLead Weather Presenter As the mild December con",
    "body": "Festive forecast: Will we see a white Christmas this year?Image source, Getty ImagesBySarah Keith-LucasLead Weather Presenter As the mild December continues, are our hopes of a white Christmas melting away?It's still a little too early to confirm the details of the forecast for Christmas 2025, but there are some signs we may see the weather turning a little cooler and calmer.Since the turn of the century, more than half of all Christmas Days in the UK have seen snow falling somewhere.But at this early stage what do we actually know about the chances of this Christmas being \"white\"?What is in the Christmas forecast?Forecasters look at data produced by several different weather supercomputers generated over different timescales.Not all computer models are in agreement about how the finer details of the Christmas forecast will look, but there are some themes now emerging.The first half of December has been mild and wet, dominated by rain-bearing Atlantic low pressure systems. This general set-up is expected to continue for the next week or so, but there is a chance of higher pressure building into late December, which would bring a drier spell compared to recent conditions. Whilst temperatures are likely to drop a little, returning to more typical for the time of year, there is no especially cold weather expected at this stage. Overnight frost and fog could well become more of an issue over the Christmas period. Wintry showers cannot be ruled out, especially over high ground in the north, but there are currently no indications of widespread snow.Forecasting snow in the UK is notoriously difficult, and it is still too early to know for certain whether we will see a white Christmas in 2025. The festive forecast will become much clearer about five days before Christmas, so keep an eye on the BBC Weather app or website for the latest updates. Image caption, Lying snow looks beautifully festive but a Christmas is only officially 'white' if snow is recorded falling from the skyWhat makes a Christmas officially 'white'?Christmas cards often depict snow that is \"deep and crisp and even\", but often a \"white Christmas\" will be much less wintry in reality.In fact, just a single snowflake has to be recorded falling at any point during the 24 hours of 25 December at any of the Met Office's network of around 300 observing stations. Snow already lying on the ground on Christmas Day may make things look merry and bright, but it does not count under the official definition.Will it be a White Christmas?Join BBC Weather’s Carol Kirkwood, Matt Taylor and Barra Best, along with famous faces Jeremy Vine and Lucy Porter, to explore where our fascination with a white Christmas comes from.What are the 'white Christmas' odds?Since 2020, every year except 2024 has officially been a white Christmas. However, in each of these years very few places reported any snow actually settling on the ground.The last time the UK saw a widespread white Christmas was back in 2010, when snow fell at 19% of weather stations and, very unusually, 83% of stations reported snow lying on the ground.Whilst snow is more common between January to March than in December, odds are still pretty high that somewhere in the UK will see snow on 25 December. However, as our climate warms, winters in the UK are becoming milder and wetter. Whilst the Met Office says, \"This generally reduces the chances of a white Christmas,\" it also recognises that, \"The natural variability of the weather will not stop cold, snowy winters happening in the future\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will it be a white Christmas in the UK this year?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/4370/live/0bf4d550-d747-11f0-9553-fb7d4b4955e6.jpg"
      ],
      "datePublished": "2025-12-12T15:59:21.000Z",
      "dateModified": "2025-12-12T15:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Author Joanna Trollope dies aged 82",
    "url": "https://www.bbc.com/news/articles/cq6008er5zgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7c99/live/2fac3d00-d75e-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-12T12:42:46.000Z",
    "description": "12 hours agoSteven McIntoshEntertainment reporterGetty ImagesBest-selling author Joanna Trollope has died aged 82, her family has announced.The writer",
    "body": "12 hours agoSteven McIntoshEntertainment reporterGetty ImagesBest-selling author Joanna Trollope has died aged 82, her family has announced.The writer was known as the \"queen of the Aga saga\" because her novels often focused on romance and intrigue in middle England, although she rejected the tag as \"patronising\".In a statement, her daughters Louise and Antonia said their \"beloved and inspirational mother\" had died \"peacefully at her Oxfordshire home\" on Thursday.Trollope's novels include The Rector's Wife, Marrying The Mistress, Second Honeymoon and Daughters in Law.Trollope's literary agent James Gill said in a statement: It is with great sadness that we learn of the passing of Joanna Trollope, one of our most cherished, acclaimed and widely enjoyed novelists. \"Joanna will be mourned by her children, grandchildren, family, her countless friends and - of course - her readers.\"Trollope's books have been translated into more than 25 languages, and several have been adapted for television.Joanna Prior, CEO of publisher Pan Macmillan, described Trollope as a \"treasured author\" who was \"much admired for her astute judgement, sharp wit, fun company and steely determination\".Getty ImagesTrollope was made a CBE in 2019 for services to literatureTrollope was a writer for more than five decades, and one of the best known novelists in the UK.She authored more than 20 contemporary novels including 2013's Sense & Sensibility, the lead title in HarperCollins's Austen Project.The author also wrote 10 historical novels, which were published under the pseudonym Caroline Harvey. Trollope occasionally wrote short stories and pieces for magazines, chaired book prizes, authored a 2006 study of women in the British Empire called Britannia's Daughters, and edited a 1993 anthology of rural life called The Country Habit.She received an OBE in 1996 for services to charity, and was made a CBE in 2019 for services to literature. Trollope was born in Gloucestershire, a fifth-generation niece of the English novelist Anthony Trollope.\"I'm not a direct descendant of his, although I'm from the same family, but another branch of it,\" she once told the Independent. \"I admire him hugely, and take several things he said about writing very much to heart.\"She read English at Oxford University and worked in the Foreign Office and as a teacher before becoming a full-time author in 1980.Her early novels were all written under her pseudonym until the release of her first contemporary novel, the Choir, in 1987. Several of her later novels were adapted for the screen, including A Village Affair, The Choir, Other People's Children and The Rector's Wife. She told the Writers Write website that she preferred to use pen and paper to write her novels. \"I love the silence and intimacy and simplicity. I can also, when it's going really well, write like the wind - 1,000 words an hour,\" she said.But the process of writing was \"extremely hard\".\"But then, I think anything worthwhile is inevitably going to be hard,\" she added. \"The most exciting moment for me is the penultimate chapter - the end is in sight, and clear, but the activity of the race isn't quite yet over.\"PA MediaTrollope pictured meeting Queen Elizabeth II in 2001The description of her books as \"Aga sagas\" caught on, despite only two of Trollope's novels actually featuring an Aga.She later admitted she was \"fairly tired of such an inaccurate and patronising tag\", describing it as a \"very unfortunate phrase\" that had \"done me a lot of damage\".The \"Aga saga\" tag is thought to have come from novelist Terence Blacker, but Trollope said: \"People who are rude about them don't take into account the amount of research I do, which is swotty and immense.\"The name itself indicates a provincial cosiness, and is patronising of the readers. A lot of what I write into the books is bleak and challenging but I will be the Queen of the Aga saga to my dying day. It's jolly annoying, but it is better than being the Queen of Hearts.\"Trollope's work tackled a range of topics from affairs, blended families and adoption, to parenting and marital breakdown.She also often wrote about remarriage, parenthood and the strains on the so-called \"sandwich generation\", caring for both their children and their parents.In The Soldier's Wife, she portrayed families struggling to cope with the aftermath of a harrowing Afghanistan tour.Fellow novelist Fay Weldon once said Trollope had \"a gift for putting her finger on the problem of the times\".Trollope said it was \"a great honour and an even bigger challenge\" to rework Austen's Sense & Sensibility in 2013.But she had previously said that comparisons of her own work with Austen's \"make me fidget\".\"There is a huge gulf between being great and being good. I know exactly which category I fall into and which she falls into,\" she told the Independent.\"On a good day, I might be good. I think of my writing as contemporary accessible fiction and it really isn't for me to add the qualifying adjectives.\"In a 1994 episode of Desert Island Discs, she again addressed criticisms that her books were trivial, responding: \"It is a grave mistake to think there is more significance in great things than in little things.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Author Joanna Trollope dies aged 82",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7c99/live/2fac3d00-d75e-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-12T12:42:46.000Z",
      "dateModified": "2025-12-12T12:42:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Farmers call for French blockades over cow disease cull",
    "url": "https://www.bbc.com/news/articles/cm211xz0vl8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b38f/live/a3c8fba0-d787-11f0-b0ee-a9375724f730.jpg",
    "tag": "Trending",
    "date": "2025-12-12T19:20:39.000Z",
    "description": "6 hours agoHugh SchofieldParis correspondent Angry French farmers are calling for more protests over the government-backed slaughter of cattle herds a",
    "body": "6 hours agoHugh SchofieldParis correspondent Angry French farmers are calling for more protests over the government-backed slaughter of cattle herds affected by so-called Lumpy Skin Disease (LSD).On Thursday there were clashes between riot police and demonstrators in the southern Ariège department, after vets were called in to destroy potentially contaminated cattle at a farm.Elsewhere in the south, farmers have dumped manure outside government buildings and blocked roads. The offices of several environmentalist groups were ransacked in the Charente-Maritime department.LSD is a highly contagious bovine disease which is transmitted mainly by fly-bites.  The symptoms are fever, mucal discharge and nodules on the skin.Though mainly non-fatal, it can badly affect milk-production and the cows are unsaleable. The disease arrived in Europe from Africa about ten years ago. France's first outbreak was in the Alps in June, when an infected herd forced the Tour de France cycle race to cut short one of its stages.The government's policy of slaughtering entire herds where a single animal has been infected has run up against bitter opposition from two of the three main farmers' unions.Conféderation Rurale and Conféderation Paysanne say the policy is being brutally applied, and is in any case unnecessary because a combination of selective culling and vaccination would suffice.But most vets disagree. \"Right now we are unable to tell the difference between a healthy animal and a symptomless animal carrying the virus. That is the only reason we have to carry out these whole-herd slaughters,\" said Stephanie Philizot who heads the SNGTV vets' union.Since June there have been around 110 outbreaks of LSD in France, originally in the east but now increasingly in the south-west. Ministry officials blame the illegal movement of cattle from affected zones. Around 3,000 animals have been slaughtered.The French government is worried the protests could snowball into a wider movement among a farming population that feels itself under growing threat from the imposition of EU norms and competition from abroad.A big protest is planned in Brussels next week during the summit of EU leaders.  Several French farming sectors are in deep crisis, from wine-growers hit by falling consumption to poultry farmers hit by avian flu.There is also widespread opposition to the impending signature of an EU free-trade agreement with South American countries, which farmers fear will open France to more cheap food imports, much of it produced under looser environmental and sanitary constraints.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Farmers call for French blockades over cow disease cull",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b38f/live/a3c8fba0-d787-11f0-b0ee-a9375724f730.jpg"
      ],
      "datePublished": "2025-12-12T19:20:39.000Z",
      "dateModified": "2025-12-12T19:20:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No plans to force drivers to report collisions with cats, government says ",
    "url": "https://www.bbc.com/news/articles/c8988qz9p99o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d6d7/live/29d363a0-d78f-11f0-8cf3-633e3244a1d2.png",
    "tag": "Trending",
    "date": "2025-12-12T19:30:07.000Z",
    "description": "6 hours agoHelen CattPolitical correspondentThe government says it has \"no current plans\" to force drivers who run over a cat to report the collision.",
    "body": "6 hours agoHelen CattPolitical correspondentThe government says it has \"no current plans\" to force drivers who run over a cat to report the collision.Nearly 11,000 people have signed an e-petition submitted to Parliament calling for the government \"to make it law that if you hit a cat you must legally report it and take it to the nearest vets\".Cats and wild animals are not covered by the Road Traffic Act 1988, which states drivers must stop and report an accident which involves certain specified animals such as dogs, horses, cattle, mules, sheep, pigs or goats.A government statement said that prosecutions would be difficult due to the small size of cats and their tendency to be \"most active at dawn or dusk\".The government understands \"how upsetting it is when a much-loved pet is killed on our roads\", the statement read, adding the UK is \"a compassionate country\" and the lack of a legal obligation to report animals deaths and injuries should not stop drivers from trying to find the owner of pets, including cats.However, it added: \"In many cases drivers may not be aware they've hit them - particularly with larger vehicles. Because of that, it would be difficult to prosecute drivers if the law was changed.\"The statement also said the exclusion of cats was because the original law was brought in due to dogs and other animals being \"working animals\" rather than to protect domestic pets.The campaign group Cats Matter has lobbied successive governments to try to make it illegal for drivers to leave the scene of a collision with a cat in the UK.Co-founder Mandy Hobbis said the group was \"very disappointed\" with the government's response to the petition.\"We struggle to understand how we can call ourselves a compassionate country when our laws allow drivers to hit cats when driving and legally leave them on the road suffering.\"Cats are much loved family members, just like dogs are, and they deserve the right to be helped if struck by a car, just like dogs are\"She said the group had worked with the previous government on a law that introduced mandatory micro-chipping in June 2024 and was grateful for the progress made so far but urged ministers to go further.A report by  Cats Protection in 2021 found that road traffic accidents were a cause of injury for 4% of cats.The charity encourages any driver who injures a cat to take the animal to a vet for emergency treatment.\"This gives the cat their best chance of survival and means owners can be contacted and informed quickly,\" said Madison Rogers, the charity's associate director of advocacy, campaigns and external affairs.She said she would urge drivers who are involved in a road traffic collision in which a cat dies to contact their council.\"We'd also encourage local councils to scan any cats they collect so their owners can be informed, as it's heartbreaking for owners to not know the fate of a lost or missing cat,\" she added.Parliamentary e-petitions which reach 10,000 signatures receive a response from the government. They are debated in Parliament if they reach 100,000 signatures.Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No plans to force drivers to report collisions with cats, government says ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d6d7/live/29d363a0-d78f-11f0-8cf3-633e3244a1d2.png"
      ],
      "datePublished": "2025-12-12T19:30:07.000Z",
      "dateModified": "2025-12-12T19:30:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine's health supplies hit in series of Russian strikes on medical warehouses",
    "url": "https://www.bbc.com/news/articles/cqlkk9qk7vyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b415/live/794394e0-d790-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-13T00:05:21.000Z",
    "description": "57 minutes agoVitaly ShevchenkoRussia editor, BBC MonitoringWarehouses supplying the vast majority of Ukraine's pharmacies have been destroyed in a se",
    "body": "57 minutes agoVitaly ShevchenkoRussia editor, BBC MonitoringWarehouses supplying the vast majority of Ukraine's pharmacies have been destroyed in a series of Russian attacks over recent months.Medical supplies worth about $200m (£145m) were destroyed in just two strikes in December and October.A large warehouse storing medicines in the city of Dnipro was destroyed in a Russian air strike on 6 December. As a result, about $110m worth of medicines were destroyed - estimated at up to 30% of Ukraine's monthly supply.\"It was a missile and drone strike against our facility. The missiles flew past, but the drones hit it,\" said Dmytro Babenko, acting director-general of pharmaceutical distributor BADM.\"They caused a fire which unfortunately proved impossible to contain and the whole facility was destroyed.\"BADM is one of two companies that supply about 85% of Ukrainian pharmacies in roughly equal shares.The other company is Optima Pharm, whose warehouses have been hit three times this year - on 28 August, 25 October and 15 November.The October attack destroyed its main storage facility in Kyiv, and cost the company more than $100m, says Optima Pharm's chief financial officer Artem Suprun.Russia denies hitting civilian targets, but when the Optima Pharm warehouse was hit in October, the defence ministry in Moscow said only that it had targeted a factory producing drones.On the day BADM's warehouse was destroyed, Russia said it had hit \"a warehouse storing military equipment\" as well as energy and transport infrastructure.Such attacks significantly complicate the treatment of sick and wounded in Ukraine,   after almost four years of Russia's full-scale war.The International Rescue Committee (IRC), an NGO that had been using the warehouse in Dnipro, says it lost $195,000 worth of medication and supplies, which could have served 30,000 people in need.\"When I arrived at the site I was devastated, the scene was simply awful. All of this medicine could have served people for years, and in a single moment it was all lost,\" says the IRC's Andriy Moskalenko.The IRC said the Dnipro facility had served \"as a critical hub for hospitals, healthcare providers, pharmacies and humanitarian actors\".Mr Babenko from BADM said the Russian attack had destroyed \"vitally important medicines\" that had been imported and are not produced in Ukraine.\"It's a pretty complicated situation,\" he told the BBC.But he is hopeful that the attack will not leave Ukrainians without medicines.\"There won't be significant shortages, possibly only of certain types of goods. We're hoping to restore all supplies in a month or a month-and-a-half,\" Mr Babenko said.Ukrainian authorities accuse Russia of deliberately targeting hospitals, ambulances, medics and rescue workers, claims Moscow has denied. According to the government in Kyiv, more than 2,500 medical institutions have been damaged or destroyed, and more than 500 civilian doctors, nurses and other medical workers killed.Earlier this month, the World Health Organization said it had recorded 2,763 attacks on Ukraine's healthcare system since the start of Russia's full-scale invasion, and it said that in 2025 there had been a 12% increase in attacks from the previous year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine's health supplies hit in series of Russian strikes on medical warehouses",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b415/live/794394e0-d790-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-13T00:05:21.000Z",
      "dateModified": "2025-12-13T00:05:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon pulls AI recap from Fallout TV show after it made several mistakes",
    "url": "https://www.bbc.com/news/articles/c3r77j5nze5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05b5/live/8a737610-d77a-11f0-825e-eb4c8fb7e95e.jpg",
    "tag": "Trending",
    "date": "2025-12-12T18:04:47.000Z",
    "description": "7 hours agoLiv McMahonTechnology reporterAmazon has pulled a video recap made with artificial intelligence (AI) from its hit TV show Fallout after use",
    "body": "7 hours agoLiv McMahonTechnology reporterAmazon has pulled a video recap made with artificial intelligence (AI) from its hit TV show Fallout after users said it got several facts wrong about the series.The firm said in November it was testing the \"first-of-its-kind\" tool in the US to help viewers catch up on some of its shows on streaming service Prime Video - including Fallout, its adaptation of the popular video game franchise.But it has since disappeared from the site after users highlighted mistakes in its video summarising the events of Fallout season one - including claiming one scene was set more than 100 years earlier than it was.The BBC has approached Amazon for comment.The move to apparently press pause on its AI-powered recaps was first reported by tech publication The Verge.Amazon said in November the recaps would be available to users as an experimental feature, and only \"for select English-language Prime Original series in the US\".\"Video Recaps use AI to summarise a show's most pertinent plot points with a theatrical-quality video that includes narration, dialogue, and music,\" it said.But fans eagerly awaiting the release of the next series of Fallout on 17 December highlighted errors introduced in its video recap for its first series.Users on Reddit said a clip showing The Ghoul - one of the show's central characters, played by actor Walton Goggins - was wrongly described in the AI narration as a \"1950s flashback\".Despite the clip's retro aesthetic, it actually depicts a scene in 2077 - something fans of the series would know instantly.Fans also said the recap incorrectly summarised a scene between The Ghoul and protagonist Lucy MacLean, played by Ella Purnell, altering their dynamic in a way that would confuse new viewers.It joins a long list of errors have being introduced when using generative AI tools to produce content summaries.In early 2025, Apple suspended an AI feature summarising notifications after it drew complaints for repeated mistakes in its summaries of news headlines.The BBC was among the groups to complain about the feature, after an alert generated by Apple's AI falsely told some readers Luigi Mangione, who has been charged in the US with killing UnitedHealthcare chief executive Brian Thompson, had shot himself.Google's AI Overviews, which aim to provide concise summaries of search results, have also come under criticism and mockery for errors.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon pulls AI recap from Fallout TV show after it made several mistakes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05b5/live/8a737610-d77a-11f0-825e-eb4c8fb7e95e.jpg"
      ],
      "datePublished": "2025-12-12T18:04:47.000Z",
      "dateModified": "2025-12-12T18:04:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reform claims to now have more members than Labour",
    "url": "https://www.bbc.com/news/articles/c5y2226x40wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7cfd/live/8a991bf0-d779-11f0-825e-eb4c8fb7e95e.jpg",
    "tag": "Trending",
    "date": "2025-12-12T18:18:32.000Z",
    "description": "7 hours agoBecky MortonPolitical reporterEPAReform UK claims it is now the largest political party in Britain, following reports Labour has lost more ",
    "body": "7 hours agoBecky MortonPolitical reporterEPAReform UK claims it is now the largest political party in Britain, following reports Labour has lost more members.According to the Times newspaper, internal figures show Labour's membership has fallen below 250,000.Reform said it had more than 268,000 paid-up members, which would mean it has overtaken Labour to become the biggest party by membership in the UK.Labour refused to comment on the accuracy of the membership figures in the Times, with a spokesperson saying they would be published in the party's annual report.There is no legal obligation for political parties to publish their membership figures, which are not verified by outside bodies.Reform tracks its membership figures using a live online counter, which the party said only included people who had paid an annual fee of £25 or £10 for under-25s.Reform UK leader Nigel Farage said: \"As we have suspected for some time, Reform has overtaken Labour to become the largest political party in British politics - a huge milestone on our journey to win the next election. \"The age of two-party politics is dead.\"The party has consistently been leading in national opinion polls since the spring.Labour's membership has been steadily falling since Sir Keir Starmer became leader in April 2020, according to the latest publicly available figures.The party's annual accounts published in August put the party's membership at 333,235 at the end of last year, down from a peak of more than 530,000 under Jeremy Corbyn.Despite the party's landslide election victory, it shed 37,000 members over the course of 2024 and reports suggest this trend has continued.In February, the LabourList website reported the party's membership had fallen to around 309,000 and the Times says the figure has now dropped below 250,000.A Labour Party spokesperson said: \"Our membership figures are published in our annual report. We do not give a running a commentary on them throughout the year.\"The party's standard membership fee is £70.50 a year, with reduced rates of £35.50 or £12 available for certain groups.The Mainstream network, a new Labour campaign group which includes supporters of Manchester Mayor Andy Burnham, said: \"To transform Britain and defeat the far-right, Labour needs a grassroots movement in every community.\"Our plummeting membership figures prove the top-down model has failed. The answer is to democratise, open up, and empower members.\"Meanwhile, the Green Party says it has seen a surge in membership since Zack Polanski took over as the party's new leader in September, rising from around 70,000 to more than 180,000.The Conservatives do not routinely publish their membership figures.Some 131,680 members were eligible to vote in last year's Tory leadership election but reports suggest the party's membership has fallen to around 123,000 since then.The number of Liberal Democrat members has also dropped, almost halving over the last five years to around 60,000.Your Party - the new left-wing outfit founded by Jeremy Corbyn and Zarah Sultana - says it has 55,000 paid-up members.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reform claims to now have more members than Labour",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7cfd/live/8a991bf0-d779-11f0-825e-eb4c8fb7e95e.jpg"
      ],
      "datePublished": "2025-12-12T18:18:32.000Z",
      "dateModified": "2025-12-12T18:18:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TJ Watt: Pittsburgh Steelers linebacker has surgery on partially collapsed lung",
    "url": "https://www.bbc.com/sport/american-football/articles/crl991rn069o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/497a/live/03fb8290-d79c-11f0-a245-ebde8881b563.jpg",
    "tag": "Trending",
    "date": "2025-12-12T21:17:16.000Z",
    "description": "Pittsburgh Steelers linebacker TJ Watt has had surgery to repair a partially collapsed lung sustained during dry needle treatment.Watt, the 2021 NFL D",
    "body": "Pittsburgh Steelers linebacker TJ Watt has had surgery to repair a partially collapsed lung sustained during dry needle treatment.Watt, the 2021 NFL Defensive Player of the Year, made six tackles in Pittsburgh's victory over Baltimore Ravens last Sunday. But the 31-year-old was taken to hospital for a lung evaluation after feeling discomfort on Wednesday.Dry needling is a treatment for pain and movement issues involving the insertion of tiny needles into the body.The Steelers made no reference to dry needling in an update on Friday but that element was revealed in a post on X, external by his older brother JJ.\"Yesterday TJ had successful surgery to stabilize and repair a partially collapsed lung suffered Wednesday after a dry needling treatment session at the facility,\" said JJ Watt, who is a minority investor in Premier League side Burnley.\"Recovery timeline is still TBD [to be determined], but all went well and he is being released from the hospital today. He and his family are very appreciative of everyone's kind words and well wishes.\"Steelers coach Mike Tomlin said TJ Watt, who signed a three-year contract extension in July, will miss Monday's game against Miami and is at \"home and resting comfortably\" but does not know when he will be back.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TJ Watt: Pittsburgh Steelers linebacker has surgery on partially collapsed lung",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/497a/live/03fb8290-d79c-11f0-a245-ebde8881b563.jpg"
      ],
      "datePublished": "2025-12-12T21:17:16.000Z",
      "dateModified": "2025-12-12T21:17:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Being homeless eats away at your self-worth, says care leaver",
    "url": "https://www.bbc.com/news/articles/cvgq85kk0kno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a5d5/live/4a4f8de0-cc6b-11f0-8c51-edb570175476.jpg",
    "tag": "Trending",
    "date": "2025-12-13T00:31:12.000Z",
    "description": "Young care leaver facing homelessness was 'left to own devices'31 minutes agoAnnika GrosserBBC England Data UnitKlarisse SmithKlarisse Smith went on t",
    "body": "Young care leaver facing homelessness was 'left to own devices'31 minutes agoAnnika GrosserBBC England Data UnitKlarisse SmithKlarisse Smith went on to study social work after being in the care systemWhen Klarisse Smith started living in a homeless hostel in Birmingham at the age of 16, she had been in the care system for two years.She had spent that time moving between her foster carer, her aunt and her partner's family.\"I felt like my social worker just kind of washed her hands of me when I went to my auntie's,\" she said. \"I didn't really have much contact with anyone. They just left me to my own devices and at the time I just thought this was pretty normal.\"New government data shows the number of households in England with at least one young care leaver facing homelessness has risen by 37% in the past five years – more than double the increase for the general population.The care charity Become said the figures showed \"a complete failure in support for care leavers\".A government spokesperson said the risk of homelessness faced by care leavers was \"unacceptable\" and it was making \"record investment\" in social and affordable housing.Klarisse, now 24, said: \"Being homeless kind of strips your confidence away. It eats at your self worth and has you feeling like it's never gonna change.\"She remembers her social worker being on leave a lot and only visiting her at the hostel when she was waiting on her Universal Credit claim. \"I had nothing to sustain me within the six weeks, so she gave me £50 a week and she'd drop it round in cash,\" she said.Klarisse SmithKlarisse Smith (right) with the Lord Mayor of Nottingham at the Sunbeam Fostering Agency's Children's awards ceremony earlier this yearIt was difficult to ask for support during those years, Klarisse said.\"If you're not the type of person to want to constantly be nagging someone, then you just kind of get left under the system,\" she said. \"You have to constantly be making the calls and the emails.\"While Birmingham City Council said it could not comment on individual cases, it acknowledged the \"significant challenges\" young care leavers like Klarisse faced when transitioning to independent living.A spokesperson said cover arrangements were \"always in place\" to ensure continuity of support when a social worker was unavailable and it was committed to ensuring care leavers had safe accommodation and the support they needed.They said Birmingham had commissioned a Care Leaver Pathway since January 2025 to support 16 to 17-year-olds who were homeless or in care, focusing on life skills, youth engagement, education and training.Klarisse sat her A levels while at another hostel. She then did a social work degree and this summer completed a  scholarship programme for clinical medicine at the University of Oxford.She said: \"I studied social work because I got an understanding of the social care system. I'm a care leaver myself, and I feel that I can relate to a lot of people, especially foster kids. I can instill some confidence into them.\"It took a \"special kind of person\" to be a social worker, she said, because things that might not seem significant to others could mean \"literally everything\" to a child in the care system.She said: \"When you're a child, you're a lot more sensitive. So, putting their clothes in bin bags, for example, might just be a form of transporting them. But to a child, it feels like there's something they've done wrong to be treated like this. They treat people the same when they come out of jail.\"New figures from the Department of Housing, Communities and Local Government (DCLG) show there were 4,610 18 to 20-year-old care leaver households facing homelessness in 2024-25, up 37% from 2019-20.The number in the general population has risen 14.5% since 2019-20, to 330,410 in 2024-25.The data tracks those who have been assessed by their local authority as homeless or threatened with homelessness, and so have received a relief or prevention duty.Clare Bracey, director of policy, campaigns and communication at Become, warned not all cases show up in official statistics. \"Part of the problem is that young people aren't reaching out for support,\" she said.A DCLG spokesperson said: \"Our Homelessness Strategy will set out bold steps to prevent homelessness and deliver lasting solutions, and our landmark Children's Wellbeing and Schools Bill will require public bodies to consider the support young people need when leaving care.\"Ms Bracey said the government was \"taking forward really positive developments\" with the bill.It would require local authorities to support care leavers up to the age of 25 to help them transition into independent living.\"We want to make sure that it is really clear who that support applies to, that there is a broader definition of that support and that young people have a say in what support they should get,\" Ms Bracey added.A Local Government Association spokesperson said: \"In order to effectively reduce homelessness and tackle housing waiting lists, councils need the powers and resources to build or acquire more of the genuinely affordable homes our communities desperately need.\"They added there were currently 132,410 households living in temporary accommodation, costing councils £2.8bn a year.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Being homeless eats away at your self-worth, says care leaver",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a5d5/live/4a4f8de0-cc6b-11f0-8c51-edb570175476.jpg"
      ],
      "datePublished": "2025-12-13T00:31:12.000Z",
      "dateModified": "2025-12-13T00:31:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Cena last match: How he reached the top of WWE",
    "url": "https://www.bbc.com/news/articles/cx2dp15zglxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/25ea/live/ffbb1840-d673-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-13T00:05:31.000Z",
    "description": "Facing one last fight, John Cena became a WWE legend for more than ability56 minutes agoManish PandeyWWE via Getty ImagesThe Last Time Is Now. It's th",
    "body": "Facing one last fight, John Cena became a WWE legend for more than ability56 minutes agoManish PandeyWWE via Getty ImagesThe Last Time Is Now. It's the name given to the tournament in which 16 wrestling giants have been competing to be the one opponent in John Cena's final fight before retirement.And that final fight is now - Saturday night - in Washington DC, bringing the curtain down on an illustrious career that has seen the American become one of wrestling's biggest and most bankable stars.In the 8,570 days since his debut, Cena has clinched 17 world titles and coined the iconic \"You Can't See Me\" catchphrase - but the 48-year-old's impact goes far beyond that.If you were to pose the question \"who is John Cena?\", depending on who you ask, the answers might vary from legendary WWE (World Wrestling Entertainment) superstar, to successful film actor, while some will say he's Mr Make-A-Wish (more on that later).Rich Freeda/WWE via Getty ImagesJohn Cena celebrates his win during WrestleMania 41 Sunday in Las Vegas in April 2025How to watch John Cena's last match:Start time: WWE Saturday Night's Main Event is scheduled to begin at 01:00 GMT on Sun 14 DecWhere to watch: In the UK, you can watch for free on WWE's official YouTube channel. Internationally it can be watched on Netflix, and on Peacock in the US'An exceptional wrestling talent'Since his 2002 debut, there's been an evolution in his own wrestling character - transitioning from \"ruthless aggression\" rookie, to a \"Doctor of Thuganomics\" rapper, and eventually a heroic character known for a \"Never Give Up\" attitude.Despite criticism from some fans of his in-ring ability, with occasional chants of \"you can't wrestle\" through the years, \"there's no doubt that he's an exceptional wrestling talent\", says Brandon Thurston, editor and owner of wrestling website, Wrestlenomics.He feels something changed in 2005, after which WWE became \"increasingly scripted in a way it had not been\" before, as it entered into a more controlled, family friendly PG era. But Cena managed thrive. \"He's definitely been the biggest draw over the time which I would say stretches from 2005 to roughly 2015,\" Mr Thurston says, with Cena's merchandise also regularly topping sales for the company.\"There's little question that he was WWE's most important economic wrestler throughout that time - in terms of pay-per-view buys, which were still central in that era, TV ratings, and as a house show draw.\"Outside the ring too, he's a personality who \"people gravitate towards and want to listen to\", says Mr Thurston - and wrestling fans like Joe Clarkson and Sabrina Nicole feel just that.WWE via Getty ImagesCena made his debut against Kurt Angle during SmackDown in June 2002\"To go for such a long time in an industry, which is quite heavily taxing on the body, is absolutely fascinating,\" says Joe, 24, who was five when he first saw Cena on TV.\"I think over time, the people just gained more and more respect for him, not just as a performer, but also as an individual.\"For Sabrina, 37, who remembers Cena's WWE debut in 2002, it's \"his charisma\".\"He has just always had something about him that makes him a star,\" she says, adding that for most of his career, he's \"always maintained a good guy persona\".\"No matter what the crowd, no matter what the fans have thought of him. He has just been the testament to if you have a really good character, you can be on top,\" she says.It also seems to be true that, beyond his ability and persona, Cena seized an opportunity.Getty ImagesCena's signature \"You Can't See Me\" gestureWith The Rock and Stone Cold Steve Austin no longer full-time performers, WWE bosses were looking for a new star to emerge.Brandon feels WWE leadership recognised Cena \"would be a very reliable and extremely hardworking person whom they could entrust with such a spot\".It's widely accepted within wrestling circles that the final decision to have Cena as the chosen star would ultimately have been taken by then-WWE chairman Vince McMahon.While he was known for following his instincts, there will also have been a judgement on Cena's ability to connect with a passionate crowd on the mic, his marketability and whether he could be in the industry long enough to be profitable.And when Cena started taking more time away from wrestling in 2015 and working a reduced schedule, Mr Thurston feels there was a \"decline\" in the WWE product.Other wrestling experts have suggested Cena's presence over the years helped slow the slide of WWE ratings trending downwards which, according to analysis by wrestling site PWtorch, saw average viewership for its flagship weekly Raw programme fall by a million between 2010 and 2015, to 3.7m.Having achieved so much within wrestling, Cena could \"just come in and be a wrestler and walk out\", adds Dr Gillian Brooks, associate professor in marketing at King's Business School, but instead she says he built a personal brand that comes across as real.An 'authentic' characterAmong the brands Cena has worked with is Neutrogena, becoming the face of its sunscreen campaign after revealing he had skin cancer spots - which he attributed to his own lack of sun protection use.He also holds the Guinness World Record for the number of wishes granted through the Make-A-Wish Foundation, with more than 650 fulfilled wishes for children with critical illnesses. It's a partnership he revealed had started by \"accident\", but one he's kept since 2002, describing it as \"the coolest thing\".\"If you think about it from a child's perspective, they're seeing someone that they've seen on TV watching WWE or in films, and they suddenly get to meet him,\" Dr Brooks says. \"The fact that he's doing charity work, he's written a children's book, been in films, made music… all these things illustrate that he's not a one show pony.\"It's coming across in a way that's very authentic and very sort of pure to who he is.\"Both Cena's personal brand and his charisma are set to live on, but his time in the ring looks to have come to an end after Cena announced last year that 2025 would be his last as a competitor.Getty ImagesCena reached his 500th wish-granting milestone in 2015The retirement runExplaining his reasoning at the time, he told of the physical toll wrestling had taken on his body.His career has seen him undergo several operations, including on his neck, pec and triceps, with Cena saying in interviews that his \"body hurts\" and is \"screaming to close the chapter\".While the old saying \"never say never\" is a popular one, Cena has repeatedly said he will be \"100% done\" - and has received rousing receptions around the world for his final appearances.Overall, fan Joe is happy with Cena's \"retirement run\", with matches against old rivals such as AJ Styles, Randy Orton and CM Punk, and newer stars including Dominik Mysterio and Gunther.He does feel the \"execution\" of his final year could have been better though, with Cena's short-term \"heel turn\" (becoming a villain) at the Elimination Chamber event in March drawing criticism.\"It could have been handled better,\" Joe says. \"[But] he's had such a unique distinction of having a retirement run that no one's ever had before.\"It's very sad to see him retire now. But I think he said it himself - it's the right time.\"Not that WWE fans will never see Cena again; he has signed a five-year deal to be an ambassador for the company.Having won The Last Time Is Now tournament, it's former world heavyweight champion Gunther who will face Cena in his final fight.With it not being broadcast on terrestrial TV, but rather on streaming platforms, it's been reported that there is no time limit on the match - and Gunther, who has never wrestled Cena before, has been giving much tough talk.One thing's for sure: \"You Can't See Me\" might be the taunt Cena gives Gunther, but the last fight will be seen and remembered by many.WWE via Getty ImagesJohn Cena lands a Five Knuckle Shuffle on AJ Styles in Perth, AustraliaMore weekend picks",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Cena last match: How he reached the top of WWE",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/25ea/live/ffbb1840-d673-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-13T00:05:31.000Z",
      "dateModified": "2025-12-13T00:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Has Venezuela been ditched by its strongest allies - Russia and China?",
    "url": "https://www.bbc.com/news/articles/c075mr3190mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d6cc/live/0bedda30-d778-11f0-aae2-2191c0e48a3b.png",
    "tag": "Trending",
    "date": "2025-12-13T00:35:21.000Z",
    "description": "As Trump targets Venezuela, its allies Russia and China show little signs of support27 minutes agoNorberto ParedesBBC News MundoGetty ImagesVenezuelan",
    "body": "As Trump targets Venezuela, its allies Russia and China show little signs of support27 minutes agoNorberto ParedesBBC News MundoGetty ImagesVenezuelan President Nicolás Maduro could be forgiven for wondering who his true friends are. Once rock solid, his reliance on his two main allies - China and Russia - now appears increasingly uncertain.For years, both countries supported Venezuela's socialist-led government politically, financially and militarily - a relationship that began under former President Hugo Chávez, Maduro's mentor and predecessor.But experts say that backing now seems to be largely symbolic, with statements being given in support rather than concrete military or financial aid.This shift comes as the US has deployed air and naval forces - including a nuclear-powered submarine, spy planes and 15,000 troops - to the Caribbean.The US has conducted strikes on boats in the region that it alleges are smuggling drugs, killing more than 80 people, and in recent days, it seized an oil tanker off the coast of Venezuela.The Trump administration has said the military build-up and strikes are targeting drug trafficking, and the tanker had been sanctioned. But many experts - and Maduro himself - believe Washington's real goal is regime change.So at the Venezuelan president's hour of greatest need, what has changed?Prof Fernando Reyes Matta, director of the Centre for China Studies at Andrés Bello University in Chile, argues that Venezuela has become a far lower priority for both Beijing and Moscow, especially since US President Donald Trump returned to the White House.\"There is no reason today for either Russia or China to go all-in defending Venezuela given their other problems, such as Russia and its war in Ukraine, and China trying to coexist internationally with President Trump,\" he says.Since Russia's full-scale invasion of Ukraine in 2022, Moscow has poured enormous resources into the conflict, straining both its finances and its military. It has also faced sweeping Western sanctions.This leaves fewer resources for allies that previously benefited from Kremlin support, says Prof Vladimir Rouvinski, the director of the Laboratory of Politics and International Relations (PoInt) at Icesi University in Colombia.Syria and Iran, Moscow's long-standing allies in the Middle East, have faced a similar fate in recent times.\"Russia will [not] risk receiving more sanctions than it already has, [and] China will not risk getting more tariffs imposed on it for defending Maduro,\" Prof Rouvinski explains.Maduro reportedly asked China and Russia for military assistance at the end of October, according to The Washington Post.The Kremlin's Deputy Foreign Minister Sergey Ryabkov has said \"we support Venezuela, as it supports us\", while urging the Trump administration to avoid escalating the crisis, Russian media reported. And in the wake of the American seizure of the oil tanker, the Kremlin said Putin had called Maduro to affirm his support.But so far, Moscow has not provided any material assistance.Getty ImagesPutin and Maduro met in Moscow in May 2025. Russia has provided Venezuela with military support for yearsLike Moscow, Beijing has shown no sign it would militarily defend Venezuela, instead condemning what it calls \"external interference\" and urging restraint.Experts say China defending Maduro could jeopardise recent diplomatic gains between Beijing and Washington, while offering little beyond ideological alignment.US–China relations have been particularly tense since Trump imposed tariffs on multiple countries. But a meeting between Trump and Xi Jinping in South Korea in late October - described as positive by both sides - opened the door to new agreements and lower tariffs on certain products.According to experts, Venezuela's economic collapse and the deterioration of its oil industry have further discouraged Chinese support. Beijing has reduced new lending in recent years and is now focused mainly on recovering past loans.\"I think China is willing to negotiate with any government that eventually replaces Maduro, and believes that supporting Maduro too strongly now could bring negative consequences when the regime falls,\" says Prof Rouvinski.Getty ImagesVenezuela has purchased hundreds of millions of dollars' worth of Chinese military equipment since 2005Prof Reyes Matta does not think \"either of the two countries is willing to support a regime that has so little internal backing\".\"Moreover, both Russia and China know that the last presidential election had very evident fraudulent characteristics.\"The July 2024 election was marred by serious allegations of fraud. The National Electoral Council (CNE), dominated by government allies, proclaimed Maduro the winner but provided no detailed results, unlike in previous elections.The opposition - led by this year's Nobel Peace Prize laureate María Corina Machado - released electoral records suggesting the opposition candidate Edmundo González won.\"This time, Maduro is completely alone,\" says Prof Rouvinski, who believes Maduro's time is \"running out\". \"Russia and China may continue criticising US intervention, but they are not willing to go any further. The support he had in the past is no longer there in real terms, beyond certain rhetorical statements.\"Additional reporting by BBC Global Journalism ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Has Venezuela been ditched by its strongest allies - Russia and China?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d6cc/live/0bedda30-d778-11f0-aae2-2191c0e48a3b.png"
      ],
      "datePublished": "2025-12-13T00:35:21.000Z",
      "dateModified": "2025-12-13T00:35:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]