[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Starmer’s Fight For Survival - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n03j41?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-09T21:59:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Feb 2026,·34 minsAvailable for over a yearToday, Keir Starmer has addressed his MPs and seems to have rallied some support after Scottish Labour leader Anas Sarwar called for him to quit.\nIn a press conference in Glasgow, Sarwar emphasised his concerns for Scotland ahead of the May elections, and told reporters “the leadership in Downing Street has to change\". \nThe move prompted statements supporting the prime minister from cabinet ministers and other key labour figures including potential rivals Angela Rayner and Wes Streeting.\nThe PM has been facing mounting pressure in recent days with two of his top aides Tim Allen and Morgan McSweeney resigning following the aftermath of revelations about the appointment of former US ambassador Peter Mandelson. \nJames and Alex are in for Adam to talk through what it all mean.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Alex Forsyth and James Cook. It was made by Anna Harris with Shiler Mahmoudi, Chloe Scannapieco and Sophie van Brugen. The technical producer was Hannah Montgomery. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Starmer’s Fight For Survival - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-09T21:59:00.000Z",
      "dateModified": "2026-02-09T21:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Call for change in law to tackle covertly-filmed videos of women on nights out",
    "url": "https://www.bbc.com/news/articles/ce94jy3ge42o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3ca/live/0c831ee0-fc23-11f0-b36e-bd4784e89465.png",
    "tag": "Trending",
    "date": "2026-02-10T18:57:18.000Z",
    "description": "Call to change law after BBC finds women were covertly filmed on nights out 2 hours agoAbi SmittonBBC News InvestigationsBBCA BBC investigation identi",
    "body": "Call to change law after BBC finds women were covertly filmed on nights out 2 hours agoAbi SmittonBBC News InvestigationsBBCA BBC investigation identified nearly 50 women who had been filmed without their knowledgeCovertly filming women on nights out to upload the videos to social media should be made illegal, the Liberal Democrats have said.The party has put forward a private members' bill calling on the government to update voyeurism legislation to prevent the content from being posted online for profit.It said the bill would clamp down on what it calls \"a covert filming epidemic\" and wants the government to force social media platforms to remove such content and permanently ban repeat offenders.It comes after a BBC investigation exposed dozens of accounts on YouTube, TikTok, Facebook and Instagram. The videos focused almost entirely on women, filmed without their knowledge and taken from low angles or behind, sometimes revealing intimate body parts.The government said covert filming of women and girls was \"vile\" and vowed to stop people profiting from it.The BBC investigation identified nearly 50 women who had been filmed without their knowledge.Anna-Rose was filmed twice on different nights out in Manchester. Although the original videos have now been removed, copies are still being shared.\"It makes me feel violated,\" the 29-year-old said. \"You think it's gone and it's there again. You just know your face is on someone's phone.\"The BBC identified more than 65 channels with this type of content - between them they had more than three billion views over the past three years.Anna-Rose was filmed without her knowledge while out in ManchesterWhile filming in public is rarely a crime, Wera Hobhouse, Lib Dem MP for Bath, said the videos fall into a \"legal grey area\" that could break voyeurism and harassment laws.As a result of the BBC investigation, she has now introduced a private members' bill calling for a change to legislation. \"We need to plug the loopholes that allow these men to get away scot-free,\" she said.\"The government must urgently tighten voyeurism laws to make clear that sexualised, covert filming and posting footage online is a criminal offence, and force platforms to take this content down fast.\"The law must be fit for purpose to protect women and girls in the digital world.\"\"Everyone should feel safe to go out with their friends without the fear they will appear in videos plastered all over the internet.\"Dozens of private members' bills are introduced by MPs every year, but only a handful go on to become laws.At the start of Parliament, 20 MPs are randomly selected to take priority and so their bills are most likely to see progress. Hobhouse is not one of them, meaning her bill will join the back of a long queue.Following the BBC investigation into so-called nightlife videos, YouTube removed two accounts and said it \"rigorously enforces\" its community guidelines. It said it removed 1.8 million videos for violating its harassment policies at the end of 2025.TikTok has removed four channels shared by the BBC. Meta, which runs Facebook and Instagram, said it has removed content that violated its policies.Jess Phillips, minister for safeguarding and violence against women and girls, said covert filming of women and girls was \"vile\", adding: \"Nobody's privacy and safety should ever be up for grabs.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Call for change in law to tackle covertly-filmed videos of women on nights out",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3ca/live/0c831ee0-fc23-11f0-b36e-bd4784e89465.png"
      ],
      "datePublished": "2026-02-10T18:57:18.000Z",
      "dateModified": "2026-02-10T18:57:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boy, 13, arrested over double stabbing at north London school",
    "url": "https://www.bbc.com/news/articles/cge8yxpj7e1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/96bf/live/88293a10-06b0-11f1-9a46-37f4a626eabd.jpg",
    "tag": "Trending",
    "date": "2026-02-10T19:53:32.000Z",
    "description": "Boy arrested for attempted murder after two pupils stabbed at school43 minutes agoJames W KellyLondonPA MediaOfficers arrived on the scene within 13 m",
    "body": "Boy arrested for attempted murder after two pupils stabbed at school43 minutes agoJames W KellyLondonPA MediaOfficers arrived on the scene within 13 minutes, the Met Police saidA 13-year-old boy has been arrested on suspicion of attempted murder after two boys were stabbed at a school in north-west London. Officers were called to Kingsbury High School at about 12:40 GMT following reports a 13-year-old boy had been stabbed. Police said they were later made aware that a second victim, a 12-year-old boy, had also been stabbed at the scene. Both boys were taken to hospital, with one taken to a major trauma centre as a priority. Officers said they were both believed to be in a serious condition.Counter-terror officers are leading the investigation but it has not been declared a terrorist incident, the Met Police said.Weapon recoveredDet Ch Supt Luke Williams said armed and local officers were at the scene within 13 minutes of the 999 call.He said the suspect, believed to be aged 13, left the scene following the stabbings but was later arrested.Williams said a weapon believed to have been used in the attack had been recovered and the suspect remained in custody for questioning.He told a press conference on Tuesday evening that officers were not looking for anyone else in connection with the stabbings.\"This is a fast-moving and developing investigation,\" he said.\"At this very early stage, we are keeping an open mind as to any motivation behind this attack. However, due to the surrounding circumstances, the investigation is now being led by officers from Counter Terrorism Policing London, who are working closely with our local officers in response to this incident.\"He added: \"I absolutely recognise that this incident will cause considerable concern among the local community, students and parents. Our officers will remain in the area to offer support and answer any questions.\"PA MediaDet Ch Supt Luke Williams updated media at the school on Tuesday eveningPupils, some of whom were in tears, and parents were still leaving the school on Tuesday evening after being spoken to by police.One father, whose child in year eight was kept in the school as a potential witness, said: \"They're holding up the kids who were in the class.\"The man, who did not wish to be named, added: \"Obviously, they must be traumatised by what happened in front of them.\"The head teacher of Kingsbury High School, Alex Thomas, said it had been \"a deeply traumatic event for the whole school community\", in a letter to parents and carers.\"I am very sorry to inform you that there was a serious incident at school today in which two students were stabbed,\" he said. \"Our thoughts and best wishes are with our students and their families at this incredibly difficult time.\"'Horrifying'Mayor of London Sir Sadiq Khan said \"there is no honour in staying silent\" as he urged anyone with information to contact the police.In the statement issued on Tuesday evening, Sir Sadiq said:  \"My thoughts are with the family, friends and wider community in Brent following the appalling stabbings today.\"He added: \"The Met have deployed significant resources to the area and I urge anyone with information to call police on 101 or Crimestoppers anonymously on 0800 555 111.\"Muhammed Butt, leader of Brent Council, said the double stabbing was \"deeply shocking and distressing\".\"No parent should ever have to fear for their child's safety at school, and it is horrifying to think of how someone so young came to be in possession of a weapon capable of causing such harm,\" he said.The Labour councillor thanked the emergency services and school staff for their \"swift response\" and said the council would offer its \"full and unlimited support\" to those affected.Kingsbury High School is an academy school serving children aged 11 to 18, with both upper and lower sites.According to the latest Department for Education information, it has 1,997 pupils.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boy, 13, arrested over double stabbing at north London school",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/96bf/live/88293a10-06b0-11f1-9a46-37f4a626eabd.jpg"
      ],
      "datePublished": "2026-02-10T19:53:32.000Z",
      "dateModified": "2026-02-10T19:53:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002q39v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2026-01-22T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·22 Jan 2026,·56 mins,·Available for over a yearAs the government prepares to introduce a strategy to boost fostering in England, Amol speaks to foster carer and author Louise Allen about the crisis in the system and what it will take to fix it.  \nAt the end of March 2024 there were 83,630 children in care in England, of whom 56,390 were being fostered, but there is a shortfall of around 6,000 foster carers nationwide. \nIn this episode Louise explains why we need to be more honest about the realities of caring for often vulnerable kids and focus on retaining foster carers rather than recruiting new ones.  \nShe also explains why there needs to be more practical support like providing a cleaner for every fostering household so that they can focus on emotionally supporting the children in their care. \n(00:03:10) Why is there a fostering crisis?\n(00:06:20) Why do we have so many children in care?\n(00:08:49) Louise's story: growing up in care\n(00:16:13) The effect of smartphones\n(00:20:08) Why is there a shortage of foster carers?\n(00:23:37) Why do people foster?\n(00:27:28) The recruitment process\n(00:30:33) Foster care v residential care\n(00:33:10) What is the fostering allowance?\n(00:39:09) Louise's RADICAL ideas\n(00:45:06) The government's fostering reforms\n(00:47:30) The importance of giving children social capital\n(00:52:19) Amol's reflections\nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O'Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2026-01-22T06:00:00.000Z",
      "dateModified": "2026-01-22T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marc Anthony says Beckham family feud is 'unfortunate' but 'hardly the truth'",
    "url": "https://www.bbc.com/news/articles/c98gyegzypxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7203/live/8b6affc0-067d-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T13:32:09.000Z",
    "description": "Brooklyn Beckham published a six-page Instagram statement on 19 January, confirming a rift between him and his wife with the wider Beckham family. He ",
    "body": "Brooklyn Beckham published a six-page Instagram statement on 19 January, confirming a rift between him and his wife with the wider Beckham family. He accused his parents of trying to \"ruin my relationship\" with Peltz, adding that he had no wish to reconcile with his family.The 26-year-old also said his mother had \"hijacked\" his first dance with Peltz, which had been \"planned weeks in advance to a romantic love song\".\"In front of our 500 wedding guests,\" he continued, \"Marc Anthony called me to the stage, where in the schedule was planned to be my romantic dance with my wife but instead my mum was waiting to dance with me instead.\"\"She danced very inappropriately on me in front of everyone. I've never felt more uncomfortable or humiliated in my entire life.\"Wedding DJ Fat Tony previously told ITV's This Morning that \"the whole situation was really awkward for everyone in the room\".After speculation about the nature of Lady Beckham's dancing, Fat Tony clarified: \"There was no slut-dropping, there was no black cat PVC catsuits, there was no Spice Girl action.\"Fat Tony claimed Marc Anthony had called for \"the most beautiful woman in the room\" to come up for the first dance with Brooklyn, but then said Lady Beckham's name instead of Nicola's. The DJ said this led to the bride running out of the room in tears.Sir David and Lady Beckham have not responded to repeated requests for comment on the claims in their eldest son's statementHowever, when asked about young people and their social media use in Davos last month, Sir David remarked that children are \"allowed to make mistakes\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marc Anthony says Beckham family feud is 'unfortunate' but 'hardly the truth'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7203/live/8b6affc0-067d-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T13:32:09.000Z",
      "dateModified": "2026-02-10T13:32:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Labour comms chief Lord Doyle suspended over links to sex offender",
    "url": "https://www.bbc.com/news/articles/cqxdry8px2xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b680/live/12cc8ab0-0bbb-11f0-9ca8-c5035ea95420.png",
    "tag": "Trending",
    "date": "2026-02-10T19:26:13.000Z",
    "description": "1 hour agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterAlamyLord Doyle, Sir Keir Starmer's former director of comm",
    "body": "1 hour agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterAlamyLord Doyle, Sir Keir Starmer's former director of communications, has been suspended from Labour's parliamentary party over his links with a convicted sex offender.The peer said he would not take the Labour whip and apologised for his past association with Sean Morton, a former Labour councillor in Moray who admitted indecent child image offences in 2017.It comes after the Sunday Times reported that Lord Doyle campaigned for Morton after he was charged with possessing and distributing indecent images of children in December 2016.\"At the point of my campaigning support, Morton repeatedly asserted to all those who knew him his innocence, including initially in court,\" Lord Doyle said.He added: \"To have not ceased support ahead of a judicial conclusion was a clear error of judgement for which I apologise unreservedly.\"Those of us who took [Morton] at his word were clearly mistaken. I have never sought to dismiss or diminish the seriousness of the offences for which he was rightly convicted. They are clearly abhorrent and I have never questioned his conviction.\"Following his conviction any contact was extremely limited and I have not seen or spoken to him in years. Twice I was at events organised by other people, which he attended, and once I saw him to check on his welfare after concerns were raised through others.\"Lord Doyle, a veteran Labour spin doctor who was the party's head of press between 1998 and 2005 before working for Lord Blunkett and Sir Tony Blair, was given a peerage by Sir Keir in December. He was sworn in as a member of the House of Lords last month. The Sunday Times first reported about Lord Doyle's campaigning for Morton in December last year and last week the Conservatives called for details of the peer's vetting to be published.A Labour Party spokesperson said: \"All complaints are assessed thoroughly in line with our rules and procedures.\"The party is undertaking an investigation and Lord Doyle's Labour whip in the House of Lords has been withdrawn while this is ongoing.Sir Keir faced questions about Lord Doyle's peerage on Monday during a meeting of the Parliamentary Labour Party, when the prime minister rallied MPs behind his leadership.Conservative leader Kemi Badenoch wrote to Sir Keir last week to call on him to \"explain why you appointed another friend of a child sex offender to a prestigious post\".It comes after the PM confirmed he had appointed Lord Mandelson to the role of US ambassador despite knowing about his friendship with convicted sex offender Jeffrey Epstein.The PM apologised to Epstein's victims for believing Mandelson's \"lies\" about the extent of his relationship with the financier.After Lord Doyle was suspended, Badenoch said the PM must \"come clean about what he was told\" before making Doyle a peer, adding: \"We won't let this go.\"Getty ImagesPam Duncan-Glancy has stepped down as Scottish Labour's education spokesperson over her links to MortonLabour have also suspended the party whip in the Scottish Parliament from MSP Pam Duncan-Glancy.A Scottish Labour spokesperson said: \"All complaints are assessed thoroughly in line with our rules and procedures.\"Duncan-Glancy stood down as her party's education spokesperson in December and will quit the Scottish Parliament in May over her friendship with Morton.In December, she admitted a \"serious error of personal judgement\" after it emerged she maintained contact with the former Labour councillor following his 2017 conviction.The Daily Record has since reported that Duncan-Glancy continued her friendship with Morton after he was jailed for further offences and that he attended her birthday party late last year.Morton was jailed in January last year after pleading guilty to possessing indecent photographs of children and breaching his sexual offences order. He was given two 16-month sentences, backdated to May 2024.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Labour comms chief Lord Doyle suspended over links to sex offender",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b680/live/12cc8ab0-0bbb-11f0-9ca8-c5035ea95420.png"
      ],
      "datePublished": "2026-02-10T19:26:13.000Z",
      "dateModified": "2026-02-10T19:26:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Daily Mail editor tells hacking trial allegations are 'preposterous'",
    "url": "https://www.bbc.com/news/articles/cy03g54946ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4c18/live/947a4400-06a4-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T19:30:14.000Z",
    "description": "Dacre previously defended the actions of Associated Newspapers at the Leveson Inquiry into press standards 14 years ago. There, he answered questions ",
    "body": "Dacre previously defended the actions of Associated Newspapers at the Leveson Inquiry into press standards 14 years ago. There, he answered questions about the paper's use of private investigators to obtain information.On Tuesday Dacre was back in court, facing similar questions from the same barrister, David Sherborne, who is representing the seven claimants. Dacre told the trial that he \"wasn't aware\" of the extent of the paper's use of private investigators - who he referred to as \"inquiry agents\" - until around 2007 when he \"brought the shutters down\".Sherborne asked Dacre whether his involvement in the case \"is motivated by a desire to protect your legacy\" rather than getting a fair outcome. Dacre admitted wanting to clear his name, but also said he cared about the \"honest and dedicated\" staff at the paper.Regarding allegations that hacking and tapping phones was \"habitual and widespread\" at the Daily Mail, Dacre said: \"I utterly reject this. Such blatant illegality would not, I believe, have been countenanced at any level on the paper I edited.\"He added that he is sure if he was told there was evidence a journalist or agent had blagged information, he would \"have been pretty furious\". The \"sometimes preposterous allegations\" have \"in the small hours of the night – reduced me to rage\" he wrote in his witness statement, adding that they have had a \"deeply upsetting and, in some instances, traumatic impact\" on past and present Daily Mail staff. Another of the claimants, Baroness Lawrence, is the mother of the murdered black schoolboy Stephen Lawrence. When Stephen was murdered, the Daily Mail campaigned on her behalf.In her claim, Lawrence alleges that ANL targeted her with hidden electronic surveillance, tapped her phone and monitored her bank account.She previously told the court that she felt like \"a victim all over again\" after she learned of the allegations.Dacre told the court on Tuesday that \"my heart bleeds for Doreen Lawrence\"In his statement he added Lawrence's claims in relation to the campaign \"are especially bewildering and bitterly wounding to me personally.\"At times, the atmosphere between Sherborne and Dacre was combative. At one stage, Sherborne suggested \"you choose to remember the things that might be helpful, and deliberately forget the things that might be unhelpful\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Daily Mail editor tells hacking trial allegations are 'preposterous'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4c18/live/947a4400-06a4-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T19:30:14.000Z",
      "dateModified": "2026-02-10T19:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wrapped helps Spotify add users despite artists criticism over fees",
    "url": "https://www.bbc.com/news/articles/cwy8lg9lkj3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e1d5/live/9ade7730-06a4-11f1-8d5d-7d6caf00f484.jpg",
    "tag": "Trending",
    "date": "2026-02-10T18:02:02.000Z",
    "description": "It highlighted its \"Spotify Wrapped\" feature for engaging users.\"Our 11th annual Wrapped was bigger, bolder and more layered than ever, celebrating fa",
    "body": "It highlighted its \"Spotify Wrapped\" feature for engaging users.\"Our 11th annual Wrapped was bigger, bolder and more layered than ever, celebrating fans, artists, creators and authors around the world,\" it said in its results. \"Wrapped had more than 300 million engaged users and more than 630 million shares on social media globally in 56 languages\".Chief executive Gustav Söderström said the firm considered itself the research and development department of the music industry, by focussing on new developments in audio, such as adding video to podcasts, and embracing music made by artificial intelligence (AI).\"Our job is to understand new technologies quickly and capture their potential, which we've done time and again,\" he said. \"The entire industry stands to benefit from this [AI] paradigm shift but we believe those who embrace this change and move fast, will benefit the most.\"But the latest revenue figures come as a heated debate continues about how much money artists and songwriters receive in royalties. Various artists boycotted a Spotify party in 2025, and Taylor Swift famously refused to put her work on the platform for three years because the platform didn't pay enough.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wrapped helps Spotify add users despite artists criticism over fees",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e1d5/live/9ade7730-06a4-11f1-8d5d-7d6caf00f484.jpg"
      ],
      "datePublished": "2026-02-10T18:02:02.000Z",
      "dateModified": "2026-02-10T18:02:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Under-fire Trump commerce secretary Howard Lutnick confirms he visited Epstein's island",
    "url": "https://www.bbc.com/news/articles/cwyx9vq0ne0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4fd9/live/e2646b20-069d-11f1-8d5d-7d6caf00f484.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:05:05.000Z",
    "description": "US Commerce Secretary Howard Lutnick has confirmed he visited Jeffrey Epstein's island in 2012, contradicting previous claims that he had cut ties wit",
    "body": "US Commerce Secretary Howard Lutnick has confirmed he visited Jeffrey Epstein's island in 2012, contradicting previous claims that he had cut ties with the sex offender years earlier, before he was convicted. \"I did have lunch with him as I was on a boat going across on a family vacation,\" Lutnick testified on Capitol Hill on Tuesday. \"My wife was with me, as were my four children and nannies … We had lunch on the island. That is true. For an hour.\"Correspondence about the visit was included in Epstein documents released by the US Department of Justice. Some lawmakers have called on Lutnick to resign, but on Tuesday the White House said he had the full support of President Donald Trump.The commerce secretary had previously told Congress that he cut ties with Epstein in 2005 after the late financier - a neighbor of Lutnick's in New York - used sexual innuendo to explain why he owned a massage table in a room of his home.In Tuesday's testimony, he said: \"Over the next 14 years, I met him two other times that I can recall.\" The justice department files show Lutnick visited Epstein's Caribbean island on 23 December 2012. That came four years after Epstein was convicted for soliciting prostitution from a child. Lutnick's testimony on Capitol Hill marked the first time he publicly confirmed the visit.\"I don't recall why we did it, but we did it,\" he said Tuesday, referring to the lunch. Lutnick has not been accused of any wrongdoing in relation to Epstein.The other time, outside of meeting Epstein on his island, was a year and a half after that when Lutnick said he had an hour-long meeting with Epstein. Lutnick noted that within the millions of pages of Epstein documents released by the justice department, roughly 10 emails connect him with Epstein. \"Over a 14-year period, I did not have any relationship with him, I barely had anything to do with that person,\" he said. Senator Chris Van Hollen, a Democrat from Maryland, grilled Lutnick about the conflicting accounts.\"The issue is not that you engaged in any wrongdoing in connection with Jeffrey Epstein, but that you totally misrepresented the extent of your relationship with him, to the congress, to the American people and to the survivors of his despicable criminal and predatory acts,\" he said.Lutnick is among a series of high profile people named in the more than 3.5 million documents that have been released by the justice department, as mandated by law. The revelation that he had visited Epstein's island long after he asserted that he had cut off contact has led to bipartisan calls for the commerce secretary to resign from the Trump administration. Democratic Congressman Ro Khanna and Republican Congressman Thomas Massie, who co-sponsored the law that compelled the justice department to release the Epstein files last year, have both urged Lutnick to step down. Khanna and Massie are continuing to pursue further disclosure. After viewing unredacted copies of the files, Khanna revealed the names of six other people on Tuesday that he says were improperly blacked out. Massie said they are \"likely incriminated by their inclusion in these files\".The BBC is contacting the people for comment. While Lutnick was testifying on one side of Capitol Hill, survivors of Epstein abuse gathered on the other to announce Virginia's Law, legislation that aims to remove the time limit for survivors of sexual abuse to file civil claims.The legislation is named for Virginia Giuffre, who was one of the most well-known survivors of Epstein's sexual abuse. She died by suicide in 2025.Giuffre's sister-in-law Amanda Roberts said her wish was to eliminate the statute of limitations. \"No more laws that treat survivors as though time can erase harm,\" Roberts said, before adding: \"Pass Virginia's Law.\"Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Under-fire Trump commerce secretary Howard Lutnick confirms he visited Epstein's island",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4fd9/live/e2646b20-069d-11f1-8d5d-7d6caf00f484.jpg"
      ],
      "datePublished": "2026-02-10T20:05:05.000Z",
      "dateModified": "2026-02-10T20:05:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI releases images of masked person in hunt for Nancy Guthrie",
    "url": "https://www.bbc.com/news/articles/cy4wdgxr081o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6def/live/a79545d0-06ae-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T19:04:23.000Z",
    "description": "\"As of this morning, law enforcement has uncovered these previously inaccessible new images showing an armed individual appearing to have tampered wit",
    "body": "\"As of this morning, law enforcement has uncovered these previously inaccessible new images showing an armed individual appearing to have tampered with the camera at Nancy Guthrie's front door the morning of her disappearance,\" FBI Director Kash Patel said in a statement on X. He said authorities had been working to recover images from the home surveillance system that \"may have been lost, corrupted, or inaccessible due to a variety of factors - including the removal of recording devices\".  Officials also released two short videos showing the person approach the front door of Nancy Guthrie's home, then check camera before moving away, picking up some vegetation from the ground and using it to cover the camera lens. Savannah Guthrie shared the new video on Instagram. \"Someone out there recognises this person,\" she said on Tuesday. \"We believe she is still out there. Bring her home.\"This marks the first major breakthrough in a case that has gripped the country for more than a week.On Monday, police were still saying they had yet to identify any suspects or vehicles connected to Nancy Guthrie's disappearance, the same day Savannah Guthrie issued a new video appeal to anyone with information.\"We believe our mum is still out there,\" she said in a video posted to her Instagram account. \"We need your help.\"She renewed that appeal on Tuesday, reposting the surveillance images on her Instagram with the message: \"We believe she is still alive. Bring her home.\" The FBI is offering a $50,000 (£36,000) reward for any information.FBIFBIWhite House Press Secretary Karoline Leavitt said President Donald Trump has reviewed the footage. She said he encouraged people with any information to contact authorities. \"The prayers of this entire White House are with Savannah and her family at this time. We hope this person is found soon and her mother is brought home safely,\" she said. Last week, Pima County officials said that home's doorbell camera  was disconnected at 01:47 local time and the camera's software registered motion a short time after, at 02:12.At 02:28, the app on her pacemaker, an implanted cardiac device, disconnected from her phone.Police also said they had found blood on Nancy Guthrie's porch and analyses confirmed it was hers.Authorities have said say there are taking an email with a ransom note sent to US media outlets stating a Monday deadline seriously, the BBC's US partner CBS News reported.A previous apparent deadline for ransom, which was demanded in Bitcoin, passed on 5 February.It was one of three reported ransom notes sent in the case. Officials made one arrest last week in relation to a hoax ransom note. The family has indicated that they would be willing to pay for their mother's safe return.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI releases images of masked person in hunt for Nancy Guthrie",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6def/live/a79545d0-06ae-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T19:04:23.000Z",
      "dateModified": "2026-02-10T19:04:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
    "url": "https://www.bbc.com/news/articles/czd81vr9dmyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T11:26:27.000Z",
    "description": "Small Prophets centres on Michael Sleep (played by Pearce Quigley), whose partner Clea vanished seven years ago. After a tip-off from his elderly fath",
    "body": "Small Prophets centres on Michael Sleep (played by Pearce Quigley), whose partner Clea vanished seven years ago. After a tip-off from his elderly father, played by Sir Michael, he begins cooking up an ancient recipe involving rain water, horse manure, and a little alchemy, to create folkloric creatures who can predict the future.\"They are called homunculi,\" explained Sir Michael, \"which I don't think anybody knows anything about, apart from Mackenzie.\"[He] found them in a book somewhere that there was proof that many many years ago, a man had found a recipe to create little people in jars - a magical alchemist.\"Sleep hopes he can help him find his wife. \"So what seems a very strange thing, becomes magical and quite helpful and improving, and helps him in his quest for his lost partner,\" Sir Michael explained. The series follows Michael (played by Quigley) as he attempts to create small creatures in jarsSmall Prophets marks the actor and presenter's first TV acting role since playing the green man in Worzel Gummidge, which was also written and directed by Crook. The former Monty Python star described Crook as a \"marvellous writer, one of the most original\".He said Crook's latest series is \"quite incisive, it's not dreamy, he writes very funny lines, very tart and quite sardonic in their way\".\"It's all about life in the suburbs of south Manchester, and he can find in that world an amazing amount of humour and magic, and good people doing very funny things.\"Five-star reviewsIn a five-star review, the Guardian's Jack Seale said Small Prophets was \"a pure, pure pleasure\"\"If there is a message or a moral, it is that there are still wonderful things at hand in a world that might seem like it is running out of them,\" he said.\"The existence of Small Prophets proves the point: that British telly can still create impossible marvels like this is a reason to keep believing in magic.\"Ben Dowell of The Times also awarded it five stars, describing Small Prophets as \"the loveliest British comedy since Detectorists\".\"Even if this didn't have a supernatural storyline, Crook is already a magician, someone whose joyous storytelling can make you feel strangely and intensely alive,\" he said.The blending of the mundane and the magical \"may not suit every palate\", said the Telegraph's Anita Singh in her four-star review, \"but this is clearly a labour of love for Crook.\" \"Admittedly, some components jar – a cackling colleague at the DIY store feels misplaced, and the final instalment of the six-part series takes an unwanted detour into horror. \"However, Quigley is wonderful; a character in whose company one would happily while away the hours.Also awarding four stars, the Independent's Patrick Smith advised readers: \"If the show's magical realism gives you pause, don't be put off: you'll be rewarded with something funny, strange, and surprisingly accessible. \"Like Detectorists before it, this is a series that wrings emotion from the commonplace and everyday – only this time, the treasure Crook has buried is altogether more peculiar. Small Prophets brings large returns.\"Small Prophets is available now on iPlayer. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T11:26:27.000Z",
      "dateModified": "2026-02-10T11:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I will never walk away, says Keir Starmer after facing pressure to quit",
    "url": "https://www.bbc.com/news/articles/c20j65ldg9zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19ed/live/8418ae20-06a0-11f1-8d5d-7d6caf00f484.png",
    "tag": "Trending",
    "date": "2026-02-10T16:46:25.000Z",
    "description": "The prime minister has faced questions about his leadership for months, following numerous U-turns and a drop in his government's popularity. Those qu",
    "body": "The prime minister has faced questions about his leadership for months, following numerous U-turns and a drop in his government's popularity. Those questions intensified following the release of emails from Jeffrey Epstein, which revealed the extent of the relationship between the convicted sex offender and Peter Mandelson, the prime minister's pick to be his ambassador in the US.Labour MPs questioned why Lord Mandelson had been appointed and around half a dozen have called on the prime minister to quit. On Monday, Scottish Labour leader Anas Sarwar became the most senior figure in the party to call for Sir Keir to go, saying there had been \"too many mistakes\" in Downing Street.Speaking to broadcasters during his visit to Hertfordshire, Sir Keir said the \"turmoil in politics\" from the last few days would not distract him from \"the most important issue to focus on\" – the cost of living – which he said is \"what I'm fighting for, who I'm fighting for\".\"I've got the most working class cabinet in the history of this country,\" he said.\"But it's utter nonsense to suggest it means everyone gets a fair chance at life... I feel very strongly about this.\"Citing his own personal experiences of growing up in a family unable to pay bills, and his brother's struggles \"living in virtual poverty\", he said \"this political system didn't work for him and millions of people in the same boat\".Asked if he would be leading his party into the next election, he said: \"I had a five year mandate to deliver the change. I intend to get on with what elected to do which is deliver that change.\"Had senior ministers publicly backed Sarwar's call for the PM to go, Sir Keir could have been forced to step down. However, shortly after Sarwar began his press conference, the cabinet started posting messages of support for the prime minister on social media.A few hours later, the prime minister received an enthusiastic response when he addressed a meeting of the Parliamentary Labour Party.He has also received public backing from three potential leadership challengers - former deputy prime minister Angela Rayner, Health Secretary Wes Streeting and Greater Manchester Mayor Andy Burnham. Although the prime minister survived a difficult day on Monday, his position remains fragile and the situation could change quickly. The Gorton and Denton by-election on 26 February and elections in Scotland, Wales and for councils in England in May could trigger fresh leadership challenges, if Labour perform badly. There could also be further embarrassing revelations, when the government fulfils its promise to publish documents and communications related to the appointment of Lord Mandelson. Asked about Streeting's decision to unilaterally publish his own WhatsApp exchanges with Lord Mandelson, Sir Keir said the government needed to be \"all acting together in this\" and for it be done in a \"managed process\".\"We owe it to Parliament to be totally transparent about it, we need to liaise with Parliament and with the police to make sure we get the process right.\"Streeting has said he was releasing his own messages to dispel suggestions he had \"something to hide\" over his relationship with Lord Mandelson. Asked on Tuesday if he backed the prime minister, the health secretary said Sir Keir had his \"full support\" and was leading the country with \"integrity\".Burnham, who along with Streeting has been touted as a possible leadership contender, would not be able to challenge Sir Keir without becoming an MP and his application to stand in the Gorton and Denton by-election was seen as the first step in making a leadership bid.At the time, Burnham insisted he wanted to return to Parliament \"to support the work of the government, not undermine it\" but Labour's National Executive Committee denied him permission to stand saying it would mean \"an unnecessary mayoral election\".Asked on Tuesday if Sir Keir had his full support, Burnham replied: \"Yes, he has my support.\"The government has my support and they had my support when I put myself forward for the by-election.\"He called for \"stability\" in the Labour Party adding: \"Of course stability comes from greater unity and that would be helped by a more inclusive way of running the party but recent events makes that now feel possible.\"Elsewhere, the prime minister received backing from the Welsh First Minister Eluned Morgan.Having stayed quiet on Monday, she put out a statement saying \"the country needs stability in an age of instability\".However, she added that the row over the appointment of Lord Mandelson had been \"deeply troubling\" and that the \"failure must be acknowledged and confronted honestly\". Reflecting on the events of Monday, Energy Secretary Ed Miliband told BBC Breakfast, the Labour Party had \"looked over the precipice\" on Monday but \"thought the right thing to do was to support our leader\".Miliband - a former Labour leader - said Sir Keir had faced \"a moment of peril\" but that cabinet ministers had collectively \"looked at the alternatives of going down this road of a chaotic leadership election, trying to depose a prime minister, and they said that's not for us\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I will never walk away, says Keir Starmer after facing pressure to quit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/19ed/live/8418ae20-06a0-11f1-8d5d-7d6caf00f484.png"
      ],
      "datePublished": "2026-02-10T16:46:25.000Z",
      "dateModified": "2026-02-10T16:46:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Italy win gold in mixed short track speed skating relay",
    "url": "https://www.bbc.com/sport/videos/cx2j50y5q35o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/dc4b/live/decd4730-0688-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T14:06:52.000Z",
    "description": "Italy take gold in the mixed short-track speed skating relay with Canada taking silver, Belgium taking bronze and defending champions China missing ou",
    "body": "Italy take gold in the mixed short-track speed skating relay with Canada taking silver, Belgium taking bronze and defending champions China missing out the podium altogether.Follow live: Winter Olympics 2026Available to UK users only.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Italy win gold in mixed short track speed skating relay",
      "image": [
        "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/dc4b/live/decd4730-0688-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T14:06:52.000Z",
      "dateModified": "2026-02-10T14:06:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pilot praised after landing faulty Somali passenger plane on seashore",
    "url": "https://www.bbc.com/news/articles/c2d1pz3pxewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6057/live/a1375200-069f-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T16:16:30.000Z",
    "description": "4 hours agoAbdinasir AliBBC SomaliWatch: Passenger plane in shallow water after it failed to stop on the runwayAn airline in Somalia has praised one o",
    "body": "4 hours agoAbdinasir AliBBC SomaliWatch: Passenger plane in shallow water after it failed to stop on the runwayAn airline in Somalia has praised one of its pilots after he crash-landed his passenger plane, which had suffered a technical fault, on the shoreline next to the capital's international airport with all 55 on board surviving.Starsky Aviation said the pilot's quick thinking was crucial in saving the 50 passengers and five crew.The crew of the aircraft, a Fokker 50, reported a problem shortly after take off from Mogadishu on Tuesday morning and requested that the plane return, Somalia's Civil Aviation Authority (CAA) said. It then touched down but failed to stop on the runway, overshooting the tarmac before coming to rest in shallow water, the CAA's director Ahmed Macalin Hassan said.AussomThe plane was on its way to Puntland before the pilot requested a return to MogadishuIt is not clear yet exactly what the issue was.The African Union's mission in Somalia said UN and AU troops were \"swiftly deployed\" to help with rescue efforts. Somalia's transport minister was also at the scene, its post on X added.\"We are relieved to confirm that all passengers and crew are safe. Investigations are under way to establish what caused the technical issue that led to the emergency landing,\" Starsky spokesman Hassan Mohamed Aden said.\"The pilot's swift and calm decision-making played a decisive role in ensuring the safety of everyone on board, and we commend him for how he handled the situation,\" he added.Starsky AviationStarsky AviationMogadishu's international airport is right next to the Indian OceanGetty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pilot praised after landing faulty Somali passenger plane on seashore",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6057/live/a1375200-069f-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-10T16:16:30.000Z",
      "dateModified": "2026-02-10T16:16:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]