[
  {
    "title": "Danny Murphy column: 'It can't go on' - how Liverpool's tactics helped brilliant Doku run riot",
    "url": "https://www.bbc.com/sport/football/articles/c8x1w4qvwe4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0799/live/dd94a2e0-bdc8-11f0-ae46-bd64331f0fd4.png",
    "tag": "Trending",
    "date": "2025-11-09T23:54:08.000Z",
    "description": "Jeremy Doku was absolutely brilliant for Manchester City in their 3-0 win on Sunday, but Liverpool's tactics were the reason he was able to run riot d",
    "body": "Jeremy Doku was absolutely brilliant for Manchester City in their 3-0 win on Sunday, but Liverpool's tactics were the reason he was able to run riot down their right.Without Mohamed Salah tracking back, Arne Slot's side were always so vulnerable down that flank and I felt sorry for Conor Bradley, who was trying to stop Doku but had Nico O'Reilly to worry about too.Even if Liverpool had found some better balance, and had a winger who gave Bradley more defensive support or condensed City's space, then with the way Doku was playing he would still have been almost impossible to stop.Doku was a pleasure to watch, irrespective of who you support and who you wanted to win. You had to admire his skill, pace, strength and bravery - and his goal was just amazing.The way Liverpool were set up, though, actually helped him shine.He was electric and the game's star man. This was the best I've seen him play in a City shirt, but Salah not being asked to defend made it so easy for him.It became a really productive area of the pitch for City, and was one of the reasons they won so comfortably in the end.'Liverpool ended up being pulled apart'Media caption, How 'electric' Doku helped Man City 'dismantle' LiverpoolI am really surprised Liverpool's potential problem down the right was not identified before the game.Since he broke into the team a year ago, O'Reilly has been a real positive for City from an attacking perspective and frequently ends up in left wing or even centre-forward areas.So City were always going to look for an overload from him and Doku down that flank, and it was down to Liverpool to deal with it.But because Salah stayed high up the pitch when O'Reilly was flying forward, it left Bradley isolated, and with a dilemma - did he commit and stick with Doku, or drop off him and pick up O'Reilly charging forward instead?Image caption, Salah staying so high meant Bradley (red circle, right) frequently had to deal with two City players - Doku (top blue circle) and O'Reilly (bottom blue circle) running at himAs I explained on Match of the Day, Bradley was caught in between both players a lot because he was unsure what to do, but whatever he did it felt like there was always so much space over there for City to exploit.It was hard for Ryan Gravenberch to do much about it, because if he went out there too early he was only leaving space centrally instead, where the likes of Phil Foden and Rayan Cherki were looking for pockets to get on the ball.Ibrahima Konate tried to help Bradley too, but he was having to cover a lot of distance to get over to support his right-back, and being dragged across meant he left space behind him in the middle as well.Image caption, For the move that led to Doku's goal in the second half, Gravenberch cannot help Bradley (red circle, left) because he is picking up Foden centrally. The ball is played out to O'Reilly (bottom blue circle) running to the edge of the Liverpool area, who finds Doku in space to cut in and bend a beautiful shot into the corner of the netLiverpool ended up being pulled part and, like I say, they must have been aware it could happen before the game.The best opposition, with the best players, find your weakness. Chelsea deliberately targeted Liverpool down the right in the same way a few weeks ago, because they knew the problem with Salah existed - but Sunday turned into an even bigger expose of the issue.It is something that cannot go on. Liverpool cannot allow this to keep happening when they play the top sides, especially away from home where they see less of the ball and have less control of the game.Image caption, More than half of City's attacks came down their left, through Doku and O'Reilly. \"It's a very deliberate ploy,\" said Murphy on MOTD.Other things must have concerned Slot tooA lot of people will say that Liverpool have had success for years without Salah tracking back.While Salah did defend more under Jurgen Klopp, he spoke last season about not being given so much defensive responsibility by Slot and how much he was enjoying that. Let's remember Liverpool won the title with him playing that way.But there's a difference between never doing it and sometimes doing it. Last season, when Liverpool won at Etihad Stadium, Salah's defensive performance was among the best I've seen from him.This time, I think it was maybe down to him to look at how Bradley was having a tough time and decide 'I am going to help him out', even if it was just for 15 minutes or half an hour, to help Liverpool get back in the game.I am not saying Salah should now become a completely different player - you don't want him running back every time you lose the ball, because sometimes you want him ready for the transition where O'Reilly is out of position. Salah almost got in a few times like that on Sunday, because of his pace, but there has to be balance.In a game like this one, where you are 20 minutes in and Doku has been running your right-back ragged, then you could drop in for a spell even if you've been told you don't have to. I don't understand why he didn't do it at all.Image caption, Doku was the top player in the match for shots on target, touches in the opposition box, dribbles completed, duels won and fouls wonDecisions did not cost Liverpool the gameThat failure to try to fix things during the game was another disappointing part of Liverpool's display, but there were plenty of other things that must have concerned Slot too.Especially in the first half, they did not press particularly well. They lacked tenacity without the ball and seemed slow when they were in possession. In both areas, they were well below the level we saw in their previous two games against Aston Villa and Real Madrid.Now, of course they played a huge game on Tuesday against Real, one of the best teams in Europe, and put every bit of effort in to get a positive result.I get that, but City also played in the Champions League, a day later, so I don't believe Liverpool can use the Real game as an excuse.Media caption, Liverpool 'completely dominated' by Manchester City in first half, says SlotIf Virgil van Dijk's equaliser against City had been allowed to stand then I suppose things might have been different - Liverpool had started really poorly but moments like that can change momentum in games.I still think it was a poor decision, even when you break down the laws behind it, because Andy Robertson did not affect Gianluigi Donnarumma, but I would emphasise that decision did not cost Liverpool the game - City dominated them in all departments.Are Liverpool still in title race?Media caption, Guardiola beaming after win over Liverpool in 1,000th game as a managerThis result meant a good week for Slot ended badly, especially regarding the Premier League title race.The defeat is not quite as damaging as it could have been, because leaders Arsenal drew on Saturday and dropped points.But Liverpool are still eight points behind the Gunners and the biggest observation for me so far this season is that they are not consistently playing well enough to be able to think they can close that gap.This is a challenging time for Slot and his players but it is so early in the campaign, and there is plenty of time for them to bounce back and find some balance and rhythm, and cut out the mistakes.At the moment, though, all that feels like it is a long way off.City were not just the better team on Sunday who created the better chances, they were dominant for most of the game. Since their blip in August when they lost back-to-back games, they have looked really strong.At the moment Pep Guardiola's side are the ones who look most likely to compete with Arsenal for the title, while Liverpool need to find a way of becoming harder to beat.Danny Murphy was speaking to BBC Sport's Chris Bevan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danny Murphy column: 'It can't go on' - how Liverpool's tactics helped brilliant Doku run riot",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0799/live/dd94a2e0-bdc8-11f0-ae46-bd64331f0fd4.png"
      ],
      "datePublished": "2025-11-09T23:54:08.000Z",
      "dateModified": "2025-11-09T23:54:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct7151?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·07 Nov 2025,·26 minsAvailable for over a yearThe man Donald Trump has called a \"great leader\", and who has long provoked admiration in MAGA circles, suddenly finds himself in an unusual position – at odds with the US president on an issue of critical importance. \nViktor Orban, Hungary’s prime minister, is visiting the White House on Friday to try to resolve a dispute over Russian oil and gas. Orban wants to keep buying it, but Trump wants countries to wean themselves off Russian energy and help put the brakes on Russia’s war in Ukraine. Will Trump choose to keep an old friend close, or put pressure on Putin? We speak to Nick Thorpe, the BBC’s correspondent in Budapest, who has covered Orban since the 1980s. \nProducer: Viv Jones \nExecutive producer: James Shield \nSenior news editor: China Collins \nMix: Travis Evans  \nPhoto: U.S. President Donald Trump and Hungarian Prime Minister Viktor Orban. Suzanne Plunkett, Reuters.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg"
      ],
      "datePublished": "2025-11-07T10:00:00.000Z",
      "dateModified": "2025-11-07T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mf970z?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-07T11:38:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·07 Nov 2025,·30 minsThe Week: Mistaken Prisoner Releases and Tax Rises Are Coming?NewscastAvailable for over a yearToday, after another two prisoners were mistakenly released from prison - why is the justice system failing and who is to blame?\nJustice Secretary David Lammy is under increasing pressure after details have emerged that two more prisoners have been wrongly released. Why didn’t Mr Lammy explain the situation when he was speaking during PMQs? And what has gone wrong?\nPlus, after a week where it has become increasingly clear more tax rises are expected at the budget - what is the chancellor’s plan?\nAdam and Chris are joined by the head of the Institute for Fiscal Studies Helen Miller and Luke Tryl from More in Common. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-07T11:38:00.000Z",
      "dateModified": "2025-11-07T11:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-10T06:07:50.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-10T06:07:50.000Z",
      "dateModified": "2025-11-10T06:07:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homelessness figures higher than data suggests, research shows",
    "url": "https://www.bbc.com/news/articles/c0ex5r4q82qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c44e/live/3be26b00-bbbe-11f0-b372-073abfdb1a21.jpg",
    "tag": "Trending",
    "date": "2025-11-10T01:39:07.000Z",
    "description": "7 hours agoJack FenwickPolitical correspondentThe number of homeless people in England is higher than official government data suggests, according to ",
    "body": "7 hours agoJack FenwickPolitical correspondentThe number of homeless people in England is higher than official government data suggests, according to new research from the charity Crisis.They say that around 189,000 families and individuals who faced the worst forms of homelessness such as rough sleeping, sofa surfing and living in tents were not included in official statistics.Official data is based on people declaring themselves as homeless to a local authority, which Crisis says often does not happen.The government says it is investing £1bn in homelessness services in 2025/26, a £316m increase on the previous year.The charity says the number of people facing the worst forms of homelessness has grown by a fifth since 2022 and now stands at around 300,000.They say that one of the drivers behind the figures is a large increase in the number of people housed in unsuitable temporary accommodation.When someone declares as homeless to the local authority, they can be placed in temporary accommodation while they search for a permanent home.The research from Crisis, which was produced by Herriot-Watt University, says the number of households placed in unsuitable temporary accommodation has jumped from 19,200 in 2020 to 46,700 in 2024.Unsuitable temporary accommodation can include unsafe B&Bs and properties far away from family and friends.They say an additional 18,600 families are living in \"unconventional accommodation\" such as cars, sheds and tents.Crisis says that many of the people included in their research do not meet the threshold set by government and councils to be eligible for homelessness support, such as those sleeping on friends' sofas.Isra came to the UK in 2009 aged six, after her parents fled war in Iraq.For most of her childhood, her family was housed in more than 10 different temporary accommodation locations around London, which she says were often unsuitable.Isra says she and her siblings were sometimes sleeping four to a room and that the places they were housed in were often infested with rats.She says she remembers her mother \"sifting through bags of rice because there were so many rats, we'd found rat droppings in our food\".Isra says the conditions she and her family lived in made it difficult to make friends at school or focus on her studies.Matt Downie, the chief executive of Crisis, said the findings of his organisation's research required a \"rapid response\" from the government.He said: \"No one should be forced to live in unsafe conditions, whether it's children in poor-quality B&Bs or people having to sleep on the streets, in tents or in squats.\"Government data released last month found that almost 330,000 households were at risk of homelessness in 2024, but these figures included people housed in suitable temporary accommodation and others who did not ultimately lose their current accommodation.Last month the government announced a £84m cash boost to help prevent homelessness this winter.Labour's election manifesto last year promised to implement a new homelessness strategy.It said a Labour government would \"develop a new cross-government strategy, working with mayors and councils across the country, to put Britain back on track to ending homelessness\".Some Labour figures have become concerned that no such strategy has yet been launched, but it is expected to happen before the end of the year.A survey of local councils conducted as part of the Crisis research found that 70% had seen an increase in the numbers of people approaching them for homelessness assistance in the last year.A government spokesperson said: \"Everyone deserves a safe place to call home, which is why we are investing more than £1bn in homelessness services and launching a homelessness strategy to tackle this issue.\"This is alongside accelerating efforts to tackle the root causes of homelessness by abolishing Section 21 'no fault' evictions, and expanding access to safe accommodation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homelessness figures higher than data suggests, research shows",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c44e/live/3be26b00-bbbe-11f0-b372-073abfdb1a21.jpg"
      ],
      "datePublished": "2025-11-10T01:39:07.000Z",
      "dateModified": "2025-11-10T01:39:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'BBC bosses quit in disgrace' and 'Tears of the crown'",
    "url": "https://www.bbc.com/news/articles/cyv82ngegdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1acb/live/c35243f0-bdc9-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-10T01:03:02.000Z",
    "description": "7 hours agoThe resignations of BBC director general Tim Davie and his head of news Deborah Turness dominate Monday's papers. \"BBC bosses quit in disgr",
    "body": "7 hours agoThe resignations of BBC director general Tim Davie and his head of news Deborah Turness dominate Monday's papers. \"BBC bosses quit in disgrace\" is the Daily Mail's headline. The broadcaster has been under fire over a Panorama documentary that was accused of misleadingly editing a speech by Donald Trump to make it look like he was urging people to attack the US Capitol. The paper quotes Davie's statement saying \"mistakes have been made and as director general I have to take ultimate responsibility\".The Daily Telegraph describes the double resignations as the BBC's \"biggest crisis in more than a decade\". The paper also features comments by Conservative leader Kemi Badenoch, saying it was right that the BBC bosses had \"finally taken responsibility\". In her parting statement, Turness says: \"While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.\"\"Feels like a coup\", says one BBC source quoted by the Guardian. The paper reports that sources within the corporation are describing a \"mood of dismay\" at Turness' exit, as the hunt begins now to fill \"two of the biggest roles in British media\".The i Paper leads with \"BBC bosses quit over botched Trump film\". The paper says the White House is gloating that Trump \"forced out\" the corporation's director general.The Sun follows with the US president's reaction to the news of Davie and Turness' exits. Posting on Truth Social, Trump writes: \"The TOP people in the BBC, including TIM DAVIE, the BOSS, are all quitting/FIRED, because they were caught \"doctoring\" my very good (PERFECT!) speech of January 6th.\"\"Death by a thousand cuts\" is how insiders describe Davie's departure, the Times reports. The paper says a number of issues including complaints over the BBC's coverage of Gaza and trans issues contributed to Davie's resignation. \"Furore over Trump documentary\" says the Financial Times. The paper reports that Davie and Turness' resignations come as the BBC is set to apologise to MPs over the Panorama documentary on Monday.\"Boss quits over BBC doctoring of Trump speech\" is the Daily Express's take. Elsewhere, the paper features King Charles III and Catherine, Princess of Wales, attending Remembrance Day tributes on Sunday. A photo of the princess wiping away a tear during the event shares the top spot.\"Tears of the crown\" is the Metro's headline. A photo of the King saluting at the Cenotaph fills the front page as the paper reports on his \"emotional\" tribute to those who died serving in the two world wars and other conflicts.\"Crisis at the Beeb\" says the Daily Mirror. The paper also previews an exclusive on TV presenter Caroline Flack, who took her own life in 2020 while she was facing trial for allegedly assaulting her boyfriend. The Mirror quotes an ex-Crown Prosecution Service chief who says Flack \"should never have been charged\".The Daily Star profiles \"Britain's tallest Tory\" who the paper says is vowing to become a \"giant of politics\". James McAlpine towers on the paper's front page, standing at 7ft 2in (219cm) tall.Finally, the Independent splashes on their campaign to support missing young people. The paper is pairing up with charity Missing People for a new SafeCall service that will provide a lifeline for those affected by the disappearance of a child.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'BBC bosses quit in disgrace' and 'Tears of the crown'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1acb/live/c35243f0-bdc9-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T01:03:02.000Z",
      "dateModified": "2025-11-10T01:03:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China exempts Nexperia chips from export controls",
    "url": "https://www.bbc.com/news/articles/c0rp2514g4qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7af5/live/be7b5b50-b6d5-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-11-10T07:02:17.000Z",
    "description": "1 hour agoNick Edser,Business reporter and Peter Hoskins,Business reporterChina has lifted export controls on computer chips vital to car production, ",
    "body": "1 hour agoNick Edser,Business reporter and Peter Hoskins,Business reporterChina has lifted export controls on computer chips vital to car production, the country's commerce ministry said on Sunday.Exemptions have been granted to exports made by Chinese-owned Nexperia for civilian use, it said, which should help carmakers who had feared production in Europe would be hit.At the same time, China has also paused an export ban to the US of some materials that are crucial in the semiconductor industry and suspended port fees for American ships.The moves mark an easing of trade tensions between Beijing and Washington after President Xi Jinping and his US counterpart Donald Trump agreed in October to reduce tariffs on each other and pause other measures for a year.In October, the Dutch government took control of Nexperia, which is based in the Netherlands but owned by Chinese company Wingtech, to try to safeguard the European supply of semiconductors for cars and other goods.In response, China blocked exports of the firm's finished chips. However, it said earlier this month it would begin easing the ban as part of a trade deal struck between the US and China.While Nexperia is based in the Netherlands, about 70% of its chips made in Europe are sent to China to be completed and re-exported to other countries.When it took control of the company, the Dutch government said it had taken the decision due to \"serious governance shortcomings\" and to prevent the company's chips from becoming unavailable in an emergency.But when China blocked exports of chips from Nexperia, there were worries that it could create global supply chain issues.In October, the European Automobile Manufacturers' Association (EMEA) had warned Nexperia chip supplies would only last a few weeks unless the Chinese ban was lifted.Earlier this month, the EMEA's director general Sigrid De Vries told the BBC that \"supply shortages were imminent\".Volvo Cars and Volkswagen had warned that a chip shortage could lead to temporary shutdowns at their plants, and Jaguar Land Rover also said the lack of chips posed a threat to its business.But on Saturday, EU trade commissioner Maros Sefcovic announced in a post on X that China had agreed to \"the further simplification of export procedures for Nexperia chips\" and it would \"grant exemption from licensing requirements to any exporter\" provided the goods were for \"civilian use\".\"Close engagement with both the Chinese and Dutch authorities continues as we work towards a lasting. stable predictable framework that ensures the full restoration of semiconductor flows.\"In its statement, China's commerce ministry called on \"the EU to continue exerting its influence to urge the Netherlands to correct its erroneous practices as soon as possible.\"Prof David Bailey from Birmingham University's business school told the BBC's Today programme that the actions of China were a \"wake-up call\" for the motor industry.\"The Dutch government may well have had good reasons to try and take control but it hadn't thought through the implications of that,\" he said. \"The retaliation from China was swift and it was brutal.\"He said there was a need to find alternative processing sites, \"maybe in south east Asia, or Europe\", and for the industry to keep bigger stocks of its products in case of shortages.Meanwhile, the suspension of a ban on exports of \"dual-use items\" related to gallium, germanium, antimony and super-hard materials to the US came into effect on Sunday and will be in place until 27 November, 2026.The ban on the exports of goods and materials that can have both civilian and military uses was announced in December 2024.China's transport ministry also said port fees charged on US-linked ships would be suspended for a for a year, effective 0501 GMT Monday.On Friday, China also announced the suspension of other export controls related to expanded curbs on some rare earth materials and lithium batteries.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China exempts Nexperia chips from export controls",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7af5/live/be7b5b50-b6d5-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-10T07:02:17.000Z",
      "dateModified": "2025-11-10T07:02:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hadar Goldin: Israel receives body of soldier killed in 2014",
    "url": "https://www.bbc.com/news/articles/c2kp3yjy8q7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b414/live/643bc910-bd6d-11f0-abab-df46b9caffa5.png",
    "tag": "Trending",
    "date": "2025-11-09T19:41:15.000Z",
    "description": "13 hours agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Gold",
    "body": "13 hours agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Goldin, a soldier killed in an ambush by Hamas in 2014 and whose body has been held in Gaza since then.The Israeli military said Lt Goldin, who was 23 when he died, was formally identified and will now be buried. He left behind parents, a sister, two brothers, and a fiancée.Hamas's armed wing had said on Sunday that it would hand over Lt Goldin's body as part of a ceasefire deal.Hamas has now returned all 20 living hostages, and 24 out of 28 deceased hostages under the first phase of the deal.On Sunday, Lt Goldin's father Simcha Goldin said in a statement: \"Victory means bringing home the hostages and bringing home our soldiers to Israel.\"Israeli Prime Minister Benjamin Netanyahu and President Isaac Herzog both said they had kept a picture of Lt Goldin in their offices for the past 11 years. Netanyahu said \"we didn't give up\" on bringing him home.\"I know the agony that his family's been through, I know the longing for his return that united the people of Israel and today we're united in bringing him finally to his parents, to his family, to a grave in Israel.\"Efforts to retrieve Lt Goldin \"involved extensive intelligence efforts, alongside operational activities on the ground\" over the past decade and during the last two years of war between Israel and Hamas, the Israel Defense Forces (IDF) said.The military expressed \"deep condolences to the family and continues to make every effort to return all the deceased hostages and is prepared for the continued implementation of the agreement\".Herzog said the government would \"continue to act tirelessly\" to bring home all the hostages.Of the four hostages who remain in Gaza, three are Israeli and one is Thai.ReutersLt Goldin, from Kfar Saba, is the only deceased hostage whose remains were being held in Gaza before the Hamas-led 7 October 2023 attack on Israel, which sparked the latest war. He was killed in combat on 1 August 2014, not long after the start of a ceasefire in that year's war between Israel and Hamas. He was among a group of Israeli soldiers patrolling an agricultural area near Rafah in southern Gaza when they were attacked by a group of Hamas fighters. The Israeli military determined that Lt Goldin was killed along with two other soldiers in a firefight, and that his body was then dragged into an underground tunnel by the Hamas fighters.The Israeli military unleashed massive firepower to try to prevent Hamas from taking Lt Goldin hostage. Scores of Palestinian civilians were killed in the bombardment of Rafah, which continued for four days, including after Lt Goldin was declared dead.Nine years later, the Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage. At least 69,176 people have been killed by Israeli attacks in Gaza since then, according to the Hamas-run health ministry, whose figures the UN considers reliable.During the ongoing first phase of a US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in its jails and 1,718 detainees from Gaza.Before Lt Goldin's body was returned, Israel had also handed over the bodies of 300 Palestinians in exchange for the bodies of 20 Israeli hostages returned by Hamas, along with those of three foreign hostages - one of them Thai, one Nepalese and one Tanzanian.The parties also agreed to an increase of aid to the Gaza Strip, a partial withdrawal of Israeli forces, and a halt to fighting, although violence has flared up as both sides accused one another of breaching the deal.On Saturday in Gaza, two Palestinians were killed by Israeli fire. The Israeli military said two people had crossed the yellow line marking the line of Israeli control and posed an \"immediate threat\".Separately, one Palestinian was shot dead in Gaza by Israeli fire and another was wounded on Saturday, local medics and the Israeli military said.Gazan medical officials said the person who died was killed by Israeli fire east of Bureij refugee camp in central Gaza. Civil defence rescuers said the injured Palestinian was wounded by Israeli gunfire in Khan Younis.Israeli military actions have killed at least 241 people since the start of the ceasefire, according to the Gaza health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hadar Goldin: Israel receives body of soldier killed in 2014",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b414/live/643bc910-bd6d-11f0-abab-df46b9caffa5.png"
      ],
      "datePublished": "2025-11-09T19:41:15.000Z",
      "dateModified": "2025-11-09T19:41:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
    "url": "https://www.bbc.com/news/articles/c5ylx0g6w76o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png",
    "tag": "Trending",
    "date": "2025-11-09T22:09:39.000Z",
    "description": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so ea",
    "body": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so easy to steal, another mystery remained: who the \"fedora man\" was.The dapper youth in a hat was photographed outside the museum that Sunday and went viral on social media, prompting theories about his identity.Police moved swiftly to arrest and charge four people for the crime, while the Louvre director admitted CCTV security was inadequate.However, the fedora man remained an enigma - until now.The dandy, it turns out, is a local teenage fan of Sherlock Holmes and Hercule Poirot who just happened to be at a real crime scene.Pedro Elias Garzon Delvaux, a 15-year-old from Rambouillet, south-west of Paris told the Associated Press (AP) news agency that he had planned to visit the Louvre with his family but found the museum was closed. \"We didn't know there was a heist,\" he said.As he asked officers about the closure, an AP photographer seeking to capture the security cordon took a picture and included Pedro in the frame.Pedro only realised the photo had gone viral four days later, when a friend sent him a screenshot asking: \"Is that you?\"When he replied that it was, the friend said he had five million views on TikTok. \"I was a bit surprised,\" Pedro told the AP.He was even more shocked when his mother called to say the picture had appeared in The New York Times. It made a big impact on him, he said, because he reads that newspaper and \"it's not every day you're in the New York Times\". \"People said, 'You've become a star'. I was astonished that just with one photo you can become viral in a few days.\"Asked why he wore an old-fashioned waistcoat and a fedora to the museum, Pedro said he began dressing this way recently, inspired by 20th-century statesmen and fictional detectives.\"I like to be chic,\" he told the AP. \"I go to school like this.\"As wild speculation about the photo of him circulated online - some wondered whether he might be a real detective or an AI fake - Pedro remained silent for weeks.\"I didn't want to say immediately it was me,\" he said. \"With this photo there is a mystery, so you have to make it last.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png"
      ],
      "datePublished": "2025-11-09T22:09:39.000Z",
      "dateModified": "2025-11-09T22:09:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sex schedules and other people: How I keep my relationship alive",
    "url": "https://www.bbc.com/news/articles/cj97rd0zvejo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/288c/live/2ba548f0-bafd-11f0-9758-995af3ef9daa.jpg",
    "tag": "Trending",
    "date": "2025-11-10T01:55:58.000Z",
    "description": "6 hours agoYasmin RufoBBC News Nell FrizellBetween deadlines, school runs and the constant \"what's for dinner?\" chat, even the best relationships can ",
    "body": "6 hours agoYasmin RufoBBC News Nell FrizellBetween deadlines, school runs and the constant \"what's for dinner?\" chat, even the best relationships can start running on autopilot.It doesn't mean the spark has gone or that you've stopped loving your partner, but rather that life has got in the way.Writer Nell Frizzell knows this all too well - after 10 years with her partner and two young children, she admits she doesn't have as much time or energy for her husband as she once did.\"I know we're told to focus on quality time, physical touch and gaze into each other's eyes lovingly but actually I am shouting at my husband to turn the eggs off.\" Frizzell says she's at a \"crunch point\" in her life. Her time, body and attention are being pulled in every direction - she's raising children, caring for elderly parents, running the home and working all at the same time.\"And within all of that, where do you have the time to look into someone's eyes and say you're wonderful?\" she asks.Bring other people inBut Frizzell has discovered something that helps keep her relationship connection alive - something she calls a \"third energy\".Not in the bedroom, she laughs, but at the dinner table.\"If we go away, we go with another family and if we go out to dinner, I love having friends there,\" she explains.It's a surprisingly simple idea - but Frizzell says having dinner with another couple, friends or family really does work as the presence of other people naturally changes the dynamic.She says sometimes a so-called date night \"where you're sat across the table with the person you live with and trying to come up with something new to say\" can be intense, so another person can help provide a new conversation starter or a fresh perspective.Frizzell says: \"I find him incredibly attractive when we're with people we don't see all the time as they ask him questions I wouldn't think to ask or tell him things I wouldn't tell him.\"Getty ImagesPsychotherapist Susanna Abse says a little space and variety can be vital to a successful relationship.\"Couples can end up moving around each other but avoiding real contact,\" she says.Truly noticing your partner can make a big difference.  \"Instead of coming downstairs in the morning and getting on with millions of chores, see what state your partner is in.\" Abse recommends asking them questions like how they are feeling or what their day looks like as \"curiosity is key\". Clinical psychologist Dr Amani Milligan says spending quality time together is also important.That doesn't mean a grand gesture and Dr Milligan says it can be as simple as taking a random Thursday off work together or setting rules like no phones before bed so you can catch up on each other's days.Relationships can come with endless distractions from emails and notifications on your phone to endless piles of laundry or dishes that need sorting.Abse says electronic devices can make couples more distant.\"Protest if your partner is on their phone all the time and set some rules you can both agree to.\"Schedule sexIt's near impossible to talk about keeping love alive without mentioning physical intimacy and Frizzell swears by scheduling it.\"It might feel administrative to say 'this is when we'll have sex' but with small children, it's absolutely key and it's something to look forward to.\"Abse agrees with that practical approach and says if you're not having sex \"you have to recognise the risk in that\" if you're both not happy with the arrangement as \"affairs often arise from unsatisfied needs\".When we're time poor or have a lot on, sex can be one of the first things to go but Abse says you should try to \"allow yourself to be persuadable\".\"You don't get into bed feeling very sexual but maybe with your partner's attention that might change.\"Focusing more on each other and seeing her partner anew has improved Frizzell's relationship.The final lesson she has learnt is that it's important to keep a little mystery from each other. \"Close the toilet door and have a bit of separation - by all means have a joint project but that shouldn't be going to the loo,\" she laughs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sex schedules and other people: How I keep my relationship alive",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/288c/live/2ba548f0-bafd-11f0-9758-995af3ef9daa.jpg"
      ],
      "datePublished": "2025-11-10T01:55:58.000Z",
      "dateModified": "2025-11-10T01:55:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US Senate passes deal aimed at ending government shutdown ",
    "url": "https://www.bbc.com/news/articles/cpd2p2eddnzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7343/live/64dcf730-bdd2-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-10T05:56:44.000Z",
    "description": "2 hours agoAna FaguyReporting from Washington DCA deal aimed at ending the US government shutdown has passed the Senate, paving the way for the record",
    "body": "2 hours agoAna FaguyReporting from Washington DCA deal aimed at ending the US government shutdown has passed the Senate, paving the way for the record-breaking impasse to be broken.After a weekend of negotiations in Washington, a minority of Democrats joined with Republicans and voted in favour of an agreement. The vote is a procedural first step towards passing a compromise to fund the government since it ran out of money 1 October.It will need to clear several more hurdles - including a vote from the House of Representatives - before federal employees and services return, but it is the first serious sign of progress after 40 days of deadlock. The current shutdown is the longest on record in the US, and until this weekend it appeared that Republican and Democratic lawmakers were locked in a stalemate. Many government services have been suspended since October, and around 1.4 million federal employees are on unpaid leave or working without pay. The shutdown has also has wide ranging impacts on a variety of services, including US air travel and food benefits for 41 million low-income Americans. Shutdown could reduce US flights 'to a trickle', transport secretary warnsFive ways US government shutdown is hurting - and why it's about to get worseThe agreement was negotiated between Senate Majority Leader John Thune and the White House, with Democratic senators Jeanne Shaheen and Maggie Hassan of New Hampshire, and Angus King of Maine, an independent who caucuses with the Democrats.Republicans - who hold a 53-47 majority in the Senate - needed the measure to clear a 60-vote minimum threshold.They were able attract eight votes from the other side of the aisle, while losing just one in Kentucky Senator Rand Paul, who voted against after saying the bill would increase national debt.The deal includes an agreement for a vote in December on extending healthcare subsidies that are due to expire this year, a key issue Democrats had been holding out for concessions on. Democratic Party leaders had said that they would not lend their support to new funding for government operations until Congress addressed the subsidies that help tens of millions of Americans pay for health insurance purchased through government-run exchanges.\"I'm thankful to be able to say we have senators, both Democrats and Republicans, who are eager to get to work to address that crisis in a bipartisan way,\" Senate Majority Leader John Thune said ahead of the vote.\"We also have a president who is willing to sit down and get to work on this issue. So I'm looking forward to seeing what solutions might be brought forward.\"Thune did not say exactly what that bill would contain, which frustrated many Democrats in the House and the Senate, who argued that the Democrats who negotiated the deal did so without getting enough in return. \"For months and months Democrats have been fighting to get the Senate to address the healthcare crisis,\" said Chuck Schumer, the party's leader in the Senate. \"This bill does nothing to ensure that that crisis is addressed,\" he said as he confirmed he would vote against the deal.Some high-profile Democrats have been highly critical of colleagues who sided with Republicans to end the shutdown without concrete guarantees on healthcare, with California Governor Gavin Newsom calling the decision \"pathetic\". The measure also includes three appropriations bills to fund agencies like veterans affairs and agriculture, as well as a continuing resolution to finance the rest of the government until 30 January - meaning another government shutdown could be on the horizon early next year.It also includes guarantees that all federal workers will be paid for time during the shutdown, and funding for the Supplemental Nutrition Assistance Program (Snap) - an essential food safety net for one in eight Americans - until next September.A vote on the deal would only be the first procedural step in the new funding agreement and it would still need to be approved by the US House of Representatives, where it is likely to see its own challenges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US Senate passes deal aimed at ending government shutdown ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7343/live/64dcf730-bdd2-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T05:56:44.000Z",
      "dateModified": "2025-11-10T05:56:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Child benefit: HMRC to review thousands of suspended payments",
    "url": "https://www.bbc.com/news/articles/cjr0p4l2qryo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/14da/live/1b15a7c0-bd76-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-09T18:41:10.000Z",
    "description": "14 hours agoEimear DevlinBBC Money Box reporterThe UK's tax body is reviewing its decisions to strip child benefit from about 23,500 claimants after i",
    "body": "14 hours agoEimear DevlinBBC Money Box reporterThe UK's tax body is reviewing its decisions to strip child benefit from about 23,500 claimants after it used travel data to conclude they had left the country permanently.Normally the benefit runs out after eight weeks living outside the UK, but many people affected complained that HM Revenue & Customs (HMRC) had stopped their money after they went on holiday for just a short time.The move came after MPs on the Treasury Select Committee demanded answers from the tax authority.HMRC has apologised for any errors and says anyone who thinks their benefits have been stopped incorrectly should contact them.A government spokesperson said: \"We're very sorry to those whose payments have been suspended incorrectly. \"We have taken immediate action to update the process, giving customers one month to respond before payments are suspended. We remain committed to protecting taxpayers' money and are confident that the majority of suspensions are accurate.\"In September, the government began a crackdown on child benefit fraud which it believes could save £350m over five years.The new system allows HMRC records to be compared with Home Office international travel data, and the tax authority had used this data to stop payments to thousands of families.But it is now reviewing all of the cases following a growing number of complaints from people affected who said they had been on holiday, and had returned to the UK after a short time.Eve Craven went on a five-day break with her son to New York. She told the BBC's Money Box programme that about 18 months after the trip she received a letter saying the child benefit for her son had been stopped.The letter cited her trip to the US, saying it had no record of her return.\"It gave me a month basically to give them all the requested information to prove that I'd come back to the UK,\" she said.\"It's just a very big ask for something that they've messed up on, and they should have been able to sort out themselves.\"Eve's child benefit has now been reinstated with missing payments backdated.The issue was first identified in Northern Ireland, where some families had flown out of the UK from Belfast, but then returned to Dublin – which is in the EU - before driving home over the border.UK and Irish citizens can travel freely into each other's countries under the Common Travel Area arrangement.There are no routine passport checks when travelling through the border between Northern Ireland and the Republic of Ireland, meaning the UK government has no data to show that someone may have returned to Northern Ireland.It is not clear how many errors have been made in total, or how.HMRC told Money Box it would be reviewing all past cases \"using PAYE data and where continued UK employment is found, will be reinstating payments and making any back payments necessary\".It is aiming to complete its review by the end of next week.MPs on the Treasury Select Committee are also now investigating.Additional reporting by Nick Edser",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Child benefit: HMRC to review thousands of suspended payments",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/14da/live/1b15a7c0-bd76-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-09T18:41:10.000Z",
      "dateModified": "2025-11-09T18:41:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Katie Razzall: A seismic moment that shows rift at top of BBC",
    "url": "https://www.bbc.com/news/articles/c07m2v1z4evo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1eeb/live/ff91e660-bdfe-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-09T23:30:53.000Z",
    "description": "9 hours agoKatie RazzallCulture and Media EditorA look back at how Tim Davie dealt with BBC scandals over the yearsThis is seismic. To lose both the d",
    "body": "9 hours agoKatie RazzallCulture and Media EditorA look back at how Tim Davie dealt with BBC scandals over the yearsThis is seismic. To lose both the director general and the CEO of BBC News at the same time is unprecedented. It's an extraordinary moment in the history of the BBC.It can't be underestimated.On the face of it, Tim Davie's resignation makes some sense.I have wondered for some time whether he was weighing up how much longer he wanted to stay in a job that is highly pressurised. There have been occasions when I have interviewed him this year, as the controversies mounted, and he didn't seem his usual Tigger-ish self.In his resignation statement he referenced \"the very intense personal and professional demands of managing this role over many years in these febrile times\". My assessment is that the latest controversy felt one too many after a succession of crises (two Gaza documentaries, the Bob Vylan Glastonbury issue amongst them) and he didn't have enough oil in the tank for another fight.As former head of BBC comms, John Shield put it to me \"the DG job is one of the hardest in public life\". \"It has been relentless for him. He is a very capable leader who has driven real change, but at some point it becomes unsustainably attritional.\"I'm told there was still real shock when Tim Davie shared his decision with colleagues over the weekend.Deborah Turness' statement makes clear she has resigned on a point of principle. With the ongoing controversy around the President Trump Panorama causing damage to the BBC, she said \"the buck stops with me - and I took the decision to offer my resignation to the director general last night\".But, as with any resignation, and certainly with two, I can't help thinking there is more to this than meets the eye. And there is another story emerging about the functionality and make up of the BBC Board and its role in what has happened.It appears there has been a rift between the Board and the news division with some arguing the BBC has, for too long, failed to address institutional bias inside the BBC and others questioning whether what's unfolded has been an orchestrated - and politicised - campaign against the corporation which has claimed two big scalps.For the best part of a week, since the Telegraph first broke its story, I haven't been able to understand why the BBC did not get on the front foot in the face of a deluge of damaging headlines about claims of systemic bias.It needed to divide the allegations into two distinct stories. The first, about the edit of the Trump speech in the Panorama programme, needed addressing immediately. Either with a swift apology - or indeed a case made for why the BBC believed it had not mischaracterised the president's words.That would have allowed the BBC to come out fighting more widely on behalf of its journalism. Remember, it was being accused of institutional bias. Of a lack of impartiality. Accusations that cut to the heart of its news operation.With an apology for the mistake around the Panorama (or a robust defence), it could have gone on to try to refute the other claims about institutional bias. It could have said that the BBC had already been taking action to ensure editorial impartiality, and had already acted, for example, on issues at BBC Arabic.Instead the BBC allowed the story to fester - and we ended up in a situation where the Trump White House was calling the BBC \"fake news\" and it had some traction.My understanding from multiple sources inside the BBC is that a statement on Panorama had been ready to go for days. The BBC planned to say on the Trump edit that it hadn't intended to mislead the public, but that in light of looking at it again, it believed there should have been some kind of white flash or wipe, to make clear to audiences that these were two distinct parts of the speech.I understand Deborah Turness became more and more angry and frustrated as the week went on because she was prevented by the Board from putting out that apology.Instead the BBC Board decided a letter to the Culture Media and Sport Committee was the way to go. (Others have told me it's not as clearcut as this characterisation. That it took some time for news bosses to accept the Panorama edit had been an error and that there were discussions on all sides on how to respond.)Tim Davie pictured in 2016, before he took over as director generalMany, both inside and outside the BBC, see the failure to respond as a grave mistake. The Telegraph's drip feed of allegations was damaging - and the BBC wasn't tackling them head on.I have been told that Turness then went into a board meeting on Thursday to discuss the crisis around the Telegraph stories and was \"ripped apart\", as some have described it.Those who have called the BBC's journalism into question would call that accountability.But another source characterised it as the culmination of a \"relentless critique of BBC journalism over two years by members of the Board and advisers - all of whom come from same political persuasion\".They point to Sir Robbie Gibb, a former BBC editor who left to become Downing St director of communications for Theresa May and who is now a member of the Board.The former Sun editor, now BBC presenter David Yelland has called it \"nothing short of a coup\". He claims the BBC Board has been undermined and \"elements close to it have worked with hostile newspaper editors, a former PM and enemies of public service broadcasting\".But another former Sun editor, Kelvin MacKenzie, had a very different take. Speaking on the BBC News Channel, he said the resignations were \"the right thing to do - this was an issue that was never going away\".The editing of the speech, he said, could have led to Trump suing or the BBC being banned from the White House. \"If you can't be trusted on that [the speech of the US president] what can you be trusted on?\" he said.And the US president himself has weighed into the debate for the first time. In a post on his Truth Social platform, he celebrated the resignations and accused the BBC of \"doctoring\" his speech and \"trying to step on the scales of a presidential election\".I'm struck by a line in Tim Davie's statement. He said this about the BBC: \"We should champion it, not weaponise it.\"Tonight, some are asking whether the resignations of both the director general and the CEO of News suggests the BBC has been weaponised.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Katie Razzall: A seismic moment that shows rift at top of BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1eeb/live/ff91e660-bdfe-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-09T23:30:53.000Z",
      "dateModified": "2025-11-09T23:30:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "A Kremlin target? Exiled Church figure Hilarion hits back at claims of spying",
    "url": "https://www.bbc.com/news/articles/cj6n0k4x68no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/35cd/live/2df99320-bc03-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-10T00:32:23.000Z",
    "description": "8 hours agoNick ThorpeBudapest correspondentNick Thorpe/BBCNo reason for Metropolitan Hilarion's exile from Russia was given, but many observers blame",
    "body": "8 hours agoNick ThorpeBudapest correspondentNick Thorpe/BBCNo reason for Metropolitan Hilarion's exile from Russia was given, but many observers blame his views on the war in Ukraine\"I have never worked for any intelligence [agency], be it Russian or any other. I have never had any tasks or duties or requests on their part,\" says the former head of foreign relations of the Russian Orthodox Church, Metropolitan Hilarion.Hilarion has broken his silence after a series of allegations levelled against him by a former aide.\"Working for the Church is not compatible with working for intelligence. Those are two very different allegiances,\" he told the BBC.Metropolitan Hilarion was for many years a high-flyer in the Church and seen as likely successor to Patriarch Kirill. He fell from grace very quickly after Russia's full-scale invasion of Ukraine in 2022 and was sent into exile in Hungary.No reason was ever given but close observers of the Orthodox Church were in little doubt. Patriarch Kirill warmly embraced Vladimir Putin's war, but Hilarion neither blessed nor opposed it.In Putin's Russia, where criticism of the war is a criminal offence, such a stance from a top clergyman was enough to lose Hilarion his job.SPUTNIK/KREMLIN POOL/EPA/ShutterstockPatriarch Kirill (R) has stood firmly behind Vladimir Putin and his Church has spoken of the invasion of Ukraine as a \"holy war\"The allegations against Hilarion began in June 2024, from 23-year-old Japanese citizen George Suzuki, who began working for him after his arrival in Budapest.The former theology student accuses him of sexual misconduct as well as working for Russia's FSB intelligence agency.He runs his own YouTube channel, and has posted further allegations using video and audio clips recorded in Budapest.Some of these, Hilarion says, have been doctored. He told the BBC he would refute each in turn in court.Metropolitan Hilarion admits mistakes in his treatment of Suzuki, but denies sexual harassment as well as spying.These are difficult moments for a man who, during his 13 years as the Church's \"foreign minister\", engineered a rapprochement with the Catholic Church that led to a historic summit between Pope Francis and Patriarch Kirill in Cuba in 2016. It was the first meeting between the heads of the two Churches since the great schism of 1054.GREGORIO BORGIA/POOL/AFPIn February 2016, Pope Francis and Patriarch Kirill held the first meeting between two leaders of their Churches for a millennium Hilarion's case was given added urgency last week when the Czech government said it was considering imposing sanctions on him in response to the allegations against him.His position on Russia's war in Ukraine has not changed.\"Any war is a tragedy, and the Church is always with the suffering people. That's as much as I can say.\"Hilarion's supporters fear that Kremlin hardliners are now out to destroy him.\"Given the way Putin's regime operates, it would hardly be surprising if, in addition to his dramatic demotion in ecclesiastical terms, there had also been a determination to make sure that his reputation was damaged in whatever ways could be arranged,\" the former Archbishop of Canterbury, Rowan Williams, told the BBC.  \"The full facts remain unclear, but there is a Kremlin modus operandi that seems recognisable here.\"The BBC has been in contact with George Suzuki. He alleges that Hilarion began sexually harassing him soon after his arrival in Budapest.Hilarion denies harassment of any kind.According to him, in August 2023, his aide returned to Japan to visit his family, and returned to Budapest three weeks later \"a changed man\", tense, and unfriendly.Hilarion also says that he has information that Suzuki visited Moscow the same month.Around this time a new character, Veronica Suzuki, enters the story - his aide's grandmother, who had taken custody of George Suzuki as a child.She joined him in Budapest and stayed for weeks in luxury hotels, paid for by Hilarion.In January 2024, George Suzuki suddenly disappeared, then wrote to Hilarion from Japan, pleading illness and family problems.VASILY MAXIMOV/AFPMetropolitan Hilarion served for 13 years as the Russian Orthodox Church's head of foreign relations (file pic)Hilarion offered to send €2,000 (£1,760)  a month, then received an email from Veronica Suzuki, demanding €384,000 - to be paid into her account, in exchange for destroying \"evidence\" her grandson had collected.He reported her to the Hungarian police for extortion, then found that three expensive watches had been stolen, and cash worth in total €90,000 (£79,000).He told police, and on the basis of fingerprints, DNA and security camera footage, an international warrant was issued for George Suzuki's arrest.The stolen goods were later returned, but the former aide turned down Hilarion's offer of mediation to have the arrest warrant against him removed.In June 2024, Suzuki began accusing Hilarion of sexual harassment, ostentatious wealth, and most recently, collaboration with the FSB.In one video posted on YouTube, Hilarion can be seen getting into a bed where another figure is lying, apparently asleep. In another, Hilarion fires a pistol in a shooting range which George Suzuki alleges belongs to the FSB headquarters in Moscow.In an audio clip, Hilarion can be heard apparently warning his aide that things will go badly for him if he leaves his service and returns to Japan.In his BBC interview, Hilarion says that he has evidence that the video and audio clips have been doctored, but refuses to go further.\"My lawyers advised me not to comment publicly on any material, be it textual, visual or audio, released by him or taken by journalists from [George Suzuki's] collection, before they are examined by the court.\"\"My first mistake was that I allowed him to come to Hungary,\" Hilarion told the BBC. He also regrets agreeing to the family's \"financial demands\".Despite what he describes as his ordeal, Hilarion remains loyal to the Russian Orthodox church, and to Patriarch Kirill.He was investigated by the Holy Synod of the Russian Orthodox Church and last December he was retired from his position as head of the Budapest diocese and transferred to the Church in the Czech city of Karlovy Vary.But the Czech government's decision to consider imposing sanctions on him puts his future there in jeopardy and could force him to return to Russia.\"It is their liberty to decide who they want in the Czech Republic and who they don't want,\" Hilarion said. He would just like to talk to them before they do.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "A Kremlin target? Exiled Church figure Hilarion hits back at claims of spying",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/35cd/live/2df99320-bc03-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T00:32:23.000Z",
      "dateModified": "2025-11-10T00:32:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]